{
    "ESABINDIA.NS": {
        "short_name": "ESAB INDIA",
        "long_name": "ESAB India Limited",
        "summary": "ESAB India Limited manufactures and sells welding and cutting equipment in India. The company offers gas equipment; arc gouging and exothermic cutting; welding automation and robotics; ESAB digital solutions; filler metals; arc welding equipment; plasma cutting equipment; and cutting automation products, as well as PPE products and accessories, including helmets and head protection, gloves, clothes, and eye protection products. Its products are used in shipbuilding, petrochemical, construction, transport, offshore, energy, and general engineering industries, as well as repair and maintenance of steel, mills, cement, sugar industries, etc. The company sells its products under the Arcair, Exaton, GASARC, Stoody, TBI Industries, Thermal Dynamics, Tweco, and Victor brand names. It serves in Qatar, Bangladesh, Ecuador, Vietnam, Dubai, Indonesia, Srilanka, Malaysia, Australia, Thailand, the Kingdom of Saudi Arabia, the Philippines, Singapore, South Africa, Sweden, China, Switzerland, Peru, and the United States markets. The company was founded in 1987 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600058",
        "website": "http://www.esabindia.com",
        "full_time_employees": 755
    },
    "KENNAMET.NS": {
        "short_name": "KENNAMETAL INDIA L",
        "long_name": "Kennametal India Limited",
        "summary": "Kennametal India Limited, together with its subsidiary, manufactures and trades in hard metal products and machine tools in India, Europe, the United States, China, and internationally. It operates through two segments, Hard Metal Products and Machining Solutions Group. The company offers metalworking and metal cutting tools for milling, drilling, turning, and tooling system applications; products for surface and underground mining, such as drums, blocks, picks, and wear solutions; and drums and block systems, cutting teeth products, blades, wear protection products, track pads and tire-and-wheel assemblies, road rehabilitation products, foundation drilling cutting tools, and trenching products for construction applications. It also provides engineered components, such as cemented tungsten carbide products, cladding components, Stellite components, and Densalloy tungsten heavy alloys; and powdered materials and equipment, including tungsten, tungsten carbide, ready-to-press carbide grade, and thermal spray powders, as well as specialty alloys and services. In addition, the company offers tungsten and tungsten carbide wear components; and ceramics products. It serves manufactures, metalworking suppliers, machinery operators, and processors in the aerospace, earthworks, energy, transportation, general engineering, machine tool, and other industries under the Kennametal and Widia brand names. The company was founded in 1938 and is based in Bengaluru, India. Kennametal India Limited operates as a subsidiary of Meturit AG.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560073",
        "website": "http://www.kennametal.com",
        "full_time_employees": 756
    },
    "LAKPRE.NS": {
        "short_name": "LAKSHMI PRECISION",
        "long_name": "Lakshmi Precision Screws Limited",
        "summary": "Lakshmi Precision Screws Limited manufactures, sells, and trades in high tensile fasteners primarily in India. The company's products include bolts and screws, pins, nuts, and allen keys. Its products are used in various sectors, such as wind energy, oil and gas, locomotives, automobiles, agriculture equipment, defense, electronic and communication, construction, tool and die, machine building, and various other sectors. The company also exports its products primarily to the United States, Australia, Canada, Denmark, Dubai, France, Germany, Hong Kong, Indonesia, Japan, Malaysia, Singapore, South Africa, Switzerland, Sweden, etc. Lakshmi Precision Screws Limited was incorporated in 1968 and is based in Rohtak, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Rohtak",
        "zipcode": "124001",
        "website": "http://www.lpsindia.com",
        "full_time_employees": null
    },
    "NIBL.NS": {
        "short_name": "NRB INDUSTRIAL BEA",
        "long_name": "NRB Industrial Bearings Limited",
        "summary": "NRB Industrial Bearings Limited manufactures and sells ball and roller bearings for industrial applications in India. The company offers deep groove ball bearings, wide inner ring ball bearings and housed units, spherical and cylindrical roller bearings, bottom and needle roller bearings, and cam followers. It also operates as an agent for manufacturers to supply various types of bearings, including tapered roller bearings and linear guides. The company's products has applications in the factory automation, electrical, medical, renewable, power generation, oil and gas, food and beverage, paper and pulp, metal, mining and mineral processing, materials handling, machine tool, transmission, fluid machinery, and textile industries. It also exports its products. The company was incorporated in 2011 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400001",
        "website": "http://www.nrbindustrialbearings.com",
        "full_time_employees": 274
    },
    "RKFORGE.NS": {
        "short_name": "RAMKRISHNA FORGINS",
        "long_name": "Ramkrishna Forgings Limited",
        "summary": "Ramkrishna Forgings Limited manufactures and supplies open and closed die forgings of carbon and alloy steel, micro alloy steel, and stainless steel in India and internationally. The company offers crown wheels/ring gears; I beams, crankshafts, connecting rods, knuckles, diff cases, center wedges, steering arms, tie rod arms, pitman arms, stub axles, recondition taper stationary plates, spides/crosses, brake flanges, brackets, wheel hubs, yokes, front engine mounting arms, tooth products, hammer bars, track links, bearing caps, counterweights, and ring gear carriers; and pinions, front hubs, prop shafts, counter shafts, rear axle shafts, coupling flanges, engaging gears, CM gears, speed gears, and clutch collars. It also provides screw couplings, bolster suspensions, side frame keys, and draw gear assemblies. The company offers its products for various industries and sectors, including automotive, earth moving and mining, farm equipment, general engineering, railways, steel plants, and oil exploration, as well as for OEMs. Ramkrishna Forgings Limited was founded in 1981 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700017",
        "website": "http://www.ramkrishnaforgings.com",
        "full_time_employees": null
    },
    "STERTOOLS.NS": {
        "short_name": "STERLING TOOLS",
        "long_name": "Sterling Tools Limited",
        "summary": "Sterling Tools Limited manufactures and markets high tensile cold forged fasteners to original equipment manufacturers in India. The company offers standard, special, chassis, and engine fasteners for use in passenger vehicles, commercial vehicles, two wheelers, farm and construction equipment, and off-roadways. It also engages in leasing of immovable property; and manufacture and trading of motor control unit used in automobile industry. The company exports its products to Europe, the United States, South America, and the Middle East. Sterling Tools Limited was founded in 1979 and is based in Faridabad, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Faridabad",
        "zipcode": "121003",
        "website": "http://www.stlfasteners.com",
        "full_time_employees": 573
    },
    "TIIL.NS": {
        "short_name": "TECHNOCRAFT INDUST",
        "long_name": "Technocraft Industries (India) Limited",
        "summary": "Technocraft Industries (India) Limited engages in drum closures, scaffolding, yarn, fabric, and power businesses in India and internationally. It offers drum closures, including steel plated, stainless steel, and steel lacquer drum closures; nylon and poly propylene plugs; and capseals, canseals, insertion dies, and clamps. The company also provides tubes and scaffolding products, such as techring, techlok, techstage, telescopic steel props, steel planks, access frame, tubes, fittings, and accessories. In addition, it offers slab decking systems comprising slab strips, beams, and drops; wall form systems; infra formwork products for infrastructure projects, such as bridges, metros, etc.; lightweight formwork systems; and towers for transmission, telecommunication, solar, and infrastructure industries. Further, the company manufactures steel reinforced HDPE pipes; cotton ring spun raw-white yarns; carded and combed yarns for knitting and weaving; and compact, slub, organic, and BCI yarns, as well as garments for men, women, and kids. Additionally, it offers fabrics consisting of single jerseys plain and spandex/lycra; ribs with and without spandex/lycra; interlocks; piques; and two thread/three thread fleece, plaited and variegated structured fabrics, feeder and engineered stripes, etc., as well as engineering services. Technocraft Industries (India) Limited was founded in 1972 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.technocraftgroup.com",
        "full_time_employees": 1700
    },
    "WENDT.NS": {
        "short_name": "WENDT (INDIA)",
        "long_name": "Wendt (India) Limited",
        "summary": "Wendt (India) Limited, together with its subsidiaries, manufactures and sells super abrasives, high precision grinding, honing, special purpose machines, and high precision components in India and internationally. The company operates through two segment, Super Abrasives; and Machines, Accessories and Components. The company offers super abrasives, including resin bonds, metal bonds, hybrid wheels, vitrified bonds, electroplated bonds, rotary diamond dressers, hones, stationary diamond dressers, PCD/PCBN tools and wear parts, brazed products, and diamond segments and pellets. It also provides grinding, dressing, and honing machines; precision components, such as hardened and ground flanges; single point, natural point diamond, chisel type, grit impregnated, cluster type, multi-point indexable, blade type, and MCD-blade type diamond dressers; and resin bond diamond wheels, electroplated diamond mounted points, electroplated files, dressing stones, and diamond lapping compounds, as well as diamond disc for grinding and hacking concrete. In addition, the company offers machine refurbishing products, surface finishing solutions, flokings, and accessories and equipment; and finishing films and fine grinding wheels. Its products are used in industries, including refractory, ceramics, construction, glass and composite, cutting tools, steel, and textile and paper. The company also exports its products. Wendt (India) Limited was incorporated in 1980 and is headquartered in Hosur, India.",
        "currency": "INR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hosur",
        "zipcode": "635126",
        "website": "http://www.wendtindia.com",
        "full_time_employees": null
    }
}