{
    "256.F": {
        "short_name": "AZURE POWER GLOBAL DL-,01",
        "long_name": "Azure Power Global Limited",
        "summary": "Azure Power Global Limited, together with its subsidiaries, engages in the development, construction, ownership, operation, maintenance, and management of solar power plants in India. It generates solar energy based on long-term contracts with Indian government energy distribution companies, as well as other non-governmental energy distribution companies and commercial customers. As of March 31, 2020, the company operated 43 utility scale projects and various commercial rooftop projects with a combined rated capacity of 1,808 MW. Azure Power Global Limited was founded in 2008 and is based in New Delhi, India.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110017",
        "website": "http://www.azurepower.com",
        "full_time_employees": 605
    },
    "ADANIGREEN.NS": {
        "short_name": "ADANI GREEN ENERGY",
        "long_name": "Adani Green Energy Limited",
        "summary": "Adani Green Energy Limited generates and supplies renewable energy to central and state government entities, and government backed corporations in India. The company builds, owns, and operates power plants through renewable sources, such as solar, wind, and hybrid; and provides other ancillary services. It operates solar power plants with an operational capacity of 2,148 megawatts (MW); and wind power plants with an operational capacity of 397 MW. The company was incorporated in 2015 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "382421",
        "website": "http://www.adanigreenenergy.com",
        "full_time_employees": 723
    },
    "AZRE": {
        "short_name": "Azure Power Global Limited",
        "long_name": "Azure Power Global Limited",
        "summary": "Azure Power Global Limited, together with its subsidiaries, engages in the development, construction, ownership, operation, maintenance, and management of solar power plants in India. It generates solar energy based on long-term contracts with Indian government energy distribution companies, as well as other non-governmental energy distribution companies and commercial customers. As of March 31, 2020, the company operated 43 utility scale projects and various commercial rooftop projects with a combined rated capacity of 1,808 MW. Azure Power Global Limited was founded in 2008 and is based in New Delhi, India.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110017",
        "website": "http://www.azurepower.com",
        "full_time_employees": 605
    },
    "INDOWIND.NS": {
        "short_name": "INDOWIND ENERGY",
        "long_name": "Indowind Energy Limited",
        "summary": "Indowind Energy Limited operates as an IPP in the renewable energy sector in India. It engages in developing, setting up, operating, and maintaining wind farms primarily in Tamil Nadu and Karnataka. The company sells its wind power to corporate clients. It also provides project management and asset management services, as well as trades in and sells carbon credits (CERs) in Indian and international CER markets. The company was founded in 1995 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600034",
        "website": "http://www.indowind.com",
        "full_time_employees": 65
    },
    "KARMAENG.NS": {
        "short_name": "KARMA ENERGY LTD",
        "long_name": "Karma Energy Limited",
        "summary": "Karma Energy Limited engages in the generation of power from renewable energy sources in India. It develops and operates wind farms in the states of Andhra Pradesh, Maharashtra, and Tamil Nadu. The company also operates a 3.5 MW small hydropower ProjectKarma Energy Limited was incorporated in 2007 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400 001",
        "website": "http://www.karmaenergy.co",
        "full_time_employees": null
    },
    "NHPC.NS": {
        "short_name": "NHPC LTD",
        "long_name": "NHPC Limited",
        "summary": "NHPC Limited, together with its subsidiaries, generates and sells electricity in India. The company generates electricity through hydro, wind, and solar power stations. It owns and operates 24 power stations with an installed capacity of 7,072 megawatts. The company also offers consultancy services, such as survey and investigation, planning, design and engineering, construction, operation and maintenance, renovation, and modernization and uprating of hydro power projects, as well as other associated works to clients in public and private sectors. In addition, it provides project management and construction contract services, as well as trades in power. The company sells electricity to bulk customers that include electricity utilities owned by state governments/private distribution companies. The company was formerly known as National Hydroelectric Power Corporation Ltd. NHPC Limited was founded in 1975 and is based in Faridabad, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Faridabad",
        "zipcode": "121003",
        "website": "http://www.nhpcindia.com",
        "full_time_employees": 6131
    },
    "RTNPOWER.NS": {
        "short_name": "RATTANINDIA POWER",
        "long_name": "RattanIndia Power Limited",
        "summary": "RattanIndia Power Limited engages in power generation, distribution, trading and transmission, and other ancillary and related activities in India. It is involved in the development of 2 coal based thermal power projects with an aggregate capacity of 5,400 MW, including 2,700 MW project at Nandgaonpeth in Amravati district and 2,700 MW project at Sinnar in Nasik district, in the State of Maharashtra. The company was formerly known as Indiabulls Power Limited and changed its name to RattanIndia Power Limited in October 2014. RattanIndia Power Limited was founded in 2007 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110037",
        "website": "http://www.rattanindia.com",
        "full_time_employees": 553
    },
    "SJVN.NS": {
        "short_name": "SJVN LTD",
        "long_name": "SJVN Limited",
        "summary": "SJVN Limited, together with its subsidiaries, engages in the generation and sale of power in India, Nepal, and Bhutan. It operates the Nathpa Jhakri Hydro Power Station with a capacity of 1500 MW located in Shimla district, Himachal Pradesh, India; and the Rampur Hydro Power Station with a capacity of 412 MW in Kullu District, Himachal Pradesh. The company also operates the Khirvire Wind Power Plant with a capacity of 47.6 MW in Ahmednagar district, Maharashtra; the Charanka Solar Power Plant with a capacity of 5.6 MW in Patan district, Gujarat; the Sadla Wind Power Project with a capacity of 50 MW in Surendranagar district, Gujrat; and an 86 km cross border transmission line with a capacity of 400 kV from Muzaffarpur to Sursand. In addition, it provides consultancy services in the field of hydro electric projects, highway tunnels/railway tunnels, etc. The company was formerly known as Satluj Jal Vidyut Nigam Limited and changed its name to SJVN Limited in September 2009. SJVN Limited was incorporated in 1988 and is based in Shimla, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Shimla",
        "zipcode": "171006",
        "website": "http://www.sjvn.nic.in",
        "full_time_employees": 1564
    },
    "TORNTPOWER.NS": {
        "short_name": "TORRENT POWER",
        "long_name": "Torrent Power Limited",
        "summary": "Torrent Power Limited, an integrated power utility, engages in the generation, transmission, and distribution of electricity in the states of Gujarat, Maharashtra, Uttar Pradesh, and Karnataka in India. It owns thermal and renewable power plants with a generating capacity of approximately 3,879 MW. The company also distributes electricity to approximately 3 million customers in the cities of Ahmedabad, Gandhinagar, Surat, and Dahej SEZ covering an area of approximately 425 square kilometers, as well as operates as a franchisee for electricity distribution in the cities of Bhiwandi, Agra and Shil-Mumbra-Kalwa covering an area of approximately 1,007 square kilometers. In addition, it is also involved in the manufacture and supply of power cables. Torrent Power Limited was incorporated in 2004 and is based in Ahmedabad, India. Torrent Power Limited is a subsidiary of Torrent Investments Private Limited.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380015",
        "website": "http://www.torrentpower.com",
        "full_time_employees": null
    }
}