{
    "ADANITRANS.NS": {
        "short_name": "ADANI TRANSMISS.IN",
        "long_name": "Adani Transmission Limited",
        "summary": "Adani Transmission Limited, together with its subsidiaries, engages in the generation, transmission, and distribution of power in India. The company operates through Transmission, Trading, and Mumbai GTD Business segments. It builds, commissions, operates, and maintains electric power transmission systems; and distributes electricity in the suburbs of Mumbai. The company operates and maintains approximately 11,576 circuit kilometers of transmission lines with a total transformation capacity of 18,330 mega volt ampere in the states of Gujarat, Maharashtra, Rajasthan, Madhya Pradesh, Uttar Pradesh, Bihar, Jharkhand, Haryana, and Chhattisgarh. In addition, it engages in the trading of agri commodities. The company was incorporated in 2013 and is headquartered in Ahmedabad, India. Adani Transmission Limited is a subsidiary of S.B. Adani Family Trust.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "382421",
        "website": "http://www.adanitransmission.com",
        "market_cap": 1748667334656
    },
    "BVT.F": {
        "short_name": "RELIA.INF.GDR REGS/3 IR10",
        "long_name": "Reliance Infrastructure Limited",
        "summary": "Reliance Infrastructure Limited, an infrastructure company, engages in the generation, transmission, and distribution of electrical power to residential, industrial, commercial, and other customers in India. It operates through three segments: Power; Engineering and Construction; and Infrastructure. The company operates a 220 MW combined cycle power plant at Samalkot, a 48 MW combined cycle power plant at Mormugao, a 9.39 MW wind-farm at Chitradurga, and a 165 MW combined cycle power station at Kochi; distributes power in Delhi; and transmits power through its transmission networks in Himachal Pradesh, as well as trades in power. The company also provides integrated design, engineering, procurement, and project management services for coal-based thermal and gas-power projects, nuclear power projects, and metro rail and road projects; and development, operation, and maintenance of toll roads, metro rail transit systems, and airports. In addition, it is involved in the exploration and production of four coal bed methane blocks covering an area of 3,266 square kilometers in Madhya Pradesh, Andhra Pradesh, and Rajasthan; and an oil and gas block covering an area of 3,619 square kilometers in Mizoram. Further, the company engages in the manufacture of cement and defense systems; construction of smart city projects; provision of value added services in construction, erection, commissioning, and contracting areas; and real estate development and urban transport systems businesses. Reliance Infrastructure Limited was incorporated in 1929 and is based in Mumbai, India.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400001",
        "website": "http://www.rinfra.com",
        "market_cap": 146837856
    },
    "DPSCLTD.NS": {
        "short_name": "DPSC LIMITED",
        "long_name": "India Power Corporation Limited",
        "summary": "India Power Corporation Limited, together with its subsidiaries, generates and distributes electricity in India. The company operates 35.2 MW of wind assets in Gujarat and Karnataka; 2 MW of solar asset in West Bengal; and coal fired thermal power plants of 12 MW in Asansol, West Bengal, as well as 1000 MW in Nellore, Andhra Pradesh. It also has a distribution license of approximately 618 square kilometers in AsansolÂ\u0096Raniganj area of West Bengal. In addition, the company offers consultancy, operation, and maintenance services. It serves government utilities and hospitals, as well as industrial, commercial, and residential consumers. The company was formerly known as DPSC Limited and changed its name to India Power Corporation Limited in August 2013. India Power Corporation Limited was founded in 1919 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700091",
        "website": "http://www.indiapower.com",
        "market_cap": 16943945728
    },
    "ENERGYDEV.NS": {
        "short_name": "ENERGY DEV CO LTD",
        "long_name": "Energy Development Company Limited",
        "summary": "Energy Development Company Limited generates and sells electricity from water and wind in India. The company operates through three divisions: Generating, Contract, and Trading. The Generating division generates and sells bulk power to various electricity boards. It has 15 MW of renewable energy capacity and has 270 MW of hydroelectric projects at various stages of development. This division owns and operates 9 MW and 6 MW Harangi hydro-electric power plants in the district of Kodagu, as well as two wind projects of 1.5 MW each in the districts of Hassan and Chitradurga Karnataka; and a 7 MW Ullunkal hydroelectric power project and 15 MW Karikayam hydroelectric power project in the state of Kerala. This division also executes various hydroelectric projects in the state of Arunachal Pradesh. The Contract division develops energy and infrastructure projects for other developers. It offers engineering, consultancy, and project management services for hydroelectric power plants; engineering, procurement, and construction services; third party power plant operations and maintenance services; and rehabilitation, renovation, modernization, and uprating consultancy and services for ageing hydro power plants. This division is also involved in the cogeneration or the combined generation of heat and power from a single fuel source, such as bagasse. The Trading division trades in power equipment, metals, etc. Energy Development Company Limited was incorporated in 1995 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700020",
        "website": "http://www.edclgroup.com",
        "market_cap": 614325760
    },
    "GIPCL.NS": {
        "short_name": "GUJARAT IND POWER",
        "long_name": "Gujarat Industries Power Company Limited",
        "summary": "Gujarat Industries Power Company Limited generates and sells electricity primarily to power purchasing companies in India. The company generates power through gas, lignite, wind, and solar power plants with combined installed capacity of 1084.4 MW at Vadodara plant and Surat Lignite Power Plant. Gujarat Industries Power Company Limited was founded in 1985 and is based in Vadodara, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Vadodara",
        "zipcode": "391346",
        "website": "http://www.gipcl.com",
        "market_cap": 12946083840
    },
    "NBVENTURES.NS": {
        "short_name": "NAVA BHARAT VENTUR",
        "long_name": "Nava Bharat Ventures Limited",
        "summary": "Nava Bharat Ventures Limited engages in the ferro alloys, power, mining, and healthcare businesses in India, Zambia, China, Japan, and internationally. It generates and sells power using coal, biomass, and bagasse. The company operates 150 MW and 114 MW power plants in Paloncha, Telangana; 150 MW power plant in Kharagprasad, Odisha; 20 MW biomass power plant in Dharmavaram, Andhra Pradesh; 9 MW co-gen power plant in Samalkot, Andhra Pradesh; and 300 MW thermal power plant in Zambia. It also mines coal at Maamba in Southern province in Zambia, as well as provides operation and maintenance services for power plants. In addition, the company manufactures, markets, and exports alloys of iron, including manganese, silicon, chromium, etc. that are used in automotive, railways, and construction industries, as well as in the manufacture of stainless steel consumer goods. Further, it operates a medical clinic for the management of iron deficiency and the administration of intravenous iron in Singapore. Additionally, the company offers management services, including operational management of The Iron Suites Medical Centers, organization of medical events and congresses, disease awareness programs, and health-related corporate programs for the healthcare industry; and in-licensing services for pharmaceutical products. The company was founded in 1972 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500 034",
        "website": "http://www.nbventures.com",
        "market_cap": 16538854400
    },
    "NLCINDIA.NS": {
        "short_name": "NLC INDIA LTD",
        "long_name": "NLC India Limited",
        "summary": "NLC India Limited operates an energy company in India. It operates in two segments, Lignite Mining and Power Generation. The company is involved in the generation of power through thermal, wind, and solar photo voltaic power plants. It operates five thermal power stations with an aggregate installed capacity of 3240 MW; and 34 wind turbine generators with capacity of 1.50 MW each, as well as commissioned 440 MW solar photo voltaic power plant in Neyveli. The company also mines for lignite. It operates three open cast lignite mines in Neyveli, State of Tamil Nadu; and one open cast lignite mine in Barsingsar, State of Rajasthan with a total capacity of 30.60 MTPA, as well as coal excavation from Talabira II and III coal opencast mines at Odisha with a mining capacity of 20.0 MTPA. The company sells its raw lignite to small scale industries for use it as fuel in their production activities. NLC India Limited was formerly known as Neyveli Lignite Corporation Limited and changed its name to NLC India Limited in April 2016. The company was founded in 1956 and is based in Neyveli, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Neyveli",
        "zipcode": "607801",
        "website": "http://www.nlcindia.com",
        "market_cap": 89391710208
    },
    "OPG.L": {
        "short_name": "OPG POWER VENTURES PLC ORD 0.01",
        "long_name": "OPG Power Ventures Plc",
        "summary": "OPG Power Ventures Plc, together with its subsidiaries, develops, owns, operates, and maintains private sector power projects in India. It operates thermal and solar power plants. The company primarily sells electric power to public sector undertakings and heavy industrial companies. OPG Power Ventures Plc was incorporated in 2008 and is based in Chennai, India.",
        "currency": "GBp",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600032",
        "website": "http://www.opgpower.com",
        "market_cap": 61612856
    },
    "POWERGRID.NS": {
        "short_name": "POWER GRID CORP",
        "long_name": "Power Grid Corporation of India Limited",
        "summary": "Power Grid Corporation of India Limited, a central transmission utility, engages in the transmission of power in India. The company is involved in planning, executing, owing, operating, and maintaining high voltage transmission systems. As of March 31, 2010, it owned and operated 1,56,884 ckt kms of transmission lines, as well as 244 substations with transformation capacity of 4,00,269 MVA. The company also provides consultancy services, including system engineering and feasibility studies, environmental and social impact assessment, design and engineering, contract, project management and construction supervision, owner's and lender's engineer, and other services, as well as engineering, procurement, and asset management. Power Grid Corporation of India Limited offers its consultancy services to state owned utilities, private utilities, central public sector undertakings, and government departments in Afghanistan, Bangladesh, Bhutan, Congo, Ethiopia, Fiji, Nigeria, Nepal, Kazakhstan, Kenya, the Kyrgyz Republic, Myanmar, Pakistan, Senegal, Sri Lanka, Tajikistan, Tanzania, the United Arab Emirates, and Uzbekistan. In addition, it provides overhead optic fiber network services using optical ground wire on power transmission lines under the POWERTEL brand name. The company was formerly known as National Power Transmission Corporation Limited and changed its name to Power Grid Corporation of India Limited in October 1992. Power Grid Corporation of India Limited was founded in 1989 and is headquartered in Gurugram, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122001",
        "website": "http://www.powergridindia.com",
        "market_cap": 1288244953088
    },
    "RELINFRA.NS": {
        "short_name": "RELIANCE INFRASTRU",
        "long_name": "Reliance Infrastructure Limited",
        "summary": "Reliance Infrastructure Limited, an infrastructure company, engages in the generation, transmission, and distribution of electrical power to residential, industrial, commercial, and other customers in India. It operates through three segments: Power; Engineering and Construction; and Infrastructure. The company operates a 220 MW combined cycle power plant at Samalkot, a 48 MW combined cycle power plant at Mormugao, a 9.39 MW wind-farm at Chitradurga, and a 165 MW combined cycle power station at Kochi; distributes power in Delhi; and transmits power through its transmission networks in Himachal Pradesh, as well as trades in power. The company also provides integrated design, engineering, procurement, and project management services for coal-based thermal and gas-power projects, nuclear power projects, and metro rail and road projects; and development, operation, and maintenance of toll roads, metro rail transit systems, and airports. In addition, it is involved in the exploration and production of four coal bed methane blocks covering an area of 3,266 square kilometers in Madhya Pradesh, Andhra Pradesh, and Rajasthan; and an oil and gas block covering an area of 3,619 square kilometers in Mizoram. Further, the company engages in the manufacture of cement and defense systems; construction of smart city projects; provision of value added services in construction, erection, commissioning, and contracting areas; and real estate development and urban transport systems businesses. Reliance Infrastructure Limited was incorporated in 1929 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400001",
        "website": "http://www.rinfra.com",
        "market_cap": 22373165056
    }
}