{
  "AWHCL.NS": {
    "city": "Thane",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Waste Management",
    "long_name": "Antony Waste Handling Cell Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Antony Waste Hdg Cell Ltd",
    "state": null,
    "summary": "Antony Waste Handling Cell Limited engages in municipal solid waste (MSW) management business in India. It provides MSW services, including solid waste collection, transportation, processing, and disposal services primarily to municipalities. The company is also involved in the landfill construction and management sector; and waste management area. Antony Waste Handling Cell Limited was incorporated in 2001 and is based in Thane, India.",
    "website": "http://www.antony-waste.com",
    "zipcode": "400601"
  },
  "WABAG.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Waste Management",
    "long_name": "VA Tech Wabag Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "VA TECH WABAG LTD",
    "state": null,
    "summary": "VA Tech Wabag Limited, together with its subsidiaries, engages in the design, supply, installation, construction, and operational management of drinking water, waste and industrial water treatment, and desalination plants in India and internationally. It offers sewage treatment, drinking water treatment, effluent treatment, water reuse, sludge treatment, and desalination services for municipal and industrial users; and engineering, procurement, and construction services, as well as operation and maintenance services. The company was formerly known as Balcke Durr and Wabag Technologies Limited and changed its name to VA Tech Wabag Limited in April 2000. VA Tech Wabag Limited was incorporated in 1995 and is based in Chennai, India.",
    "website": "http://www.wabag.com",
    "zipcode": "600117"
  }
}
