{
  "000180.KS": {
    "city": "Busan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Lumber & Wood Production",
    "long_name": "Sungchang Enterprise Holdings Limited",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "SCEHoldings",
    "state": null,
    "summary": "Sungchang Enterprise Holdings Limited engages in the development of various plant species and forest restoration activities in South Korea. The company is also involved in the planting of trees, such as pine tree, as well as owns a botanical garden. In addition, it manufactures and sells a range of plywood products, including interior plywood for interior purposes; standard plywood for building frames, inner walls, and interiors; plywood for concrete casts, building exteriors, and exposed concrete construction; eco-friendly plywood for exterior applications; and custom plywood for automobile, ship, and flooring applications, as well as flooring products under the Lieu brand. Further, the company produces and sells particle boards, particle board materials, wood chips, and Bio-SRF; and engages in importing and selling wood pellet, and PKS, as well as sawdust and recycling activities. It owns and manages 8,140HA of fields. Sungchang Enterprise Holdings Limited was founded in 1916 and is headquartered in Busan, South Korea.",
    "website": "http://www.sce.co.kr",
    "zipcode": "49526"
  },
  "000320.KS": {
    "city": "Anyang",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "NOROO Holdings Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "NorooHoldings",
    "state": null,
    "summary": "NOROO Holdings Co., Ltd., together with its subsidiaries, operates as a general fine chemical company in South Korea. It produces industrial materials, including resins and coatings, such as paints and inks; and color chemicals used in automobiles and building interiors, as well as offers plastic products. The company was formerly known as DPI Holdings Co., Ltd. and changed its name to NOROO Holdings Co., Ltd. in March 2010. NOROO Holdings Co., Ltd. was founded in 1945 and is headquartered in Anyang, South Korea.",
    "website": "http://www.norooholdings.com",
    "zipcode": "139-77"
  },
  "000325.KS": {
    "city": "Anyang",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "NOROO Holdings Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "NorooHoldings(1P)",
    "state": null,
    "summary": "NOROO Holdings Co., Ltd., together with its subsidiaries, operates as a general fine chemical company in South Korea. It produces industrial materials, including resins and coatings, such as paints and inks; and color chemicals used in automobiles and building interiors, as well as offers plastic products. The company was formerly known as DPI Holdings Co., Ltd. and changed its name to NOROO Holdings Co., Ltd. in March 2010. NOROO Holdings Co., Ltd. was founded in 1945 and is headquartered in Anyang, South Korea.",
    "website": "http://www.norooholdings.com",
    "zipcode": "139-77"
  },
  "000390.KS": {
    "city": "Ansan-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "Samhwa Paints Industrial Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "SamhwaPaint",
    "state": null,
    "summary": "Samhwa Paints Industrial Co., Ltd. manufactures and sells various paints and synthetic resins in South Korea and internationally. The company offers architectural coatings, including emulsion, alkyd, acryl, fire retardant, antimildew, texture and multicolor, DIY, electric-wave absorbing, and other coatings, as well as putty, caulking, and sealant products. It also provides floor coatings, such as urethane, epoxy, water proofing, traffic, and polyurea coatings; wood coatings comprising nitrocellulose lacquer, polyurethane, U/V curing, and stain coatings; and industrial coatings that include heat resistance, polyurethane, acryl, fluorine, epoxy, baking, oil alkyd, U/V curing, and silicone acryl coatings. In addition, the company offers heavy-duty coatings that comprise shop primer, anti-corrosive primer, top, tank, ship, and other coatings; and unsaturated polyester resins, including laminate, corrosion, flame retardant, corrugated panel, pultrusion, SMC/BMC, marble, decorative casting, button, and gel coat resins. Further, it provides coil coatings, such as primer, backer, polyester, high polymer polyester, and plastisol coatings; automotive refinish coatings comprising clear, surfacer, putty, primer, and solid urethane coatings; can coatings; and super resins that include alkyd, modified alkyd, acrylic, polyester, amino, urethane, radiation curable, emulsion, water soluble, rosin modified maleic, epoxy ester, and polyamide resins. The company was formerly known as Dongwha Co., Ltd. and changed its name to Samhwa Paints Industrial Co., Ltd. in July 1964. Samhwa Paints Industrial Co., Ltd. was founded in 1946 and is headquartered in Ansan-si, South Korea.",
    "website": "http://www.samhwa.com",
    "zipcode": "425-110"
  },
  "000480.KS": {
    "city": "Gwangyang-si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Building Materials",
    "long_name": "Chosun Refractories Co.,Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "ChosunRefrctr",
    "state": null,
    "summary": "Chosun Refractories Co.,Ltd. manufactures and sells various refractory products in South Korea and internationally. The company offers alumina, fireclay, silicon carbide, acid-proof and heat-resistant, insulating fire, and magcarbon bricks; castable, gunning, plastic, ramming mix and induction furnace stamping, blast furnace runner, ladle and tundish, flame-gunning repair, and mortar refractory products, as well as casting blocks; slide gate valve systems; shroud and submerged nozzles, and long stoppers. It also provides refractories engineering services, such as design, construction, S/V, and supervision. In addition, supplies refractories for heavy chemical industries, including steel, iron, and cement manufacturers; and designs, manufactures, constructs, and A/S of furnaces for steel, iron, nonferrous metals, and petrochemical plants. The company was formerly known as Chosun refractories Chemical Industry Co., Ltd. and changed its name to Chosun Refractories Co.,Ltd. in April 1993. Chosun Refractories Co.,Ltd. was founded in 1947 and is headquartered in Gwangyang, South Korea.",
    "website": "http://www.chosunref.co.kr",
    "zipcode": null
  },
  "000670.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Other Industrial Metals & Mining",
    "long_name": "Young Poong Corporation",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "Youngpoong",
    "state": null,
    "summary": "Young Poong Corporation operates as a non-ferrous metal company in Korea. The company offers high purity electric zinc bars that are used in hot dip galvanizing, die casting alloys, electroplating and sacrificial anodes, photo engraving plates, zinc oxide, and zinc plates, as well as zinc jumbo bars for hot dip galvanizing; combination zinc bars for continuous and hot dip galvanizing; and zinc alloys for use in automobiles, electric devices, toys and leisure goods, home appliances, accessories, office equipment, and communication equipment, as well as zippers, industrial machinery and tools, builders' and domestic hardware, plastic and press molds, and gears. It also provides sulfuric acid for use in inorganic chemicals and metal refining, as well as steel, spinning and weaving, chemical and fertilizer, fiber, and paper manufacturing industries; copper sulfate for agrichemicals, reagents, electroplating, and metallurgy; electrolytic copper cathode for brass and bronze, plates, and rods and pipes; and indium for ITO target, soldering, and bonding. In addition, the company offers silver by-product, such as lead ingots, which are used in storage battery pastes, red lead and litharge, solders, radiation shields, pigment colors, bearings, and type metals; and silver granules that are used in photographic materials, sterling and electroplated wares, catalysts, and jewelry. Further, it provides gold for use in jewelry, dental and medical supplies, electroplated wares, medals and badges, gold wires, fountain-pens, and watches; and silver for solar cells, photographic materials, sterling wares, electrical contacts and conductors, electroplated wares, dental and medical supplies, catalysts, and commemorative objects, as well as jewelry, mirrors, and coins. The company was founded in 1949 and is headquartered in Seoul, South Korea.",
    "website": "http://www.ypzinc.co.kr",
    "zipcode": "06110"
  },
  "000760.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Rifa Co.,Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "RIFA",
    "state": null,
    "summary": "Rifa Co.,Ltd. engages in the wholesale and retail of dyestuffs and chemicals in South Korea. It offers reactive, disperse, acid, cationic, fluorescent, direct, leather, mordant, VAT, and Sulphur dyestuffs. The company also sells organic/inorganic chemicals, such as food additives and solvents. In addition, it is involved in the transportation activities; and rental of land and building. Rifa Co.,Ltd. was founded in 1950 and is headquartered in Seoul, South Korea.",
    "website": "http://www.rifa.co.kr",
    "zipcode": "04537"
  },
  "000860.KS": {
    "city": "Busan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "Kangnam Jevisco Co., Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "KANGNAM JEVISCO",
    "state": null,
    "summary": "Kangnam Jevisco Co., Ltd. manufactures and sells various paints and coatings worldwide. The company provides architectural paints, including interior and exterior paints, functional paints, floor coatings, and wood coatings; and industrial coatings, such as general industrial, powder, packaging, and coil coatings. It also offers marine coatings for sea vessels, and protective coatings for infrastructures, and power plants and transmission towers; and automotive refinish coatings, including clear coats, topcoats, base coats, primers/surfacers, putties, and thinners and additives. Kangnam Jevisco Co., Ltd. was founded in 1945 and is headquartered in Busan, South Korea.",
    "website": "http://www.jevisco.com",
    "zipcode": null
  },
  "000910.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Building Materials",
    "long_name": "Union Corporation",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "Union",
    "state": null,
    "summary": "Union Corporation engages in cement business in South Korea. The company offers building materials, such as white Portland cement, tile construction products, plastering and masonry products, flooring products, water proofing and repellents, and additives; refractory materials, including calcium aluminate cement and aggregates; and civil construction materials comprising repair and reinforcing products, and tunnel and underground products. It also provides filtering devices, including filter and screw press, unifilter, fiber filter, and nonpoint pollution reduction equipment; ozone systems; and recycles metals, such as vanadium and molybdenum. The company was formerly known as Union White Cement Co., Ltd. and changed its name to Union Corporation in July 1977. Union Corporation was founded in 1964 and is headquartered in Seoul, South Korea.",
    "website": "http://www.unioncement.com",
    "zipcode": "14532"
  },
  "001020.KS": {
    "city": "Gunsan-si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "PaperCorea Inc.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "PaperCorea",
    "state": null,
    "summary": "PaperCorea Inc. manufactures and sells paper products in South Korea and internationally. The paper manufacturing business include sack kraft papers, shopping bags, woven lamination paper, container board, and newsprint products, as well as specialty papers for PCB, saturating paper, saturating news, etc. It also engages in the real estate development comprising education, culture, art, shopping, and residence projects. The company was founded in 1944 and is headquartered in Gunsan-si, South Korea.",
    "website": "http://www.papercorea.co.kr",
    "zipcode": "54003"
  },
  "001080.KS": {
    "city": "Busan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "Manho Rope & Wire Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "ManhoRope&Wire",
    "state": null,
    "summary": "Manho Rope & Wire Co., Ltd. manufactures and sells various ropes and steel wires in Korea. The company offers hard drawn steel wires, piano wires, stainless steel wires, CD bars, PC steel wires and strands, HIBON products, and elevator ropes; galvanized steel wire strands and steel wires for ACSR; and wire ropes and fiber ropes. Its products also include spring washers, wave spring washers, and P.S-locker washers. The company also exports its products to approximately 80 countries worldwide. Manho Rope & Wire Co., Ltd. was founded in 1953 and is headquartered in Busan, South Korea.",
    "website": "http://www.manho.co.kr",
    "zipcode": null
  },
  "001340.KS": {
    "city": "Gunsan-si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "Paik Kwang Industrial Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "PaikkwangInd",
    "state": null,
    "summary": "Paik Kwang Industrial Co., Ltd. produces and sells chemical products in South Korea and internationally. It offers caustic soda, hydrochloric acid, liquid chlorine, sodium hypochlorite, nitrous oxide, nitrogen trifluoride, ultra-high purity chlorine and hydrogen, sorbitol, and maltitol and polyglycitol syrup. The company also operates high pressure gas container re-inspection and inner surface treatment facilities, as well as golf course, ice rink, fitness, and sauna and yoga facilities. Its products are used in chemical, purified wastewater treatment, papermaking, food processing, textile, petrochemical, and advanced materials industries. The company was formerly known as PAIK KWANG Chemical Co., Ltd. and changed its name to Paik Kwang Industrial Co., Ltd. in 1990. The company was founded in 1954 and is headquartered in Gunsan, South Korea.",
    "website": "http://www.pkic.co.kr",
    "zipcode": null
  },
  "001430.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "SeAH Besteel Corporation",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SBC",
    "state": null,
    "summary": "SeAH Besteel Corporation engages in the manufacture and sale of special steel, heavy forgings, automotive parts, and axels in South Korea. It offers special steel products for engine, transmission, and chassis, as well as spring and bearing steel for automobiles; steel for hydraulic breaker steel and rock drill machine steel, as well as tool steel/plastic mold steel for construction/industrial machinery; and steel for oil industry, wind power, and mooring chain for energy sector. The company also provides forged shell and tube sheet for power generation and petro-chemical plant; roll for steel mill facilities; shaft and crank throw for shipbuilding; and plastic mold steel from raw material to forging and machining. Further, it offers axles, including front driving differential assembly, rear axle assembly, and axle housing products; and tripod housing and outer race products. The company was founded in 1937 and is headquartered in Seoul, South Korea. SeAH Besteel Corporation is a subsidiary of SeAH Holdings Corporation.",
    "website": "http://www.seahbesteel.co.kr",
    "zipcode": "04036"
  },
  "001520.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Building Materials",
    "long_name": "Tongyang Inc.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "TONGYANG",
    "state": null,
    "summary": "Tongyang Inc. manufactures and sells ready-mixed concrete materials. It manufactures and distributes construction materials, such as ready-mixed concrete and aggregates; and distributes construction materials, including ready-mixed concrete, steel reinforcement, thermal insulation materials, tiles, sanitary wares, and plaster boards. The company is also involved in housing construction projects for apartments, high-end residential facilities, and town houses; civil engineering activities, including the development of traffic facilities, such as roads and harbors, as well as living facilities; construction of building, shopping complexes, and residences; and remodeling services for commercial real estate and apartments. In addition, it engages in designing, equipment supply, construction, and operation of cement plants, power plants, iron works, and chemical plants. The company was formerly known as Tongyang Major Corporation and changed its name to Tongyang Inc. in March 2011. Tongyang Inc. was founded in 1955 and is headquartered in Seoul, South Korea.",
    "website": "http://www.tongyanginc.co.kr",
    "zipcode": null
  },
  "001525.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Building Materials",
    "long_name": "Tongyang Inc.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "TONGYANG(1P)",
    "state": null,
    "summary": "Tongyang Inc. manufactures and sells ready-mixed concrete materials. It manufactures and distributes construction materials, such as ready-mixed concrete and aggregates; and distributes construction materials, including ready-mixed concrete, steel reinforcement, thermal insulation materials, tiles, sanitary wares, and plaster boards. The company is also involved in housing construction projects for apartments, high-end residential facilities, and town houses; civil engineering activities, including the development of traffic facilities, such as roads and harbors, as well as living facilities; construction of building, shopping complexes, and residences; and remodeling services for commercial real estate and apartments. In addition, it engages in designing, equipment supply, construction, and operation of cement plants, power plants, iron works, and chemical plants. The company was formerly known as Tongyang Major Corporation and changed its name to Tongyang Inc. in March 2011. Tongyang Inc. was founded in 1955 and is headquartered in Seoul, South Korea.",
    "website": "http://www.tongyanginc.co.kr",
    "zipcode": null
  },
  "001527.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Building Materials",
    "long_name": "Tongyang Inc.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "TONGYANG(2PB)",
    "state": null,
    "summary": "Tongyang Inc. manufactures and sells ready-mixed concrete materials. It manufactures and distributes construction materials, such as ready-mixed concrete and aggregates; and distributes construction materials, including ready-mixed concrete, steel reinforcement, thermal insulation materials, tiles, sanitary wares, and plaster boards. The company is also involved in housing construction projects for apartments, high-end residential facilities, and town houses; civil engineering activities, including the development of traffic facilities, such as roads and harbors, as well as living facilities; construction of building, shopping complexes, and residences; and remodeling services for commercial real estate and apartments. In addition, it engages in designing, equipment supply, construction, and operation of cement plants, power plants, iron works, and chemical plants. The company was formerly known as Tongyang Major Corporation and changed its name to Tongyang Inc. in March 2011. Tongyang Inc. was founded in 1955 and is headquartered in Seoul, South Korea.",
    "website": "http://www.tongyanginc.co.kr",
    "zipcode": null
  },
  "001529.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Building Materials",
    "long_name": "Tongyang Inc.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "TONGYANG(3PB)",
    "state": null,
    "summary": "Tongyang Inc. manufactures and sells ready-mixed concrete materials. It manufactures and distributes construction materials, such as ready-mixed concrete and aggregates; and distributes construction materials, including ready-mixed concrete, steel reinforcement, thermal insulation materials, tiles, sanitary wares, and plaster boards. The company is also involved in housing construction projects for apartments, high-end residential facilities, and town houses; civil engineering activities, including the development of traffic facilities, such as roads and harbors, as well as living facilities; construction of building, shopping complexes, and residences; and remodeling services for commercial real estate and apartments. In addition, it engages in designing, equipment supply, construction, and operation of cement plants, power plants, iron works, and chemical plants. The company was formerly known as Tongyang Major Corporation and changed its name to Tongyang Inc. in March 2011. Tongyang Inc. was founded in 1955 and is headquartered in Seoul, South Korea.",
    "website": "http://www.tongyanginc.co.kr",
    "zipcode": null
  },
  "001550.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Agricultural Inputs",
    "long_name": "Chobi Company Limited",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "Chobi",
    "state": null,
    "summary": "Chobi Company Limited produces and distributes composite fertilizers in South Korea. It offers bulk bending, slow release compound, fertigation and hydrophonix compound, and liquid fertilizers, as well as compound fertilizers for baseal and top dressing. The company was formerly known as Chosun Fertilizer Industry Co., Ltd. and changed its name to Chobi Company Limited in October 1990. Chobi Company Limited was founded in 1955 and is headquartered in Seoul, South Korea.",
    "website": "http://www.chobi.co.kr",
    "zipcode": "135-860"
  },
  "001570.KS": {
    "city": "Busan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Kumyang Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "Kumyang",
    "state": null,
    "summary": "Kumyang Co., Ltd. manufactures and supplies a range of chemical materials in South Korea and internationally. It offers chemical blowing agents for polyvinyl chloride, ethylene vinyl acetate, polyethylene or polypropylene, rubber, and other blowing agents; capsule blowing agents; blowing agent masterbatch products; anti-foaming agent masterbatch products; titanium dioxide products; flame retardants; and optimal solutions for synthetic resins, rubbers, and additives related to blowing agents. The company was formerly known as Gumbuk Chemical Industrial Company and changed its name to Kumyang Co., Ltd. in July 1978. The company was founded in 1955 and is headquartered in Busan, South Korea.",
    "website": "http://www.kyc.co.kr",
    "zipcode": null
  },
  "001780.KS": {
    "city": "Daejeon",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Aluminum",
    "long_name": "Aluko Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "ALUKO",
    "state": null,
    "summary": "Aluko Co., Ltd. manufactures and sells aluminum products in South Korea and internationally. It offers building materials, including regular/balcony windows, system windows, and curtain walls; and focus, inner, project, and fix and slide windows, as well as sliding and turning doors. The company also engages in designing, manufacturing, and on-site assembling of various form materials for the field structures; and provides curtain walls, such as unit, stick, and panel systems. In addition, it offers CVVT rotor vanes, ABS housing raw, bumper back beams, seat frames, side sills, aluminum bus frames, electric motorcycle frames, and MTB frames for automotive applications; LNG tank structures; railway frames; and industrial materials, such as aluminum palettes and industrial extruded materials. Further, the company provides top chassis and edge bars for display fields; components of electric and electronic/communication products, and airplanes; and industrial materials, such as solar frames. Aluko Co., Ltd. was founded in 1956 and is headquartered in Daejeon, South Korea.",
    "website": "http://www.alusash.co.kr",
    "zipcode": null
  },
  "001940.KS": {
    "city": "Changwon-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "KISCO Holdings Corp.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "KISCO Holdings",
    "state": null,
    "summary": "KISCO Holdings Corp., through its subsidiaries, develops, produces, and sells steel products primarily in South Korea. It offers reinforcing bars, wire ropes, strands, and harbor loading and unloading products; and hard drawn steel wires. The company was founded in 1957 and is headquartered in Changwon-si, South Korea.",
    "website": "http://www.kiscoholdings.co.kr/holdings",
    "zipcode": null
  },
  "002100.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Agricultural Inputs",
    "long_name": "Kyung Nong Corporation",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "Kyungnong",
    "state": null,
    "summary": "Kyung Nong Corporation manufactures and sells agricultural chemicals in Korea. The company provides various solutions for the farming industry, such as seeds, fertilizers, irrigation, natural insects, eco-friendly products, and freshness maintenance. Kyung Nong Corporation was founded in 1957 and is headquartered in Seoul, South Korea.",
    "website": "http://www.knco.co.kr",
    "zipcode": "06627"
  },
  "002220.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "Hanil Iron & Steel Co., Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "HanilIron&Stl",
    "state": null,
    "summary": "Hanil Iron & Steel Co., Ltd manufactures and sells steel products in South Korea. The company offers steel plates and pipes, section steels, and others; and construction materials, as well as hot-rolled products used in automobiles, marine machinery, construction, and boilers and structures. It also engages in warehousing; marine freight transport; and construction and civil engineering equipment rental and sales businesses. The company was founded in 1957 and is headquartered in Seoul, South Korea.",
    "website": "http://www.hanilsteel.co.kr",
    "zipcode": null
  },
  "002240.KS": {
    "city": "Busan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "Kiswire Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "KISWire",
    "state": null,
    "summary": "Kiswire Ltd. engages in the manufacture and sale of steel wires worldwide. The company provides oil-tempered wires for engine valve, clutch, pump and generator, air compression equipment, auto suspension, shutter, shock absorber, industrial machine, and garage door springs; and spring torsion bars, screens, hoods, mines, etc., as well as flat and shaped wire for die, wave, regulator, and seat return springs, and snap and piston rings, etc. It also provides hard drawn steel wires for making springs for general, machinery, agriculture, and other applications; music wires for piano and guitar strings, etc.; piano wires to make springs for precision machinery, electronic communication equipment, automobiles, etc.; and silk wires for automotive oil seals, precision machinery, electric appliances, and ball pens. In addition, the company offers bead wires and steel cords for tires; hose wires; saw wires; galvanized PC wires and strands for cabled stayed bridges, as well as galvanized wires for suspension bridges; galvanized steel wires and strands for power transmission industries; PC wires and strands for industries, bridges, buildings, anchors, railway sleepers, panels, and concrete pipes; and unbonded PC wires and strands for earth and rock anchors, PC bridges, retaining walls and dams, building slabs, etc. Further, it provides cross and parallel laid, compacted/swaged, non-rotating, elevator, suspension bridge wire ropes, as well as hyrope, Neptune & N2 hyrope, Alumar, and control cable, micro cable, and GAC products. Additionally, the company offers superconductive wires and superconductive composite wires, superconductive precursor, and Cr coatings for energy environment, biomedical, and aerospace and transportation industries; superconductive magnets for biomedical, and basic science and physics applications; and superconductive acceleration modules and measuring instruments. Kiswire Ltd. was founded in 1945 and is headquartered in Busan, South Korea.",
    "website": "http://www.kiswire.com",
    "zipcode": "48212"
  },
  "002760.KS": {
    "city": "Hwaseong",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "Bolak Company Limited",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "Bolak",
    "state": null,
    "summary": "Bolak Company Limited manufactures and sells food additives, food ingredients, pharmaceutical raw materials, functional materials, and cosmetic ingredients in South Korea and internationally. The company offers confectionery, beverage, and dairy flavoring products, as well as herbal flavoring and seasoning flavoring agents; active pharmaceutical ingredients, such as dry extract powders, viscous extracts, fluid extracts, tinctures, natural paclitaxel, docetaxel trihydrates, and Ca-CMC; functional materials, including green tea extracts, soy isoflavones, and ginseng extracts; and food coloring products. It also provides gum base products; cosmetic ingredients derived from natural materials comprising amentoflavones, aloes extracts, gilgyeong extracts, yellowish natural concentrated extracts, and magnolia extracts; fragrances for use in perfumes, cosmetics, hair products, daily supplies, toilet soaps, candles, and industrial products; and other products, such as sweeteners, surfactants, whitening agents, preservatives, antioxidants, abrasives, thickening agents, thickeners, caffeine, and baking powder. Bolak Company Limited was founded in 1959 and is headquartered in Hwaseong, South Korea.",
    "website": "http://www.bolak.co.kr",
    "zipcode": "720-37"
  },
  "002840.KS": {
    "city": "Anyang-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Miwon Commercial Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "MiwonComcl",
    "state": null,
    "summary": "Miwon Commercial Co., Ltd. manufactures and markets various chemical products in South Korea and internationally. The company offers personal care ingredients, including anionic, cationic, nonionic, and amphoteric surfactants; hair fixative and conditioning polymers; styling resins; household surfactants, plasticizers, and UV stabilizers; and cosmeceutical active ingredients. It also provides electronic chemicals, such as photo active compounds for micro-patterning of semiconductor circuits and thin film transistors in LCDs; polymer acryl binders and novolak resins for use in LCD and plasma displays, and positive photoresist for LCDs and semiconductors; and functional chemicals and additives for use in positive and negative photoresist for LCD, as well as in process chemicals, such as strippers. In addition, the company offers functional resins used as raw materials for PCBs, components of electronic equipment, materials for high-functional polycarbonate, and high refractive monomers used in manufacturing optical films for displays. Further, it provides antioxidants, including amine, phenol, phosphorus, and sulfur, as well as UV stabilizers that include benzophenone, benzotriazole, nickel quenchers, and HALS; and thiourethane lens monomers. Miwon Commercial Co., Ltd. was founded in 1959 and is headquartered in Anyang, South Korea.",
    "website": "http://www.mwc.co.kr",
    "zipcode": "13967"
  },
  "003030.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "SeAH Steel Holdings Corporation",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "SeAH Steel Holdings",
    "state": null,
    "summary": "SeAH Steel Holdings Corporation manufactures and sells steel products in South Korea, the United States, Japan, China, Vietnam, the United Arab Emirates, Italy, and Indonesia. It offers carbon steel pipes, stainless steel pipes, titanium tubes, and galvanized color steel sheets. The company was founded in 1960 and is headquartered in Seoul, South Korea.",
    "website": "http://www.seahsteel.co.kr",
    "zipcode": null
  },
  "003300.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Building Materials",
    "long_name": "Hanil Holdings Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HANILHOLDINGS",
    "state": null,
    "summary": "Hanil Holdings Co., Ltd. manufactures and sells construction materials in South Korea. The company provides cement; concrete admixture and organic add-ons for concrete; and cement paving, bulk, remitar, and remicon products. It also offers solutions, such as SAP ERP; and security solutions and security consulting services, as well as distributes IT products and systems. In addition, the company operates theme parks and nature-accommodating activity farms; trades in various resources products, such as coal, oil, and natural gas, as well as machinery and components. Further, it is involved in the logistics business, including freight transport and loading. The company was founded in 1961 and is headquartered in Seoul, South Korea.",
    "website": "http://www.hanil.com",
    "zipcode": "06252"
  },
  "003410.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Building Materials",
    "long_name": "SsangYong C&E Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SSANGYONGCNE",
    "state": null,
    "summary": "SsangYong C&E Co., Ltd. engages in the production and sale of cement and clinker products in South Korea. The company offers Portland, blended, and specialty cement, as well as mortar and other related products, such as non-shrinkage mortar, resistance acid mortar, and expansion agents for use in architectural and civil engineering works. It is also involved in the waste recycling and other environment-related business; sale of petroleum products. In addition, the company engages in the mining and sale limestone; maritime transportation and unloading of cement, krinka, etc.; and leasing of office and real estate. The company also exports its products to the United States, Japan, Africa, and the Middle East. The company was formerly known as Ssangyong Cement Industrial Co., Ltd. and changed its name to SsangYong C&E Co., Ltd. in March 2021. SsangYong C&E Co., Ltd. was founded in 1962 and is headquartered in Seoul, South Korea. SsangYong C&E Co., Ltd. is a subsidiary of Hahn & Co. Cement Holdings Limited.",
    "website": "http://www.ssangyongcne.co.kr",
    "zipcode": "04555"
  },
  "003670.KS": {
    "city": "Pohang",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Building Materials",
    "long_name": "Posco Chemical Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "POSCO CHEMICAL",
    "state": null,
    "summary": "Posco Chemical Co., Ltd. engages in the refractory, furnace construction/maintenance, lime, environmental, chemicals and carbon materials, and secondary battery anode materials businesses. It manufactures and sells various shaped refractories, such as magnesia carbon, magnesia, chrome-magnesia, spinel, alumina, fire clay, and insulating fire bricks; unshaped refractories comprising spray materials, stamp mass products, tundish coating materials, mortar and miscellaneous products, and insulating and special castables; and magnesia clinker. The company also builds, installs, and maintains steel mill furnaces; and designs, produces, constructs, and engineers various industrial furnaces, as well as offers refractory installation/repair services. In addition, it provides burned lime for steelmaking, chemical, construction material, soil stabilization, and disinfectant applications; general chemicals and carbon materials; and cathode and anode materials for lithium-ion batteries. The company was formerly known as Posco Chemtech Company Ltd. and changed its name to Posco Chemical Co., Ltd. in March 2019. The company was founded in 1963 and is headquartered in Pohang, South Korea.",
    "website": "http://www.poscochemical.com",
    "zipcode": null
  },
  "004000.KS": {
    "city": "Ulsan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "LOTTE Fine Chemical Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "LOTTE Fine Chem",
    "state": null,
    "summary": "LOTTE Fine Chemical Co., Ltd. manufactures and sells chemical products in Korea. It offers cellulose relatives, including MECELLOSE, hydroxyethyl cellulose, AnyCoat-C (hypromellose), and AnyCoat-P (hypromellose phthalate) for use in various fields, such as construction, cement extrusion, ceramic extrusion, paint, medicine, and household items. The company also provides epichlorohydrin, caustic soda, methyl and methylene chloride, chloroform, sodium hypochlorite, methaclean, hydrochloric acid, and PTAC for use in architecture, textiles, and resins industries. In addition, it offers general chemicals, which include EUROX, ammonia, ammonium hydroxide, monomethyl amine, dimethylamine, trimethylamine, and trimethylamine-HCl; tetramethyl ammonium hydroxide, a material for semiconductor; and polymerized toners for color laser printers. The company was formerly known as SAMSUNG Fine Chemicals Co., Ltd. changed its name to LOTTE Fine Chemical Co., Ltd. in 2016. LOTTE Fine Chemical Co., Ltd. was founded in 1964 and is headquartered in Ulsan, South Korea.",
    "website": "http://www.lottefinechem.com",
    "zipcode": "680-090"
  },
  "004020.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "Hyundai Steel Company",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "HYUNDAI STEEL",
    "state": null,
    "summary": "Hyundai Steel Company manufactures and sells steel and other industrial metal products in South Korea, Asia, the United States, and Europe. The company offers hot and cold rolled steel sheets, heavy plates, ERW pipes, rebars, H-sections, heavy machinery, special steel bars, wire rods, tailor welded blanks, and hydroforming and hot stamping products for automobile, shipbuilding, and construction industries. It also provides angle, channel, I beam, steel sheet pile, and railway rail sections; ingot for forging; rolling, steel plate, and rod-type steel rolls; and cold rolled stainless steel sheets for construction, home electronics and kitchen, and automotive industries, as well as semi-finished goods, by-products, and other products. The company was formerly known as INI Steel Company and changed its name to Hyundai Steel Company in March 2006. Hyundai Steel Company was founded in 1953 and is headquartered in Seoul, South Korea.",
    "website": "http://www.hyundai-steel.com",
    "zipcode": null
  },
  "004150.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Hansol Holdings Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "HANSOL HOLDINGS",
    "state": null,
    "summary": "Hansol Holdings Co., Ltd. engages in the paper material and business solution businesses in South Korea. The company offers corrugated container boards, including liner boards, test liner boards, and corrugated medium papers; interior materials for flooring, wall, door, molding, and sheets applications; furniture components, such as MDF and processed boards; and overseas afforestation and renewable energy services. It provides engineering, purchasing, procurement, construction, and O&M services in the areas of incineration, power plant, and complex environment plant; management advice and consultation services; electronics power module, wireless charging, solar module and generation, LED material, and mobile phone parts and EMS products; and IT chemicals, fine chemicals, and eco-friendly chemicals. In addition, the company engages in the sea and air logistics, container and truck transportations, and W&D business; and tributary distribution, IT services, etc. Hansol Holdings Co., Ltd. was founded in 1965 and is headquartered in Seoul, South Korea.",
    "website": "http://www.hansol.com",
    "zipcode": null
  },
  "004430.KS": {
    "city": "Ulsan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "Songwon Industrial Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SongwonInd",
    "state": null,
    "summary": "Songwon Industrial Co., Ltd., together with its subsidiaries, develops, manufactures, and supplies specialty chemicals in South Korea and internationally. The company's products include polymer stabilizers, such as phenolic and phosphite antioxidants, thioester and aminic antioxidants, binary blends, tailor-made solutions, hindered amine light stabilizers, UV absorbers and hydroxybenzoates, high melter and low melter blends, nucleator and clarifier blends, and highly loaded UV blends, as well as blends comprising liquid components. It also provides a range of phenolic, aminic, phosphite, and thioester antioxidants for fuels and lubricants, primarily in liquid form, as well as fuel additives as stabilizers; tin intermediates; PVC stabilizers and plasticizers that include one pack systems for PVC stabilization, mixed metal stabilizers, metal soap stabilizers, organo-tin stabilizers, auxiliary stabilizers and lubricants, and plasticizers; and specialty polymers, which comprise polyester diols, thermosetting and/or thermoplastic polyurethanes, thermoplastic polyurethanes, and super absorbent polymers. In addition, the company offers specialty chemicals for fast-moving industries, including electronics, as well as coating additives and functional monomers for various applications. Songwon Industrial Co., Ltd. sells its products under the SONGCAT, SONGSTAR, SONGXTEND, SONGNOX, SONGSTAB, SONGSTOMER, SONGCIZER, HI-THANE, SONGCURE, SONGSORB, and HI-SWELL brands. The company offers its solutions for use in the adhesive, agriculture, automotive, building and construction, coating, durable and consumer good, electrical and electronic, fuel and lubricant, packaging, textile and fiber, and wire and cable industries. Songwon Industrial Co., Ltd. was founded in 1965 and is headquartered in Ulsan, South Korea.",
    "website": "http://www.songwon.com",
    "zipcode": "44781"
  },
  "004440.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Building Materials",
    "long_name": "Samil C&S Co.,Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "SAMIL C&S",
    "state": null,
    "summary": "Samil C&S Co.,Ltd engages in the production of concrete pile and steel in South Korea. It offers PHC, high strength, large-diameter, and composite piles; and produces and installs steel structures, including steel bridges, SB composite girders, sluice, shipbuilding blocks, and wind equipment. The company was formerly known as Daelim C&S Co. Ltd. and changed its name to Samil C&S Co.,Ltd in September 2020. The company was founded in 1962 and is headquartered in Seoul, South Korea. As of August 31, 2020, Samil C&S Co.,Ltd operates as a subsidiary of Samil Ecostec Co.,Ltd.",
    "website": "http://www.daelimcns.co.kr",
    "zipcode": "04539"
  },
  "004540.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "KleanNara Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "KleanNara",
    "state": null,
    "summary": "KleanNara Co., Ltd. manufactures and sells paper products in South Korea. The company offers rolls, cosmetic tissues, kitchen towels, wet wipes, sanitary pads, diapers for babies and adults, jumbo rolls, hand towels, and napkins. It also provides hand sanitizer gels; industrial packaging papers for pharmaceuticals, cosmetics, household items, confectionery, and stationery; food packing papers; and special papers for transportation of refrigerated/frozen goods and heavy containers. The company also exports its products to approximately 40 countries under the White Horse and Best Coat brands. KleanNara Co., Ltd. was founded in 1966 and is headquartered in Seoul, South Korea.",
    "website": "http://www.kleannara.co.kr",
    "zipcode": null
  },
  "004545.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "KleanNara Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "KleanNara(1P)",
    "state": null,
    "summary": "KleanNara Co., Ltd. manufactures and sells paper products in South Korea. The company offers rolls, cosmetic tissues, kitchen towels, wet wipes, sanitary pads, diapers for babies and adults, jumbo rolls, hand towels, and napkins. It also provides hand sanitizer gels; industrial packaging papers for pharmaceuticals, cosmetics, household items, confectionery, and stationery; food packing papers; and special papers for transportation of refrigerated/frozen goods and heavy containers. The company also exports its products to approximately 40 countries under the White Horse and Best Coat brands. KleanNara Co., Ltd. was founded in 1966 and is headquartered in Seoul, South Korea.",
    "website": "http://www.kleannara.co.kr",
    "zipcode": null
  },
  "004565.KS": {
    "city": "Changwon-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "Hyundai Bng Steel Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "HYUNDAI BNG STEEL(1P)",
    "state": null,
    "summary": "Hyundai Bng Steel Co., Ltd. manufactures and sells stainless steel products and automobile parts in South Korea. The company offers stainless cold rolled steel sheets; and iron/aluminum precision sand casting parts for automobiles. It serves automotive, construction, IT, and electronics industries. The company was formerly known as BNG Steel Co., Ltd. and changed its name to Hyundai Bng Steel Co., Ltd. in March 2011. Hyundai Bng Steel Co., Ltd. was founded in 1966 and is headquartered in Changwon, South Korea.",
    "website": "http://www.hyundai-bngsteel.com",
    "zipcode": "51707"
  },
  "004870.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Building Materials",
    "long_name": "Tway Holdings Incorporation",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "T'way Holdings",
    "state": null,
    "summary": "Tway Holdings Incorporation manufactures and sells construction materials, ready-mixed concrete and piles, aggregates, and brick blocks. The company also purchases, refurbishes, sells, and distributes used semiconductor equipment; produces and sells in-flight meals, and in-flight and travel goods; and manufactures and distributes semiconductors and other electronic components, such as IoT modules, Wi-Fi modules, and memory ICs, as well as distributes general parts used in corporate computers, personal PCs, and gaming computers. In addition, it provides consignment and agency services related to aviation; and semiconductor packaging service. The company was formerly known as pocketgamez Inc. and changed its name to Tway Holdings Incorporation in April 2013. Tway Holdings Incorporation was founded in 1945 and is headquartered in Seoul, South Korea. Tway Holdings Incorporation is a subsidiary of YeaRimDang Publishing Co., Ltd.",
    "website": "http://www.twayholdings.com",
    "zipcode": null
  },
  "004910.KS": {
    "city": "Busan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "Chokwang Paint Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "ChokwangPaint",
    "state": null,
    "summary": "Chokwang Paint Co., Ltd. manufactures and sells paints and chemicals in South Korea and internationally. It offers architectural, floor and waterproofing, heavy duty, industrial, wood, plastic, and UV curing paints; powder coatings, adhesives, electronic materials, and car maintenance products; and energy saving products. The company was founded in 1947 and is headquartered in Busan, South Korea.",
    "website": "http://www.chokwangpaint.co.kr",
    "zipcode": "46909"
  },
  "004980.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Building Materials",
    "long_name": "Sungshin Cement Co., Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "SungshinCement",
    "state": null,
    "summary": "Sungshin Cement Co., Ltd manufactures and sells cement and ready mixed concrete products in South Korea and internationally. The company was formerly known as Sungshin Cement Manufacturing Co., Ltd. Sungshin Cement Co., Ltd was founded in 1967 and is headquartered in Seoul, South Korea.",
    "website": "http://www.sungshincement.co.kr",
    "zipcode": null
  },
  "004985.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Building Materials",
    "long_name": "Sungshin Cement Co., Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "SungshinCement(1P)",
    "state": null,
    "summary": "Sungshin Cement Co., Ltd manufactures and sells cement and ready mixed concrete products in South Korea and internationally. The company was formerly known as Sungshin Cement Manufacturing Co., Ltd. Sungshin Cement Co., Ltd was founded in 1967 and is headquartered in Seoul, South Korea.",
    "website": "http://www.sungshincement.co.kr",
    "zipcode": null
  },
  "005010.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "Husteel Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "HUSTEEL",
    "state": null,
    "summary": "Husteel Co., Ltd. manufactures and sells various steel pipe products. The company offers pipes for general purpose; E.R.W. steel boilers and superheater tubes; E.R.W. heat-exchangers and condenser tubes; steel pipe piles; plain end steel tubes for welding or screwing; steel tubes for structural purpose; steel water-well pipes; steel pipes for fire protection use; line pipes; casings and tubings; rigid steel conduits; electrical rigid metal conduits; and steel tubes. It also provides steel pipes for pressure service, ordinary piping, boiler and heat exchanger, and general structural purpose; steel square pipes for general structural purpose; cold formed welded structural hollow section; welded steel tubes for pressure purposes; and carbon steel pipes for fuel gas piping. The company was formerly known as SHINHO STEEL Co., Ltd. and changed its name to Husteel Co., Ltd. in March 2002. Husteel Co., Ltd. was founded in 1967 and is headquartered in Seoul, South Korea.",
    "website": "http://www.husteel.com",
    "zipcode": "06179"
  },
  "005490.KS": {
    "city": "Pohang",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "POSCO",
    "market": "kr_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "POSCO",
    "state": null,
    "summary": "POSCO, together with its subsidiaries, manufactures and sells steel rolled products and plates in South Korea and internationally. It operates through four segments: Steel, Construction, Trading, and Others. The company offers hot and cold rolled steel, stainless steel, plates, wire rods, and silicon steel sheets. It also plans, designs, and constructs industrial plants, civil engineering projects, and commercial and residential buildings; exports and imports steel products and raw materials; and generates electricity; produces gas and refuse derived fuel, as well as provides network and system integration, and logistics services. In addition, the company is involved in the engineering and construction; computer hardware and software distribution; economic research and consulting; business facility maintenance; architecture and consulting; investment in venture, energy, and bio tech industries; electronic commerce; intellectual property services and consulting; refractories and quicklime manufacturing and sales; transporting and warehousing; real estate development, rental, sale, and management; house and train manufacturing and management; and education and real estate business. Further, it engages in the resource development; mine development; business facility maintenance; fuel cell; iron ore and coal sales; and cargo handling business, as well as operates housing business agency. Additionally, the company manufactures and sells coated, and anode material. It also engages in loading and unloading; IT service and DVR; electric control engineering; forest resources development; refractory materials sales and furnace maintenance; rice processing; grain sales; packing materials manufacturing; and social enterprise businesses. POSCO was incorporated in 1968 and is headquartered in Pohang, South Korea.",
    "website": "http://www.posco.com",
    "zipcode": null
  },
  "005810.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Copper",
    "long_name": "Poongsan Holdings Corporation",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "POONGSAN HOLDINGS",
    "state": null,
    "summary": "Poongsan Holdings Corporation manufactures and sells copper and nonferrous metal products worldwide. The company offers copper, brozen, bronze alloyed, magnetic, and copper alloyed powders; nickel-based brazing alloys; nano, coated, aluminum, tin, and copper silver powders; and inspection apparatus. It also provides industrial equipment and special tools, such as rolling mill, rolling equipment, and steel pipe equipment; defense industry, civilian industry, and power plant equipment; and automobile molds for automobile transmission. Poongsan Holdings Corporation was founded in 1968 and is headquartered in Seoul, South Korea.",
    "website": "http://www.poongsanhc.co.kr",
    "zipcode": "120-837"
  },
  "006060.KS": {
    "city": "Busan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "HWASEUNG Industries Co.,Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HSInd",
    "state": null,
    "summary": "Hwaseung Industries Co.,Ltd. engages in the shoes and precision chemicals businesses in South Korea and internationally. The company offers BOPP, PET, and, air quality films; sheets and plates; and synthetic resins and adhesives, including shoe adhesives, industrial adhesives, automotive coatings, and polyurethane resins. It also trades in clothing, bedding, and other products. The company was founded in 1969 and is headquartered in Busan, South Korea.",
    "website": "http://www.hsi.co.kr",
    "zipcode": null
  },
  "006380.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Capro Corporation",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "CAPRO",
    "state": null,
    "summary": "Capro Corporation manufactures and sells caprolactam and ammonium sulfate fertilizers in South Korea. It offers caprolactam for use as a raw material in nylon fibers used in clothing, tire cords, fishing nets, carpets, and nylon resins, as well as for use in manufacturing mechanical parts and engineering plastics. The company also provides ammonium sulfate fertilizer for use as a raw material for mixed and compound fertilizers, as well as for use in artificial silk and cellophane industries, for manufacturing ammonia compounds/various ammonium salts/potash alum/gypsum boards/light bulbs/synthetic resins/medicines, for culturing enzymes, and for leather tanning. In addition, it offers ammonium nitrate and sulfate fertilizers; and methylethylketoxime for use as a construction silicon additive, as well as an additive for preventing wet-paint surface cohesion. The company was formerly known as Korea Caprolactam Co., Ltd. and changed its name to Capro Corporation in February 2001. Capro Corporation was founded in 1969 and is headquartered in Seoul, South Korea.",
    "website": "http://www.hcccapro.co.kr",
    "zipcode": "04539"
  },
  "006390.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Building Materials",
    "long_name": "Hanil Hyundai Cement Co., Ltd",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HANIL HYUNDAI CEMENT",
    "state": null,
    "summary": "Hanil Hyundai Cement Co., Ltd researches, develops, manufactures, and sells cement in South Korea. It provides various types of Portland cement, such as ordinary, thermal, crude steel, and sulphate; and blast furnace slag cement, as well as concrete. The company was formerly known as Hyundai Cement Co., Ltd. and changed its name to Hanil Hyundai Cement Co., Ltd. in July 2018. Hanil Hyundai Cement Co., Ltd was founded in 1969 and is headquartered in Seoul, South Korea. Hanil Hyundai Cement Co., Ltd operates as a subsidiary of Hlk Holdings Co., Ltd.",
    "website": "http://www.hanilhdcement.com",
    "zipcode": "06252"
  },
  "006740.KS": {
    "city": "Pyeongtaek-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Young Poong Paper Mfg Co.,Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "YoungpoongPaprMfg",
    "state": null,
    "summary": "Young Poong Paper Mfg Co.,Ltd. manufactures and sells paper products. It offers core boards that are used in manufacturing paper cores and tubes; and liner boards for use in manufacturing corrugated boards and boxes. The company was founded in 1970 and is headquartered in Pyeongtaek, South Korea. Young Poong Paper Mfg Co.,Ltd. is a subsidiary of Growth Investment Purpose Company I Co., Ltd.",
    "website": "http://www.yp21.co.kr",
    "zipcode": null
  },
  "007690.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Kukdo Chemical Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "KukdoChem",
    "state": null,
    "summary": "Kukdo Chemical Co., Ltd. operates as a chemical materials company in South Korea. The company offers epoxy resins; hardeners; and coating, adhesive, flexible, and rigid polyols, as well as rigid, semi-rigid, and flexible polyurethane systems. It also provides electrical and electronic materials; advance materials; acrylate; and reactive diluent. It serves marine paints, heavy-duty coatings, powder coatings, coatings for civil engineering and construction, consumer goods, packaging materials, and materials for transport equipment. The company was formerly known as Kukdo Chemical Industry. Co., Ltd. and changed its name to Kukdo Chemical Co., Ltd. in April 1999. Kukdo Chemical Co., Ltd. was founded in 1972 and is headquartered in Seoul, South Korea.",
    "website": "http://www.kukdo.com",
    "zipcode": null
  },
  "008250.KS": {
    "city": "Incheon",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Lumber & Wood Production",
    "long_name": "Eagon Industrial Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "EagonInd",
    "state": null,
    "summary": "Eagon Industrial Co., Ltd. supplies building materials in South Korea and internationally. It offers aluminum, PVC, and wood windows and doors; curtain walls; explosion and bullet proof windows; glasses; building integrated photovoltaic and photovoltaic solutions; floors; removable dividers and doors; plywood; housing materials, such as sheathing materials, OSB, and engineered and deck wood; landscape products; guard rail products; and logistics products, such as green and plastic pellets, clip-lok, and C-box. The company was founded in 1972 and is based in Incheon, South Korea.",
    "website": "http://www.eagon.com/eng/index.asp",
    "zipcode": null
  },
  "008260.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "N.I Steel Co.,Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "NI STEEL",
    "state": null,
    "summary": "N.I Steel Co., Ltd produces and sells steel products for construction sites in South Korea. The company offers sheet piles, HYFO beams, act columns, smart beams, modular H-beams, D-deck plates, and steel curtain walls, as well as leases and sells H-beams. The company was formerly known as N.I TECH Co., Ltd and changed its name to N.I Steel Co., Ltd in March 2007. N.I Steel Co., Ltd was founded in 1972 and is headquartered in Seoul, South Korea.",
    "website": "http://ni.hcrst.com",
    "zipcode": null
  },
  "008350.KS": {
    "city": "Daegu",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Aluminum",
    "long_name": "Namsun Aluminum Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "NamsunAlum",
    "state": null,
    "summary": "Namsun Aluminum Co., Ltd. produces and sells aluminum extruded products in South Korea and internationally. It offers aluminum windows and doors, curtain walls, industrial structure materials, and bomb blast mitigated windows, as well as chassis for windows and doors. The company was formerly known as Namsun Light Metals Co., Ltd. and changed its name to Namsun Aluminum Co., Ltd. in 1990. Namsun Aluminum Co., Ltd. was founded in 1947 and is headquartered in Daegu, South Korea.",
    "website": "http://www.namsun.co.kr",
    "zipcode": "42983"
  },
  "008355.KS": {
    "city": "Daegu",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Aluminum",
    "long_name": "Namsun Aluminum Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "NamsunAlum(1P)",
    "state": null,
    "summary": "Namsun Aluminum Co., Ltd. produces and sells aluminum extruded products in South Korea and internationally. It offers aluminum windows and doors, curtain walls, industrial structure materials, and bomb blast mitigated windows, as well as chassis for windows and doors. The company was formerly known as Namsun Light Metals Co., Ltd. and changed its name to Namsun Aluminum Co., Ltd. in 1990. Namsun Aluminum Co., Ltd. was founded in 1947 and is headquartered in Daegu, South Korea.",
    "website": "http://www.namsun.co.kr",
    "zipcode": "42983"
  },
  "008420.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "MoonBae Steel Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "MoonbaeStl",
    "state": null,
    "summary": "Moonbae Steel Co., Ltd. engages in the manufacture and distribution of steel products. It operates in two segments, Manufacture and Distribution. The Manufacture segment produces hot-rolled steel plates, hot-rolled steel sheets, checkered steel plates, hot-rolled steel coils, thin plates, mini-mill coils, skelps, and others. The Distribution segment distributes its manufactured products through wholesale. Moonbae Steel Co., Ltd. was founded in 1973 and is headquartered in Seoul, South Korea.",
    "website": "http://www.moonbaesteel.co.kr",
    "zipcode": "100-161"
  },
  "009190.KS": {
    "city": "Yesan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "Daiyang Metal Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "DaiyangMtl",
    "state": null,
    "summary": "Daiyang Metal Co., Ltd. manufactures and sells steel products worldwide. It offers stainless steel cold rolled plates for the automotive, shipbuilding, construction, machinery, kitchen furniture, home appliances, IT, electronics, and telecom industries. The company was founded in 1973 and is headquartered in Yesan, South Korea.",
    "website": "http://www.daiyangmetal.com",
    "zipcode": "340-861"
  },
  "009200.KS": {
    "city": "Jinju-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Moorim Paper Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "MOORIM PAPER",
    "state": null,
    "summary": "Moorim Paper Co., Ltd. manufactures and sells paper products. It offers printing papers, such as art and white papers; and produces and sells bleach chemical pulps. The company also engages in the installment financing, and facility rental businesses; and wholesale of paper and pulp products. In addition, it produces and sells steam and electricity. The company was founded in 1973 and is headquartered in Jinju, South Korea.",
    "website": "http://www.moorim.co.kr",
    "zipcode": "52809"
  },
  "009460.KS": {
    "city": "Yangsan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Hanchang Paper Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "HanchangPaper",
    "state": null,
    "summary": "Hanchang Paper Co., Ltd. develops, manufactures, and sells bio-degradable bio-mass materials/products in South Korea. It offers art boards under the I PAPERS brand; duplex boards, including ivory, SC, and TM paperboards; and functional white paper boards. The company also provides cups, lids, sleeves, shopping bags/envelops, films, forks/spoons/knives, and various kind of containers under Greenus brand name. Hanchang Paper Co., Ltd. was founded in 1973 and is headquartered in Yangsan, South Korea.",
    "website": "http://www.hcpaper.co.kr",
    "zipcode": null
  },
  "009580.KS": {
    "city": "Ulsan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Moorim P&P Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "Moorim P&P",
    "state": null,
    "summary": "Moorim P&P Co., Ltd. engages in the production and sale of paper and pulp products in South Korea and internationally. The company produces and sells bleached chemical pulp and magnesium hydroxide. It also manufactures and sells printing papers, including art and white papers; and engages in the provision of credit and forestry businesses. The company was founded in 1974 and is headquartered in Ulsan, South Korea.",
    "website": "http://www.moorim.co.kr",
    "zipcode": null
  },
  "009770.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Samjung Pulp Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "SAMJUNGPULP",
    "state": null,
    "summary": "Samjung Pulp Co., Ltd. produces hygiene papers in South Korea. The company offers toilet papers, kitchen towels, wet and beauty tissues, and other products for household appliances; adult diapers; and other products, such as napkins, hand towels, and jumbo roll products and hand roll towel. It provides its products under the Pure Promise and Living Tissue brands. The company was founded in 1974 and is headquartered in Seoul, South Korea.",
    "website": "http://www.sjpulp.com",
    "zipcode": null
  },
  "009830.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Hanwha Solutions Corporation",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "HANWHA SOLUTIONS",
    "state": null,
    "summary": "Hanwha Solutions Corporation operates in the chemicals, energy solutions, and advanced materials business areas in South Korea and internationally. The company offers petrochemical products; and photovoltaic cells and modules. In addition, it builds and operates power plants, as well as retails electricity; and provides lightweight composite materials, photovoltaic materials, and electronic materials. The company is headquartered in Seoul, South Korea.",
    "website": "http://www.hanwhasolutions.com",
    "zipcode": null
  },
  "009835.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Hanwha Solutions Corporation",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "HANWHA SOLUTIONS(1P)",
    "state": null,
    "summary": "Hanwha Solutions Corporation operates in the chemicals, energy solutions, and advanced materials business areas in South Korea and internationally. The company offers petrochemical products; and photovoltaic cells and modules. In addition, it builds and operates power plants, as well as retails electricity; and provides lightweight composite materials, photovoltaic materials, and electronic materials. The company is headquartered in Seoul, South Korea.",
    "website": "http://www.hanwhasolutions.com",
    "zipcode": null
  },
  "010060.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "OCI Company Ltd.",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "OCI",
    "state": null,
    "summary": "OCI Company Ltd., together with its subsidiaries, manufactures and sells basic chemical products in Korea, the United States, China, Asia, Europe, and internationally. The company operates through four segments: Basic Chemicals, Carbon Chemicals, Energy Solutions, and Others. It provides basic chemicals, such as polysilicon used for solar power generation and semiconductors; phosphoric acid, which is used in semiconductor wafer etchant material, LCD etchant material, food additives, and metal surface treatment agents; hydrogen peroxide used as an environmentally friendly oxidant in healthcare, food, and cosmetic industries; fumed silica that is used in construction, automobile, semiconductors, etc.; and vacuum insulation panels. The company also offers petrochemical and carbon materials, including carbon black used as reinforcing rubber elasticity and color rubber, as well as ink, paint, and conductive materials; benzene, toluene, and xylene used as a base material; pitch used as a binding agent in anodes for aluminum smelting, and other binding applications; plasticizers that enhance flexibility, low-temperature resistance, and processability of PVC products; and TDI used in foam type products, such as the components of vehicles, beds, paints, and adhesives. In addition, it provides develops and operates solar PV energy and cogeneration power plants. Further, the company manufactures and sells percarbonate, solar tracker and panels, pesticides, coal tar, carbon black, as well as solar energy equipment and related materials. Additionally, it develops real estate; invests in and operates information system; supplies steam and hot water; and offers manpower and jobs for business support services. The company was formerly known as DC Chemical Co., Ltd. and changed its name to OCI Company Ltd. in April 2009. OCI Company Ltd. was founded in 1959 and is headquartered in Seoul, South Korea.",
    "website": "http://www.oci.co.kr",
    "zipcode": "04532"
  },
  "010420.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Hansol PNS Co.,Ltd.",
    "market": "kr_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "HANSOLPNS",
    "state": null,
    "summary": "Hansol PNS Co.,Ltd. provides IT outsourcing and solutions, and system integration services. The company provides industry-specific outsourcing services for manufacturing, logistics, construction, leisure, environment, public service, and communication industries. It services portfolio includes service level agreement, information strategy service, established medium and long term information strategy, IT outsourcing planning, service level management, information investment performance management, CIO council operations, application services, maintenance management, performance improvement management, user support, disaster recovery service, remote CD tape archive, disaster recovery action plan, recovery test, electronic recovery, security management service, intrusion detection, server vulnerability management, virus protection, security situation report, and security tool installation and management. Hansol PNS Co.,Ltd. offers IT services in the field of application services, IT infrastructure, disaster recovery, and security management. The company was formerly known as Hansol PNS Co.,Ltd. and changed its name to HansolPNS Co., Ltd. in June 2008. Hansol PNS Co.,Ltd. was founded in 1975 and is based in Seoul, South Korea.",
    "website": "http://it.hansolpns.com",
    "zipcode": null
  },
  "010640.KS": {
    "city": "Pyeongtaek-si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "Chinyang Poly Urethane Co.,Ltd",
    "market": "kr_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "ChinYangPoly",
    "state": null,
    "summary": "Chinyang Poly Urethane Co.,Ltd produces and supplies polyurethane foam products in South Korea. It serves furniture, automobile, shoes, construction, packaging, and electronics industries. The company was founded in 1975 and is headquartered in Pyeongtaek-si, South Korea.",
    "website": "http://www.chinyangpoly.kr",
    "zipcode": "100-2018"
  },
  "011170.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Lotte Chemical Corporation",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "LOTTE CHEMICAL Corp",
    "state": null,
    "summary": "Lotte Chemical Corporation, a chemical company, manufactures and distributes polymers, monomers, basic petrochemical products, and megatrend products. The company operates through Monomer, Polymer, Basic Petrochemicals, and Others segments. It offers polymer products, including high density, low-density, and linear low-density polyethylene, as well as ethylene-vinyl acetate; transparent-impact resistance polypropylene, as well as polypropylene for injection and blow molding, yarns/fibers, and films; thermoplastic elastomers, adhesive resins, thermoplastic olefins, long fiber reinforced thermoplastics, and expanded polypropylenes; polycarbonates, polycarbonate resins, and acrylonitrile-butadiene-styrene resins; and polyethylene terephthalates. The company also provides monomers, such as ethylene glycols/ethylene oxides; methoxy polyethylene glycols and polyethylene glycols, as well as VPEG, a raw material for third generation admixtures; glycole ethers; methyl methacrylates; purified isophthalic acids; and purified terephthalic acids. In addition, it offers basic petrochemicals comprising benzene, toluene, mixed xylene, meta-xylene, para-xylene, and ortho-xylene, as well as isoprene, dicyclopentadiene, piperylene, and styrene monomers; and water treatment membranes. Further, the company provides property lease and labor dispatch services. It conducts operations in the Republic of Korea, Malaysia, the United States, Pakistan, China, and other regions. The company was formerly known as Honam Petrochemical Corporation and changed its name to Lotte Chemical Corporation in December 2012. Lotte Chemical Corporation was founded in 1976 and is headquartered in Seoul, South Korea.",
    "website": "http://www.lottechem.com",
    "zipcode": "05551"
  },
  "011390.KS": {
    "city": "Busan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Building Materials",
    "long_name": "Busan Industrial Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "BusanInd",
    "state": null,
    "summary": "Busan Industrial Co., Ltd. provides construction materials in South Korea. It offers ready mixed concrete, cement, aggregates, and admixture materials. The company was founded in 1976 and is based in Busan, South Korea.",
    "website": "http://www.busanind.co.kr",
    "zipcode": "617-050"
  },
  "011500.KS": {
    "city": "Gunsan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Hannong Chemicals Inc.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "HANNONG",
    "state": null,
    "summary": "Hannong Chemicals Inc. produces and sells chemical raw materials in South Korea. The company offers glycol ethers for use as solvents or industrial intermediates in semiconductors, electronic goods, paints, inks, dyes, detergents, machine oils, brake fluids, and anti-freezing agents; nonionic surfactants; polyols for use as an intermediate for polyurethane, polyester, epoxy, and polycarbonic acid types of plasticizer; and functional monomers for ultra violet and electronic beam system coating. It also provides glyme and propionates for electronic materials; anionic surfactant products for household and industrial detergents, as well as emulsifier for emulsion polymerization; emulsifiers; linear alkyl phosphonic acids for the production of nanoparticles, such as quantum dots, nano-metals, and nano-ceramics; and carbomers, as well as solubilizing and emulsifying agents, humectants, solvents, and preservatives for personal care and cosmetic applications. The company was founded in 1976 and is headquartered in Gunsan, South Korea.",
    "website": "http://www.hannong.co.kr",
    "zipcode": null
  },
  "011780.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "Kumho Petrochemical Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "KumhoPetrochem",
    "state": null,
    "summary": "Kumho Petrochemical Co., Ltd. manufactures and sells synthetic rubber and resins, specialty chemicals, nanocarbon, energy, and building materials in South Korea and internationally. The company's synthetic rubber products include high-cis and low-cis polybutadiene rubber, high styrene resin masterbatch, styrene butadiene latex and carboxyl styrene butadiene latex, LEADCAP, acrylonitrile butadiene rubber, ultra high-cis polybutadiene rubber, styrene butadiene rubber, styrene butadiene styrene, solution polymerized styrene butadiene rubber, and STE for use in industrial items, such as golf balls, medical products, footwear, asphalt modifiers, etc. Its synthetic resin products comprise acrylonitrile butadiene styrene, ENERPOR, engineering plastics, expandable polystyrene, GPPS, HIPS, polypropylene glycol, and styrene acrylonitrile for use in general-purpose products, such as automotive parts, electronic components, food containers, building materials, etc. The company also provides specialty chemicals consisting of antioxidants, vulcanization accelerators, and paint additives/diluents used in tires, rubber belts, and shoes; carbon nanotubes; and building materials comprise ABS window systems, PVC window systems, AL window systems, and gold foam insulators. In addition, it operates a cogeneration plant that provides residential, commercial, and industrial users with electricity, steam, and purified water to businesses. Kumho Petrochemical Co., Ltd. was founded in 1970 and is headquartered in Seoul, South Korea.",
    "website": "http://www.kkpc.co.kr",
    "zipcode": null
  },
  "011785.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "Kumho Petrochemical Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "KumhoPetrochem(1P)",
    "state": null,
    "summary": "Kumho Petrochemical Co., Ltd. manufactures and sells synthetic rubber and resins, specialty chemicals, nanocarbon, energy, and building materials in South Korea and internationally. The company's synthetic rubber products include high-cis and low-cis polybutadiene rubber, high styrene resin masterbatch, styrene butadiene latex and carboxyl styrene butadiene latex, LEADCAP, acrylonitrile butadiene rubber, ultra high-cis polybutadiene rubber, styrene butadiene rubber, styrene butadiene styrene, solution polymerized styrene butadiene rubber, and STE for use in industrial items, such as golf balls, medical products, footwear, asphalt modifiers, etc. Its synthetic resin products comprise acrylonitrile butadiene styrene, ENERPOR, engineering plastics, expandable polystyrene, GPPS, HIPS, polypropylene glycol, and styrene acrylonitrile for use in general-purpose products, such as automotive parts, electronic components, food containers, building materials, etc. The company also provides specialty chemicals consisting of antioxidants, vulcanization accelerators, and paint additives/diluents used in tires, rubber belts, and shoes; carbon nanotubes; and building materials comprise ABS window systems, PVC window systems, AL window systems, and gold foam insulators. In addition, it operates a cogeneration plant that provides residential, commercial, and industrial users with electricity, steam, and purified water to businesses. Kumho Petrochemical Co., Ltd. was founded in 1970 and is headquartered in Seoul, South Korea.",
    "website": "http://www.kkpc.co.kr",
    "zipcode": null
  },
  "011790.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "SKC Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "SKC",
    "state": null,
    "summary": "SKC Co., Ltd. manufactures and markets chemicals and film products in South Korea and internationally. The company offers copper foil for lithium ion battery used in electric vehicles (EVs); NEOCOVER, a material used for EVs, batteries, and 5G parts; and interlayer film of laminated safety film glasses for vehicles and buildings, as well as intermediate film for PV modules. It also designs chemical mechanical polishing (CMP) pads for polishing the surface of semiconductor wafers physically and chemically; supplies CMP slurry products; and provides phase shift mask used in the semiconductor lithography process. In addition, the company offers biodegradable PLA films used in food wrapping, paper rolls, glitters, cards, and ordinary wrapping applications; ecolabel, a recyclable PET bottle labelling material; and films for windows. Further, it provides PET base films used as raw material for various core optical sheets of FPD, such as LCD and PDP; heat-shrinkable film used as shrinkable labels for containers of various materials, including PET, PS, PE, glass, can, etc.; color-tinted films used in window films of vehicles and construction; and clear films used for films that require hard coatings, shatterproof film, and window films, such as screen protection films. SKC Co., Ltd. was founded in 1976 and is headquartered in Seoul, South Korea.",
    "website": "http://www.skc.co.kr",
    "zipcode": "137-070"
  },
  "012160.KS": {
    "city": "Boryeong-si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "Youngwire Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "YOUNGWIRE",
    "state": null,
    "summary": "Youngwire Co., Ltd. manufactures and sells wire rope products. It offers general, paralleled, non-rotating, and compact wire ropes, as well as swaged, cable laid, and EV and IP ropes; steel wires for beds, springs, and rolling products; control cables, which are used for machinery operations and automobiles; and PC strands for use in nuclear power plants, railroad ties, bridges, bridge piers, and elevated roads. The company also provides X-Bon products for use in concrete electric pole and pile reinforcing, reinforcement of building columns, bents, reinforcing ducts, piles, poles, hume piles, beams, sheet piles, and high stressed pile; CD bars that are used in OA and optical instrument, and automotive applications, as well as for bolt, lench, tools, and spring; and IT wires that are used for automobile suspension coil springs. Further, the company provides industrial packaging materials; and port and inland logistic services. The company exports its products to the United States, Europe, Asia, and internationally. The company was formerly known as Young Heung Iron & Steel Co., Ltd. Youngwire Co., Ltd. was founded in 1977 and is headquartered in Boryeong, South Korea.",
    "website": "http://www.youngwire.com",
    "zipcode": null
  },
  "012610.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Kyungin Synthetic Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "KyunginSynth",
    "state": null,
    "summary": "Kyungin Synthetic Co., Ltd. develops, manufactures, and sells dyes, inks, fine chemicals, and other functional chemical materials for use in textiles, food, agriculture, and electronics in South Korea and internationally. The company offers inks for digital textile printing and UV printing, as well as dyes for inks; reactive dyes, disperse dyes, acid dyes, CDP basic dyes, and optical brightening agents; electronic materials comprising LCD filters and photoinitiators; and fine chemicals, such as saccharin, sulfur-based fine chemicals, and inorganic products. It also provides organic materials for displays; semiconductor photoresist components and materials for coating photoresists; photoactive compounds and pigments; and colorant products. Kyungin Synthetic Co., Ltd. was founded in 1971 and is headquartered in Seoul, South Korea.",
    "website": "http://www.kisco.co",
    "zipcode": "07947"
  },
  "013000.KS": {
    "city": "Incheon",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "Sewoo Global Co., Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "Sewooglobal",
    "state": null,
    "summary": "Sewoo Global Co., Ltd manufactures and sells polymer petrochemical products. The company offers engineering plastics and ABS resins. It also manufactures and sells printed circuit boards. The company was formerly known as Sewoo Polymer. Sewoo Global Co. Ltd. was founded in 1978 and is based in Incheon, South Korea.",
    "website": "http://www.sewoo21.co.kr",
    "zipcode": "402-060"
  },
  "014280.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "Kumkang Kind Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "KUMKANG KIND",
    "state": null,
    "summary": "Kumkang Kind Co., Ltd. manufactures and sells steel pipes and various scaffolding products in South Korea, Malaysia, the United States, Vietnam, India, East Africa, Indonesia, and internationally. The company offers aluminium formwork systems; gang formwork systems; climbing systems for residential, commercial, and civil engineering projects; civil engineering formwork systems; and euro formwork systems, as well as customer support solutions. It also provides steel pipes, aluminium billets and extrusions, scaffolding and shoring systems, and modular unit systems. The company was founded in 1979 and is headquartered in Seoul, South Korea.",
    "website": "http://www.kumkangkind.com",
    "zipcode": null
  },
  "014285.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "Kumkang Kind Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "KUMKANG KIND(1P)",
    "state": null,
    "summary": "Kumkang Kind Co., Ltd. manufactures and sells steel pipes and various scaffolding products in South Korea, Malaysia, the United States, Vietnam, India, East Africa, Indonesia, and internationally. The company offers aluminium formwork systems; gang formwork systems; climbing systems for residential, commercial, and civil engineering projects; civil engineering formwork systems; and euro formwork systems, as well as customer support solutions. It also provides steel pipes, aluminium billets and extrusions, scaffolding and shoring systems, and modular unit systems. The company was founded in 1979 and is headquartered in Seoul, South Korea.",
    "website": "http://www.kumkangkind.com",
    "zipcode": null
  },
  "014440.KS": {
    "city": "Chungju-si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Youngbo Chemical Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "YoungboChem",
    "state": null,
    "summary": "Youngbo Chemical Co., Ltd. manufactures and sells cross-linked polyolefin foam in Korea and internationally. The company offers artiflex, artilon, epilon, heatlon, filmy, polyisocyanurate, and youngboard cross-linked polyolefin foam products. Its products are used in various applications, including automotive interior, home appliance and HVAC/climate control, building and construction, sports and leisure, packaging and cushioning, sundry goods and others, specialty products, IT parts materials, sound absorption materials, electronic materials, and wallpaper products. The company was founded in 1979 and is headquartered in Chungju-si, South Korea.",
    "website": "http://www.youngbo.com",
    "zipcode": null
  },
  "014530.KS": {
    "city": "Yangsan-si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "Kukdong Oil & Chemicals Co.,Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "KukdongOil&Chem.",
    "state": null,
    "summary": "Kukdong Oil & Chemicals Co.,Ltd develops, manufactures, and supplies various lubricant products primarily in South Korea. It offers industrial lubricants, such as machine oil, gear oil, hydraulic oil, air compressor oil, heat transfer oil, refrigeration oil, grease, transformer oil, and others; metalworking fluids, including insoluble and soluble cutting, metal forming, rust preventive, and cleaning oils; paraffinic, naphthenic, and aromatic type process oils; liquid paraffin for food additive, cosmetic, and general industrial uses; and color and pavement asphalt. The company also operates LPG charging stations and gas stations; distributes lubricants under the BP, Castrol, Optimol, and Tribol brands; and supplies petroleum to affiliated gas stations and business partners. It exports its products to approximately 20 countries worldwide. The company was formerly known as Sechang industry Co., Ltd. and changed its name to Kukdong Oil & Chemicals Co.,Ltd in January 1985. Kukdong Oil & Chemicals Co.,Ltd was founded in 1979 and is headquartered in Yangsan-si, South Korea.",
    "website": "http://www.kdoc.co.kr",
    "zipcode": null
  },
  "014580.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Building Materials",
    "long_name": "Taekyung BK Co., Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "TAEKYUNG BK",
    "state": null,
    "summary": "Taekyung BK Co., Ltd produces and sells various lime products in South Korea. Its products include quicklime; calcium oxide that is used in metallurgy, chemicals, building materials, soil stabilization, disinfection, and lime-sulfur mixture and Bordeaux mixture applications; granular calcium oxide for acidic soil neutralization; calcium oxide powder, which is used for soil stabilization and acidic soil neutralization; and limestone for use as raw material in cement production. The company also offers calcium hydroxide or hydrated lime that is used in food and food by-products, wastewater treatment, water purification in purification plant, the removal of flue gas and dioxin in incinerating facility, and high gloss and enhanced dispersion applications. In addition, it provides precipitated calcium carbonate, which is used as filler and enhanced surfactant of paints and varnishes, paper coatings, inks, water-proof coatings, etc.; and calcium hydroxide fertilizer for use in soil enhancement and neutralizing acidic soil. Further, the company mines limestone. Taekyung BK Co., Ltd was founded in 1980 and is headquartered in Seoul, South Korea.",
    "website": "http://taekyungbk.co.kr",
    "zipcode": null
  },
  "014680.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Hansol Chemical Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "Hanchem",
    "state": null,
    "summary": "Hansol Chemical Co., Ltd., together with its subsidiaries, manufactures and sells various chemicals primarily in South Korea. The company provides various fine chemicals, including hydrogen peroxide, a bleaching agent for semiconductor/LCD, paper pulp, textile, chemical, food/medical, and environmental remediation chemical applications; emulsion type polyacrylamide to handle various industrial wastewater streams; and organic coagulants for treating wastewater; and retention agents, polyamine, and micro capsules for paper making. Its fine chemicals also include synthetic latex products, such as HITEX for paper coating, carpet backing, construction, non-woven, and other applications; Bio-SBL, a grafting copolymer for paper surface sizing and coating binder; HanCellymer, an aqua binder for lithium ion battery; and Hansphere that enhances gloss and opacity of coated paper. In addition, the company's fine chemicals comprise sodium dithionite/sodium hydrosulfite, a bleaching agent used in pulp and textiles, paper, fiber dye, leather, and other industries; and benzoyl peroxide, a polymerization initiator and bleaching agent for chemical and food industries. Further, the company provides electronic materials consisting of optical clear resins that are UV curable adhesives for tablet PC, smart phone, and touch panel devices; conformal coating materials to protect electrodes and flexible circuits of FPD panels; cleaning solutions to prevent curing in the nozzle and valve from coating material remnants; black side sealing resins to prevent leak-light from OLED panels and screening substances; and thermal interface materials, which are used on FPCB chips. Additionally, it provides thin film materials for the semiconductor industry. The company was formerly known as Hansol Chemience co., Ltd. and changed its name to Hansol Chemical Co., Ltd. in March 2004. The company was founded in 1980 and is headquartered in Seoul, South Korea.",
    "website": "http://www.hansolchemical.com",
    "zipcode": "06169"
  },
  "015890.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Taekyung Industry.Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "TaekyungInd",
    "state": null,
    "summary": "Taekyung Industry.Co., Ltd. manufactures and sells ultra-fine ground calcium carbonate, ferroalloy, and hydrogen sulfide adsorbent basic materials in South Korea and internationally. The company offers ferroalloy products, such as high-carbon ferromanganese and silico-manganese products. It also provides liquid-type ultrafine heavy calcium carbonate for coating art paper and whiteboards, as well as for matte paper, water-based paints, and pillars. In addition, the company offers DETOX-S to absorb hydrogen sulfide; DETOX-B to absorb basic gas; and carbides. Further, it provides lime products, such as quicklime, slaked lime, calcium hydroxide, and light calcium carbonate; petro coke fuel; zinc oxide and zinc dust products; vaporizers; steelmaking refining agents; and various industrial gases, including acetylene, oxygen, carbon dioxide, nitrogen, LPG, and argon, as well as various environmental treatment agents, such as liquid calcified lime. Additionally, the company offers halogen bulbs automobiles; lamps; and LED lighting products, as well as operates highway rest areas; and service areas, gas stations, and LPG charging stations. Taekyung Industry.Co., Ltd. was founded in 1975 and is headquartered in Seoul, South Korea.",
    "website": "http://www.taekyung.co.kr",
    "zipcode": "157-841"
  },
  "016590.KS": {
    "city": "Ansan-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Shindaeyang Paper Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "ShindaeyangPapr",
    "state": null,
    "summary": "Shindaeyang Paper Co., Ltd. engages in the production and sale of stencil paper in Korea. It offers base papers for corrugated cardboards; and corrugated cardboard/boxes, single, double, and triple wall corrugated fiber boards. The company was founded in 1982 and is based in Ansan, South Korea.",
    "website": "http://www.dygroup.co.kr",
    "zipcode": null
  },
  "017960.KS": {
    "city": "Miryang-si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Hankuk Carbon Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HankukCarbon",
    "state": null,
    "summary": "Hankuk Carbon Co., Ltd. produces and sells composite materials in South Korea. It offers carbon prepregs for airplanes and industrial applications, as well as carbon fiber sheets for repairing buildings and bridges; and LNG heat insulation panels for storage and transportation applications. The company also provides glass papers for use in floor decoration materials, tile carpets, print substrates, waterproof streets, heat insulation panels, and filters. In addition, it offers components of vehicles and trains, interior and exterior sandwich panels, and heat insulating panels for vessels, as well as laminates for archery, electrical insulation, and building reinforcement products. Further, the company provides copper cladded laminates of PCB substrates; and dry films, as well as household and semiconductor package products. Hankuk Carbon Co., Ltd. was founded in 1984 and is headquartered in Miryang, South Korea.",
    "website": "http://www.hcarbon.com",
    "zipcode": "50403"
  },
  "018470.KS": {
    "city": "Gyeongsan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Aluminum",
    "long_name": "Choil Aluminum Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "CHOILALUMINUM",
    "state": null,
    "summary": "Choil Aluminum Co., Ltd. operates as an aluminum rolling company in South Korea. The company provides coiled sheets that are used in foil stock, condenser cases, electric wire covers, insulator covering materials, fin stock, and mold transformers; and sheets and plates for use in litho sheets, cosmetic caps, P.P. caps/closure sheets, name plates, and sound proofing walls. It also offers embossed sheets, which are used in exterior and interior decoration for construction; circled sheets for use in household goods and reflector for light applications; and bands for cosmetic caps and electrical and electronic parts. Choil Aluminum Co., Ltd. was founded in 1975 and is headquartered in Gyeongsan, South Korea.",
    "website": "http://www.choilal.co.kr",
    "zipcode": null
  },
  "019440.KS": {
    "city": "Pohang",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "SeAH SPECIALSTEEL CO., LTD.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "SeAH SPECIAL STEEL",
    "state": null,
    "summary": "SeAH SPECIALSTEEL CO., LTD. manufactures and sells steel materials for automotive, electronics, and mechanical industries in South Korea and internationally. The company offers cold heading quality wires used in making coupling parts, such as bolts, nuts, and small screws, as well as in parts for machines, including cars and electrical equipment; and cold drawn bars used as machine parts and electronics materials. It also provides peeled bars for cylinder rods in excavators, lifts, loaders, and other construction machines, as well as for engines, vessels, industrial ball screws, cold forged parts in cars, etc.; and bar to bar products. In addition, it offers hydrogen bell furnace annealed products and seam-free wire. The company was formerly known as Changwon Steel Co., Ltd. and changed its name to SeAH SPECIALSTEEL CO., LTD. in June 1988. The company was founded in 1986 and is headquartered in Pohang, South Korea. SeAH SPECIALSTEEL CO., LTD. is a subsidiary of SeAH Holdings Corporation.",
    "website": "http://www.seahsp.co.kr",
    "zipcode": null
  },
  "023000.KS": {
    "city": "Pohang",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "Samwonsteel Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "SAMWONSTEEL",
    "state": null,
    "summary": "Samwonsteel Co., Ltd. develops and supplies bars and auto spring materials for the automotive industry in South Korea, Japan, China, India, the United States, Southeast Asia, Europe, and Latin America. It offers round and square edge flat bars, round bars, peeled bars, centerless ground bars, pipes, and parabolic and multi-leaf springs for automobiles. The company also provides coil springs, stabilizer bars, and torsion bars. In addition, it focuses on the development and production of high-performance and high-stress materials for lightweight vehicles. The company was founded in 1992 and is headquartered in Pohang, South Korea.",
    "website": "http://www.samwon-steel.co.kr",
    "zipcode": "790-841"
  },
  "024070.KS": {
    "city": "Ansan-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Wiscom Co.,Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "WISCOM",
    "state": null,
    "summary": "Wiscom Co.,Ltd. manufactures and sells plastic products in South Korea. It operates through PNP and Manufacturing divisions. The company offers HFFR and HFIX, crosslinked type XLPE, power cable, communication cable, flame retardant cable, heat resistant cable, cold resistant cable, oil resistant, solar power cable, marine cable, automobile cable, automobile interior/exterior, rat and ant repellent, equipment wire PVC, hose pipe, and other compounds; and coating compounds for voltage power cables, as well as semi-conductive compounds for cables. It also produces soft/hard PVC, PO, masterbatch, and conductive compounds; and LG Chem/LG MMA OEM products, such as ABS/PS compounds, EP compounds, PMMA compounds, etc. The company was founded in 1973 and is headquartered in Ansan-si, South Korea.",
    "website": "http://www.wiscom.co.kr",
    "zipcode": null
  },
  "024890.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "DAEWON Chemical Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "DaewonChem",
    "state": null,
    "summary": "DAEWON Chemical Co., Ltd. manufactures and supplies polyurethane synthetic leather and wallpaper to sporting goods companies in South Korea. The company offers synthetic leather; make-up blender for skin make-up under the h.natural brand name; masks and filters; wallpapers; and back and polishing pads. It is also involved in di-methyl formamide waste refining business. The company was founded in 1974 and is headquartered in Seoul, South Korea.",
    "website": "http://www.daewon21.co.kr",
    "zipcode": null
  },
  "025000.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "KPX Chemical Co.,Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "KPXCHEMICAL",
    "state": null,
    "summary": "KPX Chemical Co.,Ltd. manufactures and sells polyols in South Korea. The company offers polymer polyols, PU systems, and general base polyols. Its products include polyurethane for use in furniture/bedding, automotive, refrigerator, construction materials/LNG insulation, C.A.S.E, and other companies; and electron materials for semiconductor and LCD chemical companies. KPX Chemical Co.,Ltd. was founded in 1974 and is headquartered in Seoul, South Korea.",
    "website": "http://www.kpxchemical.com",
    "zipcode": null
  },
  "025860.KS": {
    "city": "Yeosu",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Agricultural Inputs",
    "long_name": "Namhae Chemical Corporation",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "NamhaeChem",
    "state": null,
    "summary": "Namhae Chemical Corporation produces and sells agricultural materials in South Korea and internationally. It offers fertilizers, which contain nitrogen, phosphoric acid, and potassium; and basic chemical products, such as ammonia, sulfuric and fuming sulfuric acid, phosphoric acid, gypsum, hexafluorosilicic acid, sulphate of potash, and hydrochloric acid for use as basic materials in consumer goods, as well as operates gas stations. The company also exports its products. Namhae Chemical Corporation was founded in 1974 and is based in Yeosu, South Korea.",
    "website": "http://www.nhchem.co.kr",
    "zipcode": null
  },
  "025890.KS": {
    "city": "Haman",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "Hankook Steel Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "HankookSteel",
    "state": null,
    "summary": "Hankook Steel Co., Ltd. manufactures and sells steel products in South Korea. The company offers rudder horns, propeller boss, lower casting, stern boss and tubes, and tillers for shipbuilding; crowns, frames, column, discharge heads, roll chocks, slag pots, tee dies, bending dies, girth gears, holding blocks, mill housing, tables, and trunnions for industrial purpose; and turbine casting, valve body, butterfly valves, and gate valves for power generation applications. It also provides ingot for forging, such as general, round, and E.S.R ingots. The company was founded in 1960 and is headquartered in Haman, South Korea.",
    "website": "http://www.hascokorea.com",
    "zipcode": null
  },
  "026940.KS": {
    "city": "Gwangju",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "Bookook Steel Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "Bookook Steel",
    "state": null,
    "summary": "Bookook Steel Co., Ltd. produces and sells various steel sheets, steel pipes, and section steel products for automobiles, electronics, and construction companies in South Korea. Its products include hot/cold-rolled steel strips, hot-rolled sheets, cold-rolled steel sheets, galvanized steel pipes, carbon steel pipes and square pipes for general structural purpose, and C-type lip channels. The company was founded in 1948 and is based in Gwangju, South Korea.",
    "website": "http://www.bks.co.kr",
    "zipcode": "506-258"
  },
  "027970.KS": {
    "city": "Daegu",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "seha corporation",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "seha",
    "state": null,
    "summary": "seha corporation operates in the paper board industry in South Korea. It offers industrial papers, including duplex boards with gray back, uncoated duplex boards with gray back, coated pizza box boards, duplex boards with white back, folding box boards, SBS-two side coated, cast coated papers, and cast white boards; and food wrapping/functional papers, such as solid bleached high bulk, kraft liner boards, coated fresh SC, and carrier boards. The company also provides fancy papers, including glacis; and transfer papers, such as sublimation inkjet papers. seha corporation exports its products to 20 countries. The company was formerly known as Serim Paper Manufacturing Co., Ltd. and changed its name to seha corporation in 2007. seha corporation was founded in 1984 and is headquartered in Daegu, South Korea. As of May 14, 2020, seha corporation operates as a subsidiary of Hankuk Paper Mfg. Co., Ltd.",
    "website": "http://www.seha.co.kr",
    "zipcode": null
  },
  "032560.KS": {
    "city": "Ansan-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "Hwang Kum Steel & Technology Co., Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "HwangKum S&T",
    "state": null,
    "summary": "Hwang Kum Steel & Technology Co., Ltd produces and supplies stainless steel products in South Korea. The company offers hot-rolled (HR), cold-rolled, section steel, surface processing, long, shape processing, and stainless steel pipe products; and carbon steel products comprising HR steel for general structures and high strength steel, checkered plates, flat bars, and sheath tubes. It offers its products under the TITAMAX brand. The company was founded in 1986 and is headquartered in Ansan, South Korea.",
    "website": "http://www.hwangkum.com",
    "zipcode": null
  },
  "051630.KS": {
    "city": "Ulsan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Chinyang Chemical Corporation",
    "market": "kr_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "ChinYangChem",
    "state": null,
    "summary": "Chinyang Chemical Corporation manufactures and sells chemical products in South Korea. It offers PVC floor coverings for residential and commercial use; and PVC leather for home, general, and office furniture applications, as well as for automobile seats, various bags, synthetic leather clothes, and other applications. The company also provides non-PVC artificial leather products under the FRIEN name; PVC tarpaulin products; wallpapers; and PVC deco sheets. The company was founded in 1963 and is headquartered in Ulsan, South Korea.",
    "website": "http://www.chinyang.co.kr",
    "zipcode": null
  },
  "055490.KS": {
    "city": "Hwaseong-si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "Tapex Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "TAPEX",
    "state": null,
    "summary": "Tapex Co., Ltd. manufactures and sells adhesive tapes in South Korea. The company provides various tapes that are used in the areas of electronic products, including flat panel displays, semiconductors, secondary batteries, optic lens moldings, electronic insulations, electrical fittings, (F) PCBs, and touch panels, as well as for EMI shielding, lead frame plating, and other applications; packing applications; and in home/office products, such as kitchen utensils, tapes, and household items. It also exports its products to approximately 10 countries. The company was formerly known as Seotong Chemical Co., Ltd. The company was founded in 1977 and is headquartered in Hwaseong-si, South Korea.",
    "website": "http://www.tapex.co.kr",
    "zipcode": null
  },
  "069260.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Huchems Fine Chemical Corporation",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "Huchems",
    "state": null,
    "summary": "Huchems Fine Chemical Corporation manufactures and sells fine and basic chemical products in South Korea and internationally. It operates through Chemical and Environment-Friendly divisions. Its fine chemicals comprise DNT, a raw material of TDI for use in polyurethanes and explosives, as well as serves as a base material for styrofoam, plastic, and synthetic leather applications; and mononitrobenzene, a raw material of MDI and polyurethanes, which is used as a material for auto interior/exterior applications, as well as a base material in making of artificial timber, insulation in electrical equipment, construction materials, packaging material, and synthetic leather. The company's fine chemical products also include dilute nitric acid for use in metallurgy, concentrated nitric acid, ammonium nitrate, polyurethane, etc., as well as for textile dyes and pigments; and concentrated nitric acid that is used in explosives, decolorizing agents, DNT, medicines, etc., as well as for use as synthetic fiber raw material; and ammonium nitrate as a raw material for explosives, and gas for semiconductors and medical gas. In addition, it offers methanol, which is used to produce MTBE for fuel oil or denatured alcohol and for materials synthesis of formaldehyde; urea for industry for use in resins, paints, feeds, synthetic detergents, wastewater treatments, dyes, etc., as well as for producing adhesives; and ammonia to produce fertilizers, caprolactam, nitric acid, ammoniation of rice straw and refrigerants, and ammonia as a patent medicine and flavor producing material. The company is also involved in the clean development mechanism project business; and provision of urea solutions. Huchems Fine Chemical Corporation was founded in 2002 and is headquartered in Seoul, South Korea.",
    "website": "http://www.huchems.com",
    "zipcode": "100-705"
  },
  "069460.KS": {
    "city": "Daegu",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Aluminum",
    "long_name": "Daeho Al Co.,Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "DAEHOAL",
    "state": null,
    "summary": "Daeho Al Co.,Ltd. produces and sells various aluminum products in South Korea. It offers aluminum coils and sheets that are used as material for various industries, such as LCD, PDP, PDA, mobile phone, vehicle, etc.; circle sheets for use in kitchen utensil industries, etc.; and special steel materials for use in the construction, as well as products for nano and bio industries. The company is based in Daegu, South Korea.",
    "website": "http://www.daeho-al.com",
    "zipcode": null
  },
  "071090.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "Histeel Co.,Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "HISTEEL",
    "state": null,
    "summary": "Histeel Co.,Ltd. produces and sells steel pipes and tubes in South Korea. It offers line, pressure, and structural pipes, as well as pipe piles; and square, ordinary, and automotive pipes. The company was founded in 1957 and is headquartered in Seoul, South Korea.",
    "website": "http://hi-steel.co.kr",
    "zipcode": null
  },
  "084010.KS": {
    "city": "Busan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "Daehan Steel Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "Daehan Steel",
    "state": null,
    "summary": "Daehan Steel Co., Ltd. manufactures and sells steel products in South Korea and internationally. It offers square billets; deformed bars used as construction material for building concrete structures; processed rebars; and bars in coils for reducing the loss of rebar and enhancing productivity. The company was founded in 1954 and is headquartered in Busan, South Korea.",
    "website": "http://www.idaehan.com",
    "zipcode": null
  },
  "090350.KS": {
    "city": "Anyang-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "NOROO PAINT & COATINGS Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "NOROOPAINT",
    "state": null,
    "summary": "NOROO PAINT & COATINGS Co., Ltd. develops, manufactures, and sells paints in South Korea and internationally. It provides floor, waterproof, heavy duty, PCM, household electrical appliance, and industrial coating products, as well as architecture and automotive refinish paint products; and resin products. The company offers its products under the SOON&SOO, Pantone Paint, YEGREENA, NOROOWAY, HiQ, Q-Fit, Natural, Color stain, Pororo Paint, and Energy Saver brands. It also engages in the market research and networking activities. The company was founded in 1945 and is based in Anyang-si, South Korea. NOROO PAINT & COATINGS Co., Ltd is a subsidiary of NOROO Holdings Co., Ltd.",
    "website": "http://www.noroopaint.com",
    "zipcode": null
  },
  "090355.KS": {
    "city": "Anyang-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "NOROO PAINT & COATINGS Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "NOROOPAINT(1P)",
    "state": null,
    "summary": "NOROO PAINT & COATINGS Co., Ltd. develops, manufactures, and sells paints in South Korea and internationally. It provides floor, waterproof, heavy duty, PCM, household electrical appliance, and industrial coating products, as well as architecture and automotive refinish paint products; and resin products. The company offers its products under the SOON&SOO, Pantone Paint, YEGREENA, NOROOWAY, HiQ, Q-Fit, Natural, Color stain, Pororo Paint, and Energy Saver brands. It also engages in the market research and networking activities. The company was founded in 1945 and is based in Anyang-si, South Korea. NOROO PAINT & COATINGS Co., Ltd is a subsidiary of NOROO Holdings Co., Ltd.",
    "website": "http://www.noroopaint.com",
    "zipcode": null
  },
  "093370.KS": {
    "city": "Hwaseong-si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Foosung Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "FOOSUNG",
    "state": null,
    "summary": "Foosung Co., Ltd. manufactures and sells chemicals in South Korea. It offers refrigerants, such as organic fluorine compounds and polyurethane resins; lithium secondary cells; and inorganic fluorine compounds and other products. The company also provides specialty gases, including semiconductor gases, which are used by semiconductor manufacturing industries; mixture gases for use in welding, laser, medical, marine, and radiometric applications; calibration standard gases used for the calibration of analyzers, as well as for quality control and process control activities; ultra-high purity gases for experimentation and research activities in the semiconductor, petrochemical, and metalworking industries; and other specialty gases. In addition, it is involved in the clean development mechanism operations. The company was founded in 1983 and is headquartered in Hwaseong, South Korea.",
    "website": "http://www.foosungchem.com",
    "zipcode": null
  },
  "100250.KS": {
    "city": "Busan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "Chinyang Holdings Corp.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "Chinyang Holdings",
    "state": null,
    "summary": "Chinyang Holdings Corp., through its subsidiaries, engages in the manufacture and sale of polyurethane plastic foam products. The company also offers PVC flooring and synthetic leather products, as well as automobile interior parts. In addition, it provides real-estate marketing, leasing, and trade transaction services. Chinyang Holdings Corp. was founded in 2008 and is based in Busan, South Korea.",
    "website": "http://www.cyholdings.kr",
    "zipcode": null
  },
  "104700.KS": {
    "city": "Changwon",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "KISCO Corp.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "KISCO",
    "state": null,
    "summary": "KISCO Corp. develops and produces steel products in South Korea. The company offers reinforcing bars, forged steel products, billets, and ingots, as well as industrial gases, including oxygen, liquid nitrogen, and argon. KISCO Corp. was founded in 1957 and is headquartered in Changwon, South Korea.",
    "website": "http://www.kisco.co.kr",
    "zipcode": null
  },
  "107590.KS": {
    "city": "Yongin-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "Miwon Holdings Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "MWH",
    "state": null,
    "summary": "Miwon Holdings Co., Ltd. produces and sells chemical products for UV/EB curing systems in Korea and internationally. The company offers acrylate and methacrylate monomers, oligomers, photo initiators, and other related fine chemicals. Its products are used in wood, metal, plastic, nail art, printing inks, adhesive, electronic, optical film, and CD/DVD/bluray applications. The company was founded in 1983 and is headquartered in Yongin, South Korea.",
    "website": "http://www.miramer.com",
    "zipcode": "16864"
  },
  "120110.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Kolon Industries, Inc.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "KOLON IND",
    "state": null,
    "summary": "Kolon Industries, Inc. engages in industrial materials, chemicals, films/electronic materials, and fashion businesses. The company produces and sells industrial materials, such as polyester and hybrid tire cords; airbags; technical yarn; artificial leather; polyester spunbond nonwoven fabrics under the FINON brand; aromatic amide under the Heracron brand; and CleanfilS, a water treatment membrane, as well as Ecomate-H, a hydrogen fuel cell membrane humidifier. It also offers polyester, nylon, coated, and prism films; dry film resist; and materials for panels, such as overcoat, encapsulation, and low temperature materials. In addition, the company provides hydrocarbon resins; phenolic resins under the HiRENOL brand; epoxy resins under the HiROXY brand; polyurethane resins; and PET resins under the INOPET brand. Further, it manufactures outdoor, sports, and golf clothing products under the KOLON SPORT, HEAD, ELORD, Jack Nicklaus, WAAC, ELORD CLUB, and HONMA brands; men's casuals under the Series, Customellow, CAMBRIDGE MEMBERS, GGIO II, epigram, Henry Cottons, brentwood, and S'LOW brands; and women's casual wear under the LUCKY CHOUETTE. Additionally, the company offers fashion shoes under the SUECOMMA BONNIE; handbags, shoes, and other accessories under the COURONNE brand; and other fashion products under the BLNKBLANC and Archivpke brands; premium fashion products under the Marc Jacobs, NEIL BARRETT, LOEWE, and IRO brands; upcycling and redesigning fashion clothes under the RE;CODE brand; and cosmetics under the M.CURIE brand. Furthermore, it operates Common Ground, a container complex shopping mall; Kolon Mall, a fashion and lifestyle online mall; Jane's, a women's fashion and lifestyle online shop; BySeries, an urban vintage multi-brand shop that offers various fashion products; online and offline integrated logistics center; and global sourcing platform. Kolon Industries, Inc. was founded in 1957 and is headquartered in Seoul, South Korea.",
    "website": "http://www.kolonindustries.com",
    "zipcode": null
  },
  "120115.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Kolon Industries, Inc.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "KOLON IND(1P)",
    "state": null,
    "summary": "Kolon Industries, Inc. engages in industrial materials, chemicals, films/electronic materials, and fashion businesses. The company produces and sells industrial materials, such as polyester and hybrid tire cords; airbags; technical yarn; artificial leather; polyester spunbond nonwoven fabrics under the FINON brand; aromatic amide under the Heracron brand; and CleanfilS, a water treatment membrane, as well as Ecomate-H, a hydrogen fuel cell membrane humidifier. It also offers polyester, nylon, coated, and prism films; dry film resist; and materials for panels, such as overcoat, encapsulation, and low temperature materials. In addition, the company provides hydrocarbon resins; phenolic resins under the HiRENOL brand; epoxy resins under the HiROXY brand; polyurethane resins; and PET resins under the INOPET brand. Further, it manufactures outdoor, sports, and golf clothing products under the KOLON SPORT, HEAD, ELORD, Jack Nicklaus, WAAC, ELORD CLUB, and HONMA brands; men's casuals under the Series, Customellow, CAMBRIDGE MEMBERS, GGIO II, epigram, Henry Cottons, brentwood, and S'LOW brands; and women's casual wear under the LUCKY CHOUETTE. Additionally, the company offers fashion shoes under the SUECOMMA BONNIE; handbags, shoes, and other accessories under the COURONNE brand; and other fashion products under the BLNKBLANC and Archivpke brands; premium fashion products under the Marc Jacobs, NEIL BARRETT, LOEWE, and IRO brands; upcycling and redesigning fashion clothes under the RE;CODE brand; and cosmetics under the M.CURIE brand. Furthermore, it operates Common Ground, a container complex shopping mall; Kolon Mall, a fashion and lifestyle online mall; Jane's, a women's fashion and lifestyle online shop; BySeries, an urban vintage multi-brand shop that offers various fashion products; online and offline integrated logistics center; and global sourcing platform. Kolon Industries, Inc. was founded in 1957 and is headquartered in Seoul, South Korea.",
    "website": "http://www.kolonindustries.com",
    "zipcode": null
  },
  "133820.KS": {
    "city": "Changnyeong",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Steel",
    "long_name": "Fine Besteel Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "FINEBESTEEL",
    "state": null,
    "summary": "Fine Besteel Co., Ltd. provides various steel products in South Korea. Its products include inverted, unequal, and equal angle products, as well as channel, I-beam, and cyber tour products. The company was founded in 2007 and is based in Changnyeong, South Korea.",
    "website": "http://www.finebesteel.com",
    "zipcode": null
  },
  "134380.KS": {
    "city": "Anyang",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Miwon Chemicals Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "MCC",
    "state": null,
    "summary": "Miwon Chemicals Co., Ltd. develops, manufactures, and sells performance chemicals for use in the rubber, detergent, and personal care industries worldwide. Its products include sulfurs; sulfuric acids, oleums, and refined sulfuric acids; linear alkylbenzene and dodecylbenzene sulphonic acids; alkyl and alkyl ether sulfates; and rubber chemicals, such as prevalcanization inhibitors and tire bonding agents. The company was founded in 1959 and is headquartered in Anyang, South Korea.",
    "website": "http://www.miwonchemicals.com",
    "zipcode": "430-806"
  },
  "138490.KS": {
    "city": "Gimcheon-si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "Kolon Plastics, Inc.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "KOLON PLASTICS",
    "state": null,
    "summary": "Kolon Plastics, Inc. produces and sells engineering plastic products in South Korea and internationally. The company's products include KOCETAL-POM, a polyacetal resin of a copolymer type; KOPA-PA6, a plastic material based on polyamide-6; KOPA-PA66, a thermoplastic resin; SPESIN-PBT, a thermal plastic resin; KOPEL-TPC-ET, a thermoplastic polyester elastomer; KOPET- PET materials; KOPPS polyphenylene sulfide resins; KompoGTe long fiber reinforced thermoplastics; NOPLA, a PEN-PET copolyester; KOPHOS-PC, a polycarbonate; and INKRAYON Flex thermoplastic elastomers. Its products are used in automobile, electricity and electronics, and life materials. Kolon Plastics, Inc. operates in approximately 90 countries, including South Korea, Japan, the United States, and Europe. The company was formerly known as KTP Inc. and changed its name to Kolon Plastics, Inc. in June 2008. Kolon Plastics, Inc. was founded in 1996 and is based in Gimcheon, South Korea.",
    "website": "http://www.kolonplastics.com",
    "zipcode": null
  },
  "161000.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Chemicals",
    "long_name": "Aekyung Petrochemical Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "AK Petrochemical",
    "state": null,
    "summary": "Aekyung Petrochemical Co., Ltd. researches and develops, manufactures, and sells phthalic anhydride (PA) and plasticizers in South Korea and internationally. The company offers PA for use as an ingredient to manufacture plasticizer, unsaturated polyester resin (UPR), paint, and other products.; maleic anhydride, which is used as the ingredient of UPR and paper-sizing agent; itaconic acid, an additive to enhance the properties of commodity resin and medium for diverse chemicals; and refined glycerin for use in various business areas ranging from additives for food, cosmetics, and industrial materials. It also provides plasticizer, which is used as an additive to make plastics flexible, as well as in PVC resin; ester polyol, an ingredient of polyurethane, which is used in various fields, such as sandwich panel, PIR panel, cold insulation material, and adhesive; polyurethane system rigid polyurethane foam for use in construction material industries; and anode materials for secondary battery. In addition, it offers bio diesel, an alternative fuel made of vegetable oil; and bio heavy fuel oil for power generation. Aekyung Petrochemical Co., Ltd. was founded in 1970 and is headquartered in Seoul, South Korea. Aekyung Petrochemical Co., Ltd. is a subsidiary of AK Holdings, Inc.",
    "website": "http://www.akp.co.kr",
    "zipcode": "08298"
  },
  "213500.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Hansol Paper Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HANSOLPAPER",
    "state": null,
    "summary": "Hansol Paper Co., Ltd. produces, distributes, and sells paper products in South Korea and internationally. It offers printing and writing, specialty, fine, and thermal paper products, as well as carton boards used in various packaging materials for medicines, confectionary, daily supplies, etc. The company was formerly known as Chonju Paper Mfg. Co., Ltd. and changed its name to Hansol Paper Co., Ltd. in October 1992. Hansol Paper Co., Ltd. was founded in 1965 and is headquartered in Seoul, South Korea.",
    "website": "http://www.hansolpaper.co.kr",
    "zipcode": null
  },
  "268280.KS": {
    "city": "Yongin-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Miwon Specialty Chemical Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "MIWON SC",
    "state": null,
    "summary": "Miwon Specialty Chemical Co., Ltd. engages in the production and supply of basic raw materials for UV/EB curing systems in Korea and internationally. The company's product line includes acrylate and methacrylate monomers, oligomers, photoinitiators, and other related fine chemicals. Its products are used in wood, metal, plastic, nail art, printing ink, adhesive, electronic, optical film, and CD/DVD/Bluray applications. The company was founded in 1959 is headquartered in Yongin, South Korea.",
    "website": "http://www.miramer.com",
    "zipcode": "16864"
  },
  "298000.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Chemicals",
    "long_name": "Hyosung Chemical Corporation",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HYOSUNG CHEM",
    "state": null,
    "summary": "Hyosung Chemical Corporation produces and sells a range of chemical products in South Korea and internationally. The company offers polypropylene (PP)/DH, PP-R and PP-B for pipes, medical PP, PP for transparent containers and special films, PP for compounding and heat resistant appliances, and PP for caps and other applications under the TOPILENE brand name. It also provides nylon films used for food packaging and as a packaging material for various household products; and PET films used for electric and electronic materials, as well as various other industrial materials, including packaging and optic materials. In addition, the company offers high-purity terephthalic acid, which is used as a raw material for polyester fibers, as well as to produce tire cords, pet bottles, and polyester films; and NF3 and special industrial gases used for high-tech products, such as semiconductors, displays, and solar cells. Further, it provides tri-acetyl cellulose films for LCDs; and POKETONE polymer. Hyosung Chemical Corporation is headquartered in Seoul, South Korea.",
    "website": "http://www.hyosungchemical.com",
    "zipcode": "06578"
  },
  "300720.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Building Materials",
    "long_name": "Hanil Cement Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HANILCMT",
    "state": null,
    "summary": "Hanil Cement Co., Ltd. produces and sells cements, ready-mixed concretes, and admixtures. The company offers Hanil Remicon for construction sites; and dry mortar products under the Remitar brand name. It also exports its products. The company was founded in 1961 and is headquartered in Seoul, South Korea.",
    "website": "http://www.hanilcement.com",
    "zipcode": "06252"
  },
  "PKX": {
    "city": "Pohang",
    "country": "South Korea",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Steel",
    "long_name": "POSCO",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "POSCO",
    "state": null,
    "summary": "POSCO, together with its subsidiaries, manufactures and sells steel rolled products and plates in South Korea and internationally. It operates through four segments: Steel, Construction, Trading, and Others. The company offers hot and cold rolled steel, stainless steel, plates, wire rods, and silicon steel sheets. It also plans, designs, and constructs industrial plants, civil engineering projects, and commercial and residential buildings; exports and imports steel products and raw materials; and generates electricity; produces gas and refuse derived fuel, as well as provides network and system integration, and logistics services. In addition, the company is involved in the engineering and construction; computer hardware and software distribution; economic research and consulting; business facility maintenance; architecture and consulting; investment in venture, energy, and bio tech industries; electronic commerce; intellectual property services and consulting; refractories and quicklime manufacturing and sales; transporting and warehousing; real estate development, rental, sale, and management; house and train manufacturing and management; and education and real estate business. Further, it engages in the resource development; mine development; business facility maintenance; fuel cell; iron ore and coal sales; and cargo handling business, as well as operates housing business agency. Additionally, the company manufactures and sells coated, and anode material. It also engages in loading and unloading; IT service and DVR; electric control engineering; forest resources development; refractory materials sales and furnace maintenance; rice processing; grain sales; packing materials manufacturing; and social enterprise businesses. POSCO was incorporated in 1968 and is headquartered in Pohang, South Korea.",
    "website": "http://www.posco.com",
    "zipcode": null
  },
  "PKX.F": {
    "city": "Pohang",
    "country": "South Korea",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Steel",
    "long_name": "POSCO",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "POSCO SP.ADR 1/4/SW 5000",
    "state": null,
    "summary": "POSCO, together with its subsidiaries, manufactures and sells steel rolled products and plates in South Korea and internationally. It operates through four segments: Steel, Construction, Trading, and Others. The company offers hot and cold rolled steel, stainless steel, plates, wire rods, and silicon steel sheets. It also plans, designs, and constructs industrial plants, civil engineering projects, and commercial and residential buildings; exports and imports steel products and raw materials; and generates electricity; produces gas and refuse derived fuel, as well as provides network and system integration, and logistics services. In addition, the company is involved in the engineering and construction; computer hardware and software distribution; economic research and consulting; business facility maintenance; architecture and consulting; investment in venture, energy, and bio tech industries; electronic commerce; intellectual property services and consulting; refractories and quicklime manufacturing and sales; transporting and warehousing; real estate development, rental, sale, and management; house and train manufacturing and management; and education and real estate business. Further, it engages in the resource development; mine development; business facility maintenance; fuel cell; iron ore and coal sales; and cargo handling business, as well as operates housing business agency. Additionally, the company manufactures and sells coated, and anode material. It also engages in loading and unloading; IT service and DVR; electric control engineering; forest resources development; refractory materials sales and furnace maintenance; rice processing; grain sales; packing materials manufacturing; and social enterprise businesses. POSCO was incorporated in 1968 and is headquartered in Pohang, South",
    "website": "http://www.posco.com",
    "zipcode": null
  },
  "PKXN.MX": {
    "city": "Pohang",
    "country": "South Korea",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Steel & Iron",
    "long_name": "POSCO",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "POSCO",
    "state": null,
    "summary": "POSCO, together with its subsidiaries, manufactures and sells steel rolled products and plates in South Korea and internationally. It operates through four segments: Steel, Construction, Trading, and Others. The company offers hot and cold rolled steel, stainless steel, plates, wire rods, and silicon steel sheets. It also plans, designs, and constructs industrial plants, civil engineering projects, and commercial and residential buildings; exports and imports steel products and raw materials; and generates electricity; produces gas and refuse derived fuel, as well as provides network and system integration, and logistics services. In addition, the company is involved in the engineering and construction; computer hardware and software distribution; economic research and consulting; business facility maintenance; architecture and consulting; investment in venture, energy, and bio tech industries; electronic commerce; intellectual property services and consulting; refractories and quicklime manufacturing and sales; transporting and warehousing; real estate development, rental, sale, and management; house and train manufacturing and management; and education and real estate business. Further, it engages in the resource development; mine development; business facility maintenance; fuel cell; iron ore and coal sales; and cargo handling business, as well as operates housing business agency. Additionally, the company manufactures and sells coated, and anode material. It also engages in loading and unloading; IT service and DVR; electric control engineering; forest resources development; refractory materials sales and furnace maintenance; rice processing; grain sales; packing materials manufacturing; and social enterprise businesses. POSCO was incorporated in 1968 and is headquartered in Pohang, South",
    "website": "http://www.posco.com",
    "zipcode": null
  }
}
