{"000760.KS": {"short_name": "RIFA", "long_name": "Rifa Co.,Ltd.", "summary": "Rifa Co.,Ltd. engages in the wholesale and retail of dyestuffs and chemicals in South Korea. It offers reactive, disperse, acid, cationic, fluorescent, direct, leather, mordant, VAT, and Sulphur dyestuffs. The company also sells organic/inorganic chemicals, such as food additives and solvents. In addition, it is involved in the transportation activities; and rental of land and building. Rifa Co.,Ltd. was founded in 1950 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "001570.KS": {"short_name": "Kumyang", "long_name": "Kumyang Co., Ltd.", "summary": "Kumyang Co., Ltd. produces and sells chemicals in South Korea. It offers blowing agents for polyvinyl chloride (PVC) applications, including insulation tubes, synthetic leathers, sandals, wall and floor coverings, and others; ethylene vinyl acetate (EVA) applications comprising sports shoes, sandals, interlayer noise dampers, baby toys, fishing floats, and other EVA sponges; and polyethylene and polypropylene applications, such as automotive door panels, pipes, thermal insulation, mats, and others. It also provides blowing agents for applications consisting of ethylene propylene diene monomer (EPDM), acrylonitrile-butadiene rubber, chloroprene rubber, and other rubber products that comprise EPDM weather strips, wire coverings, EPDM thermal insulations, diving suits, and rubber sponges, as well as doors, windows, and picture frames; and cap seals and others. In addition, it offers capsulated blowing agents for use in the PVC sandals, artificial leather, screen wall papers, mid sole and outsole of sports shoes, screen printing, and printing inks; and masterbatches with blowing and non-blowing agents. Further, it provides titanium dioxide products, including rutile-type for the use in coating industry, anticorrosive paints, ink, plastics, etc.; and anatase-type for the use in paper, paint, plastic, and rubber industries, as well as in toothpastes, TV, cathode-ray tubes, electronic condensers, electronic parts, photcatalysts, and PET reaction. Additionally, it offers flame retardants, an additive for plastics in construction, automobile, electric appliance, plane, and vessel industries; and other products for synthetic resins, rubber, and plastic additives. It also exports its products to North America, South America, Europe, Oceania, Asia, Africa, and internationally. The company was formerly known as Gumbuk Chemical Industrial Company and changed its name to Kumyang Co., Ltd. in July 1978. The company was founded in 1955 and is headquartered in Busan, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Busan"}, "002840.KS": {"short_name": "MiwonComcl", "long_name": "Miwon Commercial Co., Ltd.", "summary": "Miwon Commercial Co., Ltd. manufactures and markets various chemical products in South Korea and internationally. The company offers personal care ingredients, including anionic, cationic, nonionic, and amphoteric surfactants; hair fixative and conditioning polymers; styling resins; household surfactants, plasticizers, and UV stabilizers; and cosmeceutical active ingredients. It also provides electronic chemicals, such as photo active compounds for micro-patterning of semiconductor circuits and thin film transistors in LCDs; polymer acryl binders and novolak resins for use in LCD and plasma displays, and positive photoresist for LCDs and semiconductors; and functional chemicals and additives for use in positive and negative photoresist for LCD, as well as in process chemicals, such as strippers. In addition, the company offers functional resins used as raw materials for PCBs, components of electronic equipment, materials for high-functional polycarbonate, and high refractive monomers used in manufacturing optical films for displays. Further, it provides antioxidants, including amine, phenol, phosphorus, and sulfur, as well as UV stabilizers that include benzophenone, benzotriazole, nickel quenchers, and HALS; and thiourethane lens monomers. Miwon Commercial Co., Ltd. was founded in 1959 and is headquartered in Anyang, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Anyang-Si"}, "004000.KS": {"short_name": "LOTTE Fine Chem", "long_name": "LOTTE Fine Chemical Co., Ltd.", "summary": "LOTTE Fine Chemical Co., Ltd. manufactures and sells chemical products in Korea. It offers cellulose relatives, including MECELLOSE, hydroxyethyl cellulose, AnyCoat-C (hypromellose), and AnyCoat-P (hypromellose phthalate) for use in various fields, such as construction, cement extrusion, ceramic extrusion, paint, medicine, and household items. The company also provides epichlorohydrin, caustic soda, methyl and methylene chloride, chloroform, sodium hypochlorite, methaclean, hydrochloric acid, and PTAC for use in architecture, textiles, and resins industries. In addition, it offers general chemicals, which include EUROX, ammonia, ammonium hydroxide, monomethyl amine, dimethylamine, trimethylamine, and trimethylamine-HCl; tetramethyl ammonium hydroxide, a material for semiconductor; and polymerized toners for color laser printers. The company was formerly known as SAMSUNG Fine Chemicals Co., Ltd. changed its name to LOTTE Fine Chemical Co., Ltd. in 2016. LOTTE Fine Chemical Co., Ltd. was founded in 1964 and is headquartered in Ulsan, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Ulsan"}, "006380.KS": {"short_name": "CAPRO", "long_name": "Capro Corporation", "summary": "Capro Corporation manufactures and sells caprolactam and ammonium sulfate fertilizers in South Korea. It offers caprolactam for use as a raw material in nylon fibers used in clothing, tire cords, fishing nets, carpets, and nylon resins, as well as for use in manufacturing mechanical parts and engineering plastics. The company also provides ammonium sulfate fertilizer for use as a raw material for mixed and compound fertilizers, as well as for use in artificial silk and cellophane industries, for manufacturing ammonia compounds/various ammonium salts/potash alum/gypsum boards/light bulbs/synthetic resins/medicines, for culturing enzymes, and for leather tanning. In addition, it offers ammonium nitrate and sulfate fertilizers; and methylethylketoxime for use as a construction silicon additive, as well as an additive for preventing wet-paint surface cohesion. The company was formerly known as Korea Caprolactam Co., Ltd. and changed its name to Capro Corporation in February 2001. Capro Corporation was founded in 1969 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "007690.KS": {"short_name": "KukdoChem", "long_name": "Kukdo Chemical Co., Ltd.", "summary": "Kukdo Chemical Co., Ltd. operates as a chemical materials company in South Korea. The company offers epoxy resins; hardeners; and coating, adhesive, flexible, and rigid polyols, as well as rigid, semi-rigid, and flexible polyurethane systems. It also provides electrical and electronic materials; advance materials; acrylate; and reactive diluent. It serves marine paints, heavy-duty coatings, powder coatings, coatings for civil engineering and construction, consumer goods, packaging materials, and materials for transport equipment. The company was formerly known as Kukdo Chemical Industry. Co., Ltd. and changed its name to Kukdo Chemical Co., Ltd. in April 1999. Kukdo Chemical Co., Ltd. was founded in 1972 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "009830.KS": {"short_name": "HANWHA SOLUTIONS", "long_name": "Hanwha Solutions Corporation", "summary": "Hanwha Solutions Corporation operates in the chemicals, energy solutions, and advanced materials business areas in South Korea and internationally. The company offers petrochemical products; and photovoltaic cells and modules. In addition, it builds and operates power plants, as well as retails electricity; and provides lightweight composite materials, photovoltaic materials, and electronic materials. The company is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "009835.KS": {"short_name": "HANWHA SOLUTIONS(1P)", "long_name": "Hanwha Solutions Corporation", "summary": "Hanwha Solutions Corporation operates in the chemicals, energy solutions, and advanced materials business areas in South Korea and internationally. The company offers petrochemical products; and photovoltaic cells and modules. In addition, it builds and operates power plants, as well as retails electricity; and provides lightweight composite materials, photovoltaic materials, and electronic materials. The company is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "011170.KS": {"short_name": "LOTTE CHEMICAL Corp", "long_name": "Lotte Chemical Corporation", "summary": "Lotte Chemical Corporation, a chemical company, manufactures and distributes polymers, monomers, basic petrochemical products, and megatrend products. The company operates through Monomer, Polymer, Basic Petrochemicals, and Others segments. It offers polymer products, including high density, low-density, and linear low-density polyethylene, as well as ethylene-vinyl acetate; transparent-impact resistance polypropylene, as well as polypropylene for injection and blow molding, yarns/fibers, and films; thermoplastic elastomers, adhesive resins, thermoplastic olefins, long fiber reinforced thermoplastics, and expanded polypropylenes; polycarbonates, polycarbonate resins, and acrylonitrile-butadiene-styrene resins; and polyethylene terephthalates. The company also provides monomers, such as ethylene glycols/ethylene oxides; methoxy polyethylene glycols and polyethylene glycols, as well as VPEG, a raw material for third generation admixtures; glycole ethers; methyl methacrylates; purified isophthalic acids; and purified terephthalic acids. In addition, it offers basic petrochemicals comprising benzene, toluene, mixed xylene, meta-xylene, para-xylene, and ortho-xylene, as well as isoprene, dicyclopentadiene, piperylene, and styrene monomers; and water treatment membranes. Further, the company provides property lease and labor dispatch services. It conducts operations in the Republic of Korea, Malaysia, the United States, Pakistan, China, and other regions. The company was formerly known as Honam Petrochemical Corporation and changed its name to Lotte Chemical Corporation in December 2012. Lotte Chemical Corporation was founded in 1976 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "011500.KS": {"short_name": "HANNONG", "long_name": "Hannong Chemicals Inc.", "summary": "Hannong Chemicals Inc. produces and sells chemical raw materials in South Korea. The company offers glycol ethers for use as solvents or industrial intermediates in semiconductors, electronic goods, paints, inks, dyes, detergents, machine oils, brake fluids, and anti-freezing agents; nonionic surfactants; polyols for use as an intermediate for polyurethane, polyester, epoxy, and polycarbonic acid types of plasticizer; and functional monomers for ultra violet and electronic beam system coating. It also provides glyme and propionates for electronic materials; anionic surfactant products for household and industrial detergents, as well as emulsifier for emulsion polymerization; emulsifiers; linear alkyl phosphonic acids for the production of nanoparticles, such as quantum dots, nano-metals, and nano-ceramics; and carbomers, as well as solubilizing and emulsifying agents, humectants, solvents, and preservatives for personal care and cosmetic applications. The company was founded in 1976 and is headquartered in Gunsan, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Gunsan"}, "012610.KS": {"short_name": "KyunginSynth", "long_name": "Kyungin Synthetic Co., Ltd.", "summary": "Kyungin Synthetic Co., Ltd. develops, manufactures, and sells dyes, inks, fine chemicals, and other functional chemical materials for use in textiles, food, agriculture, and electronics in South Korea and internationally. The company offers inks for digital textile printing and UV printing, as well as dyes for inks; reactive dyes, disperse dyes, acid dyes, CDP basic dyes, and optical brightening agents; electronic materials comprising LCD filters and photoinitiators; and fine chemicals, such as saccharin, sulfur-based fine chemicals, and inorganic products. It also provides organic materials for displays; semiconductor photoresist components and materials for coating photoresists; photoactive compounds and pigments; and colorant products. Kyungin Synthetic Co., Ltd. was founded in 1971 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "014440.KS": {"short_name": "YoungboChem", "long_name": "Youngbo Chemical Co., Ltd.", "summary": "Youngbo Chemical Co., Ltd. manufactures and sells cross-linked polyolefin foam in South Korea and internationally. The company offers artiflex, artilon, epilon, heatlon, filmy, polyisocyanurate, and youngboard cross-linked polyolefin foam products. Its products are used in various applications, including automotive interior, home appliance and HVAC/climate control, building and construction, sports and leisure, packaging and cushioning, sundry goods and others, specialty products, IT parts materials, sound absorption material, electronic materials, and wallpaper products. The company was founded in 1979 and is headquartered in Chungju, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Chungju-si"}, "014680.KS": {"short_name": "Hanchem", "long_name": "Hansol Chemical Co., Ltd.", "summary": "Hansol Chemical Co., Ltd., together with its subsidiaries, manufactures and sells various chemicals primarily in South Korea. The company provides various fine chemicals, including hydrogen peroxide, a bleaching agent for semiconductor/LCD, paper pulp, textile, chemical, food/medical, and environmental remediation chemical applications; emulsion type polyacrylamide to handle various industrial wastewater streams; and organic coagulants for treating wastewater; and retention agents, polyamine, and micro capsules for paper making. Its fine chemicals also include synthetic latex products, such as HITEX for paper coating, carpet backing, construction, non-woven, and other applications; Bio-SBL, a grafting copolymer for paper surface sizing and coating binder; HanCellymer, an aqua binder for lithium ion battery; and Hansphere that enhances gloss and opacity of coated paper. In addition, the company's fine chemicals comprise sodium dithionite/sodium hydrosulfite, a bleaching agent used in pulp and textiles, paper, fiber dye, leather, and other industries; and benzoyl peroxide, a polymerization initiator and bleaching agent for chemical and food industries. Further, the company provides electronic materials consisting of optical clear resins that are UV curable adhesives for tablet PC, smart phone, and touch panel devices; conformal coating materials to protect electrodes and flexible circuits of FPD panels; cleaning solutions to prevent curing in the nozzle and valve from coating material remnants; black side sealing resins to prevent leak-light from OLED panels and screening substances; and thermal interface materials, which are used on FPCB chips. Additionally, it provides thin film materials for the semiconductor industry. The company was formerly known as Hansol Chemience co., Ltd. and changed its name to Hansol Chemical Co., Ltd. in March 2004. The company was founded in 1980 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "015890.KS": {"short_name": "TaekyungInd", "long_name": "Taekyung Industry.Co., Ltd.", "summary": "Taekyung Industry.Co., Ltd. manufactures and sells ultra-fine ground calcium carbonate, ferroalloy, and hydrogen sulfide adsorbent basic materials in South Korea and internationally. The company offers ferroalloy products, such as high-carbon ferromanganese and silico-manganese products. It also provides liquid-type ultrafine heavy calcium carbonate for coating art paper and whiteboards, as well as for matte paper, water-based paints, and pillars. In addition, the company offers DETOX-S to absorb hydrogen sulfide; DETOX-B to absorb basic gas; and carbides. Further, it provides lime products, such as quicklime, slaked lime, calcium hydroxide, and light calcium carbonate; petro coke fuel; zinc oxide and zinc dust products; vaporizers; steelmaking refining agents; and various industrial gases, including acetylene, oxygen, carbon dioxide, nitrogen, LPG, and argon, as well as various environmental treatment agents, such as liquid calcified lime. Additionally, the company offers halogen bulbs automobiles; lamps; and LED lighting products, as well as operates highway rest areas; and service areas, gas stations, and LPG charging stations. Taekyung Industry.Co., Ltd. was founded in 1975 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "017960.KS": {"short_name": "HankukCarbon", "long_name": "Hankuk Carbon Co., Ltd.", "summary": "Hankuk Carbon Co., Ltd. produces and sells composite materials in South Korea. It offers carbon prepregs for airplanes and industrial applications, as well as carbon fiber sheets for repairing buildings and bridges; and LNG heat insulation panels for storage and transportation applications. The company also provides glass papers for use in floor decoration materials, tile carpets, print substrates, waterproof streets, heat insulation panels, and filters. In addition, it offers components of vehicles and trains, interior and exterior sandwich panels, and heat insulating panels for vessels, as well as laminates for archery, electrical insulation, and building reinforcement products. Further, the company provides copper cladded laminates of PCB substrates; and dry films, as well as household and semiconductor package products. Hankuk Carbon Co., Ltd. was founded in 1984 and is headquartered in Miryang, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Miryang-si"}, "025000.KS": {"short_name": "KPXCHEMICAL", "long_name": "KPX Chemical Co.,Ltd.", "summary": "KPX Chemical Co.,Ltd. manufactures and sells polyols in South Korea. The company offers polymer polyols, PU systems, and general base polyols. Its products include polyurethane for use in furniture/bedding, automotive, refrigerator, construction materials/LNG insulation, C.A.S.E, and other companies; and electron materials for semiconductor and LCD chemical companies. KPX Chemical Co.,Ltd. was founded in 1974 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "051630.KS": {"short_name": "ChinYangChem", "long_name": "Chinyang Chemical Corporation", "summary": "Chinyang Chemical Corporation manufactures and sells chemical products in South Korea. It offers PVC floor coverings for residential and commercial use; and PVC leather for home, general, and office furniture applications, as well as for automobile seats, various bags, synthetic leather clothes, and other applications. The company also provides non-PVC artificial leather products under the FRIEN name; PVC tarpaulin products; wallpapers; and PVC deco sheets. The company was founded in 1963 and is headquartered in Ulsan, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Ulsan"}, "069260.KS": {"short_name": "Huchems", "long_name": "Huchems Fine Chemical Corporation", "summary": "Huchems Fine Chemical Corporation manufactures and sells fine and basic chemical products in South Korea and internationally. It operates through Chemical and Environment-Friendly divisions. Its fine chemicals comprise DNT, a raw material of TDI for use in polyurethanes and explosives, as well as serves as a base material for styrofoam, plastic, and synthetic leather applications; and mononitrobenzene, a raw material of MDI and polyurethanes, which is used as a material for auto interior/exterior applications, as well as a base material in making of artificial timber, insulation in electrical equipment, construction materials, packaging material, and synthetic leather. The company's fine chemical products also include dilute nitric acid for use in metallurgy, concentrated nitric acid, ammonium nitrate, polyurethane, etc., as well as for textile dyes and pigments; and concentrated nitric acid that is used in explosives, decolorizing agents, DNT, medicines, etc., as well as for use as synthetic fiber raw material; and ammonium nitrate as a raw material for explosives, and gas for semiconductors and medical gas. In addition, it offers methanol, which is used to produce MTBE for fuel oil or denatured alcohol and for materials synthesis of formaldehyde; urea for industry for use in resins, paints, feeds, synthetic detergents, wastewater treatments, dyes, etc., as well as for producing adhesives; and ammonia to produce fertilizers, caprolactam, nitric acid, ammoniation of rice straw and refrigerants, and ammonia as a patent medicine and flavor producing material. The company is also involved in the clean development mechanism project business; and provision of urea solutions. Huchems Fine Chemical Corporation was founded in 2002 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "093370.KS": {"short_name": "FOOSUNG", "long_name": "Foosung Co., Ltd.", "summary": "Foosung Co., Ltd. manufactures and sells chemicals in South Korea. It offers refrigerants, such as organic fluorine compounds and polyurethane resins; lithium secondary cells; and inorganic fluorine compounds and other products. The company also provides specialty gases, including semiconductor gases, which are used by semiconductor manufacturing industries; mixture gases for use in welding, laser, medical, marine, and radiometric applications; calibration standard gases used for the calibration of analyzers, as well as for quality control and process control activities; ultra-high purity gases for experimentation and research activities in the semiconductor, petrochemical, and metalworking industries; and other specialty gases. In addition, it is involved in the clean development mechanism operations. The company was founded in 1983 and is headquartered in Hwaseong, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Hwaseong-si"}, "120110.KS": {"short_name": "KOLON IND", "long_name": "Kolon Industries, Inc.", "summary": "Kolon Industries, Inc. engages in industrial materials, chemicals, films/electronic materials, and fashion businesses. The company produces and sells industrial materials, such as polyester and hybrid tire cords; airbags; technical yarn; artificial leather; polyester spunbond nonwoven fabrics under the FINON brand; aromatic amide under the Heracron brand; and CleanfilÂ\u0096S, a water treatment membrane, as well as Ecomate-H, a hydrogen fuel cell membrane humidifier. It also offers polyester, nylon, coated, and prism films; dry film resist; and materials for panels, such as overcoat, encapsulation, and low temperature materials. In addition, the company provides hydrocarbon resins; phenolic resins under the HiRENOL brand; epoxy resins under the HiROXY brand; polyurethane resins; and PET resins under the INOPET brand. Further, it manufactures outdoor, sports, and golf clothing products under the KOLON SPORT, HEAD, ELORD, Jack Nicklaus, WAAC, ELORD CLUB, and HONMA brands; men's casuals under the Series, Customellow, CAMBRIDGE MEMBERS, GGIO II, epigram, Henry Cottons, brentwood, and S'LOW brands; and women's casual wear under the LUCKY CHOUETTE. Additionally, the company offers fashion shoes under the SUECOMMA BONNIE; handbags, shoes, and other accessories under the COURONNE brand; and other fashion products under the BLNKBLANC and ArchivÃ©pke brands; premium fashion products under the Marc Jacobs, NEIL BARRETT, LOEWE, and IRO brands; upcycling and redesigning fashion clothes under the RE;CODE brand; and cosmetics under the M.CURIE brand. Furthermore, it operates Common Ground, a container complex shopping mall; Kolon Mall, a fashion and lifestyle online mall; Jane's, a women's fashion and lifestyle online shop; BySeries, an urban vintage multi-brand shop that offers various fashion products; online and offline integrated logistics center; and global sourcing platform. Kolon Industries, Inc. was founded in 1957 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "120115.KS": {"short_name": "KOLON IND(1P)", "long_name": "Kolon Industries, Inc.", "summary": "Kolon Industries, Inc. engages in industrial materials, chemicals, films/electronic materials, and fashion businesses. The company produces and sells industrial materials, such as polyester and hybrid tire cords; airbags; technical yarn; artificial leather; polyester spunbond nonwoven fabrics under the FINON brand; aromatic amide under the Heracron brand; and CleanfilÂ\u0096S, a water treatment membrane, as well as Ecomate-H, a hydrogen fuel cell membrane humidifier. It also offers polyester, nylon, coated, and prism films; dry film resist; and materials for panels, such as overcoat, encapsulation, and low temperature materials. In addition, the company provides hydrocarbon resins; phenolic resins under the HiRENOL brand; epoxy resins under the HiROXY brand; polyurethane resins; and PET resins under the INOPET brand. Further, it manufactures outdoor, sports, and golf clothing products under the KOLON SPORT, HEAD, ELORD, Jack Nicklaus, WAAC, ELORD CLUB, and HONMA brands; men's casuals under the Series, Customellow, CAMBRIDGE MEMBERS, GGIO II, epigram, Henry Cottons, brentwood, and S'LOW brands; and women's casual wear under the LUCKY CHOUETTE. Additionally, the company offers fashion shoes under the SUECOMMA BONNIE; handbags, shoes, and other accessories under the COURONNE brand; and other fashion products under the BLNKBLANC and ArchivÃ©pke brands; premium fashion products under the Marc Jacobs, NEIL BARRETT, LOEWE, and IRO brands; upcycling and redesigning fashion clothes under the RE;CODE brand; and cosmetics under the M.CURIE brand. Furthermore, it operates Common Ground, a container complex shopping mall; Kolon Mall, a fashion and lifestyle online mall; Jane's, a women's fashion and lifestyle online shop; BySeries, an urban vintage multi-brand shop that offers various fashion products; online and offline integrated logistics center; and global sourcing platform. Kolon Industries, Inc. was founded in 1957 and is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}, "134380.KS": {"short_name": "MCC", "long_name": "Miwon Chemicals Co., Ltd.", "summary": "Miwon Chemicals Co., Ltd. develops, manufactures, and sells performance chemicals for use in the rubber, detergent, and personal care industries worldwide. Its products include sulfurs; sulfuric acids, oleums, and refined sulfuric acids; linear alkylbenzene and dodecylbenzene sulphonic acids; alkyl and alkyl ether sulfates; and rubber chemicals, such as prevalcanization inhibitors and tire bonding agents. The company was founded in 1959 and is headquartered in Anyang, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Anyang"}, "268280.KS": {"short_name": "MIWON SC", "long_name": "Miwon Specialty Chemical Co., Ltd.", "summary": "Miwon Specialty Chemical Co., Ltd. engages in the production and supply of basic raw materials for UV/EB curing systems in Korea and internationally. The company's product line includes acrylate and methacrylate monomers, oligomers, photoinitiators, and other related fine chemicals. Its products are used in wood, metal, plastic, nail art, printing ink, adhesive, electronic, optical film, and CD/DVD/Bluray applications. The company was founded in 1959 is headquartered in Yongin, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Yongin-Si"}, "298000.KS": {"short_name": "HYOSUNG CHEM", "long_name": "Hyosung Chemical Corporation", "summary": "Hyosung Chemical Corporation produces and sells a range of chemical products in South Korea and internationally. The company offers polypropylene (PP)/DH, PP-R and PP-B for pipes, medical PP, PP for transparent containers and special films, PP for compounding and heat resistant appliances, and PP for caps and other applications under the TOPILENE brand name. It also provides nylon films used for food packaging and as a packaging material for various household products; and PET films used for electric and electronic materials, as well as various other industrial materials, including packaging and optic materials. In addition, the company offers high-purity terephthalic acid, which is used as a raw material for polyester fibers, as well as to produce tire cords, pet bottles, and polyester films; and NF3 and special industrial gases used for high-tech products, such as semiconductors, displays, and solar cells. Further, it provides tri-acetyl cellulose films for LCDs; and POKETONE polymer. Hyosung Chemical Corporation is headquartered in Seoul, South Korea.", "currency": "KRW", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Seoul"}}