{
  "001020.KS": {
    "city": "Gunsan-si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "PaperCorea Inc.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "PaperCorea",
    "state": null,
    "summary": "PaperCorea Inc. manufactures and sells paper products in South Korea and internationally. The paper manufacturing business include sack kraft papers, shopping bags, woven lamination paper, container board, and newsprint products, as well as specialty papers for PCB, saturating paper, saturating news, etc. It also engages in the real estate development comprising education, culture, art, shopping, and residence projects. The company was founded in 1944 and is headquartered in Gunsan-si, South Korea.",
    "website": "http://www.papercorea.co.kr",
    "zipcode": "54003"
  },
  "004150.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Hansol Holdings Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "HANSOL HOLDINGS",
    "state": null,
    "summary": "Hansol Holdings Co., Ltd. engages in the paper material and business solution businesses in South Korea. The company offers corrugated container boards, including liner boards, test liner boards, and corrugated medium papers; interior materials for flooring, wall, door, molding, and sheets applications; furniture components, such as MDF and processed boards; and overseas afforestation and renewable energy services. It provides engineering, purchasing, procurement, construction, and O&M services in the areas of incineration, power plant, and complex environment plant; management advice and consultation services; electronics power module, wireless charging, solar module and generation, LED material, and mobile phone parts and EMS products; and IT chemicals, fine chemicals, and eco-friendly chemicals. In addition, the company engages in the sea and air logistics, container and truck transportations, and W&D business; and tributary distribution, IT services, etc. Hansol Holdings Co., Ltd. was founded in 1965 and is headquartered in Seoul, South Korea.",
    "website": "http://www.hansol.com",
    "zipcode": null
  },
  "004540.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "KleanNara Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "KleanNara",
    "state": null,
    "summary": "KleanNara Co., Ltd. manufactures and sells paper products in South Korea. The company offers rolls, cosmetic tissues, kitchen towels, wet wipes, sanitary pads, diapers for babies and adults, jumbo rolls, hand towels, and napkins. It also provides hand sanitizer gels; industrial packaging papers for pharmaceuticals, cosmetics, household items, confectionery, and stationery; food packing papers; and special papers for transportation of refrigerated/frozen goods and heavy containers. The company also exports its products to approximately 40 countries under the White Horse and Best Coat brands. KleanNara Co., Ltd. was founded in 1966 and is headquartered in Seoul, South Korea.",
    "website": "http://www.kleannara.co.kr",
    "zipcode": null
  },
  "004545.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "KleanNara Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "KleanNara(1P)",
    "state": null,
    "summary": "KleanNara Co., Ltd. manufactures and sells paper products in South Korea. The company offers rolls, cosmetic tissues, kitchen towels, wet wipes, sanitary pads, diapers for babies and adults, jumbo rolls, hand towels, and napkins. It also provides hand sanitizer gels; industrial packaging papers for pharmaceuticals, cosmetics, household items, confectionery, and stationery; food packing papers; and special papers for transportation of refrigerated/frozen goods and heavy containers. The company also exports its products to approximately 40 countries under the White Horse and Best Coat brands. KleanNara Co., Ltd. was founded in 1966 and is headquartered in Seoul, South Korea.",
    "website": "http://www.kleannara.co.kr",
    "zipcode": null
  },
  "006740.KS": {
    "city": "Pyeongtaek-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Young Poong Paper Mfg Co.,Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "YoungpoongPaprMfg",
    "state": null,
    "summary": "Young Poong Paper Mfg Co.,Ltd. manufactures and sells paper products. It offers core boards that are used in manufacturing paper cores and tubes; and liner boards for use in manufacturing corrugated boards and boxes. The company was founded in 1970 and is headquartered in Pyeongtaek, South Korea. Young Poong Paper Mfg Co.,Ltd. is a subsidiary of Growth Investment Purpose Company I Co., Ltd.",
    "website": "http://www.yp21.co.kr",
    "zipcode": null
  },
  "009200.KS": {
    "city": "Jinju-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Moorim Paper Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "MOORIM PAPER",
    "state": null,
    "summary": "Moorim Paper Co., Ltd. manufactures and sells paper products. It offers printing papers, such as art and white papers; and produces and sells bleach chemical pulps. The company also engages in the installment financing, and facility rental businesses; and wholesale of paper and pulp products. In addition, it produces and sells steam and electricity. The company was founded in 1973 and is headquartered in Jinju, South Korea.",
    "website": "http://www.moorim.co.kr",
    "zipcode": "52809"
  },
  "009460.KS": {
    "city": "Yangsan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Hanchang Paper Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "HanchangPaper",
    "state": null,
    "summary": "Hanchang Paper Co., Ltd. develops, manufactures, and sells bio-degradable bio-mass materials/products in South Korea. It offers art boards under the I PAPERS brand; duplex boards, including ivory, SC, and TM paperboards; and functional white paper boards. The company also provides cups, lids, sleeves, shopping bags/envelops, films, forks/spoons/knives, and various kind of containers under Greenus brand name. Hanchang Paper Co., Ltd. was founded in 1973 and is headquartered in Yangsan, South Korea.",
    "website": "http://www.hcpaper.co.kr",
    "zipcode": null
  },
  "009580.KS": {
    "city": "Ulsan",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Moorim P&P Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "Moorim P&P",
    "state": null,
    "summary": "Moorim P&P Co., Ltd. engages in the production and sale of paper and pulp products in South Korea and internationally. The company produces and sells bleached chemical pulp and magnesium hydroxide. It also manufactures and sells printing papers, including art and white papers; and engages in the provision of credit and forestry businesses. The company was founded in 1974 and is headquartered in Ulsan, South Korea.",
    "website": "http://www.moorim.co.kr",
    "zipcode": null
  },
  "009770.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Samjung Pulp Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "SAMJUNGPULP",
    "state": null,
    "summary": "Samjung Pulp Co., Ltd. produces hygiene papers in South Korea. The company offers toilet papers, kitchen towels, wet and beauty tissues, and other products for household appliances; adult diapers; and other products, such as napkins, hand towels, and jumbo roll products and hand roll towel. It provides its products under the Pure Promise and Living Tissue brands. The company was founded in 1974 and is headquartered in Seoul, South Korea.",
    "website": "http://www.sjpulp.com",
    "zipcode": null
  },
  "010420.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Hansol PNS Co.,Ltd.",
    "market": "kr_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "HANSOLPNS",
    "state": null,
    "summary": "Hansol PNS Co.,Ltd. provides IT outsourcing and solutions, and system integration services. The company provides industry-specific outsourcing services for manufacturing, logistics, construction, leisure, environment, public service, and communication industries. It services portfolio includes service level agreement, information strategy service, established medium and long term information strategy, IT outsourcing planning, service level management, information investment performance management, CIO council operations, application services, maintenance management, performance improvement management, user support, disaster recovery service, remote CD tape archive, disaster recovery action plan, recovery test, electronic recovery, security management service, intrusion detection, server vulnerability management, virus protection, security situation report, and security tool installation and management. Hansol PNS Co.,Ltd. offers IT services in the field of application services, IT infrastructure, disaster recovery, and security management. The company was formerly known as Hansol PNS Co.,Ltd. and changed its name to HansolPNS Co., Ltd. in June 2008. Hansol PNS Co.,Ltd. was founded in 1975 and is based in Seoul, South Korea.",
    "website": "http://it.hansolpns.com",
    "zipcode": null
  },
  "016590.KS": {
    "city": "Ansan-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Shindaeyang Paper Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "ShindaeyangPapr",
    "state": null,
    "summary": "Shindaeyang Paper Co., Ltd. engages in the production and sale of stencil paper in Korea. It offers base papers for corrugated cardboards; and corrugated cardboard/boxes, single, double, and triple wall corrugated fiber boards. The company was founded in 1982 and is based in Ansan, South Korea.",
    "website": "http://www.dygroup.co.kr",
    "zipcode": null
  },
  "027970.KS": {
    "city": "Daegu",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "seha corporation",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "seha",
    "state": null,
    "summary": "seha corporation operates in the paper board industry in South Korea. It offers industrial papers, including duplex boards with gray back, uncoated duplex boards with gray back, coated pizza box boards, duplex boards with white back, folding box boards, SBS-two side coated, cast coated papers, and cast white boards; and food wrapping/functional papers, such as solid bleached high bulk, kraft liner boards, coated fresh SC, and carrier boards. The company also provides fancy papers, including glacis; and transfer papers, such as sublimation inkjet papers. seha corporation exports its products to 20 countries. The company was formerly known as Serim Paper Manufacturing Co., Ltd. and changed its name to seha corporation in 2007. seha corporation was founded in 1984 and is headquartered in Daegu, South Korea. As of May 14, 2020, seha corporation operates as a subsidiary of Hankuk Paper Mfg. Co., Ltd.",
    "website": "http://www.seha.co.kr",
    "zipcode": null
  },
  "213500.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Paper & Paper Products",
    "long_name": "Hansol Paper Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HANSOLPAPER",
    "state": null,
    "summary": "Hansol Paper Co., Ltd. produces, distributes, and sells paper products in South Korea and internationally. It offers printing and writing, specialty, fine, and thermal paper products, as well as carton boards used in various packaging materials for medicines, confectionary, daily supplies, etc. The company was formerly known as Chonju Paper Mfg. Co., Ltd. and changed its name to Hansol Paper Co., Ltd. in October 1992. Hansol Paper Co., Ltd. was founded in 1965 and is headquartered in Seoul, South Korea.",
    "website": "http://www.hansolpaper.co.kr",
    "zipcode": null
  }
}
