{
    "1201.SR": {
        "short_name": "Takween Advanced Industries Co.",
        "long_name": "Takween Advanced Industries",
        "summary": "Takween Advanced Industries produces and sells plastic packaging products in the Kingdom of Saudi Arabia and the Arab Republic of Egypt. It operates through Disposable Polystyrene Cups, Lids, and Other Plastic Related Products; and Non-Woven Fabrics segments. The company offers polyethylene terephthalate (PET) preforms and bottles for water, juices, and other beverages, and home and personal care products; HDPE bottles and containers; and flexible packaging products, including plastic films and sheets. It also provides caps and closures for the mineral water, soft drink, juice, dairy, and food industries; disposable white, semitransparent, and transparent polystyrene cups and lids for the beverage industry; and industrial crates, pallets, pails, buckets, plastic plates, cups, utensils, tables and chairs, and others, as well as drums. In addition, the company offers nonwoven fabrics comprising polypropylene spunbonded and spunmelt nonwoven products for use in consumer, medical, or industrial applications; the construction, automotive, home furnishings, and packaging sectors; and babies' products, feminine care, etc., as well as gowns, drapes, and sterile wraps for medical applications. Further, it is involved in the manufacture and wholesale trading of films; manufacture, wholesale, and retail trading of plastic containers and polyethylene cups, rolls, and bags; and management and operation of industrial centers. Additionally, the company owns land; establishes industrial institutes, and provides and coordinates training courses related to the development of plastic products; and establishes, manages, operates, and maintains various industrial projects, as well as engages in the import and export, wholesale, and retail of plastic products. The company was formerly known as Al-Othman Plastic Products. Takween Advanced Industries was founded in 1993 and is headquartered in Al Khobar, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Al Khobar"
    },
    "1213.SR": {
        "short_name": "Naseej International Trading Co",
        "long_name": "Naseej International Trading Co.",
        "summary": "Al Sorayai Trading and Industrial Group Company engages in the manufacture, wholesale, and retail trade of carpets and rugs. The company also imports and sells textiles, curtains, and blankets, as well as polypropylene yarns and threads. It also offers its products online. The company was founded in 1953 and is based in Jeddah, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Jeddah"
    },
    "1810.SR": {
        "short_name": "Seera Group Holding",
        "long_name": "Seera Holding Group",
        "summary": "Seera Holding Group, together with its subsidiaries, provides travel and tourism services primarily in the Kingdom of Saudi Arabia, the United Kingdom, Egypt, the United Arab Emirates, Spain, and Lebanon. The company operates through Ticketing, Tourism, Transportation, Property Rentals, and Hospitality segments. It offers air, ferry, and train ticketing services; hotel booking, package holidays, and rooms on rent; car rental, chartered flights, and delivery of shipments services; and property investment and rental services. The company is also involved in event management, IT support, advertising, insurance brokerage, and triptique and international driving license business; and ownership and operation of aircraft, and sports business association activities. It also provides cargo, telecommunication, and hospitality services; SMS/MMS services; online shopping services for fashion and accessories; Hajj and Umrah tours services; and professional drivers. The company offers its products and services under the Discover Saudi, Almosafer, tajawal, Elaa, Mawasim, and Lumi brands. The company was formerly known as Al Tayyar Travel Group Holding Company and changed its name to Seera Holding Group in April 2019. Seera Holding Group was founded in 1979 and is based in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "1820.SR": {
        "short_name": "Abdulmohsen Alhokair Group for ",
        "long_name": "Abdulmohsen Al-Hokair Group for Tourism and Development Company",
        "summary": "Abdulmohsen Al-Hokair Group for Tourism and Development Company operates primarily in the hospitality and entertainment sectors in the Kingdom of Saudi Arabia and the United Arab Emirates. It operates hotels and resorts, restaurants, and meeting and event venues. The company was founded in 1965 and is based in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "1830.SR": {
        "short_name": "Leejam Sports Co",
        "long_name": "Leejam Sports Company",
        "summary": "Leejam Sports Company owns, operates, and manages sports and fitness centers in the Kingdom of Saudi Arabia and the United Arab Emirates. The company principally operates seven brands, including Fitness Time Plus, a fitness center for high net worth individuals; Fitness Time, a business class center; Fitness Time Pro, an economy class center for fitness professionals; Fitness Time Junior, a special center for kids and youth; Fitness Time Ladies; Fitness Time Ladies Pro; and Fitness Time Academy, a football and team-sports training center for young athletes. As of January 28, 2021, it operated approximately 137 fitness centers. The company was founded in 2005 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "2180.SR": {
        "short_name": "Filing and Packing Materials Ma",
        "long_name": "Filling and Packing Materials Manufacturing Company",
        "summary": "Filling and Packing Materials Manufacturing Company develops, produces, and sells jumbo bags and other woven poly-propylene packaging products for industrial, agricultural, and general applications in the Kingdom of Saudi Arabia and internationally. It offers jumbo bags for packing, handling, storage, and transport of materials in bulk quantities; small PP woven bags for packing fertilizers, feeds, grains, barley, flour, salt, sugar, seeds, and other lumpy and fine materials; and valve bags for packing cement, chemical material, feeds, fertilizers, etc. The company also provides strapping bands, which are used to strap small and big boxes, bales, bricks, and various other products; and cable filler yarns and sewing threads used in the manufacture of electric cables. In addition, it offers flame-retardant and conductive fabrics and sacks, including tubular rolls or sheets; and container liner products for transport of dry flow able products. Filling and Packing Materials Manufacturing Company was founded in 1991 and is based in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "2340.SR": {
        "short_name": "Al Abdullatif Industrial Invest",
        "long_name": "Al Abdullatif Industrial Investment Company",
        "summary": "Al Abdullatif Industrial Investment Company, together with its subsidiaries, manufactures and sells carpets worldwide. The company offers tufted and woven carpets, BCF yarns, carpet backings, masterbatches and colors, paper tubes, blankets, and rugs. It sells its products directly to manufacturers, exporters, importers, and retailers. The company was formerly known as Saudi Carpet Factory and changed its name to Al Abdullatif Industrial Investment Company in 2007. The company was founded in 1981 and is based in Riyadh, the Kingdom of Saudi Arabia. Al Abdullatif Industrial Investment Company is a subsidiary of Al-Abdullatif Group Holding Company.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "3007.SR": {
        "short_name": "Zahrat Al Waha for Trading Co.",
        "long_name": "Zahrat Al Waha For Trading Company",
        "summary": "Zahrat Al Waha For Trading Company produces and sells plastic bottles preforms and plastic caps. It operates in Asia, Africa, Europe, the Kingdom of Saudi Arabia, and Gulf countries. The company also exports its products. Zahrat Al Waha for Trading Company was founded in 2003 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "4001.SR": {
        "short_name": "Abdullah Al Othaim Markets Co.",
        "long_name": "Abdullah Al-Othaim Markets Company",
        "summary": "Abdullah Al-Othaim Markets Company, together with its subsidiaries, engages in the wholesale and retail trade of food supplies and other products in the Kingdom of Saudi Arabia and Egypt. The company imports, exports, wholesales, and retails food products, wheat, rice, fish, meat, dairy products, ghee, olive, halawa, pasta, and soft drinks, as well as fruits, vegetables, and agricultural products; livestock and household items; and ready-made clothes, sport clothes, jewelry, sewing tools, bags, leather products, decorations, dropped ceilings, and vehicles spare parts. It also establishes, operates, manages, and maintains supermarkets, commercial complexes, bakeries, and cafes; and provides catering, as well as labor services regarding house workers and employment in the public and private sectors. In addition, the company maintains training and educational, entertainment, and sports centers; offers computer services for application systems and databases; establishes agriculture projects; and undertakes general contracting, electrical and electronic, and reinforcing and carpentry works, as well as construction, maintenance, demolition, and restoration works primarily for highways, roads, streets, and bridges. Further, it is involved in the vegetables and fodder cultivation, livestock, poultry breeding, and general trading businesses; acquisition of land to construct buildings for lease or sale; and contracting of buildings. The company was formerly known as Abdullah Saleh Al-Othaim Markets Company and changed its name to Abdullah Al-Othaim Markets Company in September 2007. Abdullah Al-Othaim Markets Company was founded in 1956 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "4012.SR": {
        "short_name": "Thob Al Aseel Co.",
        "long_name": "Thob Al Aseel Co.",
        "summary": "Thob Al Aseel Co. develops, imports, exports, wholesales, and retails textiles and apparel products in Saudi Arabia. It operates in Clothing Sector and Textiles Sector segments. The company offers thobes, pants, underwear, pajamas, and sleeping robes, as well as miscellaneous products, such as T-shirts, cotton socks, caps, and ehrams. It also operates stores that sell clothing products. Thob Al Aseel Co. was founded in 1987 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "4180.SR": {
        "short_name": "Fitaihi Holding Group",
        "long_name": "Fitaihi Holding Group",
        "summary": "Fitaihi Holding Group provides gold, jewelry, and luxury products primarily in Saudi Arabia. The company offers gifts, crystal and silverware products, antiques, chinaware, textiles, leather goods, chocolates, bed-linen, toilet sets, and accessories, as well as men's, women's, and children's wear products. It also produces agricultural products comprising wheat, potato, onion, fruits, fodder, honey, yellow corn, olive, and olive oil products, as well as animal products. In addition, the company engages in the cleaning and operation of factories, companies, buildings, and shops; and offers public, air conditioner, machinery, equipment, vehicle and device maintenance, and commercial services. Further, it is involved in the investment business, as well as operates healthcare facilities. The company retails its products and acts as an agent/distributor of various brand names, including Mont Blanc, Dunhill, Sarcar, Louis Erard, Saint Louis, Scintilla Monaco, Marina B, Talento, Rebecca, Robbe & Berking, Moser, Guy DeGrenne, Aynsley, Noritake, Nachtmann, Fratelli Rosetti, Derek Rose, Fabio Inghirami, Lanvin, Zimmerli, etc. It also exports its products. Fitaihi Holding Group was founded in 1907 and is based in Jeddah, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Jeddah"
    },
    "4190.SR": {
        "short_name": "Jarir Marketing Co.",
        "long_name": "Jarir Marketing Company",
        "summary": "Jarir Marketing Company, together with its subsidiaries, engages in the retail and wholesale trading of office and school supplies. It operates through Retail Outlets and Wholesale segments. The company sells children's toys and educational aids, Arabic and English books and publications, arts and crafts materials, computer peripherals and software, smart phones and accessories, audio visual instruments, video games, smart TVs, and photography tools, as well as maintains computers and electronic items. It is also involved in the online sale of products through Jarir.com website Jarir Bookstore app; and investment of office, retail, and residential properties. Jarir Marketing Company sells its products under the Jarir bookstore brand name. As of November 24, 2020, the company had 62 showrooms in the Kingdom of Saudi Arabia and other Gulf countries. Jarir Marketing Company was founded in 1974 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "4191.SR": {
        "short_name": "Abdullah Saad Mohammed Abo Moat",
        "long_name": "Abdullah Saad Mohammed Abo Moati Stationaries Company",
        "summary": "Abdullah Saad Mohammed Abo Moati Stationaries Company operates bookstores in the Kingdom of Saudi Arabia. Its stores offer stationery products and ink. The company is based in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "4200.SR": {
        "short_name": "Aldrees Petroleum and Transport",
        "long_name": "Aldrees Petroleum and Transport Services Company",
        "summary": "Aldrees Petroleum and Transport Services Company engages in the wholesale and retail of fuel, gasoline, lubricant, and oil in the Kingdom of Saudi Arabia. The company operates through Petroleum Services and Transport Services segments. It operates approximately 544 fuel stations. The company offers various services related to additives, car wash, tire servicing, alignment, accessories, food, mosque, ATMs, car rental, etc. at its fuel stations. It also provides transportation and logistics services through a fleet of trucks and trailers. The company was founded in 1957 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "4240.SR": {
        "short_name": "Fawaz Abdulaziz Alhokair Co.",
        "long_name": "Fawaz Abdulaziz AlHokair & Co.",
        "summary": "Fawaz Abdulaziz AlHokair & Co., together with its subsidiaries, engages in the wholesale and retail of fashion apparels. It operates through three segments: Fashion Retail, Indoor Entertainment, and Food and Beverage. The company's stores offer fashion products for men, women, and kids; shoes and accessories; cosmetics; food and beverages; lingerie; and electronics products. It is also involved in the indoor entertainment business for kids; and operation of department stores, cafes, and restaurants. The company has operations in the Kingdom of Saudi Arabia, Jordan, Egypt, the Republic of Kazakhstan, the United States, the Republic of Azerbaijan, Georgia, Armenia, and Morocco. It operates approximately 1,750 stores across 100 shopping malls. The company was founded in 1990 and is based in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "6002.SR": {
        "short_name": "Herfy Food Services Co.",
        "long_name": "Herfy Food Services Company",
        "summary": "Herfy Food Services Company establishes, operates, and franchises restaurants primarily in the Kingdom of Saudi Arabia. The company's restaurants offer cooked meals to companies and others. As of December 31, 2018, it owned 40 restaurants and leased 329 restaurants under the HERFY name in the Kingdom of Saudi Arabia. The company also franchises restaurants in Kuwait, the United Arab Emirates, Egypt, and Bahrain; provides catering services; manufactures and sells meat products, as well as bakery and pastry, and sweets and chocolate products; and operates bakeries. In addition, it purchases and sells land for constructing buildings; and owns, uses, maintains, and leases stores and food store fridges. The company was founded in 1981 and is based in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "6012.SR": {
        "short_name": "Raydan Food Co.",
        "long_name": "Raydan Food Co.",
        "summary": "Raydan Food Co. establishes, owns, operates, and manages restaurants. The company offers Arab meals, and cooked and uncooked catering services. It is also involved in the holding of concerts; management of factories; sale and purchase of livestock; sale and delivery of finished paintings; general contracting; real estate investment; import and export; and wholesale and retail trade activities. The company was formerly known as Raydan Co. Raydan Food Co. was founded in 2008 and is headquartered in Jeddah, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Jeddah"
    }
}