{
  "4011.SR": {
    "city": "Riyadh",
    "country": "Saudi Arabia",
    "currency": "SAR",
    "exchange": "SAU",
    "industry": "Luxury Goods",
    "long_name": "L'azurde Company for Jewelry",
    "market": "sr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Lazurde Company for Jewelry",
    "state": null,
    "summary": "L'azurde Company for Jewelry, together with its subsidiaries, produces, manufactures, forms, and forges golden wares, jewelry, precious stones, and golden alloys. It operates in Wholesale and Retail segments. The company also distributes glasses, watches, accessories, pens, perfumes, and leather products; and manages franchises and trademarks; as well as exports gold wares, alloys, and silver. It primarily operates in the Kingdom of Saudi Arabia, Egypt, the United Arab Emirates, Kuwait, the Sultanate of Oman, and Qatar. The company was founded in 1980 and is headquartered in Riyadh, the Kingdom of Saudi Arabia. L'azurde Company for Jewelry is a subsidiary of L'Azurde Holding Company.",
    "website": "http://www.lazurde.com",
    "zipcode": "11521"
  },
  "4180.SR": {
    "city": "Jeddah",
    "country": "Saudi Arabia",
    "currency": "SAR",
    "exchange": "SAU",
    "industry": "Luxury Goods",
    "long_name": "Fitaihi Holding Group",
    "market": "sr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Fitaihi Holding Group",
    "state": null,
    "summary": "Fitaihi Holding Group provides gold, jewelry, and luxury products primarily in Saudi Arabia. The company offers gifts, crystal and silverware products, antiques, chinaware, textiles, leather goods, chocolates, bed-linen, toilet sets, and accessories, as well as men's, women's, and children's wear products. It also produces agricultural products comprising wheat, potato, onion, fruits, fodder, honey, yellow corn, olive, and olive oil products, as well as animal products. In addition, the company engages in the cleaning and operation of factories, companies, buildings, and shops; and offers public, air conditioner, machinery, equipment, vehicle and device maintenance, and commercial services. Further, it is involved in the investment business, as well as operates healthcare facilities. The company retails its products and acts as an agent/distributor of various brand names, including Mont Blanc, Dunhill, Sarcar, Louis Erard, Saint Louis, Scintilla Monaco, Marina B, Talento, Rebecca, Robbe & Berking, Moser, Guy DeGrenne, Aynsley, Noritake, Nachtmann, Fratelli Rosetti, Derek Rose, Fabio Inghirami, Lanvin, Zimmerli, etc. It also exports its products. Fitaihi Holding Group was founded in 1907 and is based in Jeddah, Saudi Arabia.",
    "website": "http://www.fitaihi.com.sa",
    "zipcode": "22234"
  }
}
