{
  "AFP.AX": {
    "city": "Auckland",
    "country": "New Zealand",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "AFT Pharmaceuticals Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "AFT PHARM FPO NZX",
    "state": null,
    "summary": "AFT Pharmaceuticals Limited develops, licenses, and sells pharmaceutical products in New Zealand, Australia, Southeast Asia, and internationally. The company offers approximately 130 prescription and non-prescription products for use in the areas of allergy, eye care, first aid, fungal, pain management, and skin care, as well as supplements. It is also involved in the distribution of pharmaceuticals. The company was founded in 1997 and is headquartered in Auckland, New Zealand.",
    "website": "http://www.aftpharm.com",
    "zipcode": "0622"
  },
  "AFT.NZ": {
    "city": "Auckland",
    "country": "New Zealand",
    "currency": "NZD",
    "exchange": "NZE",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "AFT Pharmaceuticals Limited",
    "market": "nz_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "AFT Pharmaceuticals Ltd Ordinar",
    "state": null,
    "summary": "AFT Pharmaceuticals Limited develops, licenses, distributes, and sells pharmaceutical products in New Zealand, Australia, Southeast Asia, and internationally. The company offers products for use in the areas of allergy, cold and flu, digestive health, eye care, first aid, nail and oral care, pain management, skin care, and other products, as well as supplements. The company was incorporated in 1997 and is headquartered in Auckland, New Zealand.",
    "website": "http://www.aftpharm.com",
    "zipcode": "0622"
  },
  "CBD.NZ": {
    "city": "Hamilton",
    "country": "New Zealand",
    "currency": "NZD",
    "exchange": "NZE",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Cannasouth Limited",
    "market": "nz_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "Cannasouth Limited Ordinary Sha",
    "state": null,
    "summary": "Cannasouth Limited, a biopharmaceutical company, engages in the research, development, production, and supply of cannabis biomass and cannabinoid medicines in New Zealand. The company was incorporated in 2018 and is based in Hamilton, New Zealand.",
    "website": "http://www.cannasouth.co.nz",
    "zipcode": "3256"
  },
  "CVT.NZ": {
    "city": "Te Puke",
    "country": "New Zealand",
    "currency": "NZD",
    "exchange": "NZE",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Comvita Limited",
    "market": "nz_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Comvita Limited Ordinary Shares",
    "state": null,
    "summary": "Comvita Limited, together with its subsidiaries, engages in the manufacturing and marketing of natural health products in Australia, New Zealand, China, rest of Asia, North America, Europe, the Middle East, Africa, and internationally. It offers Manuka honey, propolis, olive leaf extract, medihoney and skincare, gourmet honey, elixirs and lozenges, royal jelly, omega 3, and cider vinegar products, as well as oral, kids, and eye health products. The company also engages in the apiary ownership and management, property ownership, and research and development activities. Comvita Limited was founded in 1974 and is based in Te Puke, New Zealand.",
    "website": "http://www.comvita.co.nz",
    "zipcode": "3153"
  },
  "RUA.NZ": {
    "city": "Gisborne",
    "country": "New Zealand",
    "currency": "NZD",
    "exchange": "NZE",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Rua Bioscience Limited",
    "market": "nz_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "RUA Bioscience Limited Ordinary",
    "state": null,
    "summary": "Rua Bioscience Limited, a pharmaceutical company, focuses on the research, cultivation, extraction, and manufacturing parts of the medicinal cannabis supply chain in New Zealand. It also exports bioactive extracts and products internationally. Rua Bioscience Limited has research and commercial partnerships with Crown Research Institutes and Universities Collaboration; Medical Research Institute of New Zealand; and Plant and Food New Zealand. The company was formerly known as Hikurangi Cannabis Company Limited and changed its name to Rua Bioscience Limited in October 2019. Rua Bioscience Limited was founded in 2016 and is based in Gisborne, New Zealand.",
    "website": "http://www.ruabio.com",
    "zipcode": "4071"
  }
}
