{
  "NPH.NZ": {
    "city": "Napier",
    "country": "New Zealand",
    "currency": "NZD",
    "exchange": "NZE",
    "industry": "Marine Shipping",
    "long_name": "Napier Port Holdings Limited",
    "market": "nz_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Napier Port Holdings Limited Or",
    "state": null,
    "summary": "Napier Port Holdings Limited provides various port services in the Napier Port. It offers marine, general cargo, container, port pack, and depot services. The company was founded in 1875 and is based in Napier, New Zealand. Napier Port Holdings Limited is a subsidiary of Hawke's Bay Regional Investment Company Limited.",
    "website": "http://www.napierport.co.nz",
    "zipcode": "4140"
  },
  "POT.NZ": {
    "city": "Tauranga",
    "country": "New Zealand",
    "currency": "NZD",
    "exchange": "NZE",
    "industry": "Marine Shipping",
    "long_name": "Port of Tauranga Limited",
    "market": "nz_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "Port of Tauranga Ltd Ordinary S",
    "state": null,
    "summary": "Port of Tauranga Limited, a port company, provides and manages port services and cargo handling facilities through the Port of Tauranga and MetroPort in New Zealand. It operates through three segments: Port Operations, Property Services, and Marshalling Services. The company also manages and maintains various port properties. In addition, it provides contracted terminal operations, stevedoring, marshalling, and scaling activities. Further, the company provides wharf facilities; and berthage, cranes, tugs, and pilot services, as well as offers services for the storage and transit of import and export cargo. The company was founded in 1873 and is based in Tauranga, New Zealand. Port of Tauranga Limited is a subsidiary of Quayside Securities Limited.",
    "website": "http://www.port-tauranga.co.nz",
    "zipcode": null
  },
  "SPN.NZ": {
    "city": "Bluff",
    "country": "New Zealand",
    "currency": "NZD",
    "exchange": "NZE",
    "industry": "Marine Shipping",
    "long_name": "South Port New Zealand Limited",
    "market": "nz_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "South Port New Zealand Limited ",
    "state": null,
    "summary": "South Port New Zealand Limited provides and manages port and warehousing services in New Zealand. It operates the Port of Bluff in the province of Southland. The company offers pilotage, towage, berthage, and full marine services to international and coastal vessels, including southern fishing fleet. It also provides full container, break bulk, and bulk cargo services for the import of alumina, petroleum products, fertilizers, acids, stock foods, and cement products; and the export of aluminum, timber, logs, dairy, meat by-products, fishes, and woodchips. In addition, the company offers container tracking services; dry warehousing services for a range of industries, including dairy, forestry, stock feed, and general cargo; cold stores for chilled and frozen products; and open storage facilities for logs, containers, woodchips, sawn timber, steel, and others. Further, it handles project cargo, such as transformer weighing, wind farm material, hydroelectric power station tail race equipment, mining equipment, and tanks for tallow storage, as well as a range of machinery, including pleasure and fishing vessels. The company was founded in 1988 and is based in Bluff, New Zealand.",
    "website": "http://www.southport.co.nz",
    "zipcode": "9842"
  }
}
