{
    "HVM.AX": {
        "short_name": "HAPPY VAL FPO",
        "long_name": "Happy Valley Nutrition Limited",
        "summary": "Happy Valley Nutrition Limited focuses on producing, supplying, and selling of infant milk formula (IMF) and other nutritional products in New Zealand. The company was formerly known as Happy Valley Milk Limited and changed its name to Happy Valley Nutrition Limited in September 2019. Happy Valley Nutrition Limited was incorporated in 2016 and is headquartered in Auckland, New Zealand.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1052",
        "website": "http://www.hvn.co.nz",
        "market_cap": "Small Cap"
    },
    "KTD.AX": {
        "short_name": "KEYTONE FPO",
        "long_name": "Keytone Dairy Corporation Limited",
        "summary": "Keytone Dairy Corporation Limited, together with its subsidiary, manufactures and exports dairy, health and wellness, and nutrition products in New Zealand and Australia. It offers powdered milk nutritional products, including whole milk powder, skim milk powder, colostrum milk powder, and kiwifruit milk powder under the KeyDairy brand name; and health supplement capsules for the treatment of acne and natural beauty products under the KeyHealth and FaceClear names. The company also provides contract manufacturing and packaging services for milk powders, sports nutrition products, and health products; food service products, such as yoghurt powder blends, ice cream powder blends, fruit smoothie blends, and milk shake powder blends; and animal nutrition powdered blends and special patient powder blends. It serves retailers, distributors, and industrial customers. The company also exports its products to China, Vietnam, Hong Kong, Taiwan, Malaysia, Japan, Korea, Australia, and the European Union. Keytone Dairy Corporation Limited was founded in 2011 and is headquartered in Christchurch, New Zealand.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Christchurch",
        "zipcode": "8042",
        "website": "http://www.keytonedairy.com",
        "market_cap": "Small Cap"
    },
    "MEE.NZ": {
        "short_name": "Me Today Limited Ordinary Share",
        "long_name": "Me Today Limited",
        "summary": "Me Today Limited, through its subsidiaries, operates as a health and wellness company in New Zealand. The company offers range of supplement products from general health to immune function, energy, sleep, beauty, mobility, and relaxation. It also provides skincare products, such as micellar gel, cream cleanser, mist toner, moisturizer, serum, eye and night cream, facemask, lip balm, hand cream, hand wash, and hand lotion. In addition, it sells and markets third party brands, including life space, artemis, and sleep drop products. Me Today Limited is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1061",
        "website": "http://www.metoday.com",
        "market_cap": "Small Cap"
    },
    "PHL.NZ": {
        "short_name": "Promisia Healthcare Limited Ord",
        "long_name": "Promisia Healthcare Limited",
        "summary": "Promisia Healthcare Limited provides healthcare services in New Zealand. It operates three aged care facilities. The company was formerly known as Promisia Integrative Limited and changed its name to Promisia Healthcare Limited in February 2021. Promisia Healthcare Limited was incorporated in 1983 and is based in Wellington, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Wellington",
        "zipcode": "6011",
        "website": "http://www.promisia.com",
        "market_cap": "Small Cap"
    },
    "SM1.AX": {
        "short_name": "SYNLAIT FPO NZX",
        "long_name": "Synlait Milk Limited",
        "summary": "Synlait Milk Limited, together with its subsidiaries, manufactures and sells dairy products in China, rest of Asia, the Middle East, Africa, New Zealand, Australia, and internationally. The company is also involved in the processing, packaging, and marketing of dairy products, including cheese, butter, ice cream, and milk powder under the Alpine, Rolling, Meadow, Dairyworks, and Deep South brands. It offers liquid milk; milk powder related products; nutritional products, such as infant and adult nutritional powders; ingredients comprising skim milk powders and anhydrous milk fat; and specialized nutritional ingredients, such as lactoferrin. The company was founded in 2005 and is headquartered in Rakaia, New Zealand.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Rakaia",
        "zipcode": "7783",
        "website": "http://www.synlait.com",
        "market_cap": "Small Cap"
    },
    "SML.NZ": {
        "short_name": "Synlait Milk Limited (NS) Ordin",
        "long_name": "Synlait Milk Limited",
        "summary": "Synlait Milk Limited, together with its subsidiaries, manufactures and sells dairy products in China, rest of Asia, the Middle East, Africa, New Zealand, Australia, and internationally. The company is also involved in the processing, packaging, and marketing of dairy products, including cheese, butter, ice cream, and milk powder under the Alpine, Rolling, Meadow, Dairyworks, and Deep South brands. It offers liquid milk; milk powder related products; nutritional products, such as infant and adult nutritional powders; ingredients comprising skim milk powders and anhydrous milk fat; and specialized nutritional ingredients, such as lactoferrin. The company was founded in 2005 and is headquartered in Rakaia, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Rakaia",
        "zipcode": "7783",
        "website": "http://www.synlait.com",
        "market_cap": "Small Cap"
    }
}