{
    "IPL.NZ": {
        "short_name": "Investore Property Limited (NS)",
        "long_name": "Investore Property Limited",
        "summary": "Investore Property Limited (Investore) is a commercial property ownership business that has been established to invest in quality Large Format Retail property assets. Investore was established in October 2015 in connection with the acquisition of 19 Countdown supermarkets from Antipodean Supermarkets Limited and Antipodean Properties Limited. The transfer of six properties from Stride Property Limited (Stride) and Stride Holdings Limited to Investore took place between 29 April and 9 June 2016 by way of sale and purchase agreements for cash consideration equal to the most recently obtained independent valuation of the properties transferred (in each case, 31 March 2016). In June 2016, Investore entered into a sale and purchase agreement to acquire 14 Countdown supermarkets from Shopping Centres Australasia Property Group Trustee NZ Limited (the SCA Acquisition). Settlement of six properties occurred on 12 July 2016, with the other eight properties expected to settle in September 2016. Investore's investment strategy is focused on Large Format Retail property assets. Large Format Retail means a single-storey or low level property comprising retail shops and outlets and car parking areas with more than 50% of the property generally occupied by, and more than 50% of the rental generally provided by, a single major tenant or a limited number of major tenants under net leases. Investore believes that Large Format Retail assets have a specific, differentiating set of attributes that can provide a reliable income return to shareholders.",
        "currency": "NZD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.investoreproperty.co.nz",
        "full_time_employees": null
    },
    "NZL.NZ": {
        "short_name": "New Zealand Rural Land Company ",
        "long_name": "New Zealand Rural Land Company Limited",
        "summary": "New Zealand Rural Land Company Limited focuses on investing and acquiring rural land across the New Zealand agricultural sector. It owns the land and provide a platform for farmers and food producers. The company was incorporated in 2020 and is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1023",
        "website": "http://nzrlc.co.nz",
        "full_time_employees": null
    },
    "SPG.NZ": {
        "short_name": "Stride Prop & Stride Invest Mgm",
        "long_name": "Stride Stapled Group",
        "summary": "Stride Stapled Group is a real estate investment firm specializing in co-investments and investments in commercial, retail, and industrial real estate properties. Investment properties comprise of freehold land, leasehold land, buildings and improvements that are held either to earn rental income or for capital appreciation or both. It seeks to invest in New Zealand. Stride Stapled Group is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.strideproperty.co.nz",
        "full_time_employees": null
    }
}