{"1AD.AX": {"short_name": "ADALTA FPO", "long_name": "AdAlta Limited", "summary": "AdAlta Limited, a clinical stage biotechnology company, discovers and develops protein therapeutics in Australia. The company's lead i-body drug candidate includes AD-214, which is in Phase I clinical trials for the treatment of idiopathic pulmonary fibrosis and other fibrotic diseases. It has a collaborative partnership with GE Healthcare to discover i-bodies against granzyme B for use as a molecular imaging agent. AdAlta Limited was incorporated in 2006 and is based in Bundoora, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Bundoora"}, "1I4.F": {"short_name": "HERAMEDLTD", "long_name": "HeraMED Limited", "summary": "HeraMED Limited develops and sells pregnancy monitoring solutions for home and professional use in Australia, Europe, and Israel. The company's product is the HeraBEAT, a fetal heart rate monitor principally for use by an expectant mother to monitor their fetus' heartbeat. It is also involved in developing EchoBEAT, the next generation of its home-oriented pregnancy monitoring devices; and Orion, an artificial intelligence powered pregnancy monitoring system for pregnancy monitoring analysis. The company has a co-development agreement with Mayo Clinic for developing platform for pregnancy homecare; cooperation agreement with Freeman Rd & PHI Group to arrange and lead clinical studies in Australia; and partnership agreement with eCare21, Inc. to integrate its technology into the eCare21 platform. HeraMED Limited was founded in 2011 and is based in Sydney, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Sydney"}, "1X8.F": {"short_name": "CRESO PHARMA LTD", "long_name": "Creso Pharma Limited", "summary": "Creso Pharma Limited develops, registers, and commercializes pharmaceutical-grade cannabis and hemp-based nutraceutical products and treatments for human and animal health in Europe, the Middle East, and the Asia Pacific. The company is involved in hemp growing operations, outsourced CBD extraction, and cannabidiol (CBD) product sales activities, as well as the development and commercialization of its therapeutic products. Its products include anibidiol, a natural complementary feed product for companion animals; and cannaQIX, a nutraceutical product containing organic hemp extract with CBD vitamins and zinc to reduce stress and support mental and nervous functions in humans, as well as topical and skin care products. The company also offers various nutraceutical products, such as cannaQIXÂ®nite to aid sleep; cannaPEAL to introduce various markets to the benefits of hemp seed oil-based products; and cannaDOL to provide relief to athletes in the form of a topical application. In addition, it imports and sells its medicinal cannabis product, cannaQIX50 to patients in Brazil. Creso Pharma Limited has a strategic collaboration agreement with Hempmate AG Switzerland and Burleigh Heads Cannabis Pty Ltd. The company was incorporated in 2015 and is headquartered in Sydney, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Sydney"}, "26E.F": {"short_name": "ESTIA HEALTH LTD", "long_name": "Estia Health Limited", "summary": "Estia Health Limited operates residential aged care homes in Australia. As of June 30, 2020, it had 69 homes, which include 6,182 resident places in New South Wales, Queensland, South Australia, and Victoria. The company was founded in 2005 and is based in Sydney, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Sydney"}, "39I.F": {"short_name": "IMPEDIMED LTD", "long_name": "ImpediMed Limited", "summary": "ImpediMed Limited, a medical software technology company, together with its subsidiaries, develops, manufactures, and sells bioimpedance spectroscopy (BIS) devices and software services in Australia, North America, and internationally. It offers SOZO, a noninvasive bioimpedance spectroscopy device for the detection of lymphedema and fluid status monitoring of heart failure patients; SFB7, a single-channel, tetrapolar BIS device to analyze body composition in healthy individuals; and ImpediVET, a single-channel, tetrapolar (BIS) device that measures fluid status and tissue composition for veterinary applications. The company sells its devices to hospitals and clinics. ImpediMed Limited was founded in 1999 and is headquartered in Pinkenba, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Pinkenba"}, "3AC.F": {"short_name": "ACTINOGEN MEDICAL LTD.", "long_name": "Actinogen Medical Limited", "summary": "Actinogen Medical Limited, a biotechnology company, develops therapies for cognitive impairment associated with chronic neurological, psychiatric, and metabolic diseases in Australia. The company is developing Xanamem, a therapy for Alzheimer's disease, and cognitive impairment associated with schizophrenia, diabetes, and other disorders; and XanADu, which has completed Phase II clinical trials is a double-blind, randomized, and placebo-controlled study to assess the safety, tolerability, and efficacy of Xanamem in subjects with mild Alzheimer's disease. It is also developing XanaHES, a single blinded, central reader blinded, placebo-controlled, and dose escalation study of Xanamem to assess safety and tolerability in healthy elderly subjects. The company was formerly known as Actinogen Limited and changed its name to Actinogen Medical Limited in November 2015. Actinogen Medical Limited was incorporated in 1999 and is headquartered in Sydney, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Sydney"}, "41C.SG": {"short_name": "CannPal Animal Therapeut. Ltd.R", "long_name": "CannPal Animal Therapeutics Limited", "summary": "CannPal Animal Therapeutics Limited, an animal health company, engages in the research and development of plant-based therapeutic products for pets in Australia. It develops CPAT-01, a cannabis-derived pharmaceutical product to provide veterinarians and pet owners to treat pain and inflammation in dogs. The company was incorporated in 2016 and is based in Double Bay, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "STU", "market": "dr_market", "country": "Australia", "city": "Double Bay"}, "51S.F": {"short_name": "CYNATA THERAPEUTICS", "long_name": "Cynata Therapeutics Limited", "summary": "Cynata Therapeutics Limited, together with its subsidiaries, develops and commercializes a proprietary mesenchymal stem cell technology under the Cymerus brand for human therapeutic use in Australia. The company's lead therapeutic product candidate is CYP-001, which has completed Phase I clinical trial for the treatment of graft versus host disease. It also develops products for the treatment of asthma, heart attack, diabetic wounds, coronary artery disease, acute respiratory distress syndrome, brain cancer, melanoma, sepsis, osteoarthritis, and critical limb ischemia, which are in a preclinical model. The company has a partnership with Monash University, University of Sydney, the Cooperative Research Centre for Cell Therapy Manufacturing, University of New South Wales, Critical Care Research Group, Massachusetts General Hospital, and the Royal College of Surgeons in Ireland to develop stem cell therapies. It also has a strategic partnership with Fujifilm Corporation of Japan for the development and research of Cymerus technology. The company was formerly known as Eco Quest Limited and changed its name to Cynata Therapeutics Limited in October 2013. Cynata Therapeutics Limited was founded in 2011 and is based in Carlton, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Carlton"}, "7JH.F": {"short_name": "JAPARA HEALTH CARE LTD", "long_name": "Japara Healthcare Limited", "summary": "Japara Healthcare Limited, together with its subsidiaries, owns, develops, and operates residential aged care homes in Australia. It operates approximately 4,400 resident places across 51 homes located in Victoria, New South Wales, Queensland, South Australia, and Tasmania; and 180 independent living units across 5 retirement villages. The company was founded in 2005 and is based in Southbank, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Southbank"}, "A4B.F": {"short_name": "IMEXHS LTD", "long_name": "ImExHS Limited", "summary": "ImExHS Limited operates as an imaging software as a service and ancillary service provider in Australia and internationally. It is involved in developing and selling Hiruko software platform that comprises radiology information system, which manages the workflow management system with a patient data and image distribution system, as well as picture archiving and communication system that allows healthcare organization to capture, store, view, and share radiology images. The company was founded in 2012 and is headquartered in Mascot, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Mascot"}, "AC8.AX": {"short_name": "AUSCANN FPO", "long_name": "AusCann Group Holdings Ltd", "summary": "AusCann Group Holdings Ltd, a pharmaceutical company, researches, develops, cultivates, produces, and distributes cannabinoid-based pharmaceuticals in Australia and internationally. It offers hard-shell capsules using Neuvis technology for the treatment of chronic neuropathic pain. The company is based in West Perth, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "West Perth"}, "ACNNF": {"short_name": "AUSCANN GROUP HOLDINGS LTD", "long_name": "AusCann Group Holdings Ltd", "summary": "AusCann Group Holdings Ltd, a pharmaceutical company, researches, develops, cultivates, produces, and distributes cannabinoid-based pharmaceuticals in Australia and internationally. It offers hard-shell capsules using Neuvis technology for the treatment of chronic neuropathic pain. The company is based in West Perth, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "West Perth"}, "ACR.AX": {"short_name": "ACRUX FPO", "long_name": "Acrux Limited", "summary": "Acrux Limited, together with its subsidiaries, develops and commercializes generic and specialty topical pharmaceuticals in Australia, Germany, the United States, and internationally. The company offers testosterone solutions, such as oral tablets, buccal tablets, subcutaneous pellets, transdermal patches, injections, and topical gels for treatment of adult males who have low or no testosterone. It also provides estradiol sprays for women under the Evamist and Lenzetto brand names for the treatment of flushes associated with menopause. Acrux Limited was founded in 1998 and is based in West Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "West Melbourne"}, "ACW.AX": {"short_name": "ACTINOGEN FPO", "long_name": "Actinogen Medical Limited", "summary": "Actinogen Medical Limited, a biotechnology company, develops therapies for cognitive impairment associated with chronic neurological, psychiatric, and metabolic diseases in Australia. The company is developing Xanamem, a therapy for Alzheimer's disease, and cognitive impairment associated with schizophrenia, diabetes, and other disorders; and XanADu, which has completed Phase II clinical trials is a double-blind, randomized, and placebo-controlled study to assess the safety, tolerability, and efficacy of Xanamem in subjects with mild Alzheimer's disease. It is also developing XanaHES, a single blinded, central reader blinded, placebo-controlled, and dose escalation study of Xanamem to assess safety and tolerability in healthy elderly subjects. The company was formerly known as Actinogen Limited and changed its name to Actinogen Medical Limited in November 2015. Actinogen Medical Limited was incorporated in 1999 and is headquartered in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "ADO.AX": {"short_name": "ANTEO TECH FPO", "long_name": "AnteoTech Limited", "summary": "AnteoTech Limited engages in developing, commercializing, manufacturing, and distributing products for the life sciences research, vitro diagnostics, energy, and medical device markets primarily in Australia. Its principal technology products include AnteoCoat, which is applicable to the energy sector in lithium-ion batteries; AnteoBind that is applicable to point of care, in vitro, and life science diagnostic sectors. The company also manufactures and sells COVID-19 antigen testing kits. AnteoTech Limited has collaboration agreements with Axxin for for COVID-19 anigen test. The company was formerly known as Anteo Diagnostics Limited and changed its name to AnteoTech Limited in November 2019. AnteoTech Limited was incorporated in 1995 and is headquartered in Eight Mile Plains, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Eight Mile Plains"}, "AGH.AX": {"short_name": "ALTHEA FPO", "long_name": "Althea Group Holdings Limited", "summary": "Althea Group Holdings Limited cultivates, produces, supplies, imports, and exports pharmaceutical grade medicinal cannabis in Australia, the United Kingdom, and Canada. It also offers a range of education, access, and management services to support eligible patients, healthcare professionals, and pharmacies in navigating medicinal cannabis treatment pathways through Concierge, an online service, as well as Medic, an online education. Althea Group Holdings Limited was founded in 2017 and is based in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "AHC.AX": {"short_name": "AUS HEALTH FPO", "long_name": "Austco Healthcare Limited", "summary": "Austco Healthcare Limited, together with its subsidiaries, provides communication and clinical workflow management solutions in Australia, New Zealand, Canada, the United Kingdom, the United States, Asia, and the Middle East. The company offers Tacera, an IP based nurse call system for hospitals, and aged care and acute care facilities. It also develops software. The company was formerly known as Azure Healthcare Limited and changed its name to Austco Healthcare Limited in November 2020. Austco Healthcare Limited was incorporated in 2004 and is based in Port Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Instruments & Supplies", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Port Melbourne"}, "ALC.AX": {"short_name": "ALCIDION FPO", "long_name": "Alcidion Group Limited", "summary": "Alcidion Group Limited, together with its subsidiaries, engages in the development and licensing of healthcare software products in Australia, New Zealand, and the United Kingdom. The company offers Miya Precision that combines artificial intelligence, clinical decision support, and mobile alerts in clinical dashboard; Patientrack, a patient safety and communication system; and Smartpage, a messaging and task management platform, which enables hospital staff to communicate and collaborate. It also provides project management, data and analytics, implementation consulting, and integration and support services for digital health projects. The company was formerly known as Alcidion Corporation Pty Ltd and changed its name to Alcidion Group Limited in December 2015. The company was founded in 2000 and is headquartered in South Yarra, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "South Yarra"}, "AMEUF": {"short_name": "ANTERIS TECHNOLOGIES LTD", "long_name": "Anteris Technologies Ltd", "summary": "Anteris Technologies Ltd, a structural heart company, researches, develops, commercializes, and distributes various medical technologies and devices. It manufactures, distributes, and sells proprietary ADAPT regenerative tissue products; and researches and develops regenerative medicine and immunotherapies. The company was formerly known as Admedus Limited and changed its name to Anteris Technologies Ltd in May 2020. Anteris Technologies Ltd is based in Toowong, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Toowong"}, "AMT.AX": {"short_name": "ALLEGRA FPO", "long_name": "Allegra Orthopaedics Limited", "summary": "Allegra Orthopaedics Limited designs, sells, and distributes orthopaedic implant products in Australia and New Zealand. The company operates through Orthopaedics Division and Innovation Division segments. It offers adult and adolescent clavicle fixation systems; shoulder implants; ulna heads, compression screws, distal radius systems, and hand fracture systems; reconstruction prosthesis, modular tumor and revision systems, partial pelvis replacement, cementless stems, cups, and ceramic prosthesis heads for hips; and knee replacement systems and knee distal first instruments. The company also provides foot and ankle products, such as total ankle replacement systems, toe products, A-curve handles, screws, staples, and foot systems; surgical screws, sawblades, and kirschner wires and pins; NanoFx, a solution for microfracture; and face shields and mask strap holders. The company was formerly known as Advanced Surgical Design & Manufacture Limited and changed its name to Allegra Orthopaedics Limited in November 2014. Allegra Orthopaedics Limited was founded in 1994 and is based in Lane Cove West, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Lane Cove West"}, "ANN.AX": {"short_name": "ANSELL FPO", "long_name": "Ansell Limited", "summary": "Ansell Limited designs, develops, and manufactures protection solutions in the Asia Pacific, Europe, the Middle East, Africa, Latin America, Caribbean, and North America. It operates in two segments, Healthcare and Industrial. The Healthcare segment manufactures and markets solutions comprising surgical gloves, single use and examination gloves, and clean and sterile gloves and garments, as well as consumables used by healthcare, life sciences, and industrial workers for a range of customers, including hospitals, surgical centers, dental surgeries, veterinary clinics, first responders, manufacturers, auto repair shops, chemical plants, laboratories, and pharmaceutical companies. The Industrial segment manufactures and markets high-performance hand and chemical protective clothing solutions for a range of industrial applications, including automotive, chemical, metal fabrication, machinery and equipment, food, construction, mining, oil and gas, and first responders. The company was formerly known as Pacific Dunlop Limited and changed its name to Ansell Limited in 2002. Ansell Limited was founded in 1893 and is based in Richmond, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Instruments & Supplies", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Richmond"}, "ANP.AX": {"short_name": "ANTISENSE FPO", "long_name": "Antisense Therapeutics Limited", "summary": "Antisense Therapeutics Limited, a biopharmaceutical company, engages in the research and development of novel antisense pharmaceuticals in Australia. Its product pipeline comprises ATL1102, an antisense inhibitor of CD49d that has completed Phase IIa for the treatment of multiple sclerosis, Duchennes Muscular Dystrophy, multiple sclerosis, asthma, and other inflammatory indications. The company's product pipeline also includes ATL1103, a second generation antisense drug designed to block growth hormone receptor expression thereby reducing levels of the hormone insulin-like growth factor-I in the blood, as well as to treat diseases associated with excessive growth hormone action that has completed Phase II clinical trial. Antisense Therapeutics Limited is based in Toorak, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Toorak"}, "ANR.AX": {"short_name": "ANATARA LS FPO", "long_name": "Anatara Lifesciences Limited", "summary": "Anatara Lifesciences Limited engages in the research and development of non-antibiotic oral solutions for gastrointestinal diseases in animals and humans in Australia. Its lead product candidate includes Detach, a non-antibiotic therapy that prevents and treats diarrhea disease in piglets. The company is also developing bromelain formulations for gastrointestinal health in humans, as well as for piglets and poultry. Anatara Lifesciences Limited was incorporated in 2010 and is based in Carlton, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Carlton"}, "ANSLY": {"short_name": "ANSELL", "long_name": "Ansell Limited", "summary": "Ansell Limited designs, develops, and manufactures protection solutions in the Asia Pacific, Europe, the Middle East, Africa, Latin America, Caribbean, and North America. It operates in two segments, Healthcare and Industrial. The Healthcare segment manufactures and markets solutions comprising surgical gloves, single use and examination gloves, and clean and sterile gloves and garments, as well as consumables used by healthcare, life sciences, and industrial workers for a range of customers, including hospitals, surgical centers, dental surgeries, veterinary clinics, first responders, manufacturers, auto repair shops, chemical plants, laboratories, and pharmaceutical companies. The Industrial segment manufactures and markets high-performance hand and chemical protective clothing solutions for a range of industrial applications, including automotive, chemical, metal fabrication, machinery and equipment, food, construction, mining, oil and gas, and first responders. The company was formerly known as Pacific Dunlop Limited and changed its name to Ansell Limited in 2002. Ansell Limited was founded in 1893 and is based in Richmond, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Instruments & Supplies", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Richmond"}, "ANW.F": {"short_name": "IMMURON LTD", "long_name": "Immuron Limited", "summary": "Immuron Limited, a biopharmaceutical company, researches and develops oral immunotherapy polyclonal antibodies for the treatment and prevention of infectious and immune modulated diseases in Australia, the United States, and internationally. The company operates through two segments, Research and Development, and Hyperimmune Products. The company markets Travelan and Protectyn for the prevention of travellers' diarrhea. Its lead product candidates include IMM-124E that is in Phase II clinical trials for non-alcoholic steatohepatitis, severe alcoholic hepatitis, and non-alcoholic fatty liver disease, as well as used in antiviral activity against the COVID-19 virus in laboratory studies; and IMM-529, a clinical stage product for clostridium difficile infections. Immuron Limited was founded in 1994 and is based in Carlton, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Carlton"}, "ANWA.F": {"short_name": "IMMURON LTD SPON.ADR 40", "long_name": "Immuron Limited", "summary": "Immuron Limited, a biopharmaceutical company, researches and develops oral immunotherapy polyclonal antibodies for the treatment and prevention of infectious and immune modulated diseases in Australia, the United States, and internationally. The company operates through two segments, Research and Development, and Hyperimmune Products. The company markets Travelan and Protectyn for the prevention of travellers' diarrhea. Its lead product candidates include IMM-124E that is in Phase II clinical trials for non-alcoholic steatohepatitis, severe alcoholic hepatitis, and non-alcoholic fatty liver disease, as well as used in antiviral activity against the COVID-19 virus in laboratory studies; and IMM-529, a clinical stage product for clostridium difficile infections. Immuron Limited was founded in 1994 and is based in Carlton, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Carlton"}, "ARPC": {"short_name": "AREM PACIFIC CORPORATION", "long_name": "Arem Pacific Corporation", "summary": "Arem Pacific Corporation operates a wellness center in Victoria State, Australia. The company's wellness center provides various services, including acupressure/reflexology; neck, shoulder, back, legs, and full body massages; foot massages; cupping; and deep tissue and hot oil massage. Arem Pacific Corporation is based in Melbourne, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Melbourne"}, "ARUXF": {"short_name": "ACRUX", "long_name": "Acrux Limited", "summary": "Acrux Limited, together with its subsidiaries, develops and commercializes generic and specialty topical pharmaceuticals in Australia, Germany, the United States, and internationally. The company offers testosterone solutions, such as oral tablets, buccal tablets, subcutaneous pellets, transdermal patches, injections, and topical gels for treatment of adult males who have low or no testosterone. It also provides estradiol sprays for women under the Evamist and Lenzetto brand names for the treatment of flushes associated with menopause. Acrux Limited was founded in 1998 and is based in West Melbourne, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "West Melbourne"}, "AT1.AX": {"short_name": "ATOMO DIAG FPO", "long_name": "Atomo Diagnostics Limited", "summary": "Atomo Diagnostics Limited researches, designs, develops, manufactures, and sells medical devices for blood-based rapid testing for professional use and self-testing. The company offers AtomoRapid RDT platforms to suit various blood-based lateral flow test assays and are appropriate for a range of applications, including screening for chronic conditions and detection of infectious diseases. Its rapid test devices are used by healthcare professionals and by consumers to screen for a range of diseases and medical conditions, including HIV infection. The company has operations in Europe, Asia, Africa, and Central and South America. Atomo Diagnostics Limited was founded in 2010 and is headquartered in Leichhardt, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Leichhardt"}, "ATHE": {"short_name": "Alterity Therapeutics Limited", "long_name": "Alterity Therapeutics Limited", "summary": "Alterity Therapeutics Limited researches and develops therapeutic drugs for the treatment of Parkinsonian's disease and other neurodegenerative diseases in Australia. The company's lead drug candidates is ATH434 that has completed Phase I clinical trial for the treatment of Parkinson's disease. It is also developing PBT2 for used as an antimicrobial agent. The company was formerly known as Prana Biotechnology Limited and changed its name to Alterity Therapeutics Limited in April 2019. The company was founded in 1997 and is based in Melbourne, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NCM", "market": "us_market", "country": "Australia", "city": "Melbourne"}, "ATHJF": {"short_name": "ANTISENSE THERAPEUTICS", "long_name": "Antisense Therapeutics Limited", "summary": "Antisense Therapeutics Limited, a biopharmaceutical company, engages in the research and development of novel antisense pharmaceuticals in Australia. Its product pipeline comprises ATL1102, an antisense inhibitor of CD49d that has completed Phase IIa for the treatment of multiple sclerosis, Duchennes Muscular Dystrophy, multiple sclerosis, asthma, and other inflammatory indications. The company's product pipeline also includes ATL1103, a second generation antisense drug designed to block growth hormone receptor expression thereby reducing levels of the hormone insulin-like growth factor-I in the blood, as well as to treat diseases associated with excessive growth hormone action that has completed Phase II clinical trial. Antisense Therapeutics Limited is based in Toorak, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Toorak"}, "ATX.AX": {"short_name": "AMPLIA FPO", "long_name": "Amplia Therapeutics Limited", "summary": "Amplia Therapeutics Limited, a pharmaceutical company, focuses on advancing a pipeline of focal adhesion kinase (FAK) inhibitors for cancer and fibrosis in Australia. Its clinical development pipeline comprises two lead molecules, AMP945 and AMP886 that inhibits (FAK). The company was formerly known as Innate Immunotherapeutics Limited and changed its name to Amplia Therapeutics Limited in September 2018. Amplia Therapeutics Limited was incorporated in 2000 and is headquartered in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "AVE.AX": {"short_name": "AVECHO FPO", "long_name": "Avecho Biotechnology Limited", "summary": "Avecho Biotechnology Limited, a biotechnology company, develops, produces, sells, and licenses products using its patented platform technology, Targeted Penetration Matrix (TPM) drug delivery system for the pharmaceutical, skin care, animal health, and nutrition industries. The company operates through Production, Human Health, and Animal Health and Nutrition segments. It offers TPM and Vital ET products for use in drug delivery and cosmetic formulations; and develops TPM/Oxymorphone and TPM/Oxycodone. The company's human health portfolio covers delivery of pharmaceutical products through gels, injectables, and patches. It provides non-antibiotic feed additive products to enhance feed efficiency and the health of livestock animals. The company serves customers in Australia, Switzerland, the United States, India, Japan, China, Singapore, and internationally. The company was formerly known as Phosphagenics Limited and changed its name to Avecho Biotechnology Limited in May 2019. Avecho Biotechnology Limited is based in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "B1N.F": {"short_name": "BIONOMICS LTD.", "long_name": "Bionomics Limited", "summary": "Bionomics Limited, a clinical-stage biopharmaceutical company, discovers and develops novel drug candidates for the treatment of central nervous system disorders and cancers in Australia and the United States. The company's lead drug candidate includes BNC210, a negative allosteric modulator of the a7 nicotinic acetylcholine receptor, which has completed phase 2 clinical trial for the treatment of anxiety, panic, agitation, and post-traumatic stress disorder. It also develops BNC375, a small molecule therapeutics for the treatment of cognitive impairment in Alzheimer's disease; BNC101, a monoclonal antibody that has completed phase 1 clinical trial targets cancer stem cells; and BNC105, a vascular disrupting agent, which is in phase 2 clinical trial for the treatment of refractory colorectal cancer, and phase 1 clinical trial for the treatment of patients with relapsed/refractory chronic lymphocytic leukemia. In addition, the company offers ionX, an integrated platform of genomics discoveries and technologies. Bionomics Limited has a strategic partnership with Merck & Co., Inc. The company was incorporated in 1996 and is based in Thebarton, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Thebarton"}, "BD1.AX": {"short_name": "BARD1 LIFE FPO", "long_name": "BARD1 Life Sciences Limited", "summary": "BARD1 Life Sciences Limited engages in the research and development of non-invasive diagnostic tests for early detection of cancer in Australia. The company offers hTERT test for diagnosis of bladder cancer, with the development-stage BARD1 autoantibody test for early detection of ovarian, breast and lung cancers; hTERT ICC test, an antibody-based immunocytochemistry stain that detects a component of telomerase; EXO-NET, a technology to capture and isolation of exosomes from any liquid biopsy sample; and BARD1 autoantibodies test to evaluate autoantibody panels and algorithms for detection of ovarian, breast and lung cancers. BARD1 Life Sciences Limited was incorporated in 1983 and is headquartered in South Perth, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Diagnostics & Research", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "South Perth"}, "BGT.AX": {"short_name": "BIOGENETEC FPO", "long_name": "Bio-Gene Technology Limited", "summary": "Bio-Gene Technology Limited, a biotechnology company, engages in developing insecticides/pesticides for animal health, crop protection, public health, and consumer applications in Australia. It is involved in developing Flavocide, a beta-triketone insecticide product; and Qcide, a natural oil extracted from the leaves of rare eucalyptus trees. The company has a research collaboration agreement with James Cook University for the development of a tissue culture system to support the expansion of tree plantations and scale-up of future Qcide oil production. It also has collaborations with Pacific Discovery Services for studying Flavocide's mode of action; and the Queensland Department of Agriculture and Fisheries for assessing activity against grain storage pests. Bio-Gene Technology Limited was incorporated in 1995 and is based in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "BIT.AX": {"short_name": "BIOTRON FPO", "long_name": "Biotron Limited", "summary": "Biotron Limited, a biotechnology company, engages in the developing and commercializing small molecule products to treat various viral diseases in Australia. Its lead antiviral drug is BIT225, which is in Phase II clinical trials for the treatment of HIV-1 and hepatitis C virus infections. The company also develops a portfolio of preclinical antiviral drugs. Biotron Limited was incorporated in 1999 and is based in North Ryde, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "North Ryde"}, "BITRF": {"short_name": "BIOTRON", "long_name": "Biotron Limited", "summary": "Biotron Limited, a biotechnology company, engages in the developing and commercializing small molecule products to treat various viral diseases in Australia. Its lead antiviral drug is BIT225, which is in Phase II clinical trials for the treatment of HIV-1 and hepatitis C virus infections. The company also develops a portfolio of preclinical antiviral drugs. Biotron Limited was incorporated in 1999 and is based in North Ryde, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "North Ryde"}, "BNO.AX": {"short_name": "BIONOMICS FPO", "long_name": "Bionomics Limited", "summary": "Bionomics Limited, a clinical-stage biopharmaceutical company, discovers and develops novel drug candidates for the treatment of central nervous system disorders and cancers in Australia and the United States. The company's lead drug candidate includes BNC210, a negative allosteric modulator of the a7 nicotinic acetylcholine receptor, which has completed phase 2 clinical trial for the treatment of anxiety, panic, agitation, and post-traumatic stress disorder. It also develops BNC375, a small molecule therapeutics for the treatment of cognitive impairment in Alzheimer's disease; BNC101, a monoclonal antibody that has completed phase 1 clinical trial targets cancer stem cells; and BNC105, a vascular disrupting agent, which is in phase 2 clinical trial for the treatment of refractory colorectal cancer, and phase 1 clinical trial for the treatment of patients with relapsed/refractory chronic lymphocytic leukemia. In addition, the company offers ionX, an integrated platform of genomics discoveries and technologies. Bionomics Limited has a strategic partnership with Merck & Co., Inc. The company was incorporated in 1996 and is based in Thebarton, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Thebarton"}, "BNOEF": {"short_name": "BIONOMICS LTD", "long_name": "Bionomics Limited", "summary": "Bionomics Limited, a clinical-stage biopharmaceutical company, discovers and develops novel drug candidates for the treatment of central nervous system disorders and cancers in Australia and the United States. The company's lead drug candidate includes BNC210, a negative allosteric modulator of the a7 nicotinic acetylcholine receptor, which has completed phase 2 clinical trial for the treatment of anxiety, panic, agitation, and post-traumatic stress disorder. It also develops BNC375, a small molecule therapeutics for the treatment of cognitive impairment in Alzheimer's disease; BNC101, a monoclonal antibody that has completed phase 1 clinical trial targets cancer stem cells; and BNC105, a vascular disrupting agent, which is in phase 2 clinical trial for the treatment of refractory colorectal cancer, and phase 1 clinical trial for the treatment of patients with relapsed/refractory chronic lymphocytic leukemia. In addition, the company offers ionX, an integrated platform of genomics discoveries and technologies. Bionomics Limited has a strategic partnership with Merck & Co., Inc. The company was incorporated in 1996 and is based in Thebarton, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Thebarton"}, "BPN.F": {"short_name": "MEDIBIO LTD", "long_name": "Medibio Limited", "summary": "Medibio Limited, a health technology company, researches, develops, and commercializes mental health technology to assist in the screening, diagnosing, monitoring, and management of depression and other mental health conditions in Australia and the United States. It offers mental well-being solutions for businesses through corporate health product; and develops products for healthcare provider market. Medibio Limited has a clinical trial agreement with MedBridge Healthcare LLC to support Medibio's sleep analysis of depressive burden (SADB) trial. The company was formerly known as BioProspect Limited and changed its name to Medibio Limited in November 2014. Medibio Limited was incorporated in 1987 and is based in Melbourne, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Melbourne"}, "BRRZY": {"short_name": "TOTAL BRAIN LTD SPON ADS EACH R", "long_name": "Total Brain Limited", "summary": "Total Brain Limited, together with its subsidiaries, develops and sells brain health products in the United States. It offers Total Brain, a neuroscience-based mental health and brain performance app. Total Brain Limited has a partnership with the Center for Adolescent Research and Education to address growing youth mental health crisis. The company was formerly known as Brain Resource Limited and changed its name to Total Brain Limited in December 2018. Total Brain Limited was founded in 2000 and is based in Surry Hills, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Surry Hills"}, "BXN.AX": {"short_name": "BIOXYNE FPO", "long_name": "Bioxyne Limited", "summary": "Bioxyne Limited, a life sciences and health products company, researches, develops, manufactures, markets, and distributes consumer dietary supplements based on the proprietary probiotic strain of Lactobacillus Fermentum PCC. The company operates in two segments, Wholesale Sales and Direct Sales segments. It also engages in developing a range of functional foods and beauty products. The company's products portfolio include BK18, a dairy based food supplement; Allura, a beauty drink for women's weight management; Mustang, a nutritional shake for men's weight management; Mymana, a colostrum and fortified milk formula for nutrition and immune support; and BEssence, an anti-ageing serum. In addition, it offers its probiotic products under the Progastrim and proTract names. The company provides its products online, as well as through retail channels in Australia, the United States, New Zealand, and Asia. Bioxyne Limited was incorporated in 1998 and is headquartered in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "BXPHF": {"short_name": "BOTANIX PHARMACEUTICALS LTD", "long_name": "Botanix Pharmaceuticals Limited", "summary": "Botanix Pharmaceuticals Limited, a clinical stage synthetic cannabinoid pharmaceutical company, engages in the research and development of dermatology and antimicrobial products in Australia. It offers BTX 1503, a transdermal gel formulation for the treatment of serious acne in adults and teenagers that has completed Phase II clinical trials; BTX 1801, which is in Phase IIa clinical trials for the treatment of staphylococcus aureus and methicillin resistant staphylococcus aureus; and BTX 1702 that is in Phase II clinical trials for the treatment of papulopustular rosacea. The company was incorporated in 1984 and is based in North Perth, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "North Perth"}, "CAJ.AX": {"short_name": "CAPITOL H FPO", "long_name": "Capitol Health Limited", "summary": "Capitol Health Limited provides diagnostic imaging and related services to the healthcare market in Australia. The company owns and operates clinics in Victoria, Tasmania, and Western Australia. It offers a range of diagnostic imaging services, including general x-ray, magnetic resonance imaging, ultrasound, mammography, Doppler, orthopantomogram, echocardiography, computed tomography, CT angiography, cone beam CT, nuclear medicine, bone densitometry, and fluoroscopy. The company was founded in 2005 and is headquartered in East Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "East Melbourne"}, "CALZF": {"short_name": "POLYNOVO LIMITED", "long_name": "PolyNovo Limited", "summary": "Polynovo Limited develops medical devices in the United States, Australia, New Zealand, and internationally. The company offers NovoSorb Biodegradable Temporising Matrix, which is used in a fully debrided clean surgical wound to physiologically close the wound. It is also developing Syntrel hernia devices for hernia repair; breast devices in partnership with Establishment Labs; NovoSorb dermal beta cell implant in collaboration with BetaCell Technologies Pty Ltd; and NovoSorb drug elution depots. The company was formerly known as Calzada Limited and changed its name to Polynovo Limited in November 2014. Polynovo Limited was incorporated in 1998 and is based in Port Melbourne, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Port Melbourne"}, "CAU.AX": {"short_name": "CRONOS FPO", "long_name": "Cronos Australia Limited", "summary": "Cronos Australia Limited operates as a medicinal cannabis company in Australia and Asia. The company operates through Medicinal Cannabis and Clinics segments. It distributes  PEACE NATURALS brand medicinal cannabis products; develops and sells medicinal cannabis products; and operates medicinal cannabis clinics. The company was incorporated in 2018 and is headquartered in South Yarra, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "South Yarra"}, "CBL.AX": {"short_name": "CTRLBIONIC FPO", "long_name": "Control Bionics Limited", "summary": "Control Bionics Limited designs, manufactures, and sells communication technologies that allow users to operate and communicate through a computer using their thoughts and neural signals. It offers GridPad Trilogy that offers users additional switch ports, built-in IR, improved speaker output, and a 12-hour battery life; NeuroNode Trilogy, a solution for those living with paralysis and loss of speech; and Control Bionics Complete Communication System, an out of the box solution for those living with paralysis and loss of speech. The company also provides support and warranty services. Its products are used by people suffering from diseases that hamper their communication ability, such as multiple sclerosis and cerebral palsy, as well as spinal cord injuries. The company was founded in 2005 and is based in Surrey Hills, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Surrey Hills"}, "CDX.AX": {"short_name": "CARDIEXLTD FPO", "long_name": "CardieX Limited", "summary": "CardieX Limited designs, manufactures, and markets medical devices for use in cardiovascular health management in the Americas, Europe, and the Asia Pacific. The company develops, markets, and distributes medical technologies that measure patient risk for hypertension, cardiovascular disease (CVD), and other related vascular disorders. It also provides TeleHealth Services, which provides digital, e-commerce, and mobile tools for patients to connect online with health coaches. The company offers its devices and services to hospitals, clinics, research institutions and pharmaceutical companies. CardieX Limited has a strategic collaboration with Blumio Inc. to develop wearable sensor; and a joint development agreement with inHealth to develop hypertension and cardiovascular programs for the products. The company was formerly known as AtCor Medical Holdings Limited and changed its name to CardieX Limited in June 2018. CardieX Limited was founded in 1994 and is headquartered in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "CDY.AX": {"short_name": "CELLMID FPO", "long_name": "Cellmid Limited", "summary": "Cellmid Limited, a life sciences company, researches, develops, and commercializes diagnostic and therapeutic products for cancer and various chronic inflammatory conditions in Australia, the United States, and Japan. The company offers midkine, a driver and modulator of inflammatory diseases, including chronic inflammatory diseases and cancer; and focuses on blocking midkine, a protein for autoimmune disorders, chronic inflammation, osteoporosis, cardiovascular diseases, cancer, and neurodegenerative diseases. It also develops and sells over-the-counter products; and a range of FGF5 inhibitor hair growth products under the evolis, evolis Professional, Lexilis Hybrid, Jo-Ju RED, and Lexilis BLACK brands. In addition, the company sells SARS-CoV-2 antibody kits and PCR tests. It markets its products through retailers and wholesalers, as well as through a direct-to-consumer e-commerce platform. Cellmid Limited was incorporated in 2004 and is based in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "CGS.AX": {"short_name": "COGSTATE FPO", "long_name": "Cogstate Limited", "summary": "Cogstate Limited, a cognitive science company, provides computerized cognitive tests for clinical trials, academic research, healthcare, and brain health applications in Australia and internationally. The company's services include scientific consultancy, project management, data management, statistical analysis, and reporting. It operates in three segments: Clinical Trials, Academic Research, and Healthcare. The Clinical Trials segment provides technology and associated services that are used to quantify the effect of diseases and drugs, and devices or other interventions on human subjects participating in clinical trials primarily conducted by pharmaceutical and biotechnology companies. The Academic Research segment offers technology and associated services to support international research studies and academic collaborations across various indications, including Alzheimer's disease, HIV, multiple sclerosis, pediatric and adult oncology, Parkinson's disease, epilepsy, and schizophrenia. As of June 30, 2020, it had participated in approximately 1,800 academic research studies in approximately 200 indications. The Healthcare segment provides Cognigram, a system for regular and standardized testing to assist in the early detection of cognitive decline. The company serves biopharmaceutical companies, sporting organizations, military, physicians and patients, academic institutions, and public-private partnerships. Cogstate Limited was founded in 1999 and is headquartered in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "CHEOF": {"short_name": "COCHLEAR LTD", "long_name": "Cochlear Limited", "summary": "Cochlear Limited provides implantable hearing solutions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers cochlear implants, including Nucleus 7, Nucleus 6, Nucleus CP802, and Kanso sound processors; and Baha bone conduction implants, such as Baha attract system, Baha connect system, Baha softband, Baha soundarc, Baha 5 sound processor, and Baha sound processor. It also provides Cochlear true wireless accessories comprising mini microphones, phone clips, and TV streamers; Nucleus water-safe accessories; and training and development services. Cochlear Limited was founded in 1981 and is headquartered in Sydney, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Sydney"}, "CHEOY": {"short_name": "COCHLEAR LTD", "long_name": "Cochlear Limited", "summary": "Cochlear Limited provides implantable hearing solutions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers cochlear implants, including Nucleus 7, Nucleus 6, Nucleus CP802, and Kanso sound processors; and Baha bone conduction implants, such as Baha attract system, Baha connect system, Baha softband, Baha soundarc, Baha 5 sound processor, and Baha sound processor. It also provides Cochlear true wireless accessories comprising mini microphones, phone clips, and TV streamers; Nucleus water-safe accessories; and training and development services. Cochlear Limited was founded in 1981 and is headquartered in Sydney, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Sydney"}, "CLVLF": {"short_name": "CLINUVEL PHARMACEUTICALS LTD", "long_name": "Clinuvel Pharmaceuticals Limited", "summary": "Clinuvel Pharmaceuticals Limited, a biopharmaceutical company, focuses on developing and delivering drugs for the treatment of patients with severe genetic and skin disorders worldwide. Its lead drug candidate is SCENESSE, a photoprotective drug for the prevention of phototoxicity in adult patients with erythropoietic protoporphyria (EPP). The company's pipeline products include CUV9900, an alpha-melanocyte stimulating hormone analogue; Parvysmelanotide (VLRX001), an addition to the family of melanocortin analogues, which provoke increased and prolonged cellular activity; and PRÃ\u0089NUMBRA, a liquid injectable formulation of afamelanotide. Clinuvel Pharmaceuticals Limited has a collaboration agreement with HK Winhealth Pharma Group Co. Limited for launching SCENESSE under a named patient program for the treatment of patients with EPP in the People's Republic of China. The company was founded in 1987 and is headquartered in Melbourne, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Melbourne"}, "CLVLY": {"short_name": "CLINUVEL PHARMACEUTICALS LTD", "long_name": "Clinuvel Pharmaceuticals Limited", "summary": "Clinuvel Pharmaceuticals Limited, a biopharmaceutical company, focuses on developing and delivering drugs for the treatment of patients with severe genetic and skin disorders worldwide. Its lead drug candidate is SCENESSE, a photoprotective drug for the prevention of phototoxicity in adult patients with erythropoietic protoporphyria (EPP). The company's pipeline products include CUV9900, an alpha-melanocyte stimulating hormone analogue; Parvysmelanotide (VLRX001), an addition to the family of melanocortin analogues, which provoke increased and prolonged cellular activity; and PRÃ\u0089NUMBRA, a liquid injectable formulation of afamelanotide. Clinuvel Pharmaceuticals Limited has a collaboration agreement with HK Winhealth Pharma Group Co. Limited for launching SCENESSE under a named patient program for the treatment of patients with EPP in the People's Republic of China. The company was founded in 1987 and is headquartered in Melbourne, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Melbourne"}, "CMXHF": {"short_name": "CSL LTD", "long_name": "CSL Limited", "summary": "CSL Limited researches, develops, manufactures, markets, and distributes biopharmaceutical and allied products in Australia, the United States, Germany, the United Kingdom, Switzerland, China, and internationally. The company operates through two segments, CSL Behring and Seqirus. The CSL Behring segment offers plasma therapies for the treatment of immunodeficiency, bleeding disorders, hereditary angioedema, Alpha-1 antitrypsin deficiency, and neurological disorders. This segment also conducts research on plasma and non-plasma therapies; and receives license and royalty from the commercialization of intellectual property. The Seqirus segment manufactures and distributes non-plasma biotherapeutic products; and develops influenza vaccines. CSL Limited was founded in 1916 and is headquartered in Parkville, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Parkville"}, "CNGGF": {"short_name": "CANN GROUP LTD", "long_name": "Cann Group Limited", "summary": "Cann Group Limited engages in research and development, cultivation and production, manufacturing, clinical evaluation, processing, packaging, and distribution and supply of medicinal cannabis for various diseases and medical conditions in Australia. The company was founded in 2014 and is based in Bundoora, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Bundoora"}, "COGZF": {"short_name": "COGSTATE", "long_name": "Cogstate Limited", "summary": "Cogstate Limited, a cognitive science company, provides computerized cognitive tests for clinical trials, academic research, healthcare, and brain health applications in Australia and internationally. The company's services include scientific consultancy, project management, data management, statistical analysis, and reporting. It operates in three segments: Clinical Trials, Academic Research, and Healthcare. The Clinical Trials segment provides technology and associated services that are used to quantify the effect of diseases and drugs, and devices or other interventions on human subjects participating in clinical trials primarily conducted by pharmaceutical and biotechnology companies. The Academic Research segment offers technology and associated services to support international research studies and academic collaborations across various indications, including Alzheimer's disease, HIV, multiple sclerosis, pediatric and adult oncology, Parkinson's disease, epilepsy, and schizophrenia. As of June 30, 2020, it had participated in approximately 1,800 academic research studies in approximately 200 indications. The Healthcare segment provides Cognigram, a system for regular and standardized testing to assist in the early detection of cognitive decline. The company serves biopharmaceutical companies, sporting organizations, military, physicians and patients, academic institutions, and public-private partnerships. Cogstate Limited was founded in 1999 and is headquartered in Melbourne, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Melbourne"}, "COH.AX": {"short_name": "COCHLEAR FPO", "long_name": "Cochlear Limited", "summary": "Cochlear Limited provides implantable hearing solutions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers cochlear implants, including Nucleus 7, Nucleus 6, Nucleus CP802, and Kanso sound processors; and Baha bone conduction implants, such as Baha attract system, Baha connect system, Baha softband, Baha soundarc, Baha 5 sound processor, and Baha sound processor. It also provides Cochlear true wireless accessories comprising mini microphones, phone clips, and TV streamers; Nucleus water-safe accessories; and training and development services. Cochlear Limited was founded in 1981 and is headquartered in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "COO.AX": {"short_name": "CORUM GRP FPO", "long_name": "Corum Group Limited", "summary": "Corum Group Limited, together with its subsidiaries, operates as a technology and software development company in Australia. It operates through two segments, Health Services and eCommerce. The Health Services segment develops and distributes business software for the pharmacy industry, including point-of-sale and pharmaceutical dispensing software; multi-site retail management; and dispense solutions and computer hardware and support services. The eCommerce segment operates a payment gateway primarily for the real estate and pharmacy sectors. The company was formerly known as Cosmos Limited and changed its name to Corum Group Limited in November 2006. Corum Group Limited was incorporated in 1950 and is headquartered in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "COPHF": {"short_name": "CRESO PHARMA LTD", "long_name": "Creso Pharma Limited", "summary": "Creso Pharma Limited develops, registers, and commercializes pharmaceutical-grade cannabis and hemp-based nutraceutical products and treatments for human and animal health in Europe, the Middle East, and the Asia Pacific. The company is involved in hemp growing operations, outsourced CBD extraction, and cannabidiol (CBD) product sales activities, as well as the development and commercialization of its therapeutic products. Its products include anibidiol, a natural complementary feed product for companion animals; and cannaQIX, a nutraceutical product containing organic hemp extract with CBD vitamins and zinc to reduce stress and support mental and nervous functions in humans, as well as topical and skin care products. The company also offers various nutraceutical products, such as cannaQIXÂ®nite to aid sleep; cannaPEAL to introduce various markets to the benefits of hemp seed oil-based products; and cannaDOL to provide relief to athletes in the form of a topical application. In addition, it imports and sells its medicinal cannabis product, cannaQIX50 to patients in Brazil. Creso Pharma Limited has a strategic collaboration agreement with Hempmate AG Switzerland and Burleigh Heads Cannabis Pty Ltd. The company was incorporated in 2015 and is headquartered in Sydney, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Sydney"}, "CP1.AX": {"short_name": "CANNPAL FPO", "long_name": "CannPal Animal Therapeutics Limited", "summary": "CannPal Animal Therapeutics Limited, an animal health company, engages in the research and development of plant-based therapeutic products for pets in Australia. It develops CPAT-01, a cannabis-derived pharmaceutical product to provide veterinarians and pet owners to treat pain and inflammation in dogs. The company was incorporated in 2016 and is based in Double Bay, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Double Bay"}, "CPH.AX": {"short_name": "CRESO FPO", "long_name": "Creso Pharma Limited", "summary": "Creso Pharma Limited develops, registers, and commercializes pharmaceutical-grade cannabis and hemp-based nutraceutical products and treatments for human and animal health in Europe, the Middle East, and the Asia Pacific. The company is involved in hemp growing operations, outsourced CBD extraction, and cannabidiol (CBD) product sales activities, as well as the development and commercialization of its therapeutic products. Its products include anibidiol, a natural complementary feed product for companion animals; and cannaQIX, a nutraceutical product containing organic hemp extract with CBD vitamins and zinc to reduce stress and support mental and nervous functions in humans, as well as topical and skin care products. The company also offers various nutraceutical products, such as cannaQIXÂ®nite to aid sleep; cannaPEAL to introduce various markets to the benefits of hemp seed oil-based products; and cannaDOL to provide relief to athletes in the form of a topical application. In addition, it imports and sells its medicinal cannabis product, cannaQIX50 to patients in Brazil. Creso Pharma Limited has a strategic collaboration agreement with Hempmate AG Switzerland and Burleigh Heads Cannabis Pty Ltd. The company was incorporated in 2015 and is headquartered in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "CSJ.F": {"short_name": "CSL LTD", "long_name": "CSL Limited", "summary": "CSL Limited researches, develops, manufactures, markets, and distributes biopharmaceutical and allied products in Australia, the United States, Germany, the United Kingdom, Switzerland, China, and internationally. The company operates through two segments, CSL Behring and Seqirus. The CSL Behring segment offers plasma therapies for the treatment of immunodeficiency, bleeding disorders, hereditary angioedema, Alpha-1 antitrypsin deficiency, and neurological disorders. This segment also conducts research on plasma and non-plasma therapies; and receives license and royalty from the commercialization of intellectual property. The Seqirus segment manufactures and distributes non-plasma biotherapeutic products; and develops influenza vaccines. CSL Limited was founded in 1916 and is headquartered in Parkville, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Parkville"}, "CSJA.F": {"short_name": "CSL LTD  SPON.ADR 2", "long_name": "CSL Limited", "summary": "CSL Limited researches, develops, manufactures, markets, and distributes biopharmaceutical and allied products in Australia, the United States, Germany, the United Kingdom, Switzerland, China, and internationally. The company operates through two segments, CSL Behring and Seqirus. The CSL Behring segment offers plasma therapies for the treatment of immunodeficiency, bleeding disorders, hereditary angioedema, Alpha-1 antitrypsin deficiency, and neurological disorders. This segment also conducts research on plasma and non-plasma therapies; and receives license and royalty from the commercialization of intellectual property. The Seqirus segment manufactures and distributes non-plasma biotherapeutic products; and develops influenza vaccines. CSL Limited was founded in 1916 and is headquartered in Parkville, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Parkville"}, "CSLLY": {"short_name": "CSL LTD", "long_name": "CSL Limited", "summary": "CSL Limited researches, develops, manufactures, markets, and distributes biopharmaceutical and allied products in Australia, the United States, Germany, the United Kingdom, Switzerland, China, and internationally. The company operates through two segments, CSL Behring and Seqirus. The CSL Behring segment offers plasma therapies for the treatment of immunodeficiency, bleeding disorders, hereditary angioedema, Alpha-1 antitrypsin deficiency, and neurological disorders. This segment also conducts research on plasma and non-plasma therapies; and receives license and royalty from the commercialization of intellectual property. The Seqirus segment manufactures and distributes non-plasma biotherapeutic products; and develops influenza vaccines. CSL Limited was founded in 1916 and is headquartered in Parkville, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Parkville"}, "CTE.AX": {"short_name": "CRYOSITE FPO", "long_name": "Cryosite Limited", "summary": "Cryosite Limited engages in the supply chain logistics and management of pharmaceutical products used in clinical trials, and biological materials in Australia. It operates in two segments, Clinical Trials & Biological Services Logistics, and Cord Blood and Tissues Storage. The Clinical Trials & Biological Services Logistics segment provides specialist temperature-controlled storage, sourcing, labelling, status management, secondary packaging, schedule drug distribution, destruction, returns, and biological storage services to the clinical trial and research industry. The Cord Blood and Tissues Storage segment offers long term storage for cord blood and tissue samples. It serves research, medical, pharmaceutical, veterinary, and biotechnology industries. Cryosite Limited was founded in 1999 and is based in South Granville, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Diagnostics & Research", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "South Granville"}, "CUV.AX": {"short_name": "CLINUVEL FPO", "long_name": "Clinuvel Pharmaceuticals Limited", "summary": "Clinuvel Pharmaceuticals Limited, a biopharmaceutical company, focuses on developing and delivering drugs for the treatment of patients with severe genetic and skin disorders worldwide. Its lead drug candidate is SCENESSE, a photoprotective drug for the prevention of phototoxicity in adult patients with erythropoietic protoporphyria (EPP). The company's pipeline products include CUV9900, an alpha-melanocyte stimulating hormone analogue; Parvysmelanotide (VLRX001), an addition to the family of melanocortin analogues, which provoke increased and prolonged cellular activity; and PRÃ\u0089NUMBRA, a liquid injectable formulation of afamelanotide. Clinuvel Pharmaceuticals Limited has a collaboration agreement with HK Winhealth Pharma Group Co. Limited for launching SCENESSE under a named patient program for the treatment of patients with EPP in the People's Republic of China. The company was founded in 1987 and is headquartered in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "CVJ.F": {"short_name": "CANN GROUP LTD", "long_name": "Cann Group Limited", "summary": "Cann Group Limited engages in research and development, cultivation and production, manufacturing, clinical evaluation, processing, packaging, and distribution and supply of medicinal cannabis for various diseases and medical conditions in Australia. The company was founded in 2014 and is based in Bundoora, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Bundoora"}, "CYC.AX": {"short_name": "CYCLOPHARM FPO", "long_name": "Cyclopharm Limited", "summary": "Cyclopharm Limited engages in the research and development, manufacture, and sale of medical equipment and radiopharmaceuticals in the Asia Pacific, Europe, Canada, and internationally. The company operates through Technegas and Molecular Imaging segments. It offers diagnostic equipment and consumables, which are used by physicians in the detection of pulmonary embolism. The company also provides radiopharmaceuticals that are used by physicians in the detection of cancer, neurological disorders, and cardiac diseases. It serves nuclear medicine departments in hospitals. The company has research collaboration agreement with McMasters University and others to understand the short-term and long-term effects of COVID-19 on lung ventilation and perfusion injury. Cyclopharm Limited was founded in 1986 and is headquartered in Kingsgrove, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Kingsgrove"}, "CYP.AX": {"short_name": "CYNATA THR FPO", "long_name": "Cynata Therapeutics Limited", "summary": "Cynata Therapeutics Limited, together with its subsidiaries, develops and commercializes a proprietary mesenchymal stem cell technology under the Cymerus brand for human therapeutic use in Australia. The company's lead therapeutic product candidate is CYP-001, which has completed Phase I clinical trial for the treatment of graft versus host disease. It also develops products for the treatment of asthma, heart attack, diabetic wounds, coronary artery disease, acute respiratory distress syndrome, brain cancer, melanoma, sepsis, osteoarthritis, and critical limb ischemia, which are in a preclinical model. The company has a partnership with Monash University, University of Sydney, the Cooperative Research Centre for Cell Therapy Manufacturing, University of New South Wales, Critical Care Research Group, Massachusetts General Hospital, and the Royal College of Surgeons in Ireland to develop stem cell therapies. It also has a strategic partnership with Fujifilm Corporation of Japan for the development and research of Cymerus technology. The company was formerly known as Eco Quest Limited and changed its name to Cynata Therapeutics Limited in October 2013. Cynata Therapeutics Limited was founded in 2011 and is based in Carlton, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Carlton"}, "DDF.F": {"short_name": "ANTERIS TECHNOLOGIES", "long_name": "Anteris Technologies Ltd", "summary": "Anteris Technologies Ltd, a structural heart company, researches, develops, commercializes, and distributes various medical technologies and devices. It manufactures, distributes, and sells proprietary ADAPT regenerative tissue products; and researches and develops regenerative medicine and immunotherapies. The company was formerly known as Admedus Limited and changed its name to Anteris Technologies Ltd in May 2020. Anteris Technologies Ltd is based in Toowong, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Toowong"}, "DXB.AX": {"short_name": "DIMERIX FPO", "long_name": "Dimerix Limited", "summary": "Dimerix Limited, a biotechnology company, develops and commercializes new therapies in the area of unmet medical needs. It offers DMX-200, which is in Phase II clinical trial for the treatment of diabetic kidney diseases and focal segmental glomerulosclerosis; and DMX-700, which is in pre-clinical stage for the treatment of chronic obstructive pulmonary disease, as well as proprietary ReceptorHIT assay technology. The company was incorporated in 1975 and is headquartered in Fitzroy, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Fitzroy"}, "E4N.F": {"short_name": "SUDA PHARMACEUTICALS LTD.", "long_name": "Suda Pharmaceuticals Ltd", "summary": "Suda Pharmaceuticals Ltd engages in the development of drug delivery technology in Australia, India, Europe and Korea. It offers ZolpiMist, an oro-mucosal spray formulation of zolpidem tartrate marketed under the brand name of Ambien or Stilnox, a non-benzodiazepine prescribed for the short-term treatment of insomnia. The company's product pipeline includes Sumatriptan, an oral spray formulation for the treatment of acute migraine; and anagrelide, a platelet lowering agent for use in thrombosis, which is used for the treatment of cancer. Suda Pharmaceuticals Ltd has license and supply agreement with Teva Pharmaceuticals International GmbH and Mitsubishi Tanabe Pharma Singapore for ZolpiMist oral spray; product development, licence, and supply agreement with Cann Pharmaceutical Australia Ltd for the development of novel oral spray of pharmaceutical-grade cannabinoid derivatives for the treatment of drug resistant epilepsy, melanoma, and motion sickness; and feasibility and option agreement with Zelira Therapeutics for the use of cannabinoids for a range of uses, including insomnia, autism, opioid reduction, anxiety, pain, and cancer. The company also has a feasibility study and option agreement with Laboratorios Ordesa, S.L. The company was formerly known as Suda Limited and changed its name to Suda Pharmaceuticals Ltd in November 2017. Suda Pharmaceuticals Ltd was incorporated in 1999 and is headquartered in Osborne Park, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Osborne Park"}, "E8M.F": {"short_name": "ELIXINOL GLOBAL", "long_name": "Elixinol Global Limited", "summary": "Elixinol Global Limited, through its subsidiaries, manufactures and distributes industrial hemp-based dietary supplements and skincare products in the Americas, Europe, the United Kingdom, and Australia. The company distributes hemp-derived cannabidiol products under the Elixinol brand. It also acts as a wholesaler, retailer, manufacturer, and exporter of hemp food; offers hemp seeds, hemp protein, hemp oil, and hemp flour; and hemp-based Sativa skincare range, as well as grounded plant based burger range. The company was incorporated in 2017 and is based in Sydney, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Sydney"}, "EBO.AX": {"short_name": "EBOS FPO NZ", "long_name": "EBOS Group Limited", "summary": "EBOS Group Limited engages in the marketing, wholesale, and distribution of healthcare, medical, pharmaceutical, consumer, and animal care products in Australia and New Zealand. It operates in two segments, Healthcare and Animal Care. The company provides healthcare logistics; medication management solutions; pharmacy management software; loyalty, generics, compliance, business intelligence, and store software services; and multi-brand retail pharmacy services. It also offers vitamins, minerals and supplements, herbal and fruit teas, and natural toothpastes, as well as functional foods, including molasses and manuka honey; community based health care services and programs; Pharmacy Choice, a five step integrated retail program for independent pharmacies; and healthSAVE, a community pharmacy banner that allows members drive their retail businesses. In addition, the company supplies health and wellness products public and private hospitals, day surgeries, general practice, aged care facilities, specialist clinics, government, and non-profit health agencies, as well as clinically essential products; and pharmacy services to private and public hospitals, cancer centers, correctional facilities, and veterinary clinics. Further, it offers contract logistics services, such as healthcare distribution, warehousing, clinical trial management, and product registration services; and clinical trial logistics. Additionally, the company provides pet nutrition products, treats, clean-up products, grooming, and accessories; and wholesales veterinary products for companion animals, production animals, and equine athletes. The company was formerly known as Early Bros Dental & Surgical Supplies Ltd. and changed its name to EBOS Group Limited in 1986. EBOS Group Limited was founded in 1922 and is headquartered in Docklands, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Distribution", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Docklands"}, "EBO.NZ": {"short_name": "Ebos Group Limited Ordinary Sha", "long_name": "EBOS Group Limited", "summary": "EBOS Group Limited engages in the marketing, wholesale, and distribution of healthcare, medical, pharmaceutical, consumer, and animal care products in Australia and New Zealand. It operates in two segments, Healthcare and Animal Care. The company provides healthcare logistics; medication management solutions; pharmacy management software; loyalty, generics, compliance, business intelligence, and store software services; and multi-brand retail pharmacy services. It also offers vitamins, minerals and supplements, herbal and fruit teas, and natural toothpastes, as well as functional foods, including molasses and manuka honey; community based health care services and programs; Pharmacy Choice, a five step integrated retail program for independent pharmacies; and healthSAVE, a community pharmacy banner that allows members drive their retail businesses. In addition, the company supplies health and wellness products public and private hospitals, day surgeries, general practice, aged care facilities, specialist clinics, government, and non-profit health agencies, as well as clinically essential products; and pharmacy services to private and public hospitals, cancer centers, correctional facilities, and veterinary clinics. Further, it offers contract logistics services, such as healthcare distribution, warehousing, clinical trial management, and product registration services; and clinical trial logistics. Additionally, the company provides pet nutrition products, treats, clean-up products, grooming, and accessories; and wholesales veterinary products for companion animals, production animals, and equine athletes. The company was formerly known as Early Bros Dental & Surgical Supplies Ltd. and changed its name to EBOS Group Limited in 1986. EBOS Group Limited was founded in 1922 and is headquartered in Docklands, Australia.", "currency": "NZD", "sector": "Healthcare", "industry": "Medical Distribution", "exchange": "NZE", "market": "nz_market", "country": "Australia", "city": "Docklands"}, "ECQ.F": {"short_name": "PHARMAUST LTD.", "long_name": "PharmAust Limited", "summary": "PharmAust Limited, a clinical-stage company, develops targeted cancer therapeutics for human and animal healthcare. The company develops drug discovery intellectual property for the treatment of various cancers in humans and animals. Its lead candidate is Monepantel, which are in Phase II clinical trials for the treatment of cancer. The company also provides highly specialized medicinal and synthetic chemistry services on a contract basis to clients to the drug discovery and pharmaceutical industries. PharmAust Limited was incorporated in 2000 and is based in Bentley, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Bentley"}, "EGQ.F": {"short_name": "BARD1 LIFE SCIENCES", "long_name": "BARD1 Life Sciences Limited", "summary": "BARD1 Life Sciences Limited engages in the research and development of non-invasive diagnostic tests for early detection of cancer in Australia. The company offers hTERT test for diagnosis of bladder cancer, with the development-stage BARD1 autoantibody test for early detection of ovarian, breast and lung cancers; hTERT ICC test, an antibody-based immunocytochemistry stain that detects a component of telomerase; EXO-NET, a technology to capture and isolation of exosomes from any liquid biopsy sample; and BARD1 autoantibodies test to evaluate autoantibody panels and algorithms for detection of ovarian, breast and lung cancers. BARD1 Life Sciences Limited was incorporated in 1983 and is headquartered in South Perth, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Diagnostics & Research", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "South Perth"}, "EHE.AX": {"short_name": "ESTIA HLTH FPO", "long_name": "Estia Health Limited", "summary": "Estia Health Limited operates residential aged care homes in Australia. As of June 30, 2020, it had 69 homes, which include 6,182 resident places in New South Wales, Queensland, South Australia, and Victoria. The company was founded in 2005 and is based in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "ELLXF": {"short_name": "ELIXINOL GLOBAL LTD", "long_name": "Elixinol Global Limited", "summary": "Elixinol Global Limited, through its subsidiaries, manufactures and distributes industrial hemp-based dietary supplements and skincare products in the Americas, Europe, the United Kingdom, and Australia. The company distributes hemp-derived cannabidiol products under the Elixinol brand. It also acts as a wholesaler, retailer, manufacturer, and exporter of hemp food; offers hemp seeds, hemp protein, hemp oil, and hemp flour; and hemp-based Sativa skincare range, as well as grounded plant based burger range. The company was incorporated in 2017 and is based in Sydney, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Sydney"}, "EMD.AX": {"short_name": "EMYRIAL FPO", "long_name": "Emyria Limited", "summary": "Emyria Limited, a healthcare technology and services company, operates a network of specialist medical clinics. Its medical clinics offer treatments, such as cannabinoid-based medicines. As of July 31, 2020, the company operated four patient-focused medical clinics. It has a partnership agreement with Mind Medicine Australia to co-develop a gold-standard and data-driven clinical model for the safe provision of psychedelic-assisted therapies in Australia. The company was formerly known as Emerald Clinics Limited and changed its name to Emyria Limited in September 2020. Emyria Limited was founded in 2018 and is based in West Leederville, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "West Leederville"}, "EMV.AX": {"short_name": "EMVISION FPO", "long_name": "EMvision Medical Devices Limited", "summary": "EMvision Medical Devices Limited engages in the research, development, and commercialization of imaging and diagnostic technology for the purpose of commercializing portable medical device for stroke diagnosis and monitoring, and other medical imaging needs. The company has a strategic collaboration with Keysight Technologies Malaysia Sdn Bhd to develop a personalized vector network analysis solution for medical imaging in the healthcare sector. EMvision Medical Devices Limited was founded in 2017 and is based in Macquarie Park, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Macquarie Park"}, "EOF.AX": {"short_name": "ECOFIBRE FPO", "long_name": "Ecofibre Limited", "summary": "Ecofibre Limited, together with its subsidiaries, engages in breeding, growing, processing, and distributing hemp products in the United States and Australia. It offers protein powders, dehulled hemp seeds, and hemp seed oil products. The company also produces hemp nutraceutical products for human and pet consumption, as well as topical creams and salves; and develops hemp related fiber products. It sells its products through wholesalers and distributors, as well as pharmacy stores under the Ananda Food and Woolworths Macro brand names. The company was founded in 2009 and is based in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "EOFBF": {"short_name": "ECOFIBRE LTD", "long_name": "Ecofibre Limited", "summary": "Ecofibre Limited, together with its subsidiaries, engages in breeding, growing, processing, and distributing hemp products in the United States and Australia. It offers protein powders, dehulled hemp seeds, and hemp seed oil products. The company also produces hemp nutraceutical products for human and pet consumption, as well as topical creams and salves; and develops hemp related fiber products. It sells its products through wholesalers and distributors, as well as pharmacy stores under the Ananda Food and Woolworths Macro brand names. The company was founded in 2009 and is based in Sydney, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Sydney"}, "EX1.AX": {"short_name": "EXOPHARM FPO", "long_name": "Exopharm Limited", "summary": "Exopharm Limited, a biopharmaceutical company, focuses on developing and commercializing human therapeutics using extracellular vesicles (EVs) as medicines in Australia. The company is developing NaÃ¯ve EVs as regenerative medicines, including Plexaris for wound healing; and Cevaris used in inflammatory, immunomodulatory, and tissue remodeling activities. Its Engineered EVs products comprise Fortrexo CoV, an engineered EV product that reduce the duration and severity of SARS-CoV-2 infection in the early phase of a patient's exposure to COVID-19; and Plexodox, a platelet derived EV loaded with the approved anti-cancer drug doxorubicin as a novel and improved anticancer drug. The company was founded in 2013 and is headquartered in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "EXL.AX": {"short_name": "ELIXINOL FPO", "long_name": "Elixinol Global Limited", "summary": "Elixinol Global Limited, through its subsidiaries, manufactures and distributes industrial hemp-based dietary supplements and skincare products in the Americas, Europe, the United Kingdom, and Australia. The company distributes hemp-derived cannabidiol products under the Elixinol brand. It also acts as a wholesaler, retailer, manufacturer, and exporter of hemp food; offers hemp seeds, hemp protein, hemp oil, and hemp flour; and hemp-based Sativa skincare range, as well as grounded plant based burger range. The company was incorporated in 2017 and is based in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "FJY.F": {"short_name": "ACRUX LTD.", "long_name": "Acrux Limited", "summary": "Acrux Limited, together with its subsidiaries, develops and commercializes generic and specialty topical pharmaceuticals in Australia, Germany, the United States, and internationally. The company offers testosterone solutions, such as oral tablets, buccal tablets, subcutaneous pellets, transdermal patches, injections, and topical gels for treatment of adult males who have low or no testosterone. It also provides estradiol sprays for women under the Evamist and Lenzetto brand names for the treatment of flushes associated with menopause. Acrux Limited was founded in 1998 and is based in West Melbourne, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "West Melbourne"}, "GENE": {"short_name": "Genetic Technologies Ltd", "long_name": "Genetic Technologies Limited", "summary": "Genetic Technologies Limited, a molecular diagnostics company, provides predictive testing and assessment tools to help physicians manage women's health in Australia and the United States. The company's lead product is the BREVAGenplus, a clinically validated risk assessment test for non-hereditary breast cancer. It also markets BREVAGenplus to healthcare professionals in breast health care and imaging centers, as well as to obstetricians/gynecologists and breast cancer risk assessment specialists, such as breast surgeons. In addition, the company engages in the development of various cancer risk assessment tests under the GeneType for Colorectal Cancer and GeneType for Breast Cancer name. Further, it offers genetic testing services, including medical, animal, forensic, and plant testing. The company has research and collaboration agreements with the University of Melbourne, Translational Genomics Research Institute, Memorial Sloan Kettering New York Cambridge University, the Ohio State University, and Shivom. Genetic Technologies Limited was founded in 1989 and is headquartered in Fitzroy, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Diagnostics & Research", "exchange": "NCM", "market": "us_market", "country": "Australia", "city": "Fitzroy"}, "GLH.AX": {"short_name": "GLOBALHE FPO", "long_name": "Global Health Limited", "summary": "Global Health Limited develops, sells, and supports application software for the healthcare sector primarily in Australia. It provides mental health software for psychologists and psychiatrists; and integrated software solutions for various areas of community health and human services, including drug and alcohol, disability, dental, post-acute care, home and community care, mental health services, and community rehabilitation. The company's products include MasterCare PAS, a patient administration system for appointment scheduling, theatre bookings, and bed management; MasterCare + for practice management, client record, patient engagement, referral management, secure messaging, and scanned medical records; PrimaryClinic, a medical and practice software for general practitioners, specialists, and allied health practitioners; ReferralNet, a message delivery system for information exchange; LifeCard to hold records and track progress. It also provides MasterCare MHAGIC that supports the workflow of mental health service providers; MasterCare Data Warehouse, which enables reporting, analysis, and decision support for managers and clinicians; HotHealth, a patient engagement platform; Patient Portal that directs information required from patients straight into electronic medical record system or PAS; and Altitude, a cloud hosting service. Global Health Limited was founded in 1985 and is headquartered in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "GTG.AX": {"short_name": "GENE TECH FPO", "long_name": "Genetic Technologies Limited", "summary": "Genetic Technologies Limited, a molecular diagnostics company, provides predictive testing and assessment tools to help physicians manage women's health in Australia and the United States. The company's lead product is the BREVAGenplus, a clinically validated risk assessment test for non-hereditary breast cancer. It also markets BREVAGenplus to healthcare professionals in breast health care and imaging centers, as well as to obstetricians/gynecologists and breast cancer risk assessment specialists, such as breast surgeons. In addition, the company engages in the development of various cancer risk assessment tests under the GeneType for Colorectal Cancer and GeneType for Breast Cancer name. Further, it offers genetic testing services, including medical, animal, forensic, and plant testing. The company has research and collaboration agreements with the University of Melbourne, Translational Genomics Research Institute, Memorial Sloan Kettering New York Cambridge University, the Ohio State University, and Shivom. Genetic Technologies Limited was founded in 1989 and is headquartered in Fitzroy, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Diagnostics & Research", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Fitzroy"}, "HG6.F": {"short_name": "MAYNE PHARMA GROUP LTD.", "long_name": "Mayne Pharma Group Limited", "summary": "Mayne Pharma Group Limited, a specialty pharmaceutical company, manufactures and sells branded and generic pharmaceutical products in Australia, the United States, Korea, and internationally. The company operates through four segments: Generic Products, Specialty Brands, Metrics Contract Services, and Mayne Pharma International. It also offers oral drug delivery systems; and contract development and manufacturing services to third-party customers. The company was formerly known as Halcygen Pharmaceuticals Limited and changed its name to Mayne Pharma Group Limited in November 2010. Mayne Pharma Group Limited was incorporated in 2005 and is based in Salisbury South, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Drug Manufacturers—General", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Salisbury South"}, "HLA.AX": {"short_name": "HEALTHIA FPO", "long_name": "Healthia Limited", "summary": "Healthia Limited provides health services in Australia. The company operates 72 podiatry clinics under the My FootDr brand; 23 physiotherapy clinics under the Allsports Physiotherapy brand; and 7 hand therapy clinics under the Extend Rehabilitation brand, as well as manufactures and sells 3D printed orthotic devices for podiatry clinics. It also sells podiatry and foot and nail care products, podiatry equipment, surgical instruments, orthotic materials, clinical consumables to podiatrists, hospitals, medical centres, nursing homes, and allied health professionals. The company was incorporated in 2018 and is based in Bowen Hills, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Bowen Hills"}, "HLS.AX": {"short_name": "HEALIUS FPO", "long_name": "Healius Limited", "summary": "Healius Limited provides facilities and support services to independent general practitioners, radiologists, and other healthcare professionals in Australia. The company operates through three segments: Pathology, Imaging, and Day Hospitals. It offers diagnostic imaging services, including X-ray, ultrasound, computerized tomography, mammography, magnetic resonance imaging, nuclear medicine, positron emission tomography, and interventional radiology; and private medical laboratory and pathology services. The company also provides cataract surgery, colonoscopy, gastroscopy, plastic and cosmetic surgery, skin, cancer removal, IVF egg collection, and gynaecological surgery services. It operates 2,234 pathology sites; 15 day hospital sites; and 146 imaging sites. The company was formerly known as Primary Health Care Limited and changed its name to Healius Limited in December 2018. Healius Limited was incorporated in 1994 and is based in St Leonards, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "St Leonards"}, "HMD.AX": {"short_name": "HERAMED FPO", "long_name": "HeraMED Limited", "summary": "HeraMED Limited develops and sells pregnancy monitoring solutions for home and professional use in Australia, Europe, and Israel. The company's product is the HeraBEAT, a fetal heart rate monitor principally for use by an expectant mother to monitor their fetus' heartbeat. It is also involved in developing EchoBEAT, the next generation of its home-oriented pregnancy monitoring devices; and Orion, an artificial intelligence powered pregnancy monitoring system for pregnancy monitoring analysis. The company has a co-development agreement with Mayo Clinic for developing platform for pregnancy homecare; cooperation agreement with Freeman Rd & PHI Group to arrange and lead clinical studies in Australia; and partnership agreement with eCare21, Inc. to integrate its technology into the eCare21 platform. HeraMED Limited was founded in 2011 and is based in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "HXL.AX": {"short_name": "HEXIMA FPO", "long_name": "Hexima Limited", "summary": "Hexima Limited, a biotechnology company, engages in the research and development of plant-derived proteins and peptides for applications as human therapeutics. The company's lead drug candidate is HXP124, which is in a phase IIb clinical trial for the treatment of fungal toenail infections. It operates in the topical antifungal sector of the pharmaceutical product development industry worldwide. The company was founded in 1997 and is headquartered in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "IDT.AX": {"short_name": "IDT AUST FPO", "long_name": "IDT Australia Limited", "summary": "IDT Australia Limited engages in the research, development, manufacture, and sale of active pharmaceutical ingredients (APIs) and finished dose form products in Australia and internationally. The company offers analytical method development, stability chambers, and chemistry and microbiology quality control laboratory services, as well as pharmaceutical development services in all dosage forms. Its services also include project management, chemical, analytical chemistry, pharmacy, clinical packaging, and regulatory affairs. In addition, the company offers medical cannabis products; and various contract manufacturing services. IDT Australia Limited was founded in 1975 and is headquartered in Boronia, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Boronia"}, "IG7.F": {"short_name": "MEMPHASYS LTD", "long_name": "Memphasys Limited", "summary": "Memphasys Limited, a bio-separations company, develops, manufactures, and sells cell and protein separation devices, and related consumables for the healthcare, veterinary, and biotechnology market sectors in Australia. It primarily develops Felix that uses high quality sperm cells from semen samples for human assisted reproductive technologies for treating male factor infertility; hydrogels; and other polymer membranes to separate cells from fluids. The company was formerly known as NuSep Holdings Limited and changed its name to Memphasys Limited in July 2016. Memphasys Limited was incorporated in 2006 and is headquartered in Homebush, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Homebush"}, "IHL.AX": {"short_name": "INHEALTH FPO", "long_name": "Incannex Healthcare Limited", "summary": "Incannex Healthcare Limited engages in the research, development, and sale of medicinal cannabinoid products in Australia. It offers pharmaceutical grade cannabinoid products under the Incannex brand name. The company's therapeutic products in clinical trials include IHL-42X for obstructive sleep apnea; IHL-216A for traumatic brain injury; IHL-675A for sepsis associated acute respiratory distress syndrome; and IHL-493C for temporomandibular joint dysfunction. It has partnership with The Alfred Hospital and Novotech on IHL-42X clinical program for obstructive sleep apnea. Incannex Healthcare Limited has partnership with Monash University to conduct clinical trial. The company was formerly known as Impression Healthcare Limited and changed its name to Incannex Healthcare Limited in June 2020. Incannex Healthcare Limited is based in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "IMC.AX": {"short_name": "IMMURON FPO", "long_name": "Immuron Limited", "summary": "Immuron Limited, a biopharmaceutical company, researches and develops oral immunotherapy polyclonal antibodies for the treatment and prevention of infectious and immune modulated diseases in Australia, the United States, and internationally. The company operates through two segments, Research and Development, and Hyperimmune Products. The company markets Travelan and Protectyn for the prevention of travellers' diarrhea. Its lead product candidates include IMM-124E that is in Phase II clinical trials for non-alcoholic steatohepatitis, severe alcoholic hepatitis, and non-alcoholic fatty liver disease, as well as used in antiviral activity against the COVID-19 virus in laboratory studies; and IMM-529, a clinical stage product for clostridium difficile infections. Immuron Limited was founded in 1994 and is based in Carlton, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Carlton"}, "IME.AX": {"short_name": "IMEXHS FPO", "long_name": "ImExHS Limited", "summary": "ImExHS Limited operates as an imaging software as a service and ancillary service provider in Australia and internationally. It is involved in developing and selling Hiruko software platform that comprises radiology information system, which manages the workflow management system with a patient data and image distribution system, as well as picture archiving and communication system that allows healthcare organization to capture, store, view, and share radiology images. The company was founded in 2012 and is headquartered in Mascot, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Mascot"}, "IMM.AX": {"short_name": "IMMUTEP FPO", "long_name": "Immutep Limited", "summary": "Immutep Limited, a biotech company, engages in the research and development of pharmaceutical product candidates. The company develops immunotherapeutic products for the treatment of cancer and autoimmune diseases. Its principal product candidate is IMP321, also known as Â\u0091eftilagimod alpha' or Â\u0091efti', which is a recombinant protein that is in Phase IIb clinical trial as a chemoimmunotherapy combination for metastatic breast cancer termed AIPAC and in a Phase I combination therapy trial in metastatic melanoma termed TACTI-mel; and is being evaluated as a combination therapy in head and neck squamous cell carcinoma and non-small cell lung carcinoma in a Phase II clinical trial called TACTI-002 and an investigator initiated Phase I trial called INSIGHT in advanced solid tumors. Its other products include IMP761, IMP701 and IMP731, all of which are related to lymphocyte activation gene 3, a gene linked to the regulation of T cells in immune responses. Immutep Limited has partnerships with GlaxoSmithKline, Novartis, CYTLIMIC Inc., INSIGHT, and EOC Pharma. The company was formerly known as Prima BioMed Ltd and changed its name to Immutep Limited in November 2017. Immutep Limited was incorporated in 1987 and is based in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "IMMP": {"short_name": "Immutep Limited", "long_name": "Immutep Limited", "summary": "Immutep Limited, a biotech company, engages in the research and development of pharmaceutical product candidates. The company develops immunotherapeutic products for the treatment of cancer and autoimmune diseases. Its principal product candidate is IMP321, also known as Â\u0091eftilagimod alpha' or Â\u0091efti', which is a recombinant protein that is in Phase IIb clinical trial as a chemoimmunotherapy combination for metastatic breast cancer termed AIPAC and in a Phase I combination therapy trial in metastatic melanoma termed TACTI-mel; and is being evaluated as a combination therapy in head and neck squamous cell carcinoma and non-small cell lung carcinoma in a Phase II clinical trial called TACTI-002 and an investigator initiated Phase I trial called INSIGHT in advanced solid tumors. Its other products include IMP761, IMP701 and IMP731, all of which are related to lymphocyte activation gene 3, a gene linked to the regulation of T cells in immune responses. Immutep Limited has partnerships with GlaxoSmithKline, Novartis, CYTLIMIC Inc., INSIGHT, and EOC Pharma. The company was formerly known as Prima BioMed Ltd and changed its name to Immutep Limited in November 2017. Immutep Limited was incorporated in 1987 and is based in Sydney, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "Australia", "city": "Sydney"}, "IMRN": {"short_name": "Immuron Limited", "long_name": "Immuron Limited", "summary": "Immuron Limited, a biopharmaceutical company, researches and develops oral immunotherapy polyclonal antibodies for the treatment and prevention of infectious and immune modulated diseases in Australia, the United States, and internationally. The company operates through two segments, Research and Development, and Hyperimmune Products. The company markets Travelan and Protectyn for the prevention of travellers' diarrhea. Its lead product candidates include IMM-124E that is in Phase II clinical trials for non-alcoholic steatohepatitis, severe alcoholic hepatitis, and non-alcoholic fatty liver disease, as well as used in antiviral activity against the COVID-19 virus in laboratory studies; and IMM-529, a clinical stage product for clostridium difficile infections. Immuron Limited was founded in 1994 and is based in Carlton, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "Australia", "city": "Carlton"}, "IMU.AX": {"short_name": "IMUGENE FPO", "long_name": "Imugene Limited", "summary": "Imugene Limited, a clinical stage immuno-oncology company, develops a range of immunotherapies to activate the immune system of cancer patients to treat and eradicate tumors in Australia. Its lead product is HER-Vaxx, a HER2-positive cancer vaccine that stimulates a polyclonal antibody response against HER2/neu receptors in gastric and breast cancer. The company's HER-Vaxx is in Phase 1b/2 study for gastric cancer. It also engages in developing PD1-Vaxx, a cancer vaccine that aims to induce the body to produce polyclonal antibodies that block PD-1 signalling; B-Vaxx, a cancer vaccine to treat tumors that over-express the HER2/neu receptor; and CF-33, a combination of genomic sequences from various vaccinia virus strains to generate potent virus. Imugene Limited was incorporated in 1986 and is headquartered in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "INNMF": {"short_name": "AMPLIA THERAPEUTICS LTD", "long_name": "Amplia Therapeutics Limited", "summary": "Amplia Therapeutics Limited, a pharmaceutical company, focuses on advancing a pipeline of focal adhesion kinase (FAK) inhibitors for cancer and fibrosis in Australia. Its clinical development pipeline comprises two lead molecules, AMP945 and AMP886 that inhibits (FAK). The company was formerly known as Innate Immunotherapeutics Limited and changed its name to Amplia Therapeutics Limited in September 2018. Amplia Therapeutics Limited was incorporated in 2000 and is headquartered in Melbourne, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Melbourne"}, "IPD.AX": {"short_name": "IMPEDIMED FPO", "long_name": "ImpediMed Limited", "summary": "ImpediMed Limited, a medical software technology company, together with its subsidiaries, develops, manufactures, and sells bioimpedance spectroscopy (BIS) devices and software services in Australia, North America, and internationally. It offers SOZO, a noninvasive bioimpedance spectroscopy device for the detection of lymphedema and fluid status monitoring of heart failure patients; SFB7, a single-channel, tetrapolar BIS device to analyze body composition in healthy individuals; and ImpediVET, a single-channel, tetrapolar (BIS) device that measures fluid status and tissue composition for veterinary applications. The company sells its devices to hospitals and clinics. ImpediMed Limited was founded in 1999 and is headquartered in Pinkenba, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Pinkenba"}, "IPDQF": {"short_name": "IMPEDIMED LIMITED", "long_name": "ImpediMed Limited", "summary": "ImpediMed Limited, a medical software technology company, together with its subsidiaries, develops, manufactures, and sells bioimpedance spectroscopy (BIS) devices and software services in Australia, North America, and internationally. It offers SOZO, a noninvasive bioimpedance spectroscopy device for the detection of lymphedema and fluid status monitoring of heart failure patients; SFB7, a single-channel, tetrapolar BIS device to analyze body composition in healthy individuals; and ImpediVET, a single-channel, tetrapolar (BIS) device that measures fluid status and tissue composition for veterinary applications. The company sells its devices to hospitals and clinics. ImpediMed Limited was founded in 1999 and is headquartered in Pinkenba, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Pinkenba"}, "IQI.F": {"short_name": "INCANNEX HEALTHCARE LTD.", "long_name": "Incannex Healthcare Limited", "summary": "Incannex Healthcare Limited engages in the research, development, and sale of medicinal cannabinoid products in Australia. It offers pharmaceutical grade cannabinoid products under the Incannex brand name. The company's therapeutic products in clinical trials include IHL-42X for obstructive sleep apnea; IHL-216A for traumatic brain injury; IHL-675A for sepsis associated acute respiratory distress syndrome; and IHL-493C for temporomandibular joint dysfunction. It has partnership with The Alfred Hospital and Novotech on IHL-42X clinical program for obstructive sleep apnea. Incannex Healthcare Limited has partnership with Monash University to conduct clinical trial. The company was formerly known as Impression Healthcare Limited and changed its name to Incannex Healthcare Limited in June 2020. Incannex Healthcare Limited is based in Melbourne, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Melbourne"}, "IUGNF": {"short_name": "IMUGENE LIMITED", "long_name": "Imugene Limited", "summary": "Imugene Limited, a clinical stage immuno-oncology company, develops a range of immunotherapies to activate the immune system of cancer patients to treat and eradicate tumors in Australia. Its lead product is HER-Vaxx, a HER2-positive cancer vaccine that stimulates a polyclonal antibody response against HER2/neu receptors in gastric and breast cancer. The company's HER-Vaxx is in Phase 1b/2 study for gastric cancer. It also engages in developing PD1-Vaxx, a cancer vaccine that aims to induce the body to produce polyclonal antibodies that block PD-1 signalling; B-Vaxx, a cancer vaccine to treat tumors that over-express the HER2/neu receptor; and CF-33, a combination of genomic sequences from various vaccinia virus strains to generate potent virus. Imugene Limited was incorporated in 1986 and is headquartered in Sydney, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Sydney"}, "IVIXF": {"short_name": "INVION LTD", "long_name": "Invion Limited", "summary": "Invion Limited, a clinical-stage life-sciences company, researches and develops photodynamic therapy for the treatment of various cancers in Australia. The company is developing IVX-PDT, a chlorophyll-based photosensitizer to treat skin cancers, as well as solid cancers, including lung, prostrate, ovarian, and mesothelioma cancers. It has a research and development agreement with Hudson Institute of Medical Research to collaborate on a range of research and development projects for the Photosoft technology for the treatment of a range of cancers; and research agreement with Peter MacCallum Cancer Centre to undertake pre-clinical and in-vitro studies on Invion's IVX-PDT Photodynamic therapy for ano-genital cancers, including penile and anal cancer. The company was incorporated in 2000 and is headquartered in Melbourne, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Melbourne"}, "IVX.AX": {"short_name": "INVION FPO", "long_name": "Invion Limited", "summary": "Invion Limited, a clinical-stage life-sciences company, researches and develops photodynamic therapy for the treatment of various cancers in Australia. The company is developing IVX-PDT, a chlorophyll-based photosensitizer to treat skin cancers, as well as solid cancers, including lung, prostrate, ovarian, and mesothelioma cancers. It has a research and development agreement with Hudson Institute of Medical Research to collaborate on a range of research and development projects for the Photosoft technology for the treatment of a range of cancers; and research agreement with Peter MacCallum Cancer Centre to undertake pre-clinical and in-vitro studies on Invion's IVX-PDT Photodynamic therapy for ano-genital cancers, including penile and anal cancer. The company was incorporated in 2000 and is headquartered in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "IXC.AX": {"short_name": "INVEX THER FPO", "long_name": "Invex Therapeutics Ltd", "summary": "Invex Therapeutics Ltd, a biopharmaceutical company, engages in the research and development of treatments for neurological conditions in Australia. It is involved in developing Exenatide, a treatment for neurological conditions derived from or involving raised intracranial pressure, such as idiopathic intracranial hypertension, acute stroke, and traumatic brain injury that has completed Phase II clinical trial. The company was incorporated in 2019 and is based in Subiaco, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Subiaco"}, "JHC.AX": {"short_name": "JAPARA FPO", "long_name": "Japara Healthcare Limited", "summary": "Japara Healthcare Limited, together with its subsidiaries, owns, develops, and operates residential aged care homes in Australia. It operates approximately 4,400 resident places across 51 homes located in Victoria, New South Wales, Queensland, South Australia, and Tasmania; and 180 independent living units across 5 retirement villages. The company was founded in 2005 and is based in Southbank, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Southbank"}, "JHL.AX": {"short_name": "JAYEX FPO", "long_name": "Jayex Healthcare Limited", "summary": "Jayex Healthcare Limited develops healthcare industry service technologies and integrated dispensing automation systems for the pharmaceutical and healthcare sectors in Australia and the United Kingdom. The company offers Jayex Connect platform, a cloud-based patient engagement platform, which allow users for appointment booking, patient calling, patient check-in, health messaging, and script management. Jayex Healthcare Limited was founded in 2006 and is based in Milton, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Milton"}, "KMLXF": {"short_name": "RESPIRI LTD", "long_name": "Respiri Limited", "summary": "Respiri Limited, an e-health SaaS company, researches, develops, and commercializes, medical devices in Australia and Israel. The company produces and sells mobile health applications. Its products include Wheezo, a mobile app, which has asthma management diary, medication usage and reminders, and symptoms and triggers to help asthma sufferers; and Wholter, a device for home ambulatory recording of nocturnal wheeze and cough. The company also offers PulmoTrack, a computerized wheeze detection product designed for hospital/clinical based real-time monitoring of wheeze and cough in the management of acute asthma in the ER and ICU, and for pediatric pulmonary function testing and sleep labs. The company was formerly known as iSonea Limited and changed its name to Respiri Limited in December 2015. Respiri Limited is based in Melbourne, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Melbourne"}, "KZA.AX": {"short_name": "KAZIA FPO", "long_name": "Kazia Therapeutics Limited", "summary": "Kazia Therapeutics Limited, an oncology-focused biotechnology company, develops anti-cancer drugs. Its lead development candidate is GDC-0084, a small molecule, brain-penetrant inhibitor of the PI3K/Akt/mTor pathway, which is developed as a potential therapy for glioblastoma. The company is also developing Cantrixil, which is being developed for the treatment of ovarian cancer and is in hospitals across Australia and the United States under an Investigational New Drug application. Kazia Therapeutics Limited has collaboration agreements with St Jude Childrens Hospital; Dana-Farber Cancer Institute; Alliance for Clinical Trials in Oncology; Memorial Sloan Kettering Cancer Centre; and University of Newcastle. Kazia Therapeutics Limited has collaboration with Dana-Farber Cancer Institute to investigate the use of Kazia's investigational new drug, paxalisib, in primary central nervous system lymphoma; and Kintara Therapeutics, Inc. for the activation of paxalisib and VAL-083. The company was formerly known as Novogen Limited and changed its name to Kazia Therapeutics Limited in November 2017. Kazia Therapeutics Limited was founded in 1994 and is based in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "KZIA": {"short_name": "Kazia Therapeutics Limited", "long_name": "Kazia Therapeutics Limited", "summary": "Kazia Therapeutics Limited, an oncology-focused biotechnology company, develops anti-cancer drugs. Its lead development candidate is GDC-0084, a small molecule, brain-penetrant inhibitor of the PI3K/Akt/mTor pathway, which is developed as a potential therapy for glioblastoma. The company is also developing Cantrixil, which is being developed for the treatment of ovarian cancer and is in hospitals across Australia and the United States under an Investigational New Drug application. Kazia Therapeutics Limited has collaboration agreements with St Jude Childrens Hospital; Dana-Farber Cancer Institute; Alliance for Clinical Trials in Oncology; Memorial Sloan Kettering Cancer Centre; and University of Newcastle. Kazia Therapeutics Limited has collaboration with Dana-Farber Cancer Institute to investigate the use of Kazia's investigational new drug, paxalisib, in primary central nervous system lymphoma; and Kintara Therapeutics, Inc. for the activation of paxalisib and VAL-083. The company was formerly known as Novogen Limited and changed its name to Kazia Therapeutics Limited in November 2017. Kazia Therapeutics Limited was founded in 1994 and is based in Sydney, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "Australia", "city": "Sydney"}, "LBT.AX": {"short_name": "LABTECH FPO", "long_name": "LBT Innovations Limited", "summary": "LBT Innovations Limited engages in the research, development, and commercialization of technologies for the healthcare and laboratory supply markets in Australia and Switzerland. It offers MicroStreak, an automated culture-plate streaking and inoculation system; Automated Plate Assessment System, an intelligent imaging and machine learning software; and WoundVue, a technology that uses artificial intelligence to assist clinicians in the assessment and care of chronic wounds. The company was founded in 2004 and is headquartered in Adelaide, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Adelaide"}, "LCT.AX": {"short_name": "LIV CELL FPO", "long_name": "Living Cell Technologies Limited", "summary": "Living Cell Technologies Limited, a biotechnology company, discovers, develops, and commercializes regenerative treatments that use naturally occurring cells to restore functions in New Zealand. The company's lead product is NTCELL, an alginate coated capsule, which is in clinical trials for the treatment of Parkinson's disease. It also develops LP-003, a peptide drug that reduces caloric intake targeting obesity; and LC-002, a novel calcitonin gene-related peptide antagonist targeting migraine. Living Cell Technologies Limited has a research collaboration agreement with the University of Auckland to identify products that utilize patented novel peptide synthetic chemistry technology for the treatments for obesity and migraine. The company was founded in 1987 and is based in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "LGP.AX": {"short_name": "LITTLEGRN FPO", "long_name": "Little Green Pharma Ltd", "summary": "Little Green Pharma Ltd engages in the research and development, cultivation, production, manufacturing, and distribution of medicinal cannabis products in Australia and internationally. It offers a range of medical cannabis preparations in oil formulation under the LGP Natural and LGP Advanced names. The company was founded in 2016 and is headquartered in West Perth, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "West Perth"}, "LHI.F": {"short_name": "LIVING CELL TECHS", "long_name": "Living Cell Technologies Limited", "summary": "Living Cell Technologies Limited, a biotechnology company, discovers, develops, and commercializes regenerative treatments that use naturally occurring cells to restore functions in New Zealand. The company's lead product is NTCELL, an alginate coated capsule, which is in clinical trials for the treatment of Parkinson's disease. It also develops LP-003, a peptide drug that reduces caloric intake targeting obesity; and LC-002, a novel calcitonin gene-related peptide antagonist targeting migraine. Living Cell Technologies Limited has a research collaboration agreement with the University of Auckland to identify products that utilize patented novel peptide synthetic chemistry technology for the treatments for obesity and migraine. The company was founded in 1987 and is based in Melbourne, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Melbourne"}, "LSM.F": {"short_name": "LBT INNOVATIONS LTD.", "long_name": "LBT Innovations Limited", "summary": "LBT Innovations Limited engages in the research, development, and commercialization of technologies for the healthcare and laboratory supply markets in Australia and Switzerland. It offers MicroStreak, an automated culture-plate streaking and inoculation system; Automated Plate Assessment System, an intelligent imaging and machine learning software; and WoundVue, a technology that uses artificial intelligence to assist clinicians in the assessment and care of chronic wounds. The company was founded in 2004 and is headquartered in Adelaide, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Adelaide"}, "LV1.AX": {"short_name": "LIVEVLIM FPO", "long_name": "Live Verdure Ltd", "summary": "Live Verdure Ltd develops hemp plant-based solutions in Australia. The company offers hemp seed oil, seed oil capsules, infused manuka honey, honey, drinking chocolate, seed, greens, chai powder, porridge with dried fruit, falafel, health booster, falafel spicy, porridge, flour, food, muesli, protein powder, and falafel lemon and pepper. It distributes its products under the 13 Seeds brand name. The company was formerly known as 13 Seeds Pty Ltd and changed its name to Live Verdure Ltd in October 2020. Live Verdure Ltd was incorporated in 2016 and is based in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "LVCLF": {"short_name": "LIVING CELL TECHNOLOGIES", "long_name": "Living Cell Technologies Limited", "summary": "Living Cell Technologies Limited, a biotechnology company, discovers, develops, and commercializes regenerative treatments that use naturally occurring cells to restore functions in New Zealand. The company's lead product is NTCELL, an alginate coated capsule, which is in clinical trials for the treatment of Parkinson's disease. It also develops LP-003, a peptide drug that reduces caloric intake targeting obesity; and LC-002, a novel calcitonin gene-related peptide antagonist targeting migraine. Living Cell Technologies Limited has a research collaboration agreement with the University of Auckland to identify products that utilize patented novel peptide synthetic chemistry technology for the treatments for obesity and migraine. The company was founded in 1987 and is based in Melbourne, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Melbourne"}, "LVCLY": {"short_name": "LIVING CELL TECHNOLOGIES", "long_name": "Living Cell Technologies Limited", "summary": "Living Cell Technologies Limited, a biotechnology company, discovers, develops, and commercializes regenerative treatments that use naturally occurring cells to restore functions in New Zealand. The company's lead product is NTCELL, an alginate coated capsule, which is in clinical trials for the treatment of Parkinson's disease. It also develops LP-003, a peptide drug that reduces caloric intake targeting obesity; and LC-002, a novel calcitonin gene-related peptide antagonist targeting migraine. Living Cell Technologies Limited has a research collaboration agreement with the University of Auckland to identify products that utilize patented novel peptide synthetic chemistry technology for the treatments for obesity and migraine. The company was founded in 1987 and is based in Melbourne, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Melbourne"}, "LWB.F": {"short_name": "MESOBLAST LTD.", "long_name": "Mesoblast Limited", "summary": "Mesoblast Limited, a biopharmaceutical company, develops and commercializes allogeneic cellular medicines. The company offers products in the areas of cardiovascular, spine orthopedic disorder, oncology, hematology, and immune-mediated and inflammatory diseases. Its proprietary regenerative medicine technology platform is based on specialized cells known as mesenchymal lineage adult stem cells. The company's products under the Phase III clinical trials include MSC-100-IV for steroid refractory acute graft versus host disease; MPC-150-IM for advanced heart failure; and MPC-06-ID for chronic low back pain due to degenerative disc disease. It is also developing MPC-300-IV that is in Phase II clinical trials for the treatment of biologic refractory rheumatoid arthritis, diabetic kidney diseases, and type 2 diabetic nephropathy. It operates in the United States, Australia, Singapore, the United Kingdom, and Switzerland. Mesoblast Limited has strategic partnerships with Tasly Pharmaceutical Group to offer MPC-150-IM for heart failure and MPC-25-IC for heart attacks in China; JCR Pharmaceuticals Co. Ltd. for the treatment of wound healing in patients with epidermolysis bullosa; and GrÃ¼nenthal to develop and commercialize cell therapy for the treatment of chronic low back pain. The company was founded in 2004 and is headquartered in Melbourne, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Melbourne"}, "LWBA.F": {"short_name": "MESOBLAST SP.ADRS 144A/5", "long_name": "Mesoblast Limited", "summary": "Mesoblast Limited, a biopharmaceutical company, develops and commercializes allogeneic cellular medicines. The company offers products in the areas of cardiovascular, spine orthopedic disorder, oncology, hematology, and immune-mediated and inflammatory diseases. Its proprietary regenerative medicine technology platform is based on specialized cells known as mesenchymal lineage adult stem cells. The company's products under the Phase III clinical trials include MSC-100-IV for steroid refractory acute graft versus host disease; MPC-150-IM for advanced heart failure; and MPC-06-ID for chronic low back pain due to degenerative disc disease. It is also developing MPC-300-IV that is in Phase II clinical trials for the treatment of biologic refractory rheumatoid arthritis, diabetic kidney diseases, and type 2 diabetic nephropathy. It operates in the United States, Australia, Singapore, the United Kingdom, and Switzerland. Mesoblast Limited has strategic partnerships with Tasly Pharmaceutical Group to offer MPC-150-IM for heart failure and MPC-25-IC for heart attacks in China; JCR Pharmaceuticals Co. Ltd. for the treatment of wound healing in patients with epidermolysis bullosa; and GrÃ¼nenthal to develop and commercialize cell therapy for the treatment of chronic low back pain. The company was founded in 2004 and is headquartered in Melbourne, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Melbourne"}, "MAYNF": {"short_name": "MAYNE PHARMA GROUP LIMITED", "long_name": "Mayne Pharma Group Limited", "summary": "Mayne Pharma Group Limited, a specialty pharmaceutical company, manufactures and sells branded and generic pharmaceutical products in Australia, the United States, Korea, and internationally. The company operates through four segments: Generic Products, Specialty Brands, Metrics Contract Services, and Mayne Pharma International. It also offers oral drug delivery systems; and contract development and manufacturing services to third-party customers. The company was formerly known as Halcygen Pharmaceuticals Limited and changed its name to Mayne Pharma Group Limited in November 2010. Mayne Pharma Group Limited was incorporated in 2005 and is based in Salisbury South, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Drug Manufacturers—General", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Salisbury South"}, "MDBIF": {"short_name": "MEDIBIO LIMITED", "long_name": "Medibio Limited", "summary": "Medibio Limited, a health technology company, researches, develops, and commercializes mental health technology to assist in the screening, diagnosing, monitoring, and management of depression and other mental health conditions in Australia and the United States. It offers mental well-being solutions for businesses through corporate health product; and develops products for healthcare provider market. Medibio Limited has a clinical trial agreement with MedBridge Healthcare LLC to support Medibio's sleep analysis of depressive burden (SADB) trial. The company was formerly known as BioProspect Limited and changed its name to Medibio Limited in November 2014. Medibio Limited was incorporated in 1987 and is based in Melbourne, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Melbourne"}, "MDC.AX": {"short_name": "MEDLAB FPO", "long_name": "Medlab Clinical Limited", "summary": "Medlab Clinical Limited, a medical research and development facility, engages in the nutraceutical products and pharmaceutical research businesses in Australia. The company develops bio-therapeutics for chronic kidney diseases, pre-diabetes/obesity, depression, musculoskeletal muscle loss associated with ageing, and non-opioid pain management. It also provides nutraceuticals for anti-inflammatory, cardiovascular support, endocrine support, gastrointestinal support, immunological support, infants and toddlers, metabolic support, musculoskeletal support, neurological support, sports performance, urogenital support, and weight management, as well as for men, pregnancy, seniors, teenagers, and women support. Medlab Clinical Limited was founded in 2012 and is headquartered in Botany, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Alexandria"}, "MDR.AX": {"short_name": "MEDADVISOR FPO", "long_name": "MedAdvisor Limited", "summary": "MedAdvisor Limited, together with its subsidiaries, develops and delivers software for personal medication management in Australia. It develops and deploys the MedAdvisor, a medication and adherence platform that connects health professionals with patients using mobile and web technologies. MedAdvisor Limited was incorporated in 2010 and is headquartered in Camberwell, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Camberwell"}, "MEB.AX": {"short_name": "MEDIBIOLTD FPO", "long_name": "Medibio Limited", "summary": "Medibio Limited, a health technology company, researches, develops, and commercializes mental health technology to assist in the screening, diagnosing, monitoring, and management of depression and other mental health conditions in Australia and the United States. It offers mental well-being solutions for businesses through corporate health product; and develops products for healthcare provider market. Medibio Limited has a clinical trial agreement with MedBridge Healthcare LLC to support Medibio's sleep analysis of depressive burden (SADB) trial. The company was formerly known as BioProspect Limited and changed its name to Medibio Limited in November 2014. Medibio Limited was incorporated in 1987 and is based in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "MEM.AX": {"short_name": "MEMPHASYS FPO", "long_name": "Memphasys Limited", "summary": "Memphasys Limited, a bio-separations company, develops, manufactures, and sells cell and protein separation devices, and related consumables for the healthcare, veterinary, and biotechnology market sectors in Australia. It primarily develops Felix that uses high quality sperm cells from semen samples for human assisted reproductive technologies for treating male factor infertility; hydrogels; and other polymer membranes to separate cells from fluids. The company was formerly known as NuSep Holdings Limited and changed its name to Memphasys Limited in July 2016. Memphasys Limited was incorporated in 2006 and is headquartered in Homebush, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Homebush"}, "MEOBF": {"short_name": "MESOBLAST LTD", "long_name": "Mesoblast Limited", "summary": "Mesoblast Limited, a biopharmaceutical company, develops and commercializes allogeneic cellular medicines. The company offers products in the areas of cardiovascular, spine orthopedic disorder, oncology, hematology, and immune-mediated and inflammatory diseases. Its proprietary regenerative medicine technology platform is based on specialized cells known as mesenchymal lineage adult stem cells. The company's products under the Phase III clinical trials include MSC-100-IV for steroid refractory acute graft versus host disease; MPC-150-IM for advanced heart failure; and MPC-06-ID for chronic low back pain due to degenerative disc disease. It is also developing MPC-300-IV that is in Phase II clinical trials for the treatment of biologic refractory rheumatoid arthritis, diabetic kidney diseases, and type 2 diabetic nephropathy. It operates in the United States, Australia, Singapore, the United Kingdom, and Switzerland. Mesoblast Limited has strategic partnerships with Tasly Pharmaceutical Group to offer MPC-150-IM for heart failure and MPC-25-IC for heart attacks in China; JCR Pharmaceuticals Co. Ltd. for the treatment of wound healing in patients with epidermolysis bullosa; and GrÃ¼nenthal to develop and commercialize cell therapy for the treatment of chronic low back pain. The company was founded in 2004 and is headquartered in Melbourne, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Melbourne"}, "MESO": {"short_name": "Mesoblast Limited", "long_name": "Mesoblast Limited", "summary": "Mesoblast Limited, a biopharmaceutical company, develops and commercializes allogeneic cellular medicines. The company offers products in the areas of cardiovascular, spine orthopedic disorder, oncology, hematology, and immune-mediated and inflammatory diseases. Its proprietary regenerative medicine technology platform is based on specialized cells known as mesenchymal lineage adult stem cells. The company's products under the Phase III clinical trials include MSC-100-IV for steroid refractory acute graft versus host disease; MPC-150-IM for advanced heart failure; and MPC-06-ID for chronic low back pain due to degenerative disc disease. It is also developing MPC-300-IV that is in Phase II clinical trials for the treatment of biologic refractory rheumatoid arthritis, diabetic kidney diseases, and type 2 diabetic nephropathy. It operates in the United States, Australia, Singapore, the United Kingdom, and Switzerland. Mesoblast Limited has strategic partnerships with Tasly Pharmaceutical Group to offer MPC-150-IM for heart failure and MPC-25-IC for heart attacks in China; JCR Pharmaceuticals Co. Ltd. for the treatment of wound healing in patients with epidermolysis bullosa; and GrÃ¼nenthal to develop and commercialize cell therapy for the treatment of chronic low back pain. The company was founded in 2004 and is headquartered in Melbourne, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "Australia", "city": "Melbourne"}, "MFJ.F": {"short_name": "POLYNOVO LTD", "long_name": "PolyNovo Limited", "summary": "Polynovo Limited develops medical devices in the United States, Australia, New Zealand, and internationally. The company offers NovoSorb Biodegradable Temporising Matrix, which is used in a fully debrided clean surgical wound to physiologically close the wound. It is also developing Syntrel hernia devices for hernia repair; breast devices in partnership with Establishment Labs; NovoSorb dermal beta cell implant in collaboration with BetaCell Technologies Pty Ltd; and NovoSorb drug elution depots. The company was formerly known as Calzada Limited and changed its name to Polynovo Limited in November 2014. Polynovo Limited was incorporated in 1998 and is based in Port Melbourne, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Port Melbourne"}, "MGCLF": {"short_name": "MGC PHARMACEUTICALS LTD", "long_name": "MGC Pharmaceuticals Limited", "summary": "MGC Pharmaceuticals Limited, together with its subsidiaries, produces and supplies phytocannabinoid derived medicines in Australia and Slovenia. It provides pharmaceutical products, such as Tetrinol for the treatment of cachexia; MXOT01GB01 to treat glioblastoma; MXOT02ME01 for the treatment of melanoma cancer; MXOT03PC01 to treat prostate cancer; TopiCann for the topical treatment of eczema and inflamed skin; and InCann, a biactive capsule to treat Chron's and IBS. The company's products under development include CannEpil, which is in Phase IIb clinical trial for the treatment in children and adolescents with refectory epilepsy; CogniCann that is in Phase II clinical trial to treat dementia and Alzheimer's diseases; and ArtemiC, which is in Phase II clinical trial for the treatment COVID-19. It has strategic collaborative partnership agreements Epilepsy Action Australia, Royal Melbourne Institute of Technology, the University of Notre Dame in Western Australia, as well as the National Institute of Biology & University Medical Centre, Ljubljana Slovenia. The company was formerly known as Erin Resources Limited and changed its name to MGC Pharmaceuticals Limited in December 2015. MGC Pharmaceuticals Limited was founded in 2014 and is headquartered in West Perth, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "West Perth"}, "MIS.F": {"short_name": "MONASH IVF GROUP LTD", "long_name": "Monash IVF Group Limited", "summary": "Monash IVF Group Limited provides assisted reproductive and specialist women imaging services in Australia and Malaysia. The company offers diagnosis and treatment of infertility, fertility research and treatment services, tertiary level prenatal diagnostic services, low intervention IVF services, and diagnostic ultrasound services. Monash IVF Group Limited was incorporated in 2014 and is based in Richmond, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Diagnostics & Research", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Richmond"}, "MLPH": {"short_name": "MOLECULAR PHARMACOLOGY LIMITED", "long_name": "Molecular Pharmacology (USA), Ltd.", "summary": "Molecular Pharmacology (USA) Limited, a development stage company, develops and commercializes pain and inflammation management products primarily in Australia and the United States. The company, through its subsidiary, Molecular Pharmacology Pty. Ltd., develops analgesic and anti-inflammatory molecule, known as Tripeptofen for the treatment of common every-day pain. Its products are available in various dosage forms, formulations, line extensions, and package configurations. The company focuses on marketing its products through pharmaceutical distributors, and through collaborative dealings with companies in the United States and Europe. It also has an agreement with Dermatology Development Corporation to develop and market a range of therapeutic, cosmetic, and cosmecutical products based on the ThermaLIFE product range and its active ingredient. The company is based in Perth, Australia. Molecular Pharmacology (USA) Limited is a subsidiary of PharmaNet Group Limited.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Perth"}, "MMJJF": {"short_name": "MMJ GROUP HOLDINGS LTD", "long_name": "MMJ Group Holdings Limited", "summary": "MMJ Group Holdings Limited operates as a cannabis investment company worldwide. It owns a portfolio of cannabis sector investments. The company was formerly known as MMJ PhytoTech Limited. MMJ Group Holdings Limited was incorporated in 2014 and is based in Sydney, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Sydney"}, "MSB.AX": {"short_name": "MESOBLAST FPO", "long_name": "Mesoblast Limited", "summary": "Mesoblast Limited, a biopharmaceutical company, develops and commercializes allogeneic cellular medicines. The company offers products in the areas of cardiovascular, spine orthopedic disorder, oncology, hematology, and immune-mediated and inflammatory diseases. Its proprietary regenerative medicine technology platform is based on specialized cells known as mesenchymal lineage adult stem cells. The company's products under the Phase III clinical trials include MSC-100-IV for steroid refractory acute graft versus host disease; MPC-150-IM for advanced heart failure; and MPC-06-ID for chronic low back pain due to degenerative disc disease. It is also developing MPC-300-IV that is in Phase II clinical trials for the treatment of biologic refractory rheumatoid arthritis, diabetic kidney diseases, and type 2 diabetic nephropathy. It operates in the United States, Australia, Singapore, the United Kingdom, and Switzerland. Mesoblast Limited has strategic partnerships with Tasly Pharmaceutical Group to offer MPC-150-IM for heart failure and MPC-25-IC for heart attacks in China; JCR Pharmaceuticals Co. Ltd. for the treatment of wound healing in patients with epidermolysis bullosa; and GrÃ¼nenthal to develop and commercialize cell therapy for the treatment of chronic low back pain. The company was founded in 2004 and is headquartered in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "MVF.AX": {"short_name": "MONASH IVF FPO", "long_name": "Monash IVF Group Limited", "summary": "Monash IVF Group Limited provides assisted reproductive and specialist women imaging services in Australia and Malaysia. The company offers diagnosis and treatment of infertility, fertility research and treatment services, tertiary level prenatal diagnostic services, low intervention IVF services, and diagnostic ultrasound services. Monash IVF Group Limited was incorporated in 2014 and is based in Richmond, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Diagnostics & Research", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Richmond"}, "MVP.AX": {"short_name": "MEDICALDEV FPO", "long_name": "Medical Developments International Limited", "summary": "Medical Developments International Limited manufactures and distributes pharmaceutical and veterinary products, and medical devices. The company operates through three segments: Pharmaceuticals, Medical Devices, and Veterinary Products. It offers asthma and COPD pressurized metered dose inhalers, as well as masks and peak flow meters for asthma management for use in home or in hospitals; Penthrox, a prescription only medicine for pain relief; medical devices; and various veterinary anesthetic machines to veterinarians. The company operates in Australia, New Zealand, the United Kingdom, rest of Europe, Canada, the Middle East, Asia, South Africa, North America, and internationally. Medical Developments International Limited was incorporated in 2003 and is headquartered in Scoresby, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Scoresby"}, "MXC.AX": {"short_name": "MGC PHARMA FPO", "long_name": "MGC Pharmaceuticals Limited", "summary": "MGC Pharmaceuticals Limited, together with its subsidiaries, produces and supplies phytocannabinoid derived medicines in Australia and Slovenia. It provides pharmaceutical products, such as Tetrinol for the treatment of cachexia; MXOT01GB01 to treat glioblastoma; MXOT02ME01 for the treatment of melanoma cancer; MXOT03PC01 to treat prostate cancer; TopiCann for the topical treatment of eczema and inflamed skin; and InCann, a biactive capsule to treat Chron's and IBS. The company's products under development include CannEpil, which is in Phase IIb clinical trial for the treatment in children and adolescents with refectory epilepsy; CogniCann that is in Phase II clinical trial to treat dementia and Alzheimer's diseases; and ArtemiC, which is in Phase II clinical trial for the treatment COVID-19. It has strategic collaborative partnership agreements Epilepsy Action Australia, Royal Melbourne Institute of Technology, the University of Notre Dame in Western Australia, as well as the National Institute of Biology & University Medical Centre, Ljubljana Slovenia. The company was formerly known as Erin Resources Limited and changed its name to MGC Pharmaceuticals Limited in December 2015. MGC Pharmaceuticals Limited was founded in 2014 and is headquartered in West Perth, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "West Perth"}, "MYX.AX": {"short_name": "M PHARMA FPO", "long_name": "Mayne Pharma Group Limited", "summary": "Mayne Pharma Group Limited, a specialty pharmaceutical company, manufactures and sells branded and generic pharmaceutical products in Australia, the United States, Korea, and internationally. The company operates through four segments: Generic Products, Specialty Brands, Metrics Contract Services, and Mayne Pharma International. It also offers oral drug delivery systems; and contract development and manufacturing services to third-party customers. The company was formerly known as Halcygen Pharmaceuticals Limited and changed its name to Mayne Pharma Group Limited in November 2010. Mayne Pharma Group Limited was incorporated in 2005 and is based in Salisbury South, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—General", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Salisbury South"}, "N6A.F": {"short_name": "ONCOSIL MEDICAL LTD", "long_name": "OncoSil Medical Limited", "summary": "OncoSil Medical Limited, a medical device company, focuses on the development of localized treatments for pancreatic and liver cancer in Australia. Its lead product is OncoSil, a brachytherapy device that implants a pre-determined dose of beta radiation directly into cancerous tissue for the treatment of cancer. The company was formerly known as NeuroDiscovery Limited and changed its name to OncoSil Medical Limited in June 2013. OncoSil Medical Limited is headquartered in North Sydney, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "North Sydney"}, "NAN.AX": {"short_name": "NANOSONICS FPO", "long_name": "Nanosonics Limited", "summary": "Nanosonics Limited, together with its subsidiaries, engages in the research, development, and commercialization of infection control and decontamination products and related technologies. The company manufactures and distributes the trophon ultrasound probe disinfector, and its associated consumables and accessories for reducing cross-contamination between patients and the spread of healthcare acquired infections. It also provides trophon2, an ultrasound probe high level disinfection device; and trophon EPR, a device designed to disinfect intracavity and surface ultrasound probes. In addition, the company offers trophon EPR and trophon2 consumables and accessories, including NanoNebulant, a proprietary disinfectant liquid; trophon chemical indicators; trophon AcuTrace operator cards, medical instrument tags, printers, printer USB cables, printer label rolls, and logbooks; trophon wall mounts, printer wall mounts, carts, and printer cart mounts; trophon companion drying wipes and companion wipes wall mounts; clean ultrasound probe covers; and trophon AcuTrace PLUS activation cards. It operates in North America, Europe, the Middle East, and the Asia Pacific. The company was incorporated in 2000 and is headquartered in Lane Cove, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Instruments & Supplies", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Lane Cove"}, "NC6.AX": {"short_name": "NANOLLOSE FPO", "long_name": "Nanollose Limited", "summary": "Nanollose Limited, a biotechnology company, engages in the research and development, and promotion of the microbial nanocellulose technology in Australia. It focuses on the development of Nullarbor, a plant-free viscose-rayon fibre. The company's products are used in textiles, nonwoven fabric, and other industries. Nanollose Limited was founded in 2014 and is based in Nedlands, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Nedlands"}, "NEU.AX": {"short_name": "NEUREN FPO NZ", "long_name": "Neuren Pharmaceuticals Limited", "summary": "Neuren Pharmaceuticals Limited, a biopharmaceutical company, develops drugs for the treatment of neurological disorders. Its lead product is trofinetide, which is in Phase III clinical trial for the treatment of Rett syndrome, as well as is in Phase II clinical trial to treat Fragile X syndrome. The company also develops NNZ-2591 that is in preclinical development for the treatment of Phelan-McDermid, Angelman, and Pitt Hopkins syndromes. In addition, it provides development services; and holds loan funded shares. Neuren Pharmaceuticals Limited was incorporated in 1993 and is based in Camberwell, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Camberwell"}, "NNCSF": {"short_name": "NANOSONICS LIMITED", "long_name": "Nanosonics Limited", "summary": "Nanosonics Limited, together with its subsidiaries, engages in the research, development, and commercialization of infection control and decontamination products and related technologies. The company manufactures and distributes the trophon ultrasound probe disinfector, and its associated consumables and accessories for reducing cross-contamination between patients and the spread of healthcare acquired infections. It also provides trophon2, an ultrasound probe high level disinfection device; and trophon EPR, a device designed to disinfect intracavity and surface ultrasound probes. In addition, the company offers trophon EPR and trophon2 consumables and accessories, including NanoNebulant, a proprietary disinfectant liquid; trophon chemical indicators; trophon AcuTrace operator cards, medical instrument tags, printers, printer USB cables, printer label rolls, and logbooks; trophon wall mounts, printer wall mounts, carts, and printer cart mounts; trophon companion drying wipes and companion wipes wall mounts; clean ultrasound probe covers; and trophon AcuTrace PLUS activation cards. It operates in North America, Europe, the Middle East, and the Asia Pacific. The company was incorporated in 2000 and is headquartered in Lane Cove, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Instruments & Supplies", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Lane Cove"}, "NOX.AX": {"short_name": "NOXOPHARM FPO", "long_name": "Noxopharm Limited", "summary": "Noxopharm Limited, a drug development company, focuses on the research and development of drugs to enhance radiotherapy in Australia and internationally. It primarily develops Veyonda, an adjuvant therapy in chemotherapy and radiotherapy for the treatment of late-stage cancers. The company also focuses on developing NYX-330, a PCSK9-inhibitor and LDL-cholesterol-lowering drug; NYX-104, a neuroprotectant that protects the brain from further damage after stroke and traumatic brain injury; and NYX-205, an anti-inflammatory drug for the treatment of nerve tissue inflammation. In addition, it develops anti-autoimmune drugs, such as IRAK4 and TPL2 inhibitors; and LuPIN for the combined therapy of Veyonda and 177Lu-PSMA-617. Noxopharm Limited has a partnership with Hudson Institute of Medical Research and a collaboration with The Australian National University to develop a better treatment for septic shock. The company was incorporated in 2015 and is based in Gordon, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Gordon"}, "NOXOF": {"short_name": "NOXOPHARM LTD", "long_name": "Noxopharm Limited", "summary": "Noxopharm Limited, a drug development company, focuses on the research and development of drugs to enhance radiotherapy in Australia and internationally. It primarily develops Veyonda, an adjuvant therapy in chemotherapy and radiotherapy for the treatment of late-stage cancers. The company also focuses on developing NYX-330, a PCSK9-inhibitor and LDL-cholesterol-lowering drug; NYX-104, a neuroprotectant that protects the brain from further damage after stroke and traumatic brain injury; and NYX-205, an anti-inflammatory drug for the treatment of nerve tissue inflammation. In addition, it develops anti-autoimmune drugs, such as IRAK4 and TPL2 inhibitors; and LuPIN for the combined therapy of Veyonda and 177Lu-PSMA-617. Noxopharm Limited has a partnership with Hudson Institute of Medical Research and a collaboration with The Australian National University to develop a better treatment for septic shock. The company was incorporated in 2015 and is based in Gordon, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Gordon"}, "NSB.AX": {"short_name": "NEUROSCIEN FPO", "long_name": "NeuroScientific Biopharmaceuticals Limited", "summary": "NeuroScientific Biopharmaceuticals Limited develops diagnostic and therapeutic treatments for neurodegenerative diseases through preclinical studies of patented technologies. The company's lead drug candidates include EmtinB for treatment of neurodegenerative dementia and Alzheimer's disease, and degenerative conditions of the optic nerve. NeuroScientific Biopharmaceuticals Limited was incorporated in 2002 and is based in Cottesloe, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Nedlands"}, "NUG.F": {"short_name": "RESAPP HEALTH", "long_name": "ResApp Health Limited", "summary": "ResApp Health Limited develops digital healthcare solutions to assist doctors and allow patients to diagnose and manage respiratory disease. The company offers ResAppDx, a smartphone-based acute respiratory disease diagnostic test for use in telehealth, emergency department, and primary care markets; and SleepCheck, a direct-to-consumer smartphone application for the self-assessment of sleep apnoea in 36 countries. Its technology uses sound to diagnose respiratory diseases, including pneumonia, bronchiolitis, bronchitis, chronic obstructive pulmonary disease, and asthma. ResApp Health Limited has a joint development and pilot agreement with Medgate AG to integrate and test smartphone-based acute respiratory diagnostic test. The company was formerly known as Narhex Life Sciences Limited. ResApp Health Limited was founded in 2014 and is headquartered in Brisbane, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Brisbane"}, "NURPF": {"short_name": "NEUREN PHARMACEUTICALS LTD", "long_name": "Neuren Pharmaceuticals Limited", "summary": "Neuren Pharmaceuticals Limited, a biopharmaceutical company, develops drugs for the treatment of neurological disorders. Its lead product is trofinetide, which is in Phase III clinical trial for the treatment of Rett syndrome, as well as is in Phase II clinical trial to treat Fragile X syndrome. The company also develops NNZ-2591 that is in preclinical development for the treatment of Phelan-McDermid, Angelman, and Pitt Hopkins syndromes. In addition, it provides development services; and holds loan funded shares. Neuren Pharmaceuticals Limited was incorporated in 1993 and is based in Camberwell, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Camberwell"}, "NV9.F": {"short_name": "KAZIA THERAPEUTICS", "long_name": "Kazia Therapeutics Limited", "summary": "Kazia Therapeutics Limited, an oncology-focused biotechnology company, develops anti-cancer drugs. Its lead development candidate is GDC-0084, a small molecule, brain-penetrant inhibitor of the PI3K/Akt/mTor pathway, which is developed as a potential therapy for glioblastoma. The company is also developing Cantrixil, which is being developed for the treatment of ovarian cancer and is in hospitals across Australia and the United States under an Investigational New Drug application. Kazia Therapeutics Limited has collaboration agreements with St Jude Childrens Hospital; Dana-Farber Cancer Institute; Alliance for Clinical Trials in Oncology; Memorial Sloan Kettering Cancer Centre; and University of Newcastle. Kazia Therapeutics Limited has collaboration with Dana-Farber Cancer Institute to investigate the use of Kazia's investigational new drug, paxalisib, in primary central nervous system lymphoma; and Kintara Therapeutics, Inc. for the activation of paxalisib and VAL-083. The company was formerly known as Novogen Limited and changed its name to Kazia Therapeutics Limited in November 2017. Kazia Therapeutics Limited was founded in 1994 and is based in Sydney, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Sydney"}, "NV9M.F": {"short_name": "KAZIA THER.LTD.ADR 10 NEW", "long_name": "Kazia Therapeutics Limited", "summary": "Kazia Therapeutics Limited, an oncology-focused biotechnology company, develops anti-cancer drugs. Its lead development candidate is GDC-0084, a small molecule, brain-penetrant inhibitor of the PI3K/Akt/mTor pathway, which is developed as a potential therapy for glioblastoma. The company is also developing Cantrixil, which is being developed for the treatment of ovarian cancer and is in hospitals across Australia and the United States under an Investigational New Drug application. Kazia Therapeutics Limited has collaboration agreements with St Jude Childrens Hospital; Dana-Farber Cancer Institute; Alliance for Clinical Trials in Oncology; Memorial Sloan Kettering Cancer Centre; and University of Newcastle. Kazia Therapeutics Limited has collaboration with Dana-Farber Cancer Institute to investigate the use of Kazia's investigational new drug, paxalisib, in primary central nervous system lymphoma; and Kintara Therapeutics, Inc. for the activation of paxalisib and VAL-083. The company was formerly known as Novogen Limited and changed its name to Kazia Therapeutics Limited in November 2017. Kazia Therapeutics Limited was founded in 1994 and is based in Sydney, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Sydney"}, "NXS.AX": {"short_name": "NEXTSCIENC FPO", "long_name": "Next Science Limited", "summary": "Next Science Limited, a medical technology company, researches, develops, and commercializes non-toxic technology products with efficacy in eradicating biofilm based and free-floating bacteria in the United States and Australia. The company develops its products using its Xbio Technology platform. It offers SurgX, an innovative surgical gel designed to reduce superficial surgical site infections and protect wound tissue to facilitate natural healing; and Bactisure, a surgical lavage that is used to remove debris, including microorganisms from wounds. The company also provides BlastX, an antimicrobial wound gel that destroys bacteria within the gel and defends from recolonization while maintaining a moist wound environment. In addition, it is developing acne cream and cleanser. Next Science Limited was founded in 2012 and is headquartered in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "NXSCF": {"short_name": "NEXT SCIENCE LTD", "long_name": "Next Science Limited", "summary": "Next Science Limited, a medical technology company, researches, develops, and commercializes non-toxic technology products with efficacy in eradicating biofilm based and free-floating bacteria in the United States and Australia. The company develops its products using its Xbio Technology platform. It offers SurgX, an innovative surgical gel designed to reduce superficial surgical site infections and protect wound tissue to facilitate natural healing; and Bactisure, a surgical lavage that is used to remove debris, including microorganisms from wounds. The company also provides BlastX, an antimicrobial wound gel that destroys bacteria within the gel and defends from recolonization while maintaining a moist wound environment. In addition, it is developing acne cream and cleanser. Next Science Limited was founded in 2012 and is headquartered in Sydney, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Sydney"}, "NYR.AX": {"short_name": "NYRADA CDI FORUS", "long_name": "Nyrada Inc.", "summary": "Nyrada Inc., a pre-clinical stage drug development company, engages in the development of small molecule drugs for cardiovascular, neurodegenerative, and chronic inflammatory diseases. Its products in drug development stage include PCSK9 inhibitor for the treatment of high blood LDL-cholesterol levels in patients poorly responsive to or unable to take statin drugs; a neuroprotectant drug to reduce the impact of long-term disability in patients with ischaemic stroke and traumatic brain injury; a drug to treat pain associated with peripheral nerve damage; and a drug to treat autoimmune diseases, such as psoriasis. The company was founded in 2017 and is based in Gordon, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Gordon"}, "OC5.F": {"short_name": "COCHLEAR LTD", "long_name": "Cochlear Limited", "summary": "Cochlear Limited provides implantable hearing solutions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers cochlear implants, including Nucleus 7, Nucleus 6, Nucleus CP802, and Kanso sound processors; and Baha bone conduction implants, such as Baha attract system, Baha connect system, Baha softband, Baha soundarc, Baha 5 sound processor, and Baha sound processor. It also provides Cochlear true wireless accessories comprising mini microphones, phone clips, and TV streamers; Nucleus water-safe accessories; and training and development services. Cochlear Limited was founded in 1981 and is headquartered in Sydney, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Sydney"}, "OCC.AX": {"short_name": "ORTHOCELL FPO", "long_name": "Orthocell Limited", "summary": "Orthocell Limited, a regenerative medicine company, develops and commercializes cell therapies and biological medical devices for the repair and regeneration of human tendon, bone, nerve, and cartilage defects in Australia. The company's principal products include CelGro, a naturally derived collagen medical device for soft tissue repair that is under clinical trials for use as an augment to the surgical repair of tendons, peripheral nerves, bones, and articular cartilage; and Ortho-ATI, a cell therapy for treatment of chronic tendon injuries. It also provides Ortho-ACI, an autologous chondrocyte implantation for the treatment of symptomatic defects of the articulating cartilage of the joints, primarily in the knee and ankle. Orthocell Limited was founded in 2006 and is based in Murdoch, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Murdoch"}, "OEZ.F": {"short_name": "AVECHO BIOTECHN. LTD", "long_name": "Avecho Biotechnology Limited", "summary": "Avecho Biotechnology Limited, a biotechnology company, develops, produces, sells, and licenses products using its patented platform technology, Targeted Penetration Matrix (TPM) drug delivery system for the pharmaceutical, skin care, animal health, and nutrition industries. The company operates through Production, Human Health, and Animal Health and Nutrition segments. It offers TPM and Vital ET products for use in drug delivery and cosmetic formulations; and develops TPM/Oxymorphone and TPM/Oxycodone. The company's human health portfolio covers delivery of pharmaceutical products through gels, injectables, and patches. It provides non-antibiotic feed additive products to enhance feed efficiency and the health of livestock animals. The company serves customers in Australia, Switzerland, the United States, India, Japan, China, Singapore, and internationally. The company was formerly known as Phosphagenics Limited and changed its name to Avecho Biotechnology Limited in May 2019. Avecho Biotechnology Limited is based in Melbourne, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Melbourne"}, "OPL.AX": {"short_name": "OPYLLIMITD FPO", "long_name": "Opyl Limited", "summary": "Opyl Limited operates a SaaS platform that allows to search and source user generated content (UGC). Its UGC Discovery platform protects against unauthorized use of people's social and digital content. The company also offers social media marketing agency services, including client and account management services; a MediaConsent Clinical platform that aggregates structured and unstructured data from various sources giving consumers or patients control over their health data and to contribute their data to medical research; and consumer data and privacy compliance services. It operates in Australia and the United States. The company was formerly known as ShareRoot Limited and changed its name to Opyl Limited in December 2019. Opyl Limited was incorporated in 1994 and is based in St Kilda, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "St Kilda"}, "OPT": {"short_name": "Opthea Limited", "long_name": "Opthea Limited", "summary": "Opthea Limited, a biotechnology company, develops and commercializes therapies primarily for eye disease in Australia. The company's development activities are based on the intellectual property portfolio covering Vascular Endothelial Growth Factors (VEGF) VEGF-C, VEGF-D, and VEGF Receptor-3 for the treatment of diseases associated with blood and lymphatic vessel growth, as well as vascular leakage. Its lead molecule is OPT-302, a soluble form of VEGFR-3 for the treatment of wet age-related macular degeneration and diabetic macular edema. The company was formerly known as Circadian Technologies Limited and changed its name to Opthea Limited in December 2015. Opthea Limited was incorporated in 1984 and is based in South Yarra, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "Australia", "city": "South Yarra"}, "OPT.AX": {"short_name": "OPTHEA FPO", "long_name": "Opthea Limited", "summary": "Opthea Limited, a biotechnology company, develops and commercializes therapies primarily for eye disease in Australia. The company's development activities are based on the intellectual property portfolio covering Vascular Endothelial Growth Factors (VEGF) VEGF-C, VEGF-D, and VEGF Receptor-3 for the treatment of diseases associated with blood and lymphatic vessel growth, as well as vascular leakage. Its lead molecule is OPT-302, a soluble form of VEGFR-3 for the treatment of wet age-related macular degeneration and diabetic macular edema. The company was formerly known as Circadian Technologies Limited and changed its name to Opthea Limited in December 2015. Opthea Limited was incorporated in 1984 and is based in South Yarra, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "South Yarra"}, "OQS.F": {"short_name": "NANOSONICS LTD", "long_name": "Nanosonics Limited", "summary": "Nanosonics Limited, together with its subsidiaries, engages in the research, development, and commercialization of infection control and decontamination products and related technologies. The company manufactures and distributes the trophon ultrasound probe disinfector, and its associated consumables and accessories for reducing cross-contamination between patients and the spread of healthcare acquired infections. It also provides trophon2, an ultrasound probe high level disinfection device; and trophon EPR, a device designed to disinfect intracavity and surface ultrasound probes. In addition, the company offers trophon EPR and trophon2 consumables and accessories, including NanoNebulant, a proprietary disinfectant liquid; trophon chemical indicators; trophon AcuTrace operator cards, medical instrument tags, printers, printer USB cables, printer label rolls, and logbooks; trophon wall mounts, printer wall mounts, carts, and printer cart mounts; trophon companion drying wipes and companion wipes wall mounts; clean ultrasound probe covers; and trophon AcuTrace PLUS activation cards. It operates in North America, Europe, the Middle East, and the Asia Pacific. The company was incorporated in 2000 and is headquartered in Lane Cove, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Instruments & Supplies", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Lane Cove"}, "OSL.AX": {"short_name": "ONCOSIL FPO", "long_name": "OncoSil Medical Limited", "summary": "OncoSil Medical Limited, a medical device company, focuses on the development of localized treatments for pancreatic and liver cancer in Australia. Its lead product is OncoSil, a brachytherapy device that implants a pre-determined dose of beta radiation directly into cancerous tissue for the treatment of cancer. The company was formerly known as NeuroDiscovery Limited and changed its name to OncoSil Medical Limited in June 2013. OncoSil Medical Limited is headquartered in North Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "North Sydney"}, "OVN.AX": {"short_name": "OVENTUS FPO", "long_name": "Oventus Medical Limited", "summary": "Oventus Medical Limited, a medical device company, develops and commercializes oral appliances for the treatment of obstructive sleep apnoea (OSA) and snoring in Australia, Canada, and the United States. The company offers O2Vent Optima, a customized 3D-printed nylon oral appliance for OSA patients; and ExVent, an alternative for CPAP-intolerant individuals. It also develops O2Vent. The company was incorporated in 2015 and is headquartered in Indooroopilly, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Indooroopilly"}, "PAB.AX": {"short_name": "PATRYS FPO", "long_name": "Patrys Limited", "summary": "Patrys Limited, together with its subsidiaries, develops and commercializes antibody technologies for the treatment of cancer in Australia. Its lead technology is Deoxymab 3E10, a DNA damage-repair antibody that penetrates live cell nuclei and inhibits mechanisms of DNA repair in target cancer cells. The company also focuses on developing PAT-DX1 as a treatment for metastatic triple negative breast cancer and glioblastoma. In addition, it engages in developing PAT-SC1's target/antigen CD55PAT-SC1, an isoform of the membrane-bound CD55 for the treatment of gastric cancer. Patrys Limited was founded in 2006 and is based in South Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "PARNF": {"short_name": "PARNELL PHARMACEUTICALS HLDGS L", "long_name": "Parnell Pharmaceuticals Holdings Ltd", "summary": "Parnell Pharmaceuticals Holdings Ltd, a veterinary pharmaceutical company, focuses on developing, manufacturing, and commercializing various animal health solutions. The company operates through four segments: Companion Animal, Production Animal - U.S., Production Animal - Rest of World, and Manufacturing Operations. It markets various products, including estroPLAN and GONAbreed reproductive hormone products for improving cattle breeding performance; Zydax for the treatment of osteoarthritis (OA) in dogs and horses; and Glyde, a nutraceutical product aids in the treatment of OA, as well as Parnell PROcept, which adds an additional injection of estroPLAN after the first injection. The company also operates mySYNCH, a digital tool to help veterinarians and producers optimize reproduction and maximize economic gains. Parnell Pharmaceuticals Holdings Ltd was incorporated in 2009 and is headquartered in Alexandria, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Alexandria"}, "PBIGF": {"short_name": "PARADIGM BIOPHARMACEUTICALS LTD", "long_name": "Paradigm Biopharmaceuticals Limited", "summary": "Paradigm Biopharmaceuticals Limited, a biopharmaceutical company, engages in the research and development of therapeutic products for human use in Australia. It offers pentosan polysulphate sodium drugs in the injectable form for the treatment of bone marrow edema, respiratory, and alphaviral arthritis diseases. The company was incorporated in 2014 and is based in Melbourne, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Melbourne"}, "PBP.AX": {"short_name": "PROBIOTEC FPO", "long_name": "Probiotec Limited", "summary": "Probiotec Limited engages in the development, manufacture and sale of pharmaceuticals, consumer health, and nutraceutical products in Australia and internationally. The company provides contract manufacturing services for solid dose tablets, capsules, and caplets; tablets coating; blister packing; liquids, creams, gels, and ointments and suspensions; powders and powder blending; and sprays, as well as manufacturing and packaging of finished doses. It also offers analytical and stability testing services; new product formulation and production trials, and ongoing research and development services; and packaging options for human and animal nutrition products, as well as manufactures and exports a range of nutraceuticals and functional ingredient raw materials. In addition, the company provides packing services and formats, including foil, carded and clamshell blister packing, bottle filling, labelling, secondary packaging, and other services for the pharmaceutical, cosmetic, and food industries. Probiotec Limited was incorporated in 1996 and is headquartered in Laverton North, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Laverton North"}, "PCK.AX": {"short_name": "PAINCHEK FPO", "long_name": "PainChek Limited", "summary": "PainChek Limited develops and commercializes mobile medical device applications that provides pain assessment for individuals primarily in Australia and Europe. The company offers PainChek, which uses camera in smartphone and tablets to capture video that is analyzed in real time using facial recognition software to indicate the presence of the pain. It serves patients suffering with dementia. The company was formerly known as ePAT Technologies Ltd and changed its name to PainChek Limited. in January 2018. PainChek Limited is based in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "PD1A.F": {"short_name": "ANSELL LTD.", "long_name": "Ansell Limited", "summary": "Ansell Limited designs, develops, and manufactures protection solutions in the Asia Pacific, Europe, the Middle East, Africa, Latin America, Caribbean, and North America. It operates in two segments, Healthcare and Industrial. The Healthcare segment manufactures and markets solutions comprising surgical gloves, single use and examination gloves, and clean and sterile gloves and garments, as well as consumables used by healthcare, life sciences, and industrial workers for a range of customers, including hospitals, surgical centers, dental surgeries, veterinary clinics, first responders, manufacturers, auto repair shops, chemical plants, laboratories, and pharmaceutical companies. The Industrial segment manufactures and markets high-performance hand and chemical protective clothing solutions for a range of industrial applications, including automotive, chemical, metal fabrication, machinery and equipment, food, construction, mining, oil and gas, and first responders. The company was formerly known as Pacific Dunlop Limited and changed its name to Ansell Limited in 2002. Ansell Limited was founded in 1893 and is based in Richmond, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Instruments & Supplies", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Richmond"}, "PGC.AX": {"short_name": "PARAGON FPO", "long_name": "Paragon Care Limited", "summary": "Paragon Care Limited supplies durable medical equipment, medical devices, and consumable medical products to health and aged care markets in Australia, New Zealand, and internationally. The company offers clinical solutions for anaesthetists, intensivists, cardiac, vascular, and pain management; designs, manufactures, and distributes reagent red blood cells, monoclonal blood grouping reagents, and ancillary products for immunohaematology laboratories; and eye care products, such as ophthalmology and optometry, neonatal vision screening, and procedural kits. It also provides neonatal and paediatric assessment and treatment, including newborn hearing and vision screening, jaundice management, targeted temperature management, cerebral function monitoring, and seizure detection, as well as pain management and enteral feeding solutions; surgical products for hip and knee arthroplasty, infection prevention, pain management, specialty orthopaedics, biologics, and spine; and equipment repair and maintenance services. In addition, the company offers sterilisable transducers for surgical procedures such as neurology, hepatobiliary, renal, colorectal, vascular, laparoscopic, and robotic procedures; ultrasound systems, shockwave therapy, lasers, and accessories for infection control; and veterinary products, including point-of-care blood analyzers, centrifuges, laser technology, IV lines and fluid therapy, and closed system transfer devices for hazardous drugs. Further, it provides telephony, nurse call, access control, CCTV, cordless, and Wi-Fi products. The company was formerly known as Citrofresh International Limited and changed its name to Paragon Care Limited in June 2008. Paragon Care Limited was incorporated in 1994 and is based in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Distribution", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "PGZ.F": {"short_name": "HEALIUS LTD", "long_name": "Healius Limited", "summary": "Healius Limited provides facilities and support services to independent general practitioners, radiologists, and other healthcare professionals in Australia. The company operates through three segments: Pathology, Imaging, and Day Hospitals. It offers diagnostic imaging services, including X-ray, ultrasound, computerized tomography, mammography, magnetic resonance imaging, nuclear medicine, positron emission tomography, and interventional radiology; and private medical laboratory and pathology services. The company also provides cataract surgery, colonoscopy, gastroscopy, plastic and cosmetic surgery, skin, cancer removal, IVF egg collection, and gynaecological surgery services. It operates 2,234 pathology sites; 15 day hospital sites; and 146 imaging sites. The company was formerly known as Primary Health Care Limited and changed its name to Healius Limited in December 2018. Healius Limited was incorporated in 1994 and is based in St Leonards, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "St Leonards"}, "PIQ.AX": {"short_name": "PROTEOMICS FPO", "long_name": "Proteomics International Laboratories Limited", "summary": "Proteomics International Laboratories Limited operates as a medical technology company with a focus on the area of proteomics. It provides PromarkerD, a predictive test for diabetic kidney disease; and develops diagnostic tests for endometriosis and giardia. The company also offers analytical services, including specialist contract research, analytical, and consultancy. Proteomics International Laboratories Ltd has a research agreement with the Busselton Population Medical Research Institute to enhance diagnosis and treatment of lung conditions, such as asthma and chronic obstructive pulmonary disease; the Janssen Research & Development, LLC for the research of diabetic kidney and heart disease treatment; and partnership with QIMR Berghofer Medical Research Institute for the detection of oesophageal adenocarcinoma, the primary common form of oesophageal cancer in Australia. The company was founded in 2001 and is based in Perth, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Perth"}, "PKS.AX": {"short_name": "PKSHOLDING FPO", "long_name": "PKS Holdings Limited", "summary": "PKS Holdings Limited, a healthcare technology company, engages in the development and provision of software services for the healthcare industry in Australia, Europe, the Americas, and internationally. It operates in two segments: CDS and Pavilion. The company offers RippleDown Auditor, a knowledge-based system that allows various departments within a laboratory, including data entry, billing, and specimen reception to audit data in real-time; and RippleDown Expert, an clinical decision support system that provides real-time patient monitoring, alerting, data mining, and reporting capability. It also provides LabQ, a data mining tool; PICQ, an auditing tool used in hospitals; RISQ, a tool for reviewing records in datasets to assess the quality of condition onset flags data and incidences of hospital-acquired complications; and Codexpert, a web-based eBook application that provides health-data classification reference for clinical coding of patient episodes. It serves customers through direct sales and channel partners. The company was formerly known as QPro Holdings Limited. PKS Holdings Limited was founded in 1996 and is headquartered in Surry Hills, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Surry Hills"}, "PME.AX": {"short_name": "PROMEDICUS FPO", "long_name": "Pro Medicus Limited", "summary": "Pro Medicus Limited provides radiology information systems (RIS), picture archiving and communication systems (PACS), and advanced visualization solutions in Australia, Europe, and North America. It offers medical software for practice management; integration products; Promedicus.net secure email; healthcare software that provides radiologist and clinicians with advanced visualization capability for viewing 2-D, 3-D, and 4-D medical images; and PACS/Digital imaging software. The company offers its products under the Visage RIS, Visage RIS/PACS, and Visage 7 names. It also provides Visage Ease Pro, a mobile applications, which allow users access to medical imaging results that are stored on a Visage 7 server; training, installation, and professional services; and after sale support and service products. The company offers its products and services to hospitals, diagnostic imaging groups, and other health related entities. Pro Medicus Limited was founded in 1983 and is headquartered in Richmond, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Richmond"}, "PNV.AX": {"short_name": "POLYNOVO FPO", "long_name": "PolyNovo Limited", "summary": "Polynovo Limited develops medical devices in the United States, Australia, New Zealand, and internationally. The company offers NovoSorb Biodegradable Temporising Matrix, which is used in a fully debrided clean surgical wound to physiologically close the wound. It is also developing Syntrel hernia devices for hernia repair; breast devices in partnership with Establishment Labs; NovoSorb dermal beta cell implant in collaboration with BetaCell Technologies Pty Ltd; and NovoSorb drug elution depots. The company was formerly known as Calzada Limited and changed its name to Polynovo Limited in November 2014. Polynovo Limited was incorporated in 1998 and is based in Port Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Port Melbourne"}, "PPCB": {"short_name": "PROPANC BIOPHARMA INC", "long_name": "Propanc Biopharma, Inc.", "summary": "Propanc Biopharma, Inc., a development-stage healthcare company, focuses on the development of cancer treatments for patients with pancreatic, ovarian, and colorectal cancer in Australia. Its lead product is PRP, a formulation that is in preclinical phase of development designed to enhance the anti-cancer effects of multiple enzymes acting synergistically. The company has a research collaboration with University of JaÃ©n to commence the POP1 joint drug discovery program. The company was formerly known as Propanc Health Group Corporation and changed its name to Propanc Biopharma, Inc. in April 2017. Propanc Biopharma, Inc. was founded in 2007 and is based in Camberwell, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Camberwell"}, "PQ6.F": {"short_name": "STARPHARMA HOLDINGS LTD.", "long_name": "Starpharma Holdings Limited", "summary": "Starpharma Holdings Limited engages in the research, development, and commercialization of dendrimer products for pharmaceutical, life-science, and other applications worldwide. The company offers VivaGel, a non-antibiotic therapy for the management and prevention of bacterial vaginosis. It also develops VivaGel condom, an antiviral condom; and DEP, a dendrimer drug delivery technology, including DEP docetaxel that is in Phase II clinical trials, DEP cabazitaxel that is in Phase 1 clinical trial, and DEP irinotecan that is in phase 1/2 clinical trials for the treatment of solid tumors. The company was founded in 1996 and is headquartered in Abbotsford, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Abbotsford"}, "PRNAF": {"short_name": "ALTERITY THERAPEUTICS LIMITED", "long_name": "Alterity Therapeutics Limited", "summary": "Alterity Therapeutics Limited researches and develops therapeutic drugs for the treatment of Parkinsonian's disease and other neurodegenerative diseases in Australia. The company's lead drug candidates is ATH434 that has completed Phase I clinical trial for the treatment of Parkinson's disease. It is also developing PBT2 for used as an antimicrobial agent. The company was formerly known as Prana Biotechnology Limited and changed its name to Alterity Therapeutics Limited in April 2019. The company was founded in 1997 and is based in Melbourne, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Melbourne"}, "PRRUF": {"short_name": "IMMUTEP LTD", "long_name": "Immutep Limited", "summary": "Immutep Limited, a biotech company, engages in the research and development of pharmaceutical product candidates. The company develops immunotherapeutic products for the treatment of cancer and autoimmune diseases. Its principal product candidate is IMP321, also known as Â\u0091eftilagimod alpha' or Â\u0091efti', which is a recombinant protein that is in Phase IIb clinical trial as a chemoimmunotherapy combination for metastatic breast cancer termed AIPAC and in a Phase I combination therapy trial in metastatic melanoma termed TACTI-mel; and is being evaluated as a combination therapy in head and neck squamous cell carcinoma and non-small cell lung carcinoma in a Phase II clinical trial called TACTI-002 and an investigator initiated Phase I trial called INSIGHT in advanced solid tumors. Its other products include IMP761, IMP701 and IMP731, all of which are related to lymphocyte activation gene 3, a gene linked to the regulation of T cells in immune responses. Immutep Limited has partnerships with GlaxoSmithKline, Novartis, CYTLIMIC Inc., INSIGHT, and EOC Pharma. The company was formerly known as Prima BioMed Ltd and changed its name to Immutep Limited in November 2017. Immutep Limited was incorporated in 1987 and is based in Sydney, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Sydney"}, "PSQ.AX": {"short_name": "PACSMILES FPO", "long_name": "Pacific Smiles Group Limited", "summary": "Pacific Smiles Group Limited, together with its subsidiaries, owns and operates dental centers under the Pacific Smiles Dental and nib Dental Care brand names in Eastern Australia. The company provides general dentistry services, including check-ups, teeth cleaning, fillings, and extractions; dental treatments, such as crowns, bridges, fillings, and extractions; advanced dentistry comprising dental implants; and specialist dentistry, such as orthodontics, prosthodontics, endodontics, and periodontics, as well as other treatments under general anaesthetic and intravenous sedation. As of June 30, 2020, it operated 94 centers. The company was incorporated in 2002 and is headquartered in East Maitland, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "East Maitland"}, "PTX.AX": {"short_name": "PRESCIENT FPO", "long_name": "Prescient Therapeutics Limited", "summary": "Prescient Therapeutics Limited, a clinical stage oncology company, develops novel drugs for the treatment of a range of cancers in Australia. The company's lead drug candidate is PTX-200, which is in Phase II clinical trial for HER2-negative breast cancer, Phase IB/2 clinical trial in relapsed and refractory AML, and Phase 1b in recurrent or persistent platinum-resistant ovarian cancer; and PTX-100, a RhoA inhibitor, for hematological and solid malignancies that focuses on cancers with Ras and RhoA mutations. Prescient Therapeutics Limited has a collaboration agreement with Carina Biotech to develop cell therapies. The company was formerly known as Virax Holdings Limited and changed its name to Prescient Therapeutics Limited in December 2014. Prescient Therapeutics Limited was incorporated in 1986 and is based in South Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "PXSLY": {"short_name": "PHARMAXIS", "long_name": "Pharmaxis Ltd", "summary": "Pharmaxis Ltd engages in the research, development, and commercialization of healthcare products for the treatment of fibrotic and inflammatory diseases worldwide. The company operates through two segments, Mannitol business, and New Drug Development. It offers Bronchitol, an inhaled dry powder for the treatment of cystic fibrosis; and Aridol, an airways inflammation test that is used to identify twitchy or hyper-responsive airways, as well as to assist in diagnosing and managing asthma. The company's product pipeline consists of amine oxidase inhibitors comprising semicarbazide-sensitive amine oxidase for diabetic retinopathy; selective lysyl oxidase like inhibitors targeting chronic fibrotic diseases, such as NASH, pulmonary fibrosis, kidney fibrosis, and cardiac fibrosis; and pan-lysyl oxidase inhibitors targeting severe fibrotic indications, which includes cancers and scarring. It is also developing Orbital, a dry powder inhaler to deliver high drug doses to lungs. Pharmaxis Ltd was founded in 1998 and is headquartered in Frenchs Forest, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Drug Manufacturers—General", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Frenchs Forest"}, "QTM.AX": {"short_name": "QUANTHEGRP FPO", "long_name": "Quantum Health Group Limited", "summary": "Quantum Health Group Limited distributes medical imaging and patient treatment equipment and services in Australia, Thailand, South Korea, Vietnam, New Zealand, the Philippines, and China. It operates in two segments, Medical and Environmental Services. The company distributes medical products in the field of radiology, oncology, aesthetics, and environmental health. It also manufactures energy saving heat pump technology used for heating and cooling systems internationally. The company was formerly known as Quantum Energy Limited. Quantum Health Group Limited was founded in 1975 and is headquartered in Rosebery, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Rosebery"}, "R9Q.F": {"short_name": "RECCE PHARMACEUTICALS LTD", "long_name": "Recce Pharmaceuticals Ltd", "summary": "Recce Pharmaceuticals Ltd, a biotechnology company, engages in the research, development, and commercialization of synthetic antibiotics in Australia, the United States, and the United Kingdom. The company's lead candidate is RECCE 327 to treat blood infections and sepsis derived from E. coli and S. aureus bacteria, including their superbug forms. It also develops RECCE 529, a synthetic anti-infective for viral infections; and RECCE 435, a synthetic polymer antibiotics. The company was formerly known as Recce Limited and changed its name to Recce Pharmaceuticals Ltd in November 2017. Recce Pharmaceuticals Ltd was incorporated in 2007 and is headquartered in Sydney, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Sydney"}, "RAC.AX": {"short_name": "RACEONCO FPO", "long_name": "Race Oncology Limited", "summary": "Race Oncology Limited operates as a specialty pharmaceutical company in Australia. It is developing Bisantrene, a small molecule cancer chemotherapy drug that is used for the treatment of acute myeloid leukaemia. The company was formerly known as Coronado Resources Limited and changed its name to Race Oncology Limited in July 2016. Race Oncology Limited was incorporated in 2011 and is based in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "RAP.AX": {"short_name": "RESAPP FPO", "long_name": "ResApp Health Limited", "summary": "ResApp Health Limited develops digital healthcare solutions to assist doctors and allow patients to diagnose and manage respiratory disease. The company offers ResAppDx, a smartphone-based acute respiratory disease diagnostic test for use in telehealth, emergency department, and primary care markets; and SleepCheck, a direct-to-consumer smartphone application for the self-assessment of sleep apnoea in 36 countries. Its technology uses sound to diagnose respiratory diseases, including pneumonia, bronchiolitis, bronchitis, chronic obstructive pulmonary disease, and asthma. ResApp Health Limited has a joint development and pilot agreement with Medgate AG to integrate and test smartphone-based acute respiratory diagnostic test. The company was formerly known as Narhex Life Sciences Limited. ResApp Health Limited was founded in 2014 and is headquartered in Brisbane, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Brisbane"}, "RAP.SW": {"short_name": "Rapid Nutrition N", "long_name": "Rapid Nutrition PLC", "summary": "Rapid Nutrition PLC, a natural healthcare company, researches, develops, and produces a range of life science products. The company offers meal replacement shakes, energy boosting tablets, weight loss tablets, and appetite suppressant powders under the Leisa's Secret brand; and high protein shakes, high fiber bars, organic multivitamins, fat burning shots, and grain granola cereals under the SystemLS brand. It primarily exports its products in Asia, Europe, Africa, the Middle East, North America, and Australia. The company was incorporated in 2001 and is based in Meadowbrook, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "EBS", "market": "ch_market", "country": "Australia", "city": "Meadowbrook"}, "RCE.AX": {"short_name": "RECCE LTD FPO", "long_name": "Recce Pharmaceuticals Ltd", "summary": "Recce Pharmaceuticals Ltd, a biotechnology company, engages in the research, development, and commercialization of synthetic antibiotics in Australia, the United States, and the United Kingdom. The company's lead candidate is RECCE 327 to treat blood infections and sepsis derived from E. coli and S. aureus bacteria, including their superbug forms. It also develops RECCE 529, a synthetic anti-infective for viral infections; and RECCE 435, a synthetic polymer antibiotics. The company was formerly known as Recce Limited and changed its name to Recce Pharmaceuticals Ltd in November 2017. Recce Pharmaceuticals Ltd was incorporated in 2007 and is headquartered in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "RHC.AX": {"short_name": "RAMSAY FPO", "long_name": "Ramsay Health Care Limited", "summary": "Ramsay Health Care Limited provides health care services to public and private patients. The company's health care services comprise day surgery procedures and other surgeries, as well as psychiatric care and rehabilitation services. It operates through approximately 500 locations across Australia, the United Kingdom, France, Sweden, Norway, Denmark, Germany, Indonesia, Malaysia, Hong Kong, and Italy. The company was founded in 1964 and is based in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "RHCPA.AX": {"short_name": "RAMSAY KPYR6QT", "long_name": "Ramsay Health Care Limited", "summary": "Ramsay Health Care Limited provides health care services to public and private patients. The company's health care services comprise day surgery procedures and other surgeries, as well as psychiatric care and rehabilitation services. It operates through approximately 500 locations across Australia, the United Kingdom, France, Sweden, Norway, Denmark, Germany, Indonesia, Malaysia, Hong Kong, and Italy. The company was founded in 1964 and is based in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "RHNMF": {"short_name": "RHINOMED LIMITED", "long_name": "Rhinomed Limited", "summary": "Rhinomed Limited engages in the research, development, and commercialization of consumer and medical devices worldwide. It identifies, acquires, and commercializes nasal stent delivery technologies. The company's product portfolio includes Turbine for enhanced breathing in sports; Mute, an anti-snoring device; and Pronto for nasal congestion and sleep disturbance issues. It also engages in developing applications for the delivery of medical cannabis and conditions, including anxiety, pain, allergies, nausea, anxiety, and coughs and colds; and nasal swab to test the presence of upper respiratory tract diseases, including influenza, and coronavirus strains. The company was formerly known as Consegna Group Limited and changed its name to Rhinomed Limited in November 2013. Rhinomed Limited was incorporated in 2004 and is based in Richmond, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Richmond"}, "RHT.AX": {"short_name": "RESONANCE FPO", "long_name": "Resonance Health Limited", "summary": "Resonance Health Limited, a healthcare company, develops and delivers non-invasive medical imaging software and services worldwide. Its flagship products include FerriScan, a non-invasive liver diagnostic technology used for the measurement of liver iron concentration; and FerriSmart, an automated software medical device to manage patients with iron overload disorders, such as thalassemia, sickle cell disease, hereditary haemochromatosis, anaemias, and cancers. The company also offers Cardiac T2, a dual analysis service with FerriScan to provide information regarding body iron stores; HepaFat-Scan, a magnetic resonance imaging (MRI) based tool for the measurement of volumetric liver fat fraction; HepaFat-AI, an artificial intelligence software tool, which is used for the automated assessment of liver fat from MRI data; and Bone Marrow R2-MRI for the assessment of iron levels in the bone marrow. It also provides imaging core laboratory and support services for clinical trials. The company serves clinicians for the diagnosis and management of human diseases; researchers; and pharmaceutical companies for their clinical trials. Resonance Health Limited was incorporated in 1987 and is headquartered in Burswood, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Burswood"}, "RHY.AX": {"short_name": "RHYTHM BIO FPO", "long_name": "Rhythm Biosciences Limited", "summary": "Rhythm Biosciences Limited engages in developing and commercializing medical diagnostics technology in Australia and internationally. It is developing ColoSTAT, a blood test for the early detection of colorectal cancer. The company was incorporated in 2017 and is headquartered in Parkville, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Diagnostics & Research", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Parkville"}, "RJV.F": {"short_name": "SOMNOMED LTD.", "long_name": "SomnoMed Limited", "summary": "SomnoMed Limited, together with its subsidiaries, produces and sells devices for the oral treatment of sleep related disorders in Europe, North America, and the Asia Pacific Region. Its products include SomnoDent, an oral appliance for obstructive sleep apnea; and SomnoBrux, a mouthguard for the treatment of teeth grinding damage, as well as SomTabs for cleaning its devices. The company was founded in 2004 and is based in Crows Nest, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Crows Nest"}, "RMSYF": {"short_name": "RAMSAY HEALTH CARE", "long_name": "Ramsay Health Care Limited", "summary": "Ramsay Health Care Limited provides health care services to public and private patients. The company's health care services comprise day surgery procedures and other surgeries, as well as psychiatric care and rehabilitation services. It operates through approximately 500 locations across Australia, the United Kingdom, France, Sweden, Norway, Denmark, Germany, Indonesia, Malaysia, Hong Kong, and Italy. The company was founded in 1964 and is based in Sydney, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Sydney"}, "RMY.F": {"short_name": "RAMSAY HEALTH", "long_name": "Ramsay Health Care Limited", "summary": "Ramsay Health Care Limited provides health care services to public and private patients. The company's health care services comprise day surgery procedures and other surgeries, as well as psychiatric care and rehabilitation services. It operates through approximately 500 locations across Australia, the United Kingdom, France, Sweden, Norway, Denmark, Germany, Indonesia, Malaysia, Hong Kong, and Italy. The company was founded in 1964 and is based in Sydney, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Sydney"}, "RMYHY": {"short_name": "RAMSAY HEALTH CARE", "long_name": "Ramsay Health Care Limited", "summary": "Ramsay Health Care Limited provides health care services to public and private patients. The company's health care services comprise day surgery procedures and other surgeries, as well as psychiatric care and rehabilitation services. It operates through approximately 500 locations across Australia, the United Kingdom, France, Sweden, Norway, Denmark, Germany, Indonesia, Malaysia, Hong Kong, and Italy. The company was founded in 1964 and is based in Sydney, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Sydney"}, "RNO.AX": {"short_name": "RHINOMED FPO", "long_name": "Rhinomed Limited", "summary": "Rhinomed Limited engages in the research, development, and commercialization of consumer and medical devices worldwide. It identifies, acquires, and commercializes nasal stent delivery technologies. The company's product portfolio includes Turbine for enhanced breathing in sports; Mute, an anti-snoring device; and Pronto for nasal congestion and sleep disturbance issues. It also engages in developing applications for the delivery of medical cannabis and conditions, including anxiety, pain, allergies, nausea, anxiety, and coughs and colds; and nasal swab to test the presence of upper respiratory tract diseases, including influenza, and coronavirus strains. The company was formerly known as Consegna Group Limited and changed its name to Rhinomed Limited in November 2013. Rhinomed Limited was incorporated in 2004 and is based in Richmond, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Richmond"}, "RPNRF": {"short_name": "RAPID NUTRITION PLC", "long_name": "Rapid Nutrition PLC", "summary": "Rapid Nutrition PLC, a natural healthcare company, researches, develops, and produces a range of life science products. The company offers meal replacement shakes, energy boosting tablets, weight loss tablets, and appetite suppressant powders under the Leisa's Secret brand; and high protein shakes, high fiber bars, organic multivitamins, fat burning shots, and grain granola cereals under the SystemLS brand. It primarily exports its products in Asia, Europe, Africa, the Middle East, North America, and Australia. The company was incorporated in 2001 and is based in Meadowbrook, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Meadowbrook"}, "RSH.AX": {"short_name": "RESPIRI FPO", "long_name": "Respiri Limited", "summary": "Respiri Limited, an e-health SaaS company, researches, develops, and commercializes, medical devices in Australia and Israel. The company produces and sells mobile health applications. Its products include Wheezo, a mobile app, which has asthma management diary, medication usage and reminders, and symptoms and triggers to help asthma sufferers; and Wholter, a device for home ambulatory recording of nocturnal wheeze and cough. The company also offers PulmoTrack, a computerized wheeze detection product designed for hospital/clinical based real-time monitoring of wheeze and cough in the management of acute asthma in the ER and ICU, and for pediatric pulmonary function testing and sleep labs. The company was formerly known as iSonea Limited and changed its name to Respiri Limited in December 2015. Respiri Limited is based in Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Melbourne"}, "SAB.F": {"short_name": "SONIC HEALTHCARE", "long_name": "Sonic Healthcare Limited", "summary": "Sonic Healthcare Limited, a healthcare company, provides medical diagnostic services, and administrative services and facilities to medical practitioners. The company operates through Laboratory, Imaging, and Other segments. It offers laboratory medicine/pathology and radiology/diagnostic imaging services to clinicians, hospitals, community health services, and their patients. The company also provides general practice, occupational health services, remote health services, community and home nursing services, primary care research programs, health assessment technologies, hospital avoidance programs, and clinical trials and chronic disease management programs. In addition, it offers Phase I-IV clinical trials, safety testing, and patient monitoring services to the pharmaceutical, biotechnology, and research organizations. The company operates 233 primary care clinics. Sonic Healthcare Limited operates in Australia, the United States, Germany, and internationally. The company was formerly known as Sonic Technology Australia Limited and changed its name to Sonic Healthcare Limited in November 1995. Sonic Healthcare Limited was incorporated in 1934 and is headquartered in Sydney, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Sydney"}, "SCU.AX": {"short_name": "STEMCELL FPO", "long_name": "Stemcell United Limited", "summary": "Stemcell United Limited, together with its subsidiaries, engages in the sourcing, producing, marketing, and selling of traditional medicine in Australia, Singapore, Greater China, and Malaysia. The company's products include Cannabis Sativa, an industrial hemp; Dendrobium Officinale Kimura et Migo, an orchid extract; Resina, a Daemonorops Draco Blume extract; and Caulerpa Lentillifera, a sea grape extract. The company has a collaboration agreement with Temasek Polytechnic of Singapore to conduct joint research on the application of plant stem cell technology to the cultivation and commercial farming of seagrapes in Singapore. The company was formerly known as On Q Group Limited and changed its name to Stemcell United Limited in September 2015. Stemcell United Limited was incorporated in 1984 and is headquartered in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "SHL.AX": {"short_name": "SONIC HLTH FPO", "long_name": "Sonic Healthcare Limited", "summary": "Sonic Healthcare Limited, a healthcare company, provides medical diagnostic services, and administrative services and facilities to medical practitioners. The company operates through Laboratory, Imaging, and Other segments. It offers laboratory medicine/pathology and radiology/diagnostic imaging services to clinicians, hospitals, community health services, and their patients. The company also provides general practice, occupational health services, remote health services, community and home nursing services, primary care research programs, health assessment technologies, hospital avoidance programs, and clinical trials and chronic disease management programs. In addition, it offers Phase I-IV clinical trials, safety testing, and patient monitoring services to the pharmaceutical, biotechnology, and research organizations. The company operates 233 primary care clinics. Sonic Healthcare Limited operates in Australia, the United States, Germany, and internationally. The company was formerly known as Sonic Technology Australia Limited and changed its name to Sonic Healthcare Limited in November 1995. Sonic Healthcare Limited was incorporated in 1934 and is headquartered in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "SIG.AX": {"short_name": "SIGMAHEALT FPO", "long_name": "Sigma Healthcare Limited", "summary": "Sigma Healthcare Limited, together with its subsidiaries, engages in the wholesale and distribution of pharmaceutical products primarily in Australia. It operates approximately 1,200 branded and independent stores under the Amcal+, Chemist King, Discount Drug Stores, Guardian, and PharmaSave brands. The company also offers private label products, such as skincare, pain relief, vitamins, baby products, and non-contact thermometers under the Pharmacy Care brand; cosmetics under the Colour Theory brand; beauty essentials and hair accessories under the Beauty Theory brand; skincare products under the and Boots Laboratories brand. In addition, it provides hospital pharmacy services, including data and programs supporting specialty medication services; dose administration aid and related services to the residential aged care and community pharmacy sectors; technology solutions and data analytics; and product development and support services for a range of private and exclusive label products, as well as supplies medical consumables and devices to aged care, hospitals, and clinics. The company was formerly known as Sigma Pharmaceuticals Limited and changed its name to Sigma Healthcare Limited in May 2017. Sigma Healthcare Limited was founded in 1912 and is headquartered in Rowville, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Distribution", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Rowville"}, "SKHCF": {"short_name": "SONIC HEALTHCARE", "long_name": "Sonic Healthcare Limited", "summary": "Sonic Healthcare Limited, a healthcare company, provides medical diagnostic services, and administrative services and facilities to medical practitioners. The company operates through Laboratory, Imaging, and Other segments. It offers laboratory medicine/pathology and radiology/diagnostic imaging services to clinicians, hospitals, community health services, and their patients. The company also provides general practice, occupational health services, remote health services, community and home nursing services, primary care research programs, health assessment technologies, hospital avoidance programs, and clinical trials and chronic disease management programs. In addition, it offers Phase I-IV clinical trials, safety testing, and patient monitoring services to the pharmaceutical, biotechnology, and research organizations. The company operates 233 primary care clinics. Sonic Healthcare Limited operates in Australia, the United States, Germany, and internationally. The company was formerly known as Sonic Technology Australia Limited and changed its name to Sonic Healthcare Limited in November 1995. Sonic Healthcare Limited was incorporated in 1934 and is headquartered in Sydney, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Sydney"}, "SKHHY": {"short_name": "SONIC HEALTHCARE", "long_name": "Sonic Healthcare Limited", "summary": "Sonic Healthcare Limited, a healthcare company, provides medical diagnostic services, and administrative services and facilities to medical practitioners. The company operates through Laboratory, Imaging, and Other segments. It offers laboratory medicine/pathology and radiology/diagnostic imaging services to clinicians, hospitals, community health services, and their patients. The company also provides general practice, occupational health services, remote health services, community and home nursing services, primary care research programs, health assessment technologies, hospital avoidance programs, and clinical trials and chronic disease management programs. In addition, it offers Phase I-IV clinical trials, safety testing, and patient monitoring services to the pharmaceutical, biotechnology, and research organizations. The company operates 233 primary care clinics. Sonic Healthcare Limited operates in Australia, the United States, Germany, and internationally. The company was formerly known as Sonic Technology Australia Limited and changed its name to Sonic Healthcare Limited in November 1995. Sonic Healthcare Limited was incorporated in 1934 and is headquartered in Sydney, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Sydney"}, "SLA.AX": {"short_name": "SILK LASER FPO", "long_name": "SILK Laser Australia Limited", "summary": "SILK Laser Australia Limited operates a network of specialist clinics for a range of non-surgical aesthetic products and services in Australia. Its products and services include laser hair removal, cosmetic injectable, skin treatment, body contouring, and fat reduction services, as well as owned brand skincare products. The company operates 53 clinics throughout metropolitan and regional Australia, including 37 company owned or joint venture owned clinics, and 16 franchised clinics. SILK Laser Australia Limited was founded in 2009 and is based in Parkside, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Parkside"}, "SOM.AX": {"short_name": "SOMNOMED FPO", "long_name": "SomnoMed Limited", "summary": "SomnoMed Limited, together with its subsidiaries, produces and sells devices for the oral treatment of sleep related disorders in Europe, North America, and the Asia Pacific Region. Its products include SomnoDent, an oral appliance for obstructive sleep apnea; and SomnoBrux, a mouthguard for the treatment of teeth grinding damage, as well as SomTabs for cleaning its devices. The company was founded in 2004 and is based in Crows Nest, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Crows Nest"}, "SOMNF": {"short_name": "SOMNOMED LIMITED", "long_name": "SomnoMed Limited", "summary": "SomnoMed Limited, together with its subsidiaries, produces and sells devices for the oral treatment of sleep related disorders in Europe, North America, and the Asia Pacific Region. Its products include SomnoDent, an oral appliance for obstructive sleep apnea; and SomnoBrux, a mouthguard for the treatment of teeth grinding damage, as well as SomTabs for cleaning its devices. The company was founded in 2004 and is based in Crows Nest, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Crows Nest"}, "SPHRF": {"short_name": "STARPHARMA HOLDINGS LIMITED", "long_name": "Starpharma Holdings Limited", "summary": "Starpharma Holdings Limited engages in the research, development, and commercialization of dendrimer products for pharmaceutical, life-science, and other applications worldwide. The company offers VivaGel, a non-antibiotic therapy for the management and prevention of bacterial vaginosis. It also develops VivaGel condom, an antiviral condom; and DEP, a dendrimer drug delivery technology, including DEP docetaxel that is in Phase II clinical trials, DEP cabazitaxel that is in Phase 1 clinical trial, and DEP irinotecan that is in phase 1/2 clinical trials for the treatment of solid tumors. The company was founded in 1996 and is headquartered in Abbotsford, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Abbotsford"}, "SPHRY": {"short_name": "STARPHARMA HOLDINGS LIMITED", "long_name": "Starpharma Holdings Limited", "summary": "Starpharma Holdings Limited engages in the research, development, and commercialization of dendrimer products for pharmaceutical, life-science, and other applications worldwide. The company offers VivaGel, a non-antibiotic therapy for the management and prevention of bacterial vaginosis. It also develops VivaGel condom, an antiviral condom; and DEP, a dendrimer drug delivery technology, including DEP docetaxel that is in Phase II clinical trials, DEP cabazitaxel that is in Phase 1 clinical trial, and DEP irinotecan that is in phase 1/2 clinical trials for the treatment of solid tumors. The company was founded in 1996 and is headquartered in Abbotsford, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Abbotsford"}, "SPL.AX": {"short_name": "STARPHARMA FPO", "long_name": "Starpharma Holdings Limited", "summary": "Starpharma Holdings Limited engages in the research, development, and commercialization of dendrimer products for pharmaceutical, life-science, and other applications worldwide. The company offers VivaGel, a non-antibiotic therapy for the management and prevention of bacterial vaginosis. It also develops VivaGel condom, an antiviral condom; and DEP, a dendrimer drug delivery technology, including DEP docetaxel that is in Phase II clinical trials, DEP cabazitaxel that is in Phase 1 clinical trial, and DEP irinotecan that is in phase 1/2 clinical trials for the treatment of solid tumors. The company was founded in 1996 and is headquartered in Abbotsford, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Abbotsford"}, "SUD.AX": {"short_name": "SUDA FPO", "long_name": "Suda Pharmaceuticals Ltd", "summary": "Suda Pharmaceuticals Ltd engages in the development of drug delivery technology in Australia, India, Europe and Korea. It offers ZolpiMist, an oro-mucosal spray formulation of zolpidem tartrate marketed under the brand name of Ambien or Stilnox, a non-benzodiazepine prescribed for the short-term treatment of insomnia. The company's product pipeline includes Sumatriptan, an oral spray formulation for the treatment of acute migraine; and anagrelide, a platelet lowering agent for use in thrombosis, which is used for the treatment of cancer. Suda Pharmaceuticals Ltd has license and supply agreement with Teva Pharmaceuticals International GmbH and Mitsubishi Tanabe Pharma Singapore for ZolpiMist oral spray; product development, licence, and supply agreement with Cann Pharmaceutical Australia Ltd for the development of novel oral spray of pharmaceutical-grade cannabinoid derivatives for the treatment of drug resistant epilepsy, melanoma, and motion sickness; and feasibility and option agreement with Zelira Therapeutics for the use of cannabinoids for a range of uses, including insomnia, autism, opioid reduction, anxiety, pain, and cancer. The company also has a feasibility study and option agreement with Laboratorios Ordesa, S.L. The company was formerly known as Suda Limited and changed its name to Suda Pharmaceuticals Ltd in November 2017. Suda Pharmaceuticals Ltd was incorporated in 1999 and is headquartered in Osborne Park, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Osborne Park"}, "SVA.AX": {"short_name": "SIMAVITA CDI 1:1", "long_name": "Simavita Limited", "summary": "Simavita Limited develops smart wearable and disposable sensors for the diaper industry primarily in Australia, North America, and Europe. It offers Smartz, a platform technology linked to phones and tablets that provides indicators, including wetness, ambient temperature, pressure sore management, falls, and other features and information for incontinence pad or diaper to parents and carers of infants and adults. The company was incorporated in 1968 and is headquartered in North Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "North Sydney"}, "TD1.AX": {"short_name": "TALI DIGI FPO", "long_name": "TALi Digital Limited", "summary": "TALi Digital Limited engages in the research, development, and commercialization of medical technology in Australia. The company operates through Research and Development; and Investments segments. It offers TALi Train, a mobile software application used by clinicians, educators, and parents for strengthening of core attention in children between the development ages of 3-8; TALi Portal that allows healthcare professionals, educators, and parents to assess a child's daily performance and identify strengths and weaknesses to tailor the program to child's needs; and TALi Detect, which consists of seven tests to profile cognitive attention capabilities of a child. The company was formerly known as Novita Healthcare Limited and changed its name to TALI Digital Limited in December 2019. TALi Digital Limited was incorporated in 2004 and is based in Cremorne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Cremorne"}, "TDLAF": {"short_name": "TBG DIAGNOSTICS LTD", "long_name": "TBG Diagnostics Limited", "summary": "TBG Diagnostics Limited, a molecular diagnostics company, develops, manufactures, and markets molecular diagnostics kits, instruments, and services in Taiwan and China. It provides ExProbe HLA and HPA kits for human leukocyte antigen (HLA) and human platelet antigens (HPA) allele genotyping, which uses real time polymerase chain reaction (PCR) techniques with sequence specific primers and probes; Morgan SSP HLA kits for determining HLA alleles using PCR techniques with sequence specific primers; HLAssure SBT HLA Kits for transplantation donor selection; and AccuType SBT analysis software to analyze sequences from all ab1 based files. The company also offers Morgan SSPal HLA Typing Analysis Software, a gel result interpretation software; HLA typing services that offer low to high resolution using PCR fragment analysis (SSP) and DNA sequencing (SBT); QPCR Q6000, a six-channel real time PCR instrument; QzNGS NGS that provides high resolution HLA genotyping; and COVID-19 testing kits. It serves clinical labs, blood centers, and bone marrow registry labs. The company was formerly known as Progen Pharmaceuticals Limited and changed its name to TBG Diagnostics Limited in December 2015. TBG Diagnostics Limited was incorporated in 1989 is based in Greenslopes, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Diagnostics & Research", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Greenslopes"}, "TLX.AX": {"short_name": "TELIXPHARM FPO", "long_name": "Telix Pharmaceuticals Limited", "summary": "Telix Pharmaceuticals Limited, an oncology company, develops molecularly targeted radiation products for unmet needs in cancer care in Australia, Belgium, Japan, and the United States. The company focuses on developing diagnostic and therapeutic products using molecularly targeted radiation (MTR). Its lead products include TLX250, which is in Phase II clinical trials for the diagnosis and treatment of renal (kidney) cancer; TLX250-CDx that is in Phase III clinical trials for the diagnosis and treatment of renal (kidney) cancer; TLX591, which is in pre-Phase 3 development for the diagnosis and treatment of metastatic castrate-resistant prostate cancer; TLX591-CDx that is in Phase III clinical trials for the diagnosis and treatment of metastatic castrate-resistant prostate cancer; and TLX101, which is in Phase I/II clinical trial for the treatment of glioblastoma (brain cancer). The company has a development collaboration agreement with ARTMS Products Inc. for the manufacture of its prostate cancer imaging product TLX591-CDx (68Ga-PSMA-11 injection) for the imaging of prostate cancer with Positron Emission Tomography (PET). Telix Pharmaceuticals Limited has a strategic collaboration with RefleXion Medical for the treatment of high-risk cancers; a strategic license and commercial partnership with China Grand Pharmaceutical and Healthcare Holdings Limited for developing a portfolio of MTR products; and scientific and clinical research collaboration with Mauna Kea Technologies. The company was founded in 2015 and is headquartered in North Melbourne, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "North Melbourne"}, "TTB.AX": {"short_name": "TOTALBRAIN FPO", "long_name": "Total Brain Limited", "summary": "Total Brain Limited, together with its subsidiaries, develops and sells brain health products in the United States. It offers Total Brain, a neuroscience-based mental health and brain performance app. Total Brain Limited has a partnership with the Center for Adolescent Research and Education to address growing youth mental health crisis. The company was formerly known as Brain Resource Limited and changed its name to Total Brain Limited in December 2018. Total Brain Limited was founded in 2000 and is based in Surry Hills, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Surry Hills"}, "TTBLF": {"short_name": "TOTAL BRAIN LTD", "long_name": "Total Brain Limited", "summary": "Total Brain Limited, together with its subsidiaries, develops and sells brain health products in the United States. It offers Total Brain, a neuroscience-based mental health and brain performance app. Total Brain Limited has a partnership with the Center for Adolescent Research and Education to address growing youth mental health crisis. The company was formerly known as Brain Resource Limited and changed its name to Total Brain Limited in December 2018. Total Brain Limited was founded in 2000 and is based in Surry Hills, Australia.", "currency": "USD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "PNK", "market": "us_market", "country": "Australia", "city": "Surry Hills"}, "UBI.AX": {"short_name": "UNI BIOSEN CDI 1:1", "long_name": "Universal Biosensors, Inc.", "summary": "Universal Biosensors, Inc., through its subsidiary, Universal Biosensors Pty Ltd, designs and develops electrochemical cells in Australia. The company focuses on the research, development, and manufacture of medical or testing devices. It uses electrochemical cell technology platform to develop point of use devices for various industries, including healthcare, food and drink, and agriculture. The company offers prothrombin time international normalized ratio coagulation test strips; and coagulation testing and calibration services, as well as distributes Siemens' Xprecia Stride Coagulation Analyzer. It also owns, operates, and manages a hemostasis laboratory. The company was founded in 2001 and is based in Rowville, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Rowville"}, "UCM.AX": {"short_name": "USCOM FPO", "long_name": "Uscom Limited", "summary": "Uscom Limited designs, develops, manufactures, and markets non-invasive cardiovascular and pulmonary medical devices worldwide. It offers USCOM 1A, a non-invasive hemodynamic monitor that measures cardiovascular function using Doppler ultrasound; BP+, a supra-systolic oscillometric central blood pressure monitor that measures blood pressure and blood pressure waveforms at the heart, as well as in the arm; and SpiroSonic, a pulmonary function testing device based on multi-path ultrasound technology. The company provides Ventitest, a ventilator testing device; Ventitest sensor to test lung function; and The SpiroSonic AIR, a digital home care spirometer which feeds digital lung function signals through a phone app. It serves hospitals and other medical care locations through a network of distribution partners. The company was incorporated in 1999 and is headquartered in Sydney, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Devices", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Sydney"}, "UKJ.F": {"short_name": "OPTHEA LTD", "long_name": "Opthea Limited", "summary": "Opthea Limited, a biotechnology company, develops and commercializes therapies primarily for eye disease in Australia. The company's development activities are based on the intellectual property portfolio covering Vascular Endothelial Growth Factors (VEGF) VEGF-C, VEGF-D, and VEGF Receptor-3 for the treatment of diseases associated with blood and lymphatic vessel growth, as well as vascular leakage. Its lead molecule is OPT-302, a soluble form of VEGFR-3 for the treatment of wet age-related macular degeneration and diabetic macular edema. The company was formerly known as Circadian Technologies Limited and changed its name to Opthea Limited in December 2015. Opthea Limited was incorporated in 1984 and is based in South Yarra, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "South Yarra"}, "UKJ2.F": {"short_name": "OPTHEA LTD (SP.ADR/8)", "long_name": "Opthea Limited", "summary": "Opthea Limited, a biotechnology company, develops and commercializes therapies primarily for eye disease in Australia. The company's development activities are based on the intellectual property portfolio covering Vascular Endothelial Growth Factors (VEGF) VEGF-C, VEGF-D, and VEGF Receptor-3 for the treatment of diseases associated with blood and lymphatic vessel growth, as well as vascular leakage. Its lead molecule is OPT-302, a soluble form of VEGFR-3 for the treatment of wet age-related macular degeneration and diabetic macular edema. The company was formerly known as Circadian Technologies Limited and changed its name to Opthea Limited in December 2015. Opthea Limited was incorporated in 1984 and is based in South Yarra, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "South Yarra"}, "UR9.F": {"short_name": "CLINUVEL PHARMACEUTICALS", "long_name": "Clinuvel Pharmaceuticals Limited", "summary": "Clinuvel Pharmaceuticals Limited, a biopharmaceutical company, focuses on developing and delivering drugs for the treatment of patients with severe genetic and skin disorders worldwide. Its lead drug candidate is SCENESSE, a photoprotective drug for the prevention of phototoxicity in adult patients with erythropoietic protoporphyria (EPP). The company's pipeline products include CUV9900, an alpha-melanocyte stimulating hormone analogue; Parvysmelanotide (VLRX001), an addition to the family of melanocortin analogues, which provoke increased and prolonged cellular activity; and PRÃ\u0089NUMBRA, a liquid injectable formulation of afamelanotide. Clinuvel Pharmaceuticals Limited has a collaboration agreement with HK Winhealth Pharma Group Co. Limited for launching SCENESSE under a named patient program for the treatment of patients with EPP in the People's Republic of China. The company was founded in 1987 and is headquartered in Melbourne, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Melbourne"}, "UR9A.F": {"short_name": "CLINUVEL PHARMAC.ADRS1", "long_name": "Clinuvel Pharmaceuticals Limited", "summary": "Clinuvel Pharmaceuticals Limited, a biopharmaceutical company, focuses on developing and delivering drugs for the treatment of patients with severe genetic and skin disorders worldwide. Its lead drug candidate is SCENESSE, a photoprotective drug for the prevention of phototoxicity in adult patients with erythropoietic protoporphyria (EPP). The company's pipeline products include CUV9900, an alpha-melanocyte stimulating hormone analogue; Parvysmelanotide (VLRX001), an addition to the family of melanocortin analogues, which provoke increased and prolonged cellular activity; and PRÃ\u0089NUMBRA, a liquid injectable formulation of afamelanotide. Clinuvel Pharmaceuticals Limited has a collaboration agreement with HK Winhealth Pharma Group Co. Limited for launching SCENESSE under a named patient program for the treatment of patients with EPP in the People's Republic of China. The company was founded in 1987 and is headquartered in Melbourne, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Melbourne"}, "USZ.F": {"short_name": "STEMCELL UNITED LTD", "long_name": "Stemcell United Limited", "summary": "Stemcell United Limited, together with its subsidiaries, engages in the sourcing, producing, marketing, and selling of traditional medicine in Australia, Singapore, Greater China, and Malaysia. The company's products include Cannabis Sativa, an industrial hemp; Dendrobium Officinale Kimura et Migo, an orchid extract; Resina, a Daemonorops Draco Blume extract; and Caulerpa Lentillifera, a sea grape extract. The company has a collaboration agreement with Temasek Polytechnic of Singapore to conduct joint research on the application of plant stem cell technology to the cultivation and commercial farming of seagrapes in Singapore. The company was formerly known as On Q Group Limited and changed its name to Stemcell United Limited in September 2015. Stemcell United Limited was incorporated in 1984 and is headquartered in Sydney, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Sydney"}, "UUD.F": {"short_name": "PHARMAXIS LTD.", "long_name": "Pharmaxis Ltd", "summary": "Pharmaxis Ltd engages in the research, development, and commercialization of healthcare products for the treatment of fibrotic and inflammatory diseases worldwide. The company operates through two segments, Mannitol business, and New Drug Development. It offers Bronchitol, an inhaled dry powder for the treatment of cystic fibrosis; and Aridol, an airways inflammation test that is used to identify twitchy or hyper-responsive airways, as well as to assist in diagnosing and managing asthma. The company's product pipeline consists of amine oxidase inhibitors comprising semicarbazide-sensitive amine oxidase for diabetic retinopathy; selective lysyl oxidase like inhibitors targeting chronic fibrotic diseases, such as NASH, pulmonary fibrosis, kidney fibrosis, and cardiac fibrosis; and pan-lysyl oxidase inhibitors targeting severe fibrotic indications, which includes cancers and scarring. It is also developing Orbital, a dry powder inhaler to deliver high drug doses to lungs. Pharmaxis Ltd was founded in 1998 and is headquartered in Frenchs Forest, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Drug Manufacturers—General", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Frenchs Forest"}, "UVP.F": {"short_name": "AUSCANN GROUP HLDGS O.N.", "long_name": "AusCann Group Holdings Ltd", "summary": "AusCann Group Holdings Ltd, a pharmaceutical company, researches, develops, cultivates, produces, and distributes cannabinoid-based pharmaceuticals in Australia and internationally. It offers hard-shell capsules using Neuvis technology for the treatment of chronic neuropathic pain. The company is based in West Perth, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "West Perth"}, "VBS.AX": {"short_name": "VECTUS BIO FPO", "long_name": "Vectus Biosystems Limited", "summary": "Vectus Biosystems Limited engages in the medical research and development activities in Australia. The company develops treatment for fibrosis and high blood pressure. Its lead compound is VB0004, which has potent anti-hypertensive properties, as well as anti-fibrotic activity in the heart and kidneys. The company also intends to develop candidates for the treatment of fibrotic liver diseases, including non-alcoholic steatohepatitis and pulmonary fibrotic diseases. In addition, it develops AccuCal and RealCount software that improves speed and accuracy of measuring the amount of DNA and RNA in samples tested in laboratories. The company was founded in 2005 and is based in Rosebery, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Rosebery"}, "VLS.AX": {"short_name": "VLSCIENCE FPO", "long_name": "Vita Life Sciences Limited", "summary": "Vita Life Sciences Limited, a pharmaceutical and healthcare company, engages in formulation, packaging, sale, and distribution of vitamins and supplements. It offers a range of supplements, vitamins, minerals, herbs, and superfoods. The company markets its products through pharmacies and health food stores under the VitaHealth, Herbs of Gold, VitaScience, and VitaLife brand names. It operates in Australia, Singapore, Malaysia, Thailand, Vietnam, Indonesia, Hong Kong, and China. Vita Life Sciences Limited was founded in 1947 and is headquartered in Kirrawee, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Drug Manufacturers—Specialty & Generic", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Kirrawee"}, "WFL.AX": {"short_name": "WELLFULLYL FPO", "long_name": "Wellfully Limited", "summary": "Wellfully Limited develops dermaportation and enhanced transdermal polymer technologies for use in the pharmaceutical, cosmetic and skincare, and consumer healthcare sectors in Australia. The company provides partnering services and product solutions for technologies in transdermal and intra-dermal drug delivery; therapeutic and dermatological skincare; cosmetic and non-medicinal active ingredient; oral health; haircare solutions utilizing enhanced brushes and applicators; high penetration surface hygiene technologies; fabric and carpet cleaning technologies; and industrial surface interface systems. It offers various technology platforms, such as Static Micro-arrays, a film based micro-array technology for patches, masks, dressings, and other topical applications; and Field in Motion Micro-arrays, a magnetic micro-array film for use in brushes, applicators, and wipes; Dermaportation, a product development platform for a range of commercial applications; eSkin, a multi-product delivery system that offers a range of product-specific, time-varying magnetic fields for enhanced delivery of multiple formulations; and measured dose delivery devices and packaging solutions. The company was formerly known as OBJ Limited and changed its name to Wellfully Limited in September 2020. Wellfully Limited was founded in 2004 and is based in Leederville, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Diagnostics & Research", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Leederville"}, "WNB.AX": {"short_name": "WELLNESS FPO", "long_name": "Wellness and Beauty Solutions Limited", "summary": "Wellness and Beauty Solutions Limited provides non-invasive and non-surgical cosmetic treatments in Australia. It operates through Clinical and Beauty Treatments and Sale of Wellness and Lifestyle Products segments. The Clinical and Beauty Treatments segment offers clinical, skin, and wellness services through a network of beauty and wellness clinics. The Sale of Wellness and Lifestyle Products segment develops, manufactures, and sells various beauty products. The company also offers hand sanitizers under the MICRO19 name. It sells its products to professionals and retail markets. The company was formerly known as Total Face Group Limited and changed its name to Wellness and Beauty Solutions Limited in November 2018. Wellness and Beauty Solutions Limited was incorporated in 2014 and is based in Cheltenham, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Medical Care Facilities", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Cheltenham"}, "XPE.AX": {"short_name": "XPED LIMTD FPO", "long_name": "Xped Limited", "summary": "Xped Limited provides technology and solutions based on IoT infrastructure for smart home, professional health and smart building. The company operates Auto Discovery Remote Control, a technology platform that allows users to control and monitor various electronic devices through their smartphones. It also offers Xped, a device browser application that allows to interact with many devices irrespective of type, brand, and standard. In addition, the company provides accessories, cameras, controllers, gateways, hubs, infrared, kits, lighting, plugs, power, relays, security, safety, sensors, switches, and sound products. It serves manufacturers, retailers, service providers, and consumers. The company is based in Payneham, Australia.", "currency": "AUD", "sector": "Healthcare", "industry": "Health Information Services", "exchange": "ASX", "market": "au_market", "country": "Australia", "city": "Payneham"}, "YP1A.F": {"short_name": "IMMUTEP LTD ADRS II/10", "long_name": "Immutep Limited", "summary": "Immutep Limited, a biotech company, engages in the research and development of pharmaceutical product candidates. The company develops immunotherapeutic products for the treatment of cancer and autoimmune diseases. Its principal product candidate is IMP321, also known as Â\u0091eftilagimod alpha' or Â\u0091efti', which is a recombinant protein that is in Phase IIb clinical trial as a chemoimmunotherapy combination for metastatic breast cancer termed AIPAC and in a Phase I combination therapy trial in metastatic melanoma termed TACTI-mel; and is being evaluated as a combination therapy in head and neck squamous cell carcinoma and non-small cell lung carcinoma in a Phase II clinical trial called TACTI-002 and an investigator initiated Phase I trial called INSIGHT in advanced solid tumors. Its other products include IMP761, IMP701 and IMP731, all of which are related to lymphocyte activation gene 3, a gene linked to the regulation of T cells in immune responses. Immutep Limited has partnerships with GlaxoSmithKline, Novartis, CYTLIMIC Inc., INSIGHT, and EOC Pharma. The company was formerly known as Prima BioMed Ltd and changed its name to Immutep Limited in November 2017. Immutep Limited was incorporated in 1987 and is based in Sydney, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Sydney"}, "YP1B.F": {"short_name": "IMMUTEP LTD", "long_name": "Immutep Limited", "summary": "Immutep Limited, a biotech company, engages in the research and development of pharmaceutical product candidates. The company develops immunotherapeutic products for the treatment of cancer and autoimmune diseases. Its principal product candidate is IMP321, also known as Â\u0091eftilagimod alpha' or Â\u0091efti', which is a recombinant protein that is in Phase IIb clinical trial as a chemoimmunotherapy combination for metastatic breast cancer termed AIPAC and in a Phase I combination therapy trial in metastatic melanoma termed TACTI-mel; and is being evaluated as a combination therapy in head and neck squamous cell carcinoma and non-small cell lung carcinoma in a Phase II clinical trial called TACTI-002 and an investigator initiated Phase I trial called INSIGHT in advanced solid tumors. Its other products include IMP761, IMP701 and IMP731, all of which are related to lymphocyte activation gene 3, a gene linked to the regulation of T cells in immune responses. Immutep Limited has partnerships with GlaxoSmithKline, Novartis, CYTLIMIC Inc., INSIGHT, and EOC Pharma. The company was formerly known as Prima BioMed Ltd and changed its name to Immutep Limited in November 2017. Immutep Limited was incorporated in 1987 and is based in Sydney, Australia.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "Australia", "city": "Sydney"}}