{"AMSIY": {"short_name": "ARCELORMITTAL SOUTH AFRICA LIMI", "long_name": "ArcelorMittal South Africa Ltd", "summary": "ArcelorMittal South Africa Ltd, together with its subsidiaries, manufactures and sells long and flat steel products. The company operates through Flat Steel Products, Long Steel Products, and Coke and Chemicals segments. It offers flat steel products, including hot rolled plates, hot and cold rolled coils, galvanized coils, color coils, electrogalvanized coils, and tinplate coils. The company also provides foundry products that include castings, such as air injection tubes, door bodies, fire bars, pallet cars, pallet frames, goose necks, etc. for coke ovens, direct reduction, sinter plant, and blast furnaces, as well as the hot and cold mills. In addition, it offers long steel products comprising fencing profiles, forgings, hexagon bars, hollow bars, mining bars, rails, reinforcing bars/Y bars, rounds and squares, special profiles, structural and heavy structural sections, window sections, and wire rods; and tubular products, which comprise hot rolled seamless line pipes and OCTG, hot rolled boiler tubes, and cold drawn precision products. Further, the company produces and markets commercial grade coking coal, as well as processes and markets by-products. It serves clients in agricultural, armament, automotive, bolt and nut, chains, construction, engineering, furniture and appliance, mining, packaging, piping, renewable energy, roofing and cladding, and tubing industries in South Africa, sub-Saharan Africa, Asia, and internationally. The company was formerly known as Mittal Steel South Africa Limited and changed its name to ArcelorMittal South Africa Ltd in October 2006. The company was founded in 1928 and is headquartered in Vanderbijlpark, South Africa. ArcelorMittal South Africa Ltd is a subsidiary of ArcelorMittal Holdings AG.", "currency": "USD", "sector": "Basic Materials", "industry": "Steel", "exchange": "PNK", "market": "us_market", "country": "South Africa", "city": "Vanderbijlpark"}, "KIO.JO": {"short_name": "Kumba Iron Ore Ltd", "long_name": "Kumba Iron Ore Limited", "summary": "Kumba Iron Ore Limited, together with its subsidiaries, engages in the exploration, extraction, beneficiation, marketing, sale, and shipping of iron ore primarily in South Africa. The company produces iron ore at Sishen and Kolomela mines in the Northern Cape Province. It also operates a port in Saldanha Bay. The company supplies its iron ore to the steel industry; and exports to China, rest of Asia, Europe, the Middle East, North Africa, and Americas. The company was founded in 2006 and is based in Centurion, South Africa. Kumba Iron Ore Limited operates as a subsidiary of Anglo South Africa Capital (Proprietary) Limited.", "currency": "ZAc", "sector": "Basic Materials", "industry": "Steel", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Centurion"}, "KIROY": {"short_name": "KUMBA IRON ORE LTD", "long_name": "Kumba Iron Ore Limited", "summary": "Kumba Iron Ore Limited, together with its subsidiaries, engages in the exploration, extraction, beneficiation, marketing, sale, and shipping of iron ore primarily in South Africa. The company produces iron ore at Sishen and Kolomela mines in the Northern Cape Province. It also operates a port in Saldanha Bay. The company supplies its iron ore to the steel industry; and exports to China, rest of Asia, Europe, the Middle East, North Africa, and Americas. The company was founded in 2006 and is based in Centurion, South Africa. Kumba Iron Ore Limited operates as a subsidiary of Anglo South Africa Capital (Proprietary) Limited.", "currency": "USD", "sector": "Basic Materials", "industry": "Steel", "exchange": "PNK", "market": "us_market", "country": "South Africa", "city": "Centurion"}}