{
    "METN.SW": {
        "short_name": "Metall Zug AG",
        "long_name": "Metall Zug AG",
        "summary": "Metall Zug AG, through its subsidiaries, engages in the wire processing, medical devices, infection control, technologycluster and infrastructure, and other businesses in Switzerland, rest of Europe, the Americas, the Asia Pacific, and internationally. The company's Wire Processing business unit develops, produces, and distributes semiautomatic and fully automatic machines for cutting and stripping, crimping, sealing, twisting, tinning, printing, quality control, and process and test automation for wires and cables. This segment also offers software packages for optimizing machine efficiency and utilization for complex applications and connection of data. Its Medical Devices business unit develops, produces, and distributes diagnosis and surgery products mainly in the fields of ophthalmology and surgical microscopy. Its Infection Control business unit provides cleaning, disinfection, and sterilization solutions that are used in hospitals. This business unit offers diagnostics products, including slit lamps, biometry, perimetry, tonometer, and practice management software for clinics and opticians, as well as practice equipment; and surgical products, such as microscopes, floor and roof stands, and accessories. It's Technologycluster & Infrastructure business unit engages in the management and development of real estate. The company's Others business unit supplies cleaning, disinfection and sterilization systems and solutions primarily for use in the pharmaceutical industry; and professional appliances and integrated solutions, such as dishwasher and cooking technology, cleaning agents, and care systems for the hotel and catering industry, care homes, and hospitals. Metall Zug AG was founded in 1887 and is headquartered in Zug, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Zug"
    }
}