{
    "BCHN.SW": {
        "short_name": "BURCKHARDT N",
        "long_name": "Burckhardt Compression Holding AG",
        "summary": "Burckhardt Compression Holding AG manufactures and sells reciprocating compressors worldwide. The company offers Laby, a labyrinth piston compressor that compresses bone-dry, dirty, abrasive, and other gases; Laby-GI compressor for offshore vessels and installations; Process Gas Compressors API 618 for high-pressure compression of hydrogen, hydrocarbon, and corrosive gasses; Hyper Compressor, a high-pressure reciprocating compressor for low density polyethylene plants; and standard high pressure compressor that compresses air, hydrogen, nitrogen, helium, argon, natural gas, and other non-corrosive gases and gas mixtures. It also provides various compressor components, such as compressor valves, rings and packings, capital parts, labyrinth piston compressor components, and hyper/secondary compressor parts. In addition, the company offers services comprising valve, spare parts logistic, revamp and upgrade, component repair, field, condition monitoring and diagnostic, technical support, and training services. It provides compressor solutions for upstream oil and gas, marine, gas transport and storage, refinery, petrochemical/chemical, and industrial gas sectors. Burckhardt Compression Holding AG was founded in 1844 and is headquartered in Winterthur, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Winterthur",
        "zipcode": "8404",
        "website": "http://www.burckhardtcompression.com",
        "market_cap": "Small Cap"
    },
    "BOBNN.SW": {
        "short_name": "BOBST GRP N",
        "long_name": "Bobst Group SA",
        "summary": "Bobst Group SA supplies equipment and services for printing, coating and laminating, cutting, folding, gluing, and other processes worldwide. It operates through BU Sheet-Fed, BU Web-Fed, and BU Services segments. The company's products comprise vacuum coaters and metalizers, extrusion coating and laminating lines, coating lines, laminating machines, and litho-laminators; flexo post-printing presses, CI flexo presses, inline flexo presses, and rotogravure printing presses; flatbed die cutters, hot foil stampers, and Web-fed converting equipment; and flatbed die-cutting lines, flexo folder gluers, flexo rotary die cutters, and converting lines for printing and converting. Its services include remote services, technical services, spare parts and consumables, tooling services, monitoring apps, and relocation services; maintenance solutions comprising inspection, maintenance, and repair services; machinery enhancement services; process optimization, training, technical coaching, and performance solutions. The company's products are used in packaging, including folding cartons, corrugated boards, and flexible materials, as well as packaging for liquids; commercial print finishing; label manufacturing; sack and bag production; pressure sensitive adhesive tape production; decorative printing; and security, tobacco, and industrial applications. Bobst Group SA was founded in 1890 and is based in Mex, Switzerland. Bobst Group SA is a subsidiary of JBF Finance SA.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Mex",
        "zipcode": "1031",
        "website": "http://www.bobst.com",
        "market_cap": "Small Cap"
    },
    "BUCN.SW": {
        "short_name": "BUCHER N",
        "long_name": "Bucher Industries AG",
        "summary": "Bucher Industries AG develops, manufactures, and sells machinery, vehicles, hydraulic components, and manufacturing equipment for use in harvesting, food producing and packaging, and roads and public spaces cleaning in Asia, Americas, Europe, and internationally. The company operates through five divisions: Kuhn Group, Bucher Municipal, Bucher Hydraulics, Bucher Emhart Glass, and Bucher Specials. The Kuhn Group division manufactures and sells specialized agricultural machinery for tillage, planting and seeding, nutrient management and crop protection, hay and forage harvesting, and livestock bedding and feeding, as well as landscape maintenance. The Bucher Municipal division provides municipal vehicles, such as sweepers and sewer cleaning, winter maintenance, and refuse collection vehicles and equipment, as well as digital services. The Bucher Hydraulics division offers hydraulic systems, such as pumps, motors, valves, cylinders, power units, elevator drives, and control block solutions with integrated electronics. The Bucher Emhart Glass division supplies manufacturing and inspection technologies for the glass container industry, as well as advice and support services. The Bucher Specials division offers machinery and equipment for winemaking; technologies and equipment for processing fruit juice, beer, and instant products; and control systems for automation technology, as well as distributes tractors and specialized agricultural machinery. The company is based in Niederweningen, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Niederweningen",
        "zipcode": "8166",
        "website": "http://www.bucherindustries.com",
        "market_cap": "Mid Cap"
    },
    "CCC.ST": {
        "short_name": "Cavotec SA",
        "long_name": "Cavotec SA",
        "summary": "Cavotec SA, an engineering group, designs, manufactures, and sells automated connection and electrification systems for ports, airports, and industrial applications worldwide. The company operates in two divisions, Ports & Maritime and Airports & Industry. It offers electrification solutions, including motorized and spring driven cable reels, human operator interface systems, radio remote controls, power connectors, slip rings, cable protection, and power connection systems; truck, crane electrification, e-vessel charging, propulsion, and automated mooring systems; and automation and electrification systems for ports, terminals, and marine applications. The company also develops, manufactures, and services integrated gate and remote apron solutions for airports; and develops and manufactures products for industry, such as cranes, energy, processing and transportation, surface and underground mining, and tunneling. In addition, it offers installation, commissioning, training, inspection, and repairs, preventive maintenance, long-term service agreement, and renovation and upgradation services. The company was incorporated in 1974 and is headquartered in Lugano, Switzerland.",
        "currency": "SEK",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "STO",
        "market": "se_market",
        "country": "Switzerland",
        "state": null,
        "city": "Lugano",
        "zipcode": "6900",
        "website": "http://www.cavotec.com",
        "market_cap": "Mid Cap"
    },
    "FTON.SW": {
        "short_name": "FEINTOOL N",
        "long_name": "Feintool International Holding AG",
        "summary": "Feintool International Holding AG, together with its subsidiaries, provides fineblanked, formed steel components, and punched electro sheet metal products in Germany, the United States, Japan, and China. It operates through two segments, System Parts and Fineblanking Technology. The System Parts segment develops, produces, and sells high-precision system components and assemblies using fineblanking and forming technology, as well as electronic sheet stamping; and sells production-specific tools to third-party customers. The Fineblanking Technology segment develops, manufactures, and sells presses, tools, peripheral systems, and various related services. It provides its products for use in automobile industry, such as engine, chassis, transmission, safety systems, peripheral drives, and seat mechanisms applications, as well as for application in mechanical engineering, power generation, electric motors and drives, tools and household, and medical technology. The company was founded in 1959 and is headquartered in Lyss, Switzerland. Feintool International Holding AG is a subsidiary of Artemis Beteiligungen I AG.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Lyss",
        "zipcode": "3250",
        "website": "http://www.feintool.com",
        "market_cap": "Small Cap"
    },
    "INRN.SW": {
        "short_name": "INTERROLL N",
        "long_name": "Interroll Holding AG",
        "summary": "Interroll Holding AG provides products and services for internal logistics worldwide. Its products include rollers, drives, conveyors and sorters, and pallet handling products. The company offers driven conveyor rollers, control systems, and drum motors; conveyors and sorters, including cross-belt sorters, belt curves, modular conveyor platforms, and modular pallet conveyor platforms; and flow storage solutions for pallets and parcel packaging. Its products and services are used in courier, express, and parcel; airport; e-commerce; tire and automotive; fashion; food and beverage; and distribution and warehouse industries, as well as in various other manufacturing industries. The company serves plant manufacturers, original equipment manufacturers, system integrators, and end users. Interroll Holding AG was founded in 1959 and is headquartered in Sant'Antonino, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Sant'Antonino",
        "zipcode": "6592",
        "website": "http://www.interroll.com",
        "market_cap": "Mid Cap"
    },
    "KARN.SW": {
        "short_name": "KARDEX N",
        "long_name": "Kardex Holding AG",
        "summary": "Kardex Holding AG provides intralogistics solutions, and supplies automated storage solutions and materials handling systems worldwide. The company operates through Kardex Remstar and Kardex Mlog segments. The Kardex Remstar segment develops, produces, and maintains dynamic storage and retrieval systems. The Kardex Mlog segment offers integrated material handling systems and automated high bay warehouses. The company also provides conveyor systems, stracker cranes, software solutions, buffering and sequencing solutions, vertical and horizontal systems, pick and place robots, and life cycle services, as well as office solutions. Kardex Holding AG is headquartered in Zurich, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Zurich",
        "zipcode": "8050",
        "website": "http://www.kardex.com",
        "market_cap": "Small Cap"
    },
    "KLIN.SW": {
        "short_name": "KLINGELNBERG N",
        "long_name": "Klingelnberg AG",
        "summary": "Klingelnberg AG engages in the development, manufacture, and sale of machines for the production of bevel and cylindrical gears, and measuring centers for axially symmetrical objects of various types worldwide. The company offers bevel gear cutting machines, bevel gear grinding machines, bevel gear lapping machines, and bevel gear testing machines, as well as related software, tools and fixtures, and tool management products. It also provides cylindrical gear cutting machines, cylindrical gear grinding machines, machining products, and related software; and precision measuring centers, optical metrology products, tool measurement products, roughness measurement products, and deviation analysis and additional application products, as well as dimension, form, and position measurement products. In addition, the company offers high-precision gear components and after sale services. Klingelnberg AG serves automotive, maritime propulsion, rail, mining/materials handling, oil and gas, agriculture, racing transmission, robot, aviation, and wind power industries, as well as crusher gearboxes, commercial vehicles, industrial gear units, and contract manufacturers. The company was founded in 1863 and is headquartered in Zurich, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Zurich",
        "zipcode": "8050",
        "website": "http://www.klingelnberg.com",
        "market_cap": "Small Cap"
    },
    "KMAAF": {
        "short_name": "KOMAX HOLDING AG",
        "long_name": "Komax Holding AG",
        "summary": "Komax Holding AG, together with its subsidiaries, engages in the automated wire processing business. The company offers electrical, rotary, and coaxial wire strippers, as well as rotary jacket strippers; wire crimpers for the semiautomatic machine; cutting and stripping machines; crimp to crimp wire processing machines for processing single conductors and double-crimp connections; wire twisting machines; and harness manufacturing machines for automatic block loading and wire harness manufacturing. It also provides wire-handling machines for preliminary wire processing; marking systems; process modules for economical production; quality tools; software solutions for automatic crimping machines; and a range of accessories. In addition, the company offers stripping crimping, and shield preparation and taping machines; flexible benchtop crimping platform for individual processing; flexible platform for specific customers; automated rotary table for time saving in double-sided processing; customer-specific platforms; and test systems. Further, it provides digital services; consulting and installation services comprising inspection, production analysis, feasibility testing, installation, and acceptance testing services; and technical support and maintenance services, including helpdesk, production and ramp-up support, emergency planning, relocation, repair, and service and maintenance contracting services, as well as spare and wear parts. Additionally, the company offers upgrades and calibration services, as well as online and onsite training services. It serves automotive, aerospace, datacom/telecom, and industrial market segments. The company operates in Switzerland and the rest of Europe, North and South America, Africa, and the Asia Pacific. It offers its products under the Artos, Exmore, Kabatec, Laselec, Thonauer, and TSK brand names. Komax Holding AG was founded in 1975 and is headquartered in Dierikon, Switzerland.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Dierikon",
        "zipcode": "6036",
        "website": "http://www.komaxgroup.com",
        "market_cap": "Small Cap"
    },
    "KOMN.SW": {
        "short_name": "KOMAX N",
        "long_name": "Komax Holding AG",
        "summary": "Komax Holding AG, together with its subsidiaries, engages in the automated wire processing business. The company offers electrical, rotary, and coaxial wire strippers, as well as rotary jacket strippers; wire crimpers for the semiautomatic machine; cutting and stripping machines; crimp to crimp wire processing machines for processing single conductors and double-crimp connections; wire twisting machines; and harness manufacturing machines for automatic block loading and wire harness manufacturing. It also provides wire-handling machines for preliminary wire processing; marking systems; process modules for economical production; quality tools; software solutions for automatic crimping machines; and a range of accessories. In addition, the company offers stripping crimping, and shield preparation and taping machines; flexible benchtop crimping platform for individual processing; flexible platform for specific customers; automated rotary table for time saving in double-sided processing; customer-specific platforms; and test systems. Further, it provides digital services; consulting and installation services comprising inspection, production analysis, feasibility testing, installation, and acceptance testing services; and technical support and maintenance services, including helpdesk, production and ramp-up support, emergency planning, relocation, repair, and service and maintenance contracting services, as well as spare and wear parts. Additionally, the company offers upgrades and calibration services, as well as online and onsite training services. It serves automotive, aerospace, datacom/telecom, and industrial market segments. The company operates in Switzerland and the rest of Europe, North and South America, Africa, and the Asia Pacific. It offers its products under the Artos, Exmore, Kabatec, Laselec, Thonauer, and TSK brand names. Komax Holding AG was founded in 1975 and is headquartered in Dierikon, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Dierikon",
        "zipcode": "6036",
        "website": "http://www.komaxgroup.com",
        "market_cap": "Small Cap"
    },
    "MIKN.SW": {
        "short_name": "MIKRON N",
        "long_name": "Mikron Holding AG",
        "summary": "Mikron Holding AG, together with its subsidiaries, develops, produces, and markets automation and machining systems for precise and productive manufacturing processes worldwide. The company operates in two segments, Mikron Automation and Mikron Machining Solutions. The Mikron Automation segment manufactures scalable and customized assembly systems. Its solutions include automation assembly and testing systems; feeding systems; and spare parts, technical support, improvement, training, and partner support services. This segment serves the pharma/medtech, automotive, electric/electronics, consumer goods, and industrial/building markets. The Mikron Machining Solutions segment supplies machining systems for the manufacture of high-precision components made of metal, such as turbocharger housings, injection nozzles, and ballpoint pen tips. It offers productive systems, writing industry equipment, and pre-machining equipment; and support services. This segment also develops and produces high-performance cutting tools. It serves the automotive, electric/electronics, writing, consumer goods, hydraulic/pneumatic, pharma/medtech, industrial/building, and others markets. The company was founded in 1908 and is based in Biel, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Biel/Bienne",
        "zipcode": "2502",
        "website": "http://www.mikron.com",
        "market_cap": "Small Cap"
    },
    "MTG.SW": {
        "short_name": "MEIER TOBLER N",
        "long_name": "Meier Tobler Group AG",
        "summary": "Meier Tobler Group AG manufactures and sells heating and air conditioning systems worldwide. Its products include heat pumps, gas condensing boilers, exhaust systems, oil condensing boilers, solar systems, burner gas and oil, storage and water heaters, and district heating stations; and chillers, dry coolers, cooling towers, roof air-conditioning units, absorption chillers, precision air cabinets, and comfort air products. The company also provides small room fans, air heaters, and air curtains, as well as comfort ventilation and central vacuum products; and sanitary systems, such as fittings, installation systems, water heaters, fittings and pipe couplings, pumps, hoses and ventilation materials, sewage systems, and apparatus and fittings. In addition, it offers transmission line and heating cables, keller installations, control and measuring technology, heating circulation pumps, installation systems, floor and underfloor convectors, and installation materials, as well as compressor pressure maintenance services; underfloor heating radiators; chilled beams and fan coils; and labels and fixtures, insulation, and occupational safety consumables and tools. Further, Meier Tobler Group AG provides consulting, planning, construction, ventilation, and maintenance services for building services planners, installers, architects, and building owners. The company was formerly known as Walter Meier AG. The company was founded in 1937 and is based in Schwerzenbach, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Schwerzenbach",
        "zipcode": "8603",
        "website": "http://www.meiertobler.ch/de",
        "market_cap": "Small Cap"
    },
    "OERL.SW": {
        "short_name": "OC OERLIKON N",
        "long_name": "OC Oerlikon Corporation AG",
        "summary": "OC Oerlikon Corporation AG provides advanced materials, surface technologies, processing equipment, and services worldwide. The company operates in Surface Solutions and Manmade Fibers segments. The Surface Solutions segment supplies PVD coatings and other surface technologies for precision components, as well as metalworking and plastics processing tools under the Oerlikon Balzers brand; coating solutions, materials, and equipment for enhancing surfaces under the Oerlikon Metco brand; and industrial additive manufacturing solutions under the Oerlikon AM brand. The Manmade Fibers segment offers filament spinning and winding systems; texturing machines; and bulked continuous filament carpet yarn, staple fiber spinning, and nonwovens and polycondensation solutions under the Oerlikon Barmag, Oerlikon Neumag, and Oerlikon Nonwoven bands. It also provides consulting, engineering, life cycle management, and smart plant solutions. The company serves aerospace, automotive, energy, tooling, general industries, additive manufacturing, manmade fibers, and medical markets. OC Oerlikon Corporation AG was founded in 1907 and is headquartered in PfÃ¤ffikon, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "PfÃ¤ffikon",
        "zipcode": "8808",
        "website": "http://www.oerlikon.com",
        "market_cap": "Mid Cap"
    },
    "PEDU.SW": {
        "short_name": "PERROT DUVAL I",
        "long_name": "Perrot Duval Holding S.A.",
        "summary": "Perrot Duval Holding S.A. provides automation technologies in the field of process automation worldwide. The company develops, produces, and sells original technological components and solutions. It supplies automated installations and components for dispensing and safety to simplify processes in manufacturing chemical products, such as paints, printing inks, textiles dyes, food, and cosmetics, as well as pharmaceutical products; and designs, develops, and sells original modular and standard dispensing systems to the manufacturers and users of offset inks. Perrot Duval Holding S.A. is based in Geneva, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Geneva",
        "zipcode": "1205",
        "website": "http://www.perrotduval.com",
        "market_cap": "Small Cap"
    },
    "PM.SW": {
        "short_name": "PHOENIX I",
        "long_name": "Phoenix Mecano AG",
        "summary": "Phoenix Mecano AG, together with its subsidiaries, manufactures and sells components for industrial customers worldwide. The company operates in three divisions: Enclosures, Mechanical Components, and ELCOM/EMS. The Enclosures division develops and manufactures enclosures made of aluminum, stainless steel, plastic, and glass-fiber reinforced polyester; and system solutions for use in mechanical and plant engineering, electrical engineering, automation, measurement and control technology, railway, automotive, and medical technology, as well as for explosive environments in the petrochemical, and onshore and offshore industries. This division also offers machine control boards and suspension systems for protecting electronics in various industrial applications, and membrane keypads and touch systems. The Mechanical Components division provides profile assembly systems, linear units and drives, and pipe connection technology for various applications in the construction of machinery and equipment, protective enclosures, and ergonomic workstations. This division also offers linear actuators, electric cylinders, and lifting columns; and electrically adjustable furniture for the home and hospital care sector. The ELCOM/EMS division provides terminal blocks, connector systems, test probes, series terminals, and switches for industrial electronics; power supply systems, backplanes, and electronic assemblies for application in various fields, including medical technology, measurement technology, astrophysics, and research facilities; transformers, instrument transformers, and inductors for use in renewable energies, drive technology, switchgear, and power distribution networks; and circuit board equipment, as well as develops customized electronic applications. The company was formerly known as Phoenix Maschinentechnik AG and changed its name to Phoenix Mecano AG in 1986. Phoenix Mecano AG was founded in 1975 and is headquartered in Stein am Rhein, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Stein am Rhein",
        "zipcode": "8260",
        "website": "http://www.phoenix-mecano.com",
        "market_cap": "Small Cap"
    },
    "RIEN.SW": {
        "short_name": "RIETER N",
        "long_name": "Rieter Holding AG",
        "summary": "Rieter Holding AG, together with its subsidiaries, supplies systems for short-staple fiber spinning in Switzerland and internationally. The company operates through three segments: Machines & Systems, Components, and After Sales. The Machines & Systems segment develops and manufactures machinery and systems for processing natural and man-made fibers, as well as their blends into yarns. This segment offers blowrooms, carding machines, draw frames, and combing machines for preparation; and ring, compact, rotor, and air jet spinning machines for end spinning. The Components segment supplies technology components to spinning mills and textile machinery manufacturers, as well as precision winding machines. This segment offers its products under the BrÃ¤cker, Graf, Novibra, SSM, and Suessen brands. The After Sales segment develops, produces, and distributes spare parts for the company's machines, such as drives, sensors, or controllers; sells technology components; and provides services that enable its customers to enhance their spinning mills. The company was founded in 1795 and is based in Winterthur, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Winterthur",
        "zipcode": "8406",
        "website": "http://www.rieter.com",
        "market_cap": "Small Cap"
    },
    "SCHN.SW": {
        "short_name": "SCHINDLER N",
        "long_name": "Schindler Holding AG",
        "summary": "Schindler Holding AG engages in the production, installation, maintenance, and modernization of passenger and freight elevators, escalators, and moving walks worldwide. It also offers digital media services for engaging communication channels, such as Schindler Ahead DoorShow, which displays information, advertising, and announcements on the elevator doors; Schindler Ahead SmartMirror, a mirror and a screen for entertainment or information; and Schindler Ahead AdScreen, an advertising and communication space. In addition, the company provides transit management services through its destination control system. It offers its products and services to residential buildings, commercial and office buildings, hotels, healthcare facilities, shopping malls and retail facilities, public transport locations, institutional buildings, and marines, as well as stadiums, arenas, and convention centers. The company was founded in 1874 and is based in Hergiswil, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Hergiswil",
        "zipcode": "6052",
        "website": "http://www.schindler.com",
        "market_cap": "Large Cap"
    },
    "SCHP.SW": {
        "short_name": "SCHINDLER PS",
        "long_name": "Schindler Holding AG",
        "summary": "Schindler Holding AG engages in the production, installation, maintenance, and modernization of passenger and freight elevators, escalators, and moving walks worldwide. It also offers digital media services for engaging communication channels, such as Schindler Ahead DoorShow, which displays information, advertising, and announcements on the elevator doors; Schindler Ahead SmartMirror, a mirror and a screen for entertainment or information; and Schindler Ahead AdScreen, an advertising and communication space. In addition, the company provides transit management services through its destination control system. It offers its products and services to residential buildings, commercial and office buildings, hotels, healthcare facilities, shopping malls and retail facilities, public transport locations, institutional buildings, and marines, as well as stadiums, arenas, and convention centers. The company was founded in 1874 and is based in Hergiswil, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Hergiswil",
        "zipcode": "6052",
        "website": "http://www.schindler.com",
        "market_cap": "Large Cap"
    },
    "SHLAF": {
        "short_name": "SCHINDLER-HLDG AG",
        "long_name": "Schindler Holding AG",
        "summary": "Schindler Holding AG engages in the production, installation, maintenance, and modernization of passenger and freight elevators, escalators, and moving walks worldwide. It also offers digital media services for engaging communication channels, such as Schindler Ahead DoorShow, which displays information, advertising, and announcements on the elevator doors; Schindler Ahead SmartMirror, a mirror and a screen for entertainment or information; and Schindler Ahead AdScreen, an advertising and communication space. In addition, the company provides transit management services through its destination control system. It offers its products and services to residential buildings, commercial and office buildings, hotels, healthcare facilities, shopping malls and retail facilities, public transport locations, institutional buildings, and marines, as well as stadiums, arenas, and convention centers. The company was founded in 1874 and is based in Hergiswil, Switzerland.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Hergiswil",
        "zipcode": "6052",
        "website": "http://www.schindler.com",
        "market_cap": "Large Cap"
    },
    "SHLRF": {
        "short_name": "SCHINDLER-HLDG AG",
        "long_name": "Schindler Holding AG",
        "summary": "Schindler Holding AG engages in the production, installation, maintenance, and modernization of passenger and freight elevators, escalators, and moving walks worldwide. It also offers digital media services for engaging communication channels, such as Schindler Ahead DoorShow, which displays information, advertising, and announcements on the elevator doors; Schindler Ahead SmartMirror, a mirror and a screen for entertainment or information; and Schindler Ahead AdScreen, an advertising and communication space. In addition, the company provides transit management services through its destination control system. It offers its products and services to residential buildings, commercial and office buildings, hotels, healthcare facilities, shopping malls and retail facilities, public transport locations, institutional buildings, and marines, as well as stadiums, arenas, and convention centers. The company was founded in 1874 and is based in Hergiswil, Switzerland.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Hergiswil",
        "zipcode": "6052",
        "website": "http://www.schindler.com",
        "market_cap": "Large Cap"
    },
    "STGN.SW": {
        "short_name": "STARRAG GROUP N",
        "long_name": "Starrag Group Holding AG",
        "summary": "Starrag Group Holding AG manufactures and sells high-precision machine tools for milling, turning, boring, and grinding of work pieces of metallic, composite, and ceramic materials. The company's products include vertical and horizontal machining centers, blade and blisks machining centers, portal and gantry machining centers, vertical turning lathes, vertical grinding machines, faceting machines, transfer machines, and aerostructures machining centers. It also offers integrated technology and maintenance and engineering services, as well as software solutions. The company markets its products under the Berthiez, Bumotec, DÃ¶rries, Droop+Rein, Heckert, Scharmann/Ecoforce, SIP, Starrag, TTL, Ecospeed, and WMW brands for customers in the aerospace, energy, transportation, and industrial sectors in Switzerland, Germany, France, the United Kingdom, India, and internationally. The company was formerly known as StarragHeckert Holding AG and changed its name to Starrag Group Holding AG in 2012. Starrag Group Holding AG was founded in 1885 and is headquartered in Rorschacherberg, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Rorschacherberg",
        "zipcode": "9404",
        "website": "http://www.starrag.com",
        "market_cap": "Small Cap"
    },
    "STRN.SW": {
        "short_name": "SCHLATTER N",
        "long_name": "Schlatter Industries AG",
        "summary": "Schlatter Industries AG, together with its subsidiaries, manufactures and sells welding systems and weaving machines worldwide. It offers welding machines for reinforcing and industrial mesh, and industrial fences; wire straightening and cutting machines; MeshStudio, a three dimensional drawing program for welded wire mesh; wire butt welding machines; and flash butt welding machines for rails. The company also provides warp preparation machines; weaving machines for press fabrics, dryer fabrics, and industrial filters; finishing machines for forming, press, and dryer fabrics; wire weaving machines for metal wire fabrics; wire crimping machines for sieves and screens; and screen assembly machines for sieves and screens under the JÃ¤ger brand name. In addition, it offers used machinery; and training, field, and repair services, as well as spare parts. The company was formerly known as Schlatter Holding AG and changed its name to Schlatter Industries AG in January 2013. Schlatter Industries AG was founded in 1916 and is based in Schlieren, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Schlieren",
        "zipcode": "8952",
        "website": "http://www.schlattergroup.com",
        "market_cap": "Small Cap"
    },
    "SUN.SW": {
        "short_name": "SULZER N",
        "long_name": "Sulzer Ltd",
        "summary": "Sulzer Ltd provides fluid engineering services in Switzerland and internationally. The company operates through Pumps Equipment, Rotating Equipment Services, Chemtech, and Applicator Systems divisions. It offers side-mounted horizontal and top-mounted vertical agitators, dynamic chemical mixers, and tower and tank flow management products; tower management systems; turbo compressors, aeration systems, and mechanical aerators; cartridges, mixers, dispensers, and accessories; process solutions; medium consistency products; pumping solutions and auxiliary equipment; and control and monitoring equipment. The company also provides lifting stations; pump and lifting station accessories; products for distillation, absorption, stripping, evaporation, phase separation, liquid-liquid extraction, and crystallization separation; static and submersible mixers; solids reduction, separation, and removal systems; and screening, sedimentation, and filtration solutions. In addition, its services include rotating equipment services; mass transfer equipment, welding, plant maintenance, and turnaround project services; feasibility and debottlenecking studies, process validations, and basic engineering services; spare parts; testing and training services; technical services for adhesives and dental applications; and services for water, wastewater, and dewatering products, as well as operates services centers for rotating equipment. Further, the company digital solution, which includes control and monitoring solutions, sense condition monitoring, PumpsOnline, BLUE BOX, and DOC BOX services. It serves oil and gas; chemical; general industry; water; power; adhesive, dental, and healthcare; and beauty markets. Sulzer Ltd was founded in 1834 and is headquartered in Winterthur, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Winterthur",
        "zipcode": "8401",
        "website": "http://www.sulzer.com",
        "market_cap": "Mid Cap"
    },
    "SWTQ.SW": {
        "short_name": "SCHWEITER I",
        "long_name": "Schweiter Technologies AG",
        "summary": "Schweiter Technologies AG engages in the development, production, and distribution of cast plastic sheets, composite panels, foam boards, and core materials for composite structures in Europe, the Americas, Asia, and internationally. It provides materials for sandwich constructions, principally for use in wind farms; and composite panels for facades and display applications in the display, architecture, wind energy, marine, transportation, and industrial markets. The company offers its products under the ALUCOBOND, AIREX, BALTEK, CRYLON, CRYLUX, DIBOND, FOREX, GATOR, KAPA, SINTRA, SMART-X, and PERSPEX brands. In addition, it is involved in the property management activities; and provision of management services. The company was founded in 1912 and is headquartered in Steinhausen, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Steinhausen",
        "zipcode": "6312",
        "website": "http://www.schweiter.ch",
        "market_cap": "Mid Cap"
    },
    "TOHN.SW": {
        "short_name": "TORNOS N",
        "long_name": "Tornos Holding AG",
        "summary": "Tornos Holding AG, together with its subsidiaries, engages in the development, manufacture, marketing, sale, and servicing of machines and related spare parts worldwide. The company manufactures Swiss-type automatic lathes, multispindle machines, milling products, automation and bar feeders, and technology products, as well as machine communication and programming software. It also provides various services, such as handling and programming, preventive maintenance, and online fault reporting services; machine overhaul, updation, and upgradation, as well as used equipment; and training services. The company serves automotive, micromechanics, electronic, and medical and dental industries. Tornos Holding AG was founded in 1914 and is based in Moutier, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Moutier",
        "zipcode": "2740",
        "website": "http://www.tornos.com",
        "market_cap": "Small Cap"
    },
    "VACN.SW": {
        "short_name": "VAT GROUP N",
        "long_name": "VAT Group AG",
        "summary": "VAT Group AG, together with its subsidiaries, develops, manufactures, and supplies vacuum valves in Switzerland, rest of Europe, the United States, Japan, Korea, Singapore, China, rest of Asia, and internationally. The company operates through three segments: Valves, Global Service, and Industry. The Valves segment offers vacuum valves for the semiconductor, displays, photovoltaics, and vacuum coating industries, as well as for the industrial and research sectors. The Global Service segment provides spare parts, repairs, and upgrades, as well as support services. The Industry segment produces edge-welded bellows for use in vacuum feedthrough, semiconductor, implantable pump, sealing, and motor vehicle fuel injection system applications; and offers machined parts, mechanical components, and assemblies. VAT Group AG was founded in 1965 is headquartered in Sennwald, Switzerland.",
        "currency": "CHF",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Sennwald",
        "zipcode": "9469",
        "website": "http://www.vatvalve.com",
        "market_cap": "Mid Cap"
    },
    "VACNY": {
        "short_name": "VAT GROUP AG",
        "long_name": "VAT Group AG",
        "summary": "VAT Group AG, together with its subsidiaries, develops, manufactures, and supplies vacuum valves in Switzerland, rest of Europe, the United States, Japan, Korea, Singapore, China, rest of Asia, and internationally. The company operates through three segments: Valves, Global Service, and Industry. The Valves segment offers vacuum valves for the semiconductor, displays, photovoltaics, and vacuum coating industries, as well as for the industrial and research sectors. The Global Service segment provides spare parts, repairs, and upgrades, as well as support services. The Industry segment produces edge-welded bellows for use in vacuum feedthrough, semiconductor, implantable pump, sealing, and motor vehicle fuel injection system applications; and offers machined parts, mechanical components, and assemblies. VAT Group AG was founded in 1965 is headquartered in Sennwald, Switzerland.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Sennwald",
        "zipcode": "9469",
        "website": "http://www.vatvalve.com",
        "market_cap": "Mid Cap"
    },
    "VTTGF": {
        "short_name": "VAT GROUP AG",
        "long_name": "VAT Group AG",
        "summary": "VAT Group AG, together with its subsidiaries, develops, manufactures, and supplies vacuum valves in Switzerland, rest of Europe, the United States, Japan, Korea, Singapore, China, rest of Asia, and internationally. The company operates through three segments: Valves, Global Service, and Industry. The Valves segment offers vacuum valves for the semiconductor, displays, photovoltaics, and vacuum coating industries, as well as for the industrial and research sectors. The Global Service segment provides spare parts, repairs, and upgrades, as well as support services. The Industry segment produces edge-welded bellows for use in vacuum feedthrough, semiconductor, implantable pump, sealing, and motor vehicle fuel injection system applications; and offers machined parts, mechanical components, and assemblies. VAT Group AG was founded in 1965 is headquartered in Sennwald, Switzerland.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Sennwald",
        "zipcode": "9469",
        "website": "http://www.vatvalve.com",
        "market_cap": "Mid Cap"
    }
}