{"SFSN.SW": {"short_name": "SFS Group N", "long_name": "SFS Group AG", "summary": "SFS Group AG supplies mechanical fastening systems, assemblies, precision moulded parts, and logistics solutions internationally. It offers airbag restraint systems; automation and bracket logic solutions; brake systems; clip nuts; connections and reinforcements for timber construction; furniture fittings; hard disk drives; and thread inserts and spacer bushings. The company also manufactures and sells components, assemblies, and complete devices for the medical sector, such as cannulas, catheters, dental products, fixation systems, implants, insulin pens, hearing aids, mandrels, needles, probes, stylets, wires, and others. In addition, it provides building technology that include alarm systems; communication technology; and fastening and hinge technology for doors, windows, and glass facades, as well as fasteners and fastening systems for the facades. Further, the company offers domestic and kitchen appliances, such as washing machine, tumble dryers, clothes irons, steam generators, razors, epilators, hair trimmers, hair dryers, electric toothbrushes, refrigerators, freezers, dishwashers, cookers, ovens, steamers, microwave ovens, grills, pressure cookers, pans, coffee machines, kettles, and toasters. Additionally, it provides interior plastic components; fall protection systems; electronic components, such as miniature fasteners, assembled components, and metal and plastic components, as well as LED flash lenses; powertrain and powertrain technology; seats, doors, and sensors for vehicles; tools, forestry, and garden equipment; and window fittings. The company also develops and produces systems for the mechanical fastening of roof seal and thermal insulation on flat roofs. It offers its products to the aircraft, automobile, construction, electronic, medical, and other industries. SFS Group AG was founded in 1928 and is headquartered in Heerbrugg, Switzerland.", "currency": "CHF", "sector": "Industrials", "industry": "Tools & Accessories", "exchange": "EBS", "market": "ch_market", "country": "Switzerland", "city": "Heerbrugg"}}