{
    "000593.SZ": {
        "short_name": "SICHUAN DATONG GAS",
        "long_name": "Sichuan Datong Gas Development Co.,Ltd.",
        "summary": "Sichuan Datong Gas Development Co.,Ltd. engages in the supply and distribution of natural gas through pipelines for households and industrial users in China. It also operates hotels; invests in, develops, and manages properties; and provides interior decoration services. The company is headquartered in Chengdu, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610051",
        "website": "http://www.dtrq.com",
        "full_time_employees": null
    },
    "002700.SZ": {
        "short_name": "XINJIANG HAOYUAN N",
        "long_name": "Xinjiang Haoyuan Natural Gas Co. ,Ltd.",
        "summary": "Xinjiang Haoyuan Natural Gas Co. ,Ltd. engages in the transmission, distribution, and sale of natural gas; and home installation business in China. It operates long-distance gas pipelines, high and medium voltage municipal pipelines, gas stations, and CNG refueling mother station, as well as CNG trucks and tractors. The company was formerly known as Aksu Haoyuan Natural Gas Co., Ltd. And changed its name to Xinjiang Haoyuan Natural Gas Co. ,Ltd. The company was founded in 2006 and is based in Aksu, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Aksu",
        "zipcode": null,
        "website": "http://www.hytrq.com",
        "full_time_employees": null
    },
    "004690.KS": {
        "short_name": "Samchully",
        "long_name": "Samchully Co.,Ltd",
        "summary": "Samchully Co., Ltd. produces and supplies electric power to electricity sellers on the electric power market in Korea. It is also involved in the compressed natural gas (CNG) fueling stations for natural gas vehicles, and energy consulting businesses. In addition, the company generates and supplies electricity for heating and cooling systems. Further, the company engages in fuel cell, biogas, and renewable energy businesses. As of December 31, 2019, it supplied 3.88 billion m city gas to approximately 3.23 million households with a pipeline network of 6,341 km in 13 cities of Gyeonggi-do province, as well as in the 5 districts of Incheon, as well as operated approximately twelve CNG fueling stations. The company was formerly known as Samchully Industry Co., Ltd. and changed its name to Samchully Co., Ltd. in October 1984. Samchully Co., Ltd. was founded in 1955 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "07328",
        "website": "http://www.samchully.co.kr",
        "full_time_employees": null
    },
    "006890.KS": {
        "short_name": "TAEKYUNGCHEMICAL",
        "long_name": "Taekyung Chemical Co., Ltd.",
        "summary": "Taekyung Chemical Co., Ltd. manufactures and sells industrialized liquid gases and dry ice in Korea. The company offers liquid and solid carbon dioxide, magnesium hydroxide, ethylene, liquid oxygen, liquid nitrogen, and liquid argon. Its products are primarily used in food additives, metal coolants, quick coolants for welding, food insulators, smoke desulfurization for production accessories, wastewater treatment purification, steel/steel melting, welding, cutting oxidation prevention, filler, rapid coolant welding, filler steel, steel welding, and cutting. The company was formerly known as Daeduk Industry Co., Ltd. and changed its name to Taekyung Chemical Co., Ltd. in 2000. Taekyung Chemical Co., Ltd. was founded in 1970 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.taekyungchem.co.kr",
        "full_time_employees": null
    },
    "012320.KS": {
        "short_name": "KYUNGDONG INVEST",
        "long_name": "Kyungdong Invest Co., Ltd",
        "summary": "Kyungdong Invest Co., Ltd primarily engages in the supply of city gas in South Korea. The company supplies gas to households through pipeline of approximately 2,099 kilometeres, as well as compressed natual gas fuel to natural gas bus vehicles in Ulsan and Yangsan. It also produces anthracite coal and biomass, as well as offers energy diagnosis systems, gas heating and cooling systems, and gas cogeneration systems. In addition, the company is involved in the waste heat generation and pneumatic power generation activities, as well as construction of gas facilities, industrial plants, and civil/architectural buildings. Further, it engages in the maritime/air transportation, inland transportation, and export transportation; and operation of warehouses, container yards, and container freight stations, as well as port unloading/shipping activities. Kyungdong Invest Co., Ltd was founded in 1977 and is headquartered in Seongnam-si, South Korea.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seongnam-si",
        "zipcode": "13595",
        "website": "http://www.kdinvest.co.kr",
        "full_time_employees": null
    },
    "015350.KS": {
        "short_name": "BusanCtyGas",
        "long_name": "Busan City Gas. Co. Ltd.",
        "summary": "Busan City Gas. Co. Ltd. operates as a city gas distributor in South Korea. The company offers city gas for domestic, commercial, business, industrial, and power business purposes, including business or commercial buildings, house heating and cooking, combined heat and power generation, cooling, and vehicle CNG. It also provides district energy and energy diagnosis services; CNG fuel systems that include compressors, control panels, storage tanks, and fuel dispensers; small-scale co-generation systems that produces heat and energy; gas-engine driven heat pumps for cooling and heating; and fuel cell co-generation systems, which produces electricity and hot water. The company was founded in 1981 and is based in Busan, South Korea. Busan City Gas. Co. Ltd. is a subsidiary of SK E&S Co., Ltd.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Busan",
        "zipcode": "613-713",
        "website": "http://www.skens.com/busan/main/index.do",
        "full_time_employees": 300
    },
    "015360.KS": {
        "short_name": "Yesco Holdings",
        "long_name": "Yesco Holdings Co., Ltd.",
        "summary": "Yesco Holdings Co., Ltd. engages in the supply of city gas. It also offers gas equipment, tank terminals, air-conditioning and heating equipment, CNG chargers, gas equipment, and water treatment construction solutions, as well as biogas. It supplies LNG to 1.14 million households in the Seoul metropolitan area. The company also produces and sells precast concrete; and engages in housing design and wood processing activities. The company was founded in 1981 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.yescoholdings.com",
        "full_time_employees": null
    },
    "016710.KS": {
        "short_name": "DAESUNG HOLDINGS",
        "long_name": "Daesung Holdings Co., Ltd.",
        "summary": "Daesung Holdings Co., Ltd. engages in the energy, educational content, and information and communication businesses in South Korea. It supplies city gas to household, business, and industrial customers; and operates power generation, heat supply, landfill gas resource facilities, as well as acts as a consignment agent for city gas customer management, safety management of city gas facilities, construction of city gas supply and facilities, and gas connection construction. The company is also involved in the vehicle fuel retail business; call center outsourcing CRM, ASP, and talent dispatch businesses; and investment business. In addition, it provides distance education services for professionals in the companies and education sites; customized professional training courses for parents, instructors, prospective teachers, and companies; and various courses for foreign language, humanities, leadership, OA, and liberal arts through PC and mobile devices, as well as develops education programs for cooperative learning, strategic thinking, and insight and problem solving. Further, the company offers IT integrated management services, IT outsourcing and system integration services, oracle transaction based recovery solutions, RFID-based CNG charging POS systems, and apartment management ASP services, as well as supplies mobile terminals to retailers. Additionally, it provides VOIP service; and manages Skype services. The company was formerly known as Daegu City Gas Co., Ltd. and changed its name to Daesung Holdings Co., Ltd. in 2009. Daesung Holdings Co., Ltd. was founded in 1983 and is headquartered in Daegu, South Korea.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Daegu",
        "zipcode": null,
        "website": "http://www.daesung-holdings.com",
        "full_time_employees": null
    },
    "017390.KS": {
        "short_name": "SeoulCtyGas",
        "long_name": "Seoul City Gas Co., Ltd.",
        "summary": "Seoul City Gas Co., Ltd. supplies natural gas to residential, commercial, and industrial customers in South Korea. The company operates 4,441 kilometers of distribution pipelines covering a total distribution area of 1,249 square kilometers. It serves approximately 2.47 million families in the 11 areas of North Western Seoul, as well as the cities of Gyunggi-do. The company was founded in 1970 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.seoulgas.co.kr",
        "full_time_employees": null
    },
    "034590.KS": {
        "short_name": "INCHEON CITY GAS",
        "long_name": "Incheon City Gas Co., Ltd.",
        "summary": "Incheon City Gas Co., Ltd. supplies gas in South Korea. The company operates through a pipeline network of 1,534 kilometers. It also supplies electricity. The company was founded in 1983 and is headquartered in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Incheon",
        "zipcode": null,
        "website": "http://www.icgas.co.kr",
        "full_time_employees": null
    },
    "0U0.F": {
        "short_name": "FULCRUM UTIL.SVCS LS-,001",
        "long_name": "Fulcrum Utility Services Limited",
        "summary": "Fulcrum Utility Services Limited provides multi-utility infrastructure and related services in the United Kingdom. The company operates through two segments, Infrastructure: Design and Build, and Utility assets: Own and Operate. It designs and builds gas and electricity connections for housing, and industrial and commercial developments; and EV charging, gas, and electricity distribution infrastructures. The company also offers meter exchange and meter ownership services, as well as smart meter exchange programs and utility infrastructure asset services. In addition, it provides renewable electrical connections; and engages in the maintenance of electrical systems and renewable energy generating infrastructure. Further, the company offers gas transportation services. Fulcrum Utility Services Limited was incorporated in 2008 and is headquartered in Sheffield, the United Kingdom.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Sheffield",
        "zipcode": "S9 1XH",
        "website": "http://investors.fulcrum.co.uk",
        "full_time_employees": 294
    },
    "1083.HK": {
        "short_name": "TOWNGAS CHINA",
        "long_name": "Towngas China Company Limited",
        "summary": "Towngas China Company Limited, an investment holding company, sells and distributes piped gas in the People's Republic of China. The company operates through two segments, Sales and Distribution of Piped Gas and Related Products, and Gas Connection. It engages in the provision of piped gas; construction of gas pipelines; operation of city gas pipeline network; operation of gas fuel automobile refilling stations; and sale of gas household appliances. The company also offers financing services; provides engineering works services; and operates vehicle gas refilling stations. It serves approximately 14.14 million customers. The company was formerly known as Panva Gas Holdings Limited and changed its name to Towngas China Company Limited in May 2007. The company was founded in 1998 and is headquartered in North Point, Hong Kong. Towngas China Company Limited is a subsidiary of The Hong Kong and China Gas Company Limited.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.towngaschina.com",
        "full_time_employees": 22506
    },
    "117580.KS": {
        "short_name": "DAESUNGENERGY",
        "long_name": "Daesung Energy Co., Ltd.",
        "summary": "Daesung Energy Co., Ltd. supplies natural gas primarily in Daegu metropolitan area, South Korea. It develops and offers SolaWin system, a hybrid wind and solar system; solid refuse fuel systems; and community energy systems for the generation of renewable energy and power generation. The company also operates 12 compressed natural gas stations. Daesung Energy Co., Ltd. supplies natural gas to residential, commercial, and industrial customers. The company was founded in 1983 and is based in Daegu, South Korea. Daesung Energy Co., Ltd. is a subsidiary of Daesung Holdings Co., Ltd.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Daegu",
        "zipcode": null,
        "website": "http://www.daesungenergy.com",
        "full_time_employees": null
    },
    "1265.HK": {
        "short_name": "TIANJINJINRAN",
        "long_name": "Tianjin Jinran Public Utilities Company Limited",
        "summary": "Tianjin Jinran Public Utilities Company Limited engages in the operation and management of gas pipeline infrastructure, and the sale and distribution of piped gas to industrial and commercial users, and residential users in Mainland China. It operates through five segments: Sales of Piped Gas; Gas Connection; Gas Transportation; Sales of Gas Appliances and Others; and Gas Pipelines Rent. The company also provides piped gas connection services in Tianjin City and Jining, Inner Mongolia; leases pipelines, gas station facilities, and self-owned buildings; transports gas; and sells and installs gas appliances. In addition, it engages in the investment, urban gas operation, import and export, pipeline project, investment consultation, and mining investment activities. The company was formerly known as Tianjin Tianlian Public Utilities Company Limited and changed its name to Tianjin Jinran Public Utilities Company Limited in June 2012. The company is headquartered in Tianjin, the People's Republic of China. Tianjin Jinran Public Utilities Company Limited is a subsidiary of Tianjin Gas Group Company Limited.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": null,
        "website": "http://www.jinrangongyong.com",
        "full_time_employees": 751
    },
    "1430.HK": {
        "short_name": "SUCHUANG GAS",
        "long_name": "Suchuang Gas Corporation Limited",
        "summary": "Suchuang Gas Corporation Limited, an investment holding company, engages in the distribution and sale of piped natural gas to industrial, commercial, and residential users in Mainland China and internationally. It also provides natural gas transmission services; operates as a contractor for the construction and installation of gas pipelines; and constructs and operates natural gas filling stations. As of December 31, 2019, the company operated 5 compressed natural gas (CNG) /liquefied natural gas (LNG) refueling stations, including three stations in Guangyuan; 1 station in Taicang; and 1 station in Suzho; and served 595 commercial and industrial customers, and 250,000 residential customers. In addition, it promotes technologies for nitrogen and carbon dioxide; invests in the upstream asset; and offers technical, consulting, transfer, and development services, as well as sells chemicals. Further, the company is involved in the port facilities, contract energy management, project construction, and industrial investment businesses. Suchuang Gas Corporation Limited was founded in 2002 and is headquartered in Suzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215400",
        "website": "http://www.suchuanggas.com",
        "full_time_employees": 415
    },
    "1635.HK": {
        "short_name": "DZUG",
        "long_name": "Shanghai Dazhong Public Utilities(Group) Co.,Ltd.",
        "summary": "Shanghai Dazhong Public Utilities (Group) Co., Ltd., an investment holding company, engages in the piped gas supply and wastewater treatment activities in the People's Republic of China. The company operates four segments: Piped Gas Supply; Wastewater Treatment; Public Infrastructure Projects; and Transportation Services. It sells, distributes, and supplies piped natural gas; constructs and installs gas pipelines; treats wastewater and handles urban wastewater; rents cars, taxies, and tourist cars; and offers freight transport, relocation, liquefied petroleum gas delivery, and tourism services, as well as operates Dazhong Chuxing platform that provides online car hailing services. The company also offers infrastructure investment, construction, operation maintenance, and protection services; public infrastructure project services; and transportation, storage and, postal services, as well as sells gas related products. In addition, it provides financial services, including financial leasing, pre-paid cards, etc.; and scientific research and technological services, as well as invests in venture capital enterprises. Further, the company engages in the municipal road operation; agriculture development; payment; assets management; and financial consultancy activities. It owns approximately 6,826 kilometers of underground pipelines; and 900 operating vehicles. The company was formerly known as Shanghai Pudong Dazhong Taxi Co., Ltd. and changed its name to Shanghai Dazhong Public Utilities (Group) Co., Ltd. in May 2003. The company was founded in 1991 and is based in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200235",
        "website": "http://www.dzug.cn",
        "full_time_employees": 2962
    },
    "1940.HK": {
        "short_name": "CGII HLDGS",
        "long_name": "China Gas Industry Investment Holdings Co. Ltd.",
        "summary": "China Gas Industry Investment Holdings Co., Ltd., an investment holding company, produces and sells industrial gas in the People's Republic of China. The company provides industrial gas products, which include oxygen, nitrogen, argon, hydrogen and carbon dioxide. It primarily engages in the supply of pipeline industrial gas, as well as liquefied industrial gas (LNG) principally to offsite independent third parties through road tanker delivery; and LNG-related business, which includes the supply of LNG and provision of gas transmission services. In addition, the company operates an automobile LNG filling station; and constructs industrial gas projects. It sells its liquefied industrial gas to customers in a range of industries, including medical, shipping, engineering, photovoltaic, food, and automotive. The company was founded in 2004 and is headquartered in Tangshan, China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Tangshan",
        "zipcode": null,
        "website": "http://cgiiholdings.com/web/index.html",
        "full_time_employees": null
    },
    "1KS.F": {
        "short_name": "SHIZUOKA GAS CO. LTD.",
        "long_name": "Shizuoka Gas Co., Ltd.",
        "summary": "Shizuoka Gas Co., Ltd. produces, supplies, and sells city gas in Japan. The company also sells gas appliances; and undertakes contracts for gas related construction works. As of December 31, 2019, it served approximately 320,390 customers through a gas pipeline network of 4,469 km. The company was founded in 1910 and is headquartered in Shizuoka, Japan.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Shizuoka",
        "zipcode": "422-8688",
        "website": "http://www.shizuokagas.co.jp",
        "full_time_employees": 1433
    },
    "2080.SR": {
        "short_name": "National Gas and Industrializat",
        "long_name": "National Gas & Industerialization Co.",
        "summary": "National Gas & Industerialization Co. engages in the transportation, filling, and marketing of liquefied petroleum gas primarily in Saudi Arabia. The company's products include underground and ground surface gas tanks; gas and fiber cylinders; gas cylinder and tank regulators; and liquid gas. It also provides installation, refill, and maintenance services; and manufactures, transfers, and markets petroleum products, chemicals, glass, and auto parts, as well as markets cylinders, empty tanks, related spare parts, and tank transportation equipment. In addition, the company is involved in the operation of equipment service centers; and the establishment and maintenance of petroleum equipment and vehicles. Its gases are also used for residential, industrial, agricultural, and commercial purposes. National Gas & Industerialization Co. was incorporated in 1963 and is based in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11421",
        "website": "http://www.gasco.com.sa",
        "full_time_employees": null
    },
    "267290.KS": {
        "short_name": "KYUNGDONG CITY GAS",
        "long_name": "Kyungdong City Gas Co., Ltd",
        "summary": "Kyungdong City Gas Co., Ltd engages in the manufacture and supply of liquefied natural gas through a network of pipelines. The company operates city gas safety agency services and gas construction through customer service companies; manufactures and sells gas equipment; and retails vehicle fuel. It also provides natural gas related engineering services; gas cooling and heating, and power generation facilities services; plumbing rental services; and data analysis, development, sale, maintenance and exchange, and transmission services. The company was incorporated in 1977 and is headquartered in Ulsan, South Korea.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Ulsan",
        "zipcode": null,
        "website": "http://www.kdgas.co.kr",
        "full_time_employees": null
    },
    "2688.HK": {
        "short_name": "ENN ENERGY",
        "long_name": "ENN Energy Holdings Limited",
        "summary": "ENN Energy Holdings Limited, an investment holding company, engages in the investment, construction, operation, and management of gas pipeline infrastructures; and integrated energy, and vehicle and ship refueling stations in the People's Republic of China. It operates through Retail Gas Sales Business, Integrated Energy Business, Wholesale of Gas, Construction and Installation, and Value Added Business segments. The company also sells and distributes piped gas, liquefied natural gas, and other multi-energy products; and provides other services in relation to energy supply. In addition, it is involved in the business of energy trading; retail of gas pipelines, and related materials and equipment; transportation of oil products and gas; and sourcing of compressed pipeline gas, as well as wholesale and retail of LNG, CNG, gas equipment, appliances, and others; and provision of financial services. As of December 31, 2020, the company served approximately 23.21 million residential customers and 177,128 commercial/industrial customers. The company was formerly known as XinAo Gas Holdings Limited and changed its name to ENN Energy Holdings Limited in September 2010. ENN Energy Holdings Limited was founded in 1992 and is headquartered in Langfang, China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Langfang",
        "zipcode": "065001",
        "website": "http://www.ennenergy.com",
        "full_time_employees": null
    },
    "2886.HK": {
        "short_name": "BINHAI INV",
        "long_name": "Binhai Investment Company Limited",
        "summary": "Binhai Investment Company Limited, an investment holding company, engages in the construction of gas pipeline networks, provision of connection services, and sale of liquefied petroleum gas (LPG) and piped gas in Hong Kong. The company operates through Sales of Piped Natural Gas, Construction and Gas Pipeline Installation Service, Gas Passing through Service, and Sales of Bottled Natural Gas segments. It also sells piped and bottled natural gas through its pipeline networks to residential and industrial users. In addition, the company is involved in the construction of gas pipelines and installation of appliances to connect customers to pipeline networks under connection contracts to industrial and commercial customers, property developers, and property management companies. As of December 31, 2020, it had a gas pipeline network of approximately 3,355 kilometers. The company was founded in 1994 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.binhaiinv.com",
        "full_time_employees": 1718
    },
    "3361.T": {
        "short_name": "TOELL CO.LTD",
        "long_name": "Toell Co.,Ltd.",
        "summary": "Toell Co.,Ltd. engages in the production, wholesale, and retail of liquefied petroleum gas (LPG) in Japan and internationally. The company is involved in LPG container re-inspection, gas piping equipment construction, simple gas, LPG consuming destination installation, other LPG related equipment, home service, general freight car transportation, warehouse, management of nurseries, communication, security agency, and call center businesses, as well as in the online sale of food and daily necessities. It also sells propane and high pressure gases, and LPG related equipment; imports, manufactures, sells, wholesales, and exports pure water; produces and sells agricultural products; supplies electricity; generates solar power; and offers LPG cogeneration systems and fuel cells, gas heat pumps, storage batteries, and LPG generators, as well as CLOUD LINE, an Internet service. The company was incorporated in 1963 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "223-8510",
        "website": "http://www.toell.co.jp",
        "full_time_employees": 519
    },
    "3633.HK": {
        "short_name": "ZHONGYU GAS",
        "long_name": "Zhongyu Gas Holdings Limited",
        "summary": "Zhongyu Gas Holdings Limited, an investment holding company, engages in the development, construction, and operation of natural gas projects in the People's Republic of China. The company is involved in the investment, operation, and management of gas pipeline infrastructure; distribution of piped gas to residential, industrial, and commercial users; operation of compressed natural gas and liquefied natural gas vehicle filling stations; and sale of stoves and related equipment, as well as trading of natural, coal, and liquefied petroleum gas. It also engages in the designing and consulting of energy projects; research and development of natural gas technology; sale of gas equipment and materials; gas pipeline construction; dangerous goods transportation; digital and information technology development; and provision of related consultancy services. The company was formerly known as MRC Holdings Limited and changed its name to Zhongyu Gas Holdings Limited in February 2004. Zhongyu Gas Holdings Limited was incorporated in 2001 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.zhongyugas.com",
        "full_time_employees": 4683
    },
    "3U6.F": {
        "short_name": "UGI CORP.",
        "long_name": "UGI Corporation",
        "summary": "UGI Corporation distributes, stores, transports, and markets energy products and related services in the United States and internationally. The company operates through four segments: AmeriGas Propane, UGI International, Midstream & Marketing, and UGI Utilities. It distributes propane to approximately 1.5 million residential, commercial/industrial, motor fuel, agricultural, and wholesale customers through 1,800 propane distribution locations; and sells, installs, and services propane appliances, including heating systems and propane-powered generators. The company also distributes liquefied petroleum gases (LPG) to residential, commercial, industrial, agricultural, wholesale and automobile fuel customers; and provides logistics, storage, and other services to third-party LPG distributors. In addition, it engages in the retail sale of natural gas, liquid fuels, and electricity to approximately 14,000 residential, commercial, and industrial customers at 45,000 locations. Further, the company distributes natural gas to approximately 670,000 customers in the portions of 46 eastern and central Pennsylvania counties through its distribution system of 12,300 miles of gas mains; and supplies electricity to approximately 62,500 customers in northeastern Pennsylvania through 2,500 miles of lines and 14 substations. Additionally, it operates electric generation facilities, which include coal-fired, landfill gas-fueled, solar-powered, and natural gas-fueled facilities; a natural gas liquefaction, storage, and vaporization facility; propane storage and propane-air mixing stations; and rail transshipment terminals. It also manages natural gas pipeline and storage contracts; develops, owns, and operates pipelines, gathering infrastructure, and gas storage facilities. UGI Corporation was founded in 1882 and is headquartered in King of Prussia, Pennsylvania.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "King of Prussia",
        "zipcode": "19406",
        "website": "http://www.ugicorp.com",
        "full_time_employees": 11300
    },
    "4PD1.F": {
        "short_name": "INFRASTRATA PLC LS -,01",
        "long_name": "InfraStrata plc",
        "summary": "InfraStrata plc, together with its subsidiaries, operates as a gas storage company. It engages in the energy infrastructure development and operation of gas storage project at Islandmagee in County Antrim in Northern Ireland. The company was formerly known as Portland Gas plc and changed its name to InfraStrata plc in December 2009. InfraStrata plc was incorporated in 2007 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC4R 3TT",
        "website": "http://www.infrastrataplc.com",
        "full_time_employees": 81
    },
    "5974.T": {
        "short_name": "CHUGOKUKOGYO CO",
        "long_name": "Chugokukogyo Co.,Ltd.",
        "summary": "Chugokukogyo Co.,Ltd. manufactures and sells high pressure, iron construction, and facility equipment. The company manufactures and sells LP gas containers, storage tanks, and bulk storage tank; and designs, constructs, and inspects LP gas plants. It also offers inner cover for annealing furnaces and other iron structure products; FRP feed tank silage silos; FRP pharmaceutical tanks and covers; FRP automotive parts, vehicle wash basins, etc.; livestock products, such as wet feeders and pipe libraries; BM deodorizers; and livestock wastewater treatment equipment. The company was founded in 1950 and is headquartered in Kure, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kure",
        "zipcode": "737-0192",
        "website": "http://www.ckk-chugoku.co.jp",
        "full_time_employees": null
    },
    "600333.SS": {
        "short_name": "CHANGCHUN GAS CO",
        "long_name": "Changchun Gas Co., Ltd.",
        "summary": "Changchun Gas Co., Ltd. provides gas to urban, industrial, commercial, automotive, and other end customers in China. It engages in the storage and transportation of natural gas; and operation of gas pipelines. The company was founded in 1924 and is based in Changchun, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": null,
        "website": "http://www.ccrq.com.cn",
        "full_time_employees": 2532
    },
    "600635.SS": {
        "short_name": "SHANGHAI DAZHONG PUBLIC UTILITI",
        "long_name": "Shanghai Dazhong Public Utilities(Group) Co.,Ltd.",
        "summary": "Shanghai Dazhong Public Utilities (Group) Co., Ltd., an investment holding company, engages in the piped gas supply and wastewater treatment activities in the People's Republic of China. The company operates four segments: Piped Gas Supply; Wastewater Treatment; Public Infrastructure Projects; and Transportation Services. It sells, distributes, and supplies piped natural gas; constructs and installs gas pipelines; treats wastewater and handles urban wastewater; rents cars, taxies, and tourist cars; and offers freight transport, relocation, liquefied petroleum gas delivery, and tourism services, as well as operates Dazhong Chuxing platform that provides online car hailing services. The company also offers infrastructure investment, construction, operation maintenance, and protection services; public infrastructure project services; and transportation, storage and, postal services, as well as sells gas related products. In addition, it provides financial services, including financial leasing, pre-paid cards, etc.; and scientific research and technological services, as well as invests in venture capital enterprises. Further, the company engages in the municipal road operation; agriculture development; payment; assets management; and financial consultancy activities. It owns approximately 6,826 kilometers of underground pipelines; and 900 operating vehicles. The company was formerly known as Shanghai Pudong Dazhong Taxi Co., Ltd. and changed its name to Shanghai Dazhong Public Utilities (Group) Co., Ltd. in May 2003. The company was founded in 1991 and is based in Shanghai, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200235",
        "website": "http://www.dzug.cn",
        "full_time_employees": 2962
    },
    "600681.SS": {
        "short_name": "BESTSUN ENERGY CO LTD",
        "long_name": "Bestsun Energy Co., Ltd.",
        "summary": "Bestsun Energy Co., Ltd. operates in the gas sector. The company sells natural gas and heating energy; and transports gas, as well as provides gas connections and appliances. It operates in the Hebei and Shaanxi provinces, as well as Tianjin, China. The company was formerly known as Wuhan Winowner Group Co., Ltd. and changed its name to Bestsun Energy Co., Ltd. in August 2004. Bestsun Energy Co., Ltd. was founded in 1992 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.bestsungas.com",
        "full_time_employees": 1833
    },
    "600856.SS": {
        "short_name": "ZHONGXING TIANHENG ENERGY TECHN",
        "long_name": "Zhongxing Tianheng Energy Technology (Beijing) Co., Ltd.",
        "summary": "Zhongxing Tianheng Energy Technology (Beijing) Co., Ltd. operates in the natural gas industry in China and internationally. The company produces and sells natural gases, such as CNG and LNG; invests in, constructs, and operates CNG refueling stations and substations, and LNG liquefaction plants and receiving stations; operates LNG storage and distribution stations, and gas supply stations; and develops and operates oil and gas assets internationally. It also engages in the crude oil refining activities. The company was formerly known as Changchun Sinoenergy Corporation and changed its name to Zhongxing Tianheng Energy Technology (Beijing) Co., Ltd. in October 2020. Zhongxing Tianheng Energy Technology (Beijing) Co., Ltd. is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.snencn.cn",
        "full_time_employees": 287
    },
    "603080.SS": {
        "short_name": "XINJIANG TORCH GAS CO LTD",
        "long_name": "Xinjiang Torch Gas Co., Ltd",
        "summary": "Xinjiang Torch Gas Co., Ltd engages in the natural gas transmission and distribution activities in China. The company also provides sales and home installation services. It owns approximately 120 kilometers of long-distance pipeline and 1 CNG parent station, as well as offers CNG refueling services. The company was founded in 2003 and is based in Kashi, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kashi",
        "zipcode": "844000",
        "website": "http://www.zw.org.cn/hjrq",
        "full_time_employees": 796
    },
    "603393.SS": {
        "short_name": "XINJIANG XINTAI NATURAL GAS CO ",
        "long_name": "Xinjiang Xintai Natural Gas Co., Ltd.",
        "summary": "Xinjiang Xintai Natural Gas Co., Ltd. engages in the transmission, distribution, and sale of natural gas in China. It serves civil, commercial, automotive, and industrial parks. The company was formerly known as Xinjiang Xintai Investment (Group) Co., Ltd. and changed its name to Xinjiang Xintai Natural Gas Co., Ltd. in December 2012. Xinjiang Xintai Natural Gas Co., Ltd. was founded in 2000 and is based in Urumqi, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Urumqi",
        "zipcode": "831400",
        "website": "http://www.xjxtrq.com",
        "full_time_employees": null
    },
    "605368.SS": {
        "short_name": "HENAN LANTIAN GAS CO LTD",
        "long_name": "Henan Lantian Gas Co.,Ltd.",
        "summary": "Henan Lantian Gas Co.,Ltd. transports and sells natural gas pipelines. It also offers gas pipeline installation services. The company was founded in 2002 and is based in Zhumadian City, China. Henan Lantian Gas Co., Ltd. operates as a subsidiary of Henan Lantian Group CO.,LTD.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhumadian City",
        "zipcode": "463000",
        "website": "http://www.hnltrq.com.cn",
        "full_time_employees": null
    },
    "8908.TWO": {
        "short_name": "SHINHSIUNG NATURAL GAS INC.",
        "long_name": "ShinHsiung Natural Gas Inc.",
        "summary": "ShinHsiung Natural Gas Inc. supplies natural gas in Taiwan. The company was founded in 1975 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "830",
        "website": "http://www.shng.com.tw",
        "full_time_employees": null
    },
    "9532.T": {
        "short_name": "OSAKA GAS CO",
        "long_name": "Osaka Gas Co., Ltd.",
        "summary": "Osaka Gas Co., Ltd. provides gas, electricity, and other energy products and services in Japan and internationally. It operates through four segments: Domestic Energy/Gas, Domestic Energy/Electricity, International Energy, and Life & Business Solutions. The Domestic Energy/Gas segment engages in the design, construction, etc. of various plants related to gas, environmental conservation, and others; sale of gas appliances, and housing equipment and appliances; maintenance checks on gas equipment and appliances, and checks on gas meters, as well as collection of gas bills and others; and leasing, installment payments assistance, insurance agency, and others. This segment is also involved in the gas piping works; sale and construction of energy facilities and equipment, heating system supplies, and others; temporary staffing and call center operation activities; and provision of various research and consulting services. The Domestic Energy/Electricity segment supplies electric power. It generates and sells electricity from natural gas-fired thermal power plants, as well as wind, biomass, and solar resources. The International Energy segment engages in leasing LNG tankers; the development and investment of petroleum and natural gas; investment relating to energy supply business; and procurement and sale of LNG. The Life & Business Solutions segment manufactures and sells fine materials, carbon material products, activated carbon, wood protective coatings, absorbent functional materials, and resin additives; develops, leases, manages, and sells real estate properties; and develops software products and provides computer-based data processing services. This segment is also involved in the management and contracted operation of sports facilities and others. The company was founded in 1897 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0046",
        "website": "http://www.osakagas.co.jp",
        "full_time_employees": null
    },
    "9534.T": {
        "short_name": "HOKKAIDO GAS CO",
        "long_name": "Hokkaido Gas Co., Ltd.",
        "summary": "Hokkaido Gas Co., Ltd. engages in gas, and heat and power supply businesses in Japan. The company is also involved in the purification and sale of gas by-products; production and sale of gas appliances, as well as related construction works; and other related works. It offers its services in Sapporo, Otaru, Hakodate, Chitose, Ishikari, Kitahiroshima, Eniwa, Hokuto, and Kitami. Hokkaido Gas Co., Ltd. was founded in 1911 and is headquartered in Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sapporo",
        "zipcode": null,
        "website": "http://www.hokkaido-gas.co.jp",
        "full_time_employees": null
    },
    "9536.T": {
        "short_name": "SAIBU GAS HOLDINGS CO LTD",
        "long_name": "Saibu Gas Holdings Co.,Ltd.",
        "summary": "Saibu Gas Holdings Co.,Ltd. produces, supplies, and sells natural gas in Japan. The company also utilizes LNG cryogenic energy; and sells LNG. In addition, it produces, sells, and installs gas equipment and apparatus, as well as undertakes related construction works. The company was formerly known as Saibu Gas Co.,Ltd. and changed its name to Saibu Gas Holdings Co.,Ltd. in April 2021. Saibu Gas Holdings Co.,Ltd. was founded in 1902 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka City",
        "zipcode": null,
        "website": "http://www.saibugas.co.jp",
        "full_time_employees": null
    },
    "9537.T": {
        "short_name": "HOKURIKU GAS CO",
        "long_name": "Hokuriku Gas Co.,Ltd.",
        "summary": "Hokuriku Gas Co.,Ltd. engages in the gas business in Japan. The company produces, sells, and supplies gas to approximately 440,000 customers in Niigata, Nagaoka, Sanjo, Kashiwazaki, and Kamo cities, as well as in Tagami town and Kariwa village. It also undertakes gas construction contracts; and sells gas equipment. The company was founded in 1913 and is headquartered in Niigata, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Niigata",
        "zipcode": "950-8748",
        "website": "http://www.hokurikugas.co.jp",
        "full_time_employees": 609
    },
    "9539.T": {
        "short_name": "KEIYO GAS CO LTD",
        "long_name": "Keiyo Gas Co., Ltd.",
        "summary": "Keiyo Gas Co., Ltd. produces, supplies, and sells city gas in the northwest of Chiba Prefecture, Japan. It is also involved in the sale of gas equipment; and operation of gas fitting work. The company was founded in 1927 and is headquartered in Ichikawa, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ichikawa",
        "zipcode": "272-8580",
        "website": "http://www.keiyogas.co.jp",
        "full_time_employees": 1208
    },
    "9543.T": {
        "short_name": "SHIZUOKA GAS CO LTD",
        "long_name": "Shizuoka Gas Co., Ltd.",
        "summary": "Shizuoka Gas Co., Ltd. produces, supplies, and sells city gas in Japan. The company also sells gas appliances; and undertakes contracts for gas related construction works. As of December 31, 2019, it served approximately 320,390 customers through a gas pipeline network of 4,469 km. The company was founded in 1910 and is headquartered in Shizuoka, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Shizuoka",
        "zipcode": "422-8688",
        "website": "http://www.shizuokagas.co.jp",
        "full_time_employees": 1433
    },
    "9818.T": {
        "short_name": "DAIMARU ENAWIN CO.LTD",
        "long_name": "Daimaru Enawin Co., Ltd.",
        "summary": "Daimaru Enawin Co., Ltd. sells LP gas and petroleum products in Japan. The company's petroleum products include kerosene, and light and heavy oil. It also sells gas appliances, system kitchens, air conditioning equipment, home appliances, and solar systems; medical gases, home medical oxygen, and medical equipment; and industrial gases, welding and fusing equipment, welding materials, and industrial equipment. In addition, the company is involved in the mineral water home delivery services. Daimaru Enawin Co., Ltd. was founded in 1951 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "559-0022",
        "website": "http://www.gas-daimaru.co.jp",
        "full_time_employees": null
    },
    "9908.HK": {
        "short_name": "JIAXING GAS",
        "long_name": "JiaXing Gas Group Co., Ltd.",
        "summary": "JiaXing Gas Group Co., Ltd. operates as a piped natural gas (PNG) operator in the People's Republic of China. The company sells PNG, liquefied natural gas (LNG), and liquefied petroleum gas (LPG) to residential and non-residential users; provides construction and installation services for gas pipeline network and gas facilities to property developers and owners, or occupants of residential and non-residential properties; and distributes and sells gas pipes and equipment. It also provides gas technology consulting services; constructs and operates new energy facilities, as well as LNG storage and transportation station; transports LNG and compressed natural gas; sells vapour and construction materials; and leases properties. The company serves customers in the Jiaxing port and urban areas. JiaXing Gas Group Co., Ltd. was founded in 1998 and is headquartered in Jiaxing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Jiaxing",
        "zipcode": null,
        "website": "http://www.jxrqgs.com",
        "full_time_employees": 362
    },
    "9908.TW": {
        "short_name": "THE GREAT TAIPEI GAS",
        "long_name": "The Great Taipei Gas Corporation",
        "summary": "The Great Taipei Gas Corporation supplies natural gas in Taiwan. The company's business area covers seven districts, including Song-Shan, Sin-Yi, Da-An, Da-Tong, Manka, Zhong-Zheng, and Zhong-Shan, as well as two counties comprising Fu-Hua and Ming-Sheng in the Su-Lim district. It serves approximately 380,000 customers. The company was founded in 1964 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "105",
        "website": "http://www.taipeigas.com.tw",
        "full_time_employees": null
    },
    "A1TM34.SA": {
        "short_name": "ATMOS ENERGYDRN",
        "long_name": "Atmos Energy Corporation",
        "summary": "Atmos Energy Corporation, together with its subsidiaries, engages in the regulated natural gas distribution, and pipeline and storage businesses in the United States. It operates in two segments, Distribution, and Pipeline and Storage. The Distribution segment is involved in the regulated natural gas distribution and related sales operations in eight states. This segment distributes natural gas to approximately three million residential, commercial, public authority, and industrial customers. As of September 30, 2020, it owned 71,558 miles of underground distribution and transmission mains. The Pipeline and Storage segment engages in the pipeline and storage operations. This segment transports natural gas for third parties and manages five underground storage reservoirs in Texas; and provides ancillary services to the pipeline industry, including parking arrangements, lending, and inventory sales. As of September 30, 2020, it owned 5,684 miles of gas transmission lines. Atmos Energy Corporation was founded in 1906 and is headquartered in Dallas, Texas.",
        "currency": "BRL",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75240",
        "website": "http://www.atmosenergy.com",
        "full_time_employees": 4694
    },
    "A7RU.SI": {
        "short_name": "Kep Infra Tr",
        "long_name": "Keppel Infrastructure Trust",
        "summary": "Keppel Infrastructure Trust is a listed business trust. The firm provides investors with the opportunity to invest in a large and well-diversified portfolio of core infrastructure assets located in jurisdictions with well-developed legal frameworks that support infrastructure investment. It aims to provide long-term, regular and sustainable distributions to its Unitholders. Keppel Infrastructure Trust was incorporated in 2007 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "098632",
        "website": "http://www.kepinfratrust.com",
        "full_time_employees": null
    },
    "AAN.F": {
        "short_name": "AAG ENERGY HOLDINGS LTD",
        "long_name": "AAG Energy Holdings Limited",
        "summary": "AAG Energy Holdings Limited engages in the exploration, development, production, and sale of coalbed methane in the People's Republic of China. It holds interests in the Panzhuang concession covering an area of 141.8 square kilometers in the southern area of Qinshui Basin; and the Mabi concession extending over an area of 898.2 square kilometers in the southern Qinshui Basin in Shanxi province under production sharing contracts. The company was founded in 1994 and is headquartered in Central, Hong Kong. AAG Energy Holdings Limited is a subsidiary of Liming Holding Limited.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.aagenergy.com",
        "full_time_employees": 487
    },
    "AEO.F": {
        "short_name": "ATMOS EN. CORP.",
        "long_name": "Atmos Energy Corporation",
        "summary": "Atmos Energy Corporation, together with its subsidiaries, engages in the regulated natural gas distribution, and pipeline and storage businesses in the United States. It operates in two segments, Distribution, and Pipeline and Storage. The Distribution segment is involved in the regulated natural gas distribution and related sales operations in eight states. This segment distributes natural gas to approximately three million residential, commercial, public authority, and industrial customers. As of September 30, 2020, it owned 71,558 miles of underground distribution and transmission mains. The Pipeline and Storage segment engages in the pipeline and storage operations. This segment transports natural gas for third parties and manages five underground storage reservoirs in Texas; and provides ancillary services to the pipeline industry, including parking arrangements, lending, and inventory sales. As of September 30, 2020, it owned 5,684 miles of gas transmission lines. Atmos Energy Corporation was founded in 1906 and is headquartered in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75240",
        "website": "http://www.atmosenergy.com",
        "full_time_employees": 4694
    },
    "AJ2.SI": {
        "short_name": "Ouhua Energy",
        "long_name": "Ouhua Energy Holdings Limited",
        "summary": "Ouhua Energy Holdings Limited, an investment holding company, engages in the import, processing, and wholesale of liquefied petroleum gas (LPG) in the People's Republic of China. The company imports raw materials, including butane and propane, and processes these products into LPG; and purchases and sells LPG. It also exports its products to Vietnam, the Philippines, and Thailand in Southeast Asia. The company was founded in 2000 and is based in Chaozhou, the People's Republic of China. Ouhua Energy Holdings Limited is a subsidiary of High Tree Worldwide Ltd.",
        "currency": "SGD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Chaozhou",
        "zipcode": null,
        "website": "http://www.ohwa.com.sg",
        "full_time_employees": null
    },
    "ALA-PE.TO": {
        "short_name": "ALTAGAS LTD PREF SERIES E",
        "long_name": "AltaGas Ltd.",
        "summary": "AltaGas Ltd. operates as a diversified energy infrastructure company in North America. The company operates through two segments, Utilities and Midstream. The Utilities segment owns and operates regulated natural gas distribution utilities in Michigan, Alaska, the District of Columbia, Maryland, and Virginia; and two regulated natural gas storage utilities in the United States serving approximately 1.7 million customers. This segment also provides interstate natural gas transportation and storage services. It serves homes and businesses. The Midstream segment engages in the natural gas gathering and processing; natural gas liquids (NGL) extraction and fractionation, transmission, and storage; and natural gas and NGL marketing activities. This segment owns approximately 1.5 billion cubic feet per day of natural gas capacity. The company also holds interest in a regulated pipeline in the Marcellus/Utica gas formation in the northeastern United States; and engages in LPG exports and distribution, domestic terminals, wellsite fluids and fuels, and trucking and liquids handling businesses. It serves residential, commercial, and industrial customers primarily in the Western Canada Sedimentary Basin. Additionally, the company operates two natural gas-fired plants with 577 MW of generating capacity in California and Colorado; and energy storage assets in Alberta, Canada, as well as nine states and the district of Columbia in the United States. AltaGas Ltd. was founded in 1994 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 0J1",
        "website": "http://www.altagas.ca",
        "full_time_employees": 2984
    },
    "ALA-PG.TO": {
        "short_name": "ALTAGAS LTD PREF G",
        "long_name": "AltaGas Ltd.",
        "summary": "AltaGas Ltd. operates as a diversified energy infrastructure company in North America. The company operates through two segments, Utilities and Midstream. The Utilities segment owns and operates regulated natural gas distribution utilities in Michigan, Alaska, the District of Columbia, Maryland, and Virginia; and two regulated natural gas storage utilities in the United States serving approximately 1.7 million customers. This segment also provides interstate natural gas transportation and storage services. It serves homes and businesses. The Midstream segment engages in the natural gas gathering and processing; natural gas liquids (NGL) extraction and fractionation, transmission, and storage; and natural gas and NGL marketing activities. This segment owns approximately 1.5 billion cubic feet per day of natural gas capacity. The company also holds interest in a regulated pipeline in the Marcellus/Utica gas formation in the northeastern United States; and engages in LPG exports and distribution, domestic terminals, wellsite fluids and fuels, and trucking and liquids handling businesses. It serves residential, commercial, and industrial customers primarily in the Western Canada Sedimentary Basin. Additionally, the company operates two natural gas-fired plants with 577 MW of generating capacity in California and Colorado; and energy storage assets in Alberta, Canada, as well as nine states and the district of Columbia in the United States. AltaGas Ltd. was founded in 1994 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 0J1",
        "website": "http://www.altagas.ca",
        "full_time_employees": 2984
    },
    "ALA-PU.TO": {
        "short_name": "ALTAGAS LTD PREF SERIES C",
        "long_name": "AltaGas Ltd.",
        "summary": "AltaGas Ltd. operates as a diversified energy infrastructure company in North America. The company operates through two segments, Utilities and Midstream. The Utilities segment owns and operates regulated natural gas distribution utilities in Michigan, Alaska, the District of Columbia, Maryland, and Virginia; and two regulated natural gas storage utilities in the United States serving approximately 1.7 million customers. This segment also provides interstate natural gas transportation and storage services. It serves homes and businesses. The Midstream segment engages in the natural gas gathering and processing; natural gas liquids (NGL) extraction and fractionation, transmission, and storage; and natural gas and NGL marketing activities. This segment owns approximately 1.5 billion cubic feet per day of natural gas capacity. The company also holds interest in a regulated pipeline in the Marcellus/Utica gas formation in the northeastern United States; and engages in LPG exports and distribution, domestic terminals, wellsite fluids and fuels, and trucking and liquids handling businesses. It serves residential, commercial, and industrial customers primarily in the Western Canada Sedimentary Basin. Additionally, the company operates two natural gas-fired plants with 577 MW of generating capacity in California and Colorado; and energy storage assets in Alberta, Canada, as well as nine states and the district of Columbia in the United States. AltaGas Ltd. was founded in 1994 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 0J1",
        "website": "http://www.altagas.ca",
        "full_time_employees": 2984
    },
    "ALA.TO": {
        "short_name": "ALTAGAS LTD.",
        "long_name": "AltaGas Ltd.",
        "summary": "AltaGas Ltd. operates as a diversified energy infrastructure company in North America. The company operates through two segments, Utilities and Midstream. The Utilities segment owns and operates regulated natural gas distribution utilities in Michigan, Alaska, the District of Columbia, Maryland, and Virginia; and two regulated natural gas storage utilities in the United States serving approximately 1.7 million customers. This segment also provides interstate natural gas transportation and storage services. It serves homes and businesses. The Midstream segment engages in the natural gas gathering and processing; natural gas liquids (NGL) extraction and fractionation, transmission, and storage; and natural gas and NGL marketing activities. This segment owns approximately 1.5 billion cubic feet per day of natural gas capacity. The company also holds interest in a regulated pipeline in the Marcellus/Utica gas formation in the northeastern United States; and engages in LPG exports and distribution, domestic terminals, wellsite fluids and fuels, and trucking and liquids handling businesses. It serves residential, commercial, and industrial customers primarily in the Western Canada Sedimentary Basin. Additionally, the company operates two natural gas-fired plants with 577 MW of generating capacity in California and Colorado; and energy storage assets in Alberta, Canada, as well as nine states and the district of Columbia in the United States. AltaGas Ltd. was founded in 1994 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 0J1",
        "website": "http://www.altagas.ca",
        "full_time_employees": 2984
    },
    "APA.AX": {
        "short_name": "APA GROUP STAPLED",
        "long_name": "APA Group",
        "summary": "APA Group develops, owns, and operates natural gas transportation and energy infrastructure in Australia. The company operates through three segments: Energy Infrastructure, Asset Management, and Energy Investments. It operates natural gas pipelines, gas storage facilities, gas processing facilities, gas compression facilities, electricity transmission, electricity interconnectors, and renewable and gas fired power generation assets; and operates solar farms and wind farms. The company has interests in approximately 15,000 kilometers of gas transmission pipelines; approximately 29,500 kilometers of gas mains and pipelines; and 1.4 million gas consumer connections. It also provides commercial, operating, and asset maintenance services to its energy investments and third parties; and invests in unlisted entities. APA Group was founded in 2000 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.apa.com.au",
        "full_time_employees": 1900
    },
    "APAJF": {
        "short_name": "APA GROUP",
        "long_name": "APA Group",
        "summary": "APA Group develops, owns, and operates natural gas transportation and energy infrastructure in Australia. The company operates through three segments: Energy Infrastructure, Asset Management, and Energy Investments. It operates natural gas pipelines, gas storage facilities, gas processing facilities, gas compression facilities, electricity transmission, electricity interconnectors, and renewable and gas fired power generation assets; and operates solar farms and wind farms. The company has interests in approximately 15,000 kilometers of gas transmission pipelines; approximately 29,500 kilometers of gas mains and pipelines; and 1.4 million gas consumer connections. It also provides commercial, operating, and asset maintenance services to its energy investments and third parties; and invests in unlisted entities. APA Group was founded in 2000 and is headquartered in Sydney, Australia.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.apa.com.au",
        "full_time_employees": 1900
    },
    "AQ3.F": {
        "short_name": "ALTAGAS LTD",
        "long_name": "AltaGas Ltd.",
        "summary": "AltaGas Ltd. operates as a diversified energy infrastructure company in North America. The company operates through two segments, Utilities and Midstream. The Utilities segment owns and operates regulated natural gas distribution utilities in Michigan, Alaska, the District of Columbia, Maryland, and Virginia; and two regulated natural gas storage utilities in the United States serving approximately 1.7 million customers. This segment also provides interstate natural gas transportation and storage services. It serves homes and businesses. The Midstream segment engages in the natural gas gathering and processing; natural gas liquids (NGL) extraction and fractionation, transmission, and storage; and natural gas and NGL marketing activities. This segment owns approximately 1.5 billion cubic feet per day of natural gas capacity. The company also holds interest in a regulated pipeline in the Marcellus/Utica gas formation in the northeastern United States; and engages in LPG exports and distribution, domestic terminals, wellsite fluids and fuels, and trucking and liquids handling businesses. It serves residential, commercial, and industrial customers primarily in the Western Canada Sedimentary Basin. Additionally, the company operates two natural gas-fired plants with 577 MW of generating capacity in California and Colorado; and energy storage assets in Alberta, Canada, as well as nine states and the district of Columbia in the United States. AltaGas Ltd. was founded in 1994 and is headquartered in Calgary, Canada.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 0J1",
        "website": "http://www.altagas.ca",
        "full_time_employees": 2984
    },
    "ASC.MI": {
        "short_name": "ASCOPIAVE",
        "long_name": "Ascopiave S.p.A.",
        "summary": "Ascopiave S.p.A. distributes and sells natural gas in Italy. The company holds concessions and direct assurances for the supply of the service in 268 municipalities; and operates a distribution network of approximately 12,855 kilometers. It is also involved in the sale of electric power; and heat management and co-generation activities. The company is headquartered in Pieve di Soligo, Italy. Ascopiave S.p.A. is a subsidiary of Asco Holding S.p.A.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "TV",
        "city": "Pieve Di Soligo",
        "zipcode": "31053",
        "website": "http://www.gruppoascopiave.it",
        "full_time_employees": 418
    },
    "ASCOF": {
        "short_name": "ASCOPIAVE",
        "long_name": "Ascopiave S.p.A.",
        "summary": "Ascopiave S.p.A. distributes and sells natural gas in Italy. The company holds concessions and direct assurances for the supply of the service in 268 municipalities; and operates a distribution network of approximately 12,855 kilometers. It is also involved in the sale of electric power; and heat management and co-generation activities. The company is headquartered in Pieve di Soligo, Italy. Ascopiave S.p.A. is a subsidiary of Asco Holding S.p.A.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Italy",
        "state": "TV",
        "city": "Pieve Di Soligo",
        "zipcode": "31053",
        "website": "http://www.gruppoascopiave.it",
        "full_time_employees": 418
    },
    "ATGFF": {
        "short_name": "ALTAGAS LTD",
        "long_name": "AltaGas Ltd.",
        "summary": "AltaGas Ltd. operates as a diversified energy infrastructure company in North America. The company operates through two segments, Utilities and Midstream. The Utilities segment owns and operates regulated natural gas distribution utilities in Michigan, Alaska, the District of Columbia, Maryland, and Virginia; and two regulated natural gas storage utilities in the United States serving approximately 1.7 million customers. This segment also provides interstate natural gas transportation and storage services. It serves homes and businesses. The Midstream segment engages in the natural gas gathering and processing; natural gas liquids (NGL) extraction and fractionation, transmission, and storage; and natural gas and NGL marketing activities. This segment owns approximately 1.5 billion cubic feet per day of natural gas capacity. The company also holds interest in a regulated pipeline in the Marcellus/Utica gas formation in the northeastern United States; and engages in LPG exports and distribution, domestic terminals, wellsite fluids and fuels, and trucking and liquids handling businesses. It serves residential, commercial, and industrial customers primarily in the Western Canada Sedimentary Basin. Additionally, the company operates two natural gas-fired plants with 577 MW of generating capacity in California and Colorado; and energy storage assets in Alberta, Canada, as well as nine states and the district of Columbia in the United States. AltaGas Ltd. was founded in 1994 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 0J1",
        "website": "http://www.altagas.ca",
        "full_time_employees": 2984
    },
    "ATGL.NS": {
        "short_name": "ADANI TOTAL GAS LIMITED",
        "long_name": "Adani Total Gas Limited",
        "summary": "Adani Total Gas Limited distributes piped natural gas to industrial, commercial, and residential customers. The company also distributes compressed natural gas to the transportation sector; and supplies PNG to approximately 0.44 million customers through a connected pipeline network of approximately 7,600 km, including 470 km of steel and 7,130 km of polyethylene pipeline. It has gas distribution networks in Ahmedabad, Vadodara, Navsari, Porbandar, Barwala, Kheda, and Surendranagar in Gujarat; Udaipur in Rajasthan; Palwal, Mahendragarh, and Faridabad in Haryana; Khurja in Uttar Pradesh; and Bhind in Madhya Pradesh, India. As of March 31, 2020, the company had 115 CNG filling stations. The company was formerly known as Adani Gas Limited and changed its name to Adani Total Gas Limited in January 2021. Adani Total Gas Limited was founded in 2004 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "382421",
        "website": "http://www.adanigas.com",
        "full_time_employees": 425
    },
    "ATO": {
        "short_name": "Atmos Energy Corporation",
        "long_name": "Atmos Energy Corporation",
        "summary": "Atmos Energy Corporation, together with its subsidiaries, engages in the regulated natural gas distribution, and pipeline and storage businesses in the United States. It operates in two segments, Distribution, and Pipeline and Storage. The Distribution segment is involved in the regulated natural gas distribution and related sales operations in eight states. This segment distributes natural gas to approximately three million residential, commercial, public authority, and industrial customers. As of September 30, 2020, it owned 71,558 miles of underground distribution and transmission mains. The Pipeline and Storage segment engages in the pipeline and storage operations. This segment transports natural gas for third parties and manages five underground storage reservoirs in Texas; and provides ancillary services to the pipeline industry, including parking arrangements, lending, and inventory sales. As of September 30, 2020, it owned 5,684 miles of gas transmission lines. Atmos Energy Corporation was founded in 1906 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75240",
        "website": "http://www.atmosenergy.com",
        "full_time_employees": 4694
    },
    "AVA.F": {
        "short_name": "ASCOPIAVE S.P.A.  EO 1",
        "long_name": "Ascopiave S.p.A.",
        "summary": "Ascopiave S.p.A. distributes and sells natural gas in Italy. The company holds concessions and direct assurances for the supply of the service in 268 municipalities; and operates a distribution network of approximately 12,855 kilometers. It is also involved in the sale of electric power; and heat management and co-generation activities. The company is headquartered in Pieve di Soligo, Italy. Ascopiave S.p.A. is a subsidiary of Asco Holding S.p.A.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "TV",
        "city": "Pieve Di Soligo",
        "zipcode": "31053",
        "website": "http://www.gruppoascopiave.it",
        "full_time_employees": 418
    },
    "AYGAZ.IS": {
        "short_name": "AYGAZ",
        "long_name": "Aygaz A.S.",
        "summary": "Aygaz A.S., together with its subsidiaries, purchases and delivers liquid petroleum gas (LPG) to retailers for distribution to customers in Turkey. The company operates through three segments: Gas and Petroleum Products, Electricity, and Other. It also manufactures LPG cylinders, LPG tanks, valves, and other supplementary materials; and cylinder-hood sets and hoses, regulators, small cylinder gas devices, barbecues, and patio heaters. In addition, the company distributes LPG autogas, cylinder gas, and bulk gas; markets LPG-operated devices; carries out LPG marine transportation activities; sells carboy water; and trades in fuel and lubricants through its autogas stations. Further, it engages in the delivery of natural gas to customers through pipelines; and liquefied natural gas to customers through cryogenic vehicles. Additionally, it purchases, builds, rents, and operates vessels, which transport crude oil, petroleum products, liquid petroleum gas, natural gas and solid, liquid, and liquefied products; and generates, distributes, and sells electricity. It operates with total 362 MW of installed capacity with eight 265-MW hydroelectric power plants located in Karaman, Samsun, and Mersin, as well as a natural gas cycle plant of 97 MW in Kocaeli. The company provides its services through 2,383 cylinder gas dealers; and 1,718 autogas stations. Aygaz A.S. was founded in 1961 and is headquartered in Sisli, Turkey. Aygaz A.S. is a subsidiary of KoÃ§ Holding A.S.",
        "currency": "TRY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Sisli",
        "zipcode": "34394",
        "website": "http://www.aygaz.com.tr",
        "full_time_employees": 1326
    },
    "BIPC": {
        "short_name": "Brookfield Infrastructure Partn",
        "long_name": "Brookfield Infrastructure Corporation",
        "summary": "Brookfield Infrastructure Corporation, together with its subsidiaries, owns and operates regulated natural gas transmission systems in Brazil. The company also engages in the regulated gas and electricity distribution operations in the United Kingdom. It operates approximately 2,000 kilometers of natural gas transportation pipelines in the states of Rio de Janeiro, Sao Paulo, and Minas Gerais; and 3.6 million gas and electricity connections and 1.5 million installed smart meters in the United Kingdom. The company was founded in 2019 and is headquartered in New York, New York. Brookfield Infrastructure Corporation operates as a subsidiary of Brookfield Infrastructure Partners L.P.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10281-1023",
        "website": "http://bip.brookfield.com/bipc",
        "full_time_employees": null
    },
    "BIPC.TO": {
        "short_name": "BROOKFIELD INFRASTRUCTURE CORPO",
        "long_name": "Brookfield Infrastructure Corporation",
        "summary": "Brookfield Infrastructure Corporation, together with its subsidiaries, owns and operates regulated natural gas transmission systems in Brazil. The company also engages in the regulated gas and electricity distribution operations in the United Kingdom. It operates approximately 2,000 kilometers of natural gas transportation pipelines in the states of Rio de Janeiro, Sao Paulo, and Minas Gerais; and 3.6 million gas and electricity connections and 1.5 million installed smart meters in the United Kingdom. The company was founded in 2019 and is headquartered in New York, New York. Brookfield Infrastructure Corporation operates as a subsidiary of Brookfield Infrastructure Partners L.P.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10281-1023",
        "website": "http://bip.brookfield.com/bipc",
        "full_time_employees": null
    },
    "BYNN.F": {
        "short_name": "RUBIS INH. NOUV.  EO 1,25",
        "long_name": "Rubis",
        "summary": "Rubis, through its subsidiaries, engages in the operation of bulk liquid storage facilities and distribution of petroleum products in Europe, Africa, and the Caribbean. It operates terminals that provide bulk liquid storage facilities for petroleum products, chemical products, fertilizers, molasses, and edible oils; and distributes liquefied petroleum gas and petroleum products, such as butane, propane, gasoline, diesel, kerosene, fuel oil, etc. The company also provides infrastructure, transportation, supply, and services for supporting the development of downstream distribution and marketing business. It serves hypermarkets; oil companies, and chemical and petrochemical groups; and traders and wholesalers. The company was founded in 1990 and is headquartered in Paris, France.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75116",
        "website": "http://www.rubis.fr",
        "full_time_employees": 3684
    },
    "CEGR3.SA": {
        "short_name": "CEG         ON",
        "long_name": "Companhia Distribuidora de Gás do Rio de Janeiro - CEG",
        "summary": "Companhia Distribuidora de GÃ¡s do Rio de Janeiro - CEG engages in the distribution of natural gas and its byproducts in Brazil. The company operates through Residential, Commercial, Industrial, Thermoelectric, Automotive, and Construction segments. It offers piped gas, compressed natural gas, and natural gas vehicles, as well as equipment related to heaters and accessories. The company also provides construction, distribution, and maintenance services. It serves residential, commercial, and industrial customers in Rio de Janeiro, Belford Roxo, Duque de Caxias, Guapimirim, ItaboraÃ­, ItaguaÃ­, Japeri, MagÃ©, Mangaratiba, MaricÃ¡, NilÃ³polis, NiterÃ³i, Nova IguaÃ§u, Paracambi, Queimados, SÃ£o GonÃ§alo, TanguÃ¡, SeropÃ©dica, and SÃ£o JoÃ£o de Meriti. The company was formerly known as Companhia Estadual de GÃ¡s and changed its name to Companhia Distribuidora de GÃ¡s do Rio de Janeiro - CEG in 1998. The company was founded in 1854 and is headquartered in Rio de Janeiro, Brazil. Companhia Distribuidora de GÃ¡s do Rio de Janeiro - CEG is a subsidiary of Gas Natural Fenosa.",
        "currency": "BRL",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": "RJ",
        "city": "Rio de Janeiro",
        "zipcode": "20941-070",
        "website": "http://www.gasnaturalfenosa.com.br/br/1285084459415/rio+de+janeiro.html",
        "full_time_employees": 361
    },
    "CFY.V": {
        "short_name": "CF ENERGY CORP",
        "long_name": "CF Energy Corp.",
        "summary": "CF Energy Corp. operates as an integrated energy provider and natural gas distribution company in the People's Republic of China. The company operates through four segments: Pipeline Natural Gas Sales and Liquefied Natural Gas Supply Distribution Sales; Vehicle Refueling; Natural Gas Direct Transmission; and Renewable and Smart Energy/Integrated Smart Energy. The company distributes pipeline natural gas to users in the ceramic industry base of Xiangdong district, Pingxiang City, Jiangxi province; and operates two refueling stations in Sanya and Changsha, which provide refueling services for vehicles, such as household cars, taxicabs, buses, and trucks. It also transports natural gas via its 2.0 kilometers of pipeline; and develops the Haitang Bay Integrated Smart Energy and the Meishan integrated district energy distribution projects. The company was formerly known as Changfeng Energy Inc. and changed its name to CF Energy Corp. in April 2019. CF Energy Corp. was founded in 1995 and is based in Markham, Canada.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Markham",
        "zipcode": "L3R 8T3",
        "website": "http://www.cfenergy.com",
        "full_time_employees": null
    },
    "CGAS3.SA": {
        "short_name": "COMGAS      ON",
        "long_name": "Companhia de Gás de São Paulo - COMGÁS",
        "summary": "Companhia de GÃ¡s de SÃ£o Paulo Â\u0096 COMGÃ\u0081S distributes piped natural gas in the state of SÃ£o Paulo, Brazil. The company provides natural gas for approximately 1.5 million customers in the residential, commercial, and industrial segments through a network of approximately 8,000 kilometers of pipelines. Its concession area covers 177 municipalities in the SÃ£o Paulo and Campinas metropolitan regions, and the Santos and ParaÃ­ba Valley regions. The company was formerly known as Companhia Municipal de GÃ¡s (ComgÃ¡s) and changed its name to Companhia de GÃ¡s de SÃ£o Paulo - COMGÃ\u0081S in 1974. The company was founded in 1872 and is based in SÃ£o Paulo, Brazil. Companhia de GÃ¡s de SÃ£o Paulo Â\u0096 COMGÃ\u0081S is a subsidiary of Cosan S.A. IndÃºstria e ComÃ©rcio.",
        "currency": "BRL",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": "SP",
        "city": "SÃ£o Paulo",
        "zipcode": "04538-132",
        "website": "http://www.comgas.com.br",
        "full_time_employees": 1214
    },
    "CGAS5.SA": {
        "short_name": "COMGAS      PNA",
        "long_name": "Companhia de Gás de São Paulo - COMGÁS",
        "summary": "Companhia de GÃ¡s de SÃ£o Paulo Â\u0096 COMGÃ\u0081S distributes piped natural gas in the state of SÃ£o Paulo, Brazil. The company provides natural gas for approximately 1.5 million customers in the residential, commercial, and industrial segments through a network of approximately 8,000 kilometers of pipelines. Its concession area covers 177 municipalities in the SÃ£o Paulo and Campinas metropolitan regions, and the Santos and ParaÃ­ba Valley regions. The company was formerly known as Companhia Municipal de GÃ¡s (ComgÃ¡s) and changed its name to Companhia de GÃ¡s de SÃ£o Paulo - COMGÃ\u0081S in 1974. The company was founded in 1872 and is based in SÃ£o Paulo, Brazil. Companhia de GÃ¡s de SÃ£o Paulo Â\u0096 COMGÃ\u0081S is a subsidiary of Cosan S.A. IndÃºstria e ComÃ©rcio.",
        "currency": "BRL",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": "SP",
        "city": "SÃ£o Paulo",
        "zipcode": "04538-132",
        "website": "http://www.comgas.com.br",
        "full_time_employees": 1214
    },
    "CGASY": {
        "short_name": "CHINA RESOURCES GAS GROUP LTD.",
        "long_name": "China Resources Gas Group Limited",
        "summary": "China Resources Gas Group Limited, an investment holding company, engages in the sale of liquefied gas and connection of gas pipelines. It operates through Sale and Distribution of Gas Fuel and Related Products, Gas Connection, Sale of Gas Appliances, Design and Construction Services, and Gas Stations segments. The Sale and Distribution of Gas Fuel and Related Products segment sells natural gas and liquefied petroleum gas for residential, commercial, and industrial use. The Gas Connection segment constructs gas pipeline networks under gas connection contracts. The Sale of Gas Appliances segment sells gas appliances and related products. The Design and Construction Services segment provides design, construction, consultancy, and management services for gas connection projects. The Gas Stations segment sells gas fuel in natural gas filling stations. As of December 31, 2020, it operated 257 city gas projects in 22 provinces in the People's Republic of China. The company is headquartered in Wan Chai, Hong Kong. China Resources Gas Group Limited is a subsidiary of China Resources (Holdings) Company Limited.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.crcgas.com",
        "full_time_employees": 48205
    },
    "CGHLY": {
        "short_name": "CHINA GAS HOLDINGS",
        "long_name": "China Gas Holdings Limited",
        "summary": "China Gas Holdings Limited, an investment holding company, operates as a gas operator and service provider in the People's Republic of China and Hong Kong. The company invests in, constructs, operates, and maintains city and town gas pipeline infrastructure facilities, gas terminals, storage and transportation facilities, and gas logistics systems; transmits natural gas and liquefied petroleum gas (LPG) to residential, industrial, and commercial customers; constructs and operates compressed natural gas/liquefied natural gas refilling stations; and develops and applies technologies related to natural gas and LPG. It is also involved in the investment in petrochemical facilities of storage and transportation, and fundamental facilities of pier; producing and storing LPG and chemical products, as well as propane and butane; CBM business; exploration and production of coal bed methane; and gas station construction, management, and consultancy services. In addition, the company offers treasury, management, consultancy, goods transportation and agency, technical advisory, and procurement services; and smart home products and gas insurance agency services, as well as wall-mounted gas heaters and kitchen appliances under the Gasbo brand. Further, it is involved in the development and investment in clean energy; wholesale and trading of natural gas and liquefied natural gas; sale of electricity; purchase and sale of gas; and sale of gas meters, pressure regulators, corrugated pipes, gas alarms, and bottled water. Additionally, the company engages in the research, development, wholesale, retail, installation, and maintenance of household equipment, electric appliances, and kitchen appliances. As of March 31, 2020, it served 14,678 industrial and 233,687 commercial customers; 35,105,524 residential customers; and operates 556 CNG/LNG refilling stations for vehicles and vessels. The company was incorporated in 1995 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.chinagasholdings.com.hk",
        "full_time_employees": 59462
    },
    "CGHOF": {
        "short_name": "CHINA GAS HOLDINGS",
        "long_name": "China Gas Holdings Limited",
        "summary": "China Gas Holdings Limited, an investment holding company, operates as a gas operator and service provider in the People's Republic of China and Hong Kong. The company invests in, constructs, operates, and maintains city and town gas pipeline infrastructure facilities, gas terminals, storage and transportation facilities, and gas logistics systems; transmits natural gas and liquefied petroleum gas (LPG) to residential, industrial, and commercial customers; constructs and operates compressed natural gas/liquefied natural gas refilling stations; and develops and applies technologies related to natural gas and LPG. It is also involved in the investment in petrochemical facilities of storage and transportation, and fundamental facilities of pier; producing and storing LPG and chemical products, as well as propane and butane; CBM business; exploration and production of coal bed methane; and gas station construction, management, and consultancy services. In addition, the company offers treasury, management, consultancy, goods transportation and agency, technical advisory, and procurement services; and smart home products and gas insurance agency services, as well as wall-mounted gas heaters and kitchen appliances under the Gasbo brand. Further, it is involved in the development and investment in clean energy; wholesale and trading of natural gas and liquefied natural gas; sale of electricity; purchase and sale of gas; and sale of gas meters, pressure regulators, corrugated pipes, gas alarms, and bottled water. Additionally, the company engages in the research, development, wholesale, retail, installation, and maintenance of household equipment, electric appliances, and kitchen appliances. As of March 31, 2020, it served 14,678 industrial and 233,687 commercial customers; 35,105,524 residential customers; and operates 556 CNG/LNG refilling stations for vehicles and vessels. The company was incorporated in 1995 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.chinagasholdings.com.hk",
        "full_time_employees": 59462
    },
    "CGPA2.BA": {
        "short_name": "CAMUZZI GAS PAMPEA",
        "long_name": "Camuzzi Gas Pampeana S.A.",
        "summary": "Camuzzi Gas Pampeana S.A. distributes natural gas in Argentina. It serves approximately 2 million families, businesses, and manufacturing plants through approximately 50,000 kilometer of gas transport pipeline and distribution network systems in the Buenos Aires, La Pampa, NeuquÃ©n, Chubut, RÃ­o Negro, Santa Cruz, and Tierra del Fuego provinces. The company is based in Buenos Aires, Argentina.",
        "currency": "ARS",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "Argentina",
        "state": null,
        "city": "Buenos Aires",
        "zipcode": "1107",
        "website": "http://www.camuzzigas.com",
        "full_time_employees": 930
    },
    "CH5.F": {
        "short_name": "CHESAPEAKE UTIL. DL-,4867",
        "long_name": "Chesapeake Utilities Corporation",
        "summary": "Chesapeake Utilities Corporation operates as an energy delivery company. The Regulated Energy segment engages in the natural gas distribution operations in central and southern Delaware, Maryland's eastern shore, and Florida; regulated natural gas transmission in the Delmarva Peninsula and Florida; and regulated electric distribution in northeast and northwest Florida. The Unregulated Energy segment engages in the propane operations in the Mid-Atlantic region and Florida; unregulated natural gas transmission/supply operation in central and eastern Ohio; generation of electricity and steam; and provision of compressed natural gas, liquefied natural gas, and renewable natural gas transportation and pipeline solutions primarily to utilities and pipelines in the eastern United States. This segment also provides other unregulated energy services, such as energy-related merchandise sales; heating, ventilation, and air conditioning services; and plumbing and electrical services. The company was founded in 1859 and is headquartered in Dover, Delaware.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "DE",
        "city": "Dover",
        "zipcode": "19904",
        "website": "http://www.chpk.com",
        "full_time_employees": 947
    },
    "CHNGQ": {
        "short_name": "CHINA NATURAL GAS INC",
        "long_name": "China Natural Gas, Inc.",
        "summary": "China Natural Gas, Inc., an integrated natural gas operator, engages in the sale and distribution of natural gas and gasoline to commercial, industrial, and residential customers in the People's Republic of China. The company is primarily involved in the distribution of compressed natural gas (CNG) through its variable interest entity-owned CNG fueling stations. As of December 31, 2012, it operated 31 CNG fueling stations, including 20 CNG fueling stations in Shaanxi Province, 10 CNG fueling stations in Henan Province, and 1 CNG fueling station in Hubei Province. It also installs natural gas pipelines, as well as distributes and sells piped natural gas to residential and commercial customers through a high pressure pipeline network of approximately 120 kilometers in the city of Xi'an in Shaanxi Province, including Lantian County; the districts of Lintong and Baqiao in Shaanxi Province; and the city of Lingbao in Henan Province. As of the above date, the company had approximately 122,020 residential and commercial customers for its pipeline network, as well as operated 4 automobile conversion sites for converting gasoline-fueled vehicles to hybrid (natural gas/gasoline) powered vehicles. The company is based in Xi'an, the People's Republic of China. On July 2, 2014, the involuntary petition of China Natural Gas, Inc. for reorganization under Chapter 11 was converted to Chapter 7. The involuntary petition was filed under Chapter 11 on February 8, 2013.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Xiâ\u0080\u0099an",
        "zipcode": "710065",
        "website": null,
        "full_time_employees": 1056
    },
    "CNER": {
        "short_name": "CHINA NEW ENERGY GROUP COMPANY",
        "long_name": "China New Energy Group Co.",
        "summary": "China New Energy Group Company, a natural gas company, engages in the development, construction, and operation of natural gas distribution networks. It also distributes natural gas to residential, industrial, and commercial customers in small and medium sized cities in China. The company owns the rights to develop distribution networks to provide natural gas in the cities of Dashiqiao, Nandaihe, Zhanhua, and Wuyuan. Its distribution networks provide natural gas to an aggregate of approximately 64,000 consumers. The company is headquartered in Tianjin, China.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300042",
        "website": null,
        "full_time_employees": 130
    },
    "CNIG": {
        "short_name": "CORNING NATURAL GAS HOLDING COR",
        "long_name": "Corning Natural Gas Holding Corporation",
        "summary": "Corning Natural Gas Holding Corporation, through its subsidiaries, distributes natural gas and electricity. The company offers natural gas to approximately 15,000 customers through approximately 425 miles of distribution main and 86 regulating stations; and electricity to approximately 4,800 customers through approximately 160 miles of electric distribution wire and poles, and 19 miles of gas distribution pipe. It also owns 4 gate stations and approximately 16 miles of pipe in Susquehanna and Bradford Counties, Pennsylvania. The company serves residential, commercial, industrial, and municipal customers in the Corning, Hammondsport, and Virgil areas, as well as in Pike county; and distributes to 2 other gas utilities that serve the Elmira and Bath areas of New York. The company was founded in 1904 and is headquartered in Corning, New York.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Corning",
        "zipcode": "14830",
        "website": "http://www.corninggas.com",
        "full_time_employees": 72
    },
    "CNIGO": {
        "short_name": "CORNING NATURAL GAS HOLDING COR",
        "long_name": "Corning Natural Gas Holding Corporation",
        "summary": "Corning Natural Gas Holding Corporation, through its subsidiaries, distributes natural gas and electricity. The company offers natural gas to approximately 15,000 customers through approximately 425 miles of distribution main and 86 regulating stations; and electricity to approximately 4,800 customers through approximately 160 miles of electric distribution wire and poles, and 19 miles of gas distribution pipe. It also owns 4 gate stations and approximately 16 miles of pipe in Susquehanna and Bradford Counties, Pennsylvania. The company serves residential, commercial, industrial, and municipal customers in the Corning, Hammondsport, and Virgil areas, as well as in Pike county; and distributes to 2 other gas utilities that serve the Elmira and Bath areas of New York. The company was founded in 1904 and is headquartered in Corning, New York.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Corning",
        "zipcode": "14830",
        "website": "http://www.corninggas.com",
        "full_time_employees": 72
    },
    "CNIGP": {
        "short_name": "CORNING NATURAL GAS HOLDING COR",
        "long_name": "Corning Natural Gas Holding Corporation",
        "summary": "Corning Natural Gas Holding Corporation, through its subsidiaries, distributes natural gas and electricity. The company offers natural gas to approximately 15,000 customers through approximately 425 miles of distribution main and 86 regulating stations; and electricity to approximately 4,800 customers through approximately 160 miles of electric distribution wire and poles, and 19 miles of gas distribution pipe. It also owns 4 gate stations and approximately 16 miles of pipe in Susquehanna and Bradford Counties, Pennsylvania. The company serves residential, commercial, industrial, and municipal customers in the Corning, Hammondsport, and Virgil areas, as well as in Pike county; and distributes to 2 other gas utilities that serve the Elmira and Bath areas of New York. The company was founded in 1904 and is headquartered in Corning, New York.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Corning",
        "zipcode": "14830",
        "website": "http://www.corninggas.com",
        "full_time_employees": 72
    },
    "CPK": {
        "short_name": "Chesapeake Utilities Corporatio",
        "long_name": "Chesapeake Utilities Corporation",
        "summary": "Chesapeake Utilities Corporation operates as an energy delivery company. The Regulated Energy segment engages in the natural gas distribution operations in central and southern Delaware, Maryland's eastern shore, and Florida; regulated natural gas transmission in the Delmarva Peninsula and Florida; and regulated electric distribution in northeast and northwest Florida. The Unregulated Energy segment engages in the propane operations in the Mid-Atlantic region and Florida; unregulated natural gas transmission/supply operation in central and eastern Ohio; generation of electricity and steam; and provision of compressed natural gas, liquefied natural gas, and renewable natural gas transportation and pipeline solutions primarily to utilities and pipelines in the eastern United States. This segment also provides other unregulated energy services, such as energy-related merchandise sales; heating, ventilation, and air conditioning services; and plumbing and electrical services. The company was founded in 1859 and is headquartered in Dover, Delaware.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "DE",
        "city": "Dover",
        "zipcode": "19904",
        "website": "http://www.chpk.com",
        "full_time_employees": 947
    },
    "CRGGF": {
        "short_name": "CHINA RESOURCES GAS GROUP LTD.",
        "long_name": "China Resources Gas Group Limited",
        "summary": "China Resources Gas Group Limited, an investment holding company, engages in the sale of liquefied gas and connection of gas pipelines. It operates through Sale and Distribution of Gas Fuel and Related Products, Gas Connection, Sale of Gas Appliances, Design and Construction Services, and Gas Stations segments. The Sale and Distribution of Gas Fuel and Related Products segment sells natural gas and liquefied petroleum gas for residential, commercial, and industrial use. The Gas Connection segment constructs gas pipeline networks under gas connection contracts. The Sale of Gas Appliances segment sells gas appliances and related products. The Design and Construction Services segment provides design, construction, consultancy, and management services for gas connection projects. The Gas Stations segment sells gas fuel in natural gas filling stations. As of December 31, 2020, it operated 257 city gas projects in 22 provinces in the People's Republic of China. The company is headquartered in Wan Chai, Hong Kong. China Resources Gas Group Limited is a subsidiary of China Resources (Holdings) Company Limited.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.crcgas.com",
        "full_time_employees": 48205
    },
    "DGCU2.BA": {
        "short_name": "DISTRIB GAS CUYANA",
        "long_name": "Distribuidora de Gas Cuyana S.A.",
        "summary": "Distribuidora de Gas Cuyana S.A. distributes natural gas in the CÃ³rdoba, Mendoza, La Rioja, San Luis, Catamarca, and San Juan provinces of Argentina. It serves approximately 1,283,095 customers, including residential and commercial customers in 268 locations through a distribution network of 30,939 km. The company was founded in 1992 and is based in Buenos Aires, Argentina.",
        "currency": "ARS",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "Argentina",
        "state": null,
        "city": "Mendoza",
        "zipcode": null,
        "website": "http://www.ecogas.com.ar",
        "full_time_employees": null
    },
    "EBZ.F": {
        "short_name": "CHINA GAS HLDGS  HD-,01",
        "long_name": "China Gas Holdings Limited",
        "summary": "China Gas Holdings Limited, an investment holding company, operates as a gas operator and service provider in the People's Republic of China and Hong Kong. The company invests in, constructs, operates, and maintains city and town gas pipeline infrastructure facilities, gas terminals, storage and transportation facilities, and gas logistics systems; transmits natural gas and liquefied petroleum gas (LPG) to residential, industrial, and commercial customers; constructs and operates compressed natural gas/liquefied natural gas refilling stations; and develops and applies technologies related to natural gas and LPG. It is also involved in the investment in petrochemical facilities of storage and transportation, and fundamental facilities of pier; producing and storing LPG and chemical products, as well as propane and butane; CBM business; exploration and production of coal bed methane; and gas station construction, management, and consultancy services. In addition, the company offers treasury, management, consultancy, goods transportation and agency, technical advisory, and procurement services; and smart home products and gas insurance agency services, as well as wall-mounted gas heaters and kitchen appliances under the Gasbo brand. Further, it is involved in the development and investment in clean energy; wholesale and trading of natural gas and liquefied natural gas; sale of electricity; purchase and sale of gas; and sale of gas meters, pressure regulators, corrugated pipes, gas alarms, and bottled water. Additionally, the company engages in the research, development, wholesale, retail, installation, and maintenance of household equipment, electric appliances, and kitchen appliances. As of March 31, 2020, it served 14,678 industrial and 233,687 commercial customers; 35,105,524 residential customers; and operates 556 CNG/LNG refilling stations for vehicles and vessels. The company was incorporated in 1995 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.chinagasholdings.com.hk",
        "full_time_employees": 59462
    },
    "EG4.F": {
        "short_name": "ENAGAS INH.  EO 1,50",
        "long_name": "Enagás, S.A.",
        "summary": "EnagÃ¡s, S.A. engages in the development, operation, and maintenance of gas infrastructures in Spain, Mexico, Chile, Peru, Albania, Greece, Italy, and the United States. It operates through Gas transmission, Regasification, and Storage of Gas segments. The company provides gas transmission services through primary and secondary transmission pipelines; natural gas regasification services; and operates underground storage facilities. It is also involved in the operation and technical management of the basic network and secondary transportation network for natural gas. In addition, the company engages in the financial management activities; development of industrial projects and activities relating to LNG terminals, and hydrogen production and transport infrastructures; development and implementation of facilities for the supply of natural gas as fuel for vehicles, including its design, construction, and maintenance; and provision of commercial services for the purpose of enhancing the daily operational management of gas shippers. Further, it is involved in the development and integrated management of energy projects for the production of renewable gases from organic matter; development of projects to promote the role of renewable gases in the energy transition; and production of solar electric energy. The company operates approximately 12,000 kilometers of gas pipelines, 20 compressor stations, and 6 international connections. EnagÃ¡s, S.A. was founded in 1972 and is headquartered in Madrid, Spain.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Spain",
        "state": null,
        "city": "Madrid",
        "zipcode": "28005",
        "website": "http://www.enagas.es",
        "full_time_employees": 1357
    },
    "EG40.F": {
        "short_name": "ENAGAS A.A. ADR1/2/EO1,50",
        "long_name": "Enagás, S.A.",
        "summary": "EnagÃ¡s, S.A. engages in the development, operation, and maintenance of gas infrastructures in Spain, Mexico, Chile, Peru, Albania, Greece, Italy, and the United States. It operates through Gas transmission, Regasification, and Storage of Gas segments. The company provides gas transmission services through primary and secondary transmission pipelines; natural gas regasification services; and operates underground storage facilities. It is also involved in the operation and technical management of the basic network and secondary transportation network for natural gas. In addition, the company engages in the financial management activities; development of industrial projects and activities relating to LNG terminals, and hydrogen production and transport infrastructures; development and implementation of facilities for the supply of natural gas as fuel for vehicles, including its design, construction, and maintenance; and provision of commercial services for the purpose of enhancing the daily operational management of gas shippers. Further, it is involved in the development and integrated management of energy projects for the production of renewable gases from organic matter; development of projects to promote the role of renewable gases in the energy transition; and production of solar electric energy. The company operates approximately 12,000 kilometers of gas pipelines, 20 compressor stations, and 6 international connections. EnagÃ¡s, S.A. was founded in 1972 and is headquartered in Madrid, Spain.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Spain",
        "state": null,
        "city": "Madrid",
        "zipcode": "28005",
        "website": "http://www.enagas.es",
        "full_time_employees": 1357
    },
    "ENG.MC": {
        "short_name": "ENAGAS,S.A.",
        "long_name": "Enagás, S.A.",
        "summary": "EnagÃ¡s, S.A. engages in the development, operation, and maintenance of gas infrastructures in Spain, Mexico, Chile, Peru, Albania, Greece, Italy, and the United States. It operates through Gas transmission, Regasification, and Storage of Gas segments. The company provides gas transmission services through primary and secondary transmission pipelines; natural gas regasification services; and operates underground storage facilities. It is also involved in the operation and technical management of the basic network and secondary transportation network for natural gas. In addition, the company engages in the financial management activities; development of industrial projects and activities relating to LNG terminals, and hydrogen production and transport infrastructures; development and implementation of facilities for the supply of natural gas as fuel for vehicles, including its design, construction, and maintenance; and provision of commercial services for the purpose of enhancing the daily operational management of gas shippers. Further, it is involved in the development and integrated management of energy projects for the production of renewable gases from organic matter; development of projects to promote the role of renewable gases in the energy transition; and production of solar electric energy. The company operates approximately 12,000 kilometers of gas pipelines, 20 compressor stations, and 6 international connections. EnagÃ¡s, S.A. was founded in 1972 and is headquartered in Madrid, Spain.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "MCE",
        "market": "es_market",
        "country": "Spain",
        "state": null,
        "city": "Madrid",
        "zipcode": "28005",
        "website": "http://www.enagas.es",
        "full_time_employees": 1357
    },
    "ENG.VI": {
        "short_name": "ENAGAS SA",
        "long_name": "Enagás, S.A.",
        "summary": "EnagÃ¡s, S.A. engages in the development, operation, and maintenance of gas infrastructures in Spain, Mexico, Chile, Peru, Albania, Greece, Italy, and the United States. It operates through Gas transmission, Regasification, and Storage of Gas segments. The company provides gas transmission services through primary and secondary transmission pipelines; natural gas regasification services; and operates underground storage facilities. It is also involved in the operation and technical management of the basic network and secondary transportation network for natural gas. In addition, the company engages in the financial management activities; development of industrial projects and activities relating to LNG terminals, and hydrogen production and transport infrastructures; development and implementation of facilities for the supply of natural gas as fuel for vehicles, including its design, construction, and maintenance; and provision of commercial services for the purpose of enhancing the daily operational management of gas shippers. Further, it is involved in the development and integrated management of energy projects for the production of renewable gases from organic matter; development of projects to promote the role of renewable gases in the energy transition; and production of solar electric energy. The company operates approximately 12,000 kilometers of gas pipelines, 20 compressor stations, and 6 international connections. EnagÃ¡s, S.A. was founded in 1972 and is headquartered in Madrid, Spain.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Spain",
        "state": null,
        "city": "Madrid",
        "zipcode": "28005",
        "website": "http://www.enagas.es",
        "full_time_employees": 1357
    },
    "ENGGF": {
        "short_name": "ENAGAS SA",
        "long_name": "Enagás, S.A.",
        "summary": "EnagÃ¡s, S.A. engages in the development, operation, and maintenance of gas infrastructures in Spain, Mexico, Chile, Peru, Albania, Greece, Italy, and the United States. It operates through Gas transmission, Regasification, and Storage of Gas segments. The company provides gas transmission services through primary and secondary transmission pipelines; natural gas regasification services; and operates underground storage facilities. It is also involved in the operation and technical management of the basic network and secondary transportation network for natural gas. In addition, the company engages in the financial management activities; development of industrial projects and activities relating to LNG terminals, and hydrogen production and transport infrastructures; development and implementation of facilities for the supply of natural gas as fuel for vehicles, including its design, construction, and maintenance; and provision of commercial services for the purpose of enhancing the daily operational management of gas shippers. Further, it is involved in the development and integrated management of energy projects for the production of renewable gases from organic matter; development of projects to promote the role of renewable gases in the energy transition; and production of solar electric energy. The company operates approximately 12,000 kilometers of gas pipelines, 20 compressor stations, and 6 international connections. EnagÃ¡s, S.A. was founded in 1972 and is headquartered in Madrid, Spain.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Spain",
        "state": null,
        "city": "Madrid",
        "zipcode": "28005",
        "website": "http://www.enagas.es",
        "full_time_employees": 1357
    },
    "ENGGY": {
        "short_name": "ENAGAS SA",
        "long_name": "Enagás, S.A.",
        "summary": "EnagÃ¡s, S.A. engages in the development, operation, and maintenance of gas infrastructures in Spain, Mexico, Chile, Peru, Albania, Greece, Italy, and the United States. It operates through Gas transmission, Regasification, and Storage of Gas segments. The company provides gas transmission services through primary and secondary transmission pipelines; natural gas regasification services; and operates underground storage facilities. It is also involved in the operation and technical management of the basic network and secondary transportation network for natural gas. In addition, the company engages in the financial management activities; development of industrial projects and activities relating to LNG terminals, and hydrogen production and transport infrastructures; development and implementation of facilities for the supply of natural gas as fuel for vehicles, including its design, construction, and maintenance; and provision of commercial services for the purpose of enhancing the daily operational management of gas shippers. Further, it is involved in the development and integrated management of energy projects for the production of renewable gases from organic matter; development of projects to promote the role of renewable gases in the energy transition; and production of solar electric energy. The company operates approximately 12,000 kilometers of gas pipelines, 20 compressor stations, and 6 international connections. EnagÃ¡s, S.A. was founded in 1972 and is headquartered in Madrid, Spain.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Spain",
        "state": null,
        "city": "Madrid",
        "zipcode": "28005",
        "website": "http://www.enagas.es",
        "full_time_employees": 1357
    },
    "FCRM.L": {
        "short_name": "FULCRUM UTILITY SERVICES LD ORD",
        "long_name": "Fulcrum Utility Services Limited",
        "summary": "Fulcrum Utility Services Limited provides multi-utility infrastructure and related services in the United Kingdom. The company operates through two segments, Infrastructure: Design and Build, and Utility assets: Own and Operate. It designs and builds gas and electricity connections for housing, and industrial and commercial developments; and EV charging, gas, and electricity distribution infrastructures. The company also offers meter exchange and meter ownership services, as well as smart meter exchange programs and utility infrastructure asset services. In addition, it provides renewable electrical connections; and engages in the maintenance of electrical systems and renewable energy generating infrastructure. Further, the company offers gas transportation services. Fulcrum Utility Services Limited was incorporated in 2008 and is headquartered in Sheffield, the United Kingdom.",
        "currency": "GBp",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Sheffield",
        "zipcode": "S9 1XH",
        "website": "http://investors.fulcrum.co.uk",
        "full_time_employees": 294
    },
    "GAIL.NS": {
        "short_name": "GAIL INDIA LTD",
        "long_name": "GAIL (India) Limited",
        "summary": "GAIL (India) Limited operates as a natural gas processing and distribution company in India and internationally. The company operates through Transmission Services, Natural Gas Marketing, Petrochemicals, LPG and Other Liquid Hydrocarbons, and Other segments. It is involved in the transmission, distribution, and marketing of natural gas to the power, city gas distribution, fertilizer, and other sectors. The company also sources, markets, and trades in liquefied natural gas (LNG); markets liquefied petroleum gas (LPG), propane, pentane, naphtha, mixed fuel oil, propylene, and hydrogenated C4 mix; and manufactures petrochemicals, such as high density polyethylene and linear low density polyethylene under the brand names of G-Lex and G-Lene. In addition, it operates a network of compressed natural gas stations; and provides piped natural gas to domestic, commercial, and industrial applications, as well as has interests in 11 exploration and production blocks located in Assam-Arakan, Cambay, Cauvery, Gujarat Kutch, and Myanmar basins covering an area of 2,170 square kilometers. Further, the company offers telecommunication services through GAILTEL; and generates, transmits, and distributes electric power through 118 MW wind power plant and 12.3 MW solar power plant. Additionally, it engages in the charter hiring of LNG vessels. The company owns and operates approximately 12,426 km of natural gas pipelines; 2,038 km LPG pipeline transmission network; and five gas processing plants for production of LPG, propane, pentane, naphtha, etc. GAIL (India) Limited was founded in 1984 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110066",
        "website": "http://www.gailonline.com",
        "full_time_employees": 4682
    },
    "GAILF": {
        "short_name": "GAIL (INDIA) LIMITED",
        "long_name": "GAIL (India) Limited",
        "summary": "GAIL (India) Limited operates as a natural gas processing and distribution company in India and internationally. The company operates through Transmission Services, Natural Gas Marketing, Petrochemicals, LPG and Other Liquid Hydrocarbons, and Other segments. It is involved in the transmission, distribution, and marketing of natural gas to the power, city gas distribution, fertilizer, and other sectors. The company also sources, markets, and trades in liquefied natural gas (LNG); markets liquefied petroleum gas (LPG), propane, pentane, naphtha, mixed fuel oil, propylene, and hydrogenated C4 mix; and manufactures petrochemicals, such as high density polyethylene and linear low density polyethylene under the brand names of G-Lex and G-Lene. In addition, it operates a network of compressed natural gas stations; and provides piped natural gas to domestic, commercial, and industrial applications, as well as has interests in 11 exploration and production blocks located in Assam-Arakan, Cambay, Cauvery, Gujarat Kutch, and Myanmar basins covering an area of 2,170 square kilometers. Further, the company offers telecommunication services through GAILTEL; and generates, transmits, and distributes electric power through 118 MW wind power plant and 12.3 MW solar power plant. Additionally, it engages in the charter hiring of LNG vessels. The company owns and operates approximately 12,426 km of natural gas pipelines; 2,038 km LPG pipeline transmission network; and five gas processing plants for production of LPG, propane, pentane, naphtha, etc. GAIL (India) Limited was founded in 1984 and is based in New Delhi, India.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110066",
        "website": "http://www.gailonline.com",
        "full_time_employees": 4682
    },
    "GAN.F": {
        "short_name": "NATURGY ENERGY  INH. EO 1",
        "long_name": "Naturgy Energy Group, S.A.",
        "summary": "Naturgy Energy Group, S.A., together with its subsidiaries, engages in the supply, liquefaction, regasification, transport, storage, distribution, and sale of natural gas in Spain and internationally. The company operates through Energy and Network Management, Renewables and New Business, and Marketing segments. The Energy and Network Management segment engages in the regulated gas and electricity distribution business in Spain; distribution of gas and electricity in Argentina; distributes gas in Brazil and Mexico; and distribution of electricity in Panama. This segment is also involved in the sale of liquefied natural gas and the sea transport business; providing supply management and sales services for customers, as well as the UniÃ³n Fenosa Gas and other gas infrastructures activities; management of the Maghreb Â\u0096 Europe and Medgaz gas pipelines; and generation of thermal electricity in Spain and Latin America. The Renewables and New Business segment engages in the generation and sale of electricity through wind, mini-hydro, solar, and cogeneration in Spain; and generation and sale of electricity in Latin America and Australia. The Marketing segment engages in managing gas, electricity, and services for end customers. The company was formerly known as Gas Natural SDG, S.A. and changed its name to Naturgy Energy Group, S.A. in June 2018. Naturgy Energy Group, S.A. was incorporated in 1843 and is based in Madrid, Spain.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Spain",
        "state": null,
        "city": "Humanes de Madrid",
        "zipcode": "28033",
        "website": "http://www.naturgy.com",
        "full_time_employees": 8372
    },
    "GANA.F": {
        "short_name": "NATURGY ENERGY ADR1/5/E01",
        "long_name": "Naturgy Energy Group, S.A.",
        "summary": "Naturgy Energy Group, S.A., together with its subsidiaries, engages in the supply, liquefaction, regasification, transport, storage, distribution, and sale of natural gas in Spain and internationally. The company operates through Energy and Network Management, Renewables and New Business, and Marketing segments. The Energy and Network Management segment engages in the regulated gas and electricity distribution business in Spain; distribution of gas and electricity in Argentina; distributes gas in Brazil and Mexico; and distribution of electricity in Panama. This segment is also involved in the sale of liquefied natural gas and the sea transport business; providing supply management and sales services for customers, as well as the UniÃ³n Fenosa Gas and other gas infrastructures activities; management of the Maghreb Â\u0096 Europe and Medgaz gas pipelines; and generation of thermal electricity in Spain and Latin America. The Renewables and New Business segment engages in the generation and sale of electricity through wind, mini-hydro, solar, and cogeneration in Spain; and generation and sale of electricity in Latin America and Australia. The Marketing segment engages in managing gas, electricity, and services for end customers. The company was formerly known as Gas Natural SDG, S.A. and changed its name to Naturgy Energy Group, S.A. in June 2018. Naturgy Energy Group, S.A. was incorporated in 1843 and is based in Madrid, Spain.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Spain",
        "state": null,
        "city": "Humanes de Madrid",
        "zipcode": "28033",
        "website": "http://www.naturgy.com",
        "full_time_employees": 8372
    },
    "GAS.VI": {
        "short_name": "GAS NATURAL SDG SA",
        "long_name": "Naturgy Energy Group, S.A.",
        "summary": "Naturgy Energy Group, S.A., together with its subsidiaries, engages in the supply, liquefaction, regasification, transport, storage, distribution, and sale of natural gas in Spain and internationally. The company operates through Energy and Network Management, Renewables and New Business, and Marketing segments. The Energy and Network Management segment engages in the regulated gas and electricity distribution business in Spain; distribution of gas and electricity in Argentina; distributes gas in Brazil and Mexico; and distribution of electricity in Panama. This segment is also involved in the sale of liquefied natural gas and the sea transport business; providing supply management and sales services for customers, as well as the UniÃ³n Fenosa Gas and other gas infrastructures activities; management of the Maghreb Â\u0096 Europe and Medgaz gas pipelines; and generation of thermal electricity in Spain and Latin America. The Renewables and New Business segment engages in the generation and sale of electricity through wind, mini-hydro, solar, and cogeneration in Spain; and generation and sale of electricity in Latin America and Australia. The Marketing segment engages in managing gas, electricity, and services for end customers. The company was formerly known as Gas Natural SDG, S.A. and changed its name to Naturgy Energy Group, S.A. in June 2018. Naturgy Energy Group, S.A. was incorporated in 1843 and is based in Madrid, Spain.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Spain",
        "state": null,
        "city": "Humanes de Madrid",
        "zipcode": "28033",
        "website": "http://www.naturgy.com",
        "full_time_employees": 8372
    },
    "GASCO.SN": {
        "short_name": "EMPRESAS GASCO SA",
        "long_name": "Empresas Gasco S.A.",
        "summary": "Empresas Gasco S.A. provides energy solutions based primarily based on gas in Chile and internationally. It distributes and commercializes liquefied gas and liquefied natural gas to residential, commercial, industrial, and real estate customers; distributes natural gas under the concession regime, as well as compressed natural gas; and develops gas power generation projects. The company was founded in 1856 and is based in Santiago, Chile.",
        "currency": "CLP",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "state": null,
        "city": "Santiago de Chile",
        "zipcode": null,
        "website": "http://www.empresasgasco.com",
        "full_time_employees": 2022
    },
    "GASNF": {
        "short_name": "NATURGY ENERGY GROUP S.A.",
        "long_name": "Naturgy Energy Group, S.A.",
        "summary": "Naturgy Energy Group, S.A., together with its subsidiaries, engages in the supply, liquefaction, regasification, transport, storage, distribution, and sale of natural gas in Spain and internationally. The company operates through Energy and Network Management, Renewables and New Business, and Marketing segments. The Energy and Network Management segment engages in the regulated gas and electricity distribution business in Spain; distribution of gas and electricity in Argentina; distributes gas in Brazil and Mexico; and distribution of electricity in Panama. This segment is also involved in the sale of liquefied natural gas and the sea transport business; providing supply management and sales services for customers, as well as the UniÃ³n Fenosa Gas and other gas infrastructures activities; management of the Maghreb Â\u0096 Europe and Medgaz gas pipelines; and generation of thermal electricity in Spain and Latin America. The Renewables and New Business segment engages in the generation and sale of electricity through wind, mini-hydro, solar, and cogeneration in Spain; and generation and sale of electricity in Latin America and Australia. The Marketing segment engages in managing gas, electricity, and services for end customers. The company was formerly known as Gas Natural SDG, S.A. and changed its name to Naturgy Energy Group, S.A. in June 2018. Naturgy Energy Group, S.A. was incorporated in 1843 and is based in Madrid, Spain.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Spain",
        "state": null,
        "city": "Humanes de Madrid",
        "zipcode": "28033",
        "website": "http://www.naturgy.com",
        "full_time_employees": 8372
    },
    "GASNY": {
        "short_name": "NATURGY ENERGY GROUP S.A.",
        "long_name": "Naturgy Energy Group, S.A.",
        "summary": "Naturgy Energy Group, S.A., together with its subsidiaries, engages in the supply, liquefaction, regasification, transport, storage, distribution, and sale of natural gas in Spain and internationally. The company operates through Energy and Network Management, Renewables and New Business, and Marketing segments. The Energy and Network Management segment engages in the regulated gas and electricity distribution business in Spain; distribution of gas and electricity in Argentina; distributes gas in Brazil and Mexico; and distribution of electricity in Panama. This segment is also involved in the sale of liquefied natural gas and the sea transport business; providing supply management and sales services for customers, as well as the UniÃ³n Fenosa Gas and other gas infrastructures activities; management of the Maghreb Â\u0096 Europe and Medgaz gas pipelines; and generation of thermal electricity in Spain and Latin America. The Renewables and New Business segment engages in the generation and sale of electricity through wind, mini-hydro, solar, and cogeneration in Spain; and generation and sale of electricity in Latin America and Australia. The Marketing segment engages in managing gas, electricity, and services for end customers. The company was formerly known as Gas Natural SDG, S.A. and changed its name to Naturgy Energy Group, S.A. in June 2018. Naturgy Energy Group, S.A. was incorporated in 1843 and is based in Madrid, Spain.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Spain",
        "state": null,
        "city": "Humanes de Madrid",
        "zipcode": "28033",
        "website": "http://www.naturgy.com",
        "full_time_employees": 8372
    },
    "GBAN.BA": {
        "short_name": "NATURGY BAN SA",
        "long_name": "Naturgy BAN, S.A.",
        "summary": "Naturgy BAN, S.A. engages in natural gas distribution business. The company was formerly known as Gas Natural Ban, S.A. and changed its name to Naturgy BAN, S.A. in January 2019. Naturgy BAN, S.A. is based in Buenos Aires, Argentina.",
        "currency": "ARS",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "Argentina",
        "state": null,
        "city": "Buenos Aires",
        "zipcode": "1268",
        "website": "http://www.naturgy.com.ar",
        "full_time_employees": 467
    },
    "GQI.F": {
        "short_name": "GAIL (INDIA) GDR/6 IR 10",
        "long_name": "GAIL (India) Limited",
        "summary": "GAIL (India) Limited operates as a natural gas processing and distribution company in India and internationally. The company operates through Transmission Services, Natural Gas Marketing, Petrochemicals, LPG and Other Liquid Hydrocarbons, and Other segments. It is involved in the transmission, distribution, and marketing of natural gas to the power, city gas distribution, fertilizer, and other sectors. The company also sources, markets, and trades in liquefied natural gas (LNG); markets liquefied petroleum gas (LPG), propane, pentane, naphtha, mixed fuel oil, propylene, and hydrogenated C4 mix; and manufactures petrochemicals, such as high density polyethylene and linear low density polyethylene under the brand names of G-Lex and G-Lene. In addition, it operates a network of compressed natural gas stations; and provides piped natural gas to domestic, commercial, and industrial applications, as well as has interests in 11 exploration and production blocks located in Assam-Arakan, Cambay, Cauvery, Gujarat Kutch, and Myanmar basins covering an area of 2,170 square kilometers. Further, the company offers telecommunication services through GAILTEL; and generates, transmits, and distributes electric power through 118 MW wind power plant and 12.3 MW solar power plant. Additionally, it engages in the charter hiring of LNG vessels. The company owns and operates approximately 12,426 km of natural gas pipelines; 2,038 km LPG pipeline transmission network; and five gas processing plants for production of LPG, propane, pentane, naphtha, etc. GAIL (India) Limited was founded in 1984 and is based in New Delhi, India.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110066",
        "website": "http://www.gailonline.com",
        "full_time_employees": 4682
    },
    "GSP.MI": {
        "short_name": "GAS PLUS",
        "long_name": "Gas Plus S.p.A.",
        "summary": "Gas Plus S.p.A. engages in the exploration and production of natural gas in Italy and internationally. The company is also involved in the distribution, transport, and storage of natural gas. As of December 31, 2018, it holds an interest in 45 hydrocarbon production concessions with 4,271.1 million cubic meters of gas equivalent. The company was founded in 1960 and is based in Milan, Italy. Gas Plus S.p.A. is a subsidiary of Us.Fin. S.r.l.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20134",
        "website": "http://www.gasplus.it",
        "full_time_employees": 155
    },
    "GSPL.NS": {
        "short_name": "GUJARAT STATE PETR",
        "long_name": "Gujarat State Petronet Limited",
        "summary": "Gujarat State Petronet Limited transmits natural gas through pipeline on an open access basis from supply points to demand centers in India. The company develops energy transportation infrastructure and connects natural gas supply sources, including LNG terminals to various markets in Gujarat. As of March 31, 2019, it operated approximately 2692 kilometers of pipeline network. The company transports approximately 35 MMSCMD of natural gas to refineries, steel plants, fertilizer plants, petrochemical plants, power plants, glass industries, and other miscellaneous industries, as well as to textile, chemical, and city gas distribution companies. It also generates and sells electricity through windmills. The company was founded in 1998 and is based in Gandhinagar, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gandhinagar",
        "zipcode": "382028",
        "website": "http://www.gspcgroup.com/GSPL/",
        "full_time_employees": 252
    },
    "GUJGASLTD.NS": {
        "short_name": "GUJARAT GAS LTD",
        "long_name": "Gujarat Gas Limited",
        "summary": "Gujarat Gas Limited engages in the distribution of city natural gas in India. The company operates a network of approximately 24,400 kilometers of gas pipeline and 403 CNG stations. It supplies natural gas to approximately 14.4 lakh residential consumers; and 12,600 commercial customers. It operates in 21 districts of the state of Gujarat, 7 districts of the state of Punjab, 5 districts of the state of Madhya Pradesh, 4 districts of the state of Rajasthan, 2 districts of the state of Maharashtra, 2 districts of the state of Haryana, and the Union Territory of Dadra and Nagar Haveli. The company was formerly known as GSPC Distribution Networks Limited and changed its name to Gujarat Gas Limited in May 2015. Gujarat Gas Limited was incorporated in 2012 and is based in Ahmedabad, India. Gujarat Gas Limited is a subsidiary of Gujarat State Petronet Limited.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380006",
        "website": "http://www.gujaratgas.com",
        "full_time_employees": 1089
    },
    "GZE1R.RG": {
        "short_name": "Latvijas Gaze",
        "long_name": "AS Latvijas Gaze",
        "summary": "AS Latvijas Gaze engages in the purchase, trading, distribution, and sale of natural gas in Latvia, Lithuania, and Estonia. It operates through Natural Gas Sales & Trading, and Natural Gas Distribution segments. The company supplies natural gas to approximately 400 thousand customers in Latvia. It serves industrial and commercial customers, as well as households. The company is based in Riga, Latvia.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "RIS",
        "market": "rg_market",
        "country": "Latvia",
        "state": null,
        "city": "Riga",
        "zipcode": "1001",
        "website": "http://lg.lv",
        "full_time_employees": 989
    },
    "HCG.F": {
        "short_name": "H.K. CHINA GAS",
        "long_name": "The Hong Kong and China Gas Company Limited",
        "summary": "The Hong Kong and China Gas Company Limited, together with its subsidiaries, produces, distributes, and markets gas in Hong Kong and Mainland China. It is involved in the provision of liquefied natural gas, methanol, and coal and other chemicals; conversion and utilization of biomass, and industrial and agricultural waste; and operation of natural gas refilling stations, piped city-gas projects, upstream and midstream developments, water and wastewater treatment projects, energy exploration and utilization ventures, and aviation fuel facilities. The company supplies town gas to approximately 1.9 million customers. It also provides network connectivity, and data center and cloud computing services; and engages in the software development, solution implementation, and systems integration activities. In addition, the company offers consultancy and engineering contractor services, including utilities installation, infrastructure construction, and civil and building services engineering for public and private projects; and designs and manufactures gas meters and metering systems. Further, it is involved in water supply and wastewater treatment serving 2.4 million customers. Additionally, the company manufactures polyethylene piping and fittings; and engages in the customers center, cafÃ©, restaurant, retail sale, automatic meter reading system development, laboratory testing, payment gateway and related, project management, landfill gas project, financing, logistics, oil, research and development, property development, and securities investment activities. The Hong Kong and China Gas Company Limited was founded in 1862 and is headquartered in North Point, Hong Kong.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.towngas.com",
        "full_time_employees": 53765
    },
    "HCGS.F": {
        "short_name": "H.K. CHINA GAS HD-,25 ADR",
        "long_name": "The Hong Kong and China Gas Company Limited",
        "summary": "The Hong Kong and China Gas Company Limited, together with its subsidiaries, produces, distributes, and markets gas in Hong Kong and Mainland China. It is involved in the provision of liquefied natural gas, methanol, and coal and other chemicals; conversion and utilization of biomass, and industrial and agricultural waste; and operation of natural gas refilling stations, piped city-gas projects, upstream and midstream developments, water and wastewater treatment projects, energy exploration and utilization ventures, and aviation fuel facilities. The company supplies town gas to approximately 1.9 million customers. It also provides network connectivity, and data center and cloud computing services; and engages in the software development, solution implementation, and systems integration activities. In addition, the company offers consultancy and engineering contractor services, including utilities installation, infrastructure construction, and civil and building services engineering for public and private projects; and designs and manufactures gas meters and metering systems. Further, it is involved in water supply and wastewater treatment serving 2.4 million customers. Additionally, the company manufactures polyethylene piping and fittings; and engages in the customers center, cafÃ©, restaurant, retail sale, automatic meter reading system development, laboratory testing, payment gateway and related, project management, landfill gas project, financing, logistics, oil, research and development, property development, and securities investment activities. The Hong Kong and China Gas Company Limited was founded in 1862 and is headquartered in North Point, Hong Kong.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.towngas.com",
        "full_time_employees": 53765
    },
    "HOKCF": {
        "short_name": "HONGKONG & CHINA GAS CO. LTD.",
        "long_name": "The Hong Kong and China Gas Company Limited",
        "summary": "The Hong Kong and China Gas Company Limited, together with its subsidiaries, produces, distributes, and markets gas in Hong Kong and Mainland China. It is involved in the provision of liquefied natural gas, methanol, and coal and other chemicals; conversion and utilization of biomass, and industrial and agricultural waste; and operation of natural gas refilling stations, piped city-gas projects, upstream and midstream developments, water and wastewater treatment projects, energy exploration and utilization ventures, and aviation fuel facilities. The company supplies town gas to approximately 1.9 million customers. It also provides network connectivity, and data center and cloud computing services; and engages in the software development, solution implementation, and systems integration activities. In addition, the company offers consultancy and engineering contractor services, including utilities installation, infrastructure construction, and civil and building services engineering for public and private projects; and designs and manufactures gas meters and metering systems. Further, it is involved in water supply and wastewater treatment serving 2.4 million customers. Additionally, the company manufactures polyethylene piping and fittings; and engages in the customers center, cafÃ©, restaurant, retail sale, automatic meter reading system development, laboratory testing, payment gateway and related, project management, landfill gas project, financing, logistics, oil, research and development, property development, and securities investment activities. The Hong Kong and China Gas Company Limited was founded in 1862 and is headquartered in North Point, Hong Kong.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.towngas.com",
        "full_time_employees": 53765
    },
    "HOKCY": {
        "short_name": "HONGKONG & CHINA GAS CO. LTD.",
        "long_name": "The Hong Kong and China Gas Company Limited",
        "summary": "The Hong Kong and China Gas Company Limited, together with its subsidiaries, produces, distributes, and markets gas in Hong Kong and Mainland China. It is involved in the provision of liquefied natural gas, methanol, and coal and other chemicals; conversion and utilization of biomass, and industrial and agricultural waste; and operation of natural gas refilling stations, piped city-gas projects, upstream and midstream developments, water and wastewater treatment projects, energy exploration and utilization ventures, and aviation fuel facilities. The company supplies town gas to approximately 1.9 million customers. It also provides network connectivity, and data center and cloud computing services; and engages in the software development, solution implementation, and systems integration activities. In addition, the company offers consultancy and engineering contractor services, including utilities installation, infrastructure construction, and civil and building services engineering for public and private projects; and designs and manufactures gas meters and metering systems. Further, it is involved in water supply and wastewater treatment serving 2.4 million customers. Additionally, the company manufactures polyethylene piping and fittings; and engages in the customers center, cafÃ©, restaurant, retail sale, automatic meter reading system development, laboratory testing, payment gateway and related, project management, landfill gas project, financing, logistics, oil, research and development, property development, and securities investment activities. The Hong Kong and China Gas Company Limited was founded in 1862 and is headquartered in North Point, Hong Kong.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.towngas.com",
        "full_time_employees": 53765
    },
    "I10.F": {
        "short_name": "ITALGAS S.P.A.  O.N.",
        "long_name": "Italgas S.p.A.",
        "summary": "Italgas S.p.A., together with its subsidiaries, engages in the distribution of natural gas in Italy. It is involved in the transportation of gas through local pipeline networks from the delivery points at the reduction and measurement stations interconnected with the transport networks to the points of final delivery to households, enterprises, etc. As of December 31, 2019, the company operated a distribution network of 70,502 kilometers that served 1,744 operating municipalities. It also engages in metering activities; and distributes and sells water. The company was founded in 1837 and is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20143",
        "website": "http://www.italgas.it",
        "full_time_employees": 3691
    },
    "I11.SI": {
        "short_name": "Renaissance United",
        "long_name": "Renaissance United Limited",
        "summary": "Renaissance United Limited operates as a developer, turnkey contractor, and investor in oil and gas, power, transportation, water and environment, and industrial infrastructure projects worldwide. Its infrastructure related activities cover areas, such as offshore platforms and support facilities, product loading and receiving terminals, import-export SPM systems, land and submarine pipelines, minimal field production systems, supply bases and terminals, gas conversion plants, fabrication facilities, and sea islands/transshipment terminals; and small to medium sized power plants, large power developments, sub-packages of IPP projects, repowering of existing plants, industrial estate and captive power plants, and transmission and distribution projects. The company's infrastructure related activities in water and environment field cover raw water collection system, treatment plants, pipelines and outfalls, storage reservoirs, distribution systems, waste treatment and recycling, air pollution and noise control, and environmental services; transportation fields cover ports, harbors, jetties, wharves, transshipment facilities, and toll roads and bridges; and industrial sector cover petrochemical, telecommunications, industrial park, and pulp and paper mill infrastructure, as well as bulk material handling, fertilizer plants, and military applications. It also engages in the distribution of gas to household, commercial, and industrial users; the development of residential real estate properties; acting as agents and distributors of semiconductor back-end equipment; the provision of consultancy services in semi-conductor industry; the investment securities trading; the warehousing business; and the manufacture, repairing, and dealership in electronic components. The company was formerly known as Ipco International Limited and changed its name to Renaissance United Limited in December 2018. Renaissance United Limited was founded in 1975 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "339156",
        "website": "http://www.ren-united.com",
        "full_time_employees": null
    },
    "IENOVA.MX": {
        "short_name": "INFRAESTRUCTURA ENERGETICA NOVA",
        "long_name": "Infraestructura Energética Nova, S.A.B. de C.V.",
        "summary": "Infraestructura EnergÃ©tica Nova, S.A.B. de C.V. develops, builds, and operates energy infrastructure projects in Mexico. It operates through three segments: Gas, Storage, and Power. The company develops and operates various systems for receiving, transporting, compressing, storing, and delivering natural gas, ethane, and liquefied petroleum gas (LPG) in the states of Baja California, Chiapas, Chihuahua, Jalisco, Nuevo LeÃ³n, Sinaloa, Sonora, San Luis PotosÃ­, Tabasco, Tamaulipas, and Veracruz. It owns and operates approximately 2,900 kilometers (km) of natural gas pipelines with an aggregate design capacity of approximately 16,400 million cubic feet per day; sixteen gas compression stations with an aggregate of approximately 780,000 horsepower; 224 km of pipelines with a design capacity of approximately 34,000 barrels per day for the transportation of LPG; 224 km of pipelines for transportation of ethane; an LPG storage facility in Guadalajara with a total storage capacity of 80,000 barrels; and a liquefied natural gas terminal with a storage capacity of 320,000 cubic meters in two tanks of 160,000-cubic meters each. In addition, the company owns and operates the ECOGAS natural gas distribution utility, which includes approximately 4,367 km of pipeline; serves approximately 136,000 industrial, commercial, and residential customers; and develops systems for the receipt and storage of petroleum products and other liquids. Further, it owns and operates a 625 MW natural-gas-fired and combined-cycle power generation facility; three wind power generation facilities in operation and one in development; and five solar parks in operation. The company was formerly known as Sempra MÃ©xico, S. de R.L. de C.V. and changed its name to Infraestructura EnergÃ©tica Nova, S.A.B. de C.V. in March 2013. The company was incorporated in 1996 and is headquartered in Mexico City, Mexico. Infraestructura EnergÃ©tica Nova, S.A.B. de C.V. is a subsidiary of Sempra Energy.",
        "currency": "MXN",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Mexico",
        "state": "DF",
        "city": "Mexico City",
        "zipcode": "06600",
        "website": "http://www.ienova.com.mx",
        "full_time_employees": 1488
    },
    "IENVF": {
        "short_name": "INFRAESTRUCTURA ENERGETICA NOVA",
        "long_name": "Infraestructura Energética Nova, S.A.B. de C.V.",
        "summary": "Infraestructura EnergÃ©tica Nova, S.A.B. de C.V. develops, builds, and operates energy infrastructure projects in Mexico. It operates through three segments: Gas, Storage, and Power. The company develops and operates various systems for receiving, transporting, compressing, storing, and delivering natural gas, ethane, and liquefied petroleum gas (LPG) in the states of Baja California, Chiapas, Chihuahua, Jalisco, Nuevo LeÃ³n, Sinaloa, Sonora, San Luis PotosÃ­, Tabasco, Tamaulipas, and Veracruz. It owns and operates approximately 2,900 kilometers (km) of natural gas pipelines with an aggregate design capacity of approximately 16,400 million cubic feet per day; sixteen gas compression stations with an aggregate of approximately 780,000 horsepower; 224 km of pipelines with a design capacity of approximately 34,000 barrels per day for the transportation of LPG; 224 km of pipelines for transportation of ethane; an LPG storage facility in Guadalajara with a total storage capacity of 80,000 barrels; and a liquefied natural gas terminal with a storage capacity of 320,000 cubic meters in two tanks of 160,000-cubic meters each. In addition, the company owns and operates the ECOGAS natural gas distribution utility, which includes approximately 4,367 km of pipeline; serves approximately 136,000 industrial, commercial, and residential customers; and develops systems for the receipt and storage of petroleum products and other liquids. Further, it owns and operates a 625 MW natural-gas-fired and combined-cycle power generation facility; three wind power generation facilities in operation and one in development; and five solar parks in operation. The company was formerly known as Sempra MÃ©xico, S. de R.L. de C.V. and changed its name to Infraestructura EnergÃ©tica Nova, S.A.B. de C.V. in March 2013. The company was incorporated in 1996 and is headquartered in Mexico City, Mexico. Infraestructura EnergÃ©tica Nova, S.A.B. de C.V. is a subsidiary of Sempra Energy.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Mexico",
        "state": "DF",
        "city": "Mexico City",
        "zipcode": "06600",
        "website": "http://www.ienova.com.mx",
        "full_time_employees": 1488
    },
    "IG.MI": {
        "short_name": "ITALGAS",
        "long_name": "Italgas S.p.A.",
        "summary": "Italgas S.p.A., together with its subsidiaries, engages in the distribution of natural gas in Italy. It is involved in the transportation of gas through local pipeline networks from the delivery points at the reduction and measurement stations interconnected with the transport networks to the points of final delivery to households, enterprises, etc. As of December 31, 2019, the company operated a distribution network of 70,502 kilometers that served 1,744 operating municipalities. It also engages in metering activities; and distributes and sells water. The company was founded in 1837 and is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20143",
        "website": "http://www.italgas.it",
        "full_time_employees": 3691
    },
    "IG.VI": {
        "short_name": "ITALGAS SPA",
        "long_name": "Italgas S.p.A.",
        "summary": "Italgas S.p.A., together with its subsidiaries, engages in the distribution of natural gas in Italy. It is involved in the transportation of gas through local pipeline networks from the delivery points at the reduction and measurement stations interconnected with the transport networks to the points of final delivery to households, enterprises, etc. As of December 31, 2019, the company operated a distribution network of 70,502 kilometers that served 1,744 operating municipalities. It also engages in metering activities; and distributes and sells water. The company was founded in 1837 and is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20143",
        "website": "http://www.italgas.it",
        "full_time_employees": 3691
    },
    "IGL.NS": {
        "short_name": "INDRAPRASTHA GAS",
        "long_name": "Indraprastha Gas Limited",
        "summary": "Indraprastha Gas Limited distributes natural gas in India. The company supplies compressed natural gas (CNG) to the transport sector; and piped natural gas to domestic, industrial, and commercial sectors in Delhi and the National Capital Region. It operates 555 CNG stations; and serves 13.74 Lakh households, and 5,578 commercial and industrial consumers. The company's operates 1,150 kilometers of steel pipeline network; and 13,455 kilometers MDPE network. Indraprastha Gas Limited was incorporated in 1998 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110022",
        "website": "http://www.iglonline.net",
        "full_time_employees": 703
    },
    "INFA.L": {
        "short_name": "INFRASTRATA PLC ORD 1P",
        "long_name": "InfraStrata plc",
        "summary": "InfraStrata plc, together with its subsidiaries, operates as a gas storage company. It engages in the energy infrastructure development and operation of gas storage project at Islandmagee in County Antrim in Northern Ireland. The company was formerly known as Portland Gas plc and changed its name to InfraStrata plc in December 2009. InfraStrata plc was incorporated in 2007 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC4R 3TT",
        "website": "http://www.infrastrataplc.com",
        "full_time_employees": 81
    },
    "IOJ.F": {
        "short_name": "RENAISSANCE UNITED -LOC.-",
        "long_name": "Renaissance United Limited",
        "summary": "Renaissance United Limited operates as a developer, turnkey contractor, and investor in oil and gas, power, transportation, water and environment, and industrial infrastructure projects worldwide. Its infrastructure related activities cover areas, such as offshore platforms and support facilities, product loading and receiving terminals, import-export SPM systems, land and submarine pipelines, minimal field production systems, supply bases and terminals, gas conversion plants, fabrication facilities, and sea islands/transshipment terminals; and small to medium sized power plants, large power developments, sub-packages of IPP projects, repowering of existing plants, industrial estate and captive power plants, and transmission and distribution projects. The company's infrastructure related activities in water and environment field cover raw water collection system, treatment plants, pipelines and outfalls, storage reservoirs, distribution systems, waste treatment and recycling, air pollution and noise control, and environmental services; transportation fields cover ports, harbors, jetties, wharves, transshipment facilities, and toll roads and bridges; and industrial sector cover petrochemical, telecommunications, industrial park, and pulp and paper mill infrastructure, as well as bulk material handling, fertilizer plants, and military applications. It also engages in the distribution of gas to household, commercial, and industrial users; the development of residential real estate properties; acting as agents and distributors of semiconductor back-end equipment; the provision of consultancy services in semi-conductor industry; the investment securities trading; the warehousing business; and the manufacture, repairing, and dealership in electronic components. The company was formerly known as Ipco International Limited and changed its name to Renaissance United Limited in December 2018. Renaissance United Limited was founded in 1975 and is based in Singapore.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "339156",
        "website": "http://www.ren-united.com",
        "full_time_employees": null
    },
    "LGR.F": {
        "short_name": "SPIRE INC.  DL 1",
        "long_name": "Spire Inc.",
        "summary": "Spire Inc., through its subsidiaries, engages in the purchase, retail distribution, and sale of natural gas to residential, commercial, industrial, and other end-users of natural gas in the United States. The company operates in two segments, Gas Utility and Gas Marketing. It is also involved in the marketing of natural gas; and provision of energy services on non-regulated basis to on-system utility transportation customers, as well as to retail and wholesale customers. In addition, the company engages in the transportation of propane through its propane pipeline; compression of natural gas; risk management; and other activities. Further, it provides physical natural gas storage services. The company was formerly known as The Laclede Group, Inc. and changed its name to Spire Inc. in April 2016. Spire Inc. was founded in 1857 and is based in St. Louis, Missouri.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MO",
        "city": "St. Louis",
        "zipcode": "63101",
        "website": "http://www.spireenergy.com",
        "full_time_employees": 3583
    },
    "LGX1.F": {
        "short_name": "CN RES GAS GR.LTD. HD-,10",
        "long_name": "China Resources Gas Group Limited",
        "summary": "China Resources Gas Group Limited, an investment holding company, engages in the sale of liquefied gas and connection of gas pipelines. It operates through Sale and Distribution of Gas Fuel and Related Products, Gas Connection, Sale of Gas Appliances, Design and Construction Services, and Gas Stations segments. The Sale and Distribution of Gas Fuel and Related Products segment sells natural gas and liquefied petroleum gas for residential, commercial, and industrial use. The Gas Connection segment constructs gas pipeline networks under gas connection contracts. The Sale of Gas Appliances segment sells gas appliances and related products. The Design and Construction Services segment provides design, construction, consultancy, and management services for gas connection projects. The Gas Stations segment sells gas fuel in natural gas filling stations. As of December 31, 2020, it operated 257 city gas projects in 22 provinces in the People's Republic of China. The company is headquartered in Wan Chai, Hong Kong. China Resources Gas Group Limited is a subsidiary of China Resources (Holdings) Company Limited.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.crcgas.com",
        "full_time_employees": 48205
    },
    "METR.BA": {
        "short_name": "METROGAS SA",
        "long_name": "MetroGAS S.A.",
        "summary": "MetroGAS S.A. distributes natural gas in Argentina. It serves approximately 2,500,000 customers. The company was formerly known as Distribuidora de Gas Metropolitano SA. MetroGAS S.A. was founded in 1992 and is based in Buenos Aires, Argentina.",
        "currency": "ARS",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "Argentina",
        "state": null,
        "city": "Buenos Aires",
        "zipcode": null,
        "website": "http://www.metrogas.com.ar",
        "full_time_employees": null
    },
    "MGL.NS": {
        "short_name": "MAHANAGAR GAS LTD",
        "long_name": "Mahanagar Gas Limited",
        "summary": "Mahanagar Gas Limited operates as a natural gas distribution company primarily in India. The company offers domestic piped natural gas (PNG), commercial PNG, industrial PNG, and compressed natural gas (CNG), as well as manufactures gas geysers. As of March 31, 2020, it operated 256 CNG filing stations providing the gas to approximately 0.75 million vehicles; and supplied PNG to approximately 1.26 million domestic, 3,949 commercial, and 72 industrial consumers through a pipeline network of approximately 5,630 kilometers. Mahanagar Gas Limited was founded in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.mahanagargas.com",
        "full_time_employees": null
    },
    "N1IS34.SA": {
        "short_name": "NISOURCE INCDRN",
        "long_name": "NiSource Inc.",
        "summary": "NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. The company operates through two segments, Gas Distribution Operations and Electric Operations. It provides natural gas services and transportation for residential, commercial, and industrial customers; generates, transmits, and distributes electricity; and wholesale and transmission transaction services. The company owns and operates two coal-fired electric generating stations with a capacity of 2,080 megawatts (MW); combined cycle gas turbine with a capacity of 571 MW; two gas-fired generating units with a capacity of 155 MW; and two hydroelectric generating plants with a capacity of 10 MW. It serves approximately 4 million natural gas customers in six states under the Columbia Gas and NIPSCO brands; and 500,000 electricity customers in the northern part of Indiana. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.",
        "currency": "BRL",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "IN",
        "city": "Merrillville",
        "zipcode": "46410",
        "website": "http://www.nisource.com",
        "full_time_employees": 7301
    },
    "NFE": {
        "short_name": "New Fortress Energy Inc.",
        "long_name": "New Fortress Energy Inc.",
        "summary": "New Fortress Energy Inc. operates as an integrated gas-to-power infrastructure company, provides energy and development services to end-users worldwide. The company engages in the natural gas procurement and liquefaction; and shipping, logistics, facilities and conversion, or development of natural gas-fired power generation. It also supplies LNG. The company operates LNG storage and regasification facility at the Port of Montego Bay, Jamaica; marine LNG storage and regasification facility in Old Harbour, Jamaica; and landed micro-fuel handling facility in San Juan, Puerto Rico, as well as Miami facility. New Fortress Energy Inc. was founded in 1998 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10011",
        "website": "http://www.newfortressenergy.com",
        "full_time_employees": 231
    },
    "NG0.F": {
        "short_name": "NIPPON GAS CO. LTD",
        "long_name": "Nippon Gas Co., Ltd.",
        "summary": "Nippon Gas Co., Ltd. engages in the supply and sale of LP gas and natural gas in Japan. The company supplies LP gas through pipelines to homes built for sale, company dormitories, apartment buildings, other residential apartment complexes, etc., as well as for commercial, industrial, agricultural, and automotive use; and high-pressure gas for commercial and industrial use. It also sells glass-top stoves, built-in stoves, gas oven ranges, gas rice cookers, dishwashers, etc.; gas water heaters, instant water heaters, floor heating products, bathroom heater/ventilation/dryer combo systems, mist saunas, etc.; and commercial and industrial gas appliances. In addition, the company sells air-conditioning equipment, including gas and absorption heat pumps, cogeneration systems, and gas infrared heaters; remodeling-related equipment; and household equipment, as well as offers accident insurance agency services. Further, it engages in residential remodeling and consulting business; and the construction of gas, water supply, drainage, air conditioning/heating equipment, etc. Additionally, the company is involved in the electric power and gas retail business in the United States; the development of an electric-power-saving energy management system in Australia; and the sale of software. Nippon Gas Co., Ltd. was founded in 1955 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "151-8582",
        "website": "http://www.nichigas.co.jp",
        "full_time_employees": null
    },
    "NI-PB": {
        "short_name": "NiSource, Inc Depositary Shares",
        "long_name": "NiSource Inc.",
        "summary": "NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. The company operates through two segments, Gas Distribution Operations and Electric Operations. It provides natural gas services and transportation for residential, commercial, and industrial customers; generates, transmits, and distributes electricity; and wholesale and transmission transaction services. The company owns and operates two coal-fired electric generating stations with a capacity of 2,080 megawatts (MW); combined cycle gas turbine with a capacity of 571 MW; two gas-fired generating units with a capacity of 155 MW; and two hydroelectric generating plants with a capacity of 10 MW. It serves approximately 4 million natural gas customers in six states under the Columbia Gas and NIPSCO brands; and 500,000 electricity customers in the northern part of Indiana. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IN",
        "city": "Merrillville",
        "zipcode": "46410",
        "website": "http://www.nisource.com",
        "full_time_employees": 7301
    },
    "NI": {
        "short_name": "NiSource Inc",
        "long_name": "NiSource Inc.",
        "summary": "NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. The company operates through two segments, Gas Distribution Operations and Electric Operations. It provides natural gas services and transportation for residential, commercial, and industrial customers; generates, transmits, and distributes electricity; and wholesale and transmission transaction services. The company owns and operates two coal-fired electric generating stations with a capacity of 2,080 megawatts (MW); combined cycle gas turbine with a capacity of 571 MW; two gas-fired generating units with a capacity of 155 MW; and two hydroelectric generating plants with a capacity of 10 MW. It serves approximately 4 million natural gas customers in six states under the Columbia Gas and NIPSCO brands; and 500,000 electricity customers in the northern part of Indiana. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IN",
        "city": "Merrillville",
        "zipcode": "46410",
        "website": "http://www.nisource.com",
        "full_time_employees": 7301
    },
    "NIMC": {
        "short_name": "NiSource, Inc Series A Corporat",
        "long_name": "NiSource Inc.",
        "summary": "NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. The company operates through two segments, Gas Distribution Operations and Electric Operations. It provides natural gas services and transportation for residential, commercial, and industrial customers; generates, transmits, and distributes electricity; and wholesale and transmission transaction services. The company owns and operates two coal-fired electric generating stations with a capacity of 2,080 megawatts (MW); combined cycle gas turbine with a capacity of 571 MW; two gas-fired generating units with a capacity of 155 MW; and two hydroelectric generating plants with a capacity of 10 MW. It serves approximately 4 million natural gas customers in six states under the Columbia Gas and NIPSCO brands; and 500,000 electricity customers in the northern part of Indiana. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IN",
        "city": "Merrillville",
        "zipcode": "46410",
        "website": "http://www.nisource.com",
        "full_time_employees": 7301
    },
    "NJ1.F": {
        "short_name": "NEW JERSEY RES  DL2,50",
        "long_name": "New Jersey Resources Corporation",
        "summary": "New Jersey Resources Corporation, an energy services holding company, provides regulated gas distribution, and retail and wholesale energy services. The company operates through four segments: Natural Gas Distribution, Clean Energy Ventures, Energy Services, and Storage and Transportation. The Natural Gas Distribution segment offers regulated retail natural gas services to approximately 558,000 residential and commercial customers in central and northern New Jersey; provides storage management services; and participates in the off-system sales and capacity release markets. The Clean Energy Ventures segment invests in, owns, and operates commercial and residential solar projects located in New Jersey, Connecticut, and Rhode Island. The Energy Services segment provides unregulated wholesale energy management services to other energy companies and natural gas producers, as well as maintains and transacts a portfolio of physical assets consisting of natural gas storage and transportation contracts in the United States and Canada. The Storage and Transportation segment invests in natural gas transportation and storage facilities. The company offers heating, ventilation, and cooling services; holds commercial real estate properties; and provides solar equipment installation, and plumbing repair and installation services, as well as engages in the water appliance sale, installation, and servicing activities. New Jersey Resources Corporation was incorporated in 1981 and is based in Wall, New Jersey.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NJ",
        "city": "Wall",
        "zipcode": "07719",
        "website": "http://www.njresources.com",
        "full_time_employees": 1200
    },
    "NJR": {
        "short_name": "NewJersey Resources Corporation",
        "long_name": "New Jersey Resources Corporation",
        "summary": "New Jersey Resources Corporation, an energy services holding company, provides regulated gas distribution, and retail and wholesale energy services. The company operates through four segments: Natural Gas Distribution, Clean Energy Ventures, Energy Services, and Storage and Transportation. The Natural Gas Distribution segment offers regulated retail natural gas services to approximately 558,000 residential and commercial customers in central and northern New Jersey; provides storage management services; and participates in the off-system sales and capacity release markets. The Clean Energy Ventures segment invests in, owns, and operates commercial and residential solar projects located in New Jersey, Connecticut, and Rhode Island. The Energy Services segment provides unregulated wholesale energy management services to other energy companies and natural gas producers, as well as maintains and transacts a portfolio of physical assets consisting of natural gas storage and transportation contracts in the United States and Canada. The Storage and Transportation segment invests in natural gas transportation and storage facilities. The company offers heating, ventilation, and cooling services; holds commercial real estate properties; and provides solar equipment installation, and plumbing repair and installation services, as well as engages in the water appliance sale, installation, and servicing activities. New Jersey Resources Corporation was incorporated in 1981 and is based in Wall, New Jersey.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Wall",
        "zipcode": "07719",
        "website": "http://www.njresources.com",
        "full_time_employees": 1200
    },
    "NOU.F": {
        "short_name": "NISOURCE INC.",
        "long_name": "NiSource Inc.",
        "summary": "NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. The company operates through two segments, Gas Distribution Operations and Electric Operations. It provides natural gas services and transportation for residential, commercial, and industrial customers; generates, transmits, and distributes electricity; and wholesale and transmission transaction services. The company owns and operates two coal-fired electric generating stations with a capacity of 2,080 megawatts (MW); combined cycle gas turbine with a capacity of 571 MW; two gas-fired generating units with a capacity of 155 MW; and two hydroelectric generating plants with a capacity of 10 MW. It serves approximately 4 million natural gas customers in six states under the Columbia Gas and NIPSCO brands; and 500,000 electricity customers in the northern part of Indiana. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IN",
        "city": "Merrillville",
        "zipcode": "46410",
        "website": "http://www.nisource.com",
        "full_time_employees": 7301
    },
    "NTGY.MC": {
        "short_name": "NATURGY ENERGY GROUP, S.A.",
        "long_name": "Naturgy Energy Group, S.A.",
        "summary": "Naturgy Energy Group, S.A., together with its subsidiaries, engages in the supply, liquefaction, regasification, transport, storage, distribution, and sale of natural gas in Spain and internationally. The company operates through Energy and Network Management, Renewables and New Business, and Marketing segments. The Energy and Network Management segment engages in the regulated gas and electricity distribution business in Spain; distribution of gas and electricity in Argentina; distributes gas in Brazil and Mexico; and distribution of electricity in Panama. This segment is also involved in the sale of liquefied natural gas and the sea transport business; providing supply management and sales services for customers, as well as the UniÃ³n Fenosa Gas and other gas infrastructures activities; management of the Maghreb Â\u0096 Europe and Medgaz gas pipelines; and generation of thermal electricity in Spain and Latin America. The Renewables and New Business segment engages in the generation and sale of electricity through wind, mini-hydro, solar, and cogeneration in Spain; and generation and sale of electricity in Latin America and Australia. The Marketing segment engages in managing gas, electricity, and services for end customers. The company was formerly known as Gas Natural SDG, S.A. and changed its name to Naturgy Energy Group, S.A. in June 2018. Naturgy Energy Group, S.A. was incorporated in 1843 and is based in Madrid, Spain.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "MCE",
        "market": "es_market",
        "country": "Spain",
        "state": null,
        "city": "Humanes de Madrid",
        "zipcode": "28033",
        "website": "http://www.naturgy.com",
        "full_time_employees": 8372
    },
    "NWN": {
        "short_name": "Northwest Natural Holding Compa",
        "long_name": "Northwest Natural Holding Company",
        "summary": "Northwest Natural Holding Company, through its subsidiary, Northwest Natural Gas Company, provides regulated natural gas distribution services to residential, commercial, industrial, and transportation customers in Oregon and Southwest Washington. The company also owns and operates 20 Bcf of underground gas storage capacity in Oregon. In addition, it is involved in water businesses and other investment activities. It serves approximately 2.5 million natural gas customers in approximately 140 communities through 770,000 meters; and 63,000 people through approximately 26,000 connections in the Pacific Northwest and Texas. The company was founded in 1859 and is headquartered in Portland, Oregon.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OR",
        "city": "Portland",
        "zipcode": "97204",
        "website": "http://www.nwnaturalholdings.com",
        "full_time_employees": 1216
    },
    "OG9.F": {
        "short_name": "ONE GAS INC.  DL-,01",
        "long_name": "ONE Gas, Inc.",
        "summary": "ONE Gas, Inc. operates as a regulated natural gas distribution utility company in the United States. The company operates through three divisions: Oklahoma Natural Gas, Kansas Gas Service, and Texas Gas Service. It provides natural gas distribution services to 2.2 million customers in three states. The company serves residential, commercial, and transportation customers. As of December 31, 2020, it operated approximately 41,200 miles of distribution mains; and 2,600 miles of transmission pipelines, as well as had 48.4 billion cubic feet of natural gas storage capacity. The company was founded in 1906 and is headquartered in Tulsa, Oklahoma.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74103",
        "website": "http://www.onegas.com",
        "full_time_employees": 3700
    },
    "OGS": {
        "short_name": "ONE Gas, Inc.",
        "long_name": "ONE Gas, Inc.",
        "summary": "ONE Gas, Inc. operates as a regulated natural gas distribution utility company in the United States. The company operates through three divisions: Oklahoma Natural Gas, Kansas Gas Service, and Texas Gas Service. It provides natural gas distribution services to 2.2 million customers in three states. The company serves residential, commercial, and transportation customers. As of December 31, 2020, it operated approximately 41,200 miles of distribution mains; and 2,600 miles of transmission pipelines, as well as had 48.4 billion cubic feet of natural gas storage capacity. The company was founded in 1906 and is headquartered in Tulsa, Oklahoma.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74103",
        "website": "http://www.onegas.com",
        "full_time_employees": 3700
    },
    "OSA.F": {
        "short_name": "OSAKA GAS CO. LTD",
        "long_name": "Osaka Gas Co., Ltd.",
        "summary": "Osaka Gas Co., Ltd. provides gas, electricity, and other energy products and services in Japan and internationally. It operates through four segments: Domestic Energy/Gas, Domestic Energy/Electricity, International Energy, and Life & Business Solutions. The Domestic Energy/Gas segment engages in the design, construction, etc. of various plants related to gas, environmental conservation, and others; sale of gas appliances, and housing equipment and appliances; maintenance checks on gas equipment and appliances, and checks on gas meters, as well as collection of gas bills and others; and leasing, installment payments assistance, insurance agency, and others. This segment is also involved in the gas piping works; sale and construction of energy facilities and equipment, heating system supplies, and others; temporary staffing and call center operation activities; and provision of various research and consulting services. The Domestic Energy/Electricity segment supplies electric power. It generates and sells electricity from natural gas-fired thermal power plants, as well as wind, biomass, and solar resources. The International Energy segment engages in leasing LNG tankers; the development and investment of petroleum and natural gas; investment relating to energy supply business; and procurement and sale of LNG. The Life & Business Solutions segment manufactures and sells fine materials, carbon material products, activated carbon, wood protective coatings, absorbent functional materials, and resin additives; develops, leases, manages, and sells real estate properties; and develops software products and provides computer-based data processing services. This segment is also involved in the management and contracted operation of sports facilities and others. The company was founded in 1897 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0046",
        "website": "http://www.osakagas.co.jp",
        "full_time_employees": null
    },
    "PGAS.JK": {
        "short_name": "Perusahaan Gas Negara Tbk.",
        "long_name": "PT Perusahaan Gas Negara Tbk",
        "summary": "PT Perusahaan Gas Negara Tbk, together with its subsidiaries, engages in the transmission and distribution of natural gas to industrial, commercial, and household users in Indonesia and the United States. The company operates through three segments: Gas commercial and transmission, Exploration and Production of Oil and Gas, and Other operations. It is also involved in the liquefied natural gas processing activity; trading of oil and gas; and exploration, exploitation, and business development in oil and gas. In addition, the company provides fiber optic rental for network services; construction and maintenance services to the customers; management and leasing services for buildings and equipment; and engineering and consultancy services. The company was founded in 1859 and is headquartered in Jakarta, Indonesia. PT Perusahaan Gas Negara Tbk is a subsidiary of PT Pertamina (Persero).",
        "currency": "IDR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11140",
        "website": "http://www.pgn.co.id",
        "full_time_employees": 3298
    },
    "PGB1.F": {
        "short_name": "PT PERUSAHA.GAS NEG.RP100",
        "long_name": "PT Perusahaan Gas Negara Tbk",
        "summary": "PT Perusahaan Gas Negara Tbk, together with its subsidiaries, engages in the transmission and distribution of natural gas to industrial, commercial, and household users in Indonesia and the United States. The company operates through three segments: Gas commercial and transmission, Exploration and Production of Oil and Gas, and Other operations. It is also involved in the liquefied natural gas processing activity; trading of oil and gas; and exploration, exploitation, and business development in oil and gas. In addition, the company provides fiber optic rental for network services; construction and maintenance services to the customers; management and leasing services for buildings and equipment; and engineering and consultancy services. The company was founded in 1859 and is headquartered in Jakarta, Indonesia. PT Perusahaan Gas Negara Tbk is a subsidiary of PT Pertamina (Persero).",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11140",
        "website": "http://www.pgn.co.id",
        "full_time_employees": 3298
    },
    "PGJ.F": {
        "short_name": "TOWNGAS CHINA CO.  HD-,10",
        "long_name": "Towngas China Company Limited",
        "summary": "Towngas China Company Limited, an investment holding company, sells and distributes piped gas in the People's Republic of China. The company operates through two segments, Sales and Distribution of Piped Gas and Related Products, and Gas Connection. It engages in the provision of piped gas; construction of gas pipelines; operation of city gas pipeline network; operation of gas fuel automobile refilling stations; and sale of gas household appliances. The company also offers financing services; provides engineering works services; and operates vehicle gas refilling stations. It serves approximately 14.14 million customers. The company was formerly known as Panva Gas Holdings Limited and changed its name to Towngas China Company Limited in May 2007. The company was founded in 1998 and is headquartered in North Point, Hong Kong. Towngas China Company Limited is a subsidiary of The Hong Kong and China Gas Company Limited.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.towngaschina.com",
        "full_time_employees": 22506
    },
    "PPAAF": {
        "short_name": "PERUSAHAAN GAS NEGARA TBK",
        "long_name": "PT Perusahaan Gas Negara Tbk",
        "summary": "PT Perusahaan Gas Negara Tbk, together with its subsidiaries, engages in the transmission and distribution of natural gas to industrial, commercial, and household users in Indonesia and the United States. The company operates through three segments: Gas commercial and transmission, Exploration and Production of Oil and Gas, and Other operations. It is also involved in the liquefied natural gas processing activity; trading of oil and gas; and exploration, exploitation, and business development in oil and gas. In addition, the company provides fiber optic rental for network services; construction and maintenance services to the customers; management and leasing services for buildings and equipment; and engineering and consultancy services. The company was founded in 1859 and is headquartered in Jakarta, Indonesia. PT Perusahaan Gas Negara Tbk is a subsidiary of PT Pertamina (Persero).",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11140",
        "website": "http://www.pgn.co.id",
        "full_time_employees": 3298
    },
    "PPAAY": {
        "short_name": "PERUSAHAAN GAS NEGARA TBK",
        "long_name": "PT Perusahaan Gas Negara Tbk",
        "summary": "PT Perusahaan Gas Negara Tbk, together with its subsidiaries, engages in the transmission and distribution of natural gas to industrial, commercial, and household users in Indonesia and the United States. The company operates through three segments: Gas commercial and transmission, Exploration and Production of Oil and Gas, and Other operations. It is also involved in the liquefied natural gas processing activity; trading of oil and gas; and exploration, exploitation, and business development in oil and gas. In addition, the company provides fiber optic rental for network services; construction and maintenance services to the customers; management and leasing services for buildings and equipment; and engineering and consultancy services. The company was founded in 1859 and is headquartered in Jakarta, Indonesia. PT Perusahaan Gas Negara Tbk is a subsidiary of PT Pertamina (Persero).",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11140",
        "website": "http://www.pgn.co.id",
        "full_time_employees": 3298
    },
    "RAJA.JK": {
        "short_name": "Rukun Raharja Tbk.",
        "long_name": "PT Rukun Raharja Tbk",
        "summary": "PT Rukun Raharja Tbk, together with its subsidiaries, operates as an integrated energy provider in Indonesia. It is involved in the distribution and storage of natural gas and fuel; operation and maintenance of gas facilities; gas transmission and compression activities; and electricity generation and supply activities. The company also offers supporting services for oil and natural gas mining; consultations on mining; port management, loading-unloading containers; leasing and management of building; supporting facilities of property companies; and development planning and supervision consultation services. In addition, it is involved in the development, management, and operation of gas infrastructure; gas transmission pipeline capacity trading; and building construction and trading. The company was founded in 1993 and is headquartered in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10220",
        "website": "http://www.raja.co.id",
        "full_time_employees": 186
    },
    "RBSFY": {
        "short_name": "RUBIS SCA",
        "long_name": "Rubis",
        "summary": "Rubis, through its subsidiaries, engages in the operation of bulk liquid storage facilities and distribution of petroleum products in Europe, Africa, and the Caribbean. It operates terminals that provide bulk liquid storage facilities for petroleum products, chemical products, fertilizers, molasses, and edible oils; and distributes liquefied petroleum gas and petroleum products, such as butane, propane, gasoline, diesel, kerosene, fuel oil, etc. The company also provides infrastructure, transportation, supply, and services for supporting the development of downstream distribution and marketing business. It serves hypermarkets; oil companies, and chemical and petrochemical groups; and traders and wholesalers. The company was founded in 1990 and is headquartered in Paris, France.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75116",
        "website": "http://www.rubis.fr",
        "full_time_employees": 3684
    },
    "RGCO": {
        "short_name": "RGC Resources Inc.",
        "long_name": "RGC Resources, Inc.",
        "summary": "RGC Resources, Inc., through its subsidiaries, operates as an energy services company. The company sells and distributes natural gas to residential, commercial, and industrial customers in Roanoke, Virginia, and the surrounding localities. It also provides various unregulated services. The company operates approximately 1,144 miles of transmission and distribution pipeline; and a liquefied natural gas storage facility, as well as owns and operates 9 metering stations. RGC Resources, Inc. was founded in 1883 and is based in Roanoke, Virginia.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Roanoke",
        "zipcode": "24016",
        "website": "http://www.rgcresources.com",
        "full_time_employees": 101
    },
    "RTGZ.ME": {
        "short_name": "GAZPROM GA ROSTOV-",
        "long_name": "Public Joint Stock Company Gazprom Gazoraspredelenie Rostov-na-Donu",
        "summary": "Public Joint Stock Company Gazprom Gazoraspredelenie Rostov-na-Donu engages in the transportation of natural gas in Russia. The company is involved in the construction, operation, and maintenance of gas pipelines in the Rostov region and the Republic of Kalmykia. It operates 45,960 kilometers of external gas pipelines; and 19,370 gas control points. The company was founded in 1982 and is based in Rostov-on-Don, Russia.",
        "currency": "RUB",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Rostov-on-Don",
        "zipcode": "344019",
        "website": "http://www.rostovoblgaz.ru",
        "full_time_employees": 6409
    },
    "RUBSF": {
        "short_name": "RUBIS SCA",
        "long_name": "Rubis",
        "summary": "Rubis, through its subsidiaries, engages in the operation of bulk liquid storage facilities and distribution of petroleum products in Europe, Africa, and the Caribbean. It operates terminals that provide bulk liquid storage facilities for petroleum products, chemical products, fertilizers, molasses, and edible oils; and distributes liquefied petroleum gas and petroleum products, such as butane, propane, gasoline, diesel, kerosene, fuel oil, etc. The company also provides infrastructure, transportation, supply, and services for supporting the development of downstream distribution and marketing business. It serves hypermarkets; oil companies, and chemical and petrochemical groups; and traders and wholesalers. The company was founded in 1990 and is headquartered in Paris, France.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75116",
        "website": "http://www.rubis.fr",
        "full_time_employees": 3684
    },
    "RUI.PA": {
        "short_name": "RUBIS",
        "long_name": "Rubis",
        "summary": "Rubis, through its subsidiaries, engages in the operation of bulk liquid storage facilities and distribution of petroleum products in Europe, Africa, and the Caribbean. It operates terminals that provide bulk liquid storage facilities for petroleum products, chemical products, fertilizers, molasses, and edible oils; and distributes liquefied petroleum gas and petroleum products, such as butane, propane, gasoline, diesel, kerosene, fuel oil, etc. The company also provides infrastructure, transportation, supply, and services for supporting the development of downstream distribution and marketing business. It serves hypermarkets; oil companies, and chemical and petrochemical groups; and traders and wholesalers. The company was founded in 1990 and is headquartered in Paris, France.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75116",
        "website": "http://www.rubis.fr",
        "full_time_employees": 3684
    },
    "SCN.BK": {
        "short_name": "SCAN INTER PUBLIC COMPANY LIMIT",
        "long_name": "Scan Inter Public Company Limited",
        "summary": "Scan Inter Public Company Limited, together with its subsidiaries, primarily engages in trading natural gas through vehicle service stations in Thailand. The company operates through four segments: Gas Related Business, Car Dealer and Spare Parts, Renewable Energy, and Others. The Gas Related Business segment engages in trading gas through natural gas for vehicle (NGV) service stations; filling gas of industrial compressed natural gas for industrial applications; providing service for quality improvement of natural gas; and transporting natural gas. This segment is also involved in the design, installation, repair, and maintenance of natural gas dispenser equipment; and design and installation of gas system in vehicles, as well as the testing of vehicle cylinders. It owns 13 NGV service stations. The Car Dealer and Spare Parts segment trades in cars and related spare parts. The Renewable Energy segment operates a solar power plant. The Others segment trades in liquid carbon dioxide, engine oil, and lubricants; and operates convenient stores, as well as provides transportation, warehousing, and distribution services.it also exports battery and glass. Scan Inter Public Company Limited is headquartered in Nonthaburi, Thailand.",
        "currency": "THB",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Nonthaburi",
        "zipcode": "11120",
        "website": "http://www.scan-inter.com",
        "full_time_employees": null
    },
    "SNM.F": {
        "short_name": "SNAM S.P.A.",
        "long_name": "Snam S.p.A.",
        "summary": "Snam S.p.A., together with its subsidiaries, engages in the creation and integrated management of natural gas infrastructure in Italy. The company operates through three segments: Natural Gas Transportation, Liquefied Natural Gas (LNG) Regasification, and Natural Gas Storage. It provides natural gas transportation and dispatching services with approximately 32,600 kilometers of high-and medium-pressure gas pipelines; and owns and manages LNG regasification plants. The company also offers natural gas storage services through an integrated group of infrastructure comprising deposits, wells, gas treatment plants, compression plants, and the operational dispatching system; and operates nine storage concessions, including five in Lombardy, three in Emilia-Romagna, and one in Abruzzo. In addition, it engages in the leasing and maintenance of fiber optic telecommunication cables, as well as provides integrated services in the natural gas mobility sector; energy efficiency solutions and carbon footprint assessments for condominiums, companies, and public administrations; and management of biogas and biomethane plants. Further, the company offers engineering and project management services; and oversight and supervision of a compressor station upgrade and pipeline laying activities. It also operates in Albania, Austria, China, France, Greece, India, Italy, the United Arab Emirates, and the United Kingdom. The company was formerly known as Snam Rete Gas S.p.A. and changed its name to Snam S.p.A. in January 2012. Snam S.p.A. was founded in 1941 and is headquartered in San Donato Milanese, Italy.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "MI",
        "city": "San Donato Milanese",
        "zipcode": "20097",
        "website": "http://www.snam.it",
        "full_time_employees": 2994
    },
    "SNMRF": {
        "short_name": "SNAM SPA",
        "long_name": "Snam S.p.A.",
        "summary": "Snam S.p.A., together with its subsidiaries, engages in the creation and integrated management of natural gas infrastructure in Italy. The company operates through three segments: Natural Gas Transportation, Liquefied Natural Gas (LNG) Regasification, and Natural Gas Storage. It provides natural gas transportation and dispatching services with approximately 32,600 kilometers of high-and medium-pressure gas pipelines; and owns and manages LNG regasification plants. The company also offers natural gas storage services through an integrated group of infrastructure comprising deposits, wells, gas treatment plants, compression plants, and the operational dispatching system; and operates nine storage concessions, including five in Lombardy, three in Emilia-Romagna, and one in Abruzzo. In addition, it engages in the leasing and maintenance of fiber optic telecommunication cables, as well as provides integrated services in the natural gas mobility sector; energy efficiency solutions and carbon footprint assessments for condominiums, companies, and public administrations; and management of biogas and biomethane plants. Further, the company offers engineering and project management services; and oversight and supervision of a compressor station upgrade and pipeline laying activities. It also operates in Albania, Austria, China, France, Greece, India, Italy, the United Arab Emirates, and the United Kingdom. The company was formerly known as Snam Rete Gas S.p.A. and changed its name to Snam S.p.A. in January 2012. Snam S.p.A. was founded in 1941 and is headquartered in San Donato Milanese, Italy.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Italy",
        "state": "MI",
        "city": "San Donato Milanese",
        "zipcode": "20097",
        "website": "http://www.snam.it",
        "full_time_employees": 2994
    },
    "SNMRY": {
        "short_name": "SNAM SPA",
        "long_name": "Snam S.p.A.",
        "summary": "Snam S.p.A., together with its subsidiaries, engages in the creation and integrated management of natural gas infrastructure in Italy. The company operates through three segments: Natural Gas Transportation, Liquefied Natural Gas (LNG) Regasification, and Natural Gas Storage. It provides natural gas transportation and dispatching services with approximately 32,600 kilometers of high-and medium-pressure gas pipelines; and owns and manages LNG regasification plants. The company also offers natural gas storage services through an integrated group of infrastructure comprising deposits, wells, gas treatment plants, compression plants, and the operational dispatching system; and operates nine storage concessions, including five in Lombardy, three in Emilia-Romagna, and one in Abruzzo. In addition, it engages in the leasing and maintenance of fiber optic telecommunication cables, as well as provides integrated services in the natural gas mobility sector; energy efficiency solutions and carbon footprint assessments for condominiums, companies, and public administrations; and management of biogas and biomethane plants. Further, the company offers engineering and project management services; and oversight and supervision of a compressor station upgrade and pipeline laying activities. It also operates in Albania, Austria, China, France, Greece, India, Italy, the United Arab Emirates, and the United Kingdom. The company was formerly known as Snam Rete Gas S.p.A. and changed its name to Snam S.p.A. in January 2012. Snam S.p.A. was founded in 1941 and is headquartered in San Donato Milanese, Italy.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Italy",
        "state": "MI",
        "city": "San Donato Milanese",
        "zipcode": "20097",
        "website": "http://www.snam.it",
        "full_time_employees": 2994
    },
    "SPB.TO": {
        "short_name": "SUPERIOR PLUS CORP.",
        "long_name": "Superior Plus Corp.",
        "summary": "Superior Plus Corp. engages in the energy distribution and specialty chemicals businesses in Canada, the United States, and Chile. It operates through three segments: Canadian Propane Distribution, United States (U.S.) Propane Distribution, and Specialty Chemicals. The Canadian Propane Distribution segment engages in the propane and natural gas liquid marketing wholesale business in Canada and California. The U.S. Propane Distribution segment distributes and sells propane, heating oil, and other refined fuels in the Eastern U.S., the Midwest, and California. The Specialty Chemicals segment supplies sodium chlorate and technology to the pulp and paper industries, as well as potassium and chlor-alkali products. Superior General Partner Inc. serves as the general partner of the company. The company was founded in 1996 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5V 3C7",
        "website": "http://www.superiorplus.com",
        "full_time_employees": null
    },
    "SPGE.TA": {
        "short_name": "SUPERGAS ENERGY LT",
        "long_name": "Supergas Energy Ltd",
        "summary": "Supergas Energy Ltd. engages in the liquefied petroleum gas (LPG), and natural gas and electricity businesses in Israel. It is involved in the marketing, sale, and distribution of LPG and LPG products; and marketing and sale of natural gas, electricity, and thermal energy. The company also supplies gas balloons. It serves the residential, agricultural, commercial, and industrial sectors. The company was founded in 1953 and is based in Netanya, Israel. Supergas Energy Ltd. is a subsidiary of Elco Ltd.",
        "currency": "ILA",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Netanya",
        "zipcode": "4250532",
        "website": "http://www.supergas.co.il",
        "full_time_employees": 369
    },
    "SPH": {
        "short_name": "Suburban Propane Partners, L.P.",
        "long_name": "Suburban Propane Partners, L.P.",
        "summary": "Suburban Propane Partners, L.P., through its subsidiaries, engages in the retail marketing and distribution of propane, fuel oil, and refined fuels. The company operates in four segments: Propane, Fuel Oil and Refined Fuels, Natural Gas and Electricity, and All Other. The Propane segment is involved in the retail distribution of propane to residential, commercial, industrial, and agricultural customers, as well as in the wholesale distribution to industrial end users. It offers propane primarily for space heating, water heating, cooking, and clothes drying in the residential and commercial markets; for use as a motor fuel in internal combustion engines to power over-the-road vehicles, forklifts, and stationary engines, as well as to fire furnaces, as a cutting gas to the industrial customers, and in other process applications; and for tobacco curing, crop drying, poultry brooding, and weed control in the agricultural markets. The Fuel Oil and Refined Fuels segment engages in the retail distribution of fuel oil, diesel, kerosene, and gasoline to residential and commercial customers for use primarily as a source of heat in homes and buildings. The Natural Gas and Electricity segment markets natural gas and electricity to residential and commercial customers in the deregulated energy markets in New York and Pennsylvania. The All Other segment sells, installs, and services a range of home comfort equipment, including whole-house heating products, air cleaners, humidifiers, and space heaters. As of September 26, 2020, the company served approximately 1.0 million residential, commercial, industrial, and agricultural customers through 700 locations in 41 states primarily in the east and west coast regions of the United States, as well as portions of the midwest region of the United States and Alaska. Suburban Energy Services Group LLC serves as a general partner of Suburban Propane Partners, L.P. The company was founded in 1945 and is headquartered in Whippany, New Jersey.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Whippany",
        "zipcode": "07981-0206",
        "website": "http://www.suburbanpropane.com",
        "full_time_employees": 3169
    },
    "SR-PA": {
        "short_name": "Spire Inc. Depositary Shares, e",
        "long_name": "Spire Inc.",
        "summary": "Spire Inc., through its subsidiaries, engages in the purchase, retail distribution, and sale of natural gas to residential, commercial, industrial, and other end-users of natural gas in the United States. The company operates in two segments, Gas Utility and Gas Marketing. It is also involved in the marketing of natural gas; and provision of energy services on non-regulated basis to on-system utility transportation customers, as well as to retail and wholesale customers. In addition, the company engages in the transportation of propane through its propane pipeline; compression of natural gas; risk management; and other activities. Further, it provides physical natural gas storage services. The company was formerly known as The Laclede Group, Inc. and changed its name to Spire Inc. in April 2016. Spire Inc. was founded in 1857 and is based in St. Louis, Missouri.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MO",
        "city": "St. Louis",
        "zipcode": "63101",
        "website": "http://www.spireenergy.com",
        "full_time_employees": 3583
    },
    "SR": {
        "short_name": "Spire Inc.",
        "long_name": "Spire Inc.",
        "summary": "Spire Inc., through its subsidiaries, engages in the purchase, retail distribution, and sale of natural gas to residential, commercial, industrial, and other end-users of natural gas in the United States. The company operates in two segments, Gas Utility and Gas Marketing. It is also involved in the marketing of natural gas; and provision of energy services on non-regulated basis to on-system utility transportation customers, as well as to retail and wholesale customers. In addition, the company engages in the transportation of propane through its propane pipeline; compression of natural gas; risk management; and other activities. Further, it provides physical natural gas storage services. The company was formerly known as The Laclede Group, Inc. and changed its name to Spire Inc. in April 2016. Spire Inc. was founded in 1857 and is based in St. Louis, Missouri.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MO",
        "city": "St. Louis",
        "zipcode": "63101",
        "website": "http://www.spireenergy.com",
        "full_time_employees": 3583
    },
    "SRCU": {
        "short_name": "SPIRE INC UNIT EXP 01/03/2024",
        "long_name": "Spire Inc.",
        "summary": "Spire Inc., through its subsidiaries, engages in the purchase, retail distribution, and sale of natural gas to residential, commercial, industrial, and other end-users of natural gas in the United States. The company operates in two segments, Gas Utility and Gas Marketing. It is also involved in the marketing of natural gas; and provision of energy services on non-regulated basis to on-system utility transportation customers, as well as to retail and wholesale customers. In addition, the company engages in the transportation of propane through its propane pipeline; compression of natural gas; risk management; and other activities. Further, it provides physical natural gas storage services. The company was formerly known as The Laclede Group, Inc. and changed its name to Spire Inc. in April 2016. Spire Inc. was founded in 1857 and is based in St. Louis, Missouri.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MO",
        "city": "St. Louis",
        "zipcode": "63101",
        "website": "http://www.spireenergy.com",
        "full_time_employees": 3583
    },
    "SRG.MI": {
        "short_name": "SNAM",
        "long_name": "Snam S.p.A.",
        "summary": "Snam S.p.A., together with its subsidiaries, engages in the creation and integrated management of natural gas infrastructure in Italy. The company operates through three segments: Natural Gas Transportation, Liquefied Natural Gas (LNG) Regasification, and Natural Gas Storage. It provides natural gas transportation and dispatching services with approximately 32,600 kilometers of high-and medium-pressure gas pipelines; and owns and manages LNG regasification plants. The company also offers natural gas storage services through an integrated group of infrastructure comprising deposits, wells, gas treatment plants, compression plants, and the operational dispatching system; and operates nine storage concessions, including five in Lombardy, three in Emilia-Romagna, and one in Abruzzo. In addition, it engages in the leasing and maintenance of fiber optic telecommunication cables, as well as provides integrated services in the natural gas mobility sector; energy efficiency solutions and carbon footprint assessments for condominiums, companies, and public administrations; and management of biogas and biomethane plants. Further, the company offers engineering and project management services; and oversight and supervision of a compressor station upgrade and pipeline laying activities. It also operates in Albania, Austria, China, France, Greece, India, Italy, the United Arab Emirates, and the United Kingdom. The company was formerly known as Snam Rete Gas S.p.A. and changed its name to Snam S.p.A. in January 2012. Snam S.p.A. was founded in 1941 and is headquartered in San Donato Milanese, Italy.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "San Donato Milanese",
        "zipcode": "20097",
        "website": "http://www.snam.it",
        "full_time_employees": 2994
    },
    "SRG.VI": {
        "short_name": "SNAM SPA",
        "long_name": "Snam S.p.A.",
        "summary": "Snam S.p.A., together with its subsidiaries, engages in the creation and integrated management of natural gas infrastructure in Italy. The company operates through three segments: Natural Gas Transportation, Liquefied Natural Gas (LNG) Regasification, and Natural Gas Storage. It provides natural gas transportation and dispatching services with approximately 32,600 kilometers of high-and medium-pressure gas pipelines; and owns and manages LNG regasification plants. The company also offers natural gas storage services through an integrated group of infrastructure comprising deposits, wells, gas treatment plants, compression plants, and the operational dispatching system; and operates nine storage concessions, including five in Lombardy, three in Emilia-Romagna, and one in Abruzzo. In addition, it engages in the leasing and maintenance of fiber optic telecommunication cables, as well as provides integrated services in the natural gas mobility sector; energy efficiency solutions and carbon footprint assessments for condominiums, companies, and public administrations; and management of biogas and biomethane plants. Further, the company offers engineering and project management services; and oversight and supervision of a compressor station upgrade and pipeline laying activities. It also operates in Albania, Austria, China, France, Greece, India, Italy, the United Arab Emirates, and the United Kingdom. The company was formerly known as Snam Rete Gas S.p.A. and changed its name to Snam S.p.A. in January 2012. Snam S.p.A. was founded in 1941 and is headquartered in San Donato Milanese, Italy.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Italy",
        "state": "MI",
        "city": "San Donato Milanese",
        "zipcode": "20097",
        "website": "http://www.snam.it",
        "full_time_employees": 2994
    },
    "SUUIF": {
        "short_name": "SUPERIOR PLUS CORP",
        "long_name": "Superior Plus Corp.",
        "summary": "Superior Plus Corp. engages in the energy distribution and specialty chemicals businesses in Canada, the United States, and Chile. It operates through three segments: Canadian Propane Distribution, United States (U.S.) Propane Distribution, and Specialty Chemicals. The Canadian Propane Distribution segment engages in the propane and natural gas liquid marketing wholesale business in Canada and California. The U.S. Propane Distribution segment distributes and sells propane, heating oil, and other refined fuels in the Eastern U.S., the Midwest, and California. The Specialty Chemicals segment supplies sodium chlorate and technology to the pulp and paper industries, as well as potassium and chlor-alkali products. Superior General Partner Inc. serves as the general partner of the company. The company was founded in 1996 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5V 3C7",
        "website": "http://www.superiorplus.com",
        "full_time_employees": null
    },
    "SWX": {
        "short_name": "Southwest Gas Holdings, Inc.",
        "long_name": "Southwest Gas Holdings, Inc.",
        "summary": "Southwest Gas Holdings, Inc., through its subsidiaries, purchases, distributes, and transports natural gas in Arizona, Nevada, and California. The company operates in two segments, Natural Gas Operations and Utility Infrastructure Services. As of December 31, 2020, it had 2,123,000 residential, commercial, industrial, and other natural gas customers. The company also provides trenching and installation, replacement, and maintenance services for energy distribution systems; and industrial construction solutions. Southwest Gas Holdings, Inc. was incorporated in 1931 and is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89193-8510",
        "website": "http://www.swgasholdings.com",
        "full_time_employees": 11149
    },
    "SZR.F": {
        "short_name": "SOUTHWEST GAS HLDGS  DL 1",
        "long_name": "Southwest Gas Holdings, Inc.",
        "summary": "Southwest Gas Holdings, Inc., through its subsidiaries, purchases, distributes, and transports natural gas in Arizona, Nevada, and California. The company operates in two segments, Natural Gas Operations and Utility Infrastructure Services. As of December 31, 2020, it had 2,123,000 residential, commercial, industrial, and other natural gas customers. The company also provides trenching and installation, replacement, and maintenance services for energy distribution systems; and industrial construction solutions. Southwest Gas Holdings, Inc. was incorporated in 1931 and is headquartered in Las Vegas, Nevada.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89193-8510",
        "website": "http://www.swgasholdings.com",
        "full_time_employees": 11149
    },
    "T9O.F": {
        "short_name": "GAS PLUS S.P.A.",
        "long_name": "Gas Plus S.p.A.",
        "summary": "Gas Plus S.p.A. engages in the exploration and production of natural gas in Italy and internationally. The company is also involved in the distribution, transport, and storage of natural gas. As of December 31, 2018, it holds an interest in 45 hydrocarbon production concessions with 4,271.1 million cubic meters of gas equivalent. The company was founded in 1960 and is based in Milan, Italy. Gas Plus S.p.A. is a subsidiary of Us.Fin. S.r.l.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20134",
        "website": "http://www.gasplus.it",
        "full_time_employees": 155
    },
    "TGASF": {
        "short_name": "TOWNGAS CHINA COMPANY LIMITED",
        "long_name": "Towngas China Company Limited",
        "summary": "Towngas China Company Limited, an investment holding company, sells and distributes piped gas in the People's Republic of China. The company operates through two segments, Sales and Distribution of Piped Gas and Related Products, and Gas Connection. It engages in the provision of piped gas; construction of gas pipelines; operation of city gas pipeline network; operation of gas fuel automobile refilling stations; and sale of gas household appliances. The company also offers financing services; provides engineering works services; and operates vehicle gas refilling stations. It serves approximately 14.14 million customers. The company was formerly known as Panva Gas Holdings Limited and changed its name to Towngas China Company Limited in May 2007. The company was founded in 1998 and is headquartered in North Point, Hong Kong. Towngas China Company Limited is a subsidiary of The Hong Kong and China Gas Company Limited.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.towngaschina.com",
        "full_time_employees": 22506
    },
    "TKGSF": {
        "short_name": "TOKYO GAS CO",
        "long_name": "Tokyo Gas Co.,Ltd.",
        "summary": "Tokyo Gas Co., Ltd. produces, supplies, and sells city and liquid gas, and LNG in Japan. As of March 31, 2020, the company operated approximately 64,545 km pipeline network serving approximately 12.11 million customers. It also invests in venture companies and energy related venture capital funds; installs gas supply lines, water supply and drainage lines, air conditioning systems, and gas main and branch lines; checks safety of underground centers; inspects gas equipment construction; delivers liquefied petroleum gas (LPG); supplies hydrogen and gas; and installs hydrogen fuel cells. In addition, the company engages in the solar power, parcel, LNG tolling, heat supply utility, and independent power production businesses; LNG terminal operation and maintenance; sale of gas for industrial and chemical products; management of a hotel; participation in the shale gas development projects; sale of automotive LPG; and manufacture and sale of liquid carbon dioxide and dry ice. Further, it provides engineering services; sells gas, furniture upholstery, and coke; develops LNG cryogenic utilization technology; plans and manages events and showrooms; handles advertising and publishing; operates showrooms and a call center, and staffing; sells and maintains cogeneration systems; produces and sells LNG, condensate, domgas, coalseam gas, liquefied nitrogen, oxygen, and medical gas; and leases gas equipment and appliances, office equipment, and crediting administrations with installations. Additionally, the company offers building management, fire prevention patrol, travel agency, loan, information processing, software development, computer equipment sale, LNG transport, carriers charter, and rare gas services. It also provides meter, billing, exhaust system, and safety services; operates LPG shipping base; installs and maintains gas supply facilities; and develops, manages, and leases real estate and housing. The company was founded in 1885 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8527",
        "website": "http://www.tokyo-gas.co.jp",
        "full_time_employees": null
    },
    "TKGSY": {
        "short_name": "TOKYO GAS CO",
        "long_name": "Tokyo Gas Co.,Ltd.",
        "summary": "Tokyo Gas Co., Ltd. produces, supplies, and sells city and liquid gas, and LNG in Japan. As of March 31, 2020, the company operated approximately 64,545 km pipeline network serving approximately 12.11 million customers. It also invests in venture companies and energy related venture capital funds; installs gas supply lines, water supply and drainage lines, air conditioning systems, and gas main and branch lines; checks safety of underground centers; inspects gas equipment construction; delivers liquefied petroleum gas (LPG); supplies hydrogen and gas; and installs hydrogen fuel cells. In addition, the company engages in the solar power, parcel, LNG tolling, heat supply utility, and independent power production businesses; LNG terminal operation and maintenance; sale of gas for industrial and chemical products; management of a hotel; participation in the shale gas development projects; sale of automotive LPG; and manufacture and sale of liquid carbon dioxide and dry ice. Further, it provides engineering services; sells gas, furniture upholstery, and coke; develops LNG cryogenic utilization technology; plans and manages events and showrooms; handles advertising and publishing; operates showrooms and a call center, and staffing; sells and maintains cogeneration systems; produces and sells LNG, condensate, domgas, coalseam gas, liquefied nitrogen, oxygen, and medical gas; and leases gas equipment and appliances, office equipment, and crediting administrations with installations. Additionally, the company offers building management, fire prevention patrol, travel agency, loan, information processing, software development, computer equipment sale, LNG transport, carriers charter, and rare gas services. It also provides meter, billing, exhaust system, and safety services; operates LPG shipping base; installs and maintains gas supply facilities; and develops, manages, and leases real estate and housing. The company was founded in 1885 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8527",
        "website": "http://www.tokyo-gas.co.jp",
        "full_time_employees": null
    },
    "TLJ.F": {
        "short_name": "CN TIAN LUN GAS HL.HD-,01",
        "long_name": "China Tian Lun Gas Holdings Limited",
        "summary": "China Tian Lun Gas Holdings Limited, together with its subsidiaries, engages in the transportation, distribution, and sale of natural gas and compressed natural gas through its gas pipeline connections in the People' Republic of China. The company provides construction, designing, laying, installation, and maintenance services for gas pipeline connections. It also constructs and operates gas filling stations; produces and sells liquefied natural gas in bulk and in cylinders; sells gas equipment; provides engineering design and consulting, and new energy technology development services; trades in natural gas equipment; invests in equity and assets; and sells urban gas and gas appliances. The company serves to residential, vehicles, commercial, and industrial sectors. It owns 51 gas refilling stations. The company was founded in 2002 and is headquartered in Zhengzhou, the People's Republic of China. China Tian Lun Gas Holdings Limited is a subsidiary of Tian Lun Group Limited.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": "450003",
        "website": "http://www.tianlungas.com",
        "full_time_employees": null
    },
    "TOG.F": {
        "short_name": "TOKYO GAS CO. LTD",
        "long_name": "Tokyo Gas Co.,Ltd.",
        "summary": "Tokyo Gas Co., Ltd. produces, supplies, and sells city and liquid gas, and LNG in Japan. As of March 31, 2020, the company operated approximately 64,545 km pipeline network serving approximately 12.11 million customers. It also invests in venture companies and energy related venture capital funds; installs gas supply lines, water supply and drainage lines, air conditioning systems, and gas main and branch lines; checks safety of underground centers; inspects gas equipment construction; delivers liquefied petroleum gas (LPG); supplies hydrogen and gas; and installs hydrogen fuel cells. In addition, the company engages in the solar power, parcel, LNG tolling, heat supply utility, and independent power production businesses; LNG terminal operation and maintenance; sale of gas for industrial and chemical products; management of a hotel; participation in the shale gas development projects; sale of automotive LPG; and manufacture and sale of liquid carbon dioxide and dry ice. Further, it provides engineering services; sells gas, furniture upholstery, and coke; develops LNG cryogenic utilization technology; plans and manages events and showrooms; handles advertising and publishing; operates showrooms and a call center, and staffing; sells and maintains cogeneration systems; produces and sells LNG, condensate, domgas, coalseam gas, liquefied nitrogen, oxygen, and medical gas; and leases gas equipment and appliances, office equipment, and crediting administrations with installations. Additionally, the company offers building management, fire prevention patrol, travel agency, loan, information processing, software development, computer equipment sale, LNG transport, carriers charter, and rare gas services. It also provides meter, billing, exhaust system, and safety services; operates LPG shipping base; installs and maintains gas supply facilities; and develops, manages, and leases real estate and housing. The company was founded in 1885 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8527",
        "website": "http://www.tokyo-gas.co.jp",
        "full_time_employees": null
    },
    "UGI": {
        "short_name": "UGI Corporation",
        "long_name": "UGI Corporation",
        "summary": "UGI Corporation distributes, stores, transports, and markets energy products and related services in the United States and internationally. The company operates through four segments: AmeriGas Propane, UGI International, Midstream & Marketing, and UGI Utilities. It distributes propane to approximately 1.5 million residential, commercial/industrial, motor fuel, agricultural, and wholesale customers through 1,800 propane distribution locations; and sells, installs, and services propane appliances, including heating systems and propane-powered generators. The company also distributes liquefied petroleum gases (LPG) to residential, commercial, industrial, agricultural, wholesale and automobile fuel customers; and provides logistics, storage, and other services to third-party LPG distributors. In addition, it engages in the retail sale of natural gas, liquid fuels, and electricity to approximately 14,000 residential, commercial, and industrial customers at 45,000 locations. Further, the company distributes natural gas to approximately 670,000 customers in the portions of 46 eastern and central Pennsylvania counties through its distribution system of 12,300 miles of gas mains; and supplies electricity to approximately 62,500 customers in northeastern Pennsylvania through 2,500 miles of lines and 14 substations. Additionally, it operates electric generation facilities, which include coal-fired, landfill gas-fueled, solar-powered, and natural gas-fueled facilities; a natural gas liquefaction, storage, and vaporization facility; propane storage and propane-air mixing stations; and rail transshipment terminals. It also manages natural gas pipeline and storage contracts; develops, owns, and operates pipelines, gathering infrastructure, and gas storage facilities. UGI Corporation was founded in 1882 and is headquartered in King of Prussia, Pennsylvania.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "King of Prussia",
        "zipcode": "19406",
        "website": "http://www.ugicorp.com",
        "full_time_employees": 11300
    },
    "UMA.F": {
        "short_name": "LATVIJAS GAZE  EO 1,40",
        "long_name": "AS Latvijas Gaze",
        "summary": "AS Latvijas Gaze engages in the purchase, trading, distribution, and sale of natural gas in Latvia, Lithuania, and Estonia. It operates through Natural Gas Sales & Trading, and Natural Gas Distribution segments. The company supplies natural gas to approximately 400 thousand customers in Latvia. It serves industrial and commercial customers, as well as households. The company is based in Riga, Latvia.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Latvia",
        "state": null,
        "city": "Riga",
        "zipcode": "1001",
        "website": "http://lg.lv",
        "full_time_employees": 989
    },
    "WP.BK": {
        "short_name": "WP ENERGY PUBLIC COMPANY LIMITE",
        "long_name": "WP Energy Public Company Limited",
        "summary": "WP Energy Public Company Limited, together with its subsidiaries, trades in liquefied petroleum gas (LPG) under the World Gas brand name. The company operates through Sale of LPG and Transportation segments. It distributes LPG cylinder to the LPG gas filling plants, retail gas distributors, and industrial and household users, as well as offers specialized LPG cylinders for forklift trucks. The company also transports oil, gas, and chemical substances; operates gas station; produces and distributes electricity; and leases vehicles. WP Energy Public Company Limited was founded in 2014 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10900",
        "website": "http://www.wp-energy.co.th",
        "full_time_employees": null
    },
    "WS7A.F": {
        "short_name": "BINHAI INVESTM.CO. HD-,10",
        "long_name": "Binhai Investment Company Limited",
        "summary": "Binhai Investment Company Limited, an investment holding company, engages in the construction of gas pipeline networks, provision of connection services, and sale of liquefied petroleum gas (LPG) and piped gas in Hong Kong. The company operates through Sales of Piped Natural Gas, Construction and Gas Pipeline Installation Service, Gas Passing through Service, and Sales of Bottled Natural Gas segments. It also sells piped and bottled natural gas through its pipeline networks to residential and industrial users. In addition, the company is involved in the construction of gas pipelines and installation of appliances to connect customers to pipeline networks under connection contracts to industrial and commercial customers, property developers, and property management companies. As of December 31, 2020, it had a gas pipeline network of approximately 3,355 kilometers. The company was founded in 1994 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.binhaiinv.com",
        "full_time_employees": 1718
    },
    "XGH.F": {
        "short_name": "ENN ENERGY HLDGS  HD-,10",
        "long_name": "ENN Energy Holdings Limited",
        "summary": "ENN Energy Holdings Limited, an investment holding company, engages in the investment, construction, operation, and management of gas pipeline infrastructures; and integrated energy, and vehicle and ship refueling stations in the People's Republic of China. It operates through Retail Gas Sales Business, Integrated Energy Business, Wholesale of Gas, Construction and Installation, and Value Added Business segments. The company also sells and distributes piped gas, liquefied natural gas, and other multi-energy products; and provides other services in relation to energy supply. In addition, it is involved in the business of energy trading; retail of gas pipelines, and related materials and equipment; transportation of oil products and gas; and sourcing of compressed pipeline gas, as well as wholesale and retail of LNG, CNG, gas equipment, appliances, and others; and provision of financial services. As of December 31, 2020, the company served approximately 23.21 million residential customers and 177,128 commercial/industrial customers. The company was formerly known as XinAo Gas Holdings Limited and changed its name to ENN Energy Holdings Limited in September 2010. ENN Energy Holdings Limited was founded in 1992 and is headquartered in Langfang, China.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Langfang",
        "zipcode": "065001",
        "website": "http://www.ennenergy.com",
        "full_time_employees": null
    },
    "XNGSF": {
        "short_name": "ENN ENERGY HOLDINGS LTD",
        "long_name": "ENN Energy Holdings Limited",
        "summary": "ENN Energy Holdings Limited, an investment holding company, engages in the investment, construction, operation, and management of gas pipeline infrastructures; and integrated energy, and vehicle and ship refueling stations in the People's Republic of China. It operates through Retail Gas Sales Business, Integrated Energy Business, Wholesale of Gas, Construction and Installation, and Value Added Business segments. The company also sells and distributes piped gas, liquefied natural gas, and other multi-energy products; and provides other services in relation to energy supply. In addition, it is involved in the business of energy trading; retail of gas pipelines, and related materials and equipment; transportation of oil products and gas; and sourcing of compressed pipeline gas, as well as wholesale and retail of LNG, CNG, gas equipment, appliances, and others; and provision of financial services. As of December 31, 2020, the company served approximately 23.21 million residential customers and 177,128 commercial/industrial customers. The company was formerly known as XinAo Gas Holdings Limited and changed its name to ENN Energy Holdings Limited in September 2010. ENN Energy Holdings Limited was founded in 1992 and is headquartered in Langfang, China.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Langfang",
        "zipcode": "065001",
        "website": "http://www.ennenergy.com",
        "full_time_employees": null
    },
    "XNGSY": {
        "short_name": "ENN ENERGY HOLDINGS LTD",
        "long_name": "ENN Energy Holdings Limited",
        "summary": "ENN Energy Holdings Limited, an investment holding company, engages in the investment, construction, operation, and management of gas pipeline infrastructures; and integrated energy, and vehicle and ship refueling stations in the People's Republic of China. It operates through Retail Gas Sales Business, Integrated Energy Business, Wholesale of Gas, Construction and Installation, and Value Added Business segments. The company also sells and distributes piped gas, liquefied natural gas, and other multi-energy products; and provides other services in relation to energy supply. In addition, it is involved in the business of energy trading; retail of gas pipelines, and related materials and equipment; transportation of oil products and gas; and sourcing of compressed pipeline gas, as well as wholesale and retail of LNG, CNG, gas equipment, appliances, and others; and provision of financial services. As of December 31, 2020, the company served approximately 23.21 million residential customers and 177,128 commercial/industrial customers. The company was formerly known as XinAo Gas Holdings Limited and changed its name to ENN Energy Holdings Limited in September 2010. ENN Energy Holdings Limited was founded in 1992 and is headquartered in Langfang, China.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Langfang",
        "zipcode": "065001",
        "website": "http://www.ennenergy.com",
        "full_time_employees": null
    },
    "XSG.F": {
        "short_name": "SAIBU GAS HOLDINGS CO.LTD",
        "long_name": "Saibu Gas Holdings Co.,Ltd.",
        "summary": "Saibu Gas Holdings Co.,Ltd. produces, supplies, and sells natural gas in Japan. The company also utilizes LNG cryogenic energy; and sells LNG. In addition, it produces, sells, and installs gas equipment and apparatus, as well as undertakes related construction works. The company was formerly known as Saibu Gas Co.,Ltd. and changed its name to Saibu Gas Holdings Co.,Ltd. in April 2021. Saibu Gas Holdings Co.,Ltd. was founded in 1902 and is headquartered in Fukuoka, Japan.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka City",
        "zipcode": null,
        "website": "http://www.saibugas.co.jp",
        "full_time_employees": null
    }
}