{
  "4137.TW": {
    "city": "Grand Cayman",
    "country": "Cayman Islands",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Household & Personal Products",
    "long_name": "Chlitina Holding Limited",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "CHLITINA HOLDING LIMITED",
    "state": null,
    "summary": "Chlitina Holding Limited, together with its subsidiaries, researches, develops, manufactures, and markets beauty skincare products in China and internationally. It offers makeup removers, facial cleansers, hydrating toners, lotions, moisturizing creams, facial masks, sunscreens, and foundation makeup products; eye care, anti-wrinkle, whitening, and hydrating products; and professional salon botanical extracts, herbal essence products, essential oils, and breast enlargement products under the Chlitina brand name. The company also provides enterprise management consulting services; medical cosmetology services; and cosmetology training services to beauty professionals, as well as operates as a dealer of health food and daily necessities products, skincare and supplementary health care products, and general practice and foods. The company sells its products online. As of December 31, 2019, it operated through a network of 4,809 CHLITINA franchised beauty salons in mainland China, Taiwan, Hong Kong, and South East Asia. Chlitina Holding Limited was founded in 1989 and is headquartered in Grand Cayman, the Cayman Islands.",
    "website": "http://www.chlitina.com",
    "zipcode": "KY1-1111"
  },
  "4154.TWO": {
    "city": "Camana Bay",
    "country": "Cayman Islands",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Beverages - Non-Alcoholic",
    "long_name": "Kino Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "KINO CO LTD",
    "state": null,
    "summary": "Kino Co., Ltd. engages in the development and selling of healthcare and beauty products in Malaysia, Singapore, China, Taiwan, and internationally. It operates through Functional Drinks, Health Care Products, Food Service and Entertainment, Performing arts, and Others segments. The company offers nutraceutical products, including health related enhancement functional drinks, as well as health pads and herbal tea under the Kinohimitsu brand; and facial mask, cleanser, slimming cream, and other skincare products under the Activa and Xpertise brands. It is also involved in the business of restaurant and entertainment, conduction of artistic performance activities, production and brokerage, and sale of tickets. In addition, the company engages in the production of fine metal accessories. The company sells its products through pharmacies, departmental chains, hypermarkets, and health and beauty stores. It operates a network of approximately 5,000 physical channels. The company was formerly known as Kino Biotech Co., Ltd. The company was incorporated in 2010 and is headquartered in Camana Bay, the Cayman Islands.",
    "website": "http://www.kinobiotech.com",
    "zipcode": "KY1-9007"
  },
  "4190.TW": {
    "city": "Grand Cayman",
    "country": "Cayman Islands",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Household & Personal Products",
    "long_name": "Jourdeness Group Limited",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "JOURDENESS GROUP LIMITED",
    "state": null,
    "summary": "Jourdeness Group Limited, together with its subsidiaries, manufactures and distributes cosmetics. It is involved in the beauty and body spa business, which include online beauty courses; and management and consulting activities. It operates approximately 640 skin care and spa direct and franchise chain stores in Taiwan, Mainland China, and Malaysia. Jourdeness Group Limited was founded in 2010 and is headquartered in the Grand Cayman, the Cayman Islands.",
    "website": "http://www.jourdeness.com",
    "zipcode": "KY1-1208"
  },
  "6666.TW": {
    "city": "Grand Cayman",
    "country": "Cayman Islands",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Household & Personal Products",
    "long_name": "Luo Lih-Fen Holding Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "LUO LIH FEN HOLDING CO LTD",
    "state": null,
    "summary": "Luo Lih-Fen Holding Co., Ltd. researches and develops, manufactures, and sells facial beauty care and cosmetic products in Mainland China. The company provides various beauty and health care products under the Glingluo, Sunlily, Draise, Qiecome, Liruoya, and EasyBio brand names, as well as offers beauty and skin care consulting services. It also provides deal management and related personnel training services. The company sells its products to beauty and cosmetic stores through dealers. Luo Lih-Fen Holding Co., Ltd. was founded in 2016 and is headquartered in Grand Cayman, the Cayman Islands.",
    "website": "http://www.luolihfen.com",
    "zipcode": null
  },
  "6671.TW": {
    "city": "Grand Cayman",
    "country": "Cayman Islands",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Household & Personal Products",
    "long_name": "San Neng Group Holdings Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "SAN NENG GROUP HOLDINGS CO LTD",
    "state": null,
    "summary": "San Neng Group Holdings Co., Ltd., through its subsidiaries, engages in the research, development, production, and sale of baking equipment and peripheral products in Taiwan, Mainland China, Japan, and internationally. The company offers baking molds, including baking trays, toast boxes, cake molds, and pie plates; baking appliances comprising eggbeaters and egg whisks, mixing bowls, pastry tubes, pastry bags, revolving cake stands, knives, and trolleys used for baking, and other items that are not required in ovens; and ingredients, such as flour, prepared mix, fillings, fats and oils, food coloring, and other baking materials. It also provides pre-store and interconnected products; utensils for production of bread, cakes, biscuits, candies, Chinese style pastries, and snacks; customized products for central factories, chain bakeries, bakery shops, etc.; and household appliances, as well as kitchen supplies. The company sells its products under the SANNENG and UNOPAN brands. San Neng Group Holdings Co., Ltd. was founded in 2015 and is headquartered in Grand Cayman, the Cayman Islands.",
    "website": "http://www.sannenggroup.com",
    "zipcode": "KY1-1208"
  },
  "8437.TWO": {
    "city": "George Town",
    "country": "Cayman Islands",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Education & Training Services",
    "long_name": "Dadi Early-Childhood Education Group Limited",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "DADI EARLY-CHILDHOOD EDUCATION ",
    "state": null,
    "summary": "Dadi Early-Childhood Education Group Limited, together with its subsidiaries, provides early childhood education management consulting services in Mainland China, Hong Kong, and Taiwan. It offers campus development, classroom decoration, curriculum design, and teaching materials and teaching aids development services; early childhood education supplies; preschool textbooks and toys; and preschool software. The company also wholesales and retails cultural and education products, musical instruments, educational and entertainment materials, computers and office equipment, and information software; and leases office equipment and teaching devices. In addition, it engages in the trading business; IPRs; provision of system integration services; books, audio, and software publication business; and provision of management consultation, general advertising, product design, art and culture, agent, convention and exhibition, and overseas study services. The company was founded in 2008 and is headquartered in George Town, the Cayman Islands.",
    "website": "http://www.edudadi.com",
    "zipcode": "KY 1-9005"
  },
  "FDM.F": {
    "city": "George Town",
    "country": "Cayman Islands",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm Products",
    "long_name": "Fresh Del Monte Produce Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "FRESH DEL MONTE PROD.",
    "state": null,
    "summary": "Fresh Del Monte Produce Inc., through its subsidiaries, produces, markets, and distributes fresh and fresh-cut fruits and vegetables in North America, Europe, the Middle East, Africa, Asia, and internationally. It offers fresh and value added products, such as pineapples, melons, grapes, apples, citrus, blueberries, strawberries, pears, tomatoes, peaches, plums, nectarines, cherries and kiwis, avocados, fresh-cut and prepared fruits and vegetables, juices and other beverages, prepared meals and snacks, bananas, and other fruits and vegetables. The company also engages in poultry and meat products business; and ocean freight business. In addition, it manufactures and sells plastic and box products, such as bins, trays, bags, and boxes. The company offers its products under the Del Monte brand, as well as under other brands, such as UTC, Rosy, Fruit Express, Just Juice, Fruitini, Mann's Logo, Arcadian Harvest, Nourish Bowls, Broccolini, Caulilini, Better Burger Leaf, RomaLeaf, and other regional brands. It markets and distributes its products to retail stores, club stores, convenience stores, wholesalers, distributors, and foodservice operators. Fresh Del Monte Produce Inc. was founded in 1886 and is based in George Town, Cayman Islands.",
    "website": "http://www.freshdelmonte.com",
    "zipcode": "KY1-9005"
  },
  "FDP": {
    "city": "George Town",
    "country": "Cayman Islands",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Farm Products",
    "long_name": "Fresh Del Monte Produce Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "Fresh Del Monte Produce, Inc.",
    "state": null,
    "summary": "Fresh Del Monte Produce Inc., through its subsidiaries, produces, markets, and distributes fresh and fresh-cut fruits and vegetables in North America, Europe, the Middle East, Africa, Asia, and internationally. It offers fresh and value added products, such as pineapples, melons, grapes, apples, citrus, blueberries, strawberries, pears, tomatoes, peaches, plums, nectarines, cherries and kiwis, avocados, fresh-cut and prepared fruits and vegetables, juices and other beverages, prepared meals and snacks, bananas, and other fruits and vegetables. The company also engages in poultry and meat products business; and ocean freight business. In addition, it manufactures and sells plastic and box products, such as bins, trays, bags, and boxes. The company offers its products under the Del Monte brand, as well as under other brands, such as UTC, Rosy, Fruit Express, Just Juice, Fruitini, Mann's Logo, Arcadian Harvest, Nourish Bowls, Broccolini, Caulilini, Better Burger Leaf, RomaLeaf, and other regional brands. It markets and distributes its products to retail stores, club stores, convenience stores, wholesalers, distributors, and foodservice operators. Fresh Del Monte Produce Inc. was founded in 1886 and is based in George Town, Cayman Islands.",
    "website": "http://www.freshdelmonte.com",
    "zipcode": "KY1-9005"
  },
  "FHAI": {
    "city": null,
    "country": "Cayman Islands",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Fountain Healthy Aging, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "FOUNTAIN HEALTHY AGING INC",
    "state": null,
    "summary": "Wei Lian Jin Meng Group Limited, through its subsidiaries, develops, produces, markets, and sells coffee tea products. It also offers black coffee products and other coffee products. The company sell its products wholesale to retail partners and corporate customers, as well as sells directly to consumers via its e-commerce channels in the People's Republic of China. The company is based in the Cayman Islands.",
    "website": null,
    "zipcode": null
  },
  "GFHG.L": {
    "city": "Grand Cayman",
    "country": "Cayman Islands",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Education & Training Services",
    "long_name": "Grand Fortune High Grade Limited",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "GRAND FORTUNE HIGH GRADE LIMITE",
    "state": null,
    "summary": "Grand Fortune High Grade Limited develops and operates financial training courses in China. The company was formerly known as New Horizons Ultra Limited and changed its name to Grand Fortune High Grade Limited in May 2016. The company was incorporated in 2015 and is based in Grand Cayman, the Cayman Islands.",
    "website": "http://www.gf-hg.com",
    "zipcode": "KY1-1107"
  }
}
