{
    "8437.TWO": {
        "short_name": "DADI EARLY-CHILDHOOD EDUCATION ",
        "long_name": "Dadi Early-Childhood Education Group Limited",
        "summary": "Dadi Early-Childhood Education Group Limited, together with its subsidiaries, provides early childhood education management consulting services in Mainland China, Hong Kong, and Taiwan. It offers campus development, classroom decoration, curriculum design, and teaching materials and teaching aids development services; early childhood education supplies; preschool textbooks and toys; and preschool software. The company also wholesales and retails cultural and education products, musical instruments, educational and entertainment materials, computers and office equipment, and information software; and leases office equipment and teaching devices. In addition, it engages in the trading business; IPRs; provision of system integration services; books, audio, and software publication business; and provision of management consultation, general advertising, product design, art and culture, agent, convention and exhibition, and overseas study services. The company was founded in 2008 and is headquartered in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY 1-9005",
        "website": "http://www.edudadi.com",
        "market_cap": "Small Cap"
    },
    "GFHG.L": {
        "short_name": "GRAND FORTUNE HIGH GRADE LIMITE",
        "long_name": "Grand Fortune High Grade Limited",
        "summary": "Grand Fortune High Grade Limited develops and operates financial training courses in China. The company was formerly known as New Horizons Ultra Limited and changed its name to Grand Fortune High Grade Limited in May 2016. The company was incorporated in 2015 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1107",
        "website": "http://www.gf-hg.com",
        "market_cap": null
    }
}