{
    "9YIA.SG": {
        "short_name": "Ability Inc. Registered Shares ",
        "long_name": "Ability Inc.",
        "summary": "Ability Inc., through its subsidiaries, provides interception, geolocation, and cyber intelligence products and solutions for security and intelligence agencies, military forces, law enforcement agencies, and homeland security agencies worldwide. It specializes in off-air interception of voice, SMS, and data communication from cellular and satellite communication networks; and deciphering solutions for cellular and satellite communications. The company offers strategic and tactical cellular interception systems for intercepting mobile phone traffic and tracking mobile phone users; and iridium, advanced thuraya, and satellite link interception systems. In addition, it provides international mobile subscriber identity catchers, advanced CDMA interception systems, in-between interception systems, and ultimate interceptions; geolocation systems to geographically target mobile phones; and cyber solutions that enable the user to extract and view information from mobile phones. The company was founded in 1994 and is headquartered in Tel Aviv, Israel.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "ABIL.TA": {
        "short_name": "ABILITY INC",
        "long_name": "Ability Inc.",
        "summary": "Ability Inc., through its subsidiaries, provides interception, geolocation, and cyber intelligence products and solutions for security and intelligence agencies, military forces, law enforcement agencies, and homeland security agencies worldwide. It specializes in off-air interception of voice, SMS, and data communication from cellular and satellite communication networks; and deciphering solutions for cellular and satellite communications. The company offers strategic and tactical cellular interception systems for intercepting mobile phone traffic and tracking mobile phone users; and iridium, advanced thuraya, and satellite link interception systems. In addition, it provides international mobile subscriber identity catchers, advanced CDMA interception systems, in-between interception systems, and ultimate interceptions; geolocation systems to geographically target mobile phones; and cyber solutions that enable the user to extract and view information from mobile phones. The company was founded in 1994 and is headquartered in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "ABILF": {
        "short_name": "ABILITY INC",
        "long_name": "Ability Inc.",
        "summary": "Ability Inc., through its subsidiaries, provides interception, geolocation, and cyber intelligence products and solutions for security and intelligence agencies, military forces, law enforcement agencies, and homeland security agencies worldwide. It specializes in off-air interception of voice, SMS, and data communication from cellular and satellite communication networks; and deciphering solutions for cellular and satellite communications. The company offers strategic and tactical cellular interception systems for intercepting mobile phone traffic and tracking mobile phone users; and iridium, advanced thuraya, and satellite link interception systems. In addition, it provides international mobile subscriber identity catchers, advanced CDMA interception systems, in-between interception systems, and ultimate interceptions; geolocation systems to geographically target mobile phones; and cyber solutions that enable the user to extract and view information from mobile phones. The company was founded in 1994 and is headquartered in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "AU1.F": {
        "short_name": "AUDIOCODES LTD.  IS 0,01",
        "long_name": "AudioCodes Ltd.",
        "summary": "AudioCodes Ltd., together with its subsidiaries, designs, develops, and sells voice over IP (VoIP), converged VoIP, and data networking solutions, products, and applications for enterprise unified communications, contact centers, and service provider business services. The company's products include IP phones, session border controllers (SBC), media gateways, multi-service business routers, residential gateways, media servers, value added applications, life cycle management solutions, professional services, and survivable branch appliances; device manager; CloudBond 365, an adaptable solution for the data center, customer premises or the branch; and User Management Pack 365, a software management application. It also provides VocaNOM call routing products; SmartTAP call recording products; Auto Attendant, a tool for managing inbound calls and delivery services; signal processor chips; and communications board products. In addition, the company offers planning, implementation, operations, and support services. It primarily markets and sells its products through a direct sales force and sales representatives to original equipment manufacturers, system integrators and distributors, and network equipment providers in the telecommunication and networking industries. The company operates in the Americas, Europe, the Far East, and Israel. AudioCodes Ltd. was incorporated in 1992 and is headquartered in Lod, Israel.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Lod"
    },
    "AUDC": {
        "short_name": "AudioCodes Ltd.",
        "long_name": "AudioCodes Ltd.",
        "summary": "AudioCodes Ltd., together with its subsidiaries, provides advanced communications software, products, and productivity solutions for the digital workplace. It offers solutions, products, and applications for enterprise unified communications environments, work-from-home agents and contact centers, voice and telephony AI-based applications, and service provider business services. The company's products include IP phones and meeting room solutions, session border controllers (SBC), media gateways, multi-service business routers and universal customer premises equipment, VoIP network routing solutions, media servers, value added applications, life cycle management solutions, and professional services, as well as survivable branch appliances and CCE; device manager; CloudBond 365, an adaptable solution; and User Management Pack 365, a user lifecycle and identity management application. It also provides management solutions, such as voice network management solution, the One Voice Operations Center, call routing and policy management tool, and AudioCodes Routing Manager. In addition, the company offers AudioCodes Live for Microsoft Teams, a portfolio of managed services that removes complexity from the integration of Teams collaboration, unified communications, and enterprise telephony; and VoiceAI Connect Cloud Edition, a cloud-based service enabling the bot development ecosystem to develop an array of voice-bot use cases via trials and proof of concept projects, as well as provides a range of value-added voice applications comprising SmartTAP, Voca, VoiceAI Connect, Meeting Insights, and management application services. It primarily markets and sells its products through a direct sales force and sales representatives to original equipment manufacturers, system integrators and distributors, and network equipment providers in the telecommunication and networking industries. The company primarily operates in the Americas, Europe, the Far East, and Israel. AudioCodes Ltd. was incorporated in 1992 and is headquartered in Lod, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Lod"
    },
    "AUDC.TA": {
        "short_name": "AUDIOCODES",
        "long_name": "AudioCodes Ltd.",
        "summary": "AudioCodes Ltd., together with its subsidiaries, designs, develops, and sells voice over IP (VoIP), converged VoIP, and data networking solutions, products, and applications for enterprise unified communications, contact centers, and service provider business services. The company's products include IP phones, session border controllers (SBC), media gateways, multi-service business routers, residential gateways, media servers, value added applications, life cycle management solutions, professional services, and survivable branch appliances; device manager; CloudBond 365, an adaptable solution for the data center, customer premises or the branch; and User Management Pack 365, a software management application. It also provides VocaNOM call routing products; SmartTAP call recording products; Auto Attendant, a tool for managing inbound calls and delivery services; signal processor chips; and communications board products. In addition, the company offers planning, implementation, operations, and support services. It primarily markets and sells its products through a direct sales force and sales representatives to original equipment manufacturers, system integrators and distributors, and network equipment providers in the telecommunication and networking industries. The company operates in the Americas, Europe, the Far East, and Israel. AudioCodes Ltd. was incorporated in 1992 and is headquartered in Lod, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Lod"
    },
    "BOQ.SG": {
        "short_name": "BOS BETTER ONLINE SOLUT. LTD. R",
        "long_name": "B.O.S. Better Online Solutions Ltd.",
        "summary": "B.O.S. Better Online Solutions Ltd. provides intelligent robotics, radio frequency identification (RFID), and supply chain solutions for enterprises worldwide. The Intelligent Robotics Division provides In-Mould Labelling, a robotic system that is used for manufacturing of containers by blow molding, injection molding, or thermoforming processes through the use of paper or plastic labels; and Downstream Automation, a process starts after the injection mould process ends through the packing of the mould. The RFID Division offers hardware products, such as thermal and barcode printers; RFID and barcode scanners and readers; wireless, mobile, and forklift terminals; wireless infrastructure; active and passive RFID tags; ribbons, labels, and tags; and RFID systems for libraries. It also develops Warehouse Management System, a data collection solution for logistics management in logistic centers and warehouses; RFID systems for libraries; RFID-based systems for tracking inventory in a produce packing house; automatic systems for industrial packing lines; automatic systems to track the production line; and automatic systems to identify and track vehicles for transportation-related settings. In addition, this segment provides maintenance and repair services for data collection equipment, as well as warehouse and on-site service plans; on-site inventory count services in various fields; and asset tagging and counting services for corporate and governmental entities. The Supply Chain Division offers electro-mechanical components, communications products, and components consolidation services to aerospace, defense, and other industries. This segment also provides inventory and quality control management of components entering production lines; and inventory management services for ongoing projects. It markets its products through direct sales and sales agents, as well as through distributors. The company was incorporated in 1990 and is headquartered in Rishon LeZion, Israel.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Israel",
        "city": "Rishon LeZion"
    },
    "BOSC": {
        "short_name": "B.O.S. Better Online Solutions",
        "long_name": "B.O.S. Better Online Solutions Ltd.",
        "summary": "B.O.S. Better Online Solutions Ltd. provides intelligent robotics, radio frequency identification (RFID), and supply chain solutions for enterprises worldwide. The Intelligent Robotics Division provides In-Mould Labelling, a robotic system that is used for manufacturing of containers by blow molding, injection molding, or thermoforming processes through the use of paper or plastic labels; and Downstream Automation, a process starts after the injection mould process ends through the packing of the mould. The RFID Division offers hardware products, such as thermal and barcode printers; RFID and barcode scanners and readers; wireless, mobile, and forklift terminals; wireless infrastructure; active and passive RFID tags; ribbons, labels, and tags; and RFID systems for libraries. It also develops Warehouse Management System, a data collection solution for logistics management in logistic centers and warehouses; RFID systems for libraries; RFID-based systems for tracking inventory in a produce packing house; automatic systems for industrial packing lines; automatic systems to track the production line; and automatic systems to identify and track vehicles for transportation-related settings. In addition, this segment provides maintenance and repair services for data collection equipment, as well as warehouse and on-site service plans; on-site inventory count services in various fields; and asset tagging and counting services for corporate and governmental entities. The Supply Chain Division offers electro-mechanical components, communications products, and components consolidation services to aerospace, defense, and other industries. This segment also provides inventory and quality control management of components entering production lines; and inventory management services for ongoing projects. It markets its products through direct sales and sales agents, as well as through distributors. The company was incorporated in 1990 and is headquartered in Rishon LeZion, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Israel",
        "city": "Rishon LeZion"
    },
    "CMER.TA": {
        "short_name": "C MER INDUSTRIES",
        "long_name": "C. Mer Industries Ltd.",
        "summary": "C. Mer Industries Ltd. engages in the consults, engineers, develops, manufactures, integrates, and implements technology based solutions and end-to-end services in Israel, Latin America, the United States, Africa, the United Kingdom, and Asia. The company offers products and services in the areas of communication infrastructure, homeland security, safe and smart city, fire responders and public safety communication, cyber and intelligence, mobile platforms, and tactical defense communication. It also provides professional services, such as risk assessment, consulting, manpower vetting, training, ongoing maintenance, and design and construction services for communications and security projects. The company serves customers in telecom, governmental, municipal institution, critical infrastructure, police and first responder, financial institution, border authority, defense, prison, aviation, maritime and public transportation, and intelligence agency industries. C. Mer Industries Ltd. was founded in 1948 and is headquartered in Holon, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Holon"
    },
    "CRNT": {
        "short_name": "Ceragon Networks Ltd.",
        "long_name": "Ceragon Networks Ltd.",
        "summary": "Ceragon Networks Ltd. provides wireless backhaul solutions that enable cellular operators and other wireless service providers to deliver voice and data services. Its wireless backhaul solutions use microwave and millimeter wave technology to transfer telecommunication traffic between base stations, small/distributed cells, and the core of the service provider's network. The company also offers wireless fronthaul solutions that use microwave technology for ultra-high speed, ultra-low latency communication for wireless 5G and 4G base stations. In addition, it provides IP-20 all-outdoor solutions, such as IP-20C, IP-20C-HP, IP-20S, IP-20E, and IP-20V; IP-20 split-mount/all-indoor solutions comprising IP-20N/IP-20A, IP-20F, and IP-20G; and IP-50 disaggregated solutions, including IP-50E, IP-50C, IP-50S, and IP-50FX for various short-haul, long-haul, fronthaul, and enterprise access applications. Further, the company offers network management system; and network and radio planning, site survey, solutions development, installation, network auditing and optimization, maintenance, training, and other services. It provides its services to smart-phone applications, such as internet browsing, social networking, image sharing, music, and video applications; oil and gas companies; public safety organizations; business and public institutions; broadcasters; energy utilities; and private communications networks. The company sells its products through direct sales, original equipment manufacturers, resellers, distributors, and system integrators. It operates in North America, Europe, Africa, the Asia Pacific, the Middle East, India, and Latin America. The company was formerly known as Giganet Ltd. and changed its name to Ceragon Networks Ltd. in September 2000. Ceragon Networks Ltd. was incorporated in 1996 and is headquartered in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "ELS.AX": {
        "short_name": "ELSIGHT FPO",
        "long_name": "Elsight Limited",
        "summary": "Elsight Limited provides connectivity technology solutions. It offers Halo, a communication platform; and Multichannel, a platform through its high bandwidth adaptive data transmission channel communicates live data, video and audio, in real-time, anytime, anywhere by bonding multiple 3G/4G network, Wi-Fi, and/or satellite services; and Multichannel Backpack consisting of dual, long-range, and real-time cellular communications transmission, as well as security to the field with mobility. The company also provides vehicle connectivity solutions for HLS and automotive applications; medical solutions to transport telemedicine solution for medical professionals, emergency workers, and hospitals; and communication links to drones of various shapes and sizes which is used for entertainment, security, and defenses purposes; and Commander 360, a video management platform that enables various scenarios control, which dispatches video from the control center to operational unit in the field, commanders, and law enforcement agencies. It serves technology solutions to public security, banks, law enforcement, government offices, autonomous, fleet management, and military forces. The company was founded in 2009 and is headquartered in Or Yehuda, Israel.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Israel",
        "city": "Or Yehuda"
    },
    "GGN.F": {
        "short_name": "CERAG.NETW.",
        "long_name": "Ceragon Networks Ltd.",
        "summary": "Ceragon Networks Ltd. provides wireless backhaul solutions that enable cellular operators and other wireless service providers to deliver voice and data services. Its wireless backhaul solutions use microwave and millimeter wave technology to transfer telecommunication traffic between base stations, small/distributed cells, and the core of the service provider's network. The company also offers wireless fronthaul solutions that use microwave technology for ultra-high speed, ultra-low latency communication for wireless 5G and 4G base stations. In addition, it provides IP-20 all-outdoor solutions, such as IP-20C, IP-20C-HP, IP-20S, IP-20E, and IP-20V; IP-20 split-mount/all-indoor solutions comprising IP-20N/IP-20A, IP-20F, and IP-20G; and IP-50 disaggregated solutions, including IP-50E, IP-50C, IP-50S, and IP-50FX for various short-haul, long-haul, fronthaul, and enterprise access applications. Further, the company offers network management system; and network and radio planning, site survey, solutions development, installation, network auditing and optimization, maintenance, training, and other services. It provides its services to smart-phone applications, such as internet browsing, social networking, image sharing, music, and video applications; oil and gas companies; public safety organizations; business and public institutions; broadcasters; energy utilities; and private communications networks. The company sells its products through direct sales, original equipment manufacturers, resellers, distributors, and system integrators. It operates in North America, Europe, Africa, the Asia Pacific, the Middle East, India, and Latin America. The company was formerly known as Giganet Ltd. and changed its name to Ceragon Networks Ltd. in September 2000. Ceragon Networks Ltd. was incorporated in 1996 and is headquartered in Tel Aviv, Israel.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "GILT": {
        "short_name": "Gilat Satellite Networks Ltd.",
        "long_name": "Gilat Satellite Networks Ltd.",
        "summary": "Gilat Satellite Networks Ltd., together with its subsidiaries, provides satellite-based broadband communication solutions and services in Latin America, the Asia Pacific, North America, Europe, the Middle East, and Africa. It operates through three segments: Fixed Networks, Mobility Solutions, and Terrestrial Infrastructure Projects. The company designs and manufactures ground-based satellite communications equipment; and provides solutions and end-to-end services. Its portfolio consists of a cloud-based satellite network platform, very small aperture terminals, amplifiers, modems, on-the-move antennas, solid state amplifiers, block upconverters, transceivers, low-profile antennas, and on-the-move/on-the-pause terminals. In addition, the company offers various solutions, including managed satellite network services, network planning and optimization, satellite capacity, remote network operation, call center support, hub and field operations, and communication network construction and installation services. Further, it provides connectivity services, internet access, and telephony services to enterprise, government, and residential customers; and builds telecommunication infrastructure using fiber-optic and wireless technologies for broadband connectivity. Gilat Satellite Networks Ltd. sells its products and solutions to communication service providers and operators, mobile network operators, telecommunication companies, and system integrators, as well as to defense and homeland security organizations, and directly to end-users. The company was founded in 1987 and is headquartered in Petah Tikva, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Petah Tikva"
    },
    "GILT.TA": {
        "short_name": "GILAT SATELLITE NE",
        "long_name": "Gilat Satellite Networks Ltd.",
        "summary": "Gilat Satellite Networks Ltd., together with its subsidiaries, provides satellite-based broadband communication solutions and services in Latin America, the Asia Pacific, North America, Europe, the Middle East, and Africa. It operates through three segments: Fixed Networks, Mobility Solutions, and Terrestrial Infrastructure Projects. The company designs and manufactures ground-based satellite communications equipment; and provides solutions and end-to-end services. Its portfolio consists of a cloud-based satellite network platform, very small aperture terminals, amplifiers, modems, on-the-move antennas, solid state amplifiers, block upconverters, transceivers, low-profile antennas, and on-the-move/on-the-pause terminals. In addition, the company offers various solutions, including managed satellite network services, network planning and optimization, satellite capacity, remote network operation, call center support, hub and field operations, and communication network construction and installation services. Further, it provides connectivity services, internet access, and telephony services to enterprise, government, and residential customers; and builds telecommunication infrastructure using fiber-optic and wireless technologies for broadband connectivity. Gilat Satellite Networks Ltd. sells its products and solutions to communication service providers and operators, mobile network operators, telecommunication companies, and system integrators, as well as to defense and homeland security organizations, and directly to end-users. The company was founded in 1987 and is headquartered in Petah Tikva, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Petah Tikva"
    },
    "GSA.F": {
        "short_name": "GILAT SATELLITE NETWORKS",
        "long_name": "Gilat Satellite Networks Ltd.",
        "summary": "Gilat Satellite Networks Ltd., together with its subsidiaries, provides satellite-based broadband communication solutions and services in Latin America, the Asia Pacific, North America, Europe, the Middle East, and Africa. It operates through three segments: Fixed Networks, Mobility Solutions, and Terrestrial Infrastructure Projects. The company designs and manufactures ground-based satellite communications equipment; and provides solutions and end-to-end services. Its portfolio consists of a cloud-based satellite network platform, very small aperture terminals, amplifiers, modems, on-the-move antennas, solid state amplifiers, block upconverters, transceivers, low-profile antennas, and on-the-move/on-the-pause terminals. In addition, the company offers various solutions, including managed satellite network services, network planning and optimization, satellite capacity, remote network operation, call center support, hub and field operations, and communication network construction and installation services. Further, it provides connectivity services, internet access, and telephony services to enterprise, government, and residential customers; and builds telecommunication infrastructure using fiber-optic and wireless technologies for broadband connectivity. Gilat Satellite Networks Ltd. sells its products and solutions to communication service providers and operators, mobile network operators, telecommunication companies, and system integrators, as well as to defense and homeland security organizations, and directly to end-users. The company was founded in 1987 and is headquartered in Petah Tikva, Israel.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Petah Tikva"
    },
    "I4L.F": {
        "short_name": "ITURAN LOCAT.+CONTR. IS 1",
        "long_name": "Ituran Location and Control Ltd.",
        "summary": "Ituran Location and Control Ltd., together with its subsidiaries, provides location-based services and wireless communications products. The company's Location-Based Services segment provides stolen vehicle recovery and tracking services, which locate, track, and recover stolen vehicles for its subscribers; fleet management services that enable corporate and individual customers to track and manage their vehicles in real time; and personal locator services that allow customers to protect valuable merchandise and equipment. It also offers on-demand navigation guidance, information, and assistance, including the provision of traffic reports and directions, as well as information on the location of gas stations, car repair shops, post offices, hospitals, and other facilities; and Connected Car, service platform includes a back-office application, a telematics device installed in the vehicle, mobile apps for both IOS and Android users, as well as usage based insurance. This segment serves insurance companies and agents, car manufacturers, dealers and importers, cooperative sales channels, and private subscribers. Its Wireless Communications Products segment provides Base Site, a radio receiver that includes a processor and a data computation unit to collect and send data to and from transponders, and to control centers; Control Center, a center consisting of software used to collect data from various base sites, conduct location calculations, and transmit location data to various customers and law enforcement agencies; navigation and tracking devices installed in vehicles; and SMART, a portable transmitter installed in vehicles that sends a signal to the base site enabling the location of vehicles, equipment, or an individual. As of December 31, 2020, it served approximately 17,680,000 end-users in Israel, Brazil, Argentina, Mexico, Ecuador, Colombia, and the United States. The company was incorporated in 1994 and is headquartered in Azor, Israel.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Azor"
    },
    "ITRN": {
        "short_name": "Ituran Location and Control Ltd",
        "long_name": "Ituran Location and Control Ltd.",
        "summary": "Ituran Location and Control Ltd., together with its subsidiaries, provides location-based services and wireless communications products. The company's Location-Based Services segment provides stolen vehicle recovery and tracking services, which locate, track, and recover stolen vehicles for its subscribers; fleet management services that enable corporate and individual customers to track and manage their vehicles in real time; and personal locator services that allow customers to protect valuable merchandise and equipment. It also offers on-demand navigation guidance, information, and assistance, including the provision of traffic reports and directions, as well as information on the location of gas stations, car repair shops, post offices, hospitals, and other facilities; and Connected Car, service platform includes a back-office application, a telematics device installed in the vehicle, mobile apps for both IOS and Android users, as well as usage based insurance. This segment serves insurance companies and agents, car manufacturers, dealers and importers, cooperative sales channels, and private subscribers. Its Wireless Communications Products segment provides Base Site, a radio receiver that includes a processor and a data computation unit to collect and send data to and from transponders, and to control centers; Control Center, a center consisting of software used to collect data from various base sites, conduct location calculations, and transmit location data to various customers and law enforcement agencies; navigation and tracking devices installed in vehicles; and SMART, a portable transmitter installed in vehicles that sends a signal to the base site enabling the location of vehicles, equipment, or an individual. As of December 31, 2020, it served approximately 17,680,000 end-users in Israel, Brazil, Argentina, Mexico, Ecuador, Colombia, and the United States. The company was incorporated in 1994 and is headquartered in Azor, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Azor"
    },
    "MCRNT.TA": {
        "short_name": "MICRONET",
        "long_name": "Micronet Ltd",
        "summary": "Micronet Ltd develops, manufactures, and markets mobile computing platforms for integration into fleet and mobile workforce management solutions. It offers Micronet SmarTab, an android rugged tablet designed for in vehicle and out of vehicle use; Micronet SmartCam, an all-in-one video telematics device; Micronet SmartHub, a telematics on board computer; TREQ-317, an automotive grade platform for various fleet management and ELD solutions; A-317, a rugged fixed-mount mobile data terminal; and OBC-317, a rugged android on board computer. The company's products are used in various vertical markets, including long and short-haul trucking, public transportation, infrastructure, utilities, government, construction, waste management, public safety, and field services. The company is based in Herzliya, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Herzliya"
    },
    "MWE.L": {
        "short_name": "MTI WIRELESS EDGE LTD. ORD ILS0",
        "long_name": "M.T.I Wireless Edge Ltd.",
        "summary": "M.T.I Wireless Edge Ltd. designs, develops, manufactures, and markets antennas and accessories for the commercial and military sectors. It operates through three divisions: Antenna; Water Control and Management; and Distribution & Professional Consulting Services. The company offers broadband, tactical, and specialized communications antennas; antenna systems; RFID antennas that include reader and UHF near field antennas; military antennas, such as airborne, ground, and naval and submarine antennas; and MIMO, dual slant, double dual slant, omni, and base station and CPE antennas, as well as off the shelf, flat, and parabolic antennas. It also provides wireless control systems to manage agricultural irrigation and water distribution for municipal authorities and commercial entities under the Mottech brand; and radio frequency (RF)/microwave components under the MTI Summit Electronics brand. In addition, the company offers consulting, representation, and marketing services to foreign companies in the field of RF and microwave, including engineering services in the field of aerostat systems and system engineering services. The company operates in Europe, the Middle East, Africa, the Americas, the Asia Pacific, and Israel. M.T.I Wireless Edge Ltd. was founded in 1972 and is headquartered in Rosh-Ha'Ayin, Israel.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Israel",
        "city": "Rosh Haayin"
    },
    "RITT": {
        "short_name": "RIT TECHNOLOGY",
        "long_name": "RiT Technologies Ltd.",
        "summary": "RiT Technologies Ltd. provides intelligent infrastructure management (IIM) and indoor optical wireless technology solutions worldwide. The company's IIM products enhance security and network utilization for data centers, communication rooms, and work space environments. Its enterprise solutions include PatchView hardware, which is offered in a cross connect topology; CenterMind data center management software that supports the monitoring of power distribution units, and environmental parameters in data centers; and SMART Cabling System, a structured network infrastructure solution designed for copper and fiber cabling environments. It also offers Beamcaster, an indoor wireless optical solution that allows high-speed, high-bandwidth transmission through optical signals between the central station and the user station. The company's solutions are deployed in a range of organizations, including data centers in the private sector, government agencies, financial institutions, airport authorities, healthcare, and education institutions. RiT Technologies Ltd. markets its products through independent distributors, resellers/integrators, original equipment manufacturers, and other strategic alliance partners with companies. The company was founded in 1989 and is headquartered in Tel Aviv, Israel. RiT Technologies Ltd. operates as a subsidiary of Stins Coman Incorporated.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "RPAC.TA": {
        "short_name": "RAPAC COMM & INFRA",
        "long_name": "Rapac Communication & Infrastructure Ltd",
        "summary": "Rapac Communication & Infrastructure Ltd engages in telecom, government, and energy and infrastructure businesses in Israel. The company distributes communication and IT products; and workstations, laptops, servers, and storage solutions, as well as designs, setups, and maintains IoT solutions. It also markets communication, missile, avionics, navigation, microwave, and other defense systems, as well as provides consultancy, representation, distribution, program management, system integration, business development, engineering/technical support, entrepreneurship, and other support services for the defense community. In addition, the company offers solutions for power generation, transmission, and distribution, as well as for domestic, industrial, and government sectors; and manufactures electrical boards, as well as control systems and instrumentation, organic HV and LV teams, and lighting poles for light and heavy industry, food and pharmaceutical industry, communications and high-tech market, public structures, civil infrastructures, and streets lighting. Further, it operates and manages infrastructure and energy projects; and three power generation plants, as well as gas turbines and PV projects. The company was formerly known as RAPAC Electronics Ltd. Rapac Communication & Infrastructure Ltd. was founded in 1964 and is based in Kfar Netter, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Kfar Netter"
    },
    "S1L.F": {
        "short_name": "SILICOM LTD  IS-,01",
        "long_name": "Silicom Ltd.",
        "summary": "Silicom Ltd., together with its subsidiaries, designs, manufactures, markets, and supports networking and data infrastructure solutions for a range of servers, server-based systems, and communications devices in North America, Europe, and the Asia Pacific. It offers server network interface cards; and smart cards, such as smart server adapters, which include redirector and switching cards, encryption and data compression hardware acceleration cards, forward error correction acceleration and offloading cards, time synchronization cards, and FPGA based cards. The company also provides virtualized and universal customer-premises equipment; edge devices for SD-WAN and NFV deployments; and distributed units for the 5G mobile infrastructure market. It serves original equipment manufacturing, cloud, telco, and service provider customers. The company was incorporated in 1987 and is headquartered in Kfar Sava, Israel.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Kfar Saba"
    },
    "SILC": {
        "short_name": "Silicom Ltd",
        "long_name": "Silicom Ltd.",
        "summary": "Silicom Ltd., together with its subsidiaries, designs, manufactures, markets, and supports networking and data infrastructure solutions for a range of servers, server based systems, and communications devices in North America, Europe, and the Asia Pacific. The company offers server network interface cards; and smart Card products include smart server adapters, such as redirector and switching cards, encryption and data compression hardware acceleration cards, and field programmable gate array based packet processing cards. The company also offers virtualized and universal customer premise equipment edge networking devices for SD-WAN and NFV deployments; networking targeted appliances; and bypass switches and intelligent bypass switches. It serves original equipment manufacturing, cloud, telco, and service provider customers. The company was founded in 1987 and is headquartered in Kfar Sava, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Kfar Saba"
    },
    "TLRD.TA": {
        "short_name": "TELRAD NETWORKS",
        "long_name": "Telrad Networks Ltd",
        "summary": "Telrad Networks Ltd develops and manufactures LTE telecommunications solutions to enable wireless broadband connectivity worldwide. It offers LTE base stations; LTE network devices; and LTE CPE products, as well as related integration and support services. The company serves operators, such as end-to-end LTE solutions, telecom operators, broadband service providers, and citizen's broadband radio services in energy and utility government and municipality markets. Telrad Networks Ltd was founded in 1951 and is based in Lod, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Lod"
    }
}