{
    "BLRN.TA": {
        "short_name": "BLADERANGER LTD",
        "long_name": "BladeRanger",
        "summary": "BladeRanger develops and provides autonomous robots and drones for cleaning and inspecting solar panels and solar power plants. The company's products are based on robotics components and advanced algorithms. BladeRanger is based in Ramat-Efal, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ramat Gan",
        "zipcode": null,
        "website": "http://www.bladeranger.com",
        "market_cap": "Small Cap"
    },
    "BLRNF": {
        "short_name": "BLADERANGER LTD",
        "long_name": "BladeRanger",
        "summary": "BladeRanger develops and provides autonomous robots and drones for cleaning and inspecting solar panels and solar power plants. The company's products are based on robotics components and advanced algorithms. BladeRanger is based in Ramat-Efal, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Ramat Gan",
        "zipcode": null,
        "website": "http://www.bladeranger.com",
        "market_cap": "Small Cap"
    },
    "CLAB.TA": {
        "short_name": "COMPULAB LTD",
        "long_name": "CompuLab Ltd.",
        "summary": "CompuLab Ltd. manufactures and sells ARM-based computer-on-module and system-on-module products worldwide. It also offers miniature fanless-PCs for industrial applications; IoT gateways; and single board computers. Its products are embedded in telecommunication systems, automotive devices, gaming systems, medical devices, aerospace and marine systems, and other applications. The company was founded in 1992 and is based in Yokneam Illit, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Yokneam Illit",
        "zipcode": "2069208",
        "website": "http://www.compulab.com",
        "market_cap": null
    },
    "MSVT.TA": {
        "short_name": "MASSIVIT 3D PRINTI",
        "long_name": "Massivit 3D Printing Technologies Ltd",
        "summary": "Massivit 3D Printing Technologies Ltd. develops and manufactures 3D printing solutions worldwide. The company offers 3D printers for use in automotive, marine, construction, entertainment, and visual communications industries; Massivit 10000, a large-volume additive manufacturing system that shifts the paradigm for large tooling; 3D printing materials; and Massivit Smart, an integrated proprietary software, which simplifies 3D printing workflow and optimizes 3D files for Massivit 3D printing. It provides 3D printing solutions for the engineering, visual communications, entertainment, academia, interior design, and architectural markets. The company was founded in 2013 and is headquartered in Lod, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Lod",
        "zipcode": "712936",
        "website": "http://www.massivit3d.com",
        "market_cap": null
    },
    "NNDM": {
        "short_name": "Nano Dimension Ltd.",
        "long_name": "Nano Dimension Ltd.",
        "summary": "Nano Dimension Ltd., together with its subsidiaries, provides additive electronics in Israel and internationally. Its flagship product is the proprietary DragonFly lights-out digital manufacturing (LDM) system, a precision system that produces professional multilayer circuit-boards, radio frequency antennas, sensors, conductive geometries, and molded connected devices for prototyping through custom additive manufacturing. The company also provides nanotechnology based conductive and dielectric inks; and DragonFly and Switch software to manage the design file and printing process. It markets and sells products and services to companies that develop products with electronic components, including companies in the defense, automotive, consumer electronics, semiconductor, aerospace, and medical industries, as well as research institutes. The company was founded in 2012 and is headquartered in Ness Ziona, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Ness Ziona",
        "zipcode": "7403635",
        "website": "http://www.nano-di.com",
        "market_cap": "Small Cap"
    }
}