{
    "MTRN.TA": {
        "short_name": "MAYTRONICS LTD",
        "long_name": "Maytronics Ltd.",
        "summary": "Maytronics Ltd. offers automated electronic pool cleaning products worldwide. The company provides robotic pool cleaners for residential and commercial pools under the Dolphin name; pool alarms, which are fall sensing alarm systems under the AquaSensor name; and pool covers, which include above water, in water, and solar operated mechanisms under the AQUAlife name. It also offers water-powered motor for pool covers; and computer-aided drowning detection system. The company was founded in 1983 and is based in Jezreel Valley, Israel. Maytronics Ltd. is a subsidiary of Kibbutz Yizre'el Holdings 2004 ACS Ltd.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Jezreel Valley"
    },
    "TDRN.TA": {
        "short_name": "TADIRAN HOLDINGS L",
        "long_name": "Tadiran Holdings Ltd",
        "summary": "Tadiran Holdings Ltd, through its subsidiaries, engages in the development, manufacturing, import, marketing, and distribution of air conditioning systems in Israel. The company offers overhead air conditioners, mini central air conditioners, multi systems inverters, VRF boxes, and multi inverters for the residential, commercial, and industrial markets under the Tadiran, Amcor, and Toshiba brands. It also imports, markets, and distributes various home appliances under the Amcor and Crystal brands; and provides warranty and maintenance services, as well as energy efficiency services. The company was formerly known as Crystal Consumer Products Ltd. and changed its name to Tadiran Holdings Ltd in April 2011. Tadiran Holdings Ltd was founded in 1989 and is based in Petah Tikva, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Petah Tikva"
    }
}