{
  "ECP.TA": {
    "city": "Rishon LeZion",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Consumer Electronics",
    "long_name": "Electra Consumer Products (1970) Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "ELECTRA CONSUMER P",
    "state": null,
    "summary": "Electra Consumer Products (1970) Ltd manufactures, imports, exports, sells, distributes, markets, and provides services to a range of consumer electric products in Israel. The company offers home and commercial air-conditioning solutions, such as air conditioners, mini central air conditioners, inverter systems, VRF systems, multi-split systems, water-based units, and computerized control and management systems, as well as related services. In addition, it operates a chain network of 45 branches that sell electrical and electronic appliances under the Shekem Electric name; and 41 branches of electrical warehouses under the Machsanei Hachashmal name. Electra Consumer Products (1970) Ltd was founded in 1945 and is based in Rishon LeZion, Israel.",
    "website": "http://www.ecp.co.il",
    "zipcode": "75704 1"
  },
  "MTRN.TA": {
    "city": "Jezreel Valley",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Consumer Electronics",
    "long_name": "Maytronics Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "MAYTRONICS LTD",
    "state": null,
    "summary": "Maytronics Ltd. engages in the development, production, marketing, distribution, and technical support of swimming pool equipment in Europe, the United States, Oceania, and internationally. It offers robotic pool cleaners for residential and commercial pools under the Dolphin name; and pool alarms, a swimming pool safety alarm system under the Aqualarm, Sensor Premium, and Sensor Espio names. The company also provides pool covers, including above water, in water, and solar operated mechanisms under the AQUAlife name; water-powered motor for pool covers; and computer-aided drowning detection systems. In addition, it offers in and above ground solar pool heaters; and swimming pool glass filter media, as well as other supplementary products for the swimming pool water treatment. The company sells its products through distributors. The company was founded in 1983 and is based in Jezreel Valley, Israel. Maytronics Ltd. is a subsidiary of Kibbutz Yizre'el Holdings 2004 ACS Ltd.",
    "website": "http://www.maytronics.com",
    "zipcode": "1935000"
  },
  "TDRN.TA": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Consumer Electronics",
    "long_name": "Tadiran Group Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "TADIRAN GROUP LTD",
    "state": null,
    "summary": "Tadiran Holdings Ltd, through its subsidiaries, engages in the development, manufacturing, import, marketing, and distribution of air conditioning systems in Israel. The company offers overhead air conditioners, mini central air conditioners, multi systems inverters, VRF boxes, and multi inverters for the residential, commercial, and industrial markets under the Tadiran, Amcor, and Toshiba brands. It also imports, markets, and distributes various home appliances under the Amcor and Crystal brands; and provides warranty and maintenance services, as well as energy efficiency services. The company was formerly known as Crystal Consumer Products Ltd. and changed its name to Tadiran Holdings Ltd in April 2011. Tadiran Holdings Ltd was founded in 1989 and is based in Petah Tikva, Israel.",
    "website": "http://www.tadiran-group.co.il",
    "zipcode": null
  }
}
