{
    "CMDR.TA": {
        "short_name": "COMPUTER DIRECT",
        "long_name": "Computer Direct Group Ltd.",
        "summary": "Computer Direct Group Ltd. engages in the computing and software sector in Israel and internationally. The company offers software solutions and services, including project execution and implementation of systems, core systems, and cloud-based systems; and digital applications, including service management and accompaniment of engineering projects in the field of national infrastructure. It also offers financial leasing services. In addition, the company engages in the provision of managed services in the field of computing, including the operation of internal and external support centers. The company was formerly known as Computer Direct to Israel M.I.L. Ltd. and changed its name to Computer Direct Group Ltd. in January 2002. Computer Direct Group Ltd. is based in Petah Tikva, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": null,
        "website": null,
        "market_cap": 786179584
    },
    "EMCO.TA": {
        "short_name": "E & M COMPUTING",
        "long_name": "E & M Computing Ltd.",
        "summary": "E & M Computing Ltd. provides cloud, information systems, and data-center technologies in Israel. It offers IT infrastructure services, including professional, big-data and analytics, hyperscale cloud, business continuity, cyber security, software, hosted IT, networking, and outsourcing services; infrastructure for large scale private clouds, compute clusters, and software- defined systems; and design, integration, and logistic services for software vendors. The company was founded in 1984 and is headquartered in Ramat Gan, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ramat Gan",
        "zipcode": null,
        "website": "http://www.emet.co.il",
        "market_cap": 948876224
    },
    "ESYL": {
        "short_name": "EASYLINK SOLUTIONS CORPORATION",
        "long_name": "Easylink Solutions Corp.",
        "summary": "Easylink Solutions Corp., a development stage company, provides IT related management and services to small to medium sized corporate entities in Hong Kong. The company collects, manages, and transmits uninterrupted digital information, as well as manufactures hard drives and solid state drives, including external and portable storage devices. Its products include home digital media center that enables the user to play various digital media to television screen, as well as plays various picture and audio formats. Easylink Solutions Corp. sells its products through a networked group of independent and company-owned dealers, as well as retail and Web-based channels. The company was formerly known as AlgoDyne Ethanol Energy Corp. and changed its name to Easylink Solutions Corp. in November 2008. Easylink Solutions Corp. was incorporated in 2004 and is based in Haifa, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Haifa",
        "zipcode": "2629018",
        "website": "http://www.easylinksolutions.com",
        "market_cap": 61778
    },
    "FORTY": {
        "short_name": "Formula Systems (1985) Ltd.",
        "long_name": "Formula Systems (1985) Ltd.",
        "summary": "Formula Systems (1985) Ltd., through its subsidiaries, provides software, proprietary and non-proprietary software, and software product marketing and support services in Israel and internationally. The company offers computer and telecommunication infrastructure solutions; computer solutions to computer and communications infrastructures; cloud computing solutions; database and big data services; customer relations management, computer systems management infrastructures, web world content management, database and data warehouse mining, application integration, database and systems, data management, and software development tools; and professional training courses and advanced professional studies. It also markets and sells computers and peripheral equipment to business customers. In addition, the company offers property and casualty insurance platforms, such as Sapiens, Sapiens CoreSuite, Sapiens IDITSuite, Sapiens PolicyPro, Sapiens BillingPro, Sapiens ClaimsPro, e-Tica, and Sapiens Stingray; life, pension, and annuities platforms, including Sapiens CoreSuite, Sapiens UnderwritingPro, Sapiens ApplicationPro, Sapiens IllustrationPro, and Sapiens ConsolidationMaster; reinsurance software solutions comprising Sapiens ReinsuranceMaster, Sapiens ReinsurancePro, and Sapiens Reinsurance GO; and Sapiens platform for workers' compensation solutions. Further, it provides financial and compliance solutions that include Sapiens FinancialPro, Sapiens Financial GO, and Sapiens StatementPro; Sapiens DECISION, a decision management platform; and technology-based solutions and digital insurance suites. Additionally, the company offers application development and business process integration platforms; vertical software solutions; software services and information technologies outsourcing software services; and professionals in various areas, as well as develops on-premise payroll software solutions. The company was founded in 1985 and is headquartered in Or Yehuda, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Or Yehuda",
        "zipcode": "60218",
        "website": "http://www.formulasystems.com",
        "market_cap": 1426556032
    },
    "FSY.F": {
        "short_name": "FORMULA SYS 1985 ADR",
        "long_name": "Formula Systems (1985) Ltd.",
        "summary": "Formula Systems (1985) Ltd., through its subsidiaries, provides software, proprietary and non-proprietary software, and software product marketing and support services in Israel and internationally. The company offers computer and telecommunication infrastructure solutions; computer solutions to computer and communications infrastructures; cloud computing solutions; database and big data services; customer relations management, computer systems management infrastructures, web world content management, database and data warehouse mining, application integration, database and systems, data management, and software development tools; and professional training courses and advanced professional studies. It also markets and sells computers and peripheral equipment to business customers. In addition, the company offers property and casualty insurance platforms, such as Sapiens, Sapiens CoreSuite, Sapiens IDITSuite, Sapiens PolicyPro, Sapiens BillingPro, Sapiens ClaimsPro, e-Tica, and Sapiens Stingray; life, pension, and annuities platforms, including Sapiens CoreSuite, Sapiens UnderwritingPro, Sapiens ApplicationPro, Sapiens IllustrationPro, and Sapiens ConsolidationMaster; reinsurance software solutions comprising Sapiens ReinsuranceMaster, Sapiens ReinsurancePro, and Sapiens Reinsurance GO; and Sapiens platform for workers' compensation solutions. Further, it provides financial and compliance solutions that include Sapiens FinancialPro, Sapiens Financial GO, and Sapiens StatementPro; Sapiens DECISION, a decision management platform; and technology-based solutions and digital insurance suites. Additionally, the company offers application development and business process integration platforms; vertical software solutions; software services and information technologies outsourcing software services; and professionals in various areas, as well as develops on-premise payroll software solutions. The company was founded in 1985 and is headquartered in Or Yehuda, Israel.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "state": null,
        "city": "Or Yehuda",
        "zipcode": "60218",
        "website": "http://www.formulasystems.com",
        "market_cap": 1160108928
    },
    "FSY.MU": {
        "short_name": "FORMULA SYS 1985 ADR",
        "long_name": "Formula Systems (1985) Ltd.",
        "summary": "Formula Systems (1985) Ltd., through its subsidiaries, provides software, proprietary and non-proprietary software, and software product marketing and support services in Israel and internationally. The company offers computer and telecommunication infrastructure solutions; computer solutions to computer and communications infrastructures; cloud computing solutions; database and big data services; customer relations management, computer systems management infrastructures, web world content management, database and data warehouse mining, application integration, database and systems, data management, and software development tools; and professional training courses and advanced professional studies. It also markets and sells computers and peripheral equipment to business customers. In addition, the company offers property and casualty insurance platforms, such as Sapiens, Sapiens CoreSuite, Sapiens IDITSuite, Sapiens PolicyPro, Sapiens BillingPro, Sapiens ClaimsPro, e-Tica, and Sapiens Stingray; life, pension, and annuities platforms, including Sapiens CoreSuite, Sapiens UnderwritingPro, Sapiens ApplicationPro, Sapiens IllustrationPro, and Sapiens ConsolidationMaster; reinsurance software solutions comprising Sapiens ReinsuranceMaster, Sapiens ReinsurancePro, and Sapiens Reinsurance GO; and Sapiens platform for workers' compensation solutions. Further, it provides financial and compliance solutions that include Sapiens FinancialPro, Sapiens Financial GO, and Sapiens StatementPro; Sapiens DECISION, a decision management platform; and technology-based solutions and digital insurance suites. Additionally, the company offers application development and business process integration platforms; vertical software solutions; software services and information technologies outsourcing software services; and professionals in various areas, as well as develops on-premise payroll software solutions. The company was founded in 1985 and is headquartered in Or Yehuda, Israel.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Israel",
        "state": null,
        "city": "Or Yehuda",
        "zipcode": "60218",
        "website": "http://www.formulasystems.com",
        "market_cap": 1184446848
    },
    "JCDAF": {
        "short_name": "JACADA",
        "long_name": "Jacada Ltd.",
        "summary": "Jacada Ltd. develops, markets, and supports customer experience management and robotic process optimization solutions that automate customer service processes in North America, Europe, Asia, the Middle East, Africa, and internationally. Its products include Jacada WorkSpace Agent Desktop, which unifies customer interaction tools and provides a single access point to various mission-critical applications for customer service representatives; Jacada Visual interactive voice response that enables end users to engage in a mobile self-service sessions; and Jacada Intelligent Assistant, a virtual customer assistant that allows end users to engage in an automated conversation to answer their questions and complete transactions on their behalf. The company's products also comprise Jacada Advisor, which helps call centers enhance customer service by providing real-time agent guidance; Jacada Integration and Automation, a solution that allows companies to Web-enable and integrate their Microsoft Windows client/server and Web-based applications without modifying or changing existing applications; Jacada Agent Guidance, which guides the customer service agent through an optimized interaction with the customer; Jacada Workflow that creates business process management workflows; Jacada HostFuse, a software solution for integrating core host-centric business systems; Jacada Interface Server, which generates graphical user interfaces for mainframe and midrange software applications without changing the host applications; and Jacada Multi-Channel Agent Desktop for voice, email, and chat. In addition, it offers training, consulting, and product support and maintenance services. Jacada Ltd. sells its products directly, as well as through system integrators, partners, and call center outsourcers. The company was formerly known as Client/Server Technology Ltd. and changed its name to Jacada Ltd. in August 1999. Jacada Ltd. was founded in 1990 and is headquartered in Herzliya, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Herzliya",
        "zipcode": "46728",
        "website": "http://www.jacada.com",
        "market_cap": 15330958
    },
    "MLTM.TA": {
        "short_name": "MALAM TEAM LTD",
        "long_name": "Malam - Team Ltd",
        "summary": "Malam - Team Ltd provides information technology services in Israel. The company offers solutions for payroll systems, human resources systems, attendance systems, and pension savings, as well as management of provident fund operations; and outsourcing and cloud services. It also provides infrastructure and integration services, including consulting, architecting, designing, and implementing system-based solutions, as well as infrastructure software, communications, information security, Internet of Things, control and monitoring systems, OEM, public transport, systems engineering, and printing solutions. In addition, the company offers BI and big data improving business performance, Agilepoint, customer relationship management, enterprise resource planning, application virtualization and secure browsing, disaster recovery, CAD, customs clearance management, guidance and training, management of information and documents, product lifecycle management, mobile application development, and human capital management solutions, as well as software solutions for managing infrastructure and organizational processes. Further, it provides software development services, such as development solutions for advanced applications for various types of devices and operating systems; web design and information and systems; digital solutions; managing, ticketing, and sharing information; organization infrastructures; legal processes and debt collection solutions; OpenSource environment; SAP and mainframe customer solutions; advanced digital systems for recording and dictation; and training and coaching solutions, as well as development services for JAVA and Oracle. Additionally, the company offers cyber and communication solutions, and security software solutions; and cloud computing solutions. Malam - Team Ltd was founded in 1972 and is based in Petah Tikva, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": "49512",
        "website": "http://www.malamteam.com",
        "market_cap": 2408472064
    },
    "TOPS.TA": {
        "short_name": "TOP RAMDOR SYSTEMS",
        "long_name": "Top Ramdor Systems & Computers Co. (1990) Ltd",
        "summary": "Top Ramdor Systems & Computers Co. (1990) Ltd develops and markets software products and services in the field of process management, surveys, tasks, business resources, product life management, projects, and maintenance in Israel and internationally. It also provides computerized services for the management and production of tenders, as well as services for the implementation, assimilation and training of products. The company was incorporated in 1990 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": null,
        "website": "http://top-group.co.il/group/ramdor",
        "market_cap": 196303120
    },
    "UPSL.TA": {
        "short_name": "UPSELLON BRANDS",
        "long_name": "Upsellon Brands Holdings Ltd",
        "summary": "Upsellon Brands Holdings Ltd purchases, dismantles, refurbishes, operates, and sells refineries in Israel. The company also provides engineering, technical and logistical consulting, and initiative services related to refineries and components. It serves private entities, states, and government agencies. The company was formerly known as Chiron Refineries Ltd and changed its name to Upsellon Brands Holdings Ltd in January 2020. Upsellon Brands Holdings Ltd was incorporated in 1993 and is based in Ramat Gan, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ramat Gan",
        "zipcode": "5126015",
        "website": null,
        "market_cap": 98653304
    }
}