{
    "ADCO.V": {
        "short_name": "ADCORE INC",
        "long_name": "Adcore Inc.",
        "summary": "ADCORE Inc. provides machine-learning powered advertising technologies worldwide. The company offers a suite of solutions for digital advertisers to enhance and maximize their search engine marketing, including ADCORE Views, a search solution used from campaign creation to smart bidding; Feeditor, a shopping solution used from feed management to campaign creation; and SEMDoc, a dashboard for analyzing 52-key account and campaign metrics. It serves digital marketing agencies; e-commerce businesses; and financial technology, travel, and other industries. The company was founded in 2006 and is headquartered in Tel Aviv, Israel.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "ADCOF": {
        "short_name": "ADCORE INC",
        "long_name": "Adcore Inc.",
        "summary": "ADCORE Inc. provides machine-learning powered advertising technologies worldwide. The company offers a suite of solutions for digital advertisers to enhance and maximize their search engine marketing, including ADCORE Views, a search solution used from campaign creation to smart bidding; Feeditor, a shopping solution used from feed management to campaign creation; and SEMDoc, a dashboard for analyzing 52-key account and campaign metrics. It serves digital marketing agencies; e-commerce businesses; and financial technology, travel, and other industries. The company was founded in 2006 and is headquartered in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "AICS.TA": {
        "short_name": "AI CONVERSATION",
        "long_name": "Ai Conversation Systems Ltd",
        "summary": "Ai Conversation Systems Ltd, through its subsidiaries, engages in the development, manufacturing, and marketing of integrated software solutions worldwide. The company was formerly known as Formula Vision Technologies (F.V.T) Ltd. and changed its name to Ai Conversation Systems Ltd in September 2019. Ai Conversation Systems Ltd was founded in 1978 and is based in Savyon, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Savyon"
    },
    "BBYLF": {
        "short_name": "ABRA INFORMATION TECHNOLOGIES L",
        "long_name": "Abra Information Technologies Ltd.",
        "summary": "Abra Information Technologies Ltd. provides monetization solutions to publishers and app developers for monetizing and promoting their applications or content worldwide. It also offers Babylon Translation software that provides translations in 77 languages, dictionary definitions, and Wikipedia results in 25 languages. The company was formerly known as Babylon Ltd. Abra Information Technologies Ltd. was founded in 1997 and is based in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": null
    },
    "ENET.L": {
        "short_name": "ETHERNITY NETWORKS LTD ORD NIS0",
        "long_name": "Ethernity Networks Ltd.",
        "summary": "Ethernity Networks Ltd. provides technology solutions for telecom, mobile, security, and data center markets in Asia, Europe, Israel, and the United States. The company develops and delivers data processing technology and solutions for carrier Ethernet switching, including broadband access, mobile backhaul, carrier Ethernet demarcation, and data centers. It provides ENET flow processors for telco/cloud network; ACE-NIC40 SmartNIC, an open flow enabled software acceleration NIC; ACE-NIC50 SmartNIC, which offers 10/25G Ethernet connectivity and field-programmable gate array (FPGA) acceleration; and ACE-NIC100 SmartNIC that provides flexible 10/25/40/100G Ethernet connectivity and programmable FPGA acceleration. The company also offers ENET network appliances, such as ENET Universal Edge Platform, ENET VPN Gateway, and ENET vRouter. In addition, it provides FPGA based networking and security solutions to telco/cloud equipment manufacturers and system integrators. The company was formerly known as Neracore Ltd. and changed its name to Ethernity Networks Ltd. in August 2004. Ethernity Networks Ltd. was founded in 2003 and is headquartered in Lod, Israel.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Israel",
        "city": "Lod"
    },
    "FNTS.TA": {
        "short_name": "FANTASY NETWORK",
        "long_name": "Fantasy Network Ltd",
        "summary": "Fantasy Network Ltd provides a white label platform of online games for iGaming and Media companies. Fantasy Network Ltd was formerly known as Bio-Cell Ltd. and changed its name to Fantasy Network Ltd in October 2015. The company was incorporated in 1986 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "HLAN.TA": {
        "short_name": "HILAN LTD",
        "long_name": "Hilan Ltd.",
        "summary": "Hilan Ltd., a software as a service provider, develops solutions for management of enterprise human capital in Israel. It provides solutions for payroll, HR, time and attendance, pension, analytics, and BPO; and managing the employee lifecycle from recruitment to retirement. The company also offers information technology (IT) system infrastructure, security, and data management; and IT solutions, including big data, data storage, backup and virtualization, cloud SaaS, data, and cyber security. It serves customers in the industry, hi-tech, finance, academic, communication, health care, municipal, transportation, retail, government, education, social care, association, and hotel sectors. The company is headquartered in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "HLTEF": {
        "short_name": "HILAN LTD",
        "long_name": "Hilan Ltd.",
        "summary": "Hilan Ltd., a software as a service provider, develops solutions for management of enterprise human capital in Israel. It provides solutions for payroll, HR, time and attendance, pension, analytics, and BPO; and managing the employee lifecycle from recruitment to retirement. The company also offers information technology (IT) system infrastructure, security, and data management; and IT solutions, including big data, data storage, backup and virtualization, cloud SaaS, data, and cyber security. It serves customers in the industry, hi-tech, finance, academic, communication, health care, municipal, transportation, retail, government, education, social care, association, and hotel sectors. The company is headquartered in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "MGIC": {
        "short_name": "Magic Software Enterprises Ltd.",
        "long_name": "Magic Software Enterprises Ltd.",
        "summary": "Magic Software Enterprises Ltd. provides proprietary application development, business process integration, vertical software solutions, and information technologies (IT) outsourcing software services in Israel and internationally. The company's Software Services segment develops, markets, sells, and supports application platform, software applications, and business and process integration solutions and related services. Its IT Professional Services segment offers IT services in the areas of infrastructure design and delivery, application development, technology planning and implementation services, communications services and solutions, and supplemental outsourcing services. The company offers proprietary application platforms, such as Magic xpa for developing and deploying business applications; AppBuilder for building, deploying, and maintaining high-end and mainframe-grade business applications; Magic xpi for application integration; Magic xpc, a hybrid integration platform as a service; Magic SmartUX, a mobile development application platform; and FactoryEye for virtualization of production data. It also provides vertical software solutions comprising Clicks, a software solution for healthcare providers; Leap, a software solution for business support systems; Hermes Solution, a packaged software solution for managing air cargo ground handling; HR Pulse, a customized single-tenant software as a service tool; and MBS Solution, a proprietary system for managing TV broadcast management. In addition, the company provides software maintenance, support, training, and consulting services. It serves oil and gas, telecommunications, financial, healthcare, and industrial sectors; and public institutions and international agencies. The company was formerly known as Mashov Software Export (1983) Ltd. and changed its name to Magic Software Enterprises Ltd. in 1991. Magic Software Enterprises Ltd. was founded in 1983 and is headquartered in Or Yehuda, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Or Yehuda"
    },
    "MGIC.TA": {
        "short_name": "MAGIC SOFTWARE ENT",
        "long_name": "Magic Software Enterprises Ltd.",
        "summary": "Magic Software Enterprises Ltd. provides proprietary application development, business process integration, vertical software solutions, and information technologies (IT) outsourcing software services in Israel and internationally. The company's Software Services segment develops, markets, sells, and supports application platform, software applications, and business and process integration solutions and related services. Its IT Professional Services segment offers IT services in the areas of infrastructure design and delivery, application development, technology planning and implementation services, communications services and solutions, and supplemental outsourcing services. The company offers proprietary application platforms, such as Magic xpa for developing and deploying business applications; AppBuilder for building, deploying, and maintaining high-end and mainframe-grade business applications; Magic xpi for application integration; Magic xpc, a hybrid integration platform as a service; Magic SmartUX, a mobile development application platform; and FactoryEye for virtualization of production data. It also provides vertical software solutions comprising Clicks, a software solution for healthcare providers; Leap, a software solution for business support systems; Hermes Solution, a packaged software solution for managing air cargo ground handling; HR Pulse, a customized single-tenant software as a service tool; and MBS Solution, a proprietary system for managing TV broadcast management. In addition, the company provides software maintenance, support, training, and consulting services. It serves oil and gas, telecommunications, financial, healthcare, and industrial sectors; and public institutions and international agencies. The company was formerly known as Mashov Software Export (1983) Ltd. and changed its name to Magic Software Enterprises Ltd. in 1991. Magic Software Enterprises Ltd. was founded in 1983 and is headquartered in Or Yehuda, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Or Yehuda"
    },
    "MGK.F": {
        "short_name": "MAGIC SOFTWARE ENT.IS-,01",
        "long_name": "Magic Software Enterprises Ltd.",
        "summary": "Magic Software Enterprises Ltd. provides proprietary application development, business process integration, vertical software solutions, and information technologies (IT) outsourcing software services in Israel and internationally. The company's Software Services segment develops, markets, sells, and supports application platform, software applications, and business and process integration solutions and related services. Its IT Professional Services segment offers IT services in the areas of infrastructure design and delivery, application development, technology planning and implementation services, communications services and solutions, and supplemental outsourcing services. The company offers proprietary application platforms, such as Magic xpa for developing and deploying business applications; AppBuilder for building, deploying, and maintaining high-end and mainframe-grade business applications; Magic xpi for application integration; Magic xpc, a hybrid integration platform as a service; Magic SmartUX, a mobile development application platform; and FactoryEye for virtualization of production data. It also provides vertical software solutions comprising Clicks, a software solution for healthcare providers; Leap, a software solution for business support systems; Hermes Solution, a packaged software solution for managing air cargo ground handling; HR Pulse, a customized single-tenant software as a service tool; and MBS Solution, a proprietary system for managing TV broadcast management. In addition, the company provides software maintenance, support, training, and consulting services. It serves oil and gas, telecommunications, financial, healthcare, and industrial sectors; and public institutions and international agencies. The company was formerly known as Mashov Software Export (1983) Ltd. and changed its name to Magic Software Enterprises Ltd. in 1991. Magic Software Enterprises Ltd. was founded in 1983 and is headquartered in Or Yehuda, Israel.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Or Yehuda"
    },
    "MNDO": {
        "short_name": "MIND C.T.I. Ltd.",
        "long_name": "MIND C.T.I. Ltd",
        "summary": "MIND C.T.I. Ltd., together with its subsidiaries, designs, develops, markets, supports, implements, and operates real-time and off-line convergent billing and customer care software solutions in the Americas, Europe, Israel, the Asia Pacific, and Africa. The company offers billing and customer care solutions that support various services, such as voice, data, and content services, as well as prepaid, postpaid, and pay-in-advance payment models in a single platform. Its solutions also include a workflow engine to support the implementation of business processes, including subscriber registration, order management, trouble ticket, and debt collection; and an integral point of sale solution that covers all dealer, store and cashier management, and sales processes. In addition, the company offers professional services comprising installation, turnkey project implementation services, customer support, training and maintenance services, software and process customization, and project management, as well as managed services, including day to day billing operational tasks primarily to its billing and customer care customers. Further, it provides PhonEX ONE, a call management system that collects, records, and stores call information, which is used by corporations for telecom expense management, call accounting, traffic analysis, and fraud detection. The company offers its products directly, as well as through distributors and resellers primarily to communication service providers, such as traditional wireline and wireless, voice over IP, broadband IP network operators, wireless internet service providers, LTE operators, cable operators, and mobile virtual network operators. The company was founded in 1995 and is headquartered in Yokne'am Illit, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Israel",
        "city": "Yokneam Illit"
    },
    "MTRX.TA": {
        "short_name": "MATRIX IT LTD",
        "long_name": "Matrix IT Ltd.",
        "summary": "Matrix IT Ltd. provides information technology (IT) services worldwide. The company offers consulting services in the areas of customer experience, and supply chain and logistics; develops and implements customer relationship management solutions; operates a customer service center; and provides enterprise resource planning solutions to businesses. It also offers business intelligence, big data, and analytics solutions, as well as digitization services; and research and development, testing and automation, nearshore, offshore, training and implementation, and DevOps services. In addition, the company provides cloud solutions; develops data platforms; develops and supports integration platforms; and offers IT-as-a-Service. Further, it provides cyber security services; financial crime prevention and compliance solutions and services; and business continuity management and disaster recovery solutions. Additionally, the company offers customer facing, business excellence, defense, urban planning and environment, infrastructure and transport, healthcare, supply chain management, and innovation consulting services, as well as distributes software products. It serves healthcare, high-tech, public service, retail, finance, and defense sectors. The company was founded in 2001 and is headquartered in Herzliya, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Herzliya"
    },
    "MYSZ": {
        "short_name": "My Size, Inc.",
        "long_name": "My Size, Inc.",
        "summary": "My Size, Inc. develops and commercializes mobile device measurement solutions for e-commerce fashion/apparel, shipping/parcel, and do it yourself industries in Israel. It offers MySizeID, an application that enables consumers to create an online profile of their personal measurements to get the right fit; BoxSizeID, a parcel measurement application that allows customers to measure the size of their parcel with their smartphone, calculate shipping costs, and arrange for a convenient pick-up time for the package; SizeUp app, which allows users to utilize their smartphone as a tape measure; and SizeIT, a smart measuring tape standard development kit that provides users with the ability to instantly measure objects with a quick movement of their mobile device. The company was formerly known as Knowledgetree Ventures, Inc. and changed its name to My Size, Inc. in January 2014. My Size, Inc. was founded in 1999 and is based in Airport City, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Israel",
        "city": "Airport City"
    },
    "MYSZ.TA": {
        "short_name": "MY SIZE INC",
        "long_name": "My Size, Inc.",
        "summary": "My Size, Inc. develops and commercializes mobile device measurement solutions for e-commerce fashion/apparel, shipping/parcel, and do it yourself industries in Israel. It offers MySizeID, an application that enables consumers to create an online profile of their personal measurements to get the right fit; BoxSizeID, a parcel measurement application that allows customers to measure the size of their parcel with their smartphone, calculate shipping costs, and arrange for a convenient pick-up time for the package; SizeUp app, which allows users to utilize their smartphone as a tape measure; and SizeIT, a smart measuring tape standard development kit that provides users with the ability to instantly measure objects with a quick movement of their mobile device. The company was formerly known as Knowledgetree Ventures, Inc. and changed its name to My Size, Inc. in January 2014. My Size, Inc. was founded in 1999 and is based in Airport City, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Airport City"
    },
    "NICE": {
        "short_name": "NICE Ltd",
        "long_name": "NICE Ltd.",
        "summary": "NICE Ltd. provides enterprise software solutions worldwide. The company operates in two segments, Customer Engagement, and Financial Crime and Compliance. It offers CXone, a cloud native open platform that supports contact centers ranging from small single sites to distributed remote agents and enterprises; and a digital-first omnichannel customer engagement platform that supports various digital and self-service channels, which allows organizations to add and integrate new and emerging channels. The company also provides AI driven smarter processes and adaptive workforce engagement solutions. In addition, it offers NICE platform, a financial crime and compliance solution that handles various process, including detection, investigation, remediation, and reporting; and X-Sight, a cloud-based financial crime risk management platform-as-a-service. Further, the company provides professional service and support at various stages of the technology lifecycle, including defining requirements, planning, design, implementation, customization, optimization, maintenance, and ongoing support. It serves customers across various verticals, including banking, financial, telecommunications, healthcare, insurance, retail, travel, gaming, public safety, and state and local government. The company sells its solutions and products directly to customers, as well as indirectly through selected partners. NICE Ltd. has a strategic partnership with Information Services Group, Inc. to expand the automation ecosystem. The company was formerly known as NICE-Systems Ltd. and changed its name to NICE Ltd. in June 2016. NICE Ltd. was founded in 1986 and is based in Ra'anana, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Raâ\u0080\u0099anana"
    },
    "NICE.TA": {
        "short_name": "NICE LTD",
        "long_name": "NICE Ltd.",
        "summary": "NICE Ltd. provides enterprise software solutions worldwide. The company operates in two segments, Customer Engagement, and Financial Crime and Compliance. It offers CXone, a cloud native open platform that supports contact centers ranging from small single sites to distributed remote agents and enterprises; and a digital-first omnichannel customer engagement platform that supports various digital and self-service channels, which allows organizations to add and integrate new and emerging channels. The company also provides AI driven smarter processes and adaptive workforce engagement solutions. In addition, it offers NICE platform, a financial crime and compliance solution that handles various process, including detection, investigation, remediation, and reporting; and X-Sight, a cloud-based financial crime risk management platform-as-a-service. Further, the company provides professional service and support at various stages of the technology lifecycle, including defining requirements, planning, design, implementation, customization, optimization, maintenance, and ongoing support. It serves customers across various verticals, including banking, financial, telecommunications, healthcare, insurance, retail, travel, gaming, public safety, and state and local government. The company sells its solutions and products directly to customers, as well as indirectly through selected partners. NICE Ltd. has a strategic partnership with Information Services Group, Inc. to expand the automation ecosystem. The company was formerly known as NICE-Systems Ltd. and changed its name to NICE Ltd. in June 2016. NICE Ltd. was founded in 1986 and is based in Ra'anana, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Raâ\u0080\u0099anana"
    },
    "NSY.F": {
        "short_name": "NICE LTD. ADR/4 O.N.",
        "long_name": "NICE Ltd.",
        "summary": "NICE Ltd. provides enterprise software solutions worldwide. The company operates in two segments, Customer Engagement, and Financial Crime and Compliance. It offers CXone, a cloud native open platform that supports contact centers ranging from small single sites to distributed remote agents and enterprises; and a digital-first omnichannel customer engagement platform that supports various digital and self-service channels, which allows organizations to add and integrate new and emerging channels. The company also provides AI driven smarter processes and adaptive workforce engagement solutions. In addition, it offers NICE platform, a financial crime and compliance solution that handles various process, including detection, investigation, remediation, and reporting; and X-Sight, a cloud-based financial crime risk management platform-as-a-service. Further, the company provides professional service and support at various stages of the technology lifecycle, including defining requirements, planning, design, implementation, customization, optimization, maintenance, and ongoing support. It serves customers across various verticals, including banking, financial, telecommunications, healthcare, insurance, retail, travel, gaming, public safety, and state and local government. The company sells its solutions and products directly to customers, as well as indirectly through selected partners. NICE Ltd. has a strategic partnership with Information Services Group, Inc. to expand the automation ecosystem. The company was formerly known as NICE-Systems Ltd. and changed its name to NICE Ltd. in June 2016. NICE Ltd. was founded in 1986 and is based in Ra'anana, Israel.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Raâ\u0080\u0099anana"
    },
    "RDVWF": {
        "short_name": "RADVIEW SOFTWARE",
        "long_name": "RadView Software Ltd.",
        "summary": "RadView Software Ltd. develops and markets software for testing the performance, scalability, and integrity of Internet applications. Its WebLOAD provides various solutions, such as Website, Java, NET, Oracle forms, Web services/REST, and Selenium load testing solutions, as well as continuous integration, CRM and ERP performance testing, and campus management platforms testing solutions. The company's WebLOAD testing solution is used for testing applications in financial services, retail, media, education, manufacturing, healthcare, and other sectors. RadView Software Ltd. was founded in 1991 and is based in Rosh Ha'ayin, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Rosh Ha'ayin"
    },
    "S3P.F": {
        "short_name": "SAPIENS INTL  DL-,01",
        "long_name": "Sapiens International Corporation N.V.",
        "summary": "Sapiens International Corporation N.V. provides software solutions for the insurance and financial services industries in North America, Europe, the Asia Pacific, and South Africa. The company offers Sapiens CoreSuite and Sapiens IDITSuite for personal, commercial, and specialty lines, as well as reinsurance and workers' compensation; and Sapiens CoreSuite, Sapiens UnderwritingPro, Sapiens ApplicationPro, Sapiens IllustrationPro, and Sapiens ConsolidationMaster for life, pension, and annuities. It also provides Sapiens DigitalSuite for insurance customers, agents, brokers, risk managers, customer groups and third-party service providers; Sapiens AgentConnect and Sapiens CustomerConnect portals; Sapiens Intelligence, an analytics platform; Sapiens IntelligencePro, a comprehensive BI solution with pre-configured reports, dashboards, and scorecards; and Sapiens Advanced Analytics, which uses AI and Machine Learning to generate actionable insights based on different models across the insurance value chain. In addition, the company offers Sapiens ReinsuranceMaster, Sapiens ReinsurancePro, and Sapiens Reinsurance GO reinsurance solutions; and Sapiens Platform, Sapiens CoreSuite, Sapiens PolicyPro, and Sapiens ClaimsPro, as well as Sapiens PolicyGo, Sapiens ClaimsGo, and Sapiens Connect for workers' compensation. Further, it provides financial and compliance solutions, which comprise Sapiens FinancialPro, Sapiens Financial GO, Sapiens StatementPro, Sapiens CheckPro, and Sapiens Reporting Tools; and Sapiens Decision, an enterprise-scale platform that enables institutions to centrally author, store, and manage various organizational business logics. Additionally, the company offers tailor-made solutions based on its Sapiens eMerge platform; and program delivery, business, and managed services. It markets and sells its products and services through direct and partner sales. The company was founded in 1982 and is headquartered in Holon, Israel.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Holon"
    },
    "SIM.L": {
        "short_name": "SIMIGON LTD. ORD ILS0.01 (DI)",
        "long_name": "SimiGon Ltd.",
        "summary": "SimiGon Ltd. develops and supplies learning, training, and simulation technologies and applications for the defense and civilian organizations in North America, Australia, Europe, South America, the Middle East, and rest of the Asia Pacific. The company offers SIMbox, a PC-based software platform for creating, modifying, managing, and deploying simulation-based content for various domains, such as training, mission debriefing, homeland security, and entertainment; and KnowBook, a platform for learning, training, planning, and debriefing; and AirTrack, a passenger in-flight entertainment system. It also provides simulation, sensor operator training, driver training, and after action review/playback system; and aircrew, maintenance, desktop, flight, cessna caravan, operator, air traffic control, and UAS training device. In addition, the company offers debriefing systems, such as D-Brief PC to support real-time air combat debriefing, as well as MDDS Pro, a digital debriefing solution incorporating video with 3D simulation. SimiGon Ltd. was founded in 1998 and is based in Herzliya, Israel.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Israel",
        "city": "Herzliya"
    },
    "SMTO.TA": {
        "short_name": "SOMOTO LTD",
        "long_name": "Somoto Ltd",
        "summary": "Somoto Ltd offers various solutions to software developers, publishers, advertisers, and Website owners for the distribution of software worldwide. The company provides its products and services through its installation management system for PC and Mac; and on a designated homepage, which is personalized for the user's profile. It is also involved in the provision of online video advertising services for mobile devices and PC; and the rental of online advertising space, as well as the distribution of software. The company was founded in 2009 and is headquartered in Tel Aviv-Yafo, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "SNEL.TA": {
        "short_name": "SYNEL PAYWAY M.L.L",
        "long_name": "Synel M.L.L Payway Ltd",
        "summary": "Synel M.L.L Payway Ltd, together with its subsidiaries, provides software integrated hardware solutions for workforce management in organizations in Israel and internationally. It offers time and attendance management system, job costing, shift scheduling, absence management, and smartphone application solutions; and security solutions, such as access control, visitor management, and muster and fire roll systems. The company also provides biometric time and attendance hardware; and biometric access control hardware, including fingerprint recognition and smartcard access control devices. In addition, it offers training, and professional and technological consulting services in payroll controller and labor law topics. The company was formerly known as Synal Industries Ltd. and changed its name to Synel M.L.L Payway Ltd in November 2012. Synel M.L.L Payway Ltd was incorporated in 1989 and is based in Yokne'am, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Yokne'am"
    },
    "SPNS": {
        "short_name": "Sapiens International Corporati",
        "long_name": "Sapiens International Corporation N.V.",
        "summary": "Sapiens International Corporation N.V. provides software solutions for the insurance and financial services industries in North America, Europe, the Asia Pacific, and South Africa. The company offers Sapiens CoreSuite and Sapiens IDITSuite for personal, commercial, and specialty lines, as well as reinsurance and workers' compensation; and Sapiens CoreSuite, Sapiens UnderwritingPro, Sapiens ApplicationPro, Sapiens IllustrationPro, and Sapiens ConsolidationMaster for life, pension, and annuities. It also provides Sapiens DigitalSuite for insurance customers, agents, brokers, risk managers, customer groups and third-party service providers; Sapiens AgentConnect and Sapiens CustomerConnect portals; Sapiens Intelligence, an analytics platform; Sapiens IntelligencePro, a comprehensive BI solution with pre-configured reports, dashboards, and scorecards; and Sapiens Advanced Analytics, which uses AI and Machine Learning to generate actionable insights based on different models across the insurance value chain. In addition, the company offers Sapiens ReinsuranceMaster, Sapiens ReinsurancePro, and Sapiens Reinsurance GO reinsurance solutions; and Sapiens Platform, Sapiens CoreSuite, Sapiens PolicyPro, and Sapiens ClaimsPro, as well as Sapiens PolicyGo, Sapiens ClaimsGo, and Sapiens Connect for workers' compensation. Further, it provides financial and compliance solutions, which comprise Sapiens FinancialPro, Sapiens Financial GO, Sapiens StatementPro, Sapiens CheckPro, and Sapiens Reporting Tools; and Sapiens Decision, an enterprise-scale platform that enables institutions to centrally author, store, and manage various organizational business logics. Additionally, the company offers tailor-made solutions based on its Sapiens eMerge platform; and program delivery, business, and managed services. It markets and sells its products and services through direct and partner sales. The company was founded in 1982 and is headquartered in Holon, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Holon"
    },
    "SPNS.TA": {
        "short_name": "SAPIENS INTL CP NV",
        "long_name": "Sapiens International Corporation N.V.",
        "summary": "Sapiens International Corporation N.V. provides software solutions for the insurance and financial services industries in North America, Europe, the Asia Pacific, and South Africa. The company offers Sapiens CoreSuite and Sapiens IDITSuite for personal, commercial, and specialty lines, as well as reinsurance and workers' compensation; and Sapiens CoreSuite, Sapiens UnderwritingPro, Sapiens ApplicationPro, Sapiens IllustrationPro, and Sapiens ConsolidationMaster for life, pension, and annuities. It also provides Sapiens DigitalSuite for insurance customers, agents, brokers, risk managers, customer groups and third-party service providers; Sapiens AgentConnect and Sapiens CustomerConnect portals; Sapiens Intelligence, an analytics platform; Sapiens IntelligencePro, a comprehensive BI solution with pre-configured reports, dashboards, and scorecards; and Sapiens Advanced Analytics, which uses AI and Machine Learning to generate actionable insights based on different models across the insurance value chain. In addition, the company offers Sapiens ReinsuranceMaster, Sapiens ReinsurancePro, and Sapiens Reinsurance GO reinsurance solutions; and Sapiens Platform, Sapiens CoreSuite, Sapiens PolicyPro, and Sapiens ClaimsPro, as well as Sapiens PolicyGo, Sapiens ClaimsGo, and Sapiens Connect for workers' compensation. Further, it provides financial and compliance solutions, which comprise Sapiens FinancialPro, Sapiens Financial GO, Sapiens StatementPro, Sapiens CheckPro, and Sapiens Reporting Tools; and Sapiens Decision, an enterprise-scale platform that enables institutions to centrally author, store, and manage various organizational business logics. Additionally, the company offers tailor-made solutions based on its Sapiens eMerge platform; and program delivery, business, and managed services. It markets and sells its products and services through direct and partner sales. The company was founded in 1982 and is headquartered in Holon, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Holon"
    },
    "VBIX": {
        "short_name": "VIEWBIX INC",
        "long_name": "Viewbix Inc.",
        "summary": "Viewbix Inc. operates as a video analytics and technology company. Its video marketing platform enables clients to enhance videos and publish across various platform while providing insights into viewer engagement. The company is based in Herzliya, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Herzliya"
    },
    "WSMK.TA": {
        "short_name": "WHITESMOKE SOFTWAR",
        "long_name": "WhiteSmoke Software Ltd",
        "summary": "WhiteSmoke Software Ltd develops English correction and writing enhancement software solutions in Israel. The company offers WhiteSmoke Writer, an English proofreading software; WhiteSmoke Toolbar, a search monetization software; online video advertising software for on desktop and mobile devices; and natural language processing software, a way for computers to analyze, understand, and derive meaning from human language. It serves native and non-native English speakers. The company was formerly known as Eldan-Tech Ltd. and changed its name to WhiteSmoke Software Ltd as a result of its merger with WhiteSmoke Inc. in January 2013. WhiteSmoke Software Ltd was incorporated in 1981 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    }
}