{
    "BGP.NZ": {
        "short_name": "Briscoe Group Limited Ordinary ",
        "long_name": "Briscoe Group Limited",
        "summary": "Briscoe Group Limited, together with its subsidiaries, engages in the retail of homeware and sporting goods in New Zealand. The company operates through two segments, Homeware and Sporting Goods. It operates 88 retail stores, including 46 stores under the Briscoes Homeware brand; 1 store under the Living & Giving brand; and 41 stores under the Rebel Sport brand. It also sells products online. The company was founded in 1781 and is headquartered in Auckland, New Zealand. Briscoe Group Limited is a subsidiary of JB Were (NZ) Nominees Limited.",
        "currency": "NZD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1025",
        "website": "http://www.briscoegroup.co.nz",
        "market_cap": "Small Cap"
    },
    "WHS.NZ": {
        "short_name": "The Warehouse Group Limited Ord",
        "long_name": "The Warehouse Group Limited",
        "summary": "The Warehouse Group Limited, together with its subsidiaries, engages in the retail of general merchandise and apparel in New Zealand. It also sells stationery products, technology and appliance products, and sporting equipment. The company operates 93 The Warehouse stores, 70 Warehouse Stationery stores, 77 Noel Leeming stores, and 18 Torpedo7 stores, as well as online stores. In addition, it engages in the provision of financial, property, investment, and wholesale services. The Warehouse Group Limited was founded in 1982 and is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "0627",
        "website": "http://www.thewarehousegroup.co.nz",
        "market_cap": "Small Cap"
    }
}