{
    "NWITY": {
        "short_name": "NETWORK INTL HLDGS PLC UNSPONS ",
        "long_name": "Network International Holdings plc",
        "summary": "Network International Holdings plc operates as a digital commerce enabler in the Middle East and Africa. The company provides technology-enabled payments solutions to merchants and financial institutions. It offers issuer solutions, including customer onboarding, card issuing, core processing, scheme and settlement reconciliation, and chargeback and dispute management service; and merchant solutions comprising payment acceptance products and solutions to merchants through direct merchant acquiring and acquirer processing solutions. The company provides value added services, such as loyalty programmes, dynamic currency conversion and multi-currency pricing, easy payment plans, smartview interactive dashboard and performance reports, 3DSecure, digital onboarding, data analytics, advanced fraud solutions, ATM solutions, card control, instant card issuance, and electronic billing services. It delivers its products and services through its integrated omni-channel platforms, including Network One and Network Lite, as well as N-Genius, a payment acceptance platform. Network International Holdings plc was founded in 1994 and is headquartered in Dubai, the United Arab Emirates.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Arab Emirates",
        "city": "Dubai"
    },
    "YALA": {
        "short_name": "Yalla Group Limited",
        "long_name": "Yalla Group Limited",
        "summary": "Yalla Group Limited operates a voice-centric social networking and entertainment platform under the Yalla name primarily in the Middle East and North Africa region. The company was formerly known as FYXTech Corporatio. Yalla Group Limited was incorporated in 2018 and is headquartered in Dubai, the United Arab Emirates.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United Arab Emirates",
        "city": "Dubai"
    }
}