{
  "0WP.F": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Advertising Agencies",
    "long_name": "WPP plc",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Communication Services",
    "short_name": "WPP PLC  LS-,10",
    "state": null,
    "summary": "WPP plc, a creative transformation company, provides communications, experience, commerce, and technology services in North America, the United Kingdom, Western Continental Europe, Asia Pacific, Latin America, Africa, the Middle East, and Central and Eastern Europe. The company operates through three segments: Global Integrated Agencies, Public Relations, and Specialist Agencies. It engages in the business of planning and creation of marketing and branding campaigns; designs advertisements across all media; and provides media buying services, including strategy and business development, media investment, data and technology, and content. The company provides advises to clients who are seeking to communicate with a range of stakeholders from consumers to governments and the business and financial communities. WPP plc was founded in 1985 and is based in London, the United Kingdom.",
    "website": "http://www.wpp.com",
    "zipcode": "SE1 9GL"
  },
  "8LS.F": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Advertising Agencies",
    "long_name": "Next Fifteen Communications Group plc",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "NEXT FIFTEEN  LS-,025",
    "state": null,
    "summary": "Next Fifteen Communications Group plc, together with its subsidiaries, provides communications services in the United Kingdom, Europe, Africa, the United States, and the Asia Pacific. It offers strategy and insight, online marketing, corporate and internal communications, media training, brand and message consultancy, market research, digital, marketing communications, and creative and content, as well as public, media, analyst, and investor relations services; and digital and technology products and services. The company provides its services under the Agent3, encore, Publitek, Beyond, Savanta, MBooth, MBooth Health, MACH 49, MIGHTY SOCIAL, Archetype, Conversion Rate Experts, Twogether, ODD, The Blueshirt Group, OutCast, Velocity, SMG., ELVIS, Brandwidth, Activate, Planning-inc, and Palladium brands. Next Fifteen Communications Group plc was incorporated in 1981 and is based in London, the United Kingdom.",
    "website": "http://www.next15.com",
    "zipcode": "SE1 3XF"
  },
  "9FW.F": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Advertising Agencies",
    "long_name": "Arena Events Group plc",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "ARENA EVENTS GRP  LS-,01",
    "state": null,
    "summary": "Arena Events Group plc provides turnkey event solutions in Europe, the United States, the Middle East, and Asia. It offers temporary event structures, seating, furniture, catering and kitchen equipment, fencing and barriers, interior design, and ice rinks. The company also provides exhibition services, scaffolding, mass participant event solutions, graphics, signage and flooring, as well as cold room, bar rental services. It serves events, television and films, retail, medical and education sectors, conferences, architecture and construction, exhibitions, and music concerts. The company was founded in 1761 and is headquartered in London, the United Kingdom.",
    "website": "http://www.arenagroup.com",
    "zipcode": "SW19 3GY"
  },
  "A04.F": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Advertising Agencies",
    "long_name": "Ascential plc",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Communication Services",
    "short_name": "ASCENTIAL PLC  LS-,01",
    "state": null,
    "summary": "Ascential plc provides business-to-business information services in the United Kingdom, rest of Europe, the United States, Canada, the Asia-Pacific, the Middle East, Africa, and Latin America. The company operates through four segments: Product Design, Marketing, Sales, and Built Environment and Policy. It offers industry-specific business intelligence, insights, and forecasting through data and digital subscription tools. The company was formerly known as Trident Floatco PLC and changed its name to Ascential plc in January 2016. Ascential plc was incorporated in 2016 and is headquartered in London, the United Kingdom.",
    "website": "http://www.ascential.com",
    "zipcode": "W1B 5AP"
  },
  "ARE.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "Arena Events Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "ARENA EVENTS GROUP PLC ORD 1P",
    "state": null,
    "summary": "Arena Events Group plc provides turnkey event solutions in Europe, the United States, the Middle East, and Asia. It offers temporary event structures, seating, furniture, catering and kitchen equipment, fencing and barriers, interior design, and ice rinks. The company also provides exhibition services, scaffolding, mass participant event solutions, graphics, signage and flooring, as well as cold room, bar rental services. It serves events, television and films, retail, medical and education sectors, conferences, architecture and construction, exhibitions, and music concerts. The company was founded in 1761 and is headquartered in London, the United Kingdom.",
    "website": "http://www.arenagroup.com",
    "zipcode": "SW19 3GY"
  },
  "ASCL.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "Ascential plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "ASCENTIAL PLC ORD 1P",
    "state": null,
    "summary": "Ascential plc provides business-to-business information services in the United Kingdom, rest of Europe, the United States, Canada, the Asia-Pacific, the Middle East, Africa, and Latin America. The company operates through four segments: Product Design, Marketing, Sales, and Built Environment and Policy. It offers industry-specific business intelligence, insights, and forecasting through data and digital subscription tools. The company was formerly known as Trident Floatco PLC and changed its name to Ascential plc in January 2016. Ascential plc was incorporated in 2016 and is headquartered in London, the United Kingdom.",
    "website": "http://www.ascential.com",
    "zipcode": "W1B 5AP"
  },
  "AYIMA-B.ST": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "SEK",
    "exchange": "STO",
    "industry": "Advertising Agencies",
    "long_name": "Ayima Group AB (publ)",
    "market": "se_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "Ayima Group AB ser. B",
    "state": null,
    "summary": "Ayima Group AB (publ) operates as a digital marketing agency worldwide. The company offers software tools, which include Ayima Reporting Tool, Pulse, Appotate, Redirect Path, Page Insights, Updatable, and Query. It also provides search engine optimization technology, consultancy, and robust reporting; paid search management, paid social, and programmatic display campaigns; data analytics; and content marketing solutions, as well as web design and development. Ayima Group AB (publ) was founded in 2007 and is headquartered in London, the United Kingdom.",
    "website": "http://www.ayimagroup.com",
    "zipcode": "EC1A 9HP"
  },
  "CAU.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "Centaur Media Plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "CENTAUR MEDIA PLC ORD 10P",
    "state": null,
    "summary": "Centaur Media Plc provides business information, training, and specialist consultancy to professional and commercial markets in the United Kingdom, rest of Europe, North America, and internationally. The company's marketing platform includes Econsultancy, Marketing Week, Festival of Marketing, Fashion & Beauty Monitor, Creative Review/Design Week, Oystercatchers, Influencer intelligence, Mini-MBA, and Really. It also offers The Lawyer, which provides intelligence to legal market. Centaur Media Plc was incorporated in 2003 and is headquartered in London, the United Kingdom.",
    "website": "http://www.centaurmedia.com",
    "zipcode": "SE1 7ND"
  },
  "EBQ.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "Ebiquity plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "EBIQUITY PLC ORD 25P",
    "state": null,
    "summary": "Ebiquity plc, together with its subsidiaries, provides media consultancy and investment analysis services worldwide. The company operates through two segments, Media and Analytics & Tech. The Media segment helps advertisers to monitor and evaluate their agencies media buying performance; advises clients on management and selection of media agencies, setting media buying objectives, and the organization of media functions; and supports brand owners to ensure that agencies deliver services as contractually agreed. The Analytics & Tech segment helps advertisers to plan and optimize their investments in media and marketing; supports brand owners to address the specific challenges of managing digital media and automated trading programmes; and helps brands to identify, design, and implement their operating model, and associated data and technology ecosystem. It also offers EbiquityConnect, which streamlines data ingestion from agencies; EbiquitySelect that supports its agency selection work; and EbiquitySync, a standardized tool for benchmarking paid digital media spend. The company was formerly known as Thomson Intermedia Plc. Ebiquity plc was founded in 1997 and is based in London, the United Kingdom.",
    "website": "http://www.ebiquity.com",
    "zipcode": "N1 6DZ"
  },
  "FOUR.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "4imprint Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "4IMPRINT GROUP PLC ORD 38 6/13P",
    "state": null,
    "summary": "4imprint Group plc operates as a direct marketer of promotional products in North America, the United Kingdom, and Ireland. It offers apparel, bags, drinkware, and stationery, as well as writing, technology, outdoor and leisure, tradeshows and signage, auto, home and tools, and wellness and safety products. The company markets its products to individuals in businesses and organizations. 4imprint Group plc was incorporated in 1921 and is based in London, the United Kingdom.",
    "website": "http://investors.4imprint.com",
    "zipcode": "WC2A 1AL"
  },
  "ICON.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "Iconic Labs Plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "ICONIC LABS PLC ORD 0.001P",
    "state": null,
    "summary": "Iconic Labs Plc engages in media and technology business, focuses providing online marketing, and content and technology driven products. It also engages in digital and social media publishing activities. The company offers advisory services to clients on their businesses; and delivers campaigns, as well as provides creative services to its clients. Its activities include monthly insights, content creation and distribution, post campaign analysis, and combining with online media brands. The company was formerly known as WideCells Group PLC and changed its name to Iconic Labs Plc in July 2019. Iconic Labs Plc was founded in 2012 and is based in London, the United Kingdom.",
    "website": "http://www.iconiclabs.co.uk",
    "zipcode": "W1F 8GQ"
  },
  "IMW.F": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Advertising Agencies",
    "long_name": "4imprint Group plc",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "4IMPRINT GRP  LS-,3846",
    "state": null,
    "summary": "4imprint Group plc operates as a direct marketer of promotional products in North America, the United Kingdom, and Ireland. It offers apparel, bags, drinkware, and stationery, as well as writing, technology, outdoor and leisure, tradeshows and signage, auto, home and tools, and wellness and safety products. The company markets its products to individuals in businesses and organizations. 4imprint Group plc was incorporated in 1921 and is based in London, the United Kingdom.",
    "website": "http://investors.4imprint.com",
    "zipcode": "WC2A 1AL"
  },
  "JWNG.L": {
    "city": "Sheffield",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "Jaywing plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "JAYWING PLC ORD 5P",
    "state": null,
    "summary": "Jaywing plc, together with its subsidiaries, provides digital marketing services in the United Kingdom and Australia. The company operates through three segments: Brand Performance, Online Performance, and Data, Analysis & Technology. It offers marketing agency and consultancy services. The company also provides data services and consultancy; search engine optimization; Website designing and building; online marketing and media; and product development services. It serves retail, FMCG, financial services, education, not-for-profit, travel and leisure, technology, utilities, oil and gas, and hospitality sectors. The company was formerly known as Weare 2020 plc and changed its name to Jaywing plc in April 2013. Jaywing plc was founded in 1999 and is based in Sheffield, the United Kingdom.",
    "website": "http://www.jaywing.com",
    "zipcode": "S1 4RG"
  },
  "M7K.F": {
    "city": "Barnstaple",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Advertising Agencies",
    "long_name": "The Mission Group plc",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "MISSION GROUP PLC LS -,10",
    "state": null,
    "summary": "The Mission Group plc provides marketing and advertising related services in the United Kingdom, rest of Europe, Asia, and the United States. The company offers marketing communications services specializing in the technology, medical, and automotive sector; public relations services; and advertising, media buying, digital marketing, events, and training services. It also provides sales promotion services; sports, fitness, and entertainment marketing services; pricing and market access services for the healthcare sector; brand development and creative direct communication services; and operates as a property-marketing agency providing advertising, media, brochures, signage, exhibitions, CGI, animation, intranet, and photography services. The company was formerly known as The Mission Marketing Group plc and changed its name to The Mission Group plc in September 2019. The Mission Group plc was incorporated in 2006 and is based in London, the United Kingdom.",
    "website": "http://www.themission.co.uk",
    "zipcode": "EX32 0RN"
  },
  "MDZ.L": {
    "city": "Woking",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "MediaZest plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "MEDIAZEST PLC ORD 0.01P",
    "state": null,
    "summary": "MediaZest Plc, through its subsidiaries, provides audio, visual, satellite delivery, content management, and consumer interaction platform worldwide. The company's products include projection products, such as window projections, interactive projections onto walls and floors, building and projection mapping; virtual mannequin products; and hologram products. It also provides digital signage networks, video walls, and LED solutions; and audio solutions comprising whispering windows, in-store music, and directional speakers. In addition, the company offers system design, product sourcing, build and test, data tracking and reporting, maintenance and content management, installation, and content creation services, as well as customer data software and audience measurement solutions. It offers its products to retailers and brand owners for communicating with customers to enhance sales and brand awareness. The company has operations in the United Kingdom, the Channel Islands, the Netherlands, Switzerland, Italy, Germany, North America, and internationally. MediaZest Plc was incorporated in 2004 and is based in Woking, the United Kingdom.",
    "website": "http://www.mediazest.com",
    "zipcode": "GU21 5JY"
  },
  "MIRI.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "Mirriad Advertising plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "MIRRIAD ADVERTISING PLC ORD GBP",
    "state": null,
    "summary": "Mirriad Advertising plc, a video technology company, provides in-video advertising services to broadcasters, advertisers, brand owners, and their agencies. It inserts products, signage formats, or videos into content. It serves customers in the United Kingdom, the United States, China, Singapore, and India. Mirriad Advertising plc was incorporated in 2015 and is based in London, the United Kingdom.",
    "website": "http://www.mirriad.com",
    "zipcode": "SE1 0BE"
  },
  "MMDDF": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Advertising Agencies",
    "long_name": "Mirriad Advertising plc",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "MIRRIAD ADVERTISING PLC",
    "state": null,
    "summary": "Mirriad Advertising plc, a video technology company, provides in-video advertising services to broadcasters, advertisers, brand owners, and their agencies. It inserts products, signage formats, or videos into content. It serves customers in the United Kingdom, the United States, China, Singapore, and India. Mirriad Advertising plc was incorporated in 2015 and is based in London, the United Kingdom.",
    "website": "http://www.mirriad.com",
    "zipcode": "SE1 0BE"
  },
  "NAH.L": {
    "city": "Kettering",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "NAHL Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "NAHL GROUP PLC ORD GBP0.0025",
    "state": null,
    "summary": "NAHL Group plc, together with its subsidiaries, engages in the marketing and services business focusing on the consumer legal services market in the United Kingdom. The company operates through Personal Injury, Critical Care, and Residential Property divisions. The Personal Injury division offers outsourced marketing services and products to law firms; and claims processing services to individuals. The Critical Care division provides specialist services in the catastrophic and serious injury market to claimants and defendants. Its services include expert witness quantum reports and nursing liability reports; immediate needs assessments; case management services for short or long term needs; vocational rehabilitation services; and behavior assessment and management services for children and young people. The Residential Property division offers marketing services to law firms and conveyancers, as well as surveys process services. NAHL Group plc was founded in 1993 and is based in Kettering, the United Kingdom.",
    "website": "http://www.nahlgroupplc.co.uk",
    "zipcode": "NN15 6XR"
  },
  "NFC.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "Next Fifteen Communications Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "NEXT FIFTEEN COMMUNICATIONS GRO",
    "state": null,
    "summary": "Next Fifteen Communications Group plc, together with its subsidiaries, provides communications services in the United Kingdom, Europe, Africa, the United States, and the Asia Pacific. It offers strategy and insight, online marketing, corporate and internal communications, media training, brand and message consultancy, market research, digital, marketing communications, and creative and content, as well as public, media, analyst, and investor relations services; and digital and technology products and services. The company provides its services under the Agent3, encore, Publitek, Beyond, Savanta, MBooth, MBooth Health, MACH 49, MIGHTY SOCIAL, Archetype, Conversion Rate Experts, Twogether, ODD, The Blueshirt Group, OutCast, Velocity, SMG., ELVIS, Brandwidth, Activate, Planning-inc, and Palladium brands. Next Fifteen Communications Group plc was incorporated in 1981 and is based in London, the United Kingdom.",
    "website": "http://www.next15.com",
    "zipcode": "SE1 3XF"
  },
  "NHLPF": {
    "city": "Kettering",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Advertising Agencies",
    "long_name": "NAHL Group plc",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "NAHL GROUP PLC",
    "state": null,
    "summary": "NAHL Group plc, together with its subsidiaries, engages in the marketing and services business focusing on the consumer legal services market in the United Kingdom. The company operates through Personal Injury, Critical Care, and Residential Property divisions. The Personal Injury division offers outsourced marketing services and products to law firms; and claims processing services to individuals. The Critical Care division provides specialist services in the catastrophic and serious injury market to claimants and defendants. Its services include expert witness quantum reports and nursing liability reports; immediate needs assessments; case management services for short or long term needs; vocational rehabilitation services; and behavior assessment and management services for children and young people. The Residential Property division offers marketing services to law firms and conveyancers, as well as surveys process services. NAHL Group plc was founded in 1993 and is based in Kettering, the United Kingdom.",
    "website": "http://www.nahlgroupplc.co.uk",
    "zipcode": "NN15 6XR"
  },
  "PEBB.L": {
    "city": "Manchester",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "The Pebble Group Plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "THE PEBBLE GROUP PLC ORD 1P",
    "state": null,
    "summary": "The Pebble Group Plc provides products, services, and technology to the promotional products industry in the United Kingdom, Continental Europe, the United States, and internationally. It operates through two segments, Brand Addition and Facilisgroup. The company is involved in the design, sourcing, and delivery of promotional merchandise and branded products for various brands operating in the health and beauty, fast moving consumer goods, transport, technology, banking and finance, and charity sectors. It also offers @ease software that provides an end-to-end SaaS business platform to support the operations of SME promotional product distributors. The company was incorporated 2019 and is headquartered in Manchester, the United Kingdom.",
    "website": "http://www.thepebblegroup.com",
    "zipcode": "M17 1DD"
  },
  "SAA.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "M&C Saatchi plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "M&C SAATCHI PLC ORD 1P",
    "state": null,
    "summary": "M&C Saatchi plc provides advertising and marketing services in Europe, the Middle East, Africa, Asia, Australia, and the Americas. The company offers its services in the areas of media buying, direct marketing, talent management, mobile marketing, research agency, Website construction, branding and digital marketing, design, marketing strategy, finished art and production management, marketing consultant, and sport sponsorship and entertainment PR agency. The company was founded in 1995 and is headquartered in London, the United Kingdom.",
    "website": "http://www.mcsaatchiplc.com",
    "zipcode": "W1F 9EE"
  },
  "SAL.L": {
    "city": "Glasgow",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "SpaceandPeople plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "SPACEANDPEOPLE PLC ORD 1P",
    "state": null,
    "summary": "SpaceandPeople PLC markets and sells promotional and retail licensing space on behalf of shopping centers, retail parks, railway stations, and other venues in the United Kingdom, Germany, and India. The company operates in two segments, Promotional Sales and Retail. The company markets, sells, and administers space in footfall venues, including shopping centers, garden centers, city centers, retail parks, and travel hubs. It also offers the customer connect kiosk, a digital experiential platform for promotional activities of companies; and media services, as well as leases retail merchandising units. In addition, the company provides consumer brands the opportunity to promote their products through direct consumer engagement with experiential marketing events; and designs, builds, and installs kiosks, pop-up shops, and mobile kiosks to suit business needs and requirements. SpaceandPeople PLC was incorporated in 2000 and is headquartered in Glasgow, the United Kingdom.",
    "website": "http://www.spaceandpeople.co.uk",
    "zipcode": "G1 2NP"
  },
  "SCPPF": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Advertising Agencies",
    "long_name": "S4 Capital plc",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Communication Services",
    "short_name": "S4 CAPITAL PLC",
    "state": null,
    "summary": "S4 Capital plc, together with its subsidiaries, operates as a digital advertising and marketing services company in the Americas, Europe and the Middle East, and the Asia Pacific. It operates through First-Party Data Practice, Content, and Programmatic segments. The company offers contents, campaigns, and assets for paid, social, and earned media, such as digital platforms and apps, as well as brand activations. It provides campaign management analytics, creative production and ad serving, platform and systems integration and transition, and training and education services. The company is headquartered in London, the United Kingdom.",
    "website": "http://www.s4capital.com",
    "zipcode": "SW1A 1NX"
  },
  "SFOR.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "S4 Capital plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "S4 CAPITAL PLC ORD 25P",
    "state": null,
    "summary": "S4 Capital plc, together with its subsidiaries, operates as a digital advertising and marketing services company in the Americas, Europe and the Middle East, and the Asia Pacific. It operates through First-Party Data Practice, Content, and Programmatic segments. The company offers contents, campaigns, and assets for paid, social, and earned media, such as digital platforms and apps, as well as brand activations. It provides campaign management analytics, creative production and ad serving, platform and systems integration and transition, and training and education services. The company is headquartered in London, the United Kingdom.",
    "website": "http://www.s4capital.com",
    "zipcode": "SW1A 1NX"
  },
  "SYS1.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "System1 Group PLC",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "SYSTEM1 GROUP PLC ORD 1P",
    "state": null,
    "summary": "System1 Group PLC, together with its subsidiaries, provides marketing and market research consultancy services. The company offers a range of tools, such as predictive marketing tool that uses the wisdom of the crowd to identify winning concepts; and ad-testing tool that identifies efficient and high-return advertising. It operates in the Americas, the United Kingdom, Continental Europe, and the Asia Pacific. The company was formerly known as BrainJuicer Group PLC and changed its name to System1 Group PLC in March 2017. System1 Group PLC was founded in 1999 and is headquartered in London, the United Kingdom.",
    "website": "http://www.system1group.com",
    "zipcode": "WC1R 4LR"
  },
  "TMG.L": {
    "city": "Barnstaple",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "The Mission Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "THE MISSION GROUP PLC ORD 10P",
    "state": null,
    "summary": "The Mission Group plc provides marketing and advertising related services in the United Kingdom, rest of Europe, Asia, and the United States. The company offers marketing communications services specializing in the technology, medical, and automotive sector; public relations services; and advertising, media buying, digital marketing, events, and training services. It also provides sales promotion services; sports, fitness, and entertainment marketing services; pricing and market access services for the healthcare sector; brand development and creative direct communication services; and operates as a property-marketing agency providing advertising, media, brochures, signage, exhibitions, CGI, animation, intranet, and photography services. The company was formerly known as The Mission Marketing Group plc and changed its name to The Mission Group plc in September 2019. The Mission Group plc was incorporated in 2006 and is based in London, the United Kingdom.",
    "website": "http://www.themission.co.uk",
    "zipcode": "EX32 0RN"
  },
  "W0G.SG": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Advertising Agencies",
    "long_name": "Iconic Labs Plc",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "Iconic Labs PLC Registered Shar",
    "state": null,
    "summary": "Iconic Labs Plc engages in media and technology business, focuses providing online marketing, and content and technology driven products. It also engages in digital and social media publishing activities. The company offers advisory services to clients on their businesses; and delivers campaigns, as well as provides creative services to its clients. Its activities include monthly insights, content creation and distribution, post campaign analysis, and combining with online media brands. The company was formerly known as WideCells Group PLC and changed its name to Iconic Labs Plc in July 2019. Iconic Labs Plc was founded in 2012 and is based in London, the United Kingdom.",
    "website": "http://www.iconiclabs.co.uk",
    "zipcode": "W1F 8GQ"
  },
  "WPP": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Advertising Agencies",
    "long_name": "WPP plc",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Communication Services",
    "short_name": "WPP plc",
    "state": null,
    "summary": "WPP plc, a creative transformation company, provides communications, experience, commerce, and technology services in North America, the United Kingdom, Western Continental Europe, Asia Pacific, Latin America, Africa, Middle East, and Central and Eastern Europe. The company operates through three segments: Global Integrated Agencies, Public Relations, and Specialist Agencies. It engages in the business of planning and creation of marketing and branding campaigns; designs advertisements across all media; and provides media buying services including strategy and business development, media investment, and data, technology and content. The company provides advises to clients who are seeking to communicate with a range of stakeholders from consumers to governments and the business and financial communities. WPP plc was founded in 1985 and is based in London, the United Kingdom.",
    "website": "http://www.wpp.com",
    "zipcode": "SE1 9GL"
  },
  "WPP.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "WPP plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "WPP PLC ORD 10P",
    "state": null,
    "summary": "WPP plc, a creative transformation company, provides communications, experience, commerce, and technology services in North America, the United Kingdom, Western Continental Europe, Asia Pacific, Latin America, Africa, the Middle East, and Central and Eastern Europe. The company operates through three segments: Global Integrated Agencies, Public Relations, and Specialist Agencies. It engages in the business of planning and creation of marketing and branding campaigns; designs advertisements across all media; and provides media buying services, including strategy and business development, media investment, data and technology, and content. The company provides advises to clients who are seeking to communicate with a range of stakeholders from consumers to governments and the business and financial communities. WPP plc was founded in 1985 and is based in London, the United Kingdom.",
    "website": "http://www.wpp.com",
    "zipcode": "SE1 9GL"
  },
  "WPPGF": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Advertising Agencies",
    "long_name": "WPP plc",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Communication Services",
    "short_name": "WPP PLC",
    "state": null,
    "summary": "WPP plc, a creative transformation company, provides communications, experience, commerce, and technology services in North America, the United Kingdom, Western Continental Europe, Asia Pacific, Latin America, Africa, the Middle East, and Central and Eastern Europe. The company operates through three segments: Global Integrated Agencies, Public Relations, and Specialist Agencies. It engages in the business of planning and creation of marketing and branding campaigns; designs advertisements across all media; and provides media buying services, including strategy and business development, media investment, data and technology, and content. The company provides advises to clients who are seeking to communicate with a range of stakeholders from consumers to governments and the business and financial communities. WPP plc was founded in 1985 and is based in London, the United Kingdom.",
    "website": "http://www.wpp.com",
    "zipcode": "SE1 9GL"
  },
  "Y1G.F": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Advertising Agencies",
    "long_name": "YouGov plc",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "YOUGOV PLC  LS -,002",
    "state": null,
    "summary": "YouGov plc provides online market research services in the United Kingdom, the United States, Germany, the Nordic countries, the Middle East, Mainland Europe, and the Asia Pacific. It operates through three divisions: Data Products, Data Services, and Custom Research. The Data Products division offers syndicated data products, which are available to clients on a subscription basis. The Data Services division provides clients with fast-turnaround services. The Custom Research division offers a range of quantitative and qualitative research services. The company is also involved in the software development and media production businesses, as well as provision of operations services. YouGov plc was founded in 2000 and is headquartered in London, the United Kingdom.",
    "website": "http://www.yougov.co.uk",
    "zipcode": "EC1Y 8RT"
  },
  "YOU.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Advertising Agencies",
    "long_name": "YouGov plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Communication Services",
    "short_name": "YOUGOV PLC ORD 0.2P",
    "state": null,
    "summary": "YouGov plc provides online market research services in the United Kingdom, the United States, Germany, the Nordic countries, the Middle East, Mainland Europe, and the Asia Pacific. It operates through three divisions: Data Products, Data Services, and Custom Research. The Data Products division offers syndicated data products, which are available to clients on a subscription basis. The Data Services division provides clients with fast-turnaround services. The Custom Research division offers a range of quantitative and qualitative research services. The company is also involved in the software development and media production businesses, as well as provision of operations services. YouGov plc was founded in 2000 and is headquartered in London, the United Kingdom.",
    "website": "http://www.yougov.co.uk",
    "zipcode": "EC1Y 8RT"
  },
  "YUGVF": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Advertising Agencies",
    "long_name": "YouGov plc",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "YOUGOV",
    "state": null,
    "summary": "YouGov plc provides online market research services in the United Kingdom, the United States, Germany, the Nordic countries, the Middle East, Mainland Europe, and the Asia Pacific. It operates through three divisions: Data Products, Data Services, and Custom Research. The Data Products division offers syndicated data products, which are available to clients on a subscription basis. The Data Services division provides clients with fast-turnaround services. The Custom Research division offers a range of quantitative and qualitative research services. The company is also involved in the software development and media production businesses, as well as provision of operations services. YouGov plc was founded in 2000 and is headquartered in London, the United Kingdom.",
    "website": "http://www.yougov.co.uk",
    "zipcode": "EC1Y 8RT"
  }
}
