{
    "MGGTN.MX": {
        "short_name": "MEGGITT",
        "long_name": "Meggitt PLC",
        "summary": "Meggitt PLC designs and manufactures components and sub-systems in the United Kingdom, rest of Europe, the United States, and internationally. The company operates through four segments: Airframe Systems, Engine Systems, Energy & Equipment, and Services & Support. It offers ice protection products, radomes, and structures; air data and flight display products; brake control and tyre pressure monitoring systems, and wheels and brakes; engine health and vibration monitors, H2/O2 analyzers, and turbine monitoring and protection products; and aircraft cameras and security systems, and wireless aircraft systems. The company also provides ammunition handling, thermal, weapon scoring, and weapon training systems; energy storage, power conversion and distribution, and power generation systems; ducting systems, engine composites, and flow control valves; and fire protection and controls comprising bleed air leak detection products, cables and clamps, electronic control units, fire and overheat detection products, and fire suppression products. In addition, it offers ground fuelling, and fuel systems and tanks; motion control actuators, electric motor drives, and electric motors; oxygen and specialty restraint safety systems; and accelerometers, ceramics, fluid sensors, magnetic and current sensors, position and inertial sensors, pressure sensors, speed sensors, and temperature sensors. Further, the company provides polymer seals; heat exchangers, printed circuit heat exchangers, thermal components, and thermal management systems; and live fire and virtual trainers, as well as aftermarket services. It serves aerospace, defense, and energy and equipment markets. The company was formerly known as Meggitt Holdings Public Limited Company and changed its name to Meggitt PLC in April 1989. Meggitt PLC was founded in 1947 and is based in Christchurch, the United Kingdom.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense - Major Diversified",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "city": "Christchurch"
    }
}