{
    "8A3.SG": {
        "short_name": "Autins Group PLC Registered Sha",
        "long_name": "Autins Group plc",
        "summary": "Autins Group plc, an investment holding company, engages in the design, manufacture, and supply of acoustic and thermal insulation solutions, and supply of noise vibration and harshness insulation materials primarily to the automotive sector in the United Kingdom and internationally. It offers a range of materials, such as non-woven PET/PP, thermoplastics, polyurethane, and laminates; and various processes, which includes manufacturing, conversion, and tooling and component design and testing. The company also provides technical support that includes, acoustics and thermal experts, diagnosis, bespoke and tailored solutions, and program management. It also serves white goods, power generation, construction, marine, apparel, rail, commercial vehicles, flooring, office interiors, medical devices, and industrial sectors. Autins Group plc was founded in 1966 and is headquartered in Rugby, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Rugby"
    },
    "ABDP.L": {
        "short_name": "AB DYNAMICS PLC ORD 1P",
        "long_name": "AB Dynamics plc",
        "summary": "AB Dynamics plc, through its subsidiaries, designs, develops, manufactures, and supplies testing and verification products and services for advanced driver assistance systems (ADAS), autonomous vehicle technology, and vehicle dynamics in the United Kingdom, rest of Europe, North America, the Asia Pacific, and internationally. It offers guided soft target and LaunchPad that uses control software for control and synchronization of multiple test objects, as well as provides test track services. The company also offers laboratory testing and simulation, including Advanced Vehicle Driving Simulator, the Static Simulator, Axle Level NVH, and the rFpro physics-based simulation software environment. Its products are used to evaluate vehicle dynamics, noise, vibration, and harshness and autonomy for a range of applications comprise conventional vehicles, motorsport, and automated/autonomous vehicles. The company was founded in 1982 and is headquartered in Bradford-on-Avon, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Bradford-on-Avon"
    },
    "AUTG.L": {
        "short_name": "AUTINS GROUP PLC ORD GBP0.02",
        "long_name": "Autins Group plc",
        "summary": "Autins Group plc, an investment holding company, engages in the design, manufacture, and supply of acoustic and thermal insulation solutions, and supply of noise vibration and harshness insulation materials primarily to the automotive sector in the United Kingdom and internationally. It offers a range of materials, such as non-woven PET/PP, thermoplastics, polyurethane, and laminates; and various processes, which includes manufacturing, conversion, and tooling and component design and testing. The company also provides technical support that includes, acoustics and thermal experts, diagnosis, bespoke and tailored solutions, and program management. It also serves white goods, power generation, construction, marine, apparel, rail, commercial vehicles, flooring, office interiors, medical devices, and industrial sectors. Autins Group plc was founded in 1966 and is headquartered in Rugby, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Rugby"
    },
    "C1Y.F": {
        "short_name": "CARCLO PLC  LS-,05",
        "long_name": "Carclo plc",
        "summary": "Carclo plc, together with its subsidiaries, manufactures fine tolerance injection molded plastic parts. It operates through three segments: Technical Plastics, LED Technologies, and Aerospace. The Technical Plastics segment manufactures and supplies fine tolerance and injection molded plastic components for use in the medical, optical, and electronic products. The LED Technologies segment develops and supplies specialized injection molded LED based lighting systems for premium automotive industries; and supplies LED optics for various industries. The Aerospace segment manufactures various specialist components, such as control cables, specialist machined parts, aerofoil blading, streamline wires, and tie rods for the aerospace industries. The company operates in the United Kingdom, North America, the Czech Republic, China, India, and internationally. Carclo plc was founded in 1924 and is based in Ossett, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Ossett"
    },
    "CAR.L": {
        "short_name": "CARCLO PLC ORD 5P",
        "long_name": "Carclo plc",
        "summary": "Carclo plc, together with its subsidiaries, manufactures fine tolerance injection molded plastic parts. It operates through three segments: Technical Plastics, LED Technologies, and Aerospace. The Technical Plastics segment manufactures and supplies fine tolerance and injection molded plastic components for use in the medical, optical, and electronic products. The LED Technologies segment develops and supplies specialized injection molded LED based lighting systems for premium automotive industries; and supplies LED optics for various industries. The Aerospace segment manufactures various specialist components, such as control cables, specialist machined parts, aerofoil blading, streamline wires, and tie rods for the aerospace industries. The company operates in the United Kingdom, North America, the Czech Republic, China, India, and internationally. Carclo plc was founded in 1924 and is based in Ossett, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Ossett"
    },
    "SCE.L": {
        "short_name": "SURFACE TRANSFORMS PLC ORD 1P",
        "long_name": "Surface Transforms Plc",
        "summary": "Surface Transforms Plc, together with its subsidiaries, designs, develops, manufactures, and sells carbon ceramic products for the brakes market in the United Kingdom and rest of Europe; the United States; and internationally. It offers carbon-ceramic brake kits and brake disc assemblies for automotive original equipment manufacturers. The company also provides carbon-ceramic materials for various types of aircraft brake applications, as well as for motorsports, military, and other special vehicles. In addition, it manufactures and supplies carbon-fibre pre-forms that are used as base materials for producing carbon-carbon brake discs and other carbon-carbon components. The company was founded in 1992 and is based in Liverpool, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Liverpool"
    },
    "TIFS.L": {
        "short_name": "TI FLUID SYSTEMS PLC ORD 1P",
        "long_name": "TI Fluid Systems plc",
        "summary": "TI Fluid Systems plc manufactures and supplies automotive fluid storage, carrying, distribution, and thermal management products to support various propulsion systems worldwide. It operates through two segments, Fluid Carrying Systems (FCS) and Fuel Tank and Delivery Systems (FTDS). The FCS segment offers brake and fuel lines and bundles, such as double-wall and single-wall steel fluid carrying lines, and bundles for brake and fuel systems; multi-layer plastic lines for vapor, thermal management, and exhaust treatment; sensor-integrated connectors for installation and system assembly; and heated plastic lines for selective catalyst reduction urea fluids. This segment also provides thermal products, including thermal management technology for hybrid-electric vehicle battery packs; climate control tube and hose assemblies; coaxial or tube-in-tube assemblies; accumulators and receiver dryers; and heater and radiator hoses, as well as powertrain products comprising gasoline direct injection lines and rails, high-pressure diesel lines, and turbocharger cooling lines. The FTDS segment offers fuel tank products, such as plastic fuel tanks for gasoline, diesel, and flex fuel vehicles; partial zero emissions vehicle fuel tanks; pressurized fuel tank systems for hybrid vehicles; low emission vehicle fuel tanks; delivery and return components; and plastic fuel filler tubes. This segment also provides pump and module products, such as brushed and brushless pumps, modules, electronics controls, additive dosing systems, and sensors; and aftermarket products. The company serves automotive original equipment manufacturers. TI Fluid Systems plc was founded in 1922 and is headquartered in Oxford, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Oxford"
    }
}