{
    "0JL.SG": {
        "short_name": "ALUMASC GROUP PLC Registered Sh",
        "long_name": "The Alumasc Group plc",
        "summary": "The Alumasc Group plc, together with its subsidiaries, designs, manufactures, and sells building products, systems, and solutions in the United Kingdom, Europe, North America, the Middle East, the Far East, and internationally. It offers integrated roofing and walling solutions, including solar shading, architectural screening, and balcony and balustrading systems; water management solutions to manage and attenuate water; and housebuilding products. The company was incorporated in 1983 and is based in Kettering, the United Kingdom.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Kettering",
        "zipcode": "NN15 5JP",
        "website": "http://www.alumasc.co.uk",
        "market_cap": "Small Cap"
    },
    "0P5.F": {
        "short_name": "GENUIT GROUP (WI)  LS-001",
        "long_name": "Genuit Group plc",
        "summary": "Genuit Group plc manufactures and sells piping systems, and water and climate management systems in the United Kingdom, other European countries, and internationally. The company operates through two segments, Residential Systems, and Commercial and Infrastructure Systems. It offers above and below ground drainage, and rainwater drainage systems; plumbing tools and accessories, plastic plumbing fittings, and plumbing and heating pipes; underfloor heating products; and ventilation systems. The company also provides water and gas supply systems, such as water supply, pre-insulated pipe, polypropylene, clamp saddle, PVCu pressure, and ABS pressure pipe systems, as well as accessories. In addition, it offers water management solutions, such as rainwater harvesting, geo-cellular system, terrain controlled flow rainwater outlet systems, large diameter pipe systems, chambers, flow controllers, penstocks and valves, manholes, surface water treatment devices, and rain water re-use solutions. Further, the company provides terrain and surface water drainage systems; sewer systems; and cable protection products. It offers its products for use in the residential, commercial, civil, infrastructure, and public non-housing sectors. The company was formerly known as Polypipe Group plc and changed its name to Genuit Group plc in April 2021. Genuit Group plc was founded in 1980 and is based in Doncaster, the United Kingdom.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Doncaster",
        "zipcode": "DN12 1ES",
        "website": "http://www.polypipe.com",
        "market_cap": "Mid Cap"
    },
    "73S.F": {
        "short_name": "SAFESTYLE UK PLC  LS-,01",
        "long_name": "Safestyle UK plc",
        "summary": "Safestyle UK plc designs, manufactures, sells, installs, and maintains windows and doors for the homeowner market in the United Kingdom. The company offers domestic, double-glazed, and replacement PVCu windows and doors. It provides its products through a network of 33 sales branches and 13 installation depots. Safestyle UK plc was founded in 1992 and is headquartered in Bradford, the United Kingdom.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Bradford",
        "zipcode": "BD1 3AZ",
        "website": "http://www.safestyleukplc.co.uk",
        "market_cap": "Small Cap"
    },
    "ALU.L": {
        "short_name": "ALUMASC GROUP PLC ORD 12.5P",
        "long_name": "The Alumasc Group plc",
        "summary": "The Alumasc Group plc, together with its subsidiaries, designs, manufactures, and sells building products, systems, and solutions in the United Kingdom, Europe, North America, the Middle East, the Far East, and internationally. It offers integrated roofing and walling solutions, including solar shading, architectural screening, and balcony and balustrading systems; water management solutions to manage and attenuate water; and housebuilding products. The company was incorporated in 1983 and is based in Kettering, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Kettering",
        "zipcode": "NN15 5JP",
        "website": "http://www.alumasc.co.uk",
        "market_cap": null
    },
    "ECEL.L": {
        "short_name": "EUROCELL PLC ORD GBP0.001",
        "long_name": "Eurocell plc",
        "summary": "Eurocell plc manufactures, distributes, and recycles windows, doors, and roofline polyvinyl chloride (PVC) building products in the United Kingdom. It operates in Profiles and Building Plastics segments. The company manufactures and sells extruded rigid and foam PVC profiles to third-party fabricators. It also distributes a range of Eurocell PVC foam roofline products and Vista doors; locks and hardware primarily to the repair, maintenance, and improvements market; building plastic materials; and third-party ancillary products, including sealants, tools, and rainwater products, as well as windows to the new and replacement window markets. The company sells its products to installers, small and independent builders, house builders, and maintenance companies, as well as roofline products to independent wholesalers. Eurocell plc was founded in 1974 and is headquartered in Alfreton, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Alfreton",
        "zipcode": "DE55 2DT",
        "website": "http://www.eurocell.co.uk",
        "market_cap": null
    },
    "EPWN.L": {
        "short_name": "EPWIN GROUP PLC ORD 0.05P",
        "long_name": "Epwin Group PLC",
        "summary": "Epwin Group Plc manufactures and sells building products in the United Kingdom, rest of Europe, and internationally. It operates in two segments, Extrusion and Moulding, and Fabrication and Distribution. The company offers windows, doors, cavity closers, and curtain walling products; wood plastic composite decking products and panels; glass reinforced plastic prefabricated components, such as door canopies, dormers, chimneys, copings, bay window canopies, and bespoke components; fascias and cladding systems; rainwater, soil, and underground drainage products; bathroom panels/wall boards; and insulated glazing units. It is also involved in the extrusion of PVC-u and PVC-ue materials; and supply and installation of plastic building products. The company serves social housing providers, new build companies, contractors, architects, designers and specifiers, specialist roofline and window stockists, window fabricators, roofline installers, window installers, rainwater and drainage wholesalers, builder merchants, bathroom wholesalers, bathroom installers, DIY retailers, builders, and homeowners. It operates a network of 77 building plastic trade distribution centers and 12 window stores. The company was founded in 1976 and is headquartered in Solihull, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Solihull",
        "zipcode": "B90 4QT",
        "website": "http://www.epwin.co.uk",
        "market_cap": null
    },
    "FAN.L": {
        "short_name": "VOLUTION GROUP PLC ORD GBP0.01",
        "long_name": "Volution Group plc",
        "summary": "Volution Group plc, together with its subsidiaries, manufactures and supplies ventilation products to residential and commercial construction markets in the United Kingdom, Continental Europe, Australasia, and internationally. The company's products include unitary extractor fans for use in bathrooms and kitchens; MVHR and MEV systems; rigid, semi-rigid, and flexible ducting products and accessories; mechanical heat recovery units; air handling units and fan coils; commercial ventilation products; underfloor heating, heated towel rails, radiators, and storage and panel heaters; wall, box, and tower fans, as well as portable air conditioners; hand dryers and insect killers; and sensors, controllers, and ducting products. It also manufactures blowers and motors for the heating and ventilation industry, such as direct and belt-drive fans, fandecks, double inlet centrifugal blowers, motorized impellers, and combustion blowers. The company sells its products principally under the Vent-Axia, Manrose, Diffusion, Airtech, National Ventilation, Breathing Buildings, Torin-Sifan, Fresh, PAX, VoltAir, Kair, Air Connection, inVENTer, Ventilair, Simx, and Ventair brands. Volution Group plc was incorporated in 2014 and is based in Crawley, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Crawley",
        "zipcode": "RH10 9YX",
        "website": "http://www.volutiongroupplc.com",
        "market_cap": null
    },
    "GEN.L": {
        "short_name": "GENUIT GROUP PLC ORD GBP0.001",
        "long_name": "Genuit Group plc",
        "summary": "Genuit Group plc manufactures and sells piping systems, and water and climate management systems in the United Kingdom, other European countries, and internationally. The company operates through two segments, Residential Systems, and Commercial and Infrastructure Systems. It offers above and below ground drainage, and rainwater drainage systems; plumbing tools and accessories, plastic plumbing fittings, and plumbing and heating pipes; underfloor heating products; and ventilation systems. The company also provides water and gas supply systems, such as water supply, pre-insulated pipe, polypropylene, clamp saddle, PVCu pressure, and ABS pressure pipe systems, as well as accessories. In addition, it offers water management solutions, such as rainwater harvesting, geo-cellular system, terrain controlled flow rainwater outlet systems, large diameter pipe systems, chambers, flow controllers, penstocks and valves, manholes, surface water treatment devices, and rain water re-use solutions. Further, the company provides terrain and surface water drainage systems; sewer systems; and cable protection products. It offers its products for use in the residential, commercial, civil, infrastructure, and public non-housing sectors. The company was formerly known as Polypipe Group plc and changed its name to Genuit Group plc in April 2021. Genuit Group plc was founded in 1980 and is based in Doncaster, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Doncaster",
        "zipcode": "DN12 1ES",
        "website": "http://www.polypipe.com",
        "market_cap": null
    },
    "HSJA.F": {
        "short_name": "HALSTEAD, JAMES  LS-,05",
        "long_name": "James Halstead plc",
        "summary": "James Halstead plc manufactures and supplies flooring products for commercial and domestic uses in the United Kingdom, rest of Europe, Scandinavia, Australasia, Asia, and internationally. The company offers its products under the Polyflor, Palettone, Camaro, Polysafe, Recofloor, and Expona names. The company was founded in 1914 and is based in Manchester, the United Kingdom.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Manchester",
        "zipcode": "M26 1JN",
        "website": "http://www.jameshalstead.com",
        "market_cap": "Small Cap"
    },
    "HSJA.SG": {
        "short_name": "Halstead PLC, James Registered ",
        "long_name": "James Halstead plc",
        "summary": "James Halstead plc manufactures and supplies flooring products for commercial and domestic uses in the United Kingdom, rest of Europe, Scandinavia, Australasia, Asia, and internationally. The company offers its products under the Polyflor, Palettone, Camaro, Polysafe, Recofloor, and Expona names. The company was founded in 1914 and is based in Manchester, the United Kingdom.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Manchester",
        "zipcode": "M26 1JN",
        "website": "http://www.jameshalstead.com",
        "market_cap": "Small Cap"
    },
    "HSM.L": {
        "short_name": "HEATH (SAMUEL) & SONS PLC ORD 1",
        "long_name": "Samuel Heath & Sons plc",
        "summary": "Samuel Heath & Sons plc manufactures and markets various products in the builders' hardware and bathroom field in the United Kingdom. The company offers bathroom products, such as thermostatic shower kits and sets; trim sets for thermostatic valves, diverters, and flow controls; concealed thermostatic showers; basin fillers, sets, taps, and mixers; bath and shower fillers and mixers; towel rings and rails; paper and tumbler holders; hooks; soap dispensers and holders; soap baskets; wall mounted toilet brushes; framed mirrors; and shower heads. It also provides body jets; bidet sprays; hand showers; braided and smooth hoses; wall brackets, outlets, and elbows; overhead shower arms; angle bushes; bath bosses; slider rails and rail kits; ceiling tubes for shower head; escucheon; and optional indices bath, hand shower, and shower head for lever, as well as body jets for lever and cross tops. In addition, the company offers architectural hardware products, including letter plates, box protectors, and flap covers; door knockers, knobs, levers, catches, and stops and holders; casement fasteners; pins; bell pushes; cylinder latch pull sets and pulls; door numerals; door chains; pull, sash, and lever handles; round, visible fix, and concealed fix roses; coin releases; thumb turns; escutcheon; push and back plates; surface, indicator, flush, and lever flush bolts; and bolt backsets. Further, it provides security door bolts and bolt keys; cords; screw pulley with nylon wheels; sash hooks, lifts, pivots, screws, and stops; knot holders; light and dark wood cord handles; window espagnolette handles; cleat hooks; fanlight and trip catches; cupboard pulls and knobs; flush handle sets, spring catches, pulls, rings, and handles; button on plates; hat, coat, wardrobe and cabin hooks; desk stays; hasps and staples; handrail brackets; and ventilators. Samuel Heath & Sons plc was founded in 1820 and is headquartered in Birmingham, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Birmingham",
        "zipcode": "B12 0UJ",
        "website": "http://www.samuel-heath.com",
        "market_cap": null
    },
    "JHD.L": {
        "short_name": "JAMES HALSTEAD PLC ORD 5P",
        "long_name": "James Halstead plc",
        "summary": "James Halstead plc manufactures and supplies flooring products for commercial and domestic uses in the United Kingdom, rest of Europe, Scandinavia, Australasia, Asia, and internationally. The company offers its products under the Polyflor, Palettone, Camaro, Polysafe, Recofloor, and Expona names. The company was founded in 1914 and is based in Manchester, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Manchester",
        "zipcode": "M26 1JN",
        "website": "http://www.jameshalstead.com",
        "market_cap": null
    },
    "LFPB.F": {
        "short_name": "TRAVIS PERKINS  LS-,1",
        "long_name": "Travis Perkins plc",
        "summary": "Travis Perkins plc distributes building materials to the building, construction, and home improvement markets in the United Kingdom. It operates through four segments: Merchanting, Retail, Toolstation, and Plumbing & Heating. The Merchanting segment distributes interior building products, which include drywalls, ceilings, external envelopes, fire protection products, flooring and partitioning products, and tools and accessories to professionals within the construction industry; civil, drainage, and heavy building materials to specialist contractors and trade professionals; and pipeline and heating solutions. This segment also distributes building materials, plumbing and heating products, landscaping materials, timber and sheet materials, painting and decorating products, dry lining and insulation products, doors and joinery, and hand and power tools to trade professionals and self-builders. The Retail segment operates as a home improvement retailer, which sells kitchen, bathroom, paint, and timber products. The Toolstation segment supplies products to the trade, home improvers, and self-builders industry through approximately 350 branches, as well as online, call center, and a mobile website. The Plumbing & Heating segment supplies its products to the trade, home improvement, and DIY markets. The company also offers kitchens and joinery products to specialist joiners, kitchen fitters, house builders, local authorities, and national house builders; and operates as a tile retailer. The company was formerly known as Sandell Perkins Public Limited Company and changed its name to Travis Perkins plc in October 1988. Travis Perkins plc was founded in 1797 and is headquartered in Northampton, the United Kingdom.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Northampton",
        "zipcode": "NN5 7UG",
        "website": "http://www.travisperkinsplc.co.uk",
        "market_cap": "Mid Cap"
    },
    "NTBR.L": {
        "short_name": "NORTHERN BEAR PLC ORD 1P",
        "long_name": "Northern Bear PLC",
        "summary": "Northern Bear PLC, together with its subsidiaries, provides building and support services to local authorities, housing associations, NHS trusts, universities, construction companies, and national house builders in Northern England. It operates through three segments: Roofing Activities, Materials Handling Activities, and Building Services Activities. The company sells, leases, rents, and maintains forklift trucks and warehouse equipment for commercial customers. It also provides roofing contractor services, such as roof slating, tiling, leadwork, felting and general roof repairs, and refurbishment and maintenance services for domestic, commercial, and public sector properties. In addition, the company is involved in the supply and fixing of passive fire protection systems, fire stopping systems, and acoustic insulations; heritage restoration; and the provision of building contractor services, such as planned responsive and reactive maintenance, extensions, and new build and refurbishment works. Further, it offers health and safety consultancy services; HD video and photography of buildings; commercial interior design and fitting services; electrical installation, maintenance, and repair services; and unmanned aerial imagery services, as well as sound insulation services. Northern Bear PLC was incorporated in 2006 and is headquartered in Newcastle upon Tyne, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Newcastle upon Tyne",
        "zipcode": "NE20 9SJ",
        "website": "http://www.northernbearplc.com",
        "market_cap": null
    },
    "NXR.L": {
        "short_name": "NORCROS PLC ORD 10P",
        "long_name": "Norcros plc",
        "summary": "Norcros plc, together with its subsidiaries, engages in the development, manufacture, and marketing of bathroom and kitchen products in the United Kingdom and South Africa. The company manufactures and distributes electric, and mixer showers and accessories under the Triton brand name; shower enclosures and trays to the residential, commercial, and hospitality sectors under the Merlyn brand; taps, mixer showers, bathroom accessories, high end brassware, and valves under the Vado brand name; and accessories and furniture for the bathroom, such as toilet seats, wall-mounted cupboards, vanity units, shower rods, rails, and curtains to retail and trade customers under the Croydex brand name. It also offers kitchen taps, sinks, and instant hot water taps under the Abode brand name; ceramic wall and floor tiles under the Johnson Tiles brand name; and adhesives, grouts, and surface preparation products under the Norcros Adhesives brand name for fixing ceramic and porcelain tiles, mosaics, natural stones, and marbles. In addition, the company provides tile adhesives, pourable floor coverings, and tiling tools for various types of ceramic, porcelain, or natural stone tiles; and various products for the preparation of floors before the installation of hard and soft floor coverings, including primers, additives, patching and repair compounds, and screeds and self-levelling screeds, as well as waterproofing systems under the TAL brand name, as well as specialist plumbing materials under the House of Plumbing brand name. Further, it retails wall and floor tiles, adhesives, showers, sanitaryware, and bathroom fittings under the Tile Africa brand name. The company serves consumers, architects, designers, developers, retailers, and wholesalers. Norcros plc was incorporated in 1999 and is headquartered in Wilmslow, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Wilmslow",
        "zipcode": "SK9 1BU",
        "website": "http://www.norcros.com",
        "market_cap": null
    },
    "SFE.L": {
        "short_name": "SAFESTYLE UK PLC ORD 1P",
        "long_name": "Safestyle UK plc",
        "summary": "Safestyle UK plc designs, manufactures, sells, installs, and maintains windows and doors for the homeowner market in the United Kingdom. The company offers domestic, double-glazed, and replacement PVCu windows and doors. It provides its products through a network of 33 sales branches and 13 installation depots. Safestyle UK plc was founded in 1992 and is headquartered in Bradford, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Bradford",
        "zipcode": "BD1 3AZ",
        "website": "http://www.safestyleukplc.co.uk",
        "market_cap": null
    },
    "TON.L": {
        "short_name": "TITON HOLDINGS PLC ORD 10P",
        "long_name": "Titon Holdings Plc",
        "summary": "Titon Holdings Plc designs, manufactures, and markets ventilation products, and door and window fittings in the United Kingdom, South Korea, North America, and internationally. It offers a range of passive and powered ventilation products for house builders, electrical contractors, window and door manufacturers, and construction companies; and supplies window and door hardware material. The company sells its products through distributors under the Titon brand name. It also exports its products. The company was founded in 1972 and is headquartered in Colchester, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Colchester",
        "zipcode": "CO4 9YQ",
        "website": "http://www.titon.com/uk",
        "market_cap": null
    },
    "TPK.L": {
        "short_name": "TRAVIS PERKINS PLC ORD 1205105",
        "long_name": "Travis Perkins plc",
        "summary": "Travis Perkins plc distributes building materials to the building, construction, and home improvement markets in the United Kingdom. It operates through four segments: Merchanting, Retail, Toolstation, and Plumbing & Heating. The Merchanting segment distributes interior building products, which include drywalls, ceilings, external envelopes, fire protection products, flooring and partitioning products, and tools and accessories to professionals within the construction industry; civil, drainage, and heavy building materials to specialist contractors and trade professionals; and pipeline and heating solutions. This segment also distributes building materials, plumbing and heating products, landscaping materials, timber and sheet materials, painting and decorating products, dry lining and insulation products, doors and joinery, and hand and power tools to trade professionals and self-builders. The Retail segment operates as a home improvement retailer, which sells kitchen, bathroom, paint, and timber products. The Toolstation segment supplies products to the trade, home improvers, and self-builders industry through approximately 350 branches, as well as online, call center, and a mobile website. The Plumbing & Heating segment supplies its products to the trade, home improvement, and DIY markets. The company also offers kitchens and joinery products to specialist joiners, kitchen fitters, house builders, local authorities, and national house builders; and operates as a tile retailer. The company was formerly known as Sandell Perkins Public Limited Company and changed its name to Travis Perkins plc in October 1988. Travis Perkins plc was founded in 1797 and is headquartered in Northampton, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Northampton",
        "zipcode": "NN5 7UG",
        "website": "http://www.travisperkinsplc.co.uk",
        "market_cap": null
    },
    "TPRKY": {
        "short_name": "TRAVIS PERKINS",
        "long_name": "Travis Perkins plc",
        "summary": "Travis Perkins plc distributes building materials to the building, construction, and home improvement markets in the United Kingdom. It operates through four segments: Merchanting, Retail, Toolstation, and Plumbing & Heating. The Merchanting segment distributes interior building products, which include drywalls, ceilings, external envelopes, fire protection products, flooring and partitioning products, and tools and accessories to professionals within the construction industry; civil, drainage, and heavy building materials to specialist contractors and trade professionals; and pipeline and heating solutions. This segment also distributes building materials, plumbing and heating products, landscaping materials, timber and sheet materials, painting and decorating products, dry lining and insulation products, doors and joinery, and hand and power tools to trade professionals and self-builders. The Retail segment operates as a home improvement retailer, which sells kitchen, bathroom, paint, and timber products. The Toolstation segment supplies products to the trade, home improvers, and self-builders industry through approximately 350 branches, as well as online, call center, and a mobile website. The Plumbing & Heating segment supplies its products to the trade, home improvement, and DIY markets. The company also offers kitchens and joinery products to specialist joiners, kitchen fitters, house builders, local authorities, and national house builders; and operates as a tile retailer. The company was formerly known as Sandell Perkins Public Limited Company and changed its name to Travis Perkins plc in October 1988. Travis Perkins plc was founded in 1797 and is headquartered in Northampton, the United Kingdom.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Northampton",
        "zipcode": "NN5 7UG",
        "website": "http://www.travisperkinsplc.co.uk",
        "market_cap": "Mid Cap"
    },
    "TYMN.L": {
        "short_name": "TYMAN PLC ORD 5P",
        "long_name": "Tyman plc",
        "summary": "Tyman plc, together with its subsidiaries, manufactures and supplies engineered fenestration and access solutions to the door and window industry in North America, the United Kingdom, Canada, Ireland, and internationally. It operates through three divisions: AmesburyTruth, ERA, and SchlegelGiesse. The AmesburyTruth division manufactures window and door hardware components, extrusions, and sealing systems. It offers single and multipoint locking systems, decorative handle trim sets, and precision rollers; operators, tie bar/locks, and hinges for casement and awning applications; and locks/keepers, integrated tilt latches, rollers, balance systems, seals, and extruded profiles for hung and sliding window applications. The ERA division engages in the design, development, manufacture, and distribution of mechanical security and decorative hardware products, door closers, weather seals, panic hardware products, and smart security systems for the residential building and home improvement markets under the ERA, Fab & Fix, Giesse, Schlegel, and Zoo brands. This segment is also involved in the sash window renovation business; and offers roof, floor, and wall access products, as well as smoke vents and ladders. The SchlegelGiesse division engages in the sealing and extrusion businesses. This segment provides its products under the Schlegel, Giesse, and Reguitti brands for use in residential and commercial applications. The company was formerly known as Lupus Capital plc and changed its name to Tyman plc in February 2013. Tyman plc was incorporated in 1993 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SW1H 9BU",
        "website": "http://www.tymanplc.com",
        "market_cap": null
    },
    "VO1.F": {
        "short_name": "VOLUTION GROUP  LS -,01",
        "long_name": "Volution Group plc",
        "summary": "Volution Group plc, together with its subsidiaries, manufactures and supplies ventilation products to residential and commercial construction markets in the United Kingdom, Continental Europe, Australasia, and internationally. The company's products include unitary extractor fans for use in bathrooms and kitchens; MVHR and MEV systems; rigid, semi-rigid, and flexible ducting products and accessories; mechanical heat recovery units; air handling units and fan coils; commercial ventilation products; underfloor heating, heated towel rails, radiators, and storage and panel heaters; wall, box, and tower fans, as well as portable air conditioners; hand dryers and insect killers; and sensors, controllers, and ducting products. It also manufactures blowers and motors for the heating and ventilation industry, such as direct and belt-drive fans, fandecks, double inlet centrifugal blowers, motorized impellers, and combustion blowers. The company sells its products principally under the Vent-Axia, Manrose, Diffusion, Airtech, National Ventilation, Breathing Buildings, Torin-Sifan, Fresh, PAX, VoltAir, Kair, Air Connection, inVENTer, Ventilair, Simx, and Ventair brands. Volution Group plc was incorporated in 2014 and is based in Crawley, the United Kingdom.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Crawley",
        "zipcode": "RH10 9YX",
        "website": "http://www.volutiongroupplc.com",
        "market_cap": "Small Cap"
    }
}