{
    "54K.F": {
        "short_name": "ELIXIRR INTL  LS -,00005",
        "long_name": "Elixirr International plc",
        "summary": "Elixirr International plc provides management consultancy services worldwide. The company offers its services for industries, such as financial services, consumer goods, retail, and technology media and telecommunications. Elixirr International plc was founded in 2009 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "5I2.F": {
        "short_name": "GATELEY (HLDGS)  LS -,10",
        "long_name": "Gateley (Holdings) Plc",
        "summary": "Gateley (Holdings) Plc, together with its subsidiaries, provides commercial legal services in the United Kingdom, Europe, the Middle East, North and South America, Asia, and internationally. It operates through five segments: Banking and Financial Services; Corporate; Business Services; Employees, Pensions and Benefits; and Property. The company offers legal services for asset finance, banking, and restructuring services; corporate, family, private client, and taxation services; commercial, commercial dispute resolution, litigation, and shipping services; employment and pension services; and construction, planning, real estate, and residential development services. It also provides trustee, tax incentive, specialist property consultancy, human capital consultancy, investment consultancy, and employee benefit trust services, as well as commercial landlord and tenant, easement disputes, nuisance, restrictive covenants, boundary and title issues, trespass, and beneficial interest claims. The company was formerly known as Gateley Plc and changed its name to Gateley (Holdings) Plc in May 2015. Gateley (Holdings) Plc was incorporated in 2014 and is headquartered in Birmingham, the United Kingdom.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Birmingham"
    },
    "ARGQ": {
        "short_name": "ARGENTUM 47 INC",
        "long_name": "Argentum 47, Inc.",
        "summary": "Argentum 47, Inc. provides corporate advisory services worldwide. It operates through two segments, Consultancy and Insurance Brokerage. The company offers general business consulting and fund administration, as well as exchange listings and quotations on OTC markets quotation boards. It also provides services, such as corporate restructuring, exchange listings and development for corporate marketing, investor and public relations, regulatory compliance, and introductions to financiers. In addition, the company offers computerized investment management services that include advising on investments in unit trusts, investment bonds, shares, investment trusts, government bonds, and individual savings accounts, as well as advices investors on pension contracts that include personal pensions, executive pensions, small self-administered plans, pension mortgages, and others. Further, it provides brokerage services for lump sum or single premium insurance policies and regular premium investment insurance policies. The company was formerly known as Global Equity International, Inc. and changed its name to Argentum 47, Inc. in March 2018. Argentum 47, Inc. was founded in 2009 and is based in Hedon, the United Kingdom.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Hedon"
    },
    "CCAP.L": {
        "short_name": "CONDUITY CAPITAL PLC ORD 1P",
        "long_name": "Conduity Capital Plc",
        "summary": "Conduity Capital Plc provides products and services based on Feng Shui and the associated Emperor Star astrology in Singapore. Its services include building and office design consultancy, astrology readings, marriage matching, aura readings, and business talks and seminars for large corporations. The company also offers tarot cards readings, and an online dating service using Feng Shui principles. It serves businessmen, political figures, business enterprises, and the general public. The company was formerly known as New Trend Lifestyle Group Plc and changed its name to Conduity Capital Plc in October 2020. Conduity Capital Plc was founded in 2005 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "DRV.L": {
        "short_name": "DRIVER GROUP PLC ORD 0.4P",
        "long_name": "Driver Group plc",
        "summary": "Driver Group plc provides consultancy services to the engineering and construction industries worldwide. It operates through three divisions: Europe & Americas, Middle East, and Asia Pacific. The company offers quantity surveying, planning/programming, quantum and planning expert, dispute avoidance/resolution, litigation support, contract administration, commercial advice/management, commercial and contract, delay analysis, pre-contract, project management, building information modelling, and training and seminar services. It serves building, energy, infrastructure, marine, mining, oil and gas, process and industrial, and transportation sectors. The company was founded in 1978 and is based in Haslingden, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Haslingden"
    },
    "DWF.L": {
        "short_name": "DWF GROUP PLC ORD 1P",
        "long_name": "DWF Group plc",
        "summary": "DWF Group plc provides various legal services and complementary connected services in the United Kingdom, the Middle East, Rest of Europe, and internationally. The company operates through four divisions: Commercial Services, Insurance Services, International, and Connected Services. It offers a range of complex legal services and managed services covering areas, such as business restructuring, commercial and competition, tax and private capital, employment, finance, pensions, real estate, debt recovery, asset management, and housing and planning. The company also provides legal services and managed services predominantly to insurers and their insureds covering catastrophic personal injury, occupational health and casualty, motor, fraud, and resolution law, as well as professional indemnity and commercial insurance practice groups. In addition, it offers a digital claims platform and software solutions, as well as services in the areas of specialist lawyers and barristers, forensic accountants, and investigators. The company was incorporated in 2018 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "ELIX.L": {
        "short_name": "ELIXIRR INTERNATIONAL PLC ORD 0",
        "long_name": "Elixirr International plc",
        "summary": "Elixirr International plc provides management consultancy services worldwide. The company offers its services for industries, such as financial services, consumer goods, retail, and technology media and telecommunications. Elixirr International plc was founded in 2009 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "GTLY.L": {
        "short_name": "GATELEY (HOLDINGS) PLC ORD 10P",
        "long_name": "Gateley (Holdings) Plc",
        "summary": "Gateley (Holdings) Plc, together with its subsidiaries, provides commercial legal services in the United Kingdom, Europe, the Middle East, North and South America, Asia, and internationally. It operates through five segments: Banking and Financial Services; Corporate; Business Services; Employees, Pensions and Benefits; and Property. The company offers legal services for asset finance, banking, and restructuring services; corporate, family, private client, and taxation services; commercial, commercial dispute resolution, litigation, and shipping services; employment and pension services; and construction, planning, real estate, and residential development services. It also provides trustee, tax incentive, specialist property consultancy, human capital consultancy, investment consultancy, and employee benefit trust services, as well as commercial landlord and tenant, easement disputes, nuisance, restrictive covenants, boundary and title issues, trespass, and beneficial interest claims. The company was formerly known as Gateley Plc and changed its name to Gateley (Holdings) Plc in May 2015. Gateley (Holdings) Plc was incorporated in 2014 and is headquartered in Birmingham, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Birmingham"
    },
    "IKTSF": {
        "short_name": "INTERTEK GROUP",
        "long_name": "Intertek Group plc",
        "summary": "Intertek Group plc provides quality and safety solutions to various industries worldwide. It operates in three segments: Products, Trade, and Resources. The Products segment offers assurance, testing, inspection, and certification services (ATIC), including laboratory safety, quality and performance testing, second-party supplier auditing, sustainability analysis, products assurance, vendor compliance, process performance analysis, facility plant and equipment verification, and third party certification. This segment serves a range of industries including textiles, footwear, toys, hardlines, home appliances, consumer electronics, information and communication technology, automotive, aerospace, lighting, building products, industrial and renewable energy products, food and hospitality, healthcare and beauty, and pharmaceuticals. The Trade segment provides cargo inspection, analytical assessment, calibration, and related research and technical services to the petroleum and biofuels industries; inspection services to governments and regulatory bodies to support trade activities; and analytical and testing services to agricultural trading companies and growers. The Resources segment offers technical inspection, asset integrity management, analytical testing, and ongoing training services for the oil, gas, nuclear, and power industries. This segment also provides a range of ATIC service solutions to the mining and minerals exploration industries covering the resource supply chain. The company also offers cyber security services. Intertek Group plc was founded in 1885 and is based in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "IKTSY": {
        "short_name": "INTERTEK GROUP",
        "long_name": "Intertek Group plc",
        "summary": "Intertek Group plc provides quality and safety solutions to various industries worldwide. It operates in three segments: Products, Trade, and Resources. The Products segment offers assurance, testing, inspection, and certification services (ATIC), including laboratory safety, quality and performance testing, second-party supplier auditing, sustainability analysis, products assurance, vendor compliance, process performance analysis, facility plant and equipment verification, and third party certification. This segment serves a range of industries including textiles, footwear, toys, hardlines, home appliances, consumer electronics, information and communication technology, automotive, aerospace, lighting, building products, industrial and renewable energy products, food and hospitality, healthcare and beauty, and pharmaceuticals. The Trade segment provides cargo inspection, analytical assessment, calibration, and related research and technical services to the petroleum and biofuels industries; inspection services to governments and regulatory bodies to support trade activities; and analytical and testing services to agricultural trading companies and growers. The Resources segment offers technical inspection, asset integrity management, analytical testing, and ongoing training services for the oil, gas, nuclear, and power industries. This segment also provides a range of ATIC service solutions to the mining and minerals exploration industries covering the resource supply chain. The company also offers cyber security services. Intertek Group plc was founded in 1885 and is based in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "INCE.L": {
        "short_name": "INCE GROUP PLC (THE) ORD 1P",
        "long_name": "The Ince Group plc",
        "summary": "The Ince Group plc provides legal and professional services to businesses and high net worth individuals in the United Kingdom, Europe, the Middle East, Africa, and Asia. The company provides law practices; corporate tax consultancy to the oil and gas industry; technology solutions for the legal and professional services market; accounting, financial, consulting, and management services; and investment advice and ongoing investment management services. It also acts as consulting actuaries, employee benefit advisers, pension scheme administrators, general practice solicitors, and a conveyancing firm. The company was formerly known as Gordon Dadds Group plc and changed its name to The Ince Group plc in August 2019. The Ince Group plc is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "INFO": {
        "short_name": "IHS Markit Ltd.",
        "long_name": "IHS Markit Ltd.",
        "summary": "IHS Markit Ltd. provides critical information, analytics, and solutions for various industries and markets worldwide. The company's information, analytics, and solutions enhance operational efficiency and offer deep insights for customers in business, finance, and government. Its Financial Services segment offers pricing and reference data, indices, valuation and trading services, trade processing, enterprise software, and managed services to traders, portfolio managers, risk managers, research professionals, and other financial market participants, as well as operations, compliance, and enterprise data managers. The company's Transportation segment provides authoritative analysis; sales and production forecasts for light vehicles, medium and heavy commercial vehicles, powertrains, components, and technology systems; performance measurement and marketing tools for carmakers, dealers, and agencies; predictive analytics and marketing automation software; and critical information for used car dealers and their customers in the used car buying process. It also offers comprehensive data on ships, and monthly import and export statistics. The company's Resources segment provides upstream services, including technical information, analytical tools, and market forecasting and consulting for the upstream industry; and downstream information, such as market forecasting, midstream market analysis and supply chain data, refining and marketing economics, and oil product pricing information for the chemical, refined products, agriculture, and power industries. The company's Consolidated Markets & Solutions segment provides discovery technologies, research tools, and software-based engineering decision engines; economic and risk data and analytics, forecasts, and scenario tools; and performance and cost benchmarking analysis for technology, media, and telecom industry. IHS Markit Ltd. was founded in 1959 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "ITRK.L": {
        "short_name": "INTERTEK GROUP PLC ORD 1P",
        "long_name": "Intertek Group plc",
        "summary": "Intertek Group plc provides quality and safety solutions to various industries worldwide. It operates in three segments: Products, Trade, and Resources. The Products segment offers assurance, testing, inspection, and certification services (ATIC), including laboratory safety, quality and performance testing, second-party supplier auditing, sustainability analysis, products assurance, vendor compliance, process performance analysis, facility plant and equipment verification, and third party certification. This segment serves a range of industries including textiles, footwear, toys, hardlines, home appliances, consumer electronics, information and communication technology, automotive, aerospace, lighting, building products, industrial and renewable energy products, food and hospitality, healthcare and beauty, and pharmaceuticals. The Trade segment provides cargo inspection, analytical assessment, calibration, and related research and technical services to the petroleum and biofuels industries; inspection services to governments and regulatory bodies to support trade activities; and analytical and testing services to agricultural trading companies and growers. The Resources segment offers technical inspection, asset integrity management, analytical testing, and ongoing training services for the oil, gas, nuclear, and power industries. This segment also provides a range of ATIC service solutions to the mining and minerals exploration industries covering the resource supply chain. The company also offers cyber security services. Intertek Group plc was founded in 1885 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "MANO.L": {
        "short_name": "MANOLETE PARTNERS PLC ORD 0.4P",
        "long_name": "Manolete Partners Plc",
        "summary": "Manolete Partners Plc operates as an insolvency litigation financing company in the United Kingdom. It focuses on acquiring or funding insolvency litigation cases. The company was founded in 2009 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "RCDO.L": {
        "short_name": "RICARDO PLC ORD 25P",
        "long_name": "Ricardo plc",
        "summary": "Ricardo plc provides engineering, technical, environmental, and strategic consultancy services for transportation original equipment manufacturers and operators, suppliers, energy companies, and government agencies. It operates through Energy & Environment (EE), Rail, Automotive and Industrial (A&I), Defense, Performance Products (PP, and Other segments. The EE segment provides industry-leading analysis, advice, and data to governments, public agencies, and businesses. The Rail segment offers technical advice and engineering services, and accredited assurance services. The A&I segment engages in the provision of clean, efficient, integrated propulsion, and energy solutions in area of hybrid and electric systems, electrification, engines, driveline and transmissions, testing, and vehicle engineering for automotive, aerospace, defense, energy, off-highway and commercial, marine, motorcycle and light-personal transport, and rail. The Defense segment focuses on the delivery of services, software, and products that protect life and reduce defense programme costs and waste, as well as offers various engineering programmes; and anti-lock braking system/electronic stability control systems. The PP segment manufactures and assembles niche high-quality components, prototypes, and complex products, including engines, transmissions, and other precision and performance-critical products; and provides manufacturing and supply-chain services for motorsport, automotive, aerospace, defense, and rail. The Other segment offers management consultancy services for automotive, transportation, and mobility industries. It operates in the United Kingdom, Europe, North America, China, Australia, rest of Asia, and internationally. Ricardo plc was founded in 1915 and is headquartered in Shoreham-by-Sea, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Shoreham-by-Sea"
    },
    "RG8.F": {
        "short_name": "RPS GRP PLC  LS-,03",
        "long_name": "RPS Group plc",
        "summary": "RPS Group plc, a professional services firm, provides consultancy services for the environment. The company offers project and program management; design and development; water services; exploration and development; environment; advisory and management consulting; planning and approvals; health, safety and risk; oceans and coastal; laboratories; training; and communications, creative and digital services. It provides its services to property, energy, transport, water, resources, and defense and government service sectors. The company operates primarily in the United Kingdom, Australia, the United States, Norway, Netherlands, Ireland, Canada, and internationally. RPS Group plc was founded in 1970 and is headquartered in Abingdon, the United Kingdom.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Abingdon"
    },
    "RIR.F": {
        "short_name": "RICARDO PLC  LS-,25",
        "long_name": "Ricardo plc",
        "summary": "Ricardo plc provides engineering, technical, environmental, and strategic consultancy services for transportation original equipment manufacturers and operators, suppliers, energy companies, and government agencies. It operates through Energy & Environment (EE), Rail, Automotive and Industrial (A&I), Defense, Performance Products (PP, and Other segments. The EE segment provides industry-leading analysis, advice, and data to governments, public agencies, and businesses. The Rail segment offers technical advice and engineering services, and accredited assurance services. The A&I segment engages in the provision of clean, efficient, integrated propulsion, and energy solutions in area of hybrid and electric systems, electrification, engines, driveline and transmissions, testing, and vehicle engineering for automotive, aerospace, defense, energy, off-highway and commercial, marine, motorcycle and light-personal transport, and rail. The Defense segment focuses on the delivery of services, software, and products that protect life and reduce defense programme costs and waste, as well as offers various engineering programmes; and anti-lock braking system/electronic stability control systems. The PP segment manufactures and assembles niche high-quality components, prototypes, and complex products, including engines, transmissions, and other precision and performance-critical products; and provides manufacturing and supply-chain services for motorsport, automotive, aerospace, defense, and rail. The Other segment offers management consultancy services for automotive, transportation, and mobility industries. It operates in the United Kingdom, Europe, North America, China, Australia, rest of Asia, and internationally. Ricardo plc was founded in 1915 and is headquartered in Shoreham-by-Sea, the United Kingdom.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Shoreham-by-Sea"
    },
    "RPS.L": {
        "short_name": "RPS GROUP PLC ORD 3P",
        "long_name": "RPS Group plc",
        "summary": "RPS Group plc, a professional services firm, provides consultancy services for the environment. The company offers project and program management; design and development; water services; exploration and development; environment; advisory and management consulting; planning and approvals; health, safety and risk; oceans and coastal; laboratories; training; and communications, creative and digital services. It provides its services to property, energy, transport, water, resources, and defense and government service sectors. The company operates primarily in the United Kingdom, Australia, the United States, Norway, Netherlands, Ireland, Canada, and internationally. RPS Group plc was founded in 1970 and is headquartered in Abingdon, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Abingdon"
    },
    "RWJ1.SG": {
        "short_name": "RWS Holdings PLC Registered Sha",
        "long_name": "RWS Holdings plc",
        "summary": "RWS Holdings plc engages in the translation, intellectual property (IP) support, life sciences language, and localization businesses. The company operates through IP Services, Life Sciences, and Moravia segments. The IP Services segment provides patent translation and filing solutions, as well as IP search services. The Life Sciences segment offers a full suite of language services, including language solutions for clinical trial management; linguistic validation of clinical outcomes assessments; and regulatory affairs expertise, medical device documentation, and marketing and communications services, as well as e-learning and training programs for the life sciences industry. The Moravia segment provide localized products and content to consumers. It serves automotive, energy, retail and e-commerce, legal, travel and hospitality, banking and finance, industrial and manufacturing, life sciences, technology, chemical, media and entertainment, and telecommunication sectors. The company primarily operates in the United Kingdom, the United States, Continental Europe, China, Japan, India, Thailand, Argentina, Australia, Columbia, and Canada. RWS Holdings plc was founded in 1958 and is headquartered in Chalfont St Peter, the United Kingdom.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Chalfont St Peter"
    },
    "RWS.L": {
        "short_name": "RWS HOLDINGS PLC ORD 1P",
        "long_name": "RWS Holdings plc",
        "summary": "RWS Holdings plc engages in the translation, intellectual property (IP) support, life sciences language, and localization businesses. The company operates through IP Services, Life Sciences, and Moravia segments. The IP Services segment provides patent translation and filing solutions, as well as IP search services. The Life Sciences segment offers a full suite of language services, including language solutions for clinical trial management; linguistic validation of clinical outcomes assessments; and regulatory affairs expertise, medical device documentation, and marketing and communications services, as well as e-learning and training programs for the life sciences industry. The Moravia segment provide localized products and content to consumers. It serves automotive, energy, retail and e-commerce, legal, travel and hospitality, banking and finance, industrial and manufacturing, life sciences, technology, chemical, media and entertainment, and telecommunication sectors. The company primarily operates in the United Kingdom, the United States, Continental Europe, China, Japan, India, Thailand, Argentina, Australia, Columbia, and Canada. RWS Holdings plc was founded in 1958 and is headquartered in Chalfont St Peter, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Chalfont St Peter"
    },
    "SBIZ.L": {
        "short_name": "THE SIMPLYBIZ GROUP PLC ORD GBP",
        "long_name": "The SimplyBiz Group plc",
        "summary": "The SimplyBiz Group plc provides regulatory, business support, and software services to professional financial advisers, financial intermediaries, and product providers operating within the retail financial services market in the United Kingdom. It operates in three segments: Intermediary Services, Distribution Channels, and Research & FinTech. The Intermediary Services segment offers compliance and regulation services to individual financial intermediary member firms, including directly authorized IFAs, directly authorized mortgage advisers, workplace consultants, and directly authorized consumer credit brokers, as well as employee benefit and additional support services. The Distribution Channels segment provides marketing and promotion, product paneling, and co-manufacturing services to financial institutions, as well as offers survey paneling and surveying works for mortgage lenders; investment products; and insurance panels and transaction services. The Research & FinTech segment operates a FinTech platform for approximately 9,000 users, across 3,300 firms, and provides independent ratings of 21,000 financial products and funds, licensed by 250 brands; data services for intermediaries and product providers; financial planning and research software; educational content to inform decision making; and market insight and analytics services. The company was founded in 2002 and is based in Huddersfield, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Huddersfield"
    }
}