{
    "1JS.F": {
        "short_name": "SHIELD THERAPEUT. LS-,015",
        "long_name": "Shield Therapeutics plc",
        "summary": "Shield Therapeutics plc, a specialty pharmaceutical company, engages in the development and commercialization of late-stage pharmaceuticals to treat unmet medical needs. The company's lead product is Ferric Maltol, marketed in the European Union as Feraccru, a non-salt based novel therapy for the treatment of iron deficiency anemia in patients with inflammatory bowel disease. Its advanced pipeline asset is PT20, a novel therapy that has completed its Phase II pivotal study for the treatment of hyperphosphatemia in patients with chronic kidney disease. The company also develops PT30 to treat hypo-allergenic IV iron therapy; and PT40, the first generic version of iron sucrose. Shield Therapeutics plc was founded in 2008 and is based in Gateshead, the United Kingdom.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Gateshead"
    },
    "4UU.F": {
        "short_name": "DIURNAL GROUP PLC LS -,05",
        "long_name": "Diurnal Group plc",
        "summary": "Diurnal Group plc operates as a specialty pharma company worldwide. The company develops hormone therapeutics for the treatment of chronic endocrine conditions, including congenital adrenal hyperplasia, adrenal insufficiency, hypogonadism, and hypothyroidism. The company offers Alkindi, a replacement therapy for paediatric adrenal insufficiency in Europe. It also develops Chronocort, which completed Phase III clinical trials targeting congenital adrenal hyperplasia and adrenal insufficiency. The company's early stage pipeline products comprise Native Oral Testosterone, a replacement treatment for patients suffering from hypogonadism; siRNA, a short interfering RNA oligonucleotide therapy for patients suffering from adrenocorticotropin-dependent Cushing's syndrome; and T3 modified, a modified-release preparation of T3 (levothyroxine) hormone for patients suffering from hypothyroidism. Diurnal Group plc was incorporated in 2015 and is headquartered in Cardiff, the United Kingdom.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Cardiff"
    },
    "7HR.F": {
        "short_name": "ZOETIC INT. PLC  LS-,01",
        "long_name": "Zoetic International Plc",
        "summary": "Zoetic International Plc, a vertically integrated CBD company, researches, develops, produces, and sells cannabidiol (CBD) consumer products and other hemp derivatives in the United States and the United Kingdom. The company offers oral CBD tinctures and CBD gummies, as well as softgel, massage oil, and skincare products. Its CBD products are used for pharmaceutical and tobacco replacement applications. The company was formerly known as Highlands Natural Resources plc and changed its name to Zoetic International Plc in September 2019. Zoetic International Plc was founded in 2014 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "ABTI": {
        "short_name": "ALTEROLA BIOTECH INC",
        "long_name": "Alterola Biotech, Inc.",
        "summary": "Alterola Biotech, Inc., together with its subsidiaries, focus on the development of cannabinoid, cannabinoid-like, non-cannabinoid pharmaceutical active pharmaceutical ingredients (APIs), and pharmaceutical medicines made from cannabinoid in United Kingdom and worldwide. The company focuses on developing food-grade ingredients, regulated pharmaceuticals, and regulated food products. In addition, it focuses on the development of bulk ingredients for supply into the cosmetic sector. The company was formerly known as Jedediah Resources Corp. and changed its name to Alterola Biotech, Inc. in July 2010. Alterola Biotech, Inc. was incorporated in 2008 and is based in Birkenhead, the United Kingdom.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Birkenhead"
    },
    "AGY.L": {
        "short_name": "ALLERGY THERAPEUTICS PLC ORD 0.",
        "long_name": "Allergy Therapeutics plc",
        "summary": "Allergy Therapeutics plc engages in the research and development of allergy treatments. The company sells injectable and sublingual allergen-specific immunotherapies; and offers prescription for the treatment of pollen-related allergies, particularly to grasses, weeds, and trees, as well as diagnostics. Its products include Pollinex, Pollinex Quattro, Oralvac, Acarovac Plus, Acarovac MPL, Venomil, Synbiotics, Penicillin Diagnostics, and Peanut. The company also develops allergy vaccines for grass, tree, and house dust mite, as well as peanut allergy vaccines. It operates in Central Europe, Southern Europe, the United Kingdom, and internationally. Allergy Therapeutics plc was incorporated in 2004 and is headquartered in Worthing, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Worthing"
    },
    "AGYTF": {
        "short_name": "ALLERGY THERAPEUTICS",
        "long_name": "Allergy Therapeutics plc",
        "summary": "Allergy Therapeutics plc engages in the research and development of allergy treatments. The company sells injectable and sublingual allergen-specific immunotherapies; and offers prescription for the treatment of pollen-related allergies, particularly to grasses, weeds, and trees, as well as diagnostics. Its products include Pollinex, Pollinex Quattro, Oralvac, Acarovac Plus, Acarovac MPL, Venomil, Synbiotics, Penicillin Diagnostics, and Peanut. The company also develops allergy vaccines for grass, tree, and house dust mite, as well as peanut allergy vaccines. It operates in Central Europe, Southern Europe, the United Kingdom, and internationally. Allergy Therapeutics plc was incorporated in 2004 and is headquartered in Worthing, the United Kingdom.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Worthing"
    },
    "APH.L": {
        "short_name": "ALLIANCE PHARMA PLC ORD 1P",
        "long_name": "Alliance Pharma plc",
        "summary": "Alliance Pharma plc operates as a pharmaceutical company in the United Kingdom, Republic of Ireland, Mainland Europe, the United States, and internationally. The company acquires, markets, and distributes consumer healthcare and prescription medicine products. It owns or licenses the rights to approximately 80 pharmaceutical and consumer healthcare products. The company also offers medical devices, food supplements, and cosmetics. In addition, the company provides its products under the Kelo-Cote, Nizoral, MacuShield, Vamousse, Flamma Franchise, Aloclair, Hydromol, Forceval, Optiflo, Oxyplastine, Ashton & Parsons, and Ametop brand names. Alliance Pharma plc was founded in 1996 and is headquartered in Chippenham, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Chippenham"
    },
    "BMK.L": {
        "short_name": "BENCHMARK HOLDINGS PLC ORD 0.1P",
        "long_name": "Benchmark Holdings plc",
        "summary": "Benchmark Holdings plc, together with its subsidiaries, provides technical services, products, and specialist knowledge that support the development of food and farming industries worldwide. The company operates through Genetics, Advanced Nutrition, and Health segments. The Genetics segment offers salmon breeding technologies and production facilities to the harnesses industry to provide a range of genetic merit ova. The Advanced Nutrition segment manufactures and offers nutrition and health products to the aquaculture industry. The Health segment provides health products to aquaculture market. Benchmark Holdings plc was founded in 2000 and is based in Sheffield, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Sheffield"
    },
    "CXRXF": {
        "short_name": "ADVANZ PHARMA CORP LTD (JY)",
        "long_name": "ADVANZ PHARMA Corp. Limited",
        "summary": "ADVANZ PHARMA Corp. Limited, a pharmaceutical company, through its subsidiaries, owns or licenses a portfolio of branded and generic prescription products worldwide. The company operates through two segments: ADVANZ PHARMA International and ADVANZ PHARMA North America. Its ADVANZ PHARMA International segment offers a portfolio of branded and generic prescription products to wholesalers, distributors, hospitals, and pharmacies. This segment's products include Brinavess for the conversion of onset atrial fibrillation to sinus rhythm in adults; Aggrastat, a reversible GP IIb/IIIa inhibitor indicated for use in patients with acute coronary syndrome; Xydalba, a semi-synthetic lipoglycopeptide for the treatment of acute bacterial skin and skin structure infections in adults; and Zevtera/Mabelio, a cephalosporin antibiotic for the treatment of community-acquired and hospital-acquired pneumonia. The company's ADVANZ PHARMA North America segment provides Donnatal for the treatment of irritable bowel syndrome; Zonegran for the treatment of partial seizures in adults with epilepsy; Nilandron for the treatment of metastatic prostate cancer; Lanoxin for the treatment of mild to moderate heart failure and atrial fibrillation; Plaquenil for the treatment of lupus and rheumatoid arthritis; and Photofrin for the treatment of certain types of cancer. It also offers Prostaglandin E1 formulations for the treatment of erectile dysfunction and peripheral arterial occlusive disease under the Prostavasin, Viridal, Vasaprostan, and Edex brands, as well as holds licensed commercialization rights to a pre-registration drug/device combination product, Trevyent for the treatment of pulmonary arterial hypertension. It sells its products through direct sales and local distribution relationships. The company was formerly known as ADVANZ PHARMA Corp. and changed its name to ADVANZ PHARMA Corp. Limited in December 2019. ADVANZ PHARMA Corp. Limited is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "DNL.L": {
        "short_name": "DIURNAL GROUP PLC ORD GBP0.05",
        "long_name": "Diurnal Group plc",
        "summary": "Diurnal Group plc operates as a specialty pharma company worldwide. The company develops hormone therapeutics for the treatment of chronic endocrine conditions, including congenital adrenal hyperplasia, adrenal insufficiency, hypogonadism, and hypothyroidism. The company offers Alkindi, a replacement therapy for paediatric adrenal insufficiency in Europe. It also develops Chronocort, which completed Phase III clinical trials targeting congenital adrenal hyperplasia and adrenal insufficiency. The company's early stage pipeline products comprise Native Oral Testosterone, a replacement treatment for patients suffering from hypogonadism; siRNA, a short interfering RNA oligonucleotide therapy for patients suffering from adrenocorticotropin-dependent Cushing's syndrome; and T3 modified, a modified-release preparation of T3 (levothyroxine) hormone for patients suffering from hypothyroidism. Diurnal Group plc was incorporated in 2015 and is headquartered in Cardiff, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Cardiff"
    },
    "DVL.F": {
        "short_name": "ALLIANCE PHARMA  LS-,01",
        "long_name": "Alliance Pharma plc",
        "summary": "Alliance Pharma plc operates as a pharmaceutical company in the United Kingdom, Republic of Ireland, Mainland Europe, the United States, and internationally. The company acquires, markets, and distributes consumer healthcare and prescription medicine products. It owns or licenses the rights to approximately 80 pharmaceutical and consumer healthcare products. The company also offers medical devices, food supplements, and cosmetics. In addition, the company provides its products under the Kelo-Cote, Nizoral, MacuShield, Vamousse, Flamma Franchise, Aloclair, Hydromol, Forceval, Optiflo, Oxyplastine, Ashton & Parsons, and Ametop brand names. Alliance Pharma plc was founded in 1996 and is headquartered in Chippenham, the United Kingdom.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Chippenham"
    },
    "EAH.L": {
        "short_name": "ECO ANIMAL HEALTH GROUP PLC ORD",
        "long_name": "ECO Animal Health Group plc",
        "summary": "ECO Animal Health Group plc, together with its subsidiaries, develops and markets pharmaceutical products for animals worldwide. The company offers Aivlosin, a macrolide antibiotic for the treatment of respiratory and enteric diseases in pigs and poultry. It also provides generic drugs, such as Ecomectin, Ecoheart, Ecotraz, and Ecomintic, which are endectocides and other antiparasitics for the treatment and prevention of parasites in cattle, sheep, pigs, horses, and dogs; and Chlortetracycline and Oxytetracycline for treatment of bacterial infections in pigs, poultry, and cattle. The company was founded in 1972 and is headquartered in New Malden, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "New Malden"
    },
    "H5P.F": {
        "short_name": "HIKMA PHARMACEUTIC.LS-,10",
        "long_name": "Hikma Pharmaceuticals PLC",
        "summary": "Hikma Pharmaceuticals PLC develops, manufactures, and markets a range of generic, branded, and in-licensed pharmaceutical products. The company offers its products in solid, semi-solid, liquid, and injectable final dosage forms. It operates through three segments: Injectables, Generics, and Branded. The Injectables segment develops, manufactures, and sells generic injectable products primarily for use in hospitals. The Generics segment develops, manufactures, and sells oral and other non-injectable generic products for the retail market. The Branded segment develops, manufactures, markets, and sells branded generics and in-licensed products to retail and hospital markets. The company offers its products in various therapeutic areas, including anti-infective, cardiovascular, central nervous system, diabetes, oncology, pain management, anesthetic, sedative, and respiratory. It operates in the United Kingdom, the United States, the Middle East, North Africa, Europe, and internationally. The company was founded in 1978 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "HIK.L": {
        "short_name": "HIKMA PHARMACEUTICALS PLC ORD S",
        "long_name": "Hikma Pharmaceuticals PLC",
        "summary": "Hikma Pharmaceuticals PLC develops, manufactures, and markets a range of generic, branded, and in-licensed pharmaceutical products. The company offers its products in solid, semi-solid, liquid, and injectable final dosage forms. It operates through three segments: Injectables, Generics, and Branded. The Injectables segment develops, manufactures, and sells generic injectable products primarily for use in hospitals. The Generics segment develops, manufactures, and sells oral and other non-injectable generic products for the retail market. The Branded segment develops, manufactures, markets, and sells branded generics and in-licensed products to retail and hospital markets. The company offers its products in various therapeutic areas, including anti-infective, cardiovascular, central nervous system, diabetes, oncology, pain management, anesthetic, sedative, and respiratory. It operates in the United Kingdom, the United States, the Middle East, North Africa, Europe, and internationally. The company was founded in 1978 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "HKMPF": {
        "short_name": "HIKMA PHARMACEUTICALS",
        "long_name": "Hikma Pharmaceuticals PLC",
        "summary": "Hikma Pharmaceuticals PLC develops, manufactures, and markets a range of generic, branded, and in-licensed pharmaceutical products. The company offers its products in solid, semi-solid, liquid, and injectable final dosage forms. It operates through three segments: Injectables, Generics, and Branded. The Injectables segment develops, manufactures, and sells generic injectable products primarily for use in hospitals. The Generics segment develops, manufactures, and sells oral and other non-injectable generic products for the retail market. The Branded segment develops, manufactures, markets, and sells branded generics and in-licensed products to retail and hospital markets. The company offers its products in various therapeutic areas, including anti-infective, cardiovascular, central nervous system, diabetes, oncology, pain management, anesthetic, sedative, and respiratory. It operates in the United Kingdom, the United States, the Middle East, North Africa, Europe, and internationally. The company was founded in 1978 and is based in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "HKMPY": {
        "short_name": "HIKMA PHARMACEUTICALS",
        "long_name": "Hikma Pharmaceuticals PLC",
        "summary": "Hikma Pharmaceuticals PLC develops, manufactures, and markets a range of generic, branded, and in-licensed pharmaceutical products. The company offers its products in solid, semi-solid, liquid, and injectable final dosage forms. It operates through three segments: Injectables, Generics, and Branded. The Injectables segment develops, manufactures, and sells generic injectable products primarily for use in hospitals. The Generics segment develops, manufactures, and sells oral and other non-injectable generic products for the retail market. The Branded segment develops, manufactures, markets, and sells branded generics and in-licensed products to retail and hospital markets. The company offers its products in various therapeutic areas, including anti-infective, cardiovascular, central nervous system, diabetes, oncology, pain management, anesthetic, sedative, and respiratory. It operates in the United Kingdom, the United States, the Middle East, North Africa, Europe, and internationally. The company was founded in 1978 and is based in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "LRSV": {
        "short_name": "LINK RESERVATIONS INC",
        "long_name": "Link Reservations Inc.",
        "summary": "Link Reservations Inc., through its subsidiary, produces cannabidiol-based (CBD) products primarily for pets in Europe and the United States. It develops and markets hemp-based CBD products for cats, dogs, and horses. The company was formerly known as Vendum Batteries, Inc. and changed its name to Link Reservations Inc. in May 2015. Link Reservations Inc. was incorporated in 2006 and is based in Kington, the United Kingdom.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Kington"
    },
    "N4P.L": {
        "short_name": "N4 PHARMA PLC ORD 0.4P",
        "long_name": "N4 Pharma Plc",
        "summary": "N4 Pharma Plc, a specialist pharmaceutical company, develops novel silica nanoparticle delivery system for pharmaceutical and biotechnology companies in the United Kingdom. It develops Nuvec, a non-viral adjuvant delivery system for vaccines and cancer treatments. The company has a research collaboration with Nanomerics Limited to focus on the different formulations of Nuvec delivery system. N4 Pharma Plc was incorporated in 1979 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "NZCA.F": {
        "short_name": "PROVEXIS PLC  LS-,001",
        "long_name": "Provexis plc",
        "summary": "Provexis plc, together with its subsidiaries, develops, licenses, and markets functional foods, medical foods, and dietary supplements worldwide. Its products include Fruitflow, a tomato extract that reduces the propensity for aberrant blood clotting typically associated with cardiovascular diseases, such as heart attack and stroke. The company's syrup and powder versions of Fruitflow are used in foods, beverages, and dietary supplement formats. It also offers Fruitflow + Omega-3, a supplement in capsule form that supports healthy blood flow and normal heart function. Provexis plc has a collaboration agreement with By-Health Co., Ltd. The company offers its products through retail stores, as well as online. Provexis plc was founded in 1999 and is based in Reading, the United Kingdom.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Reading"
    },
    "PXS.L": {
        "short_name": "PROVEXIS PLC ORD 0.1P",
        "long_name": "Provexis plc",
        "summary": "Provexis plc, together with its subsidiaries, develops, licenses, and markets functional foods, medical foods, and dietary supplements worldwide. Its products include Fruitflow, a tomato extract that reduces the propensity for aberrant blood clotting typically associated with cardiovascular diseases, such as heart attack and stroke. The company's syrup and powder versions of Fruitflow are used in foods, beverages, and dietary supplement formats. It also offers Fruitflow + Omega-3, a supplement in capsule form that supports healthy blood flow and normal heart function. Provexis plc has a collaboration agreement with By-Health Co., Ltd. The company offers its products through retail stores, as well as online. Provexis plc was founded in 1999 and is based in Reading, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Reading"
    },
    "RAP.SW": {
        "short_name": "Rapid Nutrition N",
        "long_name": "Rapid Nutrition PLC",
        "summary": "Rapid Nutrition PLC, a natural healthcare company, researches, develops, and produces a range of life science products. The company offers meal replacement shakes, energy boosting tablets, weight loss tablets, and appetite suppressant powders under the Leisa's Secret brand; and high protein shakes, high fiber bars, organic multivitamins, fat burning shots, and grain granola cereals under the SystemLS brand. It primarily exports its products in Asia, Europe, Africa, the Middle East, North America, and Australia. The company was incorporated in 2001 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "RPNRF": {
        "short_name": "RAPID NUTRITION PLC",
        "long_name": "Rapid Nutrition PLC",
        "summary": "Rapid Nutrition PLC, a natural healthcare company, researches, develops, and produces a range of life science products. The company offers meal replacement shakes, energy boosting tablets, weight loss tablets, and appetite suppressant powders under the Leisa's Secret brand; and high protein shakes, high fiber bars, organic multivitamins, fat burning shots, and grain granola cereals under the SystemLS brand. It primarily exports its products in Asia, Europe, Africa, the Middle East, North America, and Australia. The company was incorporated in 2001 and is based in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "SFLM": {
        "short_name": "SFLMAVEN CORP",
        "long_name": "SFLMaven, Inc.",
        "summary": "DNA Dynamics, Inc., through its subsidiaries, develops mobile applications and games for smartphones and tablet devices. It develops and publishes games for Apple iPhone/iPad/iPod touch and Android platforms; and develops video games and applications for mobile devices and handheld consoles. The company develops games across seven platforms, including titles for TV brands and intellectual property holders. DNA Dynamics, Inc. was incorporated in 1981 and is headquartered in Leamington Spa, United Kingdom.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Leamington Spa"
    },
    "SHIEF": {
        "short_name": "SHIELD THERAPEUTICS PLC",
        "long_name": "Shield Therapeutics plc",
        "summary": "Shield Therapeutics plc, a specialty pharmaceutical company, engages in the development and commercialization of late-stage pharmaceuticals to treat unmet medical needs. The company's lead product is Ferric Maltol, marketed in the European Union as Feraccru, a non-salt based novel therapy for the treatment of iron deficiency anemia in patients with inflammatory bowel disease. Its advanced pipeline asset is PT20, a novel therapy that has completed its Phase II pivotal study for the treatment of hyperphosphatemia in patients with chronic kidney disease. The company also develops PT30 to treat hypo-allergenic IV iron therapy; and PT40, the first generic version of iron sucrose. Shield Therapeutics plc was founded in 2008 and is based in Gateshead, the United Kingdom.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Gateshead"
    },
    "STX.L": {
        "short_name": "SHIELD THERAPEUTICS PLC ORD 1.5",
        "long_name": "Shield Therapeutics plc",
        "summary": "Shield Therapeutics plc, a specialty pharmaceutical company, engages in the development and commercialization of late-stage pharmaceuticals to treat unmet medical needs. The company's lead product is Ferric Maltol, marketed in the European Union as Feraccru, a non-salt based novel therapy for the treatment of iron deficiency anemia in patients with inflammatory bowel disease. Its advanced pipeline asset is PT20, a novel therapy that has completed its Phase II pivotal study for the treatment of hyperphosphatemia in patients with chronic kidney disease. The company also develops PT30 to treat hypo-allergenic IV iron therapy; and PT40, the first generic version of iron sucrose. Shield Therapeutics plc was founded in 2008 and is based in Gateshead, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Gateshead"
    },
    "VLG.L": {
        "short_name": "VENTURE LIFE GROUP PLC ORD 0.3P",
        "long_name": "Venture Life Group plc",
        "summary": "Venture Life Group plc develops and commercializes oral care products, food supplements, medical devices, dermo-cosmetics, and topical products for the ageing population in the United Kingdom, Netherlands, China, Germany, Italy, Switzerland, rest of Europe, and internationally. It operates through Venture Life Brands and Customer Brands segments. The company offers neurology products, including NeuroAge, NeuroAge Sleep, and NeuroAge NRG food supplements to enhance mental alertness, cognitive function, and mental performance in ageing brain; and Original Bioscalin to treat and prevent hair loss, hair thinning, and baldness. It also provides Fungal Nail Solution, which helps to treat and prevent fungal infections; and Fungal Nail Cleanser for the hygiene of hands and feet prone to fungal nail infections under the Myco Clear brand name. In addition, the company offers UltraDEX Original and UltraDEX Sensitive for bad breath; Dently Dual Action, a mouthwash, which lifts and removes plaque and bacteria from the teeth and mouth; and Procto-eze for anal irritation, including haemorrhoids condition. Further, it provides women healthcare products comprising vonalei bacterial vaginosis, a refreshing gel; vonalei Vaginal Atrophy, a vaginal cream; vonalei candidiasis, a soothing cream-gel for thrush; and vonalei intimate cleansing foam. Additionally, it offers Cleansing Foam, Cleansing Cream, and Serum under the Rosa calma brand name; and skincare ranges to hydrate, nourish, and recondition the skin, as well as to prevent the lines and wrinkles under the Lubatti Classic and the Lubatti Anti-age brand names. The company sells its products through a network of international partners, retail pharmacies, as well as grocery multiple retailers. Venture Life Group plc was incorporated in 2005 and is headquartered in Bracknell, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Bracknell"
    },
    "WRHLF": {
        "short_name": "LOVE HEMP GROUP PLC",
        "long_name": "Love Hemp Group Plc",
        "summary": "Love Hemp Group Plc formerly known as World High Life Limited, is a private equity and venture capital firm specializing in acquisition, early stage and mature companies. It may invest as debt or equity, in either quoted or unquoted securities, and made by direct acquisition of an interest in companies, partnerships or joint ventures, or direct interests in projects, or by way of licensing arrangements. It typically invests in companies operating in the Cannabidiol (CBD) wellness and medicinal cannabis, hemp including the industrial hemp with focus on therapeutic cannabis derivatives including nutraceuticals, dietary supplements and cosmetic products. The firm also seeks to invest in the cultivation of cannabis and hemp, the manufacture and distribution of medicinal cannabis, hemp and CBD products, pharmacology commercialization of medicinal cannabis, hemp and CBD, professional prescription by practitioners and after care as it relates to medicinal cannabis, statistical management, laboratory testing and compliance in respect of medicinal cannabis, hemp and CBD sectors, and the development of CBD within the wellness sector including retail products such as patches, topical ointments, tinctures, beverages, powdered supplements as well as vaping capsules, e-liquids and oils. The firm typically invests in Europe, Canada, Africa and South America, Israel and Asia. The firm will hold investments for the medium to long term, although where opportunities exist for shorter-term investments, it may undertake such investments. The firm typically acquire control in certain situations, although it may also consider acquiring non-controlling positions. The firm seeks to take majority stake. World High Life Plc was founded on 30th January 2019 and is based in London, United Kingdom.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "ZOE.L": {
        "short_name": "ZOETIC INTERNATIONAL PLC ORD 1P",
        "long_name": "Zoetic International Plc",
        "summary": "Zoetic International Plc, a vertically integrated CBD company, researches, develops, produces, and sells cannabidiol (CBD) consumer products and other hemp derivatives in the United States and the United Kingdom. The company offers oral CBD tinctures and CBD gummies, as well as softgel, massage oil, and skincare products. Its CBD products are used for pharmaceutical and tobacco replacement applications. The company was formerly known as Highlands Natural Resources plc and changed its name to Zoetic International Plc in September 2019. Zoetic International Plc was founded in 2014 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "ZOEIF": {
        "short_name": "ZOETIC INTERNATIONAL PLC",
        "long_name": "Zoetic International Plc",
        "summary": "Zoetic International Plc, a vertically integrated CBD company, researches, develops, produces, and sells cannabidiol (CBD) consumer products and other hemp derivatives in the United States and the United Kingdom. The company offers oral CBD tinctures and CBD gummies, as well as softgel, massage oil, and skincare products. Its CBD products are used for pharmaceutical and tobacco replacement applications. The company was formerly known as Highlands Natural Resources plc and changed its name to Zoetic International Plc in September 2019. Zoetic International Plc was founded in 2014 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    }
}