{
    "9S2.F": {
        "short_name": "MIDWICH GROUP PLC  LS-,01",
        "long_name": "Midwich Group plc",
        "summary": "Midwich Group plc, together with its subsidiaries, engages in the distribution of audio visual (AV) solutions to the trade customers in the United Kingdom, Ireland, Europe, the Middle East, Africa, Asia Pacific, and North America. Its products support various AV categories, such as displays, projectors, audio, video, and digital signage, as well as lighting and unified communications. The company also distributes professional broadcast equipment; and provides logistics services. It serves professional AV integrators and IT resellers in corporate, education, retail, residential, and hospitality sectors. The company was formerly known as Jade 320 Limited and changed its name to Midwich Group Plc in April 2016. Midwich Group plc was founded in 1976 and is based in Diss, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Diss",
        "zipcode": "IP22 4YT",
        "website": "http://www.midwichgroupplc.com",
        "market_cap": 585148480
    },
    "MIDW.L": {
        "short_name": "MIDWICH GROUP PLC ORD GBP0.01",
        "long_name": "Midwich Group plc",
        "summary": "Midwich Group plc, together with its subsidiaries, engages in the distribution of audio visual (AV) solutions to the trade customers in the United Kingdom, Ireland, Europe, the Middle East, Africa, Asia Pacific, and North America. Its products support various AV categories, such as displays, projectors, audio, video, and digital signage, as well as lighting and unified communications. The company also distributes professional broadcast equipment; and provides logistics services. It serves professional AV integrators and IT resellers in corporate, education, retail, residential, and hospitality sectors. The company was formerly known as Jade 320 Limited and changed its name to Midwich Group Plc in April 2016. Midwich Group plc was founded in 1976 and is based in Diss, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Diss",
        "zipcode": "IP22 4YT",
        "website": "http://www.midwichgroupplc.com",
        "market_cap": 505046784
    },
    "NAR.L": {
        "short_name": "NORTHAMBER PLC ORD 1P",
        "long_name": "Northamber plc",
        "summary": "Northamber plc, together with its subsidiaries, distributes computers, peripheral equipment, and related services to resellers in the United Kingdom. The company sells computer accessories, mice and keyboards, monitors, PCs, tablets, and VDI terminals; hard disks, SSDs, and memory products; and accessories, AV accessories, large format products, digital signage products, and projectors. It also provides camera, color inkjet, color laser, labelling and barcoding, mono laser, scanner, and other print and imaging products, as well as printer consumables, scanning software, and scanner services; and add on cards, cases and PSU's, cooling and fans, gaming peripherals, graphics cards, mother boards, multimedia and other products, and USB products. In addition, the company offers cables and cable accessories; backup and UPS accessories and services; cabinets, KVMS, servers, and enterprise software, as well as vendor and other services; and camera, networking, physical security, and other security products. Further, it provides cloud, design and publishing, desktop, licensing, security, server, and speech software; and audio and conference phone, and autoID products. The company also exports its products to the Republic of Ireland, the Channel Islands, Isle of Man, and members of the European Union. Northamber plc was incorporated in 1980 and is headquartered in Chessington, the United Kingdom. Northamber plc operates as a subsidiary of Estate Of Mr David M Phillips.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Chessington",
        "zipcode": "KT9 1HS",
        "website": "http://www.northamber.com",
        "market_cap": 18109014
    }
}