{
    "7WP.F": {
        "short_name": "WINDAR PHOTONICS  LS -,01",
        "long_name": "Windar Photonics PLC",
        "summary": "Windar Photonics Plc, through its subsidiaries, develops and sells light detection and ranging sensors, and associated products for use on electricity generating wind turbines. It offers WindEYE and WindVISION sensors, which measure wind speed by scanning a laser beam ahead of the wind turbines. The company also provides WindTIMIZER for wind turbine's controller; and retrofit control system for wind turbines. It serves original equipment manufacturers, independent power producers, and wind park operators in Europe, China, and Asia. The company was incorporated in 2014 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SE1 2AQ",
        "website": "http://www.investor.windarphotonics.com",
        "market_cap": "Small Cap"
    },
    "9A5.SG": {
        "short_name": "discoverIE Group PLC Registered",
        "long_name": "discoverIE Group plc",
        "summary": "discoverIE Group plc designs, manufactures, and supplies components for electronic applications worldwide. It operates in two divisions, Design & Manufacturing, and Custom Supply. The company also offers technically demanding, customized electronic, photonic, and medical products to the industrial, medical, and healthcare markets. It serves customers in renewable energy, transportation, medical, and industrial and connectivity markets. The company was formerly known as Acal plc and changed its name to discoverIE Group plc in November 2017. discoverIE Group plc was founded in 1986 and is headquartered in Guildford, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Guildford",
        "zipcode": "GU2 7AH",
        "website": "http://www.discoverieplc.com",
        "market_cap": "Small Cap"
    },
    "ATC": {
        "short_name": "Atotech Limited",
        "long_name": "Atotech Limited",
        "summary": "Atotech Limited, a chemicals technology company, provides specialty electroplating and surface finishing solutions worldwide. The company operates in two segments, Electronics (EL) and General Metal Finishing (GMF). The EL segment manufactures and supplies chemistry, production equipment, and services to the electronics industry, which include printed circuit board manufacturers, package substrate makers, and semiconductor companies. Its products and technologies serve the principal electronics end-markets, including communication, computer, automotive, industrial, medical, aerospace, and military industries. The GMF segment provides chemistry, production technology, and services to the surface finishing industries in various areas of application. Its products and technologies serve the primary surface finishing end-markets comprising the automotive, consumer electronics, construction, sanitary, white goods, and oil and gas industries. The company also offers on-site support and training services. Atotech Limited was founded in 1851 and is headquartered in West Bromwich, United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "West Bromwich",
        "zipcode": "B70 0BG",
        "website": "http://www.atotech.com",
        "market_cap": "Mid Cap"
    },
    "BIOM.L": {
        "short_name": "BIOME TECHNOLOGIES PLC ORD 5P",
        "long_name": "Biome Technologies plc",
        "summary": "Biome Technologies plc engages in the bioplastics and radio frequency (RF) technology businesses in the United Kingdom, Europe, North America, Latin America, Asia, and internationally. The company's Bioplastics division produces a range of biodegradable and sustainable products that replace conventional oil-based plastics. This division's products have various applications, including flexible films, molded products, extruded sheets, and food wraps. The company's RF Technologies division designs, manufactures, and supplies electrical/electronic systems based on advanced radio frequency technology, such as induction furnace systems used in the manufacture and processing of silica glass preforms to produce optical fiber; plastic welding equipment used in various end-user applications comprising the nuclear, medical, and industrial sectors; and bespoke induction heating equipment. This division also provides maintenance support, system upgrades, and specialist spares. Biome Technologies plc was incorporated in 1984 and is headquartered in Southampton, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Southampton",
        "zipcode": "SO40 4BL",
        "website": "http://biometechnologiesplc.com",
        "market_cap": "Small Cap"
    },
    "DSCV.L": {
        "short_name": "DISCOVERIE GROUP PLC ORD 5P",
        "long_name": "discoverIE Group plc",
        "summary": "discoverIE Group plc designs, manufactures, and supplies components for electronic applications worldwide. It operates in two divisions, Design & Manufacturing, and Custom Supply. The company also offers technically demanding, customized electronic, photonic, and medical products to the industrial, medical, and healthcare markets. It serves customers in renewable energy, transportation, medical, and industrial and connectivity markets. The company was formerly known as Acal plc and changed its name to discoverIE Group plc in November 2017. discoverIE Group plc was founded in 1986 and is headquartered in Guildford, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Guildford",
        "zipcode": "GU2 7AH",
        "website": "http://www.discoverieplc.com",
        "market_cap": "Small Cap"
    },
    "GHH.L": {
        "short_name": "GOOCH & HOUSEGO PLC ORD 20P",
        "long_name": "Gooch & Housego PLC",
        "summary": "Gooch & Housego PLC engages in the manufacture and sale of acousto-optics, electro-optics, fiber optics, and precision optics/systems in the United Kingdom, North America, Europe, the Asia Pacific, and internationally. The company operates through Aerospace & Defence, Life Sciences/Biophotonics, and Industrial segments. It offers acousto-optic products, such as acousto-optic modulators, deflectors, fiber-coupled modulators, frequency shifters, model lockers, multi-channel modulators, pulse pickers and cavity dumpers, Q-switches, tunable filters, and RF drivers; crystal optics, including crystals and nonlinear optics, lithium niobate wafers, and periodically-poled lithium niobite; electro-optics, such as pockels cells, lithium niobate Q-switches, and pockels cell drivers; and lens assemblies and sighting systems. The company also provides fiber optics, such as DFB lasers and modules, fiber coupled pump lasers, high speed detectors, benchtop laser controllers, fused fiber optic components, planar lightwave circuits, multimode products, micro-optics, fiber optic assemblies, OCT components and subsystems, optical fiber amplifiers, and fiber coupled modulators; and precision optics, including precision prisms, corner cubes, precision lenses, opto-mechanical assemblies, precision mirrors, synchrotron and research grade mirrors, plate and cube beamsplitters, optical windows and flats, waveplates, polished SROC, ring laser gyroscope components, infrared optics, and optical domes. In addition, it engages in the development and manufacture of medical and in vitro diagnostic devices. The company offers its products for use in semiconductor and microelectronic, metrology, telecommunications, and scientific research industries; and mission-critical applications, as well as medical research, diagnostic imaging, and laser surgery applications. Gooch & Housego plc was founded in 1948 and is headquartered in Ilminster, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Ilminster",
        "zipcode": "TA19 0PF",
        "website": "http://gandh.com",
        "market_cap": "Small Cap"
    },
    "GPL.F": {
        "short_name": "GOOCH + HOUSEGO  LS-,20",
        "long_name": "Gooch & Housego PLC",
        "summary": "Gooch & Housego PLC engages in the manufacture and sale of acousto-optics, electro-optics, fiber optics, and precision optics/systems in the United Kingdom, North America, Europe, the Asia Pacific, and internationally. The company operates through Aerospace & Defence, Life Sciences/Biophotonics, and Industrial segments. It offers acousto-optic products, such as acousto-optic modulators, deflectors, fiber-coupled modulators, frequency shifters, model lockers, multi-channel modulators, pulse pickers and cavity dumpers, Q-switches, tunable filters, and RF drivers; crystal optics, including crystals and nonlinear optics, lithium niobate wafers, and periodically-poled lithium niobite; electro-optics, such as pockels cells, lithium niobate Q-switches, and pockels cell drivers; and lens assemblies and sighting systems. The company also provides fiber optics, such as DFB lasers and modules, fiber coupled pump lasers, high speed detectors, benchtop laser controllers, fused fiber optic components, planar lightwave circuits, multimode products, micro-optics, fiber optic assemblies, OCT components and subsystems, optical fiber amplifiers, and fiber coupled modulators; and precision optics, including precision prisms, corner cubes, precision lenses, opto-mechanical assemblies, precision mirrors, synchrotron and research grade mirrors, plate and cube beamsplitters, optical windows and flats, waveplates, polished SROC, ring laser gyroscope components, infrared optics, and optical domes. In addition, it engages in the development and manufacture of medical and in vitro diagnostic devices. The company offers its products for use in semiconductor and microelectronic, metrology, telecommunications, and scientific research industries; and mission-critical applications, as well as medical research, diagnostic imaging, and laser surgery applications. Gooch & Housego plc was founded in 1948 and is headquartered in Ilminster, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Ilminster",
        "zipcode": "TA19 0PF",
        "website": "http://gandh.com",
        "market_cap": "Small Cap"
    },
    "HDT.L": {
        "short_name": "HOLDERS TECHNOLOGY PLC ORD 10P",
        "long_name": "Holders Technology plc",
        "summary": "Holders Technology plc, together with its subsidiaries, supplies specialty laminates and materials for manufacturing of printed circuit board in the United Kingdom, Germany, and internationally. The company also operates as a lighting and control solutions provider. Its products include heatsinks, LED drivers and PSUS, LED light sources, lighting tracks, and optics and reflectors, as well as provides wireless lighting control, and smart lighting and building solutions. Holders Technology plc was founded in 1972 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1W 8DH",
        "website": "http://www.holderstechnology.com",
        "market_cap": "Small Cap"
    },
    "IJ8.F": {
        "short_name": "ITM POWER PLC  LS-,05",
        "long_name": "ITM Power Plc",
        "summary": "ITM Power Plc designs, manufactures, and sells hydrogen energy systems for energy storage, transportation, and industrial sectors in the United Kingdom, Germany, France, Italy, the Netherlands, and the United States. It offers HGas for power-to-gas, clean fuel, and industrial hydrogen applications. The company is also involved in the research and development of scientific and engineering projects; development and manufacture of prototype products; and sale of electrolysis equipment and hydrogen storage solutions. In addition, it operates 15 hydrogen refueling stations. ITM Power Plc was founded in 2001 and is headquartered in Sheffield, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Sheffield",
        "zipcode": "S4 7QQ",
        "website": "http://www.itm-power.com",
        "market_cap": "Mid Cap"
    },
    "ITM.L": {
        "short_name": "ITM POWER PLC ORD 5P",
        "long_name": "ITM Power Plc",
        "summary": "ITM Power Plc designs, manufactures, and sells hydrogen energy systems for energy storage, transportation, and industrial sectors in the United Kingdom, Germany, France, Italy, the Netherlands, and the United States. It offers HGas for power-to-gas, clean fuel, and industrial hydrogen applications. The company is also involved in the research and development of scientific and engineering projects; development and manufacture of prototype products; and sale of electrolysis equipment and hydrogen storage solutions. In addition, it operates 15 hydrogen refueling stations. ITM Power Plc was founded in 2001 and is headquartered in Sheffield, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Sheffield",
        "zipcode": "S4 7QQ",
        "website": "http://www.itm-power.com",
        "market_cap": "Mid Cap"
    },
    "ITMPF": {
        "short_name": "ITM POWER",
        "long_name": "ITM Power Plc",
        "summary": "ITM Power Plc designs, manufactures, and sells hydrogen energy systems for energy storage, transportation, and industrial sectors in the United Kingdom, Germany, France, Italy, the Netherlands, and the United States. It offers HGas for power-to-gas, clean fuel, and industrial hydrogen applications. The company is also involved in the research and development of scientific and engineering projects; development and manufacture of prototype products; and sale of electrolysis equipment and hydrogen storage solutions. In addition, it operates 15 hydrogen refueling stations. ITM Power Plc was founded in 2001 and is headquartered in Sheffield, the United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Sheffield",
        "zipcode": "S4 7QQ",
        "website": "http://www.itm-power.com",
        "market_cap": "Mid Cap"
    },
    "SOLI.L": {
        "short_name": "SOLID STATE PLC ORD 5P",
        "long_name": "Solid State plc",
        "summary": "Solid State plc manufactures and sells electronic equipment in the United Kingdom, rest of Europe, Asia, North America, and internationally. Its value added distribution division distributes semiconductors, related electronic and optoelectronic components, modules, and displays for use in the Internet of Things, embedded processing, control, wireless and wired communications, power management, optical emitters and sensors, and LED lighting. The company's manufacturing division is involved in the design, development, and supply of portable power and energy storage solutions; rugged and industrial computers; and advanced communication systems, including video transmission products, wideband antennas, and advanced high bandwidth radios, as well as batteries and mobile power solutions. It serves customers in medical, oil and gas, military and security, aerospace, environmental and oceanographic, original equipment manufacturing, and contract electronics manufacturing. The company was formerly known as Solid State Supplies plc and changed its name to Solid State plc in May 2006. Solid State plc was incorporated in 1963 and is based in Redditch, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Redditch",
        "zipcode": "B98 9EY",
        "website": "http://www.solidstateplc.com",
        "market_cap": "Small Cap"
    },
    "TTG.L": {
        "short_name": "TT ELECTRONICS PLC ORD 25P",
        "long_name": "TT Electronics plc",
        "summary": "TT Electronics plc provides engineered electronics for performance critical applications in the industrial, medical, and aerospace and defense markets worldwide. The company operates in three divisions: Power and Connectivity, Global Manufacturing Solutions, and Sensors and Specialist Components. The Power and Connectivity division designs and manufactures power application products and connectivity devices, which enable the capture and wireless transfer of data. It collaborates with customers to develop innovative solutions to optimize their electronic systems. The Global Manufacturing Solutions division provides manufacturing services and engineering solutions for its product divisions and to customers that require a lower volume and higher mix of different products. It manufactures integrated product assemblies, as well as provides designing testing solutions and value-engineering services. The Sensors and Specialist Components division works with customers to develop standard and customized solutions, including sensors and power management devices. Its solutions enhance the precision, speed, and reliability of critical aspects of its customers' applications. TT Electronics plc offers its products and services under the AB Connectors, Aero Stanrew, BI Technologies, IRC, OPTEK Technology, Precision, Power Partners, PowerPax, Stontronics, Torotel, Semelab, Welwyn, and Roxspur Measurement & Control brands. The company was formerly known as TT Group plc and changed its name to TT Electronics plc in 2000. TT Electronics plc was incorporated in 1906 and is headquartered in Woking, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Woking",
        "zipcode": "GU21 6EB",
        "website": "http://www.ttelectronics.com",
        "market_cap": "Small Cap"
    },
    "TTGPF": {
        "short_name": "TT ELECTRONICS",
        "long_name": "TT Electronics plc",
        "summary": "TT Electronics plc provides engineered electronics for performance critical applications in the industrial, medical, and aerospace and defense markets worldwide. The company operates in three divisions: Power and Connectivity, Global Manufacturing Solutions, and Sensors and Specialist Components. The Power and Connectivity division designs and manufactures power application products and connectivity devices, which enable the capture and wireless transfer of data. It collaborates with customers to develop innovative solutions to optimize their electronic systems. The Global Manufacturing Solutions division provides manufacturing services and engineering solutions for its product divisions and to customers that require a lower volume and higher mix of different products. It manufactures integrated product assemblies, as well as provides designing testing solutions and value-engineering services. The Sensors and Specialist Components division works with customers to develop standard and customized solutions, including sensors and power management devices. Its solutions enhance the precision, speed, and reliability of critical aspects of its customers' applications. TT Electronics plc offers its products and services under the AB Connectors, Aero Stanrew, BI Technologies, IRC, OPTEK Technology, Precision, Power Partners, PowerPax, Stontronics, Torotel, Semelab, Welwyn, and Roxspur Measurement & Control brands. The company was formerly known as TT Group plc and changed its name to TT Electronics plc in 2000. TT Electronics plc was incorporated in 1906 and is headquartered in Woking, the United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Woking",
        "zipcode": "GU21 6EB",
        "website": "http://www.ttelectronics.com",
        "market_cap": "Small Cap"
    },
    "TWD.L": {
        "short_name": "TRACKWISE DESIGNS PLC ORD 4P",
        "long_name": "Trackwise Designs plc",
        "summary": "Trackwise Designs plc develops, manufactures, and sells printed circuit boards in the United Kingdom, Europe, and internationally. The company's circuits are used in RF/antenna and lightweight interconnect products. Its products are used in telecommunications, aerospace, marine, defense, space, scientific, industrial, security, and automotive sectors. Trackwise Designs plc was founded in 1989 and is based in Tewkesbury, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Tewkesbury",
        "zipcode": "GL20 8HB",
        "website": "http://www.trackwise.co.uk",
        "market_cap": "Small Cap"
    },
    "WPHO.L": {
        "short_name": "WINDAR PHOTONICS PLC ORD 1P",
        "long_name": "Windar Photonics PLC",
        "summary": "Windar Photonics Plc, through its subsidiaries, develops and sells light detection and ranging sensors, and associated products for use on electricity generating wind turbines. It offers WindEYE and WindVISION sensors, which measure wind speed by scanning a laser beam ahead of the wind turbines. The company also provides WindTIMIZER for wind turbine's controller; and retrofit control system for wind turbines. It serves original equipment manufacturers, independent power producers, and wind park operators in Europe, China, and Asia. The company was incorporated in 2014 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SE1 2AQ",
        "website": "http://www.investor.windarphotonics.com",
        "market_cap": "Small Cap"
    },
    "XAR.L": {
        "short_name": "XAAR PLC ORD 10P",
        "long_name": "Xaar plc",
        "summary": "Xaar plc develops digital inkjet technology in Europe, the Middle East, Africa, Asia, and the Americas. It operates in three segments: Printhead, Product Print Systems, and 3D Printing. The company designs and manufactures piezoelectric drop-on-demand industrial inkjet print heads, product decoration systems, industrial 3D printing systems, inks and fluids, and system components. It also develops and sells ink systems, electronics, and fluid optimization services to accelerate inkjet system development and adoption. The company sells its technology in component form to original equipment manufacturers that produce and sell the digital printing solutions to the end market. It serves the 3D printing, ceramic tile decoration coding and marking, decorative laminates, direct-to-shape, functional fluid deposition, glass printing, graphics, primary labels, packaging, and product printing markets. Xaar plc was founded in 1990 and is headquartered in Cambridge, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Cambridge",
        "zipcode": "CB4 0XR",
        "website": "http://www.xaar.com",
        "market_cap": "Small Cap"
    },
    "ZYT.L": {
        "short_name": "ZYTRONIC PLC ORD 1P",
        "long_name": "Zytronic plc",
        "summary": "Zytronic plc, together with its subsidiaries, develops, manufactures, and markets interactive touch sensor products. The company offers touchscreens in gaming; retail, leisure, and commercial applications; digital signage; vending; banking; and industrial applications, as well as touch controllers. It provides single and multi-touch sensing technology. The company markets its products through a network of representatives and resellers. It primarily operates in the United States, Europe, the Middle East, Africa, Hungary, the United Kingdom, the Asia Pacific, and South Korea. Zytronic plc was incorporated in 1999 and is headquartered in Blaydon-on-Tyne, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Blaydon-on-Tyne",
        "zipcode": "NE21 5NJ",
        "website": "http://zytronic.co.uk",
        "market_cap": "Small Cap"
    }
}