{
    "AAAP.L": {
        "short_name": "ANGLO AFRICAN AGRICULTURE PLC O",
        "long_name": "Anglo African Agriculture Plc",
        "summary": "Anglo African Agriculture Plc, through its subsidiary, Dynamic Intertrade (Pty) Limited, operates as a food manufacturing and agricultural products trading company in South Africa. It is involved in the importation, milling, blending, and packaging of agricultural products that include herbs, spices, seasonings, and confectionary. The company manufactures chilli and paprika blended products; and trades in black pepper, chilli flakes, coconut, and dehydrated garlic products, as well as sugar beans, sesame seeds, white pepper, roasted coriander, and pumpkin seeds. It also exports its products. The company is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "AEP.L": {
        "short_name": "ANGLO-EASTERN PLANTATIONS PLC O",
        "long_name": "Anglo-Eastern Plantations Plc",
        "summary": "Anglo-Eastern Plantations Plc, together with its subsidiaries, owns, operates, and develops agriculture plantations in Indonesia and Malaysia. It primarily produces crude palm oil and associated products, such as palm kernels, shell nuts, fresh fruit bunches, biomass, and biogas products, as well as rubber products. The company also operates three biogas plants that generates and supplies surplus electricity to the national grid. As of December 31, 2019, it operated a planted area of approximately 71,481 hectares. The company was founded in 1985 and is based in London, the United Kingdom. Anglo-Eastern Plantations Plc is a subsidiary of Genton International Limited.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "CAM.L": {
        "short_name": "CAMELLIA PLC ORD 10P",
        "long_name": "Camellia Plc",
        "summary": "Camellia Plc engages in agriculture, engineering, food services, and investment businesses primarily in the United Kingdom. The company's Agriculture division is involved in the production of macadamia nuts, tea, avocados, rubber, citrus, maize, soya, barley, pineapples, wine, pistachios, almonds, and forestry products, as well as beef cattle grazing activities. Its Engineering division provides various engineering workshop services, such as repairing services for blow out preventers, offshore equipment, and machining and fabrication services, as well as metal finishing and maintenance services for the onshore hydroelectric sector; aerospace and industrial surface treatment services; and etch inspection services for aerospace parts, as well as researches and develops industrial catalysts. The company's Food Service division stores and distributes frozen foods to food manufacturers, wholesalers, and specialty producers; and sources and sells loose leaf teas for hotels and restaurants. Camellia Plc also invests in listed equities; residential and commercial properties; and collections of art, philately, and manuscripts. In addition, it operates in Continental Europe, Bangladesh, India, Kenya, Malawi, North America and Bermuda, South Africa, and South America. The company was incorporated in 1889 and is headquartered in Maidstone, the United Kingdom. Camellia Plc is a subsidiary of Camellia Holding AG.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Maidstone"
    },
    "CARR.L": {
        "short_name": "CARR'S GROUP PLC ORD 2.5P",
        "long_name": "Carr's Group plc",
        "summary": "Carr's Group plc engages in the agriculture and engineering businesses in the United Kingdom and internationally. The company's Agriculture segment develops, manufactures, and distributes a range of livestock supplementation products; and various compound and blended feeds for livestock. This segment offers feed blocks under the Crystalyx, Horslyx, SmartLic, and Megastart brands; and boluses under the Tracesure and Allsure brands. This segment also provides heating oil, gasoline, and diesel to agricultural, commercial, and retail customers; and offers a range of agricultural and household products and services, including farm machinery, clothing, and pet supplies through its approximately 42 retail locations. Its Engineering segment designs and manufactures process plant and equipment for the nuclear, petrochemical, oil and gas, pharmaceutical, process, and renewable energy industries; and remote handling equipment, robotics and radiation equipment, and supplying equipment to nuclear facilities and research centers, and the oil and gas industry, as well as offers engineering services. This segment also manufactures parts primarily for the oil and gas industries; and provides vehicle body building, repairs, servicing, conversions, painting, and signwriting for cars and commercial vehicles, as well as provides value added solutions to the nuclear defense, nuclear decommissioning, nuclear power generation, and other regulated markets. In addition, Carr's Group plc engages in the financial and property holding activities. The company was formerly known as Carr's Milling Industries PLC and changed its name to Carr's Group plc in April 2015. Carr's Group plc was founded in 1831 and is based in Carlisle, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Carlisle"
    },
    "CMF.SG": {
        "short_name": "CAMELLIA PLC Registered Shares ",
        "long_name": "Camellia Plc",
        "summary": "Camellia Plc engages in agriculture, engineering, food services, and investment businesses primarily in the United Kingdom. The company's Agriculture division is involved in the production of macadamia nuts, tea, avocados, rubber, citrus, maize, soya, barley, pineapples, wine, pistachios, almonds, and forestry products, as well as beef cattle grazing activities. Its Engineering division provides various engineering workshop services, such as repairing services for blow out preventers, offshore equipment, and machining and fabrication services, as well as metal finishing and maintenance services for the onshore hydroelectric sector; aerospace and industrial surface treatment services; and etch inspection services for aerospace parts, as well as researches and develops industrial catalysts. The company's Food Service division stores and distributes frozen foods to food manufacturers, wholesalers, and specialty producers; and sources and sells loose leaf teas for hotels and restaurants. Camellia Plc also invests in listed equities; residential and commercial properties; and collections of art, philately, and manuscripts. In addition, it operates in Continental Europe, Bangladesh, India, Kenya, Malawi, North America and Bermuda, South Africa, and South America. The company was incorporated in 1889 and is headquartered in Maidstone, the United Kingdom. Camellia Plc is a subsidiary of Camellia Holding AG.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Maidstone"
    },
    "MPE.L": {
        "short_name": "M.P. EVANS GROUP PLC ORD 10P",
        "long_name": "M.P. Evans Group plc",
        "summary": "M.P. Evans Group plc, through its subsidiaries, owns, manages, and develops oil palm plantations in Indonesia. The company produces crude palm oil and palm kernels. It is also involved in the property development and oil-palm fresh fruit bunches production businesses; and the provision of agronomic and management consultancy services. As of December 31, 2019, the company had interests in 39,400 hectares of oil palm plantations in Indonesia; and 12,200 hectares of associated smallholder oil palm. Evans Group plc was incorporated in 1981 and is headquartered in Tunbridge Wells, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Tunbridge Wells"
    },
    "RE-B.L": {
        "short_name": "R.E.A. HOLDINGS PLC 9% CUM PRF ",
        "long_name": "R.E.A. Holdings plc",
        "summary": "R.E.A. Holdings plc cultivates oil palms in the province of East Kalimantan in Indonesia. The company also produces and sells crude palm oil and crude palm kernel oil. As of December 31, 2019, its planted area comprised approximately 36,154 hectares. The company is also involved in stone quarrying and coal mining activities. It holds interests in two stone deposits and two coal mining concessions located in East Kalimantan. In addition, the company generates renewable energy from its two methane capture plants. R.E.A. Holdings plc was founded in 1906 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "RE.L": {
        "short_name": "R.E.A. HOLDINGS PLC ORD 25P",
        "long_name": "R.E.A. Holdings plc",
        "summary": "R.E.A. Holdings plc cultivates oil palms in the province of East Kalimantan in Indonesia. The company also produces and sells crude palm oil and crude palm kernel oil. As of December 31, 2019, its planted area comprised approximately 36,154 hectares. The company is also involved in stone quarrying and coal mining activities. It holds interests in two stone deposits and two coal mining concessions located in East Kalimantan. In addition, the company generates renewable energy from its two methane capture plants. R.E.A. Holdings plc was founded in 1906 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    }
}