{
    "MUL.L": {
        "short_name": "MULBERRY GROUP PLC ORD 5P",
        "long_name": "Mulberry Group plc",
        "summary": "Mulberry Group plc, through its subsidiaries, develops, manufactures, and sells fashion accessories, clothing, and footwear in the United Kingdom, rest of Europe, Asia, North America, and internationally. The company offers shoulder, satchel, tote, clutch, backpack, and mini and micro bags; and dresses, tops and knitwear, skirts and pants, and jackets and coats for women. It also provides briefcases, messenger bags, and backpack; wallets, and purses and pouches; sunglasses, scarves, gloves and hats, belts, cufflinks, keyrings, shoes; jewellery, organisers, and care products; gifts; and luggage, holdalls, bag, and other travel accessories for men and women. The company sells its products through its retail shops, concessions, and wholesale distribution channels under the Mulberry brand. It also sells its products online. Mulberry Group plc was founded in 1971 and is based in Bath, the United Kingdom. Mulberry Group plc is a subsidiary of Challice Limited.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Bath"
    },
    "PTD.L": {
        "short_name": "PITTARDS PLC ORD 50P",
        "long_name": "Pittards plc",
        "summary": "Pittards plc designs, produces, procures, and sells leather products in the United Kingdom, Europe, North America, the Far East, and internationally. The company operates in two divisions, UK and Ethiopia. It is also involved in the production and retail of leather goods and garments, bags, shoes, and gloves; and provision of consultancy and other related services to the leather industry. In addition, the company exports its products to approximately 44 countries. It serves manufacturers and distributors of shoes, gloves, luxury leather goods, interiors, and sports equipment. Pittards plc was founded in 1826 and is headquartered in Yeovil, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Yeovil"
    }
}