{
    "1M7.F": {
        "short_name": "CAMBR.COGNIT.HLDGS LS-,01",
        "long_name": "Cambridge Cognition Holdings Plc",
        "summary": "Cambridge Cognition Holdings Plc, a neuroscience technology company, develops digital health solutions in the United States, United Kingdom, the European Union, and internationally. The company offers CANTAB Recruit, an online patient recruitment platform for pharmaceutical and biotechnology companies to identify qualified clinical trial participants in high-need indications, such as Alzheimer's disease; CANTAB Connect that provides digital cognitive assessment solutions for pharmaceutical clinical trials in various therapeutic areas from Phases IÂ\u0096IV or a cognitive testing software that enhances the chances of success and minimizing the risk of failure in neuroscience research; and Cognition Kit, a digital health platform, which delivers wearable and smartphone apps for data collection to provide engaging digital health solutions for the enhancement of patient engagement, demonstration of treatment efficacy, and understanding of a disease and a patient's response to medication. It also provides CANTAB Connect Research, a research software that offers sensitive digital measures of cognitive function for various areas of brain research; CANTAB Mobile, a touchscreen memory test used in clinical research of Alzheimer's disease; CANTAB BrainHealth, an online digital health assessment tool to measure and monitor mental wellbeing and cognitive performance in the workplace; and CANTAB Insight, a medical device that helps to determine an individual's cognitive health. In addition, the company offers a range of expert consultancy and operational management services to optimize clinical trials and cognitive research, which include neuroscience and technical consultancy, study design, data analysis, study and data management, and reports and interpretation. Cambridge Cognition Holdings Plc was incorporated in 2012 and is based in Cambridge, the United Kingdom.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Cambridge",
        "zipcode": "CB25 9TU",
        "website": "http://www.cambridgecognition.com",
        "market_cap": "Small Cap"
    },
    "54I.SG": {
        "short_name": "Instem PLC Registered Shares LS",
        "long_name": "Instem plc",
        "summary": "Instem plc, together with its subsidiaries, provides information technology applications to the life sciences healthcare market worldwide. The company offers solutions for data collection, management, and analysis to meet the needs of life science and healthcare organizations for data-driven decision making. Its solutions include ALPHADAS, an eSource EDC system for early phase clinical trials; BioRails for discovery data management; Comet Assay IV, a live video imaging system for reproducible comet slide scoring; and Cyto Study Manager, a data acquisition and reporting solution. The company also offers computational toxicology products and services; Logbook, a repository for information; Morphit for discovery data visualization; NOTOCORD-hem software platforms to acquire, display, and analyze physiological signals; and Provantis, a Windows-based system for organizations and universities in non-clinical evaluation studies. In addition, the company provides Samarind RMS to manage medical product information; submit platform that offers tools and services for the creation and management of SEND datasets and associated documents for contract research organizations and sponsors; SENDView, an application that simplifies the review of SEND datasets; SEND Explorer, a web-based application with optional data warehousing capabilities; SENDTrial, a Web based solution that can be accessed through a subscription; and standard for exchange of nonclinical data solutions. Further, it provides Sorcerer Colony Counter for automatic plate counter; anonymization, cloud, validation, and safety assessment and regulatory information management software services; and software solutions to extract intelligence from research and development related healthcare data. Additionally, the company develops, manufactures, and supplies software and hardware products for in vitro study data collection and management. Instem plc was founded in 1969 and is headquartered in Stone, the United Kingdom.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Stone",
        "zipcode": "ST15 0SD",
        "website": "http://www.instem.com",
        "market_cap": "Small Cap"
    },
    "COG.L": {
        "short_name": "CAMBRIDGE COGNITION HOLDINGS PL",
        "long_name": "Cambridge Cognition Holdings Plc",
        "summary": "Cambridge Cognition Holdings Plc, a neuroscience technology company, develops digital health solutions in the United States, United Kingdom, the European Union, and internationally. The company offers CANTAB Recruit, an online patient recruitment platform for pharmaceutical and biotechnology companies to identify qualified clinical trial participants in high-need indications, such as Alzheimer's disease; CANTAB Connect that provides digital cognitive assessment solutions for pharmaceutical clinical trials in various therapeutic areas from Phases IÂ\u0096IV or a cognitive testing software that enhances the chances of success and minimizing the risk of failure in neuroscience research; and Cognition Kit, a digital health platform, which delivers wearable and smartphone apps for data collection to provide engaging digital health solutions for the enhancement of patient engagement, demonstration of treatment efficacy, and understanding of a disease and a patient's response to medication. It also provides CANTAB Connect Research, a research software that offers sensitive digital measures of cognitive function for various areas of brain research; CANTAB Mobile, a touchscreen memory test used in clinical research of Alzheimer's disease; CANTAB BrainHealth, an online digital health assessment tool to measure and monitor mental wellbeing and cognitive performance in the workplace; and CANTAB Insight, a medical device that helps to determine an individual's cognitive health. In addition, the company offers a range of expert consultancy and operational management services to optimize clinical trials and cognitive research, which include neuroscience and technical consultancy, study design, data analysis, study and data management, and reports and interpretation. Cambridge Cognition Holdings Plc was incorporated in 2012 and is based in Cambridge, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Cambridge",
        "zipcode": "CB25 9TU",
        "website": "http://www.cambridgecognition.com",
        "market_cap": "Small Cap"
    },
    "CRW.L": {
        "short_name": "CRANEWARE PLC ORD 1P",
        "long_name": "Craneware plc",
        "summary": "Craneware plc, together with its subsidiaries, develops, licenses, and supports computer software for the healthcare industry in the United States. The company provides solutions, such as Chargemaster Toolkit, an automated software-as-a-service (SaaS) chargemaster management solution for capturing optimal legitimate reimbursement for providers; Trisus Supply, a solution that utilizes data to identify data gaps between the systems; Physician Revenue Toolkit, a SaaS solution for managing physician group KPIs, charges, codes, RVUs, fee schedules, and related information; Reference Plus, a SaaS solution to perform chargemaster analysis; Pharmacy ChargeLink, a solution to enhance charge capture, pricing, and cost management; interface scripting module, a software that automatically uploads chargemaster changes to the patient billing system for accurate billing; Trisus Pricing Analyzer, a SaaS solution that simplifies the price modelling process; and Online Reference Toolkit and supplies assistant solutions. It also offers InSight Medical Necessity, a SaaS solution that provides medical necessity validation for the United States payors and advance beneficiary notice creation; Trisus Claims Informatics, a software that automates claim and coding reviews; and InSight Audit, a web-based audit management application for healthcare organizations to manage government and commercial audits. In addition, the company provides Trisus Healthcare Intelligence, a cost analytics and resource efficiency platform; Patient Charge Estimator to simplify the process of providing patient bill estimates for inpatient and outpatient services; InSight Denials to analyze, track, trend, and report on denial data; and appeals services. Further, it offers consulting and professional services; and sales and marketing, product development, and software development services. Craneware plc was founded in 1999 and is headquartered in Edinburgh, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Edinburgh",
        "zipcode": "EH3 5DA",
        "website": "http://public.craneware.com",
        "market_cap": "Small Cap"
    },
    "DOC.AX": {
        "short_name": "DOCTORCARE CDI 1:1",
        "long_name": "Doctor Care Anywhere Group PLC",
        "summary": "Doctor Care Anywhere Group PLC operates as a telehealth company in the United Kingdom. It offers services in the areas of appointments, patient records, prescriptions, referrals and fit notes, service improvements, and virtual GP consultations in the form of video and phone. The company provides treatments for allergies, bites and stings, cold and flu, headaches and migraines, joint pains, lifestyle support, mental and sexual health, skin conditions, and stomach and digestive problems, as well as offers internet hospital services in the areas of cardiology, ear, nose and throat, gastroenterology, gynecology, orthopedics, spinal, and urology. It serves medical insurers, employers, retailers, healthcare providers, corporate clients, and private individuals. The company was incorporated in 2013 and is headquartered in London, United Kingdom.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC4Y 8DP",
        "website": "http://www.doctorcareanywhere.com",
        "market_cap": "Small Cap"
    },
    "DSH.F": {
        "short_name": "SENSYNE HEALTH LT  LS-,1",
        "long_name": "Sensyne Health plc",
        "summary": "Sensyne Health plc, a healthcare technology company, develops software products that connects healthcare professionals with patients in the United Kingdom and the United States. Its products include CVm-Health, a web-based application for coronavirus self-monitoring; DBm-Health, which helps individuals monitor their blood glucose levels and share their readings with health care professionals; GDm-Health, a prescribed digital therapeutic for remote management of diabetes in pregnancy; and BPm-Health that allows pregnant women to self-monitor blood pressure during pregnancy. The company's products also include SEND, an early warning system for monitoring patient vital signs in hospital; EDGE, a prescribed digital therapeutic for monitoring chronic obstructive pulmonary disease at home; CleanSpace, a system for monitoring personal exposure to air pollution; and Support-HF, a prescribed digital therapeutic for monitoring heart failure at home. Sensyne Health has strategic research alliance with Bayer to develop new treatments using clinical artificial intelligence; research collaboration agreement with Bristol Myers Squibb to apply machine learning for rare blood disease research; and strategic research agreement with Milton Keynes University Hospital NHS Foundation Trust to enable the ethical application of clinical artificial intelligence research to improve patient care and research into new medicines; collaboration agreement with Bristol Myers Squibb to apply machine learning for rare blood disease research; and strategic research agreement with Hampshire Hospitals NHS Foundation Trust. Sensyne Health plc was incorporated in 2018 and is based in Oxford, the United Kingdom.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Oxford",
        "zipcode": "OX4 4GE",
        "website": "http://www.sensynehealth.com",
        "market_cap": "Small Cap"
    },
    "EMIS.L": {
        "short_name": "EMIS GROUP PLC ORD 1P",
        "long_name": "EMIS Group plc",
        "summary": "EMIS Group plc, through its subsidiaries, provides connected healthcare software and systems for healthcare professionals in the United Kingdom. It operates in two segments, EMIS Health and EMIS Enterprise. The EMIS Health segment supplies integrated care technology to national health service markets, including primary, community, acute, and social care. The EMIS Enterprise segment focuses on B2B technology sector in the healthcare market, such as management of medicines, partner businesses, life sciences, and patient-facing services. The company offers clinical software to healthcare organizations under the EMIS brand; patient-centric medical and wellbeing information and digital front door services under the Patient brand name; and service management solutions to the community pharmacy market under the Pinnacle brand. It also operates Patient.info, an online health platform that provides personalized online patient-facing services and healthcare content; Patient Access, which enables people to book appointments; and ProScript and ProScript Connect that enable pharmacies to manage the dispensing process and handle tasks, such as labelling and endorsing, patient records, ordering, and stock control. In addition, the company provides non-clinical ICT solutions for healthcare professionals and other public and private sector organizations; and supplies ICT infrastructure and hosting services. The company was founded in 1987 and is headquartered in Leeds, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Leeds",
        "zipcode": "LS19 6BA",
        "website": "http://www.emisgroupplc.com",
        "market_cap": "Small Cap"
    },
    "FDBK.L": {
        "short_name": "FEEDBACK PLC ORD 0.25P",
        "long_name": "Feedback plc",
        "summary": "Feedback plc, a medical imaging technology company, provides software and systems to those working in the field of medical imaging. Its products include TexRAD, a software tool, which extracts and quantifies texture features in radiological images, assisting research into all tumor types, as well as uncovers biomarkers in medical images; and TexRAD Lung for the analysis of lung cancer for clinical use in the European Union. The company also offers Cadran image platform that provides hospitals and research institutes with a comprehensive picture archiving communication system for medical images, as well as equips users with a platform for image handling from all imaging modalities, such as CT and PET scanners; and Bleepa, which combines secure instant messaging with the ability to see clinical grade medical images, including X-rays, and CT and MRI scans using portable devices, such as smartphones or tablets. Feedback plc was founded in 1958 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SE1 7LL",
        "website": "http://fbkmed.com/feedback-plc",
        "market_cap": "Small Cap"
    },
    "INHC.L": {
        "short_name": "INDUCTION HEALTHCARE GROUP PLC ",
        "long_name": "Induction Healthcare Group PLC",
        "summary": "Induction Healthcare Group PLC provides software to healthcare professionals in the United Kingdom, rest of Europe, the United States, and internationally. It offers Induction Switch, a communication and sharing platform that enables healthcare professionals to connect and collaborate securely with the people they need within a complex clinical environment; MicroGuide, a platform to create, edit, and publish structured and governance-controlled guidance and policies; Zesty, a digital platform that allows patients to book appointments, read appointment and clinical letters, store a local copy of clinical record, and provide data to care teams remotely; and HealthStream that reads and writes demographic, appointment, and clinical record data. The company was incorporated in 2019 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC3R 8HL",
        "website": "http://www.inductionhealthcare.com",
        "market_cap": "Small Cap"
    },
    "INS.L": {
        "short_name": "INSTEM PLC ORD 10P",
        "long_name": "Instem plc",
        "summary": "Instem plc, together with its subsidiaries, provides information technology applications to the life sciences healthcare market worldwide. The company offers solutions for data collection, management, and analysis to meet the needs of life science and healthcare organizations for data-driven decision making. Its solutions include ALPHADAS, an eSource EDC system for early phase clinical trials; BioRails for discovery data management; Comet Assay IV, a live video imaging system for reproducible comet slide scoring; and Cyto Study Manager, a data acquisition and reporting solution. The company also offers computational toxicology products and services; Logbook, a repository for information; Morphit for discovery data visualization; NOTOCORD-hem software platforms to acquire, display, and analyze physiological signals; and Provantis, a Windows-based system for organizations and universities in non-clinical evaluation studies. In addition, the company provides Samarind RMS to manage medical product information; submit platform that offers tools and services for the creation and management of SEND datasets and associated documents for contract research organizations and sponsors; SENDView, an application that simplifies the review of SEND datasets; SEND Explorer, a web-based application with optional data warehousing capabilities; SENDTrial, a Web based solution that can be accessed through a subscription; and standard for exchange of nonclinical data solutions. Further, it provides Sorcerer Colony Counter for automatic plate counter; anonymization, cloud, validation, and safety assessment and regulatory information management software services; and software solutions to extract intelligence from research and development related healthcare data. Additionally, the company develops, manufactures, and supplies software and hardware products for in vitro study data collection and management. Instem plc was founded in 1969 and is headquartered in Stone, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Stone",
        "zipcode": "ST15 0SD",
        "website": "http://www.instem.com",
        "market_cap": "Small Cap"
    },
    "NSAV": {
        "short_name": "NET SAVINGS LINK INC",
        "long_name": "Net Savings Link, Inc.",
        "summary": "Net Savings Link, Inc. operates as a cryptocurrency, blockchain, and digital asset technology company. It holds interests in Cryptocurrency Trading Platform based on Artificial Intelligence (AI) and offers a range of trading services, such as portfolio management and price search function. This platform supports various cryptocurrency exchanges. The company is based in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1K 4QW",
        "website": null,
        "market_cap": "Small Cap"
    },
    "SENS.L": {
        "short_name": "SENSYNE HEALTH PLC ORD 10P",
        "long_name": "Sensyne Health plc",
        "summary": "Sensyne Health plc, a healthcare technology company, develops software products that connects healthcare professionals with patients in the United Kingdom and the United States. Its products include CVm-Health, a web-based application for coronavirus self-monitoring; DBm-Health, which helps individuals monitor their blood glucose levels and share their readings with health care professionals; GDm-Health, a prescribed digital therapeutic for remote management of diabetes in pregnancy; and BPm-Health that allows pregnant women to self-monitor blood pressure during pregnancy. The company's products also include SEND, an early warning system for monitoring patient vital signs in hospital; EDGE, a prescribed digital therapeutic for monitoring chronic obstructive pulmonary disease at home; CleanSpace, a system for monitoring personal exposure to air pollution; and Support-HF, a prescribed digital therapeutic for monitoring heart failure at home. Sensyne Health has strategic research alliance with Bayer to develop new treatments using clinical artificial intelligence; research collaboration agreement with Bristol Myers Squibb to apply machine learning for rare blood disease research; and strategic research agreement with Milton Keynes University Hospital NHS Foundation Trust to enable the ethical application of clinical artificial intelligence research to improve patient care and research into new medicines; collaboration agreement with Bristol Myers Squibb to apply machine learning for rare blood disease research; and strategic research agreement with Hampshire Hospitals NHS Foundation Trust. Sensyne Health plc was incorporated in 2018 and is based in Oxford, the United Kingdom.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Oxford",
        "zipcode": "OX4 4GE",
        "website": "http://www.sensynehealth.com",
        "market_cap": "Small Cap"
    }
}