{
    "ACT.L": {
        "short_name": "ACTUAL EXPERIENCE PLC ORD 0.2P",
        "long_name": "Actual Experience plc",
        "summary": "Actual Experience plc, an analytics-as-a-service company, provides human experience management and associated consultancy services in the United Kingdom and the United States. It offers Analytics Cloud that receives data from digital users, applies algorithms to the data, and produces an objective score of digital experience quality and supply chain diagnostics; and Dashboard that provides actionable data for service providers to pinpoint the cause of poor digital quality. The company also provides digital supply chain, a combination of businesses and the technologies they provide, including networks, IT infrastructure and applications, that deliver a digital product or service; and digital user, a measurement software component of Actual Work and Actual Home. Actual Experience plc is headquartered in Bath, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Bath"
    },
    "B1O.F": {
        "short_name": "BANGO PLC  LS-,20",
        "long_name": "Bango plc",
        "summary": "Bango plc develops, markets, and sells technology that enables the marketing and sale of products and services to mobile phone users. It operates through two segments, End User Activity and Data Activity. The company offers Bango Marketplace that enables developers to direct their marketing towards selected customer audiences; and Bango Resale, a solution that enables merchants to acquire, retain, and monetize new customers through global resale partnerships. It also provides Audiens, a mobile data exchange platform. The company operates in the United Kingdom, European Union, the United States, Canada, and internationally. Bango plc was founded in 1999 and is based in Cambridge, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Cambridge"
    },
    "BGO.L": {
        "short_name": "BANGO PLC ORD 20P",
        "long_name": "Bango plc",
        "summary": "Bango plc develops, markets, and sells technology that enables the marketing and sale of products and services to mobile phone users. It operates through two segments, End User Activity and Data Activity. The company offers Bango Marketplace that enables developers to direct their marketing towards selected customer audiences; and Bango Resale, a solution that enables merchants to acquire, retain, and monetize new customers through global resale partnerships. It also provides Audiens, a mobile data exchange platform. The company operates in the United Kingdom, European Union, the United States, Canada, and internationally. Bango plc was founded in 1999 and is based in Cambridge, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Cambridge"
    },
    "BGOPF": {
        "short_name": "BANGO",
        "long_name": "Bango plc",
        "summary": "Bango plc develops, markets, and sells technology that enables the marketing and sale of products and services to mobile phone users. It operates through two segments, End User Activity and Data Activity. The company offers Bango Marketplace that enables developers to direct their marketing towards selected customer audiences; and Bango Resale, a solution that enables merchants to acquire, retain, and monetize new customers through global resale partnerships. It also provides Audiens, a mobile data exchange platform. The company operates in the United Kingdom, European Union, the United States, Canada, and internationally. Bango plc was founded in 1999 and is based in Cambridge, the United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Cambridge"
    },
    "CCC": {
        "short_name": "Clarivate Plc",
        "long_name": "Clarivate Plc",
        "summary": "Clarivate Plc, an information services and analytics company, provides structured information and analytics for discovery, protection, and commercialization of scientific research, innovations, and brands. It offers Web of Science products and services, such as Web of Science, InCites, Journal Citation Reports, EndNote, ScholarOne, Converis, Publons, and Kopernio to organizations that plan, fund, implement, and utilize research; and Life Sciences products, including Cortellis and Newport Integrity for pharmaceutical and biotechnology companies to support research, market intelligence, and competitive monitoring in connection with the development and commercialization of new drugs. The company also provides Derwent products, which include Derwent Innovation, Techstreet, and IP Professional Services that enables its customers to evaluate the novelty of potential new products, confirm freedom to operate with respect to their product design, help them secure patent protection, assess the competitive technology landscape, and ensure that their products comply with required industry standards; CompuMark products, such as trademark screening, searching, and watching products and services for businesses and law firms; and MarkMonitor products, which helps enterprises to establish, manage, optimize, and protect their online presence. It serves government and academic institutions, life science companies, and research and development corporations in the Americas, the Middle East, Africa, Europe, and the Asia Pacific. The company was formerly known as Clarivate Analytics Plc and changed its name to Clarivate Plc in May 2020. Clarivate Plc is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "COUD.F": {
        "short_name": "COMPUTACENTER  LS-,075555",
        "long_name": "Computacenter plc",
        "summary": "Computacenter plc provides information technology (IT) infrastructure services in the United Kingdom, Germany, France, the United America, and internationally. The company offers endpoint, infrastructure, cyber security, information security management, and identity and access management solutions; network solutions, including local area and datacentre network, smart infrastructure, and audio-visual solutions; and datacentre solutions, such as enterprise computing, hybrid cloud, data and storage management, and analytics and big data. It also provides workplace solutions comprising client computing, virtual desktop, enterprise mobility, and print; office and online, video and voice communication, messaging, and collaboration solutions; global and next generation service desk solutions; smart supply, supply chain, lifecycle management, and e-business services; change and consulting services; and managed, and support and maintenance services. In addition, the company offers property investment, international call centre, and employee share scheme trustee services. It provides its solutions for customers in the financial services, public, retail, utility, pharmaceutical, professional services, oil and gas, and e-gaming sectors. Computacenter plc was founded in 1981 and is headquartered in Hatfield, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Hatfield"
    },
    "ECK.L": {
        "short_name": "ECKOH PLC ORD 0.25P",
        "long_name": "Eckoh plc",
        "summary": "Eckoh plc, together with its subsidiaries, provides secure payment products and customer contact solutions for customer contact centers in the United Kingdom, the United States, and internationally. It offers customer engagement solutions, such as chatbots, email management, knowledge base, messaging, social agent, and Web chat; and interactive voice response (IVR) and speech solutions, including identification and verification, IVR self-service, natural language, and visual IVR. The company also provides secure payment solutions, which include agent assisted, automated payment, e-wallet, Web chat, and remote agent payments; and payment card industry compliance solutions. In addition, it offers contact center solutions, which include agent desktop, call recording, digital transformation, contact center, portal, and number management solutions; and third party support services; agent desktop, call recording, digital transformation, contact center, portal, and number management solutions. Further, the company provides customer engagement, support, and cloud-based software solutions. It serves clients in the business and financial services, housing, insurance, public services, retail, telecoms, and utilities, as well as travel transport and leisure industries. Eckoh plc was incorporated in 1997 and is headquartered in Hemel Hempstead, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Hemel Hempstead"
    },
    "FDDMF": {
        "short_name": "FDM GROUP (HOLDINGS) PLC",
        "long_name": "FDM Group (Holdings) plc",
        "summary": "FDM Group (Holdings) plc, together with its subsidiaries, provides information technology (IT) services in the United Kingdom, Ireland, North America, rest of Europe, the Middle East, Africa, and the Asia Pacific. The company is involved in recruiting, training, and placing its own IT and business consultants across various technical and business disciplines, including development, testing, project management and support office, data and operations services, business analysis, business intelligence, production support, client training, and information security. The company was formerly known as Astra Topco Limited and changed its name to FDM Group (Holdings) plc. FDM Group (Holdings) plc was founded in 1991 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "FDP.L": {
        "short_name": "FIRST DERIVATIVES PLC ORD 0.5P",
        "long_name": "First Derivatives plc",
        "summary": "First Derivatives plc provides software and consulting services in the United Kingdom and internationally. The company operates through Managed Services and Consulting and Software segments. It provides kdb+, in-memory, time-series database. The company also supports trading systems for front, middle, and back-office operations. In addition, it provides capital markets consulting and managed services, as well as intellectual property and related services. The company serves finance, technology, retail, pharma, manufacturing, telecom, digital marketing, utilities, Industrial Internet of Things, and energy markets. First Derivatives plc was founded in 1996 and is headquartered in Newry, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Newry"
    },
    "FDRVF": {
        "short_name": "FIRST DERIVATIVES PLC",
        "long_name": "First Derivatives plc",
        "summary": "First Derivatives plc provides software and consulting services in the United Kingdom and internationally. The company operates through Managed Services and Consulting and Software segments. It provides kdb+, in-memory, time-series database. The company also supports trading systems for front, middle, and back-office operations. In addition, it provides capital markets consulting and managed services, as well as intellectual property and related services. The company serves finance, technology, retail, pharma, manufacturing, telecom, digital marketing, utilities, Industrial Internet of Things, and energy markets. First Derivatives plc was founded in 1996 and is headquartered in Newry, the United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Newry"
    },
    "FNX.L": {
        "short_name": "FONIX MOBILE PLC ORD 0.1P",
        "long_name": "Fonix Mobile plc",
        "summary": "Fonix Mobile Ltd provides mobile payments and messaging services for client in media, telecoms, entertainment, enterprise, and commerce. The company was founded in 2006 and is headquartered in London, the United States.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "FOS.F": {
        "short_name": "FONIX MOBILE PLC LS-,001",
        "long_name": "Fonix Mobile plc",
        "summary": "Fonix Mobile Ltd provides mobile payments and messaging services for client in media, telecoms, entertainment, enterprise, and commerce. The company was founded in 2006 and is headquartered in London, the United States.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "GYQ.IR": {
        "short_name": "FIRST DERIVATIVES",
        "long_name": "First Derivatives plc",
        "summary": "First Derivatives plc provides software and consulting services in the United Kingdom and internationally. The company operates through Managed Services and Consulting and Software segments. It provides kdb+, in-memory, time-series database. The company also supports trading systems for front, middle, and back-office operations. In addition, it provides capital markets consulting and managed services, as well as intellectual property and related services. The company serves finance, technology, retail, pharma, manufacturing, telecom, digital marketing, utilities, Industrial Internet of Things, and energy markets. First Derivatives plc was founded in 1996 and is headquartered in Newry, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "ISE",
        "market": "ie_market",
        "country": "United Kingdom",
        "city": "Newry"
    },
    "GYQ.SG": {
        "short_name": "First Derivatives PLC Registere",
        "long_name": "First Derivatives plc",
        "summary": "First Derivatives plc provides software and consulting services in the United Kingdom and internationally. The company operates through Managed Services and Consulting and Software segments. It provides kdb+, in-memory, time-series database. The company also supports trading systems for front, middle, and back-office operations. In addition, it provides capital markets consulting and managed services, as well as intellectual property and related services. The company serves finance, technology, retail, pharma, manufacturing, telecom, digital marketing, utilities, Industrial Internet of Things, and energy markets. First Derivatives plc was founded in 1996 and is headquartered in Newry, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Newry"
    },
    "KBT.L": {
        "short_name": "K3 BUSINESS TECHNOLOGY GROUP PL",
        "long_name": "K3 Business Technology Group plc",
        "summary": "K3 Business Technology Group plc, together with its subsidiaries, provides integrated business solutions to retailers, manufacturers, and distributors in the supply chain sector primarily in the United Kingdom. It operates through Own IP and Supply Chain Solutions & Managed Services segments. The company offers enterprise resource planning and customer relationship management software, as well as point solutions, and hosting and managed services. It also provides computer software supply and consultancy services. The company supplies solutions comprising software products, such as Microsoft Dynamics, NAV, and CRM, as well as K3 Syspro, Sage, and Pebblestone Fashion. It also operates in the Netherlands, Ireland, rest of Europe, the Middle East, Asia, the United States, and internationally. K3 Business Technology Group plc was incorporated in 1991 and is headquartered in Manchester, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Manchester"
    },
    "MOC.F": {
        "short_name": "MODE GLOBAL HLDGS  LS-,01",
        "long_name": "Mode Global Holdings PLC",
        "summary": "Mode Global Holdings PLC, a fintech company, provides financial services in the United Kingdom. The company provides digital banking app that allows users to manage their traditional and digital assets all in one place, and earn interest on Bitcoin through the interest-generating accounts in the market; and payment processing and marketing services for UK and European businesses. It also offers social media and mobile payment platforms to make and receive payments by using mobile phones to pay and accept money. The company was founded in 2015 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "PAN.F": {
        "short_name": "PAYPOINT PLC  LS -,0033",
        "long_name": "PayPoint plc",
        "summary": "PayPoint plc provides specialist consumer payment, transaction processing, settlement, and other services and products in the United Kingdom, Ireland, and Romania. It offers bill and general services, such as prepaid energy, bills, and cash out services; top-ups, including mobiles phones, eMoney vouchers, prepaid debit cards, and lottery tickets; and retail services comprising ATM, card payments, parcels, money transfer, SIMs, EPoS, and receipt advertising. The company also provides MultiPay, a payment solution; and PayPoint One retail terminal. It serves consumers, convenience retailers, and business and public sectors. The company was founded in 1996 and is headquartered in Welwyn Garden City, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Welwyn Garden City"
    },
    "PAY.L": {
        "short_name": "PAYPOINT PLC ORD 1/3P",
        "long_name": "PayPoint plc",
        "summary": "PayPoint plc provides specialist consumer payment, transaction processing, settlement, and other services and products in the United Kingdom, Ireland, and Romania. It offers bill and general services, such as prepaid energy, bills, and cash out services; top-ups, including mobiles phones, eMoney vouchers, prepaid debit cards, and lottery tickets; and retail services comprising ATM, card payments, parcels, money transfer, SIMs, EPoS, and receipt advertising. The company also provides MultiPay, a payment solution; and PayPoint One retail terminal. It serves consumers, convenience retailers, and business and public sectors. The company was founded in 1996 and is headquartered in Welwyn Garden City, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Welwyn Garden City"
    },
    "PCIP.L": {
        "short_name": "PCI-PAL PLC ORD 1P",
        "long_name": "PCI-PAL PLC",
        "summary": "PCI-PAL PLC, through its subsidiaries, provides payment card industry (PCI) compliance solutions and telephony services primarily in the United Kingdom, European Union, North America, the Asia Pacific, and the Middle East. It offers data secure payment card authorizations for call center operations; and Agent Assist, a PCI compliant solution to enhance contact center customer experience. The company also provides IVR payments solution that empowers customers to make payments 24/7; legacy suite for securing archived call recordings and electronic documents; and SMS and Web chat solutions. It serves clients in utilities, leisure, financial services, retail, logistics, and public sectors, as well as business process outsourcers and not for profit organizations. The company was formerly known as IPPlus plc and changed its name to PCI-PAL PLC in October 2016. PCI-PAL PLC was incorporated in 1999 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "RCN.L": {
        "short_name": "REDCENTRIC PLC ORD 0.1P",
        "long_name": "Redcentric plc",
        "summary": "Redcentric plc provides IT managed services in the United Kingdom. It offers network services, including connectivity, software-defined wide area network, local area network, managed wide area network, secure remote access, and cloud managed wireless network services; and cloud services consisting of infrastructure as a service, hybrid cloud, colocation hosting, cloud migration, platform as a service, online data backup and recovery, and disaster recovery services. The company also provides communication services comprising IP telephony, SIP trunks, unified communications, collaboration, and call recording services; and IT security services, including network security, identity and access management, network security monitoring and analytics, application security, and distributed denial of service mitigation services. In addition, it offers managed software as a services, which includes Microsoft office 365 and virtual desktop services; and professional services, such as IT consulting, procurement and logistics, implementation, and support and maintenance services for public and private sector. The company was founded in 1997 and is headquartered in Harrogate, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Harrogate"
    },
    "SCT.L": {
        "short_name": null,
        "long_name": "Softcat plc",
        "summary": "Softcat plc primarily acts as a value-added IT reseller and IT infrastructure solutions provider in the United Kingdom. The company advices, procures, designs, implements, and manages technology, such as software licensing, workplace technology, networking, security, and cloud and datacenter for businesses and public sector organizations. It also offers asset management, business intelligence and analytics, collaboration, commodity sourcing, end user computing and mobility, and general data protection regulation solutions, as well as consulting and professional services; and sells hardware. Softcat plc was incorporated in 1987 and is headquartered in Marlow, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Marlow"
    },
    "SF5.F": {
        "short_name": "SOFTCAT PLC  LS-,0005",
        "long_name": "Softcat plc",
        "summary": "Softcat plc primarily acts as a value-added IT reseller and IT infrastructure solutions provider in the United Kingdom. The company advices, procures, designs, implements, and manages technology, such as software licensing, workplace technology, networking, security, and cloud and datacenter for businesses and public sector organizations. It also offers asset management, business intelligence and analytics, collaboration, commodity sourcing, end user computing and mobility, and general data protection regulation solutions, as well as consulting and professional services; and sells hardware. Softcat plc was incorporated in 1987 and is headquartered in Marlow, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Marlow"
    },
    "SLLN": {
        "short_name": "SEARCHLIGHT SOLUTIONS",
        "long_name": "Searchlight Solutions Ltd.",
        "summary": "Searchlight Solutions Ltd. provides training services to the insurance and financial service industries in the United Kingdom. The company offers technical skills, FCA regulatory, business skills, and financial services business consultancy and training services, as well as short intensive training courses and open workshops. It also provides training and competency support, financial services, and regulatory/compliance consultancy services, as well as in-house solutions by supplying trainers and training resources. The company offers its services through face-to-face training and e-learning solutions. It serves insurers, intermediaries, loss adjusters, and other insurance service providers. The company was founded in 1999 and is based in Leatherhead, the United Kingdom. As of July 5, 2018, Searchlight Solutions Ltd. operates as a subsidiary of Thistle Initiatives Limited.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Leatherhead"
    },
    "TD8.SG": {
        "short_name": "TRIAD GROUP PLC Registered Shar",
        "long_name": "Triad Group plc",
        "summary": "Triad Group Plc provides IT consultancy, solution, and resourcing services to the public and private sectors primarily in the United Kingdom. The company offers consulting and advisory; staffing, resourcing, and recruitment; development and engineering; software and product design; program and project delivery; and support, operations, and maintenance services. Triad Group Plc was founded in 1988 and is based in Godalming, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Godalming"
    },
    "TPX.L": {
        "short_name": "THE PANOPLY HOLDINGS PLC ORD 1P",
        "long_name": "The Panoply Holdings plc",
        "summary": "The Panoply Holdings plc, together with its subsidiaries, provides digital native technology services in the United Kingdom, Bulgaria, and Norway. The company provides service and UX design, digital design and build, content and campaign management, and user and audience research sevices. It also offers XaaS services, such as cloud management, talent as a service, agile management, and distributed software development. In addition, the company provides automation services comprising RPA implementation, chatbots and voice interfaces, and Devops. Further, it offers analytics, reporting and BI machine, API design and development, business and data insight services. Additionally, the company provides strategic and management consultancy, digital service consultancy, and software development services. It serves commercial, government, and non-government sectors. The panoply Holding plc was founded in 2016 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "TRD.L": {
        "short_name": "TRIAD GROUP PLC ORD 1P",
        "long_name": "Triad Group plc",
        "summary": "Triad Group Plc provides IT consultancy, solution, and resourcing services to the public and private sectors primarily in the United Kingdom. The company offers consulting and advisory; staffing, resourcing, and recruitment; development and engineering; software and product design; program and project delivery; and support, operations, and maintenance services. Triad Group Plc was founded in 1988 and is based in Godalming, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Godalming"
    },
    "TZ5A.F": {
        "short_name": "ECKOH PLC  LS-,0025",
        "long_name": "Eckoh plc",
        "summary": "Eckoh plc, together with its subsidiaries, provides secure payment products and customer contact solutions for customer contact centers in the United Kingdom, the United States, and internationally. It offers customer engagement solutions, such as chatbots, email management, knowledge base, messaging, social agent, and Web chat; and interactive voice response (IVR) and speech solutions, including identification and verification, IVR self-service, natural language, and visual IVR. The company also provides secure payment solutions, which include agent assisted, automated payment, e-wallet, Web chat, and remote agent payments; and payment card industry compliance solutions. In addition, it offers contact center solutions, which include agent desktop, call recording, digital transformation, contact center, portal, and number management solutions; and third party support services; agent desktop, call recording, digital transformation, contact center, portal, and number management solutions. Further, the company provides customer engagement, support, and cloud-based software solutions. It serves clients in the business and financial services, housing, insurance, public services, retail, telecoms, and utilities, as well as travel transport and leisure industries. Eckoh plc was incorporated in 1997 and is headquartered in Hemel Hempstead, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Hemel Hempstead"
    }
}