{
    "2G5.F": {
        "short_name": "GOCO GROUP PLC  LS-,0002",
        "long_name": "GoCo Group plc",
        "summary": "GoCo Group plc operates Internet-based price comparison Websites for financial and non-financial products in the United Kingdom. The company's Gocompare.com Website enables people to compare the costs and features of various insurance policies, financial products, and energy tariffs. It also provides weflip, an automated savings service; Look After My Bills, an automated energy savings service; MyVoucherCodes, a discount voucher website; and Energylinx, a domestic and business energy comparison and switching service. The company was formerly known as GoCompare.com Group plc and changed its name to GoCo Group plc in May 2019. GoCo Group plc was founded in 2006 and is headquartered in Newport, the United Kingdom.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Newport"
    },
    "3JDA.F": {
        "short_name": "RIGHTMOVE PLC  LS -,001",
        "long_name": "Rightmove plc",
        "summary": "Rightmove plc operates property portal in the United Kingdom. The company operates through Agency, New Homes, and Other segments. The Agency segment offers resale and lettings property advertising services on its platforms. The New Homes segment provides property advertising services to new home developers and housing associations on its platforms. The Other segment offers overseas and commercial property advertising services; and non-property advertising services that include third party advertising and data services. The company serves estate agents, lettings agents, and new homes developers. Rightmove plc was founded in 2000 and is based in Milton Keynes, the United Kingdom.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Milton Keynes"
    },
    "ATDRY": {
        "short_name": "AUTO TRADER GROUP PLC",
        "long_name": "Auto Trader Group plc",
        "summary": "Auto Trader Group plc operates in the digital automotive marketplace in the United Kingdom and Ireland. It offers its products to retailers, home traders, and logistics firms; vehicle advertisement on its websites for private sellers, as well as insurance and loan financing products to consumers; and display advertising on its websites for manufacturers and their advertising agencies. The company was founded in 1977 and is headquartered in Manchester, the United Kingdom.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Manchester"
    },
    "BBSN.L": {
        "short_name": "BRAVE BISON GROUP PLC ORD 0.1P",
        "long_name": "Brave Bison Group plc",
        "summary": "Brave Bison Group plc, a social video company, engages in the creation, distribution, and monetization of online video content in Europe, the Asia-Pacific, and internationally. The company provides an online video distribution and marketing network. It helps content owners, operators, brands, publishers, and advertisers to build and engage online audiences; and enables its clients to commercialize their content to audiences on various online video platforms, such as YouTube, Facebook, and Snapchat. The company was formerly known as Rightster Group Plc and changed its name to Brave Bison Group Plc in May 2016. Brave Bison Group plc was founded in 2011 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "CNIC.L": {
        "short_name": "CENTRALNIC GROUP PLC ORD 0.1P",
        "long_name": "CentralNic Group Plc",
        "summary": "CentralNic Group plc, a domain name service provider, operates as an owner and registrant of a portfolio of domain names worldwide. It operates through Reseller, Small Business, and Corporate segments. The Reseller segment distributes domain names and provides consultancy services to retailers. The Small Business provides domain names and ancillary services to end users. The Corporate segment offers technical and consultancy services to corporate clients; licenses its registry management platform; and provides domain names and monitoring services to protect brands online. The company was founded in 1996 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "DBOX.L": {
        "short_name": "DIGITALBOX PLC ORD 1P",
        "long_name": "Digitalbox plc",
        "summary": "Digitalbox Publishing Ltd creates digital marketing campaigns. The company also publishes Entertainment Daily, an entertainment news web portal. Digitalbox Publishing Ltd was founded in 2015 and is headquartered in Bath, United Kingdom. Digitalbox Publishing Ltd operates as a subsidiary of Digitalbox Publishing (Holdings) Limited.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Bath"
    },
    "FRFR": {
        "short_name": "FRITZY TECH INC",
        "long_name": "Fritzy Tech Inc.",
        "summary": "Fritzy Tech Inc. does not have significant operations. It intends to launch Zshoppers.com and homekout.com brands. The company was formerly known as First Priority Tax Solutions Inc. and changed its name to Fritzy Tech Inc. in December 2019. The company was founded in 2014 and is based in London, the United Kingdom. Fritzy Tech Inc. is a subsidiary of Silverlight International Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "GOCO.L": {
        "short_name": "GOCO GROUP PLC ORD GBP0.0002",
        "long_name": "GoCo Group plc",
        "summary": "GoCo Group plc operates Internet-based price comparison Websites for financial and non-financial products in the United Kingdom. The company's Gocompare.com Website enables people to compare the costs and features of various insurance policies, financial products, and energy tariffs. It also provides weflip, an automated savings service; Look After My Bills, an automated energy savings service; MyVoucherCodes, a discount voucher website; and Energylinx, a domestic and business energy comparison and switching service. The company was formerly known as GoCompare.com Group plc and changed its name to GoCo Group plc in May 2019. GoCo Group plc was founded in 2006 and is headquartered in Newport, the United Kingdom.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Newport"
    },
    "IME.L": {
        "short_name": "IMMEDIA GROUP PLC ORD 10P",
        "long_name": "Immedia Group Plc",
        "summary": "Immedia Group Plc, together with its subsidiaries, engages in the marketing and communication service business through the provision of interactive digital channels products and services using music, radio, and screen-based media primarily in the United Kingdom. It operates through two segments, Production and Operations. The company's Production segment creates content that include audio based live and recorded radio, music, advertising, and branding; and video based video, music advertising and branding, digital Web and application designs, and digital solutions for audio visual, 3D, virtual reality, and augmented reality content. Its Operations segment engages in the supply, installation, and sale/hire of equipment that delivers content to customers that include broadband and satellite technologies, as well as maintenance of equipment. The company was formerly known as Immedia Broadcasting Plc and changed its name to Immedia Group Plc in September 2008. Immedia Group Plc was founded in 2000 and is based in Newbury, the United Kingdom.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Newbury"
    },
    "IVME": {
        "short_name": "IN VERITAS MEDICAL DIAGNOSTICS ",
        "long_name": "In Veritas Medical Diagnostics, Inc.",
        "summary": "In Veritas Medical Diagnostics, Inc., a development stage company, engages in the research and development of medical devices with `near-patient' testing applications. Its primary product includes prothrombin monitor, which is used for the measurement of coagulation of blood in patients at risk of heart disease and stroke. The company's other products under development include predictor of labor onset, a consumer device for maternity planning; biomarker monitor for the measurement of a number of biomarkers, including heart attack, HIV, cholesterol, and cancer; blood glucose monitor, a noninvasive glucose concentration continuous bulk measuring device measurement; digital scanning machine, a noninvasive alternative to 2D X-ray scanning; osteoporosis detection and monitoring device, an instant display of bonemineral density for osteoporosis patients; and hand held digital strip reader for immunoassay applications. It was formerly known as In Vivo Medical Diagnostics, Inc. and changed its name to In Veritas Medical Diagnostics, Inc. in 2005. The company is based in Inverness, the United Kingdom.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Inverness"
    },
    "KOO.L": {
        "short_name": "KOOTH PLC ORD 5P",
        "long_name": "Kooth plc",
        "summary": "Kooth plc provides digital mental health services for children and young people in the United Kingdom. It operates an online platform that offers various therapeutic tools and interventions, including self-helping tools and content; and a community for peer-to-peer support, as well as provides professional counselling services. The company was founded in 2001 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "MONY.L": {
        "short_name": "MONEYSUPERMARKET.COM GROUP PLC ",
        "long_name": "Moneysupermarket.com Group PLC",
        "summary": "Moneysupermarket.com Group PLC, together with its subsidiaries, provides price comparison and editorial-based websites in the United Kingdom. The company operates through Insurance, Money, Home Services, and Other segments. It offers online and app-based tools to save money on their household bills under the MoneySuperMarket brand; and price comparison for package holidays, car rental, flights, hotels, and various travel costs, including travel insurance, transfers, and airport parking under the TravelSupermarket brand, as well as operates a consumer finance website under the MoneySavingExpert brand, and price comparison platform under the Decision Tech brand. The company also provides financial intermediary services. Moneysupermarket.com Group PLC was founded in 1993 and is headquartered in Chester, the United Kingdom.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Chester"
    },
    "OTMP.L": {
        "short_name": "ONTHEMARKET PLC ORD 0.2P",
        "long_name": "OnTheMarket plc",
        "summary": "OnTheMarket plc provides property search services for buyers, sellers, landlords, and tenants in the United Kingdom. It owns and operates online residential property portal on OnTheMarket.com that offers property for sale and rent, and finds agents. The company was founded in 2015 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "RLXB.F": {
        "short_name": "DIGITALBOX PLC  LS-,01",
        "long_name": "Digitalbox plc",
        "summary": "Digitalbox Publishing Ltd creates digital marketing campaigns. The company also publishes Entertainment Daily, an entertainment news web portal. Digitalbox Publishing Ltd was founded in 2015 and is headquartered in Bath, United Kingdom. Digitalbox Publishing Ltd operates as a subsidiary of Digitalbox Publishing (Holdings) Limited.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Bath"
    },
    "RMV.L": {
        "short_name": "RIGHTMOVE PLC ORD 0.1P",
        "long_name": "Rightmove plc",
        "summary": "Rightmove plc operates property portal in the United Kingdom. The company operates through Agency, New Homes, and Other segments. The Agency segment offers resale and lettings property advertising services on its platforms. The New Homes segment provides property advertising services to new home developers and housing associations on its platforms. The Other segment offers overseas and commercial property advertising services; and non-property advertising services that include third party advertising and data services. The company serves estate agents, lettings agents, and new homes developers. Rightmove plc was founded in 2000 and is based in Milton Keynes, the United Kingdom.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Milton Keynes"
    },
    "RTMVF": {
        "short_name": "RIGHTMOVE",
        "long_name": "Rightmove plc",
        "summary": "Rightmove plc operates property portal in the United Kingdom. The company operates through Agency, New Homes, and Other segments. The Agency segment offers resale and lettings property advertising services on its platforms. The New Homes segment provides property advertising services to new home developers and housing associations on its platforms. The Other segment offers overseas and commercial property advertising services; and non-property advertising services that include third party advertising and data services. The company serves estate agents, lettings agents, and new homes developers. Rightmove plc was founded in 2000 and is based in Milton Keynes, the United Kingdom.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Milton Keynes"
    },
    "RTMVY": {
        "short_name": "RIGHTMOVE",
        "long_name": "Rightmove plc",
        "summary": "Rightmove plc operates property portal in the United Kingdom. The company operates through Agency, New Homes, and Other segments. The Agency segment offers resale and lettings property advertising services on its platforms. The New Homes segment provides property advertising services to new home developers and housing associations on its platforms. The Other segment offers overseas and commercial property advertising services; and non-property advertising services that include third party advertising and data services. The company serves estate agents, lettings agents, and new homes developers. Rightmove plc was founded in 2000 and is based in Milton Keynes, the United Kingdom.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Milton Keynes"
    },
    "ULS.L": {
        "short_name": "ULS TECHNOLOGY PLC ORD 0.4P",
        "long_name": "ULS Technology plc",
        "summary": "ULS Technology plc, through its subsidiaries, engages in the development and hosting of internet based software applications for legal and property services businesses in the United Kingdom. It provides software solutions that support online legal comparison services; and risk management and compliance consultancy services to solicitors and licensed conveyancers. The company's solutions also cover mortgage lenders, builders and developers, intermediaries, and estate agents. It primarily provides its services through white-labels to mortgage brokers, banks, building societies, and price comparison websites. ULS Technology plc was founded in 2003 and is based in Thame, the United Kingdom.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Thame"
    },
    "UZJ1.F": {
        "short_name": "7DIGITAL GRP PLC LS-,0001",
        "long_name": "7digital Group plc",
        "summary": "7digital Group plc operates as a digital music technology company worldwide. The company operates through three divisions: Licensing, Content, and Creative. The company's Licensing division engages in the creation of software solutions for managing and delivering digital content; and the provision of an API based platform for third parties to create digital music, as well as provides client side software applications. Its Content division is involved in the sale of digital music through its 7digital.com licensed digital music store. Its Creative division creates audio and video programming for broadcasters. The company also provides radio production and music curation services; music streaming and download services; and HR services, as well as consultation services on business strategy or product planning for on-demand streaming, radio style streaming, premium downloads and others. It serves a range of customers, including consumer brands, mobile carriers, broadcasters, automotive systems, record labels, and retailers. 7digital Group plc was founded in 2004 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    }
}