{
  "1H91.F": {
    "city": "Cambridge",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "GetBusy plc",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "GETBUSY PLC NEW. LS-,0015",
    "state": null,
    "summary": "GetBusy plc develops and sells document and task management software products in the United Kingdom, the United States, Australia, and New Zealand. The company offers SmartVault, a cloud document management platform and client portal for small and medium sized businesses; Virtual Cabinet, a desktop document management, workflow, and cloud portal tool for medium to large professional service businesses; and GetBusy, a team and client task management, and signatures application. GetBusy plc was incorporated in 2017 and is based in Cambridge, the United Kingdom.",
    "website": "http://www.getbusy.com",
    "zipcode": "CB22 3FT"
  },
  "1KG.F": {
    "city": "Belfast",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Kainos Group plc",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "KAINOS GROUP PLC  LS-,005",
    "state": null,
    "summary": "Kainos Group plc provides digital technology services and platforms for public and private organizations in the United Kingdom, the Republic of Ireland, the United States, and internationally. It operates through two divisions, Digital Services and Workday Practice. The Digital Services division delivers customized online digital solutions, including digital transformation, artificial intelligence, data, cloud, design, consulting, and internet of things principally for public sector, commercial sector, and healthcare organizations. This division also offers Evolve, a cloud-managed electronic medical record service for healthcare organizations. The Workday Practice division provides consulting, project management, integration, and post deployment services for Workday's software suite, which includes cloud-based software for human capital management and financial management that enables enterprises to organize their staff and to support financial reporting requirements. This division also offers Smart, a cloud-based SaaS solution that allows Workday customers to automatically verify their Workday configuration during implementation and in live operations. The company also engages in the property business. Kainos Group plc was founded in 1986 and is headquartered in Belfast, the United Kingdom.",
    "website": "http://www.kainos.com",
    "zipcode": "BT7 1NT"
  },
  "3DO.F": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "dotdigital Group Plc",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "DOTDIGITAL GR.PLC LS-,005",
    "state": null,
    "summary": "dotdigital Group Plc provides intuitive software as a service (SaaS) and managed services to digital marketing professionals worldwide. The company offers Engagement Cloud, a SaaS-based omni-channel marketing automation platform that enables companies to create, test, and send data-driven automated campaigns and communications across channels, such as email, SMS, social, push, etc. dotdigital Group Plc was founded in 1999 and is headquartered in London, the United Kingdom.",
    "website": "http://www.dotdigitalgroup.com",
    "zipcode": "SE1 9BG"
  },
  "3L8.F": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "essensys plc",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ESSENSYS PLC  LS-,0025",
    "state": null,
    "summary": "essensys plc provides software-as-a-service platforms and on-demand cloud services to the workspace industry in the United Kingdom and the United States. The company's products include Connect, a co-working software platform for multi-site operators that provide, manage, and monitor mission-critical infrastructure services in real-time; and Operate, an end-to-end solution for multi-site workspace operators for managing day-to-day co-working operations. It serves multi-site flexible workspace providers, commercial real estate providers, and multi-site landlords. The company was founded in 2006 and is based in London, the United Kingdom.",
    "website": "http://www.essensys.tech",
    "zipcode": "E1 8FA"
  },
  "4A91.F": {
    "city": "Cambridge",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "AVEVA Group plc",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "AVEVA GRP  LS-,03555",
    "state": null,
    "summary": "AVEVA Group plc, through its subsidiaries, provides engineering and industrial software solutions in the Asia Pacific, Europe, the Middle East, Africa, and the Americas. The company offers engineering, procurement, and construction; asset performance; monitoring and control; planning and scheduling; and operation and optimization industrial software solutions. It also provides digital transformation solutions covering artificial intelligence, cloud, digital twin, edge, extended reality, and Industrial Internet of Things products; and customer support and training services. The company serves customers in the chemicals, food and beverage, consumer packaged goods, infrastructure, life sciences, marine, mining, oil and gas, power and utilities, pulp and paper, steel fabrication, and water and wastewater industries. AVEVA Group plc has strategic partnerships with DORIS Group and Schneider Electric to deliver digital twin technology for the upstream oil and gas markets. The company was founded in 1967 and is headquartered in Cambridge, the United Kingdom. AVEVA Group plc is a subsidiary of Schneider Electric S.E.",
    "website": "http://www.aveva.com",
    "zipcode": "CB3 0HB"
  },
  "5H3.F": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Eleco Plc",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ELECO PLC  LS-,01",
    "state": null,
    "summary": "Eleco Plc provides software and related services in the United Kingdom, Scandinavia, Germany, the rest of Europe, the United States, and internationally. The company offers CAD architecture software under the Arcon Evo, Staircon, o2c names; construction cost estimation software under the Bidcon name; building information management solution under the IconSystem name; interior room configuration software under the Interiorstudio name; product information management and digital asset management solutions under the MarketingManager name; and Materialo, a flooring visualizer software. It also provides project management software under the Powerproject, Memmo, and Project Viewer names; ShireSystem, a combined CMMS and CAFM software; project planning software under the Easyplan name; Framing, a design tool for timber frame and floor construction; and Tilos, a time chainage software for time-location planning. The company was formerly known as Elecosoft plc and changed its name to Eleco Plc in July 2020. Eleco Plc was founded in 1895 and is headquartered in London, the United Kingdom.",
    "website": "http://www.elecosoft.com",
    "zipcode": "EC2A 4HB"
  },
  "5H9.F": {
    "city": "Sunbury-on-Thames",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "D4t4 Solutions Plc",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "D4T4 SOLUTIONS PLC LS-,02",
    "state": null,
    "summary": "D4t4 Solutions Plc provides digital data collection, customer data management, and analytics solutions. It offers Celebrus, a customer data platform software product that captures customer data from various digital channels to deliver artificial intelligence, customer insight and analytics, personalization, decisioning, and customer relationship management. The company also provides data management services using public and private cloud infrastructure. In addition, it offers performant platforms for critical business, analytics, compliance, risk, marketing, and artificial intelligence applications. The company serves finance, consumer, and other sectors in the United Kingdom, rest of Europe, the United States, and internationally. The company was formerly known as IS Solutions plc and changed its name to D4t4 Solutions Plc in July 2016. D4t4 Solutions Plc was founded in 1985 and is headquartered in Sunbury-on-Thames, the United Kingdom.",
    "website": "http://www.d4t4solutions.com",
    "zipcode": "TW16 7EF"
  },
  "5IG.F": {
    "city": "Ruddington",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Ideagen plc",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "IDEAGEN PLC  LS -,01",
    "state": null,
    "summary": "Ideagen plc develops and sells information management software in the United Kingdom, rest of Europe, North America, the Middle East, and internationally. Its governance, risk, and compliance (GRC) solutions include Q-Pulse QMS, a quality management software; Q-Pulse PM, a product management software; Q-Pulse Law, an EHS legal compliance software; Q-Pulse WorkRite, a health and safety management system; Pentana Audit, an audit automation software; Pentana Disclose, a financial disclosure checklist software; Pentana Compliance, an accountability and competency compliance software; and Pentana Risk, a cloud-based performance and risk management software. The company's GRC solutions also comprise Coruson, an enterprise cloud-based safety management software; PleaseReview, a document review, co-authoring, and redaction software; and Ideagen Academy, a cloud-based E-learning solution. It serves aerospace and defense, accounting, finance and banking, construction, aviation, energy, food and drink, healthcare, life science, and manufacturing industries. The company was formerly known as Datum International Plc and changed its name to Ideagen plc in July 2011. Ideagen plc was founded in 1993 and is headquartered in Ruddington, the United Kingdom.",
    "website": "http://www.ideagen.com",
    "zipcode": "NG11 6JS"
  },
  "5KX.F": {
    "city": "Tamworth",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Dev Clever Holdings Plc",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "DEV CLEVER HLDGS  LS,-01",
    "state": null,
    "summary": "Dev Clever Holdings Plc develops and distributes immersive software products in the United Kingdom, rest of Europe, the Asia Pacific, and the United States. Its primary products are Launchyourcareer.com and VICTAR VR, which are virtual reality careers guidance platforms; and Engage, a gamification engine. The company also develops instant win games, which include Spin to Win and Scratch Card games; skill based games; augmented reality filters, such as Snapchat world lenses and Facebook facemasks; Win & Reward platform, a loyalty based program; self-activating POS kit, a digital platform to track and monitor the distribution of individual POS kits and measure the success rate of activations by venues; and augmented reality, virtual reality, themed/seasonal games, and reward games. Dev Clever Holdings Plc was incorporated in 2018 and is based in Tamworth, the United Kingdom.",
    "website": "http://devcleverholdingsplc.com",
    "zipcode": "B78 3HL"
  },
  "7IU.F": {
    "city": "Portsmouth",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Rosslyn Data Technologies plc",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "ROSSLYN DATA TECHN.LS-005",
    "state": null,
    "summary": "Rosslyn Data Technologies plc engages in the development and provision of data analytics software, data capture, data mining, and workflow management in the United Kingdom and the United States. It offers RAPid, a cloud data automation platform that automates the collection, aggregation, and organization of data and documents. The company provides procurement solutions comprising procurement analytics, supplier information management, contract management, and supplier performance management; and customer experience solutions, such as case management, correspondence management, and customer analytics. It also offers master data management, data extraction, data cleansing, and data enrichment services. Rosslyn Data Technologies plc was founded in 2005 and is based in Portsmouth, the United Kingdom.",
    "website": "http://www.rosslyndatatech.com",
    "zipcode": "PO6 3EN"
  },
  "7ZB.F": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Pelatro Plc",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "PELATRO PLC LS-,025",
    "state": null,
    "summary": "Pelatro Plc provides information management software and related services to providers of telecommunication services. The company offers mViva customer engagement hub, a suite of solutions designed for customer value management teams to manage the campaign life-cycle of subscribers and retailers. Its mVivia suite offers solutions for contextual campaign management, loyalty management, unified communication management, and data monetization. The company also provides software maintenance and support services; and consultancy services and/or training relating to the use of the software. It serves in the Caribbean, Central Asia, Eastern Europe, North Africa, South Asia, and South East Asia. Pelatro Plc was founded in 2013 and is headquartered in London, the United Kingdom.",
    "website": "http://www.pelatro.com",
    "zipcode": "EC4N 4SA"
  },
  "8T5.F": {
    "city": "Oxford",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Tekcapital plc",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "TEKCAPITAL PLC  LS -,004",
    "state": null,
    "summary": "Tekcapital plc, through its subsidiaries, provides a range of technology transfer services to universities and corporations in the United Kingdom and the United States. The company operates through two segment; Professional Services and Licensing and Investment Activities. It engages in the provision of recruitment services; and reports and services to locate and transfer technologies to customers, as well as offers R&D tax relief credits, management services, and intellectual property services to third party customers. The company involves in acquiring licenses for technologies, and portfolio company investment and development. Tekcapital plc was incorporated in 2014 and is headquartered in Oxford, the United Kingdom.",
    "website": "http://www.tekcapital.com",
    "zipcode": "OX4 4GP"
  },
  "95D.F": {
    "city": "Reading",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "ActiveOps Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ACTIVEOPS PLC LS -,001",
    "state": null,
    "summary": "ActiveOps Limited provides management process automation software solutions worldwide. It offers Workware+ solution, including WorkiQ, an employee productivity monitoring solution to capture desktop activity for all employees working in the office or remote; and ControliQ, a cloud-based employee performance management solution. The company also provides OpsIndex to score and benchmark key metrics based on industry sector and regional trends worldwide; and Active Operation Management, an operations methodology and framework for effective back-office management. It serves business process outsourcing companies, banking, insurance, and other sectors. The company was formerly known as ACTIVE OPERATIONS MANAGEMENT INTERNATIONAL LIMITED and changed its name to ActiveOps Limited in May, 2015. ActiveOps Limited was incorporated in 1995 and is based in Reading, United Kingdom.",
    "website": "http://www.activeops.com",
    "zipcode": "RG1 1AR"
  },
  "9NY.F": {
    "city": "Leatherhead",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Bytes Technology Group PLC",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "BYTES TECH.GRP  LS -,01",
    "state": null,
    "summary": "Bytes Technology Group plc provides software, hardware, and cloud services in the United Kingdom, Europe, and internationally. It offers security, storage, and virtualization solutions, as well as licensing, digital transformation, and managed services to the public and private sectors under the Bytes Software Services and Phoenix brands. The company was founded in 1982 and is headquartered in Leatherhead, the United Kingdom.",
    "website": "http://www.bytes.co.uk",
    "zipcode": "KT22 7TW"
  },
  "A9F.F": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Alfa Financial Software Holdings PLC",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "ALFA FIN.SOFTW.HL.LS-,001",
    "state": null,
    "summary": "Alfa Financial Software Holdings PLC, through its subsidiaries, provides software solutions and consultancy services to the asset finance industry in the United Kingdom, the United States, rest of Europe, and internationally. It provides Alfa Systems, a software platform to administer retail and corporate businesses from point of sale through originations to contract management and remarketing; and Alfa Digital platform and apps suite, an omnichannel digital solution that delivers concepts, such as self-serve, customer onboarding, and mobility, as well as point of sale functionality across various devices. The company also offers professional services, such as business process consultancy, UI design, cloud hosting, project management, and training consultancy. It primarily serves equipment and automotive finance markets. The company was founded in 1990 and is headquartered in London, the United Kingdom. Alfa Financial Software Holdings PLC is a subsidiary of CHP Software and Consulting Limited.",
    "website": "http://www.alfasystems.com",
    "zipcode": "EC2Y 9DT"
  },
  "ACC.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Access Intelligence Plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "ACCESS INTELLIGENCE PLC ORD 5P",
    "state": null,
    "summary": "Access Intelligence Plc, together with its subsidiaries, provides software as a service products to blue-chip enterprises, communications agencies, public sector bodies, and not-for-profit organizations in the United Kingdom, North America, rest of Europe, and internationally. The company's Vuelio branded software offers communications services combining media, political, and social media insights with monitoring and analysis tools for public relations, public affairs, stakeholder engagement, and influencer marketing. It also provides ResponseSource, a network that connects media and influencers to the required resources; and Pulsar, an audience intelligence and social listening platform that enables clients to understand and draw insight from online conversations across a fast-evolving set of global social media platforms, traditional media, and data sources. Access Intelligence Plc was incorporated in 2003 and is headquartered in London, the United Kingdom.",
    "website": "http://www.accessintelligence.com",
    "zipcode": "EC1N 8AW"
  },
  "ACSO.L": {
    "city": "Twyford",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "accesso Technology Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "ACCESSO TECHNOLOGY GROUP PLC OR",
    "state": null,
    "summary": "accesso Technology Group plc, together with its subsidiaries, develops technology solutions for the attractions and leisure industry in the United Kingdom, other European countries, Australia, the South Pacific, the United States, Canada, and Central and South America. The company operates through Ticketing and Distribution, and Guest Experience segments. It offers ticketing solutions for arenas and sports, fairs and festivals, performing arts, ski, theme parks, tours and attractions, water parks, and zoos and aquariums, as well as cultural facilities. The company offers various solutions, such as accesso LoQueue, a virtual queuing solution; the experience engine, an experience management platform; and accesso Passport ticketing suite, which provides season pass, group tickets, meal vouchers, and other services. It also provides accesso Siriusware, which offers software solutions comprising ticketing and admissions, memberships, reservations, resource scheduling, retail, food service, gift cards, kiosks, and ecommerce; and accesso ShoWare ticketing solutions for box office, kiosk, online, mobile, call center, and social media sales. The company was formerly known as Lo-Q plc and changed its name to accesso Technology Group plc in November 2013. accesso Technology Group plc was incorporated in 2000 and is based in Twyford, the United Kingdom.",
    "website": "http://www.accesso.com",
    "zipcode": "RG10 9NN"
  },
  "ALFA.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Alfa Financial Software Holdings PLC",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "ALFA FINANCIAL SOFTWARE HOLDING",
    "state": null,
    "summary": "Alfa Financial Software Holdings PLC, through its subsidiaries, provides software solutions and consultancy services to the asset finance industry in the United Kingdom, the United States, rest of Europe, and internationally. It provides Alfa Systems, a software platform to administer retail and corporate businesses from point of sale through originations to contract management and remarketing; and Alfa Digital platform and apps suite, an omnichannel digital solution that delivers concepts, such as self-serve, customer onboarding, and mobility, as well as point of sale functionality across various devices. The company also offers professional services, such as business process consultancy, UI design, cloud hosting, project management, and training consultancy. It primarily serves equipment and automotive finance markets. The company was founded in 1990 and is headquartered in London, the United Kingdom. Alfa Financial Software Holdings PLC is a subsidiary of CHP Software and Consulting Limited.",
    "website": "http://www.alfasystems.com",
    "zipcode": "EC2Y 9DT"
  },
  "ALSIM.PA": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "PAR",
    "industry": "Software - Application",
    "long_name": "Klimvest PLC",
    "market": "fr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "KLIMVEST",
    "state": null,
    "summary": "Klimvest PLC does not have significant operations. It was previously engaged in the development and distribution of productivity software for training, support, and translation of or on ERP applications. The company was formerly known as Assima PLC and changed its name to Klimvest PLC in January 2020. Klimvest PLC was founded in 2002 and is based in London, the United Kingdom.",
    "website": "http://www.klimvest.com",
    "zipcode": "EC3N 1LJ"
  },
  "ALT.L": {
    "city": "Sheffield",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Altitude Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "ALTITUDE GROUP PLC ORD 0.4P",
    "state": null,
    "summary": "Altitude Group plc provides technology and information solutions in North America and the United Kingdom. The company offers patented technology platform to its network with a built-in supply chain, as well as combines an e-commerce trading platform with a cloud-based CRM and order management system for business intelligence requirements; e-commerce website solutions with in-built patented online designer and pre-loaded product databases; patented online design solutions; and virtual sample services that allow personalized design on a product with imprint technique. It also provides software services, events and exhibitions, catalogues, artwork services, marketing and business administration services to distributors. The company was incorporated in 2004 and is headquartered in Sheffield, the United Kingdom.",
    "website": "http://www.altitudeplc.com",
    "zipcode": "S1 4QZ"
  },
  "AOM.L": {
    "city": "Reading",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "ActiveOps Limited",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "ACTIVEOPS PLC ORD 0.1P",
    "state": null,
    "summary": "ActiveOps Limited provides management process automation software solutions worldwide. It offers Workware+ solution, including WorkiQ, an employee productivity monitoring solution to capture desktop activity for all employees working in the office or remote; and ControliQ, a cloud-based employee performance management solution. The company also provides OpsIndex to score and benchmark key metrics based on industry sector and regional trends worldwide; and Active Operation Management, an operations methodology and framework for effective back-office management. It serves business process outsourcing companies, banking, insurance, and other sectors. The company was formerly known as ACTIVE OPERATIONS MANAGEMENT INTERNATIONAL LIMITED and changed its name to ActiveOps Limited in May, 2015. ActiveOps Limited was incorporated in 1995 and is based in Reading, United Kingdom.",
    "website": "http://www.activeops.com",
    "zipcode": "RG1 1AR"
  },
  "APTD.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Aptitude Software Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "APTITUDE SOFTWARE GROUP PLC ORD",
    "state": null,
    "summary": "Aptitude Software Group plc, together with its subsidiaries, develops, implements, and supports business critical software and related services in the United Kingdom and internationally. It provides software applications, which include Aptitude Accounting Hub, a finance software to centralize and automate enterprise finance, accounting, and reporting activities; Aptitude Revenue Recognition Engine, a specialist financial application, which connects existing general ledgers and source systems to empower enterprises; Aptitude IFRS 17 Solution, a solution to comply with IFRS 17 insurance standards; Aptitude RevStream, a cloud-based revenue recognition software; Aptitude Allocation Engine that controls cost allocations and customer profitability; and Lease Accounting Engine, a lease accounting software. The company also offers Aptitude Calculate, a calculation and rules engine; and Aptitude IFRS 17 Comply, a software solution that delivers compliance with flexible deployment options, including SaaS, private cloud, and on-premise deployment models. It licenses its software; and provides software maintenance/support, and software subscriptions for its cloud-based offerings, as well as implementation and solution management services. Aptitude Software Group plc primarily serves organizations with complex financial data and technology landscapes. The company was formerly known as Microgen plc and changed its name to Aptitude Software Group plc in April 2019. Aptitude Software Group plc was incorporated in 1981 and is headquartered in London, the United Kingdom.",
    "website": "http://www.aptitudesoftware.com",
    "zipcode": "EC4V 4BJ"
  },
  "ARC.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Arcontech Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "ARCONTECH GROUP PLC ORD GBP0.12",
    "state": null,
    "summary": "Arcontech Group Plc, together with its subsidiaries, develops and sells proprietary software in the United Kingdom, rest of Europe, Africa, North America, Australia, and the Asia Pacific. Its products include CityVision, a market data platform for real-time data reception, transformation, and publishing; CityVision Multi Vendor Contribution System, which enables the user to contribute data automatically and simultaneously to various destinations; and CityVision Cache, a real-time data repository. The company also offers Excelerator, a vendor independent system that enables real time reception and publishing of market data, as well as provides flexibility and control to manipulate data from various sources through Excel's mathematical and display features. In addition, it provides CityVision Relay, a real-time data distribution engine; CityVision Symbol Mapper, a real-time data conversion system that allows market data managers to separate data integration from the data source; and CityVision API that develops real-time market data applications, as well as offers computer consultancy services. The company was formerly known as Knowledge Technology Solutions PLC and changed its name to Arcontech Group plc in February 2009. Arcontech Group plc was founded in 1979 and is based in London, the United Kingdom.",
    "website": "http://www.arcontech.com",
    "zipcode": "EC2A 4JU"
  },
  "ATG.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Auction Technology Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "AUCTION TECHNOLOGY GROUP PLC OR",
    "state": null,
    "summary": "Auction Technology Group plc operates marketplaces and a proprietary auction platform in the United Kingdom, the United States, Austria, Germany, and Switzerland. The company operates through Arts and Antiques, Industrial and Commercial, and Content segments. It offers watches, jewellery, furniture, fine art, decorative art, classic cars, collectables, and fashion products; used equipment, commercial vehicles, and machineries for used in laboratories and pharmaceuticals, warehousing, mining and utilities, oil and gas, firearms, real estate, construction, agriculture, plastic, metal, wood, chemical, food and beverage, and other manufacturing industries; and technology and electronics, homeware, and furniture products. The company operates marketplaces, such as Proxibid.com, BidSpotter.com, the-saleroom.com, lot-tissimo.com, i-bidder.com, Wavebid.com, and BidSpotter.co.uk. It serves curated online auctions, connecting bidders, and auctioneers to arts and antiques, industrial and commercial, and consumer surplus and returns industries. The company was founded in 1971 and is headquartered in London, the United Kingdom.",
    "website": "http://www.auctiontechnologygroup.com",
    "zipcode": "SE1 0HR"
  },
  "ATQT.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "ATTRAQT Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "ATTRAQT GROUP PLC ORD 1P",
    "state": null,
    "summary": "ATTRAQT Group plc, together with its subsidiaries, develops and provides e-commerce site search, merchandising, and product recommendation technology in the United Kingdom, France, the Netherlands, other European countries, and internationally. It offers Software as a Service solutions in the areas of search, navigation, recommendations, personalization, merchandising, and internationalization. The company also provides retail insights and expertise, technical expertise and project management, and customer success and customer support services. It offers solutions to specialist retailers, including fashion, footwear, homeware, health and beauty, grocery, electronics, B2B, and sports and outdoor customers. The company was formerly known as ATTRAQT Group Limited and changed its name to ATTRAQT Group plc in August 2014. ATTRAQT Group plc was founded in 2003 and is headquartered in London, the United Kingdom with additional offices in Amsterdam, Chicago, Paris, Sofia, Hamburg, and Sydney.",
    "website": "http://www.attraqt.com",
    "zipcode": "WC1X 8HB"
  },
  "AVEVF": {
    "city": "Cambridge",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Software - Application",
    "long_name": "AVEVA Group plc",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "AVEVA GROUP",
    "state": null,
    "summary": "AVEVA Group plc, through its subsidiaries, provides engineering and industrial software solutions in the Asia Pacific, Europe, the Middle East, Africa, and the Americas. The company offers engineering, procurement, and construction; asset performance; monitoring and control; planning and scheduling; and operation and optimization industrial software solutions. It also provides digital transformation solutions covering artificial intelligence, cloud, digital twin, edge, extended reality, and Industrial Internet of Things products; and customer support and training services. The company serves customers in the chemicals, food and beverage, consumer packaged goods, infrastructure, life sciences, marine, mining, oil and gas, power and utilities, pulp and paper, steel fabrication, and water and wastewater industries. AVEVA Group plc has strategic partnerships with DORIS Group and Schneider Electric to deliver digital twin technology for the upstream oil and gas markets. The company was founded in 1967 and is headquartered in Cambridge, the United Kingdom. AVEVA Group plc is a subsidiary of Schneider Electric S.E.",
    "website": "http://www.aveva.com",
    "zipcode": "CB3 0HB"
  },
  "AVV.L": {
    "city": "Cambridge",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "AVEVA Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "AVEVA GROUP PLC ORD 3 5/9P",
    "state": null,
    "summary": "AVEVA Group plc, through its subsidiaries, provides engineering and industrial software solutions in the Asia Pacific, Europe, the Middle East, Africa, and the Americas. The company offers engineering, procurement, and construction; asset performance; monitoring and control; planning and scheduling; and operation and optimization industrial software solutions. It also provides digital transformation solutions covering artificial intelligence, cloud, digital twin, edge, extended reality, and Industrial Internet of Things products; and customer support and training services. The company serves customers in the chemicals, food and beverage, consumer packaged goods, infrastructure, life sciences, marine, mining, oil and gas, power and utilities, pulp and paper, steel fabrication, and water and wastewater industries. AVEVA Group plc has strategic partnerships with DORIS Group and Schneider Electric to deliver digital twin technology for the upstream oil and gas markets. The company was founded in 1967 and is headquartered in Cambridge, the United Kingdom. AVEVA Group plc is a subsidiary of Schneider Electric S.E.",
    "website": "http://www.aveva.com",
    "zipcode": "CB3 0HB"
  },
  "AVVYY": {
    "city": "Cambridge",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Software - Application",
    "long_name": "AVEVA Group plc",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Technology",
    "short_name": "AVEVA GROUP UNSPON ADR EACH REP",
    "state": null,
    "summary": "AVEVA Group plc, through its subsidiaries, provides engineering and industrial software solutions in the Asia Pacific, Europe, the Middle East, Africa, and the Americas. The company offers engineering, procurement, and construction; asset performance; monitoring and control; planning and scheduling; and operation and optimization industrial software solutions. It also provides digital transformation solutions covering artificial intelligence, cloud, digital twin, edge, extended reality, and Industrial Internet of Things products; and customer support and training services. The company serves customers in the chemicals, food and beverage, consumer packaged goods, infrastructure, life sciences, marine, mining, oil and gas, power and utilities, pulp and paper, steel fabrication, and water and wastewater industries. AVEVA Group plc has strategic partnerships with DORIS Group and Schneider Electric to deliver digital twin technology for the upstream oil and gas markets. The company was founded in 1967 and is headquartered in Cambridge, the United Kingdom. AVEVA Group plc is a subsidiary of Schneider Electric S.E.",
    "website": "http://www.aveva.com",
    "zipcode": "CB3 0HB"
  },
  "BBLR": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Software - Application",
    "long_name": "Bubblr Inc.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "BUBBLR INC",
    "state": null,
    "summary": "Bubblr Inc. operates as a technology company. It offers NewzMine that provides news through a mobile app; custom branded app; and Citizens Journalist app for assisting users in the fight against fake news. The company also provides a marketplace for goods and services. Bubblr Inc. is based in London, United Kingdom.",
    "website": "http://www.bubblr.com",
    "zipcode": "SE1 1HH"
  },
  "BIRD.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Blackbird plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "BLACKBIRD PLC ORD 0.8P",
    "state": null,
    "summary": "Blackbird plc develops and operates a cloud-based video editing and publishing platform under the Blackbird name in the United Kingdom, rest of Europe, North America, and internationally. The company's platform is used for video viewing, editing, and publishing. It serves news, sports, entertainment, and other sectors. The company was formerly known as Forbidden Technologies plc and changed its name to Blackbird plc in May 2019. Blackbird plc was incorporated in 1998 and is based in London, the United Kingdom.",
    "website": "http://www.blackbird.video",
    "zipcode": "SW19 4EU"
  },
  "BYI.JO": {
    "city": "Leatherhead",
    "country": "United Kingdom",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Software - Application",
    "long_name": "Bytes Technology Group PLC",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Bytes Technology Group",
    "state": null,
    "summary": "Bytes Technology Group plc provides software, hardware, and cloud services in the United Kingdom, Europe, and internationally. It offers security, storage, and virtualization solutions, as well as licensing, digital transformation, and managed services to the public and private sectors under the Bytes Software Services and Phoenix brands. The company was founded in 1982 and is headquartered in Leatherhead, the United Kingdom.",
    "website": "http://www.bytes.co.uk",
    "zipcode": "KT22 7TW"
  },
  "BYIT.L": {
    "city": "Leatherhead",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Bytes Technology Group PLC",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "BYTES TECHNOLOGY GROUP PLC ORD ",
    "state": null,
    "summary": "Bytes Technology Group plc provides software, hardware, and cloud services in the United Kingdom, Europe, and internationally. It offers security, storage, and virtualization solutions, as well as licensing, digital transformation, and managed services to the public and private sectors under the Bytes Software Services and Phoenix brands. The company was founded in 1982 and is headquartered in Leatherhead, the United Kingdom.",
    "website": "http://www.bytes.co.uk",
    "zipcode": "KT22 7TW"
  },
  "CALL.L": {
    "city": "Leicester",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Cloudcall Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "CLOUDCALL GROUP PLC ORD 20P",
    "state": null,
    "summary": "Cloudcall Group plc, a software company, designs, develops, and operates integrated multi-channel communications services for customer relationship management systems in North America, the United Kingdom, mainland Europe, Australia, and parts of the Asia Pacific. The company provides a suite of cloud-based integrated software and communications products and services under the CloudCall name. Its CloudCall suite of products, consisting of voice, SMS, and instant messaging from desktops and mobile devices, which allow companies to integrate their business communications tools into their CRM software, and enabling customer communications, to be made, recorded, logged, and categorized from within the CRM system from which detailed activity reports, analysis, and follow-up actions could be generated. The company was formerly known as Synety Group plc and changed its name to Cloudcall Group plc in May 2016. Cloudcall Group plc was incorporated in 2005 and is headquartered in Leicester, the United Kingdom.",
    "website": "http://www.cloudcall.com",
    "zipcode": "LE1 1QH"
  },
  "CER.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Cerillion Plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "CERILLION PLC ORD 0.5P",
    "state": null,
    "summary": "Cerillion Plc provides software for billing, charging, and customer relationship management (CRM) to the telecommunications, finance, utilities, and transportation sectors in the United Kingdom and internationally. It operates through four segments: Services, Software, Software-as-a-Service (SaaS), and Third-Party. The company offers Cerillion Enterprise BSS/OSS Suite, a pre-integrated end-to-end CRM and billing solution for mobile, fixed, cable, and multi-service communications providers; and Cerillion Skyline, a cloud billing SaaS application for the next generation of subscription and usage-based services. Its solutions are used for subscription management, digital transformation, Internet of Things, critical communications, General Data Protection Regulation compliance, total convergence, network asset management, mobile virtual network enablers (MVNE)/MVNO, CRM and billing, cable services, and broadband and multi-play. The company also offers software licenses, and related support and maintenance services. Cerillion Plc was founded in 1999 and is headquartered in London, the United Kingdom.",
    "website": "http://www.cerillion.com",
    "zipcode": "WC2E 9ES"
  },
  "CINGF": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Software - Application",
    "long_name": "Coinsilium Group Limited",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "COINSILIUM GROUP LTD",
    "state": null,
    "summary": "Coinsilium Group Limited is a venture capital firm specializing in early stage startup and accelerating seed-stage investment. The firm primarily invests in companies who are pioneering new applications that leverage and commercialize blockchain technologies and financial technology including Bitcoins, Internet of Things, wallets, payment gateways, exchanges, security solutions, applications, and financial services. It typically invests in Europe, Asia, and US, but may consider investments in other parts. Coinsilium Group Limited was founded on 25 September 2014 and is based in London, United Kingdom with an additional office in Hong Kong.",
    "website": "http://www.coinsilium.com",
    "zipcode": "SW6 3JA"
  },
  "CKT.L": {
    "city": "Cambridge",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Checkit plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "CHECKIT PLC ORD 5P",
    "state": null,
    "summary": "Checkit plc provides cloud-based services through intelligent operations management platforms for deskless workforces in the United Kingdom and the Americas. The company offers software-as-a-service for connected workflow management, automated monitoring and building energy management, Internet of things, and operational insight-based products and services. It also provides web-based service for work management and automated monitoring. The company was formerly known as Elektron Technology plc and changed its name to Checkit plc in October 2019. Checkit plc was incorporated in 1948 and is headquartered in Cambridge, the United Kingdom.",
    "website": "http://www.checkit.net",
    "zipcode": "CB3 0FA"
  },
  "D4T4.L": {
    "city": "Sunbury-on-Thames",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "D4t4 Solutions Plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "D4T4 SOLUTIONS PLC ORD 2P",
    "state": null,
    "summary": "D4t4 Solutions Plc provides digital data collection, customer data management, and analytics solutions. It offers Celebrus, a customer data platform software product that captures customer data from various digital channels to deliver artificial intelligence, customer insight and analytics, personalization, decisioning, and customer relationship management. The company also provides data management services using public and private cloud infrastructure. In addition, it offers performant platforms for critical business, analytics, compliance, risk, marketing, and artificial intelligence applications. The company serves finance, consumer, and other sectors in the United Kingdom, rest of Europe, the United States, and internationally. The company was formerly known as IS Solutions plc and changed its name to D4t4 Solutions Plc in July 2016. D4t4 Solutions Plc was founded in 1985 and is headquartered in Sunbury-on-Thames, the United Kingdom.",
    "website": "http://www.d4t4solutions.com",
    "zipcode": "TW16 7EF"
  },
  "DEV.L": {
    "city": "Tamworth",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Dev Clever Holdings Plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "DEV CLEVER HOLDINGS PLC ORD GBP",
    "state": null,
    "summary": "Dev Clever Holdings Plc develops and distributes immersive software products in the United Kingdom, rest of Europe, the Asia Pacific, and the United States. Its primary products are Launchyourcareer.com and VICTAR VR, which are virtual reality careers guidance platforms; and Engage, a gamification engine. The company also develops instant win games, which include Spin to Win and Scratch Card games; skill based games; augmented reality filters, such as Snapchat world lenses and Facebook facemasks; Win & Reward platform, a loyalty based program; self-activating POS kit, a digital platform to track and monitor the distribution of individual POS kits and measure the success rate of activations by venues; and augmented reality, virtual reality, themed/seasonal games, and reward games. Dev Clever Holdings Plc was incorporated in 2018 and is based in Tamworth, the United Kingdom.",
    "website": "http://devcleverholdingsplc.com",
    "zipcode": "B78 3HL"
  },
  "DMTR.L": {
    "city": "Bristol",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "DeepMatter Group Plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "DEEPMATTER GROUP PLC ORD 0.01P",
    "state": null,
    "summary": "DeepMatter Group Plc operates as a big data and analysis company. The company operates through two segments, DeepMatter and InfoChem. It offers DigitalGlassware platform to deliver applications resulting in optimized chemicals, materials, and formulations in various areas, such as pharmaceutical research, fine chemicals, scientific publications, and teaching. The company develops and commercialises cheminformatics software to handle, store, and retrieve chemical structures and reactions for application in pharma, life sciences, and scientific publications; and tools for the production of synthesis planning and reaction prediction solutions, as well as engages in the automatic extraction of scientific information from text and images. In addition, it engages in digitization of chemical space and chemical discovery. The company was formerly known as Cronin Group Plc and changed its name to DeepMatter Group Plc in May 2018. DeepMatter Group Plc was incorporated in 2006 and is based in Bristol, the United Kingdom.",
    "website": "http://www.deepmattergroup.com",
    "zipcode": "BS1 5QT"
  },
  "DOTD.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "dotdigital Group Plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "DOTDIGITAL GROUP PLC ORD 0.5P",
    "state": null,
    "summary": "dotdigital Group Plc provides intuitive software as a service (SaaS) and managed services to digital marketing professionals worldwide. The company offers Engagement Cloud, a SaaS-based omni-channel marketing automation platform that enables companies to create, test, and send data-driven automated campaigns and communications across channels, such as email, SMS, social, push, etc. dotdigital Group Plc was founded in 1999 and is headquartered in London, the United Kingdom.",
    "website": "http://www.dotdigitalgroup.com",
    "zipcode": "SE1 9BG"
  },
  "DSG.L": {
    "city": "Basingstoke",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Dillistone Group Plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "DILLISTONE GROUP PLC ORD 5P",
    "state": null,
    "summary": "Dillistone Group Plc provides technology solutions and services for the recruitment industry in the United Kingdom, Europe, the United States, Australia, and internationally. It offers FileFinder, a solution for executive search firms and to in-house executive search and sourcing teams; GatedTalent, a platform that connects executives to retained executive search firms; and ISV.online that supplies skills testing software and services to the United Kingdom recruitment industry, as well as Voyager, which includes Voyager Infinity that offers recruitment software and Voyager Mid-Office that provides pay and bill solutions. The company was founded in 1983 and is headquartered in Basingstoke, the United Kingdom.",
    "website": "http://www.dillistonegroup.com",
    "zipcode": "RG24 8WD"
  },
  "DZV2.SG": {
    "city": "Bury Saint Edmunds",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Software - Application",
    "long_name": "Smartspace Software plc",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Smartspace Software PLC Registe",
    "state": null,
    "summary": "Smartspace Software Plc, together with its subsidiaries, designs, develops, and sells Software as a Service (Saas) software solutions in the United Kingdom, Australia, and New Zealand. The company operates through three segments: SwipeOn, Space Connect, and Anders & Kern. It offers solutions, such as desk booking, meeting room management, visitor management, concierge, and workplace analytics. The company was formerly known as RedstoneConnect Plc and changed its name to Smartspace Software Plc in July 2018. Smartspace Software Plc was founded in 2000 and is headquartered in Bury Saint Edmunds, the United Kingdom.",
    "website": "http://www.smartspaceplc.com",
    "zipcode": "IP28 7RQ"
  },
  "ELCO.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Eleco Plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "ELECO PUBLIC LIMITED COMPANY OR",
    "state": null,
    "summary": "Eleco Plc provides software and related services in the United Kingdom, Scandinavia, Germany, the rest of Europe, the United States, and internationally. The company offers CAD architecture software under the Arcon Evo, Staircon, o2c names; construction cost estimation software under the Bidcon name; building information management solution under the IconSystem name; interior room configuration software under the Interiorstudio name; product information management and digital asset management solutions under the MarketingManager name; and Materialo, a flooring visualizer software. It also provides project management software under the Powerproject, Memmo, and Project Viewer names; ShireSystem, a combined CMMS and CAFM software; project planning software under the Easyplan name; Framing, a design tool for timber frame and floor construction; and Tilos, a time chainage software for time-location planning. The company was formerly known as Elecosoft plc and changed its name to Eleco Plc in July 2020. Eleco Plc was founded in 1895 and is headquartered in London, the United Kingdom.",
    "website": "http://www.elecosoft.com",
    "zipcode": "EC2A 4HB"
  },
  "ESYS.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "essensys plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "ESSENSYS PLC ORD 0.25P",
    "state": null,
    "summary": "essensys plc provides software-as-a-service platforms and on-demand cloud services to the workspace industry in the United Kingdom and the United States. The company's products include Connect, a co-working software platform for multi-site operators that provide, manage, and monitor mission-critical infrastructure services in real-time; and Operate, an end-to-end solution for multi-site workspace operators for managing day-to-day co-working operations. It serves multi-site flexible workspace providers, commercial real estate providers, and multi-site landlords. The company was founded in 2006 and is based in London, the United Kingdom.",
    "website": "http://www.essensys.tech",
    "zipcode": "E1 8FA"
  },
  "EYE.L": {
    "city": "Guildford",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Eagle Eye Solutions Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "EAGLE EYE SOLUTIONS GROUP PLC O",
    "state": null,
    "summary": "Eagle Eye Solutions Group plc, together with its subsidiaries, provides marketing technology software as a service solutions in the United Kingdom, North America, rest of Europe, and Asia Pacific. It creates digital connections that enable personalized performance marketing in real time through coupons, loyalty, apps, subscriptions, and gift services. The company offers Eagle Eye AIR platform for customer acquisition, engagement, and loyalty; Eagle Eye Reward that supports and enables businesses to build and manage digital and physical loyalty programs; digital solutions, such as Promote, Eagle Eye App, Gift, Message at till, and Subscriptions; and Staff rewards solution to digitize staff rewards schemes. It serves grocery, retail, and food and beverage sectors. The company has partnership agreement with News America Marketing to provide various retailer and brand marketing solutions. Eagle Eye Solutions Group plc was founded in 2003 and is headquartered in Guildford, the United Kingdom.",
    "website": "http://www.eagleeye.com",
    "zipcode": "GU1 4HD"
  },
  "FBD.F": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Blackbird plc",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "BLACKBIRD PLC  LS -,008",
    "state": null,
    "summary": "Blackbird plc develops and operates a cloud-based video editing and publishing platform under the Blackbird name in the United Kingdom, rest of Europe, North America, and internationally. The company's platform is used for video viewing, editing, and publishing. It serves news, sports, entertainment, and other sectors. The company was formerly known as Forbidden Technologies plc and changed its name to Blackbird plc in May 2019. Blackbird plc was incorporated in 1998 and is based in London, the United Kingdom.",
    "website": "http://www.blackbird.video",
    "zipcode": "SW19 4EU"
  },
  "G7Z1.F": {
    "city": "Cambridge",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "1Spatial Plc",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "1SPATIAL PLC  LS -,10",
    "state": null,
    "summary": "1Spatial Plc develops and sells IT software, and related consultancy and support services in the United Kingdom, Europe, the United States, and internationally. Its products include 1Integrate for automated data validation, cleaning, transformation, and enhancement for data; 1Data Gateway, a self-service web-portal for spatial data validation, processing, and analytics; 1Integrate for ArcGIS, a solution that ensures the compliance of data for use across the enterprise, as well as provides automated data validation and management for the ArcGIS platform; 1Edit, a spatial vector data editing application; and 1Generalise that automatically creates various smaller-scale data products from large-scale data sources. The company also offers 1Spatial Management Suite, a suite of products to plan, maintain, and publish data, as well as automate the production workflows; Location Master Data Management software, solutions, and business applications for managing location and geospatial data; Location Mobile App Platform; and Elyx Suite, a suite of business mapping solutions for land management and utility networks. In addition, it operates as a reseller for FME products, which allows restructuring, reformatting, and integrating data; distributes Geocortex, which enables building web mapping applications; and offers GEONIS GIS solutions for professional processing and analysis of geographical information. Further, the company offers deployment consultancy services; client support services; and training services. The company serves clients in utilities, national mapping and land management agencies, transportation and infrastructure, government, defense, and engineering industries. The company was formerly known as Avisen plc and changed its name to 1Spatial Plc in April 2012. 1Spatial Plc was incorporated in 2005 and is headquartered in Cambridge, the United Kingdom.",
    "website": "http://www.1spatial.com",
    "zipcode": "CB4 0WZ"
  },
  "GBG.L": {
    "city": "Chester",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "GB Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "GB GROUP PLC ORD 2.5P",
    "state": null,
    "summary": "GB Group plc, together with its subsidiaries, provides identity data intelligence services in the United Kingdom, the United States, Australia, and internationally. The company operates through Fraud, Identity, and Location segments. Its solutions help organizations to validate and verify the identities and locations of their customers. The company offers location intelligence services, including address capture and verification, E-mail validation, geocodes, and data cleansing services; and identity, document, and age verification, as well as employee onboarding solutions. It also provides fraud and compliance management solutions, such as transaction monitoring, onboard customers and control risk, transaction monitoring, and fraud investigation and detection services. GB Group plc was incorporated in 1989 and is headquartered in Chester, the United Kingdom.",
    "website": "http://www.gbgplc.com",
    "zipcode": "CH4 9GB"
  },
  "GBGPF": {
    "city": "Chester",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Software - Application",
    "long_name": "GB Group plc",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "GB GROUP",
    "state": null,
    "summary": "GB Group plc, together with its subsidiaries, provides identity data intelligence services in the United Kingdom, the United States, Australia, and internationally. The company operates through Fraud, Identity, and Location segments. Its solutions help organizations to validate and verify the identities and locations of their customers. The company offers location intelligence services, including address capture and verification, E-mail validation, geocodes, and data cleansing services; and identity, document, and age verification, as well as employee onboarding solutions. It also provides fraud and compliance management solutions, such as transaction monitoring, onboard customers and control risk, transaction monitoring, and fraud investigation and detection services. GB Group plc was incorporated in 1989 and is headquartered in Chester, the United Kingdom.",
    "website": "http://www.gbgplc.com",
    "zipcode": "CH4 9GB"
  },
  "GCU.F": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Gresham Technologies plc",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "GRESHAM TECHNOLOG. LS-,05",
    "state": null,
    "summary": "Gresham Technologies plc, a software and services company, provides solutions for data integrity and control, banking integration, and payments and cash management in the United Kingdom, Europe, the Middle East, Africa, the United States, North America, Australia, and the Asia Pacific. It operates through Clareti Solutions, Other Solutions, and Contracting Services segments. The company offers Clareti Transaction Control, an enterprise data control solution for data validation and real-time transaction matching and reconciliation. It also provides Clareti Accounts Receivable Management, a receivables management application with automated matching, reconciliation, and allocation to reduce the order-to-cash cycle; Clareti Integration Studio, an integration software to enable rapid adoption of financial message standards and transform complex data types; and Clareti Multi-Bank, a real-time visibility of cash and stock portfolios across various institutions. In addition, the company offers a range of solutions to enterprise-level customers in various end markets, as well as IT contracting services to banking industry. Its solutions are used by financial institutions and corporates to address the financial control, risk management, data governance, and regulatory compliance problems. The company was formerly known as Gresham Computing plc and changed its name to Gresham Technologies plc in November 2016. Gresham Technologies plc was founded in 1969 and is headquartered in London, the United Kingdom.",
    "website": "http://www.greshamtech.com",
    "zipcode": "EC4N 1TX"
  },
  "GETB.L": {
    "city": "Cambridge",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "GetBusy plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "GETBUSY PLC ORD 0.15P",
    "state": null,
    "summary": "GetBusy plc develops and sells document and task management software products in the United Kingdom, the United States, Australia, and New Zealand. The company offers SmartVault, a cloud document management platform and client portal for small and medium sized businesses; Virtual Cabinet, a desktop document management, workflow, and cloud portal tool for medium to large professional service businesses; and GetBusy, a team and client task management, and signatures application. GetBusy plc was incorporated in 2017 and is based in Cambridge, the United Kingdom.",
    "website": "http://www.getbusy.com",
    "zipcode": "CB22 3FT"
  },
  "GHT.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Gresham Technologies plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "GRESHAM TECHNOLOGIES PLC ORD 5P",
    "state": null,
    "summary": "Gresham Technologies plc, a software and services company, provides solutions for data integrity and control, banking integration, and payments and cash management in the United Kingdom, Europe, the Middle East, Africa, the United States, North America, Australia, and the Asia Pacific. It operates through Clareti Solutions, Other Solutions, and Contracting Services segments. The company offers Clareti Transaction Control, an enterprise data control solution for data validation and real-time transaction matching and reconciliation. It also provides Clareti Accounts Receivable Management, a receivables management application with automated matching, reconciliation, and allocation to reduce the order-to-cash cycle; Clareti Integration Studio, an integration software to enable rapid adoption of financial message standards and transform complex data types; and Clareti Multi-Bank, a real-time visibility of cash and stock portfolios across various institutions. In addition, the company offers a range of solutions to enterprise-level customers in various end markets, as well as IT contracting services to banking industry. Its solutions are used by financial institutions and corporates to address the financial control, risk management, data governance, and regulatory compliance problems. The company was formerly known as Gresham Computing plc and changed its name to Gresham Technologies plc in November 2016. Gresham Technologies plc was founded in 1969 and is headquartered in London, the United Kingdom.",
    "website": "http://www.greshamtech.com",
    "zipcode": "EC4N 1TX"
  },
  "GLOG.BR": {
    "city": "Cambridge",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "BRU",
    "industry": "Software - Application",
    "long_name": "Global Graphics PLC",
    "market": "be_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "GLOBAL GRAPHICS",
    "state": null,
    "summary": "Global Graphics PLC, together with its subsidiaries, develops software and hardware technology solutions for digital inkjet printing, and type design and development in the United Kingdom, rest of Europe, North America, and Asia. The company operates through Software, Printhead Solutions, and Fonts segments. The company offers Harlequin RIP, a software raster image processor, which converts text and images into printable form; ScreenPro, a software engine used to enhance inkjet image quality and compatibility with printing industry workflow; PrintFlat, a closed-loop calibration tool to enhance print uniformity and to reduce artifacts of the inkjet printing process; Fundamentals, a toolkit for building digital front end; and Mako, a multi-platform software development kit for building custom workflows. It also supplies drive electronics for industrial inkjet printing, digital typefaces, and font technology; and provides technical support services for computer software. The company sells its products to original equipment manufacturers, distributors, and system integrators. Global Graphics PLC was founded in 1986 and is headquartered in Cambridge, the United Kingdom.",
    "website": "http://www.globalgraphics.com",
    "zipcode": "CB23 6DW"
  },
  "IDEA.L": {
    "city": "Ruddington",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Ideagen plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "IDEAGEN PLC ORD 1P",
    "state": null,
    "summary": "Ideagen plc develops and sells information management software in the United Kingdom, rest of Europe, North America, the Middle East, and internationally. Its governance, risk, and compliance (GRC) solutions include Q-Pulse QMS, a quality management software; Q-Pulse PM, a product management software; Q-Pulse Law, an EHS legal compliance software; Q-Pulse WorkRite, a health and safety management system; Pentana Audit, an audit automation software; Pentana Disclose, a financial disclosure checklist software; Pentana Compliance, an accountability and competency compliance software; and Pentana Risk, a cloud-based performance and risk management software. The company's GRC solutions also comprise Coruson, an enterprise cloud-based safety management software; PleaseReview, a document review, co-authoring, and redaction software; and Ideagen Academy, a cloud-based E-learning solution. It serves aerospace and defense, accounting, finance and banking, construction, aviation, energy, food and drink, healthcare, life science, and manufacturing industries. The company was formerly known as Datum International Plc and changed its name to Ideagen plc in July 2011. Ideagen plc was founded in 1993 and is headquartered in Ruddington, the United Kingdom.",
    "website": "http://www.ideagen.com",
    "zipcode": "NG11 6JS"
  },
  "IDOX.L": {
    "city": "Reading",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "IDOX plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "IDOX PLC ORD 1P",
    "state": null,
    "summary": "Idox plc, through its subsidiaries, provides software solutions and information services for the management of local government and other organizations. The company operates through three segments: Public Sector Software, Engineering Information Management, and Content. It offers tools to manage information and knowledge, documents, content, business processes, and workflow, as well as connects directly with the citizens through the Web; elections management solutions; and decision support content, which include grants and planning policy information, as well as corporate compliance services. The company also provides engineering document control, project collaboration, and facility management applications to companies in industries, such as oil and gas, architecture and construction, mining, utilities, pharmaceuticals, and transportation. It has operations primarily in the United Kingdom, the United States, Europe, and Australia. Idox plc was incorporated in 2000 and is based in Reading, the United Kingdom.",
    "website": "http://www.idoxplc.com",
    "zipcode": "RG7 4SA"
  },
  "IGP.L": {
    "city": "Lutterworth",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Intercede Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "INTERCEDE GROUP PLC ORD 1P",
    "state": null,
    "summary": "Intercede Group plc, a cybersecurity company, engages in identity, credential management, and secure mobility business to enable digital trust in the United Kingdom, rest of Europe, North America, and internationally. It offers MyID, a credential management system for cyber secure digital identity that allows organizations to deploy digital identities to a range of secure devices; MyID Platform, a solution to add digital identities to a range of services and solutions, such as industrial Internet of Things, citizen identity, and consumer digital identity; and MyID Enterprise, a software solution for large organizations and governments to deploy and manage digital identities to a range of secure devices. The company also provides MyID PIV, a software solution for federal agencies that issue and manage secure digital identities to federal employees; and MyID Professional, an identity management software solution that enables enterprises to replace insecure passwords across their workforce with the strong user authentication  smart cards, or USB tokens with public key infrastructure certificates. In addition, it offers RapID, a cloud-based identity authentication and credential management service that deploys strong authentication to services from mobile apps; and MyIDaaS, a solution to create an ID as a service capability. The company serves aero and defense, finance and banking, healthcare, energy and utilities, military and police, manufacturing, and other industries, as well as government and federal institutes. Intercede Group plc was founded in 1992 and is headquartered in Lutterworth, the United Kingdom.",
    "website": "http://www.intercede.com",
    "zipcode": "LE17 4PS"
  },
  "ING.L": {
    "city": "Oxford",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Ingenta plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "INGENTA PLC ORD 10P",
    "state": null,
    "summary": "Ingenta plc, together with its subsidiaries, provides content management, advertising, and commercial enterprise solutions and services in the United Kingdom, the United States, and internationally. The company operates through Ingenta Commercial Products, Ingenta Content Products, Ingenta Advertising, and Publishers Communication Group (PCG) segments. The Ingenta Commercial segment provides a range of applications designed to move content forward in marketplace for print and digital products, such as royalties, permissions, editorial and production, online sales and marketing, digital and print distribution, and subscription management. The Ingenta Content segment comprising various hosting platforms that enable publishers to convert, store, deliver and monetise digital content, including online platforms, semantic enrichment, mobile, e-commerce, and access entitlement services. The Ingenta Advertising segment provides browser-based multimedia advertising, CRM, and sales management platform for content providers, including multimedia bookings, packages and bundles, inventory management, and finance/credit control. The PCG segment provides sales and marketing consulting services. It serves publishers, information providers, academic libraries, and institutions. The company was formerly known as Publishing Technology Plc and changed its name to Ingenta plc in May 2016. Ingenta plc was incorporated in 1965 and is based in Oxford, the United Kingdom.",
    "website": "http://www.ingenta.com",
    "zipcode": "OX4 2HU"
  },
  "INX.L": {
    "city": "Coventry",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "i-nexus Global plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "I-NEXUS GLOBAL PLC ORD 10P",
    "state": null,
    "summary": "i-nexus Global plc, together with its subsidiaries, engages in the development and sale of enterprise cloud-based software on a software-as-a-service (SaaS) basis in the United Kingdom, rest of Europe, the United States, and internationally. The company provides i-nexus Strategy Execution Software, an enterprise-ready software that helps organizations to prioritize, align, and manage the initiatives needed to meet strategic goals. It also offers software maintenance and support, software customization, and professional consultancy services. The company was incorporated in 2018 and is headquartered in Coventry, the United Kingdom.",
    "website": "http://www.i-nexus.com",
    "zipcode": "CV5 6UB"
  },
  "IQG.L": {
    "city": "Cambridge",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "IQGeo Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "IQGEO GROUP PLC ORD 2P",
    "state": null,
    "summary": "IQGeo Group PLC, develops geospatial software to the telecoms and utility industries primarily in the United Kingdom, North America, Europe, and Japan. The company provides IQGeo Platform, which designs and manages their complex and constantly evolving network assets; IQGeo Network Manager that accelerates productivity and collaboration by streamlining the planning, design, and construction processes for network operators; IQGeo Workflow Manager, which provides critical project and ticket information on any mobile device in the field, as well as back-office workstations; IQGeo Inspection and Survey software that provides a flexible mobile interface for field inspection teams; and IQGeo Network Revenue Optimizer software, which automatically produces various alternate telecom construction routes when connecting commercial or residential premises. It also offers IQGeo development environment to implement applications that work in any modern web browser and on any mobile device, online or offline; IQGeo Fiber Planning software, which automatically generates a cost-optimized next-generation fiber network plan and design; IQGeo for Salesforce for Salesforce customers to unlock the hidden value of their network information; IQGeo in the cloud, a cloud hosting of critical system infrastructure; IQGeo GIS integrations for data integration from virtually any application and geospatial data source; and IQGeo services. The company was formerly known as Ubisense Group Plc and changed its name to IQGeo Group PLC in January 2019. IQGeo Group PLC was founded in 2002 and is headquartered in Cambridge, the United Kingdom.",
    "website": "http://www.iqgeo.com",
    "zipcode": "CB2 1GE"
  },
  "K6YA.F": {
    "city": "Bristol",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "DeepMatter Group Plc",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "DEEPMATTER GR.PLC LS-0001",
    "state": null,
    "summary": "DeepMatter Group Plc operates as a big data and analysis company. The company operates through two segments, DeepMatter and InfoChem. It offers DigitalGlassware platform to deliver applications resulting in optimized chemicals, materials, and formulations in various areas, such as pharmaceutical research, fine chemicals, scientific publications, and teaching. The company develops and commercialises cheminformatics software to handle, store, and retrieve chemical structures and reactions for application in pharma, life sciences, and scientific publications; and tools for the production of synthesis planning and reaction prediction solutions, as well as engages in the automatic extraction of scientific information from text and images. In addition, it engages in digitization of chemical space and chemical discovery. The company was formerly known as Cronin Group Plc and changed its name to DeepMatter Group Plc in May 2018. DeepMatter Group Plc was incorporated in 2006 and is based in Bristol, the United Kingdom.",
    "website": "http://www.deepmattergroup.com",
    "zipcode": "BS1 5QT"
  },
  "KNNNF": {
    "city": "Belfast",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Software - Application",
    "long_name": "Kainos Group plc",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "KAINOS GROUP PLC",
    "state": null,
    "summary": "Kainos Group plc provides digital technology services and platforms for public and private organizations in the United Kingdom, the Republic of Ireland, the United States, and internationally. It operates through two divisions, Digital Services and Workday Practice. The Digital Services division delivers customized online digital solutions, including digital transformation, artificial intelligence, data, cloud, design, consulting, and internet of things principally for public sector, commercial sector, and healthcare organizations. This division also offers Evolve, a cloud-managed electronic medical record service for healthcare organizations. The Workday Practice division provides consulting, project management, integration, and post deployment services for Workday's software suite, which includes cloud-based software for human capital management and financial management that enables enterprises to organize their staff and to support financial reporting requirements. This division also offers Smart, a cloud-based SaaS solution that allows Workday customers to automatically verify their Workday configuration during implementation and in live operations. The company also engages in the property business. Kainos Group plc was founded in 1986 and is headquartered in Belfast, the United Kingdom.",
    "website": "http://www.kainos.com",
    "zipcode": "BT7 1NT"
  },
  "KNOS.L": {
    "city": "Belfast",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Kainos Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "KAINOS GROUP PLC ORD 0.5P",
    "state": null,
    "summary": "Kainos Group plc provides digital technology services and platforms for public and private organizations in the United Kingdom, the Republic of Ireland, the United States, and internationally. It operates through two divisions, Digital Services and Workday Practice. The Digital Services division delivers customized online digital solutions, including digital transformation, artificial intelligence, data, cloud, design, consulting, and internet of things principally for public sector, commercial sector, and healthcare organizations. This division also offers Evolve, a cloud-managed electronic medical record service for healthcare organizations. The Workday Practice division provides consulting, project management, integration, and post deployment services for Workday's software suite, which includes cloud-based software for human capital management and financial management that enables enterprises to organize their staff and to support financial reporting requirements. This division also offers Smart, a cloud-based SaaS solution that allows Workday customers to automatically verify their Workday configuration during implementation and in live operations. The company also engages in the property business. Kainos Group plc was founded in 1986 and is headquartered in Belfast, the United Kingdom.",
    "website": "http://www.kainos.com",
    "zipcode": "BT7 1NT"
  },
  "LG3.SG": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Software - Application",
    "long_name": "LoopUp Group plc",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Loopup Group PLC Registered Sha",
    "state": null,
    "summary": "LoopUp Group plc provides software-as-a-service solutions for remote business meetings in the United Kingdom, other European Union countries, North America, and internationally. It offers LoopUp, a remote meetings solution that makes it easier to collaborate in real time. The company also provides telephony and conferencing services. LoopUp Group plc was incorporated in 2016 and is headquartered in London, the United Kingdom.",
    "website": "http://www.loopup.com",
    "zipcode": "E1 6JJ"
  },
  "LOOP.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "LoopUp Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "LOOPUP GROUP PLC ORD 0.5P",
    "state": null,
    "summary": "LoopUp Group plc provides software-as-a-service solutions for remote business meetings in the United Kingdom, other European Union countries, North America, and internationally. It offers LoopUp, a remote meetings solution that makes it easier to collaborate in real time. The company also provides telephony and conferencing services. LoopUp Group plc was incorporated in 2016 and is headquartered in London, the United Kingdom.",
    "website": "http://www.loopup.com",
    "zipcode": "E1 6JJ"
  },
  "LQG.F": {
    "city": "Twyford",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "accesso Technology Group plc",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "ACCESSO TECHNOL.GP LS-,01",
    "state": null,
    "summary": "accesso Technology Group plc, together with its subsidiaries, develops technology solutions for the attractions and leisure industry in the United Kingdom, other European countries, Australia, the South Pacific, the United States, Canada, and Central and South America. The company operates through Ticketing and Distribution, and Guest Experience segments. It offers ticketing solutions for arenas and sports, fairs and festivals, performing arts, ski, theme parks, tours and attractions, water parks, and zoos and aquariums, as well as cultural facilities. The company offers various solutions, such as accesso LoQueue, a virtual queuing solution; the experience engine, an experience management platform; and accesso Passport ticketing suite, which provides season pass, group tickets, meal vouchers, and other services. It also provides accesso Siriusware, which offers software solutions comprising ticketing and admissions, memberships, reservations, resource scheduling, retail, food service, gift cards, kiosks, and ecommerce; and accesso ShoWare ticketing solutions for box office, kiosk, online, mobile, call center, and social media sales. The company was formerly known as Lo-Q plc and changed its name to accesso Technology Group plc in November 2013. accesso Technology Group plc was incorporated in 2000 and is based in Twyford, the United Kingdom.",
    "website": "http://www.accesso.com",
    "zipcode": "RG10 9NN"
  },
  "LSAI.L": {
    "city": "Cheltenham",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Location Sciences Group PLC",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "LOCATION SCIENCES GROUP PLC ORD",
    "state": null,
    "summary": "Location Sciences Group PLC operates as a location data and data intelligence company in the United Kingdom and internationally. The company offers platform products, which includes Verify, a proprietary verification platform that provides independent, media-agnostic analysis, and authentication of the accuracy and quality of location-targeted advertising data to automotive, retail, quick service restaurant, grocery, consumer packaged goods, and travel and hospitality industries; GeoProtect, which allows brands, agencies, and suppliers to check the validity of location based derived audience segments; and data and insights platform that provides access to location data points. It provides solutions for advertisers, agencies, and suppliers. The company was formerly known as Proxama Plc and changed its name to Location Sciences Group PLC in March 2018. Location Sciences Group PLC was founded in 2005 and is based in Cheltenham, the United Kingdom.",
    "website": "http://www.locationsciences.ai",
    "zipcode": "GL50 3PR"
  },
  "LUPGF": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Software - Application",
    "long_name": "LoopUp Group plc",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "LOOPUP GROUP PLC",
    "state": null,
    "summary": "LoopUp Group plc provides software-as-a-service solutions for remote business meetings in the United Kingdom, other European Union countries, North America, and internationally. It offers LoopUp, a remote meetings solution that makes it easier to collaborate in real time. The company also provides telephony and conferencing services. LoopUp Group plc was incorporated in 2016 and is headquartered in London, the United Kingdom.",
    "website": "http://www.loopup.com",
    "zipcode": "E1 6JJ"
  },
  "LWL.F": {
    "city": "Reading",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "IDOX plc",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "IDOX PLC  LS-,01",
    "state": null,
    "summary": "Idox plc, through its subsidiaries, provides software solutions and information services for the management of local government and other organizations. The company operates through three segments: Public Sector Software, Engineering Information Management, and Content. It offers tools to manage information and knowledge, documents, content, business processes, and workflow, as well as connects directly with the citizens through the Web; elections management solutions; and decision support content, which include grants and planning policy information, as well as corporate compliance services. The company also provides engineering document control, project collaboration, and facility management applications to companies in industries, such as oil and gas, architecture and construction, mining, utilities, pharmaceuticals, and transportation. It has operations primarily in the United Kingdom, the United States, Europe, and Australia. Idox plc was incorporated in 2000 and is based in Reading, the United Kingdom.",
    "website": "http://www.idoxplc.com",
    "zipcode": "RG7 4SA"
  },
  "NCC.L": {
    "city": "Manchester",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "NCC Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "NCC GROUP PLC ORD 1P",
    "state": null,
    "summary": "NCC Group plc provides cyber security and risk mitigation services in the United Kingdom, North America, rest of Europe, and internationally. It operates through two segments, Assurance and Software Resilience. The company provides cyber security services, such as penetration testing and security assessments, managed detection and response, vulnerability scanning, compliance and accreditations, risk management, products and cloud services, technology solutions, threat intelligence, specialist practices, and training. It also offers software resilience services that include escrow agreements, software escrow verification, secure verification, software as a service access and replicate, and software risk assessment solutions, as well as operates online cyber store. The company serves customers in transport industries that includes automotive, maritime, aerospace, and rail; and oil and gas, Internet of Thing, finance, small business, and retail sectors. NCC Group plc was founded in 1999 and is headquartered in Manchester, the United Kingdom.",
    "website": "http://www.nccgroup.com/uk",
    "zipcode": "M3 3AQ"
  },
  "NET.L": {
    "city": "Bedford",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Netcall plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "NETCALL PLC ORD 5P",
    "state": null,
    "summary": "Netcall plc designs, develops, and markets communications, workforce management, and business process management software and services to the healthcare, public, and private sectors in the United Kingdom and internationally. It offers Liberty, a customer engagement platform, which provides multichannel contact center, customer experience management, and workforce optimization solutions. The company also provides MATS, a cloud-based low code platform that offers applications in the area of process and data modelling; integration, automation, and communication; UI, mobile, and forms; and reporting. In addition, it offers professional, support, hosted, and consultancy services. Netcall plc was incorporated in 1984 and is based in Bedford, the United Kingdom.",
    "website": "http://www.netcall.com",
    "zipcode": "MK41 7PH"
  },
  "NZB.F": {
    "city": "Manchester",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "NCC Group plc",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "NCC GROUP PLC  LS -,01",
    "state": null,
    "summary": "NCC Group plc provides cyber security and risk mitigation services in the United Kingdom, North America, rest of Europe, and internationally. It operates through two segments, Assurance and Software Resilience. The company provides cyber security services, such as penetration testing and security assessments, managed detection and response, vulnerability scanning, compliance and accreditations, risk management, products and cloud services, technology solutions, threat intelligence, specialist practices, and training. It also offers software resilience services that include escrow agreements, software escrow verification, secure verification, software as a service access and replicate, and software risk assessment solutions, as well as operates online cyber store. The company serves customers in transport industries that includes automotive, maritime, aerospace, and rail; and oil and gas, Internet of Thing, finance, small business, and retail sectors. NCC Group plc was founded in 1999 and is headquartered in Manchester, the United Kingdom.",
    "website": "http://www.nccgroup.com/uk",
    "zipcode": "M3 3AQ"
  },
  "OBC.L": {
    "city": "Ongar",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Online Blockchain Plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "ONLINE BLOCKCHAIN PLC ORD 5P",
    "state": null,
    "summary": "Online Blockchain Plc, together with its subsidiaries, operates as a block chain company in the United Kingdom. The company operates in two segments, Faucet Subscription and Provision of Management Services. It also works as an incubator and investor in technology companies, including internet and information businesses, developers, administrators, and custodians of block chains and cryptocurrencies. The company was formerly known as On-line plc and changed its name to Online Blockchain Plc in December 2017. Online Blockchain Plc was incorporated in 1996 and is based in Ongar, the United Kingdom.",
    "website": "http://www.onlineblockchain.io",
    "zipcode": "CM5 0GA"
  },
  "OMG.L": {
    "city": "Yarnton",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Oxford Metrics plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "OXFORD METRICS PLC ORD 0.25P",
    "state": null,
    "summary": "Oxford Metrics plc provides software for infrastructure asset management and motion measurement. It operates through Vicon Group and Yotta Group segments. The Vicon Group segment engages in the development, production, and sale of computer software and equipment for the engineering, entertainment, and life science markets. The Yotta Group segment offers software and services for the management of infrastructure assets for the government agencies, local government, and infrastructure contractors. The company also provides sales, marketing, and customer support, as well as contract maintenance services. Oxford Metrics plc helps highway authorities to manage and maintain road networks; hospitals and clinicians to decide therapeutic strategies; and Hollywood studios to create visual effects. It serves customers in approximately 70 countries worldwide. The company was formerly known as OMG plc and changed its name to Oxford Metrics plc in March 2017. Oxford Metrics plc was founded in 1984 and is based in Yarnton, the United Kingdom.",
    "website": "http://www.oxfordmetrics.com",
    "zipcode": "OX5 1QU"
  },
  "PBEE.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "PensionBee Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "PENSIONBEE GROUP PLC ORD GBP0.0",
    "state": null,
    "summary": "PensionBee Group plc, a direct-to-consumer financial technology company, provides online pensions services in the United Kingdom. Its technology platform allows its customers to combine their pensions and invest in a range of online plans, forecast how much they are expected to have saved by the time they retire, and make withdrawals from their pensions. The company also offers one-off ancillary and ad-hoc services, including pension splitting on divorce, early withdrawals owing to ill health, and full drawdown within one year of becoming an invested customer. PensionBee Group plc was founded in 2014 and is based in London, the United Kingdom.",
    "website": "http://www.pensionbee.com",
    "zipcode": "EC2V 5DX"
  },
  "PEN.L": {
    "city": "Cheltenham",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Pennant International Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "PENNANT INTERNATIONAL GROUP PLC",
    "state": null,
    "summary": "Pennant International Group plc, through its subsidiaries, provides integrated training and support solutions, products, and services in the United Kingdom, Europe, the Middle East, North America, and Australasia. The company offers generic training equipment, including hydraulic systems, generic flying controls, generic hand skill, integrated maintenance, and basic flying control rod and helicopter maintenance trainers, as well as wiring board for use in aeronautical engineering colleges and academies. It also provides virtual reality solutions, which include virtual parachute training simulator, synthetic environment procedural and cargo compartment trainers, virtual reality shunter trainer, and virtual loadmaster training systems; Web and server-based e-learning, computer-based training, and computer aided instruction applications; engineering solutions; simulators and emulators for recruits to train on equipment or systems; and software development services. It primarily serves defense, rail, aerospace, and naval sectors, as well as government departments. Pennant International Group plc was incorporated in 1996 and is headquartered in Cheltenham, the United Kingdom.",
    "website": "http://www.pennantplc.co.uk",
    "zipcode": "GL51 6TL"
  },
  "PHD.L": {
    "city": "Wetherby",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Proactis Holdings PLC",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "PROACTIS HOLDINGS PLC ORD 10P",
    "state": null,
    "summary": "Proactis Holdings PLC, together with its subsidiaries, develops and sells business software, and provides related support services in the United Kingdom, Mainland Europe, the United States, and internationally. The company's solutions cover spend, sourcing, contract, procurement, supplier, project, vendor, budget, expenses, and catalog management; spend intelligence, ERP integration, workforce, payment, accounts payable automation, and spend intelligence and reporting; and integrated digital marketing, selling, and invoicing solutions. It also provides managed sourcing, catalog management, invoice capture, and other related services; and a business framework for buyer/seller interaction and commerce. The company serves the public, education, retail, financial services, not-for-profit, housing authority, property and facilities management, professional services, construction, manufacturing, pharmaceuticals and healthcare, and other sectors. Proactis Holdings PLC was founded in 1996 and is based in Wetherby, the United Kingdom.",
    "website": "http://www.proactis.com",
    "zipcode": "LS22 6LE"
  },
  "PTRO.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Pelatro Plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "PELATRO PLC ORD 2.5P",
    "state": null,
    "summary": "Pelatro Plc provides information management software and related services to providers of telecommunication services. The company offers mViva customer engagement hub, a suite of solutions designed for customer value management teams to manage the campaign life-cycle of subscribers and retailers. Its mVivia suite offers solutions for contextual campaign management, loyalty management, unified communication management, and data monetization. The company also provides software maintenance and support services; and consultancy services and/or training relating to the use of the software. It serves in the Caribbean, Central Asia, Eastern Europe, North Africa, South Asia, and South East Asia. Pelatro Plc was founded in 2013 and is headquartered in London, the United Kingdom.",
    "website": "http://www.pelatro.com",
    "zipcode": "EC4N 4SA"
  },
  "PXAMF": {
    "city": "Cheltenham",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Software - Application",
    "long_name": "Location Sciences Group PLC",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "LOCATION SCIENCES GROUP PLC",
    "state": null,
    "summary": "Location Sciences Group PLC operates as a location data and data intelligence company in the United Kingdom and internationally. The company offers platform products, which includes Verify, a proprietary verification platform that provides independent, media-agnostic analysis, and authentication of the accuracy and quality of location-targeted advertising data to automotive, retail, quick service restaurant, grocery, consumer packaged goods, and travel and hospitality industries; GeoProtect, which allows brands, agencies, and suppliers to check the validity of location based derived audience segments; and data and insights platform that provides access to location data points. It provides solutions for advertisers, agencies, and suppliers. The company was formerly known as Proxama Plc and changed its name to Location Sciences Group PLC in March 2018. Location Sciences Group PLC was founded in 2005 and is based in Cheltenham, the United Kingdom.",
    "website": "http://www.locationsciences.ai",
    "zipcode": "GL50 3PR"
  },
  "PZC.F": {
    "city": "Wetherby",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Proactis Holdings PLC",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "PROACTIS HOLDINGS PLC",
    "state": null,
    "summary": "Proactis Holdings PLC, together with its subsidiaries, develops and sells business software, and provides related support services in the United Kingdom, Mainland Europe, the United States, and internationally. The company's solutions cover spend, sourcing, contract, procurement, supplier, project, vendor, budget, expenses, and catalog management; spend intelligence, ERP integration, workforce, payment, accounts payable automation, and spend intelligence and reporting; and integrated digital marketing, selling, and invoicing solutions. It also provides managed sourcing, catalog management, invoice capture, and other related services; and a business framework for buyer/seller interaction and commerce. The company serves the public, education, retail, financial services, not-for-profit, housing authority, property and facilities management, professional services, construction, manufacturing, pharmaceuticals and healthcare, and other sectors. Proactis Holdings PLC was founded in 1996 and is based in Wetherby, the United Kingdom.",
    "website": "http://www.proactis.com",
    "zipcode": "LS22 6LE"
  },
  "QEG2.F": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Tern Plc",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "TERN PLC  LS-,0002",
    "state": null,
    "summary": "Tern Plc is a venture capital firm specializing in growth capital investment. The firm typically invests in the software companies having IoT security, enablement and analytics solutions for the healthcare and industrial sectors. The firm primarily invest in companies based in United Kingdom. Tern Plc is based in London, the United Kingdom. Tern Plc formerly known as Silvermere Energy plc.",
    "website": "http://www.ternplc.com",
    "zipcode": "W1W 8DH"
  },
  "RCQ.F": {
    "city": "Ongar",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Online Blockchain Plc",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "ONLINE BLOCKCH.PLC LS-,05",
    "state": null,
    "summary": "Online Blockchain Plc, together with its subsidiaries, operates as a block chain company in the United Kingdom. The company operates in two segments, Faucet Subscription and Provision of Management Services. It also works as an incubator and investor in technology companies, including internet and information businesses, developers, administrators, and custodians of block chains and cryptocurrencies. The company was formerly known as On-line plc and changed its name to Online Blockchain Plc in December 2017. Online Blockchain Plc was incorporated in 1996 and is based in Ongar, the United Kingdom.",
    "website": "http://www.onlineblockchain.io",
    "zipcode": "CM5 0GA"
  },
  "RDT.L": {
    "city": "Portsmouth",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Rosslyn Data Technologies plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "ROSSLYN DATA TECHNOLOGIES PLC O",
    "state": null,
    "summary": "Rosslyn Data Technologies plc engages in the development and provision of data analytics software, data capture, data mining, and workflow management in the United Kingdom and the United States. It offers RAPid, a cloud data automation platform that automates the collection, aggregation, and organization of data and documents. The company provides procurement solutions comprising procurement analytics, supplier information management, contract management, and supplier performance management; and customer experience solutions, such as case management, correspondence management, and customer analytics. It also offers master data management, data extraction, data cleansing, and data enrichment services. Rosslyn Data Technologies plc was founded in 2005 and is based in Portsmouth, the United Kingdom.",
    "website": "http://www.rosslyndatatech.com",
    "zipcode": "PO6 3EN"
  },
  "RM.L": {
    "city": "Abingdon",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "RM plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "RM PLC ORD 2 2/7P",
    "state": null,
    "summary": "RM plc supplies products, services, and solutions to educational markets in the United Kingdom and internationally. The company operates through three divisions: RM Resources, RM Results, and RM Education. The RM Resources division provides curriculum and education resources for schools and nurseries through direct sales force, online, and direct catalogue. The RM Results division provides IT software and digital assessment services. It offers IT software and services to enable online exam marking, online testing, and management and analysis of educational data. The RM Education division supplies IT software and services to schools and colleges. This division provides IT outsourcing services; cloud-based products; and digital platforms. RM plc was founded in 1973 and is based in Abingdon, the United Kingdom.",
    "website": "http://www.rmplc.com",
    "zipcode": "OX14 4SE"
  },
  "RMP1.SG": {
    "city": "Abingdon",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Software - Application",
    "long_name": "RM plc",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "RM PLC Reg. Shares LS -,0228571",
    "state": null,
    "summary": "RM plc supplies products, services, and solutions to educational markets in the United Kingdom and internationally. The company operates through three divisions: RM Resources, RM Results, and RM Education. The RM Resources division provides curriculum and education resources for schools and nurseries through direct sales force, online, and direct catalogue. The RM Results division provides IT software and digital assessment services. It offers IT software and services to enable online exam marking, online testing, and management and analysis of educational data. The RM Education division supplies IT software and services to schools and colleges. This division provides IT outsourcing services; cloud-based products; and digital platforms. RM plc was founded in 1973 and is based in Abingdon, the United Kingdom.",
    "website": "http://www.rmplc.com",
    "zipcode": "OX14 4SE"
  },
  "RNI.F": {
    "city": "Yarnton",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Oxford Metrics plc",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "OXFORD METRICS  LS-,0025",
    "state": null,
    "summary": "Oxford Metrics plc provides software for infrastructure asset management and motion measurement. It operates through Vicon Group and Yotta Group segments. The Vicon Group segment engages in the development, production, and sale of computer software and equipment for the engineering, entertainment, and life science markets. The Yotta Group segment offers software and services for the management of infrastructure assets for the government agencies, local government, and infrastructure contractors. The company also provides sales, marketing, and customer support, as well as contract maintenance services. Oxford Metrics plc helps highway authorities to manage and maintain road networks; hospitals and clinicians to decide therapeutic strategies; and Hollywood studios to create visual effects. It serves customers in approximately 70 countries worldwide. The company was formerly known as OMG plc and changed its name to Oxford Metrics plc in March 2017. Oxford Metrics plc was founded in 1984 and is based in Yarnton, the United Kingdom.",
    "website": "http://www.oxfordmetrics.com",
    "zipcode": "OX5 1QU"
  },
  "SEEN.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "SEEEN plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "SEEEN PLC ORD 12P",
    "state": null,
    "summary": "SEEEN plc operates a social platform for sharing video micro-moments worldwide. Its services include advertising, ecommerce, digital licensing, content syndication, and promotion. SEEEN plc was incorporated in 2017 and is based in London, the United Kingdom.",
    "website": "http://www.seen.com",
    "zipcode": "W1W 8DH"
  },
  "SGE.L": {
    "city": "Newcastle upon Tyne",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "The Sage Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "SAGE GROUP PLC ORD 1 4/77P",
    "state": null,
    "summary": "The Sage Group plc, together with its subsidiaries, provides technology solutions and services for small and medium businesses in North America, Northern Europe, Central and Southern Europe, and internationally. It offers cloud native solutions, such as Sage Intacct, a cloud financial management platform; Sage People, a cloud HR and people management solution; Sage Accounting, a solution for small businesses, accountants and bookkeepers to remotely manage customer data, accounts, and people; Sage Payroll, a payroll and HR software; and CakeHR, a HR management solution that enables small businesses to manage workforces with tools comprises reporting, organization chart, pay slip, and absence request. The company also provides cloud connected and hybrid solutions, including Sage X3, a business management solution; and Sage 50cloud and Sage 200cloud provides a range of cloud connected accounting solutions. The company was founded in 1981 and is headquartered in Newcastle upon Tyne, the United Kingdom.",
    "website": "http://www.sage.com",
    "zipcode": "NE13 9AA"
  },
  "SGK1.F": {
    "city": "Newcastle upon Tyne",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "The Sage Group plc",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "SAGE GRP PLC LS-,01051948",
    "state": null,
    "summary": "The Sage Group plc, together with its subsidiaries, provides technology solutions and services for small and medium businesses in North America, Northern Europe, Central and Southern Europe, and internationally. It offers cloud native solutions, such as Sage Intacct, a cloud financial management platform; Sage People, a cloud HR and people management solution; Sage Accounting, a solution for small businesses, accountants and bookkeepers to remotely manage customer data, accounts, and people; Sage Payroll, a payroll and HR software; and CakeHR, a HR management solution that enables small businesses to manage workforces with tools comprises reporting, organization chart, pay slip, and absence request. The company also provides cloud connected and hybrid solutions, including Sage X3, a business management solution; and Sage 50cloud and Sage 200cloud provides a range of cloud connected accounting solutions. The company was founded in 1981 and is headquartered in Newcastle upon Tyne, the United Kingdom.",
    "website": "http://www.sage.com",
    "zipcode": "NE13 9AA"
  },
  "SGPYY": {
    "city": "Newcastle upon Tyne",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Software - Application",
    "long_name": "The Sage Group plc",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "SAGE GROUP",
    "state": null,
    "summary": "The Sage Group plc, together with its subsidiaries, provides technology solutions and services for small and medium businesses in North America, Northern Europe, Central and Southern Europe, and internationally. It offers cloud native solutions, such as Sage Intacct, a cloud financial management platform; Sage People, a cloud HR and people management solution; Sage Accounting, a solution for small businesses, accountants and bookkeepers to remotely manage customer data, accounts, and people; Sage Payroll, a payroll and HR software; and CakeHR, a HR management solution that enables small businesses to manage workforces with tools comprises reporting, organization chart, pay slip, and absence request. The company also provides cloud connected and hybrid solutions, including Sage X3, a business management solution; and Sage 50cloud and Sage 200cloud provides a range of cloud connected accounting solutions. The company was founded in 1981 and is headquartered in Newcastle upon Tyne, the United Kingdom.",
    "website": "http://www.sage.com",
    "zipcode": "NE13 9AA"
  },
  "SMRT.L": {
    "city": "Bury Saint Edmunds",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Smartspace Software plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "SMARTSPACE SOFTWARE PLC ORD SHS",
    "state": null,
    "summary": "Smartspace Software Plc, together with its subsidiaries, designs, develops, and sells Software as a Service (Saas) software solutions in the United Kingdom, Australia, and New Zealand. The company operates through three segments: SwipeOn, Space Connect, and Anders & Kern. It offers solutions, such as desk booking, meeting room management, visitor management, concierge, and workplace analytics. The company was formerly known as RedstoneConnect Plc and changed its name to Smartspace Software Plc in July 2018. Smartspace Software Plc was founded in 2000 and is headquartered in Bury Saint Edmunds, the United Kingdom.",
    "website": "http://www.smartspaceplc.com",
    "zipcode": "IP28 7RQ"
  },
  "SPA.L": {
    "city": "Cambridge",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "1Spatial Plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "1SPATIAL PLC ORD 10P",
    "state": null,
    "summary": "1Spatial Plc develops and sells IT software, and related consultancy and support services in the United Kingdom, Europe, the United States, and internationally. Its products include 1Integrate for automated data validation, cleaning, transformation, and enhancement for data; 1Data Gateway, a self-service web-portal for spatial data validation, processing, and analytics; 1Integrate for ArcGIS, a solution that ensures the compliance of data for use across the enterprise, as well as provides automated data validation and management for the ArcGIS platform; 1Edit, a spatial vector data editing application; and 1Generalise that automatically creates various smaller-scale data products from large-scale data sources. The company also offers 1Spatial Management Suite, a suite of products to plan, maintain, and publish data, as well as automate the production workflows; Location Master Data Management software, solutions, and business applications for managing location and geospatial data; Location Mobile App Platform; and Elyx Suite, a suite of business mapping solutions for land management and utility networks. In addition, it operates as a reseller for FME products, which allows restructuring, reformatting, and integrating data; distributes Geocortex, which enables building web mapping applications; and offers GEONIS GIS solutions for professional processing and analysis of geographical information. Further, the company offers deployment consultancy services; client support services; and training services. The company serves clients in utilities, national mapping and land management agencies, transportation and infrastructure, government, defense, and engineering industries. The company was formerly known as Avisen plc and changed its name to 1Spatial Plc in April 2012. 1Spatial Plc was incorporated in 2005 and is headquartered in Cambridge, the United Kingdom.",
    "website": "http://www.1spatial.com",
    "zipcode": "CB4 0WZ"
  },
  "SPE.L": {
    "city": "West End",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Sopheon plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "SOPHEON PLC ORD 20P",
    "state": null,
    "summary": "Sopheon plc designs, develops, and markets software products with associated implementation and consultancy services in North America and Europe. The company's software products comprise Accolade, Accolade Express, Accolade Cloud, Accolade Go, Accolade Integration, and Accolade Accelerators. Its solutions provide support for innovation planning, road mapping, idea and concept development, process and project management, portfolio management and optimization, and resource planning, as well as analytics, collaborative workflow, product lifecycle management, stage-gate automation, capital expenditure management, and strategic initiative management and strategic planning. The company also offers services, such as assessments, consulting, implementation, training, and support; and maintenance and hosting services, as well as software as a service. It serves customers in the aerospace and defense, automotive, chemical and coatings, consumer goods, food and beverage, high tech, industrial, and other sectors. The company was formerly known as PolyDoc and changed its name to Sopheon plc in 1999. Sopheon plc was founded in 1993 and is based in West End, the United Kingdom.",
    "website": "http://www.sopheon.com",
    "zipcode": "GU24 9PW"
  },
  "SYME.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Supply@ME Capital plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "SUPPLY@ME CAPITAL PLC ORD 0.002",
    "state": null,
    "summary": "Supply@ME Capital plc operates a fintech platform that provides inventory monetization services to manufacturing and trading companies in Europe. The company is based in London, the United Kingdom.",
    "website": "http://www.supplymecapital.com",
    "zipcode": "W1W8DH"
  },
  "T3G.F": {
    "city": "Bristol",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "Tribal Group plc",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "TRIBAL GROUP PLC",
    "state": null,
    "summary": "Tribal Group plc, through its subsidiaries, provides education related systems, solutions, and consultancy services in the United Kingdom, the Asia Pacific, the United States, Canada, and the Middle East. It operates through two segments, Student Information Systems (SIS) and Education Services (ES). The SIS segment offers software, and maintenance and support services; and deploys and configures software for its customers. The ES segment offers inspection and review services that support the assessment of educational delivery, as well as a portfolio of performance improvement tools and services, including analytics, software solutions, facilities, and asset management. It serves universities, colleges, schools, training providers, employers, and government and state bodies. Tribal Group plc was founded in 1999 and is based in Bristol, the United Kingdom.",
    "website": "http://www.tribalgroup.com",
    "zipcode": "BS2 0HQ"
  },
  "TEK.L": {
    "city": "Oxford",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Tekcapital plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "TEKCAPITAL PLC ORD 04",
    "state": null,
    "summary": "Tekcapital plc, through its subsidiaries, provides a range of technology transfer services to universities and corporations in the United Kingdom and the United States. The company operates through two segment; Professional Services and Licensing and Investment Activities. It engages in the provision of recruitment services; and reports and services to locate and transfer technologies to customers, as well as offers R&D tax relief credits, management services, and intellectual property services to third party customers. The company involves in acquiring licenses for technologies, and portfolio company investment and development. Tekcapital plc was incorporated in 2014 and is headquartered in Oxford, the United Kingdom.",
    "website": "http://www.tekcapital.com",
    "zipcode": "OX4 4GP"
  },
  "TEKCF": {
    "city": "Oxford",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Software - Application",
    "long_name": "Tekcapital plc",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "TEKCAPITAL PLC",
    "state": null,
    "summary": "Tekcapital plc, through its subsidiaries, provides a range of technology transfer services to universities and corporations in the United Kingdom and the United States. The company operates through two segment; Professional Services and Licensing and Investment Activities. It engages in the provision of recruitment services; and reports and services to locate and transfer technologies to customers, as well as offers R&D tax relief credits, management services, and intellectual property services to third party customers. The company involves in acquiring licenses for technologies, and portfolio company investment and development. Tekcapital plc was incorporated in 2014 and is headquartered in Oxford, the United Kingdom.",
    "website": "http://www.tekcapital.com",
    "zipcode": "OX4 4GP"
  },
  "TERN.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Tern Plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "TERN PLC ORD 0.02P",
    "state": null,
    "summary": "Tern Plc is a venture capital firm specializing in growth capital investment. The firm typically invests in the software companies having IoT security, enablement and analytics solutions for the healthcare and industrial sectors. The firm primarily invest in companies based in United Kingdom. Tern Plc is based in London, the United Kingdom. Tern Plc formerly known as Silvermere Energy plc.",
    "website": "http://www.ternplc.com",
    "zipcode": "W1W 8DH"
  },
  "TIDE.L": {
    "city": "Tunbridge Wells",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Crimson Tide plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "CRIMSON TIDE PLC ORD 0.1P",
    "state": null,
    "summary": "Crimson Tide plc provides mobility solutions and related software development services primarily in the United Kingdom and Ireland. It provides mpro5, a mobile business solution that provides hardware, software, Windows Azure cloud infrastructure, and installation and support, as well as job scheduling, alerting, and reporting services. The company offers mpro5 for iOS, Android, Windows Phone 8, and Blackberry 10. It is also involved in reselling third party software, and related development and support services. The company is based in Tunbridge Wells, the United Kingdom.",
    "website": "http://www.crimsontide.co.uk",
    "zipcode": "TN4 8BS"
  },
  "TRB.L": {
    "city": "Bristol",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Tribal Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "TRIBAL GROUP PLC ORD 5P",
    "state": null,
    "summary": "Tribal Group plc, through its subsidiaries, provides education related systems, solutions, and consultancy services in the United Kingdom, the Asia Pacific, the United States, Canada, and the Middle East. It operates through two segments, Student Information Systems (SIS) and Education Services (ES). The SIS segment offers software, and maintenance and support services; and deploys and configures software for its customers. The ES segment offers inspection and review services that support the assessment of educational delivery, as well as a portfolio of performance improvement tools and services, including analytics, software solutions, facilities, and asset management. It serves universities, colleges, schools, training providers, employers, and government and state bodies. Tribal Group plc was founded in 1999 and is based in Bristol, the United Kingdom.",
    "website": "http://www.tribalgroup.com",
    "zipcode": "BS2 0HQ"
  },
  "TRCS.L": {
    "city": "Leeds",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "Tracsis plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "TRACSIS PLC ORD 0.4P",
    "state": null,
    "summary": "Tracsis plc, together with its subsidiaries, provides software development and consultancy services for the rail industry. It operates in two segments, Rail Technology and Services, and Traffic & Data Services. The Rail Technology & Services segment provides a suite of operational software products covering timetabling, resource and rolling stock planning and optimization, real time performance and control, service recovery, retail services, delay attribution, and delay repay; and infrastructure software products that are used to collect, manage, visualize, and analyze rail asset information. This segment also offers rail approved data loggers and sensors to monitor asset performance and predict failure modes, such as level crossings, interlockings, switch machines, bus-bars etc.; rail operations consultancy and training covering operational planning and modeling, franchise and concession support, data capture and evaluation, and bespoke software tool development; and transit and ticketing solutions. The Traffic & Data Services segment provides transport data collection for various travel modes using ANPR, video and mobile network data, manual survey methods, big data sources, and AI technology; transport related advisory services and transport solutions; software-delivered passenger research and statistical analysis for transport operators; and location analytics. This segment also offers event transport management covering planning, control, consultancy, signage, CSAS/PATO, and car parking. The company serves transport operators, transport authorities, and infrastructure operators, such as Network Rail, the Department for Transport, a range of government agencies and local authorities, and various engineering and infrastructure companies, as well as event organizers in the United Kingdom, Europe, North America, and internationally. Tracsis plc was founded in 2004 and is headquartered in Leeds, the United Kingdom.",
    "website": "http://www.tracsis.com",
    "zipcode": "LS2 3AA"
  },
  "WAND.L": {
    "city": "Sheffield",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "WANdisco plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "WANDISCO PLC ORD 10P",
    "state": null,
    "summary": "WANdisco plc engages in the development and provision of collaboration software in North America, Europe, and internationally. It offers WANdisco Fusion, an enterprise-class software platform that transfers data across various environments with guaranteed consistency, no downtime, no outages, and no risk; and DConE, a high-performance coordination engine able to work across wide-area networks. The company also offers LiveMigrator, a cloud migration tool to initiate a transfer of data from one cluster to another; LiveData Cloud Services for Azureto to facilitate petabyte scale cloud migration without business interruption; LiveAnalytics, an automated data and metadata replication solution; Apache Hive, a data warehouse system that allows easy data querying, analysis, and reporting of massive datasets distributed across various systems, file stores, and databases; Apache Ranger, which provides centralized security administration, fine-grained authorization, and centralized auditing within a single cluster; and Apache Sentry to control and enforce privileges on data for authenticated users and applications. In addition, it offers cloud analytics, hybrid cloud, multi cloud, and recovery solutions. WANdisco plc was founded in 2005 and is headquartered in Sheffield, the United Kingdom.",
    "website": "http://www.wandisco.com",
    "zipcode": "S3 8LN"
  },
  "WANSF": {
    "city": "Sheffield",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Software - Application",
    "long_name": "WANdisco plc",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "WANDISCO PLC",
    "state": null,
    "summary": "WANdisco plc engages in the development and provision of collaboration software in North America, Europe, and internationally. It offers WANdisco Fusion, an enterprise-class software platform that transfers data across various environments with guaranteed consistency, no downtime, no outages, and no risk; and DConE, a high-performance coordination engine able to work across wide-area networks. The company also offers LiveMigrator, a cloud migration tool to initiate a transfer of data from one cluster to another; LiveData Cloud Services for Azureto to facilitate petabyte scale cloud migration without business interruption; LiveAnalytics, an automated data and metadata replication solution; Apache Hive, a data warehouse system that allows easy data querying, analysis, and reporting of massive datasets distributed across various systems, file stores, and databases; Apache Ranger, which provides centralized security administration, fine-grained authorization, and centralized auditing within a single cluster; and Apache Sentry to control and enforce privileges on data for authenticated users and applications. In addition, it offers cloud analytics, hybrid cloud, multi cloud, and recovery solutions. WANdisco plc was founded in 2005 and is headquartered in Sheffield, the United Kingdom.",
    "website": "http://www.wandisco.com",
    "zipcode": "S3 8LN"
  },
  "WD4.F": {
    "city": "Sheffield",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "WANdisco plc",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "WANDISCO PLC  LS -,10",
    "state": null,
    "summary": "WANdisco plc engages in the development and provision of collaboration software in North America, Europe, and internationally. It offers WANdisco Fusion, an enterprise-class software platform that transfers data across various environments with guaranteed consistency, no downtime, no outages, and no risk; and DConE, a high-performance coordination engine able to work across wide-area networks. The company also offers LiveMigrator, a cloud migration tool to initiate a transfer of data from one cluster to another; LiveData Cloud Services for Azureto to facilitate petabyte scale cloud migration without business interruption; LiveAnalytics, an automated data and metadata replication solution; Apache Hive, a data warehouse system that allows easy data querying, analysis, and reporting of massive datasets distributed across various systems, file stores, and databases; Apache Ranger, which provides centralized security administration, fine-grained authorization, and centralized auditing within a single cluster; and Apache Sentry to control and enforce privileges on data for authenticated users and applications. In addition, it offers cloud analytics, hybrid cloud, multi cloud, and recovery solutions. WANdisco plc was founded in 2005 and is headquartered in Sheffield, the United Kingdom.",
    "website": "http://www.wandisco.com",
    "zipcode": "S3 8LN"
  },
  "ZOO.L": {
    "city": "Sheffield",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Software - Application",
    "long_name": "ZOO Digital Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "ZOO DIGITAL GROUP PLC ORD 1P",
    "state": null,
    "summary": "ZOO Digital Group plc, through its subsidiaries, provides cloud-based localization and digital distribution services in the United Kingdom and the United States. It operates through three segments: Localisation, Digital Packaging, and Software Solutions. The company offers subtitling, dubbing, scripting, subtitling for commercials, and closed captioning services, as well as localization of artwork and metadata, and editing of compliance; digital packaging and asset management services; and distributes TV and movie contents. Its cloud platforms include ZOOsubs, a cloud-based platform for producing, managing, and converting subtitles and captions; ZOOdubs, a cloud-based platform for offering dubbing services; ZOOscreen, a platform for screening, sharing, and showcasing TV and movie content; ZOOcore, a workflow management platform for managing projects and people; ZOOhive, a platform for preparing and repackaging assets for various digital distribution channels; ZOOvault, a central place to store, search, and download assets; and ZOOstudio platform, which manages the requirement for delivery of assets for over the top distribution. The company also engages in the media production and technology development activities; and sells and distributes technology products. It serves studios, broadcasters, online retailers, and over-the-top distributors. ZOO Digital Group plc was incorporated in 1999 and is headquartered in Sheffield, the United Kingdom.",
    "website": "http://www.zoodigital.com",
    "zipcode": "S1 4LW"
  }
}
