{
    "3MI.F": {
        "short_name": "PAGEGROUP PLC  LS -,01",
        "long_name": "PageGroup plc",
        "summary": "PageGroup plc, together with its subsidiaries, provides recruitment consultancy and support services. The company offers executive search services; recruitment services for qualified professional on permanent, temporary, and contract or interim basis; recruitment services to organizations requiring permanent employees and temporary or contract staff at technical and administrative support, professional clerical, and junior management levels; and flexible recruitment outsourcing services under the Page Executive, Michael Page, Page Personnel, and Page Outsourcing primary brands. It also provides assessment, consulting, and talent services under the Page Assessment, Page Consulting, and Page Talent supplementary brands. The company operates in the United Kingdom, rest of Europe, the Middle East, Africa, the Asia Pacific, and the Americas. The company was formerly known as Michael Page International plc and changed its name to PageGroup plc in June 2016. PageGroup plc was founded in 1976 and is based in Addlestone, the United Kingdom.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Addlestone"
    },
    "GATC.L": {
        "short_name": "GATTACA PLC ORD 1P",
        "long_name": "Gattaca plc",
        "summary": "Gattaca plc, a human capital resources company, provides contract and permanent recruitment services in the private and public sectors. The company operates through three segments: UK Engineering, UK Technology, and International. It offers flexible, permanent, and total workforce solutions; professional outsourced engineering and technology support solutions; and traditional staffing, market insight reporting, packaged campaign, recruitment process outsourcing, and employer branding agency services. The company provides its services for the infrastructure, defence, technology, media and telecoms, energy, life sciences, consumer and logistics, finance, banking and insurance, and mobility markets under the Matchtech, Networkers, Barclay Meade, Alderwood, Cappo, and Resourcing Solutions brands. It has operations in the United Kingdom, rest of Europe, the Middle East, Africa, the Americas, and the Asia Pacific. The company was formerly known as Matchtech Group plc and changed its name to Gattaca plc in September 2016. Gattaca plc was founded in 1984 and is headquartered in Fareham, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Fareham"
    },
    "HAS.L": {
        "short_name": "HAYS PLC ORD 1P",
        "long_name": "Hays plc",
        "summary": "Hays plc operates as a recruitment company in Australia, New Zealand, Germany, the United Kingdom, Ireland, and internationally. The company offers permanent, temporary, and contractor recruitment services, such as qualified, professional, and skilled recruitment to public and private sector. It specializes in offering recruitment services in the areas of accountancy and finance, construction and property, information technology, life sciences, sales and marketing, banking and capital markets, contact centers, education, engineering and manufacturing, executive, financial services, health and social care, human resources, legal, office professionals, energy, oil and gas, procurement, retail, resources and mining, and telecoms. Hays plc was founded in 1968 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "HAY.F": {
        "short_name": "HAYS PLC  LS-,01",
        "long_name": "Hays plc",
        "summary": "Hays plc operates as a recruitment company in Australia, New Zealand, Germany, the United Kingdom, Ireland, and internationally. The company offers permanent, temporary, and contractor recruitment services, such as qualified, professional, and skilled recruitment to public and private sector. It specializes in offering recruitment services in the areas of accountancy and finance, construction and property, information technology, life sciences, sales and marketing, banking and capital markets, contact centers, education, engineering and manufacturing, executive, financial services, health and social care, human resources, legal, office professionals, energy, oil and gas, procurement, retail, resources and mining, and telecoms. Hays plc was founded in 1968 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "HAYPY": {
        "short_name": "HAYS PLC",
        "long_name": "Hays plc",
        "summary": "Hays plc operates as a recruitment company in Australia, New Zealand, Germany, the United Kingdom, Ireland, and internationally. The company offers permanent, temporary, and contractor recruitment services, such as qualified, professional, and skilled recruitment to public and private sector. It specializes in offering recruitment services in the areas of accountancy and finance, construction and property, information technology, life sciences, sales and marketing, banking and capital markets, contact centers, education, engineering and manufacturing, executive, financial services, health and social care, human resources, legal, office professionals, energy, oil and gas, procurement, retail, resources and mining, and telecoms. Hays plc was founded in 1968 and is based in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "IPEL.L": {
        "short_name": "IMPELLAM GROUP PLC ORD 1P",
        "long_name": "Impellam Group PLC",
        "summary": "Impellam Group Plc provides staffing, human capital management, and outsourced people-related services in the United Kingdom, Ireland, North America, mainland Europe, Australasia, New Zealand, Singapore, and the Middle East. It operates through Global Talent Acquisition and Managed Workforce Solutions; Global Specialist Staffing; Regional Specialist Staffing; and Healthcare segments. The Global Talent Acquisition and Managed Workforce Solutions segment offers managed service programs, professional services solution, recruitment outsourcing programmes (RPO), contingent RPO, and direct sourcing models and adaptive services under the Comensura and Guidant Global brand names. The Global Specialist Staffing segment provides specialist staffing services to recruit scientific, clinical, technology, telecommunications, and digital specialists under the Lorien, onezeero, s.com, and SRG brand names. The Regional Specialist Staffing segment offers staffing services for technicians, secretaries, call center operatives, mechanical and product engineers, IT specialists, lawyers, teachers, aviation, and chefs under the Blue Arrow, Tate, Carbon60, Celsian, Career Teachers, Flexy, Chadwick Nott, Bartech Staffing, and Corestaf brands. The Healthcare segment provides healthcare workforce solutions, including healthcare staffing, managed services, staff bank, occupational health, social care, and home care services, as well as eHealth solutions under the Medacs Healthcare, Global Medics, Doctors on Call, Fast Response Healthcare, Litmus Workforce Solutions, and ignosys brand names. This segment also recruits temporary and permanent doctors, nurses and, allied health professionals. The company was incorporated in 2008 and is based in Luton, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Luton"
    },
    "MNZ.F": {
        "short_name": "GATTACA PLC  LS -,01",
        "long_name": "Gattaca plc",
        "summary": "Gattaca plc, a human capital resources company, provides contract and permanent recruitment services in the private and public sectors. The company operates through three segments: UK Engineering, UK Technology, and International. It offers flexible, permanent, and total workforce solutions; professional outsourced engineering and technology support solutions; and traditional staffing, market insight reporting, packaged campaign, recruitment process outsourcing, and employer branding agency services. The company provides its services for the infrastructure, defence, technology, media and telecoms, energy, life sciences, consumer and logistics, finance, banking and insurance, and mobility markets under the Matchtech, Networkers, Barclay Meade, Alderwood, Cappo, and Resourcing Solutions brands. It has operations in the United Kingdom, rest of Europe, the Middle East, Africa, the Americas, and the Asia Pacific. The company was formerly known as Matchtech Group plc and changed its name to Gattaca plc in September 2016. Gattaca plc was founded in 1984 and is headquartered in Fareham, the United Kingdom.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Fareham"
    },
    "MPGPF": {
        "short_name": "PAGEGROUP PLC",
        "long_name": "PageGroup plc",
        "summary": "PageGroup plc, together with its subsidiaries, provides recruitment consultancy and support services. The company offers executive search services; recruitment services for qualified professional on permanent, temporary, and contract or interim basis; recruitment services to organizations requiring permanent employees and temporary or contract staff at technical and administrative support, professional clerical, and junior management levels; and flexible recruitment outsourcing services under the Page Executive, Michael Page, Page Personnel, and Page Outsourcing primary brands. It also provides assessment, consulting, and talent services under the Page Assessment, Page Consulting, and Page Talent supplementary brands. The company operates in the United Kingdom, rest of Europe, the Middle East, Africa, the Asia Pacific, and the Americas. The company was formerly known as Michael Page International plc and changed its name to PageGroup plc in June 2016. PageGroup plc was founded in 1976 and is based in Addlestone, the United Kingdom.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Addlestone"
    },
    "NBB.L": {
        "short_name": "NORMAN BROADBENT PLC ORD 1P",
        "long_name": "Norman Broadbent plc",
        "summary": "Norman Broadbent plc, together with its subsidiaries, provides professional services in the United Kingdom and internationally. The company offers a portfolio of integrated leadership acquisition and advisory services, including board and leadership search, senior interim management, research and insight, leadership consulting and assessment, mezzanine level search, and coaching and talent management, as well as executive level talent solutions. Norman Broadbent plc was incorporated in 1936 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "OSU.F": {
        "short_name": "STAFFLINE GROUP  LS-10",
        "long_name": "Staffline Group plc",
        "summary": "Staffline Group plc, together with its subsidiaries, provides recruitment and outsourced human resource services, and skills training and probationary services in the United Kingdom. The company operates through three segments: Recruitment GB, Recruitment Ireland, and PeoplePlus. It provides labour solutions to the agriculture, drinks, food processing, manufacturing, e-retail, driving, and logistics sectors. The company also offers adult skills, adult and prison education, skills-based employability, and apprenticeship services, as well as health and well-being programs, and individual support services for carers and people with disabilities. The company provides its services to government and commercial sectors under the Staffline, Express, Vital, Brightwork, and Diamond Recruitment brand names. Staffline Group plc was founded in 1986 and is based in Nottingham, the United Kingdom.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Nottingham"
    },
    "PAGE.L": {
        "short_name": "PAGEGROUP PLC ORD 1P",
        "long_name": "PageGroup plc",
        "summary": "PageGroup plc, together with its subsidiaries, provides recruitment consultancy and support services. The company offers executive search services; recruitment services for qualified professional on permanent, temporary, and contract or interim basis; recruitment services to organizations requiring permanent employees and temporary or contract staff at technical and administrative support, professional clerical, and junior management levels; and flexible recruitment outsourcing services under the Page Executive, Michael Page, Page Personnel, and Page Outsourcing primary brands. It also provides assessment, consulting, and talent services under the Page Assessment, Page Consulting, and Page Talent supplementary brands. The company operates in the United Kingdom, rest of Europe, the Middle East, Africa, the Asia Pacific, and the Americas. The company was formerly known as Michael Page International plc and changed its name to PageGroup plc in June 2016. PageGroup plc was founded in 1976 and is based in Addlestone, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Addlestone"
    },
    "PTY.L": {
        "short_name": "PARITY GROUP PLC ORD 2P",
        "long_name": "Parity Group plc",
        "summary": "Parity Group plc, together with its subsidiaries, provides a range of recruitment, and data and technology solutions in the United Kingdom and rest of Europe. The company operates through two segments, Recruitment and Consultancy. The Recruitment segment provides interim recruitment and graduate placement services to various clients. It serves central and local government in the public sector; and retail, housing, utilities, and education customers in the private sector. The Consultancy segment offers data consultancy services and business intelligence solutions. This segment serves central government departments in the public sector; and FMCG, health, and food services clients in the private sector. Parity Group plc was founded in 1993 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "RDGC.L": {
        "short_name": "RIDGECREST PLC ORD 0.01P",
        "long_name": "Ridgecrest Plc",
        "summary": "Ridgecrest Plc does not have significant business operations. Previously, it offered recruitment consultancy services for digital technology and interactive media industries in the Asia Pacific, the United Kingdom, Europe, and the United States. The company was formerly known as Nakama Group plc and changed its name to Ridgecrest Plc in January 2021. Ridgecrest Plc was founded in 1983 and is headquartered in Whyteleafe, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Whyteleafe"
    },
    "RTC.L": {
        "short_name": "RTC GROUP PLC ORD 1P",
        "long_name": "RTC Group plc",
        "summary": "RTC Group PLC, through its subsidiaries, provides recruitment services in the United Kingdom and internationally. It offers technical recruitment solutions to the general engineering, manufacturing, transport, build environment, infrastructure, commercial disciplines, sales and technical sales, scientific, chemical, energy and utilities, and defense and aerospace sectors; technical and engineering workforce solutions, such as recruitment, training, account management, contingent labor, and fleet provision to the rail, energy, construction, highways, and transportation sectors; and staffing services. The company also provides conferencing rooms of various sizes to accommodate meetings, en-suite hotel bedrooms, and bar and dining facilities to accommodate business and leisure guests; and office space. RTC Group PLC was founded in 1963 and is headquartered in Derby, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Derby"
    },
    "RWA.L": {
        "short_name": "ROBERT WALTERS PLC ORD 20P",
        "long_name": "Robert Walters plc",
        "summary": "Robert Walters plc, together with its subsidiaries, provides professional recruitment consultancy services worldwide. The company offers permanent, contract, and interim recruitment services in the fields of accounting and finance, banking and financial services, engineering, human resources, information technology, legal, sales and marketing, secretarial and support, and supply chain and procurement. It also provides recruitment process outsourcing and managed services. The company was founded in 1985 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "S8T.F": {
        "short_name": "STHREE PLC  LS -,01",
        "long_name": "SThree plc",
        "summary": "SThree plc provides permanent and contract specialist staffing services for information and communication technology, banking and finance, energy, engineering, and the life science sectors. It offers permanent, contract, project, retained, and executive search recruitment solutions, as well as support and mobility services. The company offers its services under the Computer Futures, Progressive, Huxley Associates, Real Staffing Group, Enterprise Partners, JP Gray, Madison Black, Newington International, and Orgtel brands. It has operations primarily in the United Kingdom and Ireland, Continental Europe, the United States, and the Asia Pacific and the Middle East. SThree plc was founded in 1986 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "STAF.L": {
        "short_name": "STAFFLINE GROUP PLC ORD 10P",
        "long_name": "Staffline Group plc",
        "summary": "Staffline Group plc, together with its subsidiaries, provides recruitment and outsourced human resource services, and skills training and probationary services in the United Kingdom. The company operates through three segments: Recruitment GB, Recruitment Ireland, and PeoplePlus. It provides labour solutions to the agriculture, drinks, food processing, manufacturing, e-retail, driving, and logistics sectors. The company also offers adult skills, adult and prison education, skills-based employability, and apprenticeship services, as well as health and well-being programs, and individual support services for carers and people with disabilities. The company provides its services to government and commercial sectors under the Staffline, Express, Vital, Brightwork, and Diamond Recruitment brand names. Staffline Group plc was founded in 1986 and is based in Nottingham, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Nottingham"
    },
    "STEM.L": {
        "short_name": "STHREE PLC ORD 1P",
        "long_name": "SThree plc",
        "summary": "SThree plc provides permanent and contract specialist staffing services for information and communication technology, banking and finance, energy, engineering, and the life science sectors. It offers permanent, contract, project, retained, and executive search recruitment solutions, as well as support and mobility services. The company offers its services under the Computer Futures, Progressive, Huxley Associates, Real Staffing Group, Enterprise Partners, JP Gray, Madison Black, Newington International, and Orgtel brands. It has operations primarily in the United Kingdom and Ireland, Continental Europe, the United States, and the Asia Pacific and the Middle East. SThree plc was founded in 1986 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    }
}