{"AAWW": {"short_name": "Atlas Air Worldwide Holdings", "long_name": "Atlas Air Worldwide Holdings, Inc.", "summary": "Atlas Air Worldwide Holdings, Inc., through its subsidiaries, provides outsourced aircraft and aviation operating services. It operates through three segments: ACMI, Charter, and Dry Leasing. The company offers outsourced cargo and passenger aircraft operating solutions, including contractual service arrangements, such as the provision of aircraft; and value-added services, including crew, maintenance, and insurance to aircraft and other customers. It also provides cargo and passenger aircraft charter services to the U.S. Military Air Mobility Command, charter brokers, freight forwarders, direct shippers, airlines, sports teams and fans, and private charter customers; and aircraft and engines dry leasing services. In addition, the company offers administrative and management support services, and flight simulator training services. It also serves express delivery providers, e-commerce retailers, and airlines. The company has operations in Africa, Asia, Australia, Europe, the Middle East, North America, and South America. Atlas Air Worldwide Holdings, Inc. was founded in 1992 and is headquartered in Purchase, New York.", "currency": "USD", "sector": "Industrials", "industry": "Airports & Air Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Purchase"}, "ASLE": {"short_name": "AerSale Corporation", "long_name": "AerSale Corporation", "summary": "AerSale Inc. supplies aftermarket aircraft, engines, components, and OEM materials. It is engaged in the sale and lease of mid-life aftermarket aviation flight equipment; and sale, lease, and exchange of engines. The company also sells airframe materials, including avionics, nacelles, flight controls, rotables, landing gears, safety equipment, APUs, QEC/EBU, and interiors; and engine materials. In addition, it offers spares exchange, spares lease programs, and on-site inventory support services; long-term aircraft storage services; and flight equipment acquisition services, supply chain solutions, government programs, and asset management services. AerSale Inc. serves passenger and cargo airlines, government entities, military forces, leasing companies, multinational OEMs, and independent MROs. The company was incorporated in 2008 and is based in Coral Gables, Florida with sales offices, warehouses, and distribution centers worldwide. It has regional offices in Cardiff, United Kingdom; and Singapore.", "currency": "USD", "sector": "Industrials", "industry": "Airports & Air Services", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Coral Gables"}, "CHHCF": {"short_name": "CHC GROUP LLC / CHC FIN LTD", "long_name": "CHC Group LLC", "summary": "CHC Group LLC provides helicopter services worldwide. It offers services ranging from oil and gas transportation to search and rescue; emergency medical services and maintenance; and repair and overhaul services for industries and governments. The company also provides flight-training services. CHC Group LLC was formerly known as Helicopter Company I LLC and changed its name to CHC Group LLC in February 2017. The company was founded in 1947 and is headquartered in Irving, Texas.", "currency": "USD", "sector": "Industrials", "industry": "Airports & Air Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Irving"}, "JETR": {"short_name": "STAR JETS INTERNATIONAL INC", "long_name": "Star Jets International, Inc.", "summary": "Star Jets International, LLC offers private jets brokerage services. The company was founded in 2016 and is based in New York, New York.", "currency": "USD", "sector": "Industrials", "industry": "Airports & Air Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}, "MIC": {"short_name": "Macquarie Infrastructure Corpor", "long_name": "Macquarie Infrastructure Corporation", "summary": "Macquarie Infrastructure Corporation owns and operates a portfolio of infrastructure and infrastructure-like businesses that provide services to corporations, government agencies and individual customers primarily in the United States. It operates through: International-Matex Tank Terminals (IMTT), Atlantic Aviation, and MIC Hawaii segments. The IMTT segment offers bulk liquid storage, handling, and other services for petroleum products, various commodity and specialty chemicals, renewable fuels, and vegetable and tropical oils through a network of 19 terminals, including 17 in the United States and 2 in Canada. The Atlantic Aviation segment offers fuel delivery, de-icing, aircraft parking and hangar rental, and aircraft cleaning and catering services to owners/operators of jet aircraft, as well as for commercial, military, freight, and government aviation customers. The MIC Hawaii segment processes, distributes, and sells synthetic and renewable natural gas; and distributes and sells liquefied natural gas to industrial, commercial, residential, hospitality, military, public sector, and wholesale users. This segment's products are used in various applications, such as water heating, drying, cooking, emergency power generation, and other uses. The company was founded in 2004 and is headquartered in New York, New York.", "currency": "USD", "sector": "Industrials", "industry": "Airports & Air Services", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "New York"}, "PJET": {"short_name": "PRIORITY AVIATION INC", "long_name": "Priority Aviation, Inc.", "summary": "Priority One Jets, Inc. operates as a full service aviation company that provides on demand air charter, jet charter membership cards, and aircraft sales for business aviation, leisure, and government travel. It offers jet sales and leasing services that include private jet leasing and sales, aircraft fractional ownership, and private jet acquisition pricing services; private jet services, including concierge services, private aircraft management and maintenance, private helicopter charter, flight monitoring and coordination, air cargo charter, and government travel services, as well as personal security, medical transport, and disasters evacuation services. The company also provides air cargo freight jet charters for freight forwarding; transportation of heavy and outsize pieces, construction equipment and machine parts, high value commodities and secure/point-to-point, aerospace equipment, peacekeeping support, and dangerous materials; and critical parcel delivery, secure aircraft loading and docking, and remote originations and destinations, as well as oil, automotive, and gas industry/equipment transportation. It offers charter services for various destinations that include New York City, Miami, Los Angeles, Las Vegas, London, Sydney, Bahamas, Monaco, Istanbul, and Ibiza. The company is based in New York, New York with additional locations in the Americas, Europe, and Asia.", "currency": "USD", "sector": "Industrials", "industry": "Airports & Air Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}, "SKAS": {"short_name": "SAKER AVIATION SERVICES INC", "long_name": "Saker Aviation Services, Inc.", "summary": "Saker Aviation Services, Inc., through its subsidiaries, operates in the aviation services segment of the general aviation industry in the United States. The company serves as the operator of a heliport, a fixed base operation (FBO); a provider of aircraft maintenance and repair services (MRO); and a consultant for a seaplane base. It also provides ground-based services, such as fueling and aircraft storage for general aviation, commercial, and military aircraft, as well as other miscellaneous services. Its business activities are carried out as the operator of the Downtown Manhattan (New York) Heliport; as a FBO and MRO at the Garden City (Kansas) Regional Airport; and as a consultant to the operator of a seaplane base in New York City. The company was formerly known as FirstFlight, Inc. and changed its name to Saker Aviation Services, Inc. in September 2009. Saker Aviation Services, Inc. was founded in 2003 and is headquartered in New York, New York.", "currency": "USD", "sector": "Industrials", "industry": "Airports & Air Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}}