{
    "AAWW": {
        "short_name": "Atlas Air Worldwide Holdings",
        "long_name": "Atlas Air Worldwide Holdings, Inc.",
        "summary": "Atlas Air Worldwide Holdings, Inc., through its subsidiaries, provides outsourced aircraft and aviation operating services. It operates through three segments: ACMI, Charter, and Dry Leasing. The company offers outsourced cargo and passenger aircraft operating solutions, including contractual service arrangements, such as the provision of aircraft; and value-added services, including crew, maintenance, and insurance to aircraft and other customers. It also provides cargo and passenger aircraft charter services to the U.S. Military Air Mobility Command, charter brokers, freight forwarders, direct shippers, airlines, sports teams and fans, and private charter customers; and cargo and passenger aircraft and engines dry leasing services. In addition, the company offers administrative and management support services, and flight simulator training services. It also serves express delivery providers, e-commerce retailers, and airlines. The company has operations in Africa, Asia, Australia, Europe, the Middle East, North America, and South America. Atlas Air Worldwide Holdings, Inc. was founded in 1992 and is headquartered in Purchase, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Purchase",
        "zipcode": "10577-2543",
        "website": "http://www.atlasairworldwide.com",
        "full_time_employees": 4061
    },
    "ASLE": {
        "short_name": "AerSale Corporation",
        "long_name": "AerSale Corporation",
        "summary": "AerSale Corporation provides aftermarket commercial aircraft, engines, and its parts to passenger and cargo airlines, leasing companies, original equipment manufacturers, and government and defense contractors, as well as maintenance, repair, and overhaul (MRO) service providers worldwide. It operates in two segments, Asset Management Solutions and Technical Operations (TechOps). The Asset Management Solutions segment engages in the sale and lease of aircraft, engines, and airframes, as well as disassembly of these assets for component parts. The TechOps segment provides internal and third-party aviation services, including internally developed engineered solutions, heavy aircraft maintenance and modification, and component MRO, as well as storage and disassembly services. This segment also provides aircraft modifications, cargo/tanker conversions of aircraft, and aircraft storage; and MRO services for landing gear, thrust reversers, hydraulic systems, and other aircraft components. The company was founded in 2008 and is headquartered in Coral Gables, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Coral Gables",
        "zipcode": "33134",
        "website": "http://www.aersale.com",
        "full_time_employees": 470
    },
    "CHHCF": {
        "short_name": "CHC GROUP LLC / CHC FIN LTD",
        "long_name": "CHC Group LLC",
        "summary": "CHC Group LLC provides helicopter services worldwide. It offers services ranging from oil and gas transportation to search and rescue; emergency medical services and maintenance; and repair and overhaul services for industries and governments. The company also provides flight-training services. CHC Group LLC was formerly known as Helicopter Company I LLC and changed its name to CHC Group LLC in February 2017. The company was founded in 1947 and is headquartered in Irving, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Irving",
        "zipcode": "75039",
        "website": "http://www.chcheli.com",
        "full_time_employees": null
    },
    "JETR": {
        "short_name": "STAR JETS INTERNATIONAL INC",
        "long_name": "Star Jets International, Inc.",
        "summary": "Star Jets International, LLC offers private jets brokerage services. The company was founded in 2016 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022",
        "website": "http://www.private-jet-charter-flight.com",
        "full_time_employees": null
    },
    "MIC": {
        "short_name": "Macquarie Infrastructure Corpor",
        "long_name": "Macquarie Infrastructure Corporation",
        "summary": "Macquarie Infrastructure Corporation invests in infrastructure and infrastructure-like businesses that provide services to corporations, government agencies and individual customers primarily in the United States. It operates through three segments: Atlantic Aviation, MIC Hawaii, and Corporate and Other. The Atlantic Aviation segment offers fuel delivery; aircraft hangar rental; and other services, consisting of de-icing services, landing, concession, transient overnight hangar usage, terminal use, fuel distribution, aircraft parking, aircraft cleaning, and catering to owners and operators of general aviation jet aircraft, as well as for commercial, military, freight, and government aviation customers. The MIC Hawaii segment distribution and sales of synthetic natural gas, liquefied petroleum gas, liquefied natural gas, and renewable natural gas to industrial, commercial, residential, hospitality, military, public sector, and wholesale users. The company was founded in 2004 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10019",
        "website": "http://www.micinc.com",
        "full_time_employees": 2224
    },
    "PJET": {
        "short_name": "PRIORITY AVIATION INC",
        "long_name": "Priority Aviation, Inc.",
        "summary": "Priority One Jets, Inc. operates as a full service aviation company that provides on demand air charter, jet charter membership cards, and aircraft sales for business aviation, leisure, and government travel. It offers jet sales and leasing services that include private jet leasing and sales, aircraft fractional ownership, and private jet acquisition pricing services; private jet services, including concierge services, private aircraft management and maintenance, private helicopter charter, flight monitoring and coordination, air cargo charter, and government travel services, as well as personal security, medical transport, and disasters evacuation services. The company also provides air cargo freight jet charters for freight forwarding; transportation of heavy and outsize pieces, construction equipment and machine parts, high value commodities and secure/point-to-point, aerospace equipment, peacekeeping support, and dangerous materials; and critical parcel delivery, secure aircraft loading and docking, and remote originations and destinations, as well as oil, automotive, and gas industry/equipment transportation. It offers charter services for various destinations that include New York City, Miami, Los Angeles, Las Vegas, London, Sydney, Bahamas, Monaco, Istanbul, and Ibiza. The company is based in New York, New York with additional locations in the Americas, Europe, and Asia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10038",
        "website": "http://www.priorityonejets.com",
        "full_time_employees": null
    },
    "SKAS": {
        "short_name": "SAKER AVIATION SERVICES INC",
        "long_name": "Saker Aviation Services, Inc.",
        "summary": "Saker Aviation Services, Inc., through its subsidiaries, operates in the aviation services segment of the general aviation industry in the United States. It serves as the operator of a heliport, a fixed base operation (FBO); a provider of aircraft maintenance and repair services (MRO); and a consultant for a seaplane base. The company also provides ground-based services, such as fueling and aircraft storage for general aviation, commercial, and military aircraft, as well as other miscellaneous services. Its business activities are carried out as the operator of the Downtown Manhattan (New York) Heliport; and as a FBO and MRO at the Garden City (Kansas) Regional Airport. The company was formerly known as FirstFlight, Inc. and changed its name to Saker Aviation Services, Inc. in September 2009. Saker Aviation Services, Inc. was founded in 2003 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10004",
        "website": "http://www.sakeraviation.com",
        "full_time_employees": 18
    },
    "W8W.F": {
        "short_name": "ATLAS AIR WW NEW  DL-,01",
        "long_name": "Atlas Air Worldwide Holdings, Inc.",
        "summary": "Atlas Air Worldwide Holdings, Inc., through its subsidiaries, provides outsourced aircraft and aviation operating services. It operates through three segments: ACMI, Charter, and Dry Leasing. The company offers outsourced cargo and passenger aircraft operating solutions, including contractual service arrangements, such as the provision of aircraft; and value-added services, including crew, maintenance, and insurance to aircraft and other customers. It also provides cargo and passenger aircraft charter services to the U.S. Military Air Mobility Command, charter brokers, freight forwarders, direct shippers, airlines, sports teams and fans, and private charter customers; and cargo and passenger aircraft and engines dry leasing services. In addition, the company offers administrative and management support services, and flight simulator training services. It also serves express delivery providers, e-commerce retailers, and airlines. The company has operations in Africa, Asia, Australia, Europe, the Middle East, North America, and South America. Atlas Air Worldwide Holdings, Inc. was founded in 1992 and is headquartered in Purchase, New York.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "Purchase",
        "zipcode": "10577-2543",
        "website": "http://www.atlasairworldwide.com",
        "full_time_employees": 4061
    }
}