{
    "05G.F": {
        "short_name": "FORTERRA INC  DL-,001",
        "long_name": "Forterra, Inc.",
        "summary": "Forterra, Inc. manufactures and sells pipe and precast products in the United States, Canada, and Mexico. It operates through Drainage Pipe & Products; and Water Pipe & Products segments. The company offers concrete drainage pipes used for storm water applications, residential and non-residential site developments, sanitary sewers, low-pressure sewer force mains, tunneled systems, treatment plant piping, and utility tunnels. It provides box culverts, utility vaults, manholes, drainage inlets, and pipe end sections used for roadway and airport drainage, storm water management, utility construction, and water treatment and filtration systems; and architectural panels for buildings, modular railroad crossings, retaining wall and storm water treatment systems, highway noise barriers, and concrete vaults that are used to house dry or wet utilities. The company offers hollow-core planks, prestressed bridge girders, beams, columns, wall panels, stairs, garage floors, and architectural claddings for infrastructure and non-residential applications; and precast concrete bridge girders for highway projects. It provides precast concrete foundation to support prefabricated shelters or equipment buildings; precast product that consolidates and protects underground electrical and communication cables; and storm water technologies for storm water management market. The company offers ductile iron pipes for transmission and distribution of potable and waste water, and smaller diameter applications; concrete pressure pipes for water transmission and distribution, power plant cooling water lines, sewage force mains for waste and storm water, and other various applications; and prestressed concrete and bar-wrapped concrete pipes. It serves construction contractors, developers, utility companies and contractors, municipalities, and waterworks distributors and contractors through distributors. The company was founded in 1899 and is headquartered in Irving, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Irving",
        "zipcode": "75062",
        "website": "http://www.forterrabp.com",
        "market_cap": 1287642240
    },
    "0JW.F": {
        "short_name": "JELD-WEN HLDG INC. DL-,01",
        "long_name": "JELD-WEN Holding, Inc.",
        "summary": "JELD-WEN Holding, Inc. designs, manufactures, and sells doors and windows primarily in North America, Europe, and Australasia. The company offers a line of residential interior and exterior door products, including patio doors, and folding or sliding wall systems; non-residential doors; and wood, vinyl, aluminum, and wood composite windows. It also provides other ancillary products and services, such as shower enclosures and wardrobes, moldings, trim boards, lumber, cutstocks, glass, staircases, hardware and locks, cabinets, and screens, as well as molded door skins, and miscellaneous installation and other services. The company markets its products under the JELD-WEN brand; and various regional brands, such as Swedoor, DANA, Corinthian, Stegbar, and Trend. It serves wholesale distributors and retailers, as well as individual contractors and consumers. The company was founded in 1960 and is headquartered in Charlotte, North Carolina.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NC",
        "city": "Charlotte",
        "zipcode": "28273",
        "website": "http://www.jeld-wen.com",
        "market_cap": 2284446720
    },
    "2AS.F": {
        "short_name": "ARMSTRONG FLOOR.DL-,0001",
        "long_name": "Armstrong Flooring, Inc.",
        "summary": "Armstrong Flooring, Inc., together with its subsidiaries, designs, manufactures, sources, and sells resilient flooring products in North America and the Pacific Rim. Its products are used in the construction and renovation of commercial, residential, and institutional buildings. The company sells its products to independent wholesale flooring distributors, retailers, builders, contractors, installers, property management firms, homeowners, and others. Armstrong Flooring, Inc. was founded in 1860 and is headquartered in Lancaster, Pennsylvania.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Lancaster",
        "zipcode": "17603",
        "website": "http://www.armstrongflooring.com",
        "market_cap": 105916568
    },
    "2IL.F": {
        "short_name": "INSTAL.BLDG PRODS DL -,01",
        "long_name": "Installed Building Products, Inc.",
        "summary": "Installed Building Products, Inc., together with its subsidiaries, engages in the installation of insulation, waterproofing, fire-stopping, fireproofing, garage doors, rain gutters, window blinds, shower doors, closet shelving and mirrors, and other products in the continental United States. It offers a range of insulation materials, such as fiberglass and cellulose, and spray foam insulation materials. The company is also involved in the installation of insulation and sealant materials in various areas of a structure, which includes basement and crawl space, building envelope, attic, and acoustical applications. In addition, it installs a range of advanced caulk and sealant products that control air infiltration in residential and commercial buildings, as well as moisture protection systems. It serves homebuilders, multi-family and commercial construction firms, individual homeowners, and repair and remodeling contractors through a network of approximately 190 branch locations. The company was formerly known as CCIB Holdco, Inc. Installed Building Products, Inc. was founded in 1977 and is headquartered in Columbus, Ohio.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Columbus",
        "zipcode": "43215",
        "website": "http://www.installedbuildingproducts.com",
        "market_cap": 2955062528
    },
    "2T1.SG": {
        "short_name": "Tecogen Inc. (New) Registered S",
        "long_name": "Tecogen Inc.",
        "summary": "Tecogen Inc. designs, manufactures, markets, and maintains industrial and commercial cogeneration systems that produce combinations of electricity, hot water, and air conditioning for residential, commercial, recreational, and industrial use in the United States and internationally. It operates in two segments, Products and Services, and Energy Production. The company offers InVerde e+, a cogeneration product that provides electricity and hot water; TECOGEN cogeneration systems for producing hot water; TECOCHILL air-conditioning and refrigeration chillers; Tecofrost gas engine-driven refrigeration compressors; and water heaters under the Ilios brand name, as well as emissions control technology under the Ultera brand name. It also provides long-term maintenance contracts, parts sales, and turnkey installation services through a network of eleven field service centers in California, the Midwest, the Northeast, and the Southeast, as well as in Ontario, Canada. In addition, the company installs, owns, operates, and maintains distributed generation, energy, and other complementary systems. It serves hospitals and nursing homes, colleges, universities, health clubs, spas, hotels, motels, office and retail buildings, food and beverage processors, multi-unit residential buildings, laundries, ice rinks, swimming pools, factories, municipal buildings, military installations, and indoor growing facilities. The company was incorporated in 2000 and is headquartered in Waltham, Massachusetts.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "state": "MA",
        "city": "Waltham",
        "zipcode": "02451",
        "website": "http://www.tecogen.com",
        "market_cap": 33705804
    },
    "4Q2.F": {
        "short_name": "QUANEX BUILD. PRODS DL-01",
        "long_name": "Quanex Building Products Corporation",
        "summary": "Quanex Building Products Corporation, together with its subsidiaries, provides components for the fenestration industry worldwide. It operates through three segments: North American Fenestration, European Fenestration, and North American Cabinet Components. The company offers flexible insulating glass spacers, extruded vinyl profiles, window and door screens, and precision-formed metal and wood products, as well as cabinet doors and other components for original equipment manufacturers (OEMs) in the kitchen and bathroom cabinet industry. It also provides various non-fenestration components and products, including solar panel sealants, trim moldings, vinyl decking, fencing, water retention barriers, and conservatory roof components. The company sells its products to OEMs in the building products industry through sales representatives, direct sales force, distributors, and independent sales agents. Quanex Building Products Corporation was founded in 1927 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77027",
        "website": "http://www.quanex.com",
        "market_cap": 713700672
    },
    "6DA.F": {
        "short_name": "ADVANCED DRAIN.SYS.DL-,01",
        "long_name": "Advanced Drainage Systems, Inc.",
        "summary": "Advanced Drainage Systems, Inc. designs, manufactures, and markets thermoplastic corrugated pipes and related water management products, and drainage solutions for use in the underground construction and infrastructure marketplace in the United States, Canada, and internationally. The company offers single, double, and triple wall corrugated polypropylene and polyethylene pipes; and allied products, including storm retention/detention and septic chambers, polyvinyl chloride drainage structures, fittings, and water quality filters and separators. It also purchases and distributes construction fabrics and other geotextile products for soil stabilization, reinforcement, filtration, separation, erosion control, and sub-surface drainage, as well as drainage grates and other products. The company offers its products for non-residential, residential, agriculture, and infrastructure applications through a network of approximately 32 distribution centers in approximately 80 countries. Advanced Drainage Systems, Inc. was founded in 1966 and is headquartered in Hilliard, Ohio.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Hilliard",
        "zipcode": "43026",
        "website": "http://www.ads-pipe.com",
        "market_cap": 6402731008
    },
    "91A.F": {
        "short_name": "ARMSTRONG WLD IND. NEW",
        "long_name": "Armstrong World Industries, Inc.",
        "summary": "Armstrong World Industries, Inc., together with its subsidiaries, designs, manufactures, and sells ceiling systems primarily for use in the construction and renovation of residential and commercial buildings in the United States, Canada, and Latin America. The company operates through Mineral Fiber and Architectural Specialties segments. The company produces suspended mineral fiber, soft fiber, fiberglass wool, and metal ceiling systems, as well as wood, wood fiber, glass-reinforced-gypsum, and felt ceiling and wall systems; ceiling component products, such as ceiling perimeters and trims, as well as grid products that support drywall ceiling systems; ceilings and walls for use in commercial settings; and acoustical controls and architectural cast ceilings, walls, facades, columns, and moldings solutions. It sells its commercial ceiling and architectural specialties products to resale distributors and ceiling system contractors; and residential ceiling products to wholesalers and retailers, such as large home centers. The company was incorporated in 1891 and is headquartered in Lancaster, Pennsylvania.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Lancaster",
        "zipcode": "17603",
        "website": "http://www.armstrongceilings.com",
        "market_cap": 4346377216
    },
    "AAO.F": {
        "short_name": "AAON INC.  DL-,004",
        "long_name": "AAON, Inc.",
        "summary": "AAON, Inc., together with its subsidiaries, engages in engineering, manufacturing, marketing, and selling air conditioning and heating equipment in the United States and Canada. It offers rooftop units, chillers, packaged outdoor mechanical rooms, air handling units, makeup air units, energy recovery units, condensing units, geothermal/water-source heat pumps, self-contained units, coils, and controls. The company markets and sells its products to retail, manufacturing, educational, lodging, supermarket, medical, and other commercial industries. It sells its products through a network of manufacturers' representatives and internal sales force. The company was incorporated in 1987 and is based in Tulsa, Oklahoma.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74107",
        "website": "http://www.aaon.com",
        "market_cap": 2657153280
    },
    "AAON": {
        "short_name": "AAON, Inc.",
        "long_name": "AAON, Inc.",
        "summary": "AAON, Inc., together with its subsidiaries, engages in engineering, manufacturing, marketing, and selling air conditioning and heating equipment in the United States and Canada. It offers rooftop units, chillers, packaged outdoor mechanical rooms, air handling units, makeup air units, energy recovery units, condensing units, geothermal/water-source heat pumps, self-contained units, coils, and controls. The company markets and sells its products to retail, manufacturing, educational, lodging, supermarket, medical, and other commercial industries. It sells its products through a network of manufacturers' representatives and internal sales force. The company was incorporated in 1987 and is based in Tulsa, Oklahoma.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74107",
        "website": "http://www.aaon.com",
        "market_cap": 3375818496
    },
    "AFI": {
        "short_name": "Armstrong Flooring, Inc.",
        "long_name": "Armstrong Flooring, Inc.",
        "summary": "Armstrong Flooring, Inc., together with its subsidiaries, designs, manufactures, sources, and sells resilient flooring products in North America and the Pacific Rim. Its products are used in the construction and renovation of commercial, residential, and institutional buildings. The company sells its products to independent wholesale flooring distributors, retailers, builders, contractors, installers, property management firms, homeowners, and others. Armstrong Flooring, Inc. was founded in 1860 and is headquartered in Lancaster, Pennsylvania.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Lancaster",
        "zipcode": "17603",
        "website": "http://www.armstrongflooring.com",
        "market_cap": 134235728
    },
    "ANP.F": {
        "short_name": "APOGEE ENTERPRISES DL-333",
        "long_name": "Apogee Enterprises, Inc.",
        "summary": "Apogee Enterprises, Inc. designs and develops glass and metal products and services in the United States, Canada, and Brazil. The company operates in four segments: Architectural Framing Systems, Architectural Glass, Architectural Services, and Large-Scale Optical Technologies (LSO). The Architectural Framing Systems segment designs, engineers, fabricates, and finishes the aluminum frames used in customized aluminum and glass window; curtain wall; storefront; and entrance systems, such as the outside skin and entrances of commercial, institutional, and multi-family residential buildings. The Architectural Glass segment fabricates coated and high-performance glass used in customized window and wall systems, including the outside skin of commercial, institutional, and multi-family residential buildings. The Architectural Services segment offers full-service installation of the walls of glass, windows, and other curtain wall products making up the outside skin of commercial and institutional buildings. The LSO segment manufactures value-added glass and acrylic products for framing and display applications. The company's products and services are primarily used in commercial buildings, such as office buildings, hotels, and retail centers; and institutional buildings comprising education facilities, health care facilities, and government buildings, as well as multi-family residential buildings. It markets its architectural products and services through direct sales force, independent sales representatives, and distributors to glazing subcontractors and general contractors; and value-added glass and acrylics through retail chains, picture-framing shops, and independent distributors to museums, galleries, and other organizations. The company was incorporated in 1949 and is based in Minneapolis, Minnesota.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MN",
        "city": "Minneapolis",
        "zipcode": "55435",
        "website": "http://www.apog.com",
        "market_cap": 841968576
    },
    "AP1.F": {
        "short_name": "ASPEN AEROGELS  DL-,00001",
        "long_name": "Aspen Aerogels, Inc.",
        "summary": "Aspen Aerogels, Inc. designs, develops, manufactures, and sells aerogel insulation products primarily for use in the energy infrastructure and building materials markets in the United States, Asia, Canada, Europe, and Latin America. The company offers PyroThin thermal barriers for use in lithium-ion batteries in electric vehicles and energy grid industries; Pyrogel XTE that reduces the risk of corrosion under insulation in energy infrastructure operating systems; Pyrogel HPS for applications within the power generation market; Pyrogel XTF to provide protection against fire; Cryogel Z for sub-ambient and cryogenic applications in the energy infrastructure market; and Spaceloft Subsea for use in pipe-in-pipe applications in offshore oil production. It also offers Spaceloft Grey and Spaceloft A2 for use in the building materials market; and Cryogel X201, which is used in designing cold systems, such as refrigerated appliances, cold storage equipment, and aerospace systems. Aspen Aerogels, Inc. was founded in 2001 and is headquartered in Northborough, Massachusetts.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MA",
        "city": "Northborough",
        "zipcode": "01532",
        "website": "http://www.aerogel.com",
        "market_cap": 510519552
    },
    "APOG": {
        "short_name": "Apogee Enterprises, Inc.",
        "long_name": "Apogee Enterprises, Inc.",
        "summary": "Apogee Enterprises, Inc. designs and develops glass and metal products and services in the United States, Canada, and Brazil. The company operates in four segments: Architectural Framing Systems, Architectural Glass, Architectural Services, and Large-Scale Optical Technologies (LSO). The Architectural Framing Systems segment designs, engineers, fabricates, and finishes the aluminum frames used in customized aluminum and glass window; curtain wall; storefront; and entrance systems, such as the outside skin and entrances of commercial, institutional, and multi-family residential buildings. The Architectural Glass segment fabricates coated and high-performance glass used in customized window and wall systems, including the outside skin of commercial, institutional, and multi-family residential buildings. The Architectural Services segment offers full-service installation of the walls of glass, windows, and other curtain wall products making up the outside skin of commercial and institutional buildings. The LSO segment manufactures value-added glass and acrylic products for framing and display applications. The company's products and services are primarily used in commercial buildings, such as office towers, hotels, and retail centers; and institutional buildings comprising education facilities, health care facilities, and government buildings, as well as multi-family residential buildings. It markets its architectural products and services through direct sales force, independent sales representatives, and distributors to glazing subcontractors and general contractors; and value-added glass and acrylics through retail chains, picture-framing shops, and independent distributors to museums, shops, and galleries. The company was founded in 1949 and is based in Minneapolis, Minnesota.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "MN",
        "city": "Minneapolis",
        "zipcode": "55435",
        "website": "http://www.apog.com",
        "market_cap": 950581440
    },
    "ASPN": {
        "short_name": "Aspen Aerogels, Inc.",
        "long_name": "Aspen Aerogels, Inc.",
        "summary": "Aspen Aerogels, Inc. designs, develops, manufactures, and sells aerogel insulation products primarily for use in the energy infrastructure and building materials markets in the United States, Asia, Canada, Europe, and Latin America. The company offers PyroThin thermal barriers for use in lithium-ion batteries in electric vehicles and energy grid industries; Pyrogel XTE that reduces the risk of corrosion under insulation in energy infrastructure operating systems; Pyrogel HPS for applications within the power generation market; Pyrogel XTF to provide protection against fire; Cryogel Z for sub-ambient and cryogenic applications in the energy infrastructure market; and Spaceloft Subsea for use in pipe-in-pipe applications in offshore oil production. It also offers Spaceloft Grey and Spaceloft A2 for use in the building materials market; and Cryogel X201, which is used in designing cold systems, such as refrigerated appliances, cold storage equipment, and aerospace systems. Aspen Aerogels, Inc. was founded in 2001 and is headquartered in Northborough, Massachusetts.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Northborough",
        "zipcode": "01532",
        "website": "http://www.aerogel.com",
        "market_cap": 553298304
    },
    "AWI": {
        "short_name": "Armstrong World Industries Inc",
        "long_name": "Armstrong World Industries, Inc.",
        "summary": "Armstrong World Industries, Inc., together with its subsidiaries, designs, manufactures, and sells ceiling systems primarily for use in the construction and renovation of residential and commercial buildings in the United States, Canada, and Latin America. The company operates through Mineral Fiber and Architectural Specialties segments. The company produces suspended mineral fiber, soft fiber, fiberglass wool, and metal ceiling systems, as well as wood, wood fiber, glass-reinforced-gypsum, and felt ceiling and wall systems; ceiling component products, such as ceiling perimeters and trims, as well as grid products that support drywall ceiling systems; ceilings and walls for use in commercial settings; and acoustical controls and architectural cast ceilings, walls, facades, columns, and moldings solutions. It sells its commercial ceiling and architectural specialties products to resale distributors and ceiling system contractors; and residential ceiling products to wholesalers and retailers, such as large home centers. The company was incorporated in 1891 and is headquartered in Lancaster, Pennsylvania.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Lancaster",
        "zipcode": "17603",
        "website": "http://www.armstrongceilings.com",
        "market_cap": 5155525120
    },
    "AZEK": {
        "short_name": "The AZEK Company Inc.",
        "long_name": "The AZEK Company Inc.",
        "summary": "The AZEK Company Inc. engages in designing, manufacturing, and selling building products for residential, commercial, and industrial markets in the United States. The operates in two segments, Residential and Commercial. Its products include trims, decks, porches, moldings, railings, pavers, and bathroom and locker systems, as well as extruded plastic sheet products and other non-fabricated products for special applications in industrial markets. The AZEK Company Inc. offers its products under the brand names of Celtec, Playboard, Seaboard, Flametec, Designboard, Cortec, Sanatec, Scranton Products, Aria Partitions, Eclipse Partitions, Hiny Hiders, Tufftec Lockers, and Duralife Lockers. The company was formerly known as CPG Newco LLC and changed its name to The AZEK Company Inc. in June 2020. The AZEK Company Inc. was founded in 2013 and is headquartered in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60607",
        "website": "http://azekco.com",
        "market_cap": 7774088192
    },
    "B1F.F": {
        "short_name": "BUILDERS FIRSTSOUR.DL-,01",
        "long_name": "Builders FirstSource, Inc.",
        "summary": "Builders FirstSource, Inc., together with its subsidiaries, manufactures and supplies building materials, manufactured components, and construction services to professional homebuilders, sub-contractors, remodelers, and consumers in the United States. The company operates through four segments: Northeast, Southeast, South, and West. It offers lumber and lumber sheet goods comprising dimensional lumber, plywood, and oriented strand board products that are used in on-site house framing; manufactured products, such as wood floor and roof trusses, steel roof trusses, wall panels, stairs, and engineered wood products; and windows, and interior and exterior door units, as well as interior trims and custom products under the Synboard brand name. The company also offers gypsum, roofing, and insulation products, including wallboards, ceilings, joint treatments, and finishes; and siding, metal, and concrete products, such as vinyl, composite, and wood siding products, as well as exterior trims, other exteriors, metal studs, and cement products. In addition, it provides other building products and services, such as cabinets and hardware, as well as turn-key framing, shell construction, design assistance, and professional installation services. The company was formerly known as BSL Holdings, Inc. and changed its name to Builders FirstSource, Inc. in October 1999. Builders FirstSource, Inc. was founded in 1998 and is based in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75201",
        "website": "http://www.bldr.com",
        "market_cap": 8993148928
    },
    "BECN": {
        "short_name": "Beacon Roofing Supply, Inc.",
        "long_name": "Beacon Roofing Supply, Inc.",
        "summary": "Beacon Roofing Supply, Inc., together with its subsidiaries, distributes residential and non-residential roofing materials, and complementary building products to contractors, home builders, building owners, and retailers. The company's residential roofing products include asphalt shingles, synthetic slates and tiles, clay and concrete tiles, slates, nail base insulations, metal roofing, felts, synthetic underlayment, wood shingles and shakes, nails and fasteners, metal edgings and flashings, prefabricated flashings, ridges and soffit vents, and solar systems. Its non-residential roofing products comprise single-ply roofing, asphalt, metal, modified bitumen, and build-up roofing products; cements and coatings; flat stock and tapered insulations; commercial fasteners; metal edges and flashings; smoke/roof hatches; roofing tools; sheet metal products, including copper, aluminum, and steel; and PVC, TPO, and EPDM membrane products. The company also provides complementary building products, such as vinyl and fiber cement sidings; wallboards; insulations; acoustical ceilings; stone veneers; windows; doors; skylights; gutters and downspouts; decking and railings; air barriers; concrete restoration systems; and steel stud framing and waterproofing systems. In addition, it offers value-added services, including advice and assistance on product identification, specification, technical support, and training; job site delivery, rooftop loading, and logistical services; tapered insulation design and related layout services; metal fabrication and related metal roofing design and layout services; trade credit and online bill pay; and marketing support for contractors. As of September 30, 2020, the company operated through a network of 524 branches in 50 states of the United States and 6 provinces in Canada. Beacon Roofing Supply, Inc. was founded in 1928 and is headquartered in Herndon, Virginia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Herndon",
        "zipcode": "20170",
        "website": "http://www.becn.com",
        "market_cap": 3855587840
    },
    "BLDR.MX": {
        "short_name": "BUILDERS FIRSTSOURCE INC",
        "long_name": "Builders FirstSource, Inc.",
        "summary": "Builders FirstSource, Inc., together with its subsidiaries, manufactures and supplies building materials, manufactured components, and construction services to professional homebuilders, sub-contractors, remodelers, and consumers in the United States. The company operates through four segments: Northeast, Southeast, South, and West. It offers lumber and lumber sheet goods comprising dimensional lumber, plywood, and oriented strand board products that are used in on-site house framing; manufactured products, such as wood floor and roof trusses, steel roof trusses, wall panels, stairs, and engineered wood products; and windows, and interior and exterior door units, as well as interior trims and custom products under the Synboard brand name. The company also offers gypsum, roofing, and insulation products, including wallboards, ceilings, joint treatments, and finishes; and siding, metal, and concrete products, such as vinyl, composite, and wood siding products, as well as exterior trims, other exteriors, metal studs, and cement products. In addition, it provides other building products and services, such as cabinets and hardware, as well as turn-key framing, shell construction, design assistance, and professional installation services. The company was formerly known as BSL Holdings, Inc. and changed its name to Builders FirstSource, Inc. in October 1999. Builders FirstSource, Inc. was founded in 1998 and is based in Dallas, Texas.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75201",
        "website": "http://www.bldr.com",
        "market_cap": 174142668800
    },
    "BLDR": {
        "short_name": "Builders FirstSource, Inc.",
        "long_name": "Builders FirstSource, Inc.",
        "summary": "Builders FirstSource, Inc., together with its subsidiaries, manufactures and supplies building materials, manufactured components, and construction services to professional homebuilders, sub-contractors, remodelers, and consumers in the United States. The company operates through four segments: Northeast, Southeast, South, and West. It offers lumber and lumber sheet goods comprising dimensional lumber, plywood, and oriented strand board products that are used in on-site house framing; manufactured products, such as wood floor and roof trusses, steel roof trusses, wall panels, stairs, and engineered wood products; and windows, and interior and exterior door units, as well as interior trims and custom products under the Synboard brand name. The company also offers gypsum, roofing, and insulation products, including wallboards, ceilings, joint treatments, and finishes; and siding, metal, and concrete products, such as vinyl, composite, and wood siding products, as well as exterior trims, other exteriors, metal studs, and cement products. In addition, it provides other building products and services, such as cabinets and hardware, as well as turn-key framing, shell construction, design assistance, and professional installation services. The company was formerly known as BSL Holdings, Inc. and changed its name to Builders FirstSource, Inc. in October 1999. Builders FirstSource, Inc. was founded in 1998 and is based in Dallas, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75201",
        "website": "http://www.bldr.com",
        "market_cap": 10844436480
    },
    "BURCA": {
        "short_name": "BURNHAM HOLDINGS INC",
        "long_name": "Burnham Holdings, Inc.",
        "summary": "Burnham Holdings, Inc. designs, manufactures, and sells boilers and related heating, ventilation, and air conditioning products and accessories for residential, commercial, and industrial applications in the United States and internationally. Its residential hydronic heating products include cast iron, stainless steel, aluminum, and steel boilers; cast iron and steel heat distribution products; and warm air furnaces and central air conditioning systems for the residential heating and cooling markets. The company's commercial and industrial heating products comprise a range of cast iron, stainless steel, fire tube, water tube, and copper tube boilers; and boiler room accessories that are used for various applications, such as military bases, multi-unit residential buildings, health care, government, education, and hospital facilities. It sells its residential products through wholesale distributors to builders, heating contractors, fuel dealers, and utilities for resale to residential customers; and commercial products primarily through independent sales agencies to contractors or end users. Burnham Holdings, Inc. was founded in 2002 and is based in Lancaster, Pennsylvania.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Lancaster",
        "zipcode": "17604-3245",
        "website": "http://www.burnhamholdings.com",
        "market_cap": 61661096
    },
    "BURCB": {
        "short_name": "BURNHAM HOLDINGS INC",
        "long_name": "Burnham Holdings, Inc.",
        "summary": "Burnham Holdings, Inc. designs, manufactures, and sells boilers and related heating, ventilation, and air conditioning products and accessories for residential, commercial, and industrial applications in the United States and internationally. Its residential hydronic heating products include cast iron, stainless steel, aluminum, and steel boilers; cast iron and steel heat distribution products; and warm air furnaces and central air conditioning systems for the residential heating and cooling markets. The company's commercial and industrial heating products comprise a range of cast iron, stainless steel, fire tube, water tube, and copper tube boilers; and boiler room accessories that are used for various applications, such as military bases, multi-unit residential buildings, health care, government, education, and hospital facilities. It sells its residential products through wholesale distributors to builders, heating contractors, fuel dealers, and utilities for resale to residential customers; and commercial products primarily through independent sales agencies to contractors or end users. Burnham Holdings, Inc. was founded in 2002 and is based in Lancaster, Pennsylvania.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Lancaster",
        "zipcode": "17604-3245",
        "website": "http://www.burnhamholdings.com",
        "market_cap": 62561204
    },
    "BXC": {
        "short_name": "Bluelinx Holdings Inc.",
        "long_name": "BlueLinx Holdings Inc.",
        "summary": "BlueLinx Holdings Inc., together with its subsidiaries, distributes residential and commercial building products in the United States. It distributes structural products, including plywood, oriented strand board, rebar and remesh, lumber, spruce, and other wood products primarily that are used for structural support and walls in construction projects; and specialty products comprising engineered wood, moulding, siding and trim, cedar, metal, and insulation products. The company also provides a range of value-added services and solutions to its customers and suppliers. It serves dealers, specialty distributors, national home centers, and manufactured housing customers through a network of distribution centers. The company is headquartered in Marietta, Georgia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Marietta",
        "zipcode": "30067",
        "website": "http://www.bluelinxco.com",
        "market_cap": 632559744
    },
    "C1RR34.SA": {
        "short_name": "CARRIER GLOBDRN",
        "long_name": "Carrier Global Corporation",
        "summary": "Carrier Global Corporation provides heating, ventilating, and air conditioning (HVAC), refrigeration, fire, security, and building automation technologies worldwide. It operates through three segments: HVAC, Refrigeration, and Fire & Security. The HVAC segment provides products, controls, services, and solutions to meet the heating and cooling needs of residential and commercial customers. Its products include air conditioners, heating systems, controls, and aftermarket components, as well as aftermarket repair and maintenance services and building automation solutions. The Refrigeration segment offers transport refrigeration products and services, including refrigeration and monitoring systems for trucks, trailers, shipping containers, intermodal, and rail; and commercial refrigeration solutions, such as refrigerated cabinets, freezers, systems, and controls. The Fire & Security segment provides various residential and building systems, including fire, flame, gas, smoke, and carbon monoxide detection; portable fire extinguishers; fire suppression systems; intruder alarms; access control systems; video management systems; and electronic controls. Its other fire and security service offerings comprise audit, design, installation, and system integration, as well as aftermarket maintenance and repair and monitoring services. The company offers its products under the Autronica, Chubb, Det-Tronics, Edwards, Fireye, GST, Kidde, LenelS2, Marioff, Onity, and Supra; and Carrier, Automated Logic, BluEdge, Bryant, CIAT, Day & Night, Heil, NORESCO, and Riello brands. It sells its products directly to building contractors and owners, transportation companies and retail stores, and end customers, as well as indirectly through equity method investees, independent sales representatives, distributors, wholesalers, dealers, retail outlets, manufacturers' representatives, and value-added resellers. The company was incorporated in 2019 and is headquartered in Palm Beach Gardens, Florida.",
        "currency": "BRL",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "FL",
        "city": "Palm Beach Gardens",
        "zipcode": "33418",
        "website": "http://www.corporate.carrier.com",
        "market_cap": 209161207808
    },
    "CARR.MX": {
        "short_name": "CARRIER GLOBAL CORPORATION",
        "long_name": "Carrier Global Corporation",
        "summary": "Carrier Global Corporation provides heating, ventilating, and air conditioning (HVAC), refrigeration, fire, security, and building automation technologies worldwide. It operates through three segments: HVAC, Refrigeration, and Fire & Security. The HVAC segment provides products, controls, services, and solutions to meet the heating and cooling needs of residential and commercial customers. Its products include air conditioners, heating systems, controls, and aftermarket components, as well as aftermarket repair and maintenance services and building automation solutions. The Refrigeration segment offers transport refrigeration products and services, including refrigeration and monitoring systems for trucks, trailers, shipping containers, intermodal, and rail; and commercial refrigeration solutions, such as refrigerated cabinets, freezers, systems, and controls. The Fire & Security segment provides various residential and building systems, including fire, flame, gas, smoke, and carbon monoxide detection; portable fire extinguishers; fire suppression systems; intruder alarms; access control systems; video management systems; and electronic controls. Its other fire and security service offerings comprise audit, design, installation, and system integration, as well as aftermarket maintenance and repair and monitoring services. The company offers its products under the Autronica, Chubb, Det-Tronics, Edwards, Fireye, GST, Kidde, LenelS2, Marioff, Onity, and Supra; and Carrier, Automated Logic, BluEdge, Bryant, CIAT, Day & Night, Heil, NORESCO, and Riello brands. It sells its products directly to building contractors and owners, transportation companies and retail stores, and end customers, as well as indirectly through equity method investees, independent sales representatives, distributors, wholesalers, dealers, retail outlets, manufacturers' representatives, and value-added resellers. The company was incorporated in 2019 and is headquartered in Palm Beach Gardens, Florida.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "FL",
        "city": "Palm Beach Gardens",
        "zipcode": "33418",
        "website": "http://www.corporate.carrier.com",
        "market_cap": 723683442688
    },
    "CARR": {
        "short_name": "Carrier Global Corporation",
        "long_name": "Carrier Global Corporation",
        "summary": "Carrier Global Corporation provides heating, ventilating, and air conditioning (HVAC), refrigeration, fire, security, and building automation technologies worldwide. It operates through three segments: HVAC, Refrigeration, and Fire & Security. The HVAC segment provides products, controls, services, and solutions to meet the heating and cooling needs of residential and commercial customers. Its products include air conditioners, heating systems, controls, and aftermarket components, as well as aftermarket repair and maintenance services and building automation solutions. The Refrigeration segment offers transport refrigeration products and services, including refrigeration and monitoring systems for trucks, trailers, shipping containers, intermodal, and rail; and commercial refrigeration solutions, such as refrigerated cabinets, freezers, systems, and controls. The Fire & Security segment provides various residential and building systems, including fire, flame, gas, smoke, and carbon monoxide detection; portable fire extinguishers; fire suppression systems; intruder alarms; access control systems; video management systems; and electronic controls. Its other fire and security service offerings comprise audit, design, installation, and system integration, as well as aftermarket maintenance and repair and monitoring services. The company offers its products under the Autronica, Chubb, Det-Tronics, Edwards, Fireye, GST, Kidde, LenelS2, Marioff, Onity, and Supra; and Carrier, Automated Logic, BluEdge, Bryant, CIAT, Day & Night, Heil, NORESCO, and Riello brands. It sells its products directly to building contractors and owners, transportation companies and retail stores, and end customers, as well as indirectly through equity method investees, independent sales representatives, distributors, wholesalers, dealers, retail outlets, manufacturers' representatives, and value-added resellers. The company was incorporated in 2019 and is headquartered in Palm Beach Gardens, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Palm Beach Gardens",
        "zipcode": "33418",
        "website": "http://www.corporate.carrier.com",
        "market_cap": 38965915648
    },
    "CCOM": {
        "short_name": "CCOM GROUP INC",
        "long_name": "CCOM Group, Inc.",
        "summary": "CCOM Group, Inc., through its subsidiaries, distributes heating, ventilating, and air conditioning equipment (HVAC) in the United States. It also distributes whole-house generators; climate control systems; plumbing and electrical fixtures and supplies; and parts and accessories. In addition, the company provides control system design, custom control panel fabrication, technical field support, in-house training, and climate control consultation services for engineers and installers; and designs direct digital control systems, as well as systems that control multi-location facilities through the Internet. It markets its products to HVAC, plumbing, and electrical contractors; building contractors; and other users primarily in New Jersey, New York, Massachusetts, and portions of eastern Pennsylvania, Connecticut, and Vermont. The company was formerly known as Colonial Commercial Corp. and changed its name to CCOM Group, Inc. in July 2012. CCOM Group, Inc. was founded in 1964 and is based in Hawthorne, New Jersey.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Hawthorne",
        "zipcode": "07506",
        "website": "http://www.ccom-group.com",
        "market_cap": 4211280
    },
    "CLE.F": {
        "short_name": "CARLISLE COS. INC.  DL 1",
        "long_name": "Carlisle Companies Incorporated",
        "summary": "Carlisle Companies Incorporated operates as a diversified manufacturer of engineered products in the United States, Europe, Asia, Canada, Mexico, the Middle East, Africa, and internationally. It operates through four segments: Carlisle Construction Materials, Carlisle Interconnect Technologies, Carlisle Fluid Technologies, and Carlisle Brake & Friction. The Carlisle Construction Materials segment produces building envelopes for commercial, industrial, and residential buildings, including single-ply roofing products, rigid foam insulations, spray polyurethane foam, architectural metal products, heating, ventilation and air conditioning hardware and sealants, waterproofing products, and air and vapor barrier systems. The Carlisle Interconnect Technologies segment produces wires and cables for the commercial aerospace, military and defense electronics, medical device, industrial, and test and measurement markets. It also offers sensors, connectors, contacts, cable assemblies, complex harnesses, racks, trays, and installation kits, as well as engineering and certification services. The Carlisle Fluid Technologies segment produces engineered liquid products, powder products, sealants and adhesives finishing equipment, and integrated system solutions for spraying, pumping, mixing, metering, and curing of coatings used in the automotive manufacture, general industrial, protective coating, wood, and specialty and automotive refinishing markets. The Carlisle Brake & Friction segment provides duty brakes, and clutch and transmission products for the construction, agriculture, mining, aircraft, on-highway, and other industrial markets. The company sells its products under the Carlisle, Binks, DeVilbiss, Ransburg, BGK, MS Powder, Hawk, Wellman, Thermax, Tri-Star, LHi Technology, Providien, SynTec, Weatherbond, Hunter Panels, Resitrix, Hertalan, Insulfoam, and Velvetouch brands. Carlisle Companies Incorporated was founded in 1917 and is headquartered in Scottsdale, Arizona.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "AZ",
        "city": "Scottsdale",
        "zipcode": "85254",
        "website": "http://www.carlisle.com",
        "market_cap": 8079687168
    },
    "CLG.F": {
        "short_name": "GMS INC.  DL-,01",
        "long_name": "GMS Inc.",
        "summary": "GMS Inc. distributes wallboards, suspended ceilings systems, and complementary building products in the United States and Canada. The company offers ceilings products, including suspended mineral fibers, soft fibers, and metal ceiling systems primarily used in offices, hotels, hospitals, retail facilities, schools, and various other commercial and institutional buildings. It also provides steel framing products, such as steel tracks, studs, and various other steel products used to frame the interior walls of a commercial or institutional building; and insulation, lumber, ready-mix joint compound, and various other interior construction products, as well as ancillary products comprising tools and safety products. In addition, the company distributes wallboards, drywall, metal studs, and insulation and ceiling tiles, as well as commercial and residential building materials. As of April 30, 2020, it operated 264 branches across 44 states and the District of Columbia, as well as 5 provinces in Canada. The company also operates a network of approximately 260 distribution centers. The company was formerly known as GYP Holdings I Corp. and changed its name to GMS Inc. in July 2015. GMS Inc. was founded in 1971 and is headquartered in Tucker, Georgia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "GA",
        "city": "Tucker",
        "zipcode": "30084",
        "website": "http://www.gms.com",
        "market_cap": 1525712256
    },
    "CNR": {
        "short_name": "Cornerstone Building Brands, In",
        "long_name": "Cornerstone Building Brands, Inc.",
        "summary": "Cornerstone Building Brands, Inc., together with its subsidiaries, designs, engineers, manufactures, markets, and installs external building products for the commercial, residential, and repair and remodel markets in the United States, Canada, Mexico, and internationally. The company operates through three segments: Windows, Siding, and Commercial. Its Windows segment provides vinyl, aluminum, wood, and aluminum clad-wood windows and patio doors; and steel, wood, and fiberglass entry doors under the Ply Gem, Simonton, Atrium, American Craftsman, Silver Line, Great Lakes Window, and North Star brands. The company's Siding segment offers vinyl siding and skirting, composite siding, steel siding, vinyl and aluminum soffit, aluminum trim coil, aluminum gutter coil, fabricated aluminum gutter protection, PVC trim and moldings, and window and door trim products, as well as injection molded accents, such as shakes, shingles, shutters and vents, vinyl fencing and railing, and stone veneer. Its Commercial segment designs, engineers, manufactures, and distributes a range of metal products, such as metal building systems, metal roofing and wall systems, insulated metal panels, steel curtain roll-up and self-storage doors, and coil coatings. The company was formerly known as NCI Building Systems, Inc. and changed its name to Cornerstone Building Brands, Inc. in May 2019. Cornerstone Building Brands, Inc. was founded in 1984 and is headquartered in Cary, North Carolina.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NC",
        "city": "Cary",
        "zipcode": "27513",
        "website": "http://www.cornerstonebuildingbrands.com",
        "market_cap": 1903991296
    },
    "CSL": {
        "short_name": "Carlisle Companies Incorporated",
        "long_name": "Carlisle Companies Incorporated",
        "summary": "Carlisle Companies Incorporated operates as a diversified manufacturer of engineered products in the United States, Europe, Asia, Canada, Mexico, the Middle East, Africa, and internationally. It operates through four segments: Carlisle Construction Materials, Carlisle Interconnect Technologies, Carlisle Fluid Technologies, and Carlisle Brake & Friction. The Carlisle Construction Materials segment produces building envelopes for commercial, industrial, and residential buildings, including single-ply roofing products, rigid foam insulations, spray polyurethane foam, architectural metal products, heating, ventilation and air conditioning hardware and sealants, waterproofing products, and air and vapor barrier systems. The Carlisle Interconnect Technologies segment produces wires and cables for the commercial aerospace, military and defense electronics, medical device, industrial, and test and measurement markets. It also offers sensors, connectors, contacts, cable assemblies, complex harnesses, racks, trays, and installation kits, as well as engineering and certification services. The Carlisle Fluid Technologies segment produces engineered liquid products, powder products, sealants and adhesives finishing equipment, and integrated system solutions for spraying, pumping, mixing, metering, and curing of coatings used in the automotive manufacture, general industrial, protective coating, wood, and specialty and automotive refinishing markets. The Carlisle Brake & Friction segment provides duty brakes, and clutch and transmission products for the construction, agriculture, mining, aircraft, on-highway, and other industrial markets. The company sells its products under the Carlisle, Binks, DeVilbiss, Ransburg, BGK, MS Powder, Hawk, Wellman, Thermax, Tri-Star, LHi Technology, Providien, SynTec, Weatherbond, Hunter Panels, Resitrix, Hertalan, Insulfoam, and Velvetouch brands. Carlisle Companies Incorporated was founded in 1917 and is headquartered in Scottsdale, Arizona.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Scottsdale",
        "zipcode": "85254",
        "website": "http://www.carlisle.com",
        "market_cap": 9442836480
    },
    "DOOR": {
        "short_name": "Masonite International Corporat",
        "long_name": "Masonite International Corporation",
        "summary": "Masonite International Corporation designs, manufactures, markets, and distributes interior and exterior doors for the new construction and repair, renovation, and remodeling sectors of the residential and non-residential building construction markets worldwide. It offers molded panel, flush, stile and rail, routed medium-density fiberboard (MDF), steel, and fiberglass residential doors, as well as architectural interior doors. The company also provides various door components, including interior door facings, agri-fiber and particleboard door cores, MDF and wood cut-stock components, critical door components, wood veneer door skins, and mineral and particleboard door cores. It offers its products under the Masonite, Premdor, Masonite Architectural, Marshfield-Algoma, USA Wood Door, Mohawk, Solidor, Residor, Nicedor, Door-Stop International, Harring Doors, National Hickman, Graham-Maiman, Louisiana Millwork, Baillargeon, and BWI to remodeling contractors, builders, homeowners, retailers, dealers, lumberyards, commercial and general contractors, and architects through wholesale, retail, and direct distribution channels. The company was founded in 1925 and is headquartered in Tampa, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Tampa",
        "zipcode": "33605",
        "website": "http://www.masonite.com",
        "market_cap": 3020665344
    },
    "FRTA": {
        "short_name": "Forterra, Inc.",
        "long_name": "Forterra, Inc.",
        "summary": "Forterra, Inc. manufactures and sells pipe and precast products in the United States, Canada, and Mexico. It operates through Drainage Pipe & Products; and Water Pipe & Products segments. The company offers concrete drainage pipes used for storm water applications, residential and non-residential site developments, sanitary sewers, low-pressure sewer force mains, tunneled systems, treatment plant piping, and utility tunnels. It provides box culverts, utility vaults, manholes, drainage inlets, and pipe end sections used for roadway and airport drainage, storm water management, utility construction, and water treatment and filtration systems; and architectural panels for buildings, modular railroad crossings, retaining wall and storm water treatment systems, highway noise barriers, and concrete vaults that are used to house dry or wet utilities. The company offers hollow-core planks, prestressed bridge girders, beams, columns, wall panels, stairs, garage floors, and architectural claddings for infrastructure and non-residential applications; and precast concrete bridge girders for highway projects. It provides precast concrete foundation to support prefabricated shelters or equipment buildings; precast product that consolidates and protects underground electrical and communication cables; and storm water technologies for storm water management market. The company offers ductile iron pipes for transmission and distribution of potable and waste water, and smaller diameter applications; concrete pressure pipes for water transmission and distribution, power plant cooling water lines, sewage force mains for waste and storm water, and other various applications; and prestressed concrete and bar-wrapped concrete pipes. It serves construction contractors, developers, utility companies and contractors, municipalities, and waterworks distributors and contractors through distributors. The company was founded in 1899 and is headquartered in Irving, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Irving",
        "zipcode": "75062",
        "website": "http://www.forterrabp.com",
        "market_cap": 1560466432
    },
    "FZG1.F": {
        "short_name": "BLUELINX HLDGS  DL-,01",
        "long_name": "BlueLinx Holdings Inc.",
        "summary": "BlueLinx Holdings Inc., together with its subsidiaries, distributes residential and commercial building products in the United States. It distributes structural products, including plywood, oriented strand board, rebar and remesh, lumber, spruce, and other wood products primarily that are used for structural support and walls in construction projects; and specialty products comprising engineered wood, moulding, siding and trim, cedar, metal, and insulation products. The company also provides a range of value-added services and solutions to its customers and suppliers. It serves dealers, specialty distributors, national home centers, and manufactured housing customers through a network of distribution centers. The company is headquartered in Marietta, Georgia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "GA",
        "city": "Marietta",
        "zipcode": "30067",
        "website": "http://www.bluelinxco.com",
        "market_cap": 335205760
    },
    "GI2.F": {
        "short_name": "GIBRALTAR INDS  DL-,01",
        "long_name": "Gibraltar Industries, Inc.",
        "summary": "Gibraltar Industries, Inc. manufactures and distributes building products for the renewable energy, conservation, residential, and infrastructure markets in North America and Asia. It operates through three segments: Renewable Energy and Conservation, Residential Products, and Infrastructure Products. The Renewable Energy and Conservation segment designs, engineers, manufactures, and installs solar racking and electrical balance of systems, greenhouses, and botanical extraction systems. The Residential Products segment offers roof and foundation ventilation products and accessories, such as solar powered units; mail and electronic package solutions, including single mailboxes, cluster style mail and parcel boxes for single and multi-family housing, and electronic package locker systems; roof edgings and flashings; soffits and trims; drywall corner beads; metal roofing products and accessories; rain dispersion products comprising gutters and accessories; and exterior retractable awnings. This segment also provides electronic parcel lockers, rooftop safety kits, chimney caps, heat trace coils and exterior products, remote-controlled deck awnings for sun protection, and solar-powered ventilation products. The Infrastructure Products segment offers expansion joints, structural bearings, rubber pre-formed seals and other sealants, elastomeric concrete, and bridge cable protection systems. It serves solar developers, growers of food and plants, home improvement retailers, wholesalers, distributors, and contractors. Gibraltar Industries, Inc. was founded in 1972 and is headquartered in Buffalo, New York.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "Buffalo",
        "zipcode": "14219-0228",
        "website": "http://www.gibraltar1.com",
        "market_cap": 1984769024
    },
    "GMS": {
        "short_name": "GMS Inc.",
        "long_name": "GMS Inc.",
        "summary": "GMS Inc. distributes wallboards, suspended ceilings systems, and complementary building products in the United States and Canada. The company offers ceilings products, including suspended mineral fibers, soft fibers, and metal ceiling systems primarily used in offices, hotels, hospitals, retail facilities, schools, and various other commercial and institutional buildings. It also provides steel framing products, such as steel tracks, studs, and various other steel products used to frame the interior walls of a commercial or institutional building; and insulation, lumber, ready-mix joint compound, and various other interior construction products, as well as ancillary products comprising tools and safety products. In addition, the company distributes wallboards, drywall, metal studs, and insulation and ceiling tiles, as well as commercial and residential building materials. As of April 30, 2020, it operated 264 branches across 44 states and the District of Columbia, as well as 5 provinces in Canada. The company also operates a network of approximately 260 distribution centers. The company was formerly known as GYP Holdings I Corp. and changed its name to GMS Inc. in July 2015. GMS Inc. was founded in 1971 and is headquartered in Tucker, Georgia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Tucker",
        "zipcode": "30084",
        "website": "http://www.gms.com",
        "market_cap": 1869825536
    },
    "IBP": {
        "short_name": "Installed Building Products, In",
        "long_name": "Installed Building Products, Inc.",
        "summary": "Installed Building Products, Inc., together with its subsidiaries, engages in the installation of insulation, waterproofing, fire-stopping, fireproofing, garage doors, rain gutters, window blinds, shower doors, closet shelving and mirrors, and other products in the continental United States. It offers a range of insulation materials, such as fiberglass and cellulose, and spray foam insulation materials. The company is also involved in the installation of insulation and sealant materials in various areas of a structure, which includes basement and crawl space, building envelope, attic, and acoustical applications. In addition, it installs a range of advanced caulk and sealant products that control air infiltration in residential and commercial buildings, as well as moisture protection systems. It serves homebuilders, multi-family and commercial construction firms, individual homeowners, and repair and remodeling contractors through a network of approximately 190 branch locations. The company was formerly known as CCIB Holdco, Inc. Installed Building Products, Inc. was founded in 1977 and is headquartered in Columbus, Ohio.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Columbus",
        "zipcode": "43215",
        "website": "http://www.installedbuildingproducts.com",
        "market_cap": 3787412992
    },
    "JELD": {
        "short_name": "JELD-WEN Holding, Inc.",
        "long_name": "JELD-WEN Holding, Inc.",
        "summary": "JELD-WEN Holding, Inc. designs, manufactures, and sells doors and windows primarily in North America, Europe, and Australasia. The company offers a line of residential interior and exterior door products, including patio doors, and folding or sliding wall systems; non-residential doors; and wood, vinyl, aluminum, and wood composite windows. It also provides other ancillary products and services, such as shower enclosures and wardrobes, moldings, trim boards, lumber, cutstocks, glass, staircases, hardware and locks, cabinets, and screens, as well as molded door skins, and miscellaneous installation and other services. The company markets its products under the JELD-WEN brand; and various regional brands, such as Swedoor, DANA, Corinthian, Stegbar, and Trend. It serves wholesale distributors and retailers, as well as individual contractors and consumers. The company was founded in 1960 and is headquartered in Charlotte, North Carolina.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NC",
        "city": "Charlotte",
        "zipcode": "28273",
        "website": "http://www.jeld-wen.com",
        "market_cap": 3048096768
    },
    "LGNC": {
        "short_name": "LOGAN CLAY PRODUCTS CO",
        "long_name": "Logan Clay Products Company",
        "summary": "Logan Clay Products Company produces and sells sanitary sewer pipes and building products. The company's pipe products include O-ring joints; Y- and T-branches; pipe fittings, such as curves, elbows, saddles, increasers and reducers, and double hubs and stoppers; and traps, including running traps, P-traps, shoulder hand hole traps, half traps, and catch basin traps. It also offers building products comprising chimney tops, flue liners, sump pipes and meter boxes, wall copings, and Rumford fireplaces. The company was founded in 1950 and is based in Logan, Ohio.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Logan",
        "zipcode": "43138",
        "website": "http://www.loganclaypipe.com",
        "market_cap": 40800000
    },
    "LP3.F": {
        "short_name": "LOUIS. PAC. CORP.  DL 1",
        "long_name": "Louisiana-Pacific Corporation",
        "summary": "Louisiana-Pacific Corporation, together with its subsidiaries, manufactures and markets building products primarily for use in new home construction, repair and remodeling, and outdoor structure markets. It operates through four segments: Siding; Oriented Strand Board (OSB); Engineered Wood Products (EWP); and South America. The Siding segment offers LP SmartSide trim and siding products, ExpertFinish prefinished siding products, and LP outdoor building solutions for premium outdoor buildings; and engineered wood siding, trim, soffit, and fascia products. The OSB segment manufactures and distributes OSB structural panel products comprising LP TechShield radiant barriers, LP WeatherLogic air and water barriers, LP Legacy premium sub-flooring products, LP FlameBlock fire-rated sheathing products, and LP TopNotch sub-flooring products. The EWP segment provides laminated veneer lumber, laminated strand lumber, and other related products; and I-joists, which are primarily used in residential and commercial floorings, roofing systems, and other structural applications. The South America segment manufactures and distributes OSB structural panel and siding products. This segment also distributes and sells related products for the region's transition to wood frame construction. It also offers timber and timberlands and other products and services. The company sells its products primarily to retailers, wholesalers, and homebuilding and industrial businesses in North America and South America, as well as in Asia, Australia, and Europe. Louisiana-Pacific Corporation was incorporated in 1972 and is headquartered in Nashville, Tennessee.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TN",
        "city": "Nashville",
        "zipcode": "37219-1700",
        "website": "http://www.lpcorp.com",
        "market_cap": 5295135744
    },
    "LPPI": {
        "short_name": "LEEP INC",
        "long_name": "LEEP, Inc.",
        "summary": "LEEP, Inc. manufactures and sells building materials. The company offers LeepCore, a structural insulated panel, used to construct freestanding walls, floors, and roofs of residential and commercial buildings. Its products are used in the construction of single-family homes, low and mid-rise buildings, academic and commercial construction, military and remote sites, and emergency and portable housing construction. The company is based in Louisville, Kentucky.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "KY",
        "city": "Louisville",
        "zipcode": "40224",
        "website": "http://www.leepinc.com",
        "market_cap": 139688
    },
    "LPX": {
        "short_name": "Louisiana-Pacific Corporation",
        "long_name": "Louisiana-Pacific Corporation",
        "summary": "Louisiana-Pacific Corporation, together with its subsidiaries, manufactures and markets building products primarily for use in new home construction, repair and remodeling, and outdoor structure markets. It operates through four segments: Siding; Oriented Strand Board (OSB); Engineered Wood Products (EWP); and South America. The Siding segment offers LP SmartSide trim and siding products, ExpertFinish prefinished siding products, and LP outdoor building solutions for premium outdoor buildings; and engineered wood siding, trim, soffit, and fascia products. The OSB segment manufactures and distributes OSB structural panel products comprising LP TechShield radiant barriers, LP WeatherLogic air and water barriers, LP Legacy premium sub-flooring products, LP FlameBlock fire-rated sheathing products, and LP TopNotch sub-flooring products. The EWP segment provides laminated veneer lumber, laminated strand lumber, and other related products; and I-joists, which are primarily used in residential and commercial floorings, roofing systems, and other structural applications. The South America segment manufactures and distributes OSB structural panel and siding products. This segment also distributes and sells related products for the region's transition to wood frame construction. It also offers timber and timberlands and other products and services. The company sells its products primarily to retailers, wholesalers, and homebuilding and industrial businesses in North America and South America, as well as in Asia, Australia, and Europe. Louisiana-Pacific Corporation was incorporated in 1972 and is headquartered in Nashville, Tennessee.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TN",
        "city": "Nashville",
        "zipcode": "37219-1700",
        "website": "http://www.lpcorp.com",
        "market_cap": 7436861440
    },
    "M1AS34.SA": {
        "short_name": "MASCO CORP  DRN",
        "long_name": "Masco Corporation",
        "summary": "Masco Corporation designs, manufactures, and distributes home improvement and building products in North America, Europe, and internationally. The company operates through two segments, Plumbing Products and Decorative Architectural Products. The Plumbing Products segment offers faucets, showerheads, handheld showers, valves, bath hardware and accessories, bathing units, shower bases and enclosures, sinks, toilets, acrylic tubs, shower trays, spas, exercise pools, and fitness systems; brass, copper, and composite plumbing system components; connected water products; thermoplastic solutions, extruded plastic profiles, specialized fabrications, and PEX tubing products; and other non-decorative plumbing products. This segment provides its products under the DELTA, BRIZO, PEERLESS, HANSGROHE, AXOR, KRAUS, GINGER, NEWPORT BRASS, BRASSTECH, WALTEC, BRISTAN, HERITAGE, MIROLIN, HÃ\u009cPPE, HOT SPRING, CALDERA, FREEFLOW SPAS, FANTASY SPAS, ENDLESS POOLS, BRASSCRAFT, PLUMB SHOP, COBRA, COBRA PRO, and MASTER PLUMBER brands. The Decorative Architectural Products segment offers paints, primers, specialty coatings, stains, and waterproofing products, as well as paint applicators and accessories; cabinet and door hardware, functional hardware, wall plates, hook and rail products, closet organization systems, and picture hanging accessories; decorative bath hardware, mirrors, and shower accessories and doors; and decorative indoor and outdoor lighting fixtures, ceiling fans, landscape lighting, and LED lighting systems. This segment provides its products under the BEHR, KILZ, WHIZZ, Elder & Jenks, LIBERTY, BRAINERD, FRANKLIN BRASS, KICHLER, and Ã\u0089LAN brands. It sells its products to the plumbing, heating, and hardware wholesalers; home centers and online retailers; hardware stores; electrical and landscape distributors; lighting showrooms; building supply outlets; and other mass merchandisers. Masco Corporation was founded in 1929 and is headquartered in Livonia, Michigan.",
        "currency": "BRL",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "MI",
        "city": "Livonia",
        "zipcode": "48152",
        "website": "http://masco.com",
        "market_cap": 81485692928
    },
    "MAS.MX": {
        "short_name": "MASCO CORP",
        "long_name": "Masco Corporation",
        "summary": "Masco Corporation designs, manufactures, and distributes home improvement and building products in North America, Europe, and internationally. The company operates through two segments, Plumbing Products and Decorative Architectural Products. The Plumbing Products segment offers faucets, showerheads, handheld showers, valves, bath hardware and accessories, bathing units, shower bases and enclosures, sinks, toilets, acrylic tubs, shower trays, spas, exercise pools, and fitness systems; brass, copper, and composite plumbing system components; connected water products; thermoplastic solutions, extruded plastic profiles, specialized fabrications, and PEX tubing products; and other non-decorative plumbing products. This segment provides its products under the DELTA, BRIZO, PEERLESS, HANSGROHE, AXOR, KRAUS, GINGER, NEWPORT BRASS, BRASSTECH, WALTEC, BRISTAN, HERITAGE, MIROLIN, HÃ\u009cPPE, HOT SPRING, CALDERA, FREEFLOW SPAS, FANTASY SPAS, ENDLESS POOLS, BRASSCRAFT, PLUMB SHOP, COBRA, COBRA PRO, and MASTER PLUMBER brands. The Decorative Architectural Products segment offers paints, primers, specialty coatings, stains, and waterproofing products, as well as paint applicators and accessories; cabinet and door hardware, functional hardware, wall plates, hook and rail products, closet organization systems, and picture hanging accessories; decorative bath hardware, mirrors, and shower accessories and doors; and decorative indoor and outdoor lighting fixtures, ceiling fans, landscape lighting, and LED lighting systems. This segment provides its products under the BEHR, KILZ, WHIZZ, Elder & Jenks, LIBERTY, BRAINERD, FRANKLIN BRASS, KICHLER, and Ã\u0089LAN brands. It sells its products to the plumbing, heating, and hardware wholesalers; home centers and online retailers; hardware stores; electrical and landscape distributors; lighting showrooms; building supply outlets; and other mass merchandisers. Masco Corporation was founded in 1929 and is headquartered in Livonia, Michigan.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "MI",
        "city": "Livonia",
        "zipcode": "48152",
        "website": "http://masco.com",
        "market_cap": 304407314432
    },
    "MAS": {
        "short_name": "Masco Corporation",
        "long_name": "Masco Corporation",
        "summary": "Masco Corporation designs, manufactures, and distributes home improvement and building products in North America, Europe, and internationally. The company operates through two segments, Plumbing Products and Decorative Architectural Products. The Plumbing Products segment offers faucets, showerheads, handheld showers, valves, bath hardware and accessories, bathing units, shower bases and enclosures, sinks, toilets, acrylic tubs, shower trays, spas, exercise pools, and fitness systems; brass, copper, and composite plumbing system components; connected water products; thermoplastic solutions, extruded plastic profiles, specialized fabrications, and PEX tubing products; and other non-decorative plumbing products. This segment provides its products under the DELTA, BRIZO, PEERLESS, HANSGROHE, AXOR, KRAUS, GINGER, NEWPORT BRASS, BRASSTECH, WALTEC, BRISTAN, HERITAGE, MIROLIN, HÃ\u009cPPE, HOT SPRING, CALDERA, FREEFLOW SPAS, FANTASY SPAS, ENDLESS POOLS, BRASSCRAFT, PLUMB SHOP, COBRA, COBRA PRO, and MASTER PLUMBER brands. The Decorative Architectural Products segment offers paints, primers, specialty coatings, stains, and waterproofing products, as well as paint applicators and accessories; cabinet and door hardware, functional hardware, wall plates, hook and rail products, closet organization systems, and picture hanging accessories; decorative bath hardware, mirrors, and shower accessories and doors; and decorative indoor and outdoor lighting fixtures, ceiling fans, landscape lighting, and LED lighting systems. This segment provides its products under the BEHR, KILZ, WHIZZ, Elder & Jenks, LIBERTY, BRAINERD, FRANKLIN BRASS, KICHLER, and Ã\u0089LAN brands. It sells its products to the plumbing, heating, and hardware wholesalers; home centers and online retailers; hardware stores; electrical and landscape distributors; lighting showrooms; building supply outlets; and other mass merchandisers. Masco Corporation was founded in 1929 and is headquartered in Livonia, Michigan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MI",
        "city": "Livonia",
        "zipcode": "48152",
        "website": "http://masco.com",
        "market_cap": 16968132608
    },
    "MCCK": {
        "short_name": "MESTEK INC",
        "long_name": "Mestek, Inc.",
        "summary": "Mestek, Inc., together with its subsidiaries, manufactures and sells heating, ventilating, and air conditioning products and equipment; and metal forming equipment in the United States and internationally. The company offers equipment for heating, ventilation, and air conditioning primarily under the Lockformer, lowaPrecision, Engel, and Lion brands; roll forming and flexible fabrication equipment; metal stamping products, including uncoilers, straighteners, press feeds, and dies; and coil metal processing products, including cut-to-length, multi-blanking, and coil slitting and precision corrective levelers. It also provides a range of aftermarket services, such as OEM replacement parts for existing and used equipment, and on-site service support and training services. In addition, it engages in equipment rebuilding and electrical installation works; and tube and pipe production and fabrication. Further, the company offers custom metal-framed skylights, canopies, curtain walls, covered walkways, rain screens/wall-cladding, structural glass/point fixed glass, and ornamental metal products. Additionally, it provides operable and fixed solar shading louver systems; and architectural louvers, grilles, vision screens, penthouses, and brise soleil fixed sunshades. Mestek, Inc. was founded in 1898 and is based in Westfield, Massachusetts.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Westfield",
        "zipcode": "01085",
        "website": "http://www.mestek.com",
        "market_cap": 193914000
    },
    "MII.F": {
        "short_name": "MASONITE INTL CORP.",
        "long_name": "Masonite International Corporation",
        "summary": "Masonite International Corporation designs, manufactures, markets, and distributes interior and exterior doors for the new construction and repair, renovation, and remodeling sectors of the residential and non-residential building construction markets worldwide. It offers molded panel, flush, stile and rail, routed medium-density fiberboard (MDF), steel, and fiberglass residential doors, as well as architectural interior doors. The company also provides various door components, including interior door facings, agri-fiber and particleboard door cores, MDF and wood cut-stock components, critical door components, wood veneer door skins, and mineral and particleboard door cores. It offers its products under the Masonite, Premdor, Masonite Architectural, Marshfield-Algoma, USA Wood Door, Mohawk, Solidor, Residor, Nicedor, Door-Stop International, Harring Doors, National Hickman, Graham-Maiman, Louisiana Millwork, Baillargeon, and BWI to remodeling contractors, builders, homeowners, retailers, dealers, lumberyards, commercial and general contractors, and architects through wholesale, retail, and direct distribution channels. The company was founded in 1925 and is headquartered in Tampa, Florida.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "FL",
        "city": "Tampa",
        "zipcode": "33605",
        "website": "http://www.masonite.com",
        "market_cap": 2654377728
    },
    "MSQ.DE": {
        "short_name": "MASCO CORP.  DL 1",
        "long_name": "Masco Corporation",
        "summary": "Masco Corporation designs, manufactures, and distributes home improvement and building products in North America, Europe, and internationally. The company operates through two segments, Plumbing Products and Decorative Architectural Products. The Plumbing Products segment offers faucets, showerheads, handheld showers, valves, bath hardware and accessories, bathing units, shower bases and enclosures, sinks, toilets, acrylic tubs, shower trays, spas, exercise pools, and fitness systems; brass, copper, and composite plumbing system components; connected water products; thermoplastic solutions, extruded plastic profiles, specialized fabrications, and PEX tubing products; and other non-decorative plumbing products. This segment provides its products under the DELTA, BRIZO, PEERLESS, HANSGROHE, AXOR, KRAUS, GINGER, NEWPORT BRASS, BRASSTECH, WALTEC, BRISTAN, HERITAGE, MIROLIN, HÃ\u009cPPE, HOT SPRING, CALDERA, FREEFLOW SPAS, FANTASY SPAS, ENDLESS POOLS, BRASSCRAFT, PLUMB SHOP, COBRA, COBRA PRO, and MASTER PLUMBER brands. The Decorative Architectural Products segment offers paints, primers, specialty coatings, stains, and waterproofing products, as well as paint applicators and accessories; cabinet and door hardware, functional hardware, wall plates, hook and rail products, closet organization systems, and picture hanging accessories; decorative bath hardware, mirrors, and shower accessories and doors; and decorative indoor and outdoor lighting fixtures, ceiling fans, landscape lighting, and LED lighting systems. This segment provides its products under the BEHR, KILZ, WHIZZ, Elder & Jenks, LIBERTY, BRAINERD, FRANKLIN BRASS, KICHLER, and Ã\u0089LAN brands. It sells its products to the plumbing, heating, and hardware wholesalers; home centers and online retailers; hardware stores; electrical and landscape distributors; lighting showrooms; building supply outlets; and other mass merchandisers. Masco Corporation was founded in 1929 and is headquartered in Livonia, Michigan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "MI",
        "city": "Livonia",
        "zipcode": "48152",
        "website": "http://masco.com",
        "market_cap": 11990487040
    },
    "MSQ.F": {
        "short_name": "MASCO CORP.  DL 1",
        "long_name": "Masco Corporation",
        "summary": "Masco Corporation designs, manufactures, and distributes home improvement and building products in North America, Europe, and internationally. The company operates through two segments, Plumbing Products and Decorative Architectural Products. The Plumbing Products segment offers faucets, showerheads, handheld showers, valves, bath hardware and accessories, bathing units, shower bases and enclosures, sinks, toilets, acrylic tubs, shower trays, spas, exercise pools, and fitness systems; brass, copper, and composite plumbing system components; connected water products; thermoplastic solutions, extruded plastic profiles, specialized fabrications, and PEX tubing products; and other non-decorative plumbing products. This segment provides its products under the DELTA, BRIZO, PEERLESS, HANSGROHE, AXOR, KRAUS, GINGER, NEWPORT BRASS, BRASSTECH, WALTEC, BRISTAN, HERITAGE, MIROLIN, HÃ\u009cPPE, HOT SPRING, CALDERA, FREEFLOW SPAS, FANTASY SPAS, ENDLESS POOLS, BRASSCRAFT, PLUMB SHOP, COBRA, COBRA PRO, and MASTER PLUMBER brands. The Decorative Architectural Products segment offers paints, primers, specialty coatings, stains, and waterproofing products, as well as paint applicators and accessories; cabinet and door hardware, functional hardware, wall plates, hook and rail products, closet organization systems, and picture hanging accessories; decorative bath hardware, mirrors, and shower accessories and doors; and decorative indoor and outdoor lighting fixtures, ceiling fans, landscape lighting, and LED lighting systems. This segment provides its products under the BEHR, KILZ, WHIZZ, Elder & Jenks, LIBERTY, BRAINERD, FRANKLIN BRASS, KICHLER, and Ã\u0089LAN brands. It sells its products to the plumbing, heating, and hardware wholesalers; home centers and online retailers; hardware stores; electrical and landscape distributors; lighting showrooms; building supply outlets; and other mass merchandisers. Masco Corporation was founded in 1929 and is headquartered in Livonia, Michigan.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MI",
        "city": "Livonia",
        "zipcode": "48152",
        "website": "http://masco.com",
        "market_cap": 12252363776
    },
    "NCUN.F": {
        "short_name": "CORNERSTONE BUILD. DL-,01",
        "long_name": "Cornerstone Building Brands, Inc.",
        "summary": "Cornerstone Building Brands, Inc., together with its subsidiaries, designs, engineers, manufactures, markets, and installs external building products for the commercial, residential, and repair and remodel markets in the United States, Canada, Mexico, and internationally. The company operates through three segments: Windows, Siding, and Commercial. Its Windows segment provides vinyl, aluminum, wood, and aluminum clad-wood windows and patio doors; and steel, wood, and fiberglass entry doors under the Ply Gem, Simonton, Atrium, American Craftsman, Silver Line, Great Lakes Window, and North Star brands. The company's Siding segment offers vinyl siding and skirting, composite siding, steel siding, vinyl and aluminum soffit, aluminum trim coil, aluminum gutter coil, fabricated aluminum gutter protection, PVC trim and moldings, and window and door trim products, as well as injection molded accents, such as shakes, shingles, shutters and vents, vinyl fencing and railing, and stone veneer. Its Commercial segment designs, engineers, manufactures, and distributes a range of metal products, such as metal building systems, metal roofing and wall systems, insulated metal panels, steel curtain roll-up and self-storage doors, and coil coatings. The company was formerly known as NCI Building Systems, Inc. and changed its name to Cornerstone Building Brands, Inc. in May 2019. Cornerstone Building Brands, Inc. was founded in 1984 and is headquartered in Cary, North Carolina.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NC",
        "city": "Cary",
        "zipcode": "27513",
        "website": "http://www.cornerstonebuildingbrands.com",
        "market_cap": 1981426944
    },
    "NX": {
        "short_name": "Quanex Building Products Corpor",
        "long_name": "Quanex Building Products Corporation",
        "summary": "Quanex Building Products Corporation, together with its subsidiaries, provides components for the fenestration industry worldwide. It operates through three segments: North American Fenestration, European Fenestration, and North American Cabinet Components. The company offers flexible insulating glass spacers, extruded vinyl profiles, window and door screens, and precision-formed metal and wood products, as well as cabinet doors and other components for original equipment manufacturers (OEMs) in the kitchen and bathroom cabinet industry. It also provides various non-fenestration components and products, including solar panel sealants, trim moldings, vinyl decking, fencing, water retention barriers, and conservatory roof components. The company sells its products to OEMs in the building products industry through sales representatives, direct sales force, distributors, and independent sales agents. Quanex Building Products Corporation was founded in 1927 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77027",
        "website": "http://www.quanex.com",
        "market_cap": 959082112
    },
    "O5Q.F": {
        "short_name": "OWENS CORNING NEW  DL-,01",
        "long_name": "Owens Corning",
        "summary": "Owens Corning manufactures and markets a range of insulation, roofing, and fiberglass composite materials in the United States, Canada, Europe, the Asia Pacific, and internationally. It operates in three segments: Composites, Insulation, and Roofing. The Composites segment manufactures, fabricates, and sells glass reinforcements in the form of fiber; and manufactures and sells glass fiber products in the form of fabrics, non-wovens, and other specialized products. Its products are used in pipe, roofing shingles, sporting goods, consumer electronics, telecommunications cables, boats, aviation, automotive, industrial containers, and wind-energy applications in the building and construction, transportation, consumer, industrial, and power and energy markets. The Insulation segment manufactures and sells fiberglass insulation for residential, commercial, industrial, and other markets for thermal and acoustical applications; and manufactures and sells glass fiber pipe insulation, flexible duct media, bonded and granulated mineral fiber insulation, cellular glass insulation, and foam insulation used in construction applications. This segment sells its products primarily to the insulation installers, home centers, lumberyards, retailers, and distributors under the Thermafiber, FOAMULAR, FOAMGLAS, Paroc, Owens Corning PINK, and FIBERGLAS Insulation brand names. The Roofing segment manufactures and sells residential roofing shingles, oxidized asphalt materials, and roofing components used in residential and commercial construction, and specialty applications, as well as synthetic packaging materials. This segment sells its products through distributors, home centers, lumberyards, retailers, and contractors, as well as to roofing contractors for built-up roofing asphalt systems; and manufacturers in automotive, chemical, rubber, and construction industries. Owens Corning was incorporated in 1938 and is headquartered in Toledo, Ohio.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Toledo",
        "zipcode": "43659",
        "website": "http://www.owenscorning.com",
        "market_cap": 8842399744
    },
    "OC": {
        "short_name": "Owens Corning Inc",
        "long_name": "Owens Corning",
        "summary": "Owens Corning manufactures and markets a range of insulation, roofing, and fiberglass composite materials in the United States, Canada, Europe, the Asia Pacific, and internationally. It operates in three segments: Composites, Insulation, and Roofing. The Composites segment manufactures, fabricates, and sells glass reinforcements in the form of fiber; and manufactures and sells glass fiber products in the form of fabrics, non-wovens, and other specialized products. Its products are used in pipe, roofing shingles, sporting goods, consumer electronics, telecommunications cables, boats, aviation, automotive, industrial containers, and wind-energy applications in the building and construction, transportation, consumer, industrial, and power and energy markets. The Insulation segment manufactures and sells fiberglass insulation for residential, commercial, industrial, and other markets for thermal and acoustical applications; and manufactures and sells glass fiber pipe insulation, flexible duct media, bonded and granulated mineral fiber insulation, cellular glass insulation, and foam insulation used in construction applications. This segment sells its products primarily to the insulation installers, home centers, lumberyards, retailers, and distributors under the Thermafiber, FOAMULAR, FOAMGLAS, Paroc, Owens Corning PINK, and FIBERGLAS Insulation brand names. The Roofing segment manufactures and sells residential roofing shingles, oxidized asphalt materials, and roofing components used in residential and commercial construction, and specialty applications, as well as synthetic packaging materials. This segment sells its products through distributors, home centers, lumberyards, retailers, and contractors, as well as to roofing contractors for built-up roofing asphalt systems; and manufacturers in automotive, chemical, rubber, and construction industries. Owens Corning was incorporated in 1938 and is headquartered in Toledo, Ohio.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Toledo",
        "zipcode": "43659",
        "website": "http://www.owenscorning.com",
        "market_cap": 11131185152
    },
    "OWY.F": {
        "short_name": "BEACON ROOFING S.  DL-,01",
        "long_name": "Beacon Roofing Supply, Inc.",
        "summary": "Beacon Roofing Supply, Inc., together with its subsidiaries, distributes residential and non-residential roofing materials, and complementary building products to contractors, home builders, building owners, and retailers. The company's residential roofing products include asphalt shingles, synthetic slates and tiles, clay and concrete tiles, slates, nail base insulations, metal roofing, felts, synthetic underlayment, wood shingles and shakes, nails and fasteners, metal edgings and flashings, prefabricated flashings, ridges and soffit vents, and solar systems. Its non-residential roofing products comprise single-ply roofing, asphalt, metal, modified bitumen, and build-up roofing products; cements and coatings; flat stock and tapered insulations; commercial fasteners; metal edges and flashings; smoke/roof hatches; roofing tools; sheet metal products, including copper, aluminum, and steel; and PVC, TPO, and EPDM membrane products. The company also provides complementary building products, such as vinyl and fiber cement sidings; wallboards; insulations; acoustical ceilings; stone veneers; windows; doors; skylights; gutters and downspouts; decking and railings; air barriers; concrete restoration systems; and steel stud framing and waterproofing systems. In addition, it offers value-added services, including advice and assistance on product identification, specification, technical support, and training; job site delivery, rooftop loading, and logistical services; tapered insulation design and related layout services; metal fabrication and related metal roofing design and layout services; trade credit and online bill pay; and marketing support for contractors. As of September 30, 2020, the company operated through a network of 524 branches in 50 states of the United States and 6 provinces in Canada. Beacon Roofing Supply, Inc. was founded in 1928 and is headquartered in Herndon, Virginia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "VA",
        "city": "Herndon",
        "zipcode": "20170",
        "website": "http://www.becn.com",
        "market_cap": 3508289280
    },
    "P9I.F": {
        "short_name": "PGT INNOVATIONS INC.DL-01",
        "long_name": "PGT Innovations, Inc.",
        "summary": "PGT Innovations, Inc., together with its subsidiaries, manufactures and supplies impact-resistant residential windows and doors in the Southeastern United States, Western United States, the Gulf Coast, Coastal mid-Atlantic, the Caribbean, Central America, and Canada. It offers heavy-duty aluminum or vinyl frames with laminated glass to provide protection from hurricane-force winds and wind-borne debris; and non-impact vinyl windows with insulating glass and multi-chambered frames for various climate zones. The company also offers customizable non-impact-resistant aluminum frame windows and doors; and non-glass vertical and horizontal sliding panels for porch enclosures, including vinyl-glazed aluminum-framed products used for enclosing screened-in porches that provide protection from inclement weather. In addition, it offers premium aluminum impact-resistant products; aluminum impact-resistant windows and doors; vinyl energy-efficient impact-resistant windows; and commercial storefront window system and entry doors. Further, it provides impact and non-impact sliding glass and terrace doors; fixed picture, single hung, and horizontal rolling windows; aluminum thermally broken doors and windows; fixed and operating windows; sliding, folding, and hinged doors; and moving glass walls and windows. The company offers its products under the PGT, CGI, WinDoor, NewSouth Window Solutions, ECO, and Western Windows Systems brands, as well as WinGuard, WinGuard Vinyl, EnergyVue, Eze-Breeze, Sentinel, Targa, Sparta, and Estate Collection names. It serves residential new construction, and home repair and remodeling end markets through window and building supply distributors, window replacement dealers, and enclosure contractors. The company was formerly known as PGT, Inc. and changed its name to PGT Innovations, Inc. in December 2016. PGT Innovations, Inc. was founded in 1980 and is headquartered in North Venice, Florida.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "FL",
        "city": "North Venice",
        "zipcode": "34275",
        "website": "http://pgtinnovations.com",
        "market_cap": 1191361536
    },
    "PGTI": {
        "short_name": "PGT Innovations, Inc.",
        "long_name": "PGT Innovations, Inc.",
        "summary": "PGT Innovations, Inc., together with its subsidiaries, manufactures and supplies impact-resistant residential windows and doors in the Southeastern United States, Western United States, the Gulf Coast, Coastal mid-Atlantic, the Caribbean, Central America, and Canada. It offers heavy-duty aluminum or vinyl frames with laminated glass to provide protection from hurricane-force winds and wind-borne debris; and non-impact vinyl windows with insulating glass and multi-chambered frames for various climate zones. The company also offers customizable non-impact-resistant aluminum frame windows and doors; and non-glass vertical and horizontal sliding panels for porch enclosures, including vinyl-glazed aluminum-framed products used for enclosing screened-in porches that provide protection from inclement weather. In addition, it offers premium aluminum impact-resistant products; aluminum impact-resistant windows and doors; vinyl energy-efficient impact-resistant windows; and commercial storefront window system and entry doors. Further, it provides impact and non-impact sliding glass and terrace doors; fixed picture, single hung, and horizontal rolling windows; aluminum thermally broken doors and windows; fixed and operating windows; sliding, folding, and hinged doors; and moving glass walls and windows. The company offers its products under the PGT, CGI, WinDoor, NewSouth Window Solutions, ECO, and Western Windows Systems brands, as well as WinGuard, WinGuard Vinyl, EnergyVue, Eze-Breeze, Sentinel, Targa, Sparta, and Estate Collection names. It serves residential new construction, and home repair and remodeling end markets through window and building supply distributors, window replacement dealers, and enclosure contractors. The company was formerly known as PGT, Inc. and changed its name to PGT Innovations, Inc. in December 2016. PGT Innovations, Inc. was founded in 1980 and is headquartered in North Venice, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "North Venice",
        "zipcode": "34275",
        "website": "http://pgtinnovations.com",
        "market_cap": 1676461184
    },
    "PPIH": {
        "short_name": "Perma-Pipe International Holdin",
        "long_name": "Perma-Pipe International Holdings, Inc.",
        "summary": "Perma-Pipe International Holdings, Inc., together with its subsidiaries, engineers, designs, manufactures, and sells specialty piping and leak detection systems. The company offers insulated and jacketed district heating and cooling piping systems for energy distribution from central energy plants to various locations; and primary and secondary containment piping systems for transporting chemicals, hazardous fluids, and petroleum products, as well as engages in the coating and insulation of oil and gas gathering and transmission pipelines. It has operations in the United States, Canada, the Middle East, Europe, India, and internationally. The company was formerly known as MFRI, Inc. and changed its name to Perma-Pipe International Holdings, Inc. in March 2017. Perma-Pipe International Holdings, Inc. was founded in 1909 and is headquartered in Niles, Illinois.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Niles",
        "zipcode": "60714",
        "website": "http://www.permapipe.com",
        "market_cap": 59032876
    },
    "ROCK": {
        "short_name": "Gibraltar Industries, Inc.",
        "long_name": "Gibraltar Industries, Inc.",
        "summary": "Gibraltar Industries, Inc. manufactures and distributes building products for the renewable energy, conservation, residential, and infrastructure markets in North America and Asia. It operates through three segments: Renewable Energy and Conservation, Residential Products, and Infrastructure Products. The Renewable Energy and Conservation segment designs, engineers, manufactures, and installs solar racking and electrical balance of systems, greenhouses, and botanical extraction systems. The Residential Products segment offers roof and foundation ventilation products and accessories, such as solar powered units; mail and electronic package solutions, including single mailboxes, cluster style mail and parcel boxes for single and multi-family housing, and electronic package locker systems; roof edgings and flashings; soffits and trims; drywall corner beads; metal roofing products and accessories; rain dispersion products comprising gutters and accessories; and exterior retractable awnings. This segment also provides electronic parcel lockers, rooftop safety kits, chimney caps, heat trace coils and exterior products, remote-controlled deck awnings for sun protection, and solar-powered ventilation products. The Infrastructure Products segment offers expansion joints, structural bearings, rubber pre-formed seals and other sealants, elastomeric concrete, and bridge cable protection systems. It serves solar developers, growers of food and plants, home improvement retailers, wholesalers, distributors, and contractors. Gibraltar Industries, Inc. was founded in 1972 and is headquartered in Buffalo, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Buffalo",
        "zipcode": "14219-0228",
        "website": "http://www.gibraltar1.com",
        "market_cap": 2631871488
    },
    "RWC.AX": {
        "short_name": "RWC CORP FPO",
        "long_name": "Reliance Worldwide Corporation Limited",
        "summary": "Reliance Worldwide Corporation Limited, together with its subsidiaries, designs, manufactures, and supplies water flow, control, and monitoring products and solutions for residential, commercial, and industrial applications. It offers fittings and pipes, including plumbing fittings, piping, and related products for the installation and repair of water reticulation systems; pipe support systems; and firestop solutions. The company also provides control valves, such as temperature and pressure relief valves for domestic and commercial storage hot water systems; non-return isolating valves; pressure regulation valves; backflow prevention devices; and specialist water safety valves. In addition, it offers thermostatic products comprising a range of thermostatic mixing valves, tempering valves, and thermostatic cartridges; and other products, which include underfloor heating components and kit systems, and water meters, including pneumatic and hydraulic fittings, water mains connection fittings, and repair sleeves and fire safety system products. The company provides its products under the SharkBite, JG Speedfit, HoldRite, CashAcme, Reliance Valves, StreamLabs, and John Guest brands. It has operations in Australia, New Zealand, Korea, China, the United States, Canada, the United Kingdom, Spain, Italy, Germany, France, the Czech Republic, and Poland. Reliance Worldwide Corporation Limited was founded in 1949 and is headquartered in Atlanta, Georgia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "ASX",
        "market": "au_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30318",
        "website": "http://www.rwc.com",
        "market_cap": 4108493824
    },
    "SSD": {
        "short_name": "Simpson Manufacturing Company, ",
        "long_name": "Simpson Manufacturing Co., Inc.",
        "summary": "Simpson Manufacturing Co., Inc., through its subsidiaries, designs, engineers, manufactures, and sells wood and concrete building construction products. The company offers wood construction products, including connectors, truss plates, fastening systems, fasteners, shearwalls, and pre-fabricated lateral systems that are used in light-frame construction; and concrete construction products comprising adhesives, specialty chemicals, mechanical anchors, carbide drill bits, powder actuated tools, fiber reinforced materials, and other repair products for use in concrete, masonry, and steel construction, as well as grouts, coatings, sealers, mortars, fiberglass and fiber-reinforced polymer systems, and asphalt products for use in concrete construction repair, protection, and strengthening applications. It also provides connectors and lateral products for wood framing, timber and offsite construction, mid-rise steel construction, and cold formed steel applications; and mechanical and adhesive anchors for concrete and masonry construction applications. In addition, the company offers engineering and design services, as well as software solutions that facilitates the specification, selection, and use of its products. It markets its products to the residential construction, light industrial and commercial construction, remodeling, and do-it-yourself markets in the United States, Canada, France, the United Kingdom, Germany, Denmark, Switzerland, Portugal, Poland, the Netherlands, Belgium, Spain, Sweden, Norway, Australia, New Zealand, China, Taiwan, and Vietnam. Simpson Manufacturing Co., Inc. was founded in 1956 and is headquartered in Pleasanton, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Pleasanton",
        "zipcode": "94588",
        "website": "http://www.simpsonmfg.com",
        "market_cap": 4966311936
    },
    "SWIM": {
        "short_name": "Latham Group, Inc.",
        "long_name": "Latham Group, Inc.",
        "summary": "Latham Group, Inc. designs, manufactures, and markets in-ground residential swimming pools. The company offers in-ground swimming pools, pool liners, and pool cover products. Latham Group, Inc. was formerly known as Latham Topco, Inc. and changed its name to Latham Group, Inc. in March 2021. Latham Group, Inc. was incorporated in 2018 and is based in Latham, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Latham",
        "zipcode": "12110",
        "website": "http://www.lathampool.com",
        "market_cap": 3481024256
    },
    "TGEN": {
        "short_name": "Tecogen Inc.",
        "long_name": "Tecogen Inc.",
        "summary": "Tecogen Inc. designs, manufactures, markets, and maintains industrial and commercial cogeneration systems that produce combinations of electricity, hot water, and air conditioning for residential, commercial, recreational, and industrial use in the United States and internationally. It operates in two segments, Products and Services, and Energy Production. The company offers InVerde e+, a cogeneration product that provides electricity and hot water; TECOGEN cogeneration systems for producing hot water; TECOCHILL air-conditioning and refrigeration chillers; Tecofrost gas engine-driven refrigeration compressors; and water heaters under the Ilios brand name, as well as emissions control technology under the Ultera brand name. It also provides long-term maintenance contracts, parts sales, and turnkey installation services through a network of eleven field service centers in California, the Midwest, the Northeast, and the Southeast, as well as in Ontario, Canada. In addition, the company installs, owns, operates, and maintains distributed generation, energy, and other complementary systems. It serves hospitals and nursing homes, colleges, universities, health clubs, spas, hotels, motels, office and retail buildings, food and beverage processors, multi-unit residential buildings, laundries, ice rinks, swimming pools, factories, municipal buildings, military installations, and indoor growing facilities. The company was incorporated in 2000 and is headquartered in Waltham, Massachusetts.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Waltham",
        "zipcode": "02451",
        "website": "http://www.tecogen.com",
        "market_cap": 42494012
    },
    "TREX": {
        "short_name": "Trex Company, Inc.",
        "long_name": "Trex Company, Inc.",
        "summary": "Trex Company, Inc. manufactures and distributes wood and plastic composite products, and related accessories primarily for residential decking, and railing applications in the United States. It offers Trex Transcend, Trex Select, and Trex Enhance protective shells for protection against fading, staining, mold, and scratching; Trex Hideaway, a hidden fastening systems; and Trex DeckLighting, a LED dimmable deck lighting for use on posts, floors, and steps. The company also provides Trex Transcend Railing products used in Trex decking products and other decking materials; Trex Select Railing for simple clean finished look; Trex Enhance railing system; and Trex Signature aluminum railing for contemporary look. In addition, it offers Trex Seclusions fencing product, including structural posts, bottom and top rails, pickets, and decorative post caps; and Trex Elevations, a steel deck framing system. Further, the company acts as a licensor in various licensing agreements with third parties to manufacture and sell products under the Trex name, including Trex Outdoor Furniture; Trex RainEscape, an above joist deck drainage system; Trex Pergola, a cellular PVC product; Trex Latticeworks outdoor lattice boards; Trex Cornhole boards; Diablo Trex Blade, a saw blade for wood-plastic composite decking; Trex SpiralStairs and structural steel posts; Trex Outdoor Kitchens, Cabinetry, and Storage; and Trex Outdoor Fire & Water products. Additionally, it offers architectural and aluminum railing systems, and staging equipment and accessories. The company sells its products through wholesale distributors, retail lumber dealers, and Home Depot and Lowe's stores, as well as through its direct sales staff, independent sales representatives, and bidding on projects. The company was founded in 1996 and is headquartered in Winchester, Virginia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Winchester",
        "zipcode": "22603-8605",
        "website": "http://www.trex.com",
        "market_cap": 12062184448
    },
    "TREX1.MX": {
        "short_name": "TREX COMPANY INC",
        "long_name": "Trex Company, Inc.",
        "summary": "Trex Company, Inc. manufactures and distributes wood and plastic composite products, and related accessories primarily for residential decking, and railing applications in the United States. It offers Trex Transcend, Trex Select, and Trex Enhance protective shells for protection against fading, staining, mold, and scratching; Trex Hideaway, a hidden fastening systems; and Trex DeckLighting, a LED dimmable deck lighting for use on posts, floors, and steps. The company also provides Trex Transcend Railing products used in Trex decking products and other decking materials; Trex Select Railing for simple clean finished look; Trex Enhance railing system; and Trex Signature aluminum railing for contemporary look. In addition, it offers Trex Seclusions fencing product, including structural posts, bottom and top rails, pickets, and decorative post caps; and Trex Elevations, a steel deck framing system. Further, the company acts as a licensor in various licensing agreements with third parties to manufacture and sell products under the Trex name, including Trex Outdoor Furniture; Trex RainEscape, an above joist deck drainage system; Trex Pergola, a cellular PVC product; Trex Latticeworks outdoor lattice boards; Trex Cornhole boards; Diablo Trex Blade, a saw blade for wood-plastic composite decking; Trex SpiralStairs and structural steel posts; Trex Outdoor Kitchens, Cabinetry, and Storage; and Trex Outdoor Fire & Water products. Additionally, it offers architectural and aluminum railing systems, and staging equipment and accessories. The company sells its products through wholesale distributors, retail lumber dealers, and Home Depot and Lowe's stores, as well as through its direct sales staff, independent sales representatives, and bidding on projects. The company was founded in 1996 and is headquartered in Winchester, Virginia.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "VA",
        "city": "Winchester",
        "zipcode": "22603-8605",
        "website": "http://www.trex.com",
        "market_cap": 233562816512
    },
    "TRR.F": {
        "short_name": "TREX CO. INC.  DL-,01",
        "long_name": "Trex Company, Inc.",
        "summary": "Trex Company, Inc. manufactures and distributes wood and plastic composite products, and related accessories primarily for residential decking, and railing applications in the United States. It offers Trex Transcend, Trex Select, and Trex Enhance protective shells for protection against fading, staining, mold, and scratching; Trex Hideaway, a hidden fastening systems; and Trex DeckLighting, a LED dimmable deck lighting for use on posts, floors, and steps. The company also provides Trex Transcend Railing products used in Trex decking products and other decking materials; Trex Select Railing for simple clean finished look; Trex Enhance railing system; and Trex Signature aluminum railing for contemporary look. In addition, it offers Trex Seclusions fencing product, including structural posts, bottom and top rails, pickets, and decorative post caps; and Trex Elevations, a steel deck framing system. Further, the company acts as a licensor in various licensing agreements with third parties to manufacture and sell products under the Trex name, including Trex Outdoor Furniture; Trex RainEscape, an above joist deck drainage system; Trex Pergola, a cellular PVC product; Trex Latticeworks outdoor lattice boards; Trex Cornhole boards; Diablo Trex Blade, a saw blade for wood-plastic composite decking; Trex SpiralStairs and structural steel posts; Trex Outdoor Kitchens, Cabinetry, and Storage; and Trex Outdoor Fire & Water products. Additionally, it offers architectural and aluminum railing systems, and staging equipment and accessories. The company sells its products through wholesale distributors, retail lumber dealers, and Home Depot and Lowe's stores, as well as through its direct sales staff, independent sales representatives, and bidding on projects. The company was founded in 1996 and is headquartered in Winchester, Virginia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "VA",
        "city": "Winchester",
        "zipcode": "22603-8605",
        "website": "http://www.trex.com",
        "market_cap": 10040414208
    },
    "TWL.F": {
        "short_name": "SIMPSON MANUFACT.CO.DL-01",
        "long_name": "Simpson Manufacturing Co., Inc.",
        "summary": "Simpson Manufacturing Co., Inc., through its subsidiaries, designs, engineers, manufactures, and sells wood and concrete building construction products. The company offers wood construction products, including connectors, truss plates, fastening systems, fasteners, shearwalls, and pre-fabricated lateral systems that are used in light-frame construction; and concrete construction products comprising adhesives, specialty chemicals, mechanical anchors, carbide drill bits, powder actuated tools, fiber reinforced materials, and other repair products for use in concrete, masonry, and steel construction, as well as grouts, coatings, sealers, mortars, fiberglass and fiber-reinforced polymer systems, and asphalt products for use in concrete construction repair, protection, and strengthening applications. It also provides connectors and lateral products for wood framing, timber and offsite construction, mid-rise steel construction, and cold formed steel applications; and mechanical and adhesive anchors for concrete and masonry construction applications. In addition, the company offers engineering and design services, as well as software solutions that facilitates the specification, selection, and use of its products. It markets its products to the residential construction, light industrial and commercial construction, remodeling, and do-it-yourself markets in the United States, Canada, France, the United Kingdom, Germany, Denmark, Switzerland, Portugal, Poland, the Netherlands, Belgium, Spain, Sweden, Norway, Australia, New Zealand, China, Taiwan, and Vietnam. Simpson Manufacturing Co., Inc. was founded in 1956 and is headquartered in Pleasanton, California.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Pleasanton",
        "zipcode": "94588",
        "website": "http://www.simpsonmfg.com",
        "market_cap": 4038002944
    },
    "VIEW": {
        "short_name": "View, Inc.",
        "long_name": "View, Inc.",
        "summary": "View Operating Corporation, a technology company, develops, manufactures, and sells smart building products. Its product portfolio includes View Smart Glass that comprise electrochromic glass panels in the form of insulating glass units; View Net, a cloud-connected network infrastructure offering that can incorporate and power smart building devices; View Immersive Experiences, which transforms View Smart Glass windows into transparent, digital, and interactive surfaces; View Sense modules to measure and optimize light, humidity, temperature, air quality, dust, and noise; and View Smart Protect, an intrusion detection solution that can be deployed on View Smart Glass windows to improve the security of a building by detecting glass breakage. The company is headquartered in Milpitas, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Milpitas",
        "zipcode": "95035",
        "website": "http://www.view.com",
        "market_cap": 1521709824
    },
    "WMS": {
        "short_name": "Advanced Drainage Systems, Inc.",
        "long_name": "Advanced Drainage Systems, Inc.",
        "summary": "Advanced Drainage Systems, Inc. designs, manufactures, and markets thermoplastic corrugated pipes and related water management products, and drainage solutions for use in the underground construction and infrastructure marketplace in the United States, Canada, and internationally. The company offers single, double, and triple wall corrugated polypropylene and polyethylene pipes; and allied products, including storm retention/detention and septic chambers, polyvinyl chloride drainage structures, fittings, and water quality filters and separators. It also purchases and distributes construction fabrics and other geotextile products for soil stabilization, reinforcement, filtration, separation, erosion control, and sub-surface drainage, as well as drainage grates and other products. The company offers its products for non-residential, residential, agriculture, and infrastructure applications through a network of approximately 32 distribution centers in approximately 80 countries. Advanced Drainage Systems, Inc. was founded in 1966 and is headquartered in Hilliard, Ohio.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Hilliard",
        "zipcode": "43026",
        "website": "http://www.ads-pipe.com",
        "market_cap": 8145939456
    },
    "WXMN": {
        "short_name": "WAXMAN INDUSTRIES INC",
        "long_name": "Waxman Industries, Inc.",
        "summary": "Waxman Industries, Inc. designs, develops, and distributes surface protection and floor care products, and other home improvement and hardware products. The company's floor care and surface protection products include furniture sliders, felt pads, furniture tips and glides, bumpers, gripper pads, caster and cups, and door stops; shower heads and accessories; and plumping products comprise sink and faucet repair products, water leak detection products, toilet repair products, plungers, drain cleaning and repair products, water supply repair products, and hose and pipe repair products. It also offers bathroom and kitchen faucets; and home organization and storage solutions. The company sells its products under the Kleen Freak, SoftTouch, PlumCraft, Super Sliders, leakSMART, BodyMoods, and SimplyClean brand names. Waxman Industries, Inc. was incorporated in 1989 and is based in Bedford Heights, Ohio.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Bedford Heights",
        "zipcode": "44146",
        "website": "http://waxman.com",
        "market_cap": 5970071
    }
}