{
    "288.F": {
        "short_name": "VERITIV CORP.  DL-,01",
        "long_name": "Veritiv Corporation",
        "summary": "Veritiv Corporation operates as a business-to-business provider of value-added packaging products and services, as well as facility solutions, print, and publishing products and services in the United States, Canada, Mexico, and internationally. The Packaging segment provides custom and standard packaging solutions. The Facility Solutions segment sources and sells cleaning, break-room, and other supplies, such as towels, tissues, commercial cleaning chemicals, personal protective equipment and safety supplies, wipers, can liners, soaps and sanitizers, dispensers, sanitary maintenance supplies and equipment, hazard supplies, and shampoos and amenities. The Print segment sells and distributes commercial printing, writing, copying, digital, and specialty products; and graphics consumables and equipment. It also provides customized paper conversion services of commercial printing paper for distribution to document centers and form printers. The Publishing segment sells and distributes coated and uncoated commercial printing papers to publishers, retailers, converters, printers, and specialty businesses for use in magazines, catalogs, books, directories, gaming, couponing, retail inserts, and direct mail. This segment also provides print management, procurement, and supply chain management solutions. The company also offers logistics solutions. Veritiv Corporation offers its products under the Endurance, nordic+, Comet, Starbrite Opaque Select, TUFflex, Reliable, and Spring Grove brands, as well as other brands to customers in manufacturing, food processing and service, fulfillment and internet retail, property management, higher education, healthcare, entertainment and hospitality, commercial printing and publishing sectors. As of December 31, 2020 the Company operated approximately 125 distribution centers. Veritiv Corporation was incorporated in 2013 and is headquartered in Atlanta, Georgia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30328",
        "website": "http://www.veritivcorp.com",
        "market_cap": 790466432
    },
    "2TJ.F": {
        "short_name": "TEJON RANCH CO.  DL-,50",
        "long_name": "Tejon Ranch Co.",
        "summary": "Tejon Ranch Co. operates as a diversified real estate development and agribusiness company. It operates through five segments: Commercial/Industrial Real Estate Development, Resort/Residential Real Estate Development, Mineral Resources, Farming, and Ranch Operations. The Commercial/Industrial Real Estate Development segment engages in the planning and permitting of land for development; construction of infrastructure projects, pre-leased buildings, and buildings to be leased or sold; and sale of land to third parties for their own development. It is also involved in the activities related to communications leases, and landscape maintenance. This segment leases land to two auto service stations with convenience stores, 13 fast-food operations, a full-service restaurants, a motel, an antique shop, and a post office; various microwave repeater locations, radio and cellular transmitter sites, and fiber optic cable routes; and 32 acres of land for an electric power plant. The Resort/Residential Real Estate Development segment engages in land entitlement, planning, pre-construction engineering, stewardship, and conservation activities. The Mineral Resources segment includes oil and gas royalties, rock and aggregate royalties, and royalties from a cement operation leased to National Cement Company of California, Inc.; and the management of water assets and infrastructure projects. The Farming segment farms permanent crops, such as wine grapes in 835 acres, almonds in 2,281 acres, and pistachios in 1,053 acres. It also manages the farming of alfalfa and forage mix on 626 acres in the Antelope Valley; and leases 720 acres of land for growing vegetables, as well as almonds. The Ranch Operations segment provides game management and ancillary land services comprising grazing leases and filming, as well as various guided hunts. The company was founded in 1843 and is headquartered in Lebec, California.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Lebec",
        "zipcode": "93243",
        "website": "http://tejonranch.com",
        "market_cap": 327851584
    },
    "AEEI": {
        "short_name": "AMERICAN ENVIRONMENTAL ENERGY I",
        "long_name": "American Environmental Energy, Inc.",
        "summary": "American Environmental Energy, Inc. develops and manages renewable and alternative energy sources, including carbon offsets, with focus on bio-diesel fuel, waste to energy solutions that include anaerobic digesters and pyrolytic conversions, wind, solar, and carbon sequestration applications and technologies. American Environmental Energy, Inc. was founded in 1988 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Costa Mesa",
        "zipcode": "92626",
        "website": "http://www.1aeei.com",
        "market_cap": 16923280
    },
    "AMIN": {
        "short_name": "AMERICAN INTERNATIONAL INDS INC",
        "long_name": "American International Industries, Inc.",
        "summary": "American International Industries, Inc. holds interests in industrial, oil and gas, oilfield supply and service, and undeveloped real estate companies in the United States. The company supplies products to retailers and wholesalers in the automotive after-market and in the consumer durable electrical products markets under the Good Choice and MOTOR TREND brand names. Its MOTOR TREND branded products include booster cables, portable and rechargeable hand lamps, lighting products, cord sets, and miscellaneous battery and other consumer automotive accessories; and Good Choice branded products comprise portable lighting products, cord sets, residential household light bulbs, night lights, multiple outlet devices, and other consumer products. The company also provides owns oil and gas properties in Texas, as well as real estate holdings in Harris, Galveston, and Waller counties in Texas. American International Industries, Inc. was founded in 1994 and is based in Kemah, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Kemah",
        "zipcode": "77565-3077",
        "website": "http://www.americanii.com",
        "market_cap": 817180
    },
    "APTL": {
        "short_name": "ALASKA POWER & TELEPHONE CO",
        "long_name": "Alaska Power & Telephone Company",
        "summary": "Alaska Power & Telephone Company, through its subsidiaries, provides regulated electric and telephone services in rural portions of Alaska. It operates through Electric and Telecommunications segments. The Electric segment offers retail and wholesale electric services, including hydroelectric and diesel generation facilities. The Telecommunications segment provides local telephone services. The company also offers broadband, internet, wireless, network access, long distance, traditional voice, data transport, and telecom engineering services. Alaska Power & Telephone Company was founded in 1957 and is headquartered in Port Townsend, Washington.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Port Townsend",
        "zipcode": "98368-0922",
        "website": "http://www.aptalaska.com",
        "market_cap": 83981480
    },
    "AXXA": {
        "short_name": "EXXE GROUP INC",
        "long_name": "Exxe Group Inc.",
        "summary": "Exxe Group Inc. focuses on real estate, sustainable technology, media, agribusiness, and financial services businesses. The company buys, develops, and manages real estate properties, including condominiums, hotels, vacation homes, residential complexes, senior living communities, offices, and self-storage facilities. It also provides financing and execution services; advises issuers and investors through financing, acquisition, and exit strategies; and delivers services to investors through media and tech. The company was formerly known as Telecorp, Inc. Exxe Group Inc. was incorporated in 2009 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10122",
        "website": "http://exxegroup.com",
        "market_cap": 28872704
    },
    "BCND": {
        "short_name": "BEACON REDEVELOPMENT IND CORP",
        "long_name": "Beacon Redevelopment Industrial Corporation",
        "summary": "Beacon Redevelopment Industrial Corporation is engaged in acquiring and developing distressed properties. It offers various projects, including real property acquisitions, redevelopment, salvageable materials, natural resources, mining, mineral rights, and logging/timber rights. The company is based in Grapeville, Pennsylvania.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Grapeville",
        "zipcode": "15634",
        "website": "http://www.beaconredevelopment.com",
        "market_cap": 1479564
    },
    "BDGY": {
        "short_name": "BRIDGEWAY NATIONAL CORP",
        "long_name": "Bridgeway National Corp.",
        "summary": "Bridgeway National Corp. is a private equity firm specializing in control equity, structured equity, buyout, add-on acquisition and acquisition investments. The firm prefers to invest in industrial services, technology and consumer product sectors. It typically invests between $25 million and $400 million in equity investments in companies having EBITDA between $5 million and $50 million. It prefers to take majority stake. The company was formerly known as Capital Park Holdings Corp. and changed its name to Bridgeway National Corp. in January 2020. Bridgeway National Corp. was founded in 2012 and is based in Washington, District of Columbia. Bridgeway National Corp. is a subsidiary of Consumer Electronics Ventures Corp.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "DC",
        "city": "Washington",
        "zipcode": "20005",
        "website": null,
        "market_cap": 148228
    },
    "BOPO": {
        "short_name": "BIOPOWER OPERATIONS CORP",
        "long_name": "BioPower Operations Corporation",
        "summary": "BioPower Operations Corporation, through its subsidiaries, intends to develop renewable waste to energy projects in the United States and internationally. The company focuses on designing, engineering, permitting, procuring equipment, construction management, and operating and maintaining facilities for the conversion of wastes into electricity and synthetic fuels. It also intends to provide waste remediation services. BioPower Operations Corporation was founded in 2010 and is headquartered in Fort Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Fort Lauderdale",
        "zipcode": "33334",
        "website": "http://www.biopowercorp.com",
        "market_cap": 399519
    },
    "CBCA": {
        "short_name": "CROWN BAUS CAPITAL CORP",
        "long_name": "Crown Baus Capital Corp.",
        "summary": "Crown Baus Capital Corp., a development stage company, focuses on high-tech, pharmaceutical development, entertainment and media, education, and financial services industries. The company offers high-tech and marketing services, as well as a series of digital marketing events covering technical innovations and networking. It also focuses on pharmaceutical development, including horticulture, laboratories, manufacturing, distribution, patient education, and tracking. In addition, the company focuses on providing resources for motion pictures, Web movies, and television, which includes the documentary and reality television markets. Further, it provides educational resources and services to professionals. Additionally, Crown Baus Capital Corp. focuses on offering financial and banking solutions for various industries. The company was formerly known as Cannabis Capital Corp. and changed its name to Crown Baus Capital Corp. in June 2014. Crown Baus Capital Corp. was founded in 2011 and is headquartered in Beverly Hills, California. Crown Baus Capital Corp. is a subsidiary of Castor Management Services, Inc.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Beverly Hills",
        "zipcode": "90210",
        "website": "http://www.crownbaus.com",
        "market_cap": 46655964
    },
    "CDJM": {
        "short_name": "CARNEGIE DEVELOPMENT INC",
        "long_name": "Carnegie Development, Inc.",
        "summary": "Carnegie Development, Inc. engages in the land acquisitions for real estate development. The company was formerly known as Escue Energy, Inc. and changed its name to Carnegie Development, Inc. in July 2019. Carnegie Development, Inc. is based in Reno, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Reno",
        "zipcode": "89509",
        "website": "http://www.carnegie-development.com",
        "market_cap": 69305552
    },
    "CGOB.F": {
        "short_name": "STEEL CONNECT INC. DL-,01",
        "long_name": "Steel Connect, Inc.",
        "summary": "Steel Connect, Inc., together with its subsidiaries, provides direct marketing and supply chain services in the United States, China, the Netherlands, and internationally. It offers data-driven marketing solutions, including strategy, data and analytics, response analysis, creative services, lithographic and digital printing, envelope printing and converting, component manufacturing, promotional cards, data processing and hygiene, content and asset management, personalization, lettershop and bindery, and postal optimization for paper-based direct marketing and omnichannel marketing campaigns, as well as provides business continuity and disaster recovery services. The company also offers product configuration and packaging, kitting, and assembly of components and parts into finished goods; and value-added processes, such as product testing, radio frequency identification tagging, product or service activation, language settings, personalization and engraving, multi-channel packaging, and packaging design services. In addition, it provides fulfillment services comprising order management, pick, pack and ship, retail compliance, and demand planning services; and reverse logistics services that simplifies the returns process for retailers and manufacturers, as well as operates a cloud-based e-commerce platform. Steel Connect, Inc. offers its supply chain services to customers in the consumer electronics, communications, computing, medical devices, software, storage, and retail markets. The company was formerly known as ModusLink Global Solutions, Inc. and changed its name to Steel Connect, Inc. in February 2018. Steel Connect, Inc. was incorporated in 1986 and is headquartered in Waltham, Massachusetts.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MA",
        "city": "Waltham",
        "zipcode": "02451",
        "website": "http://www.steelconnectinc.com",
        "market_cap": 113977576
    },
    "CIBY": {
        "short_name": "CIBL INC",
        "long_name": "CIBL, Inc.",
        "summary": "CIBL, Inc. focuses on the broadband data transport/communications and broadcasting activities. The company is headquartered in Reno, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Reno",
        "zipcode": "89501",
        "website": "http://www.ciblinc.com",
        "market_cap": 28645110
    },
    "CNGI": {
        "short_name": "CONCORDIS GROUP INC",
        "long_name": "Concordis Group Incorporated",
        "summary": "Concordis Group Incorporated, a diversified holding company, primarily engages in the acquisition and management of companies and assets. The company, through its subsidiaries, is involved in investment banking, manufacturing, energy projects, medical facilities, and real estate businesses. It provides design, architecture, engineering, site development, and building services for apartments, custom buildings, and multipurpose large commercial developments; and management services for investment banking, real estate, and oil and gas projects. The company also operates investment funds for institutional and high-net-worth investors that target the acquisition of value-added and opportunistic real estate investments. Concordis Group Incorporated was founded in 2008 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75243",
        "website": null,
        "market_cap": 10932600
    },
    "CODI-PA": {
        "short_name": "Compass Diversified Holdings 7.",
        "long_name": "Compass Diversified",
        "summary": "Compass Diversified is a private equity firm specializing in add on acquisitions, buyouts, industry consolidation, recapitalization, late stage and middle market investments. It seeks to invest in niche industrial or branded consumer companies, manufacturing, distribution, consumer products, business services sector, safety & security, electronic components, food, foodservice. The firm prefers to invest in companies based in North America. It seeks to invest between $100 million and $800 million in companies with an EBITDA between $15 million to $80 million. It seeks to acquire controlling ownership interests in its portfolio companies and can make additional platform acquisitions. The firm prefer to have majority stake in companies. The firm invests through its balance sheet and typically holds investments between five to seven years. Compass Diversified was founded in 2005 and is based in Westport, Connecticut with an additional office in Irvine, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Westport",
        "zipcode": "06880",
        "website": "http://compassdiversified.com",
        "market_cap": 1250744064
    },
    "CODI-PB": {
        "short_name": "Compass Diversified Holdings 7.",
        "long_name": "Compass Diversified",
        "summary": "Compass Diversified is a private equity firm specializing in add on acquisitions, buyouts, industry consolidation, recapitalization, late stage and middle market investments. It seeks to invest in niche industrial or branded consumer companies, manufacturing, distribution, consumer products, business services sector, safety & security, electronic components, food, foodservice. The firm prefers to invest in companies based in North America. It seeks to invest between $100 million and $800 million in companies with an EBITDA between $15 million to $80 million. It seeks to acquire controlling ownership interests in its portfolio companies and can make additional platform acquisitions. The firm prefer to have majority stake in companies. The firm invests through its balance sheet and typically holds investments between five to seven years. Compass Diversified was founded in 2005 and is based in Westport, Connecticut with an additional office in Irvine, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Westport",
        "zipcode": "06880",
        "website": "http://compassdiversified.com",
        "market_cap": 1245426432
    },
    "CODI-PC": {
        "short_name": "Compass Diversified Holdings 7.",
        "long_name": "Compass Diversified",
        "summary": "Compass Diversified is a private equity firm specializing in add on acquisitions, buyouts, industry consolidation, recapitalization, late stage and middle market investments. It seeks to invest in niche industrial or branded consumer companies, manufacturing, distribution, consumer products, business services sector, safety & security, electronic components, food, foodservice. The firm prefers to invest in companies based in North America. It seeks to invest between $100 million and $800 million in companies with an EBITDA between $15 million to $80 million. It seeks to acquire controlling ownership interests in its portfolio companies and can make additional platform acquisitions. The firm prefer to have majority stake in companies. The firm invests through its balance sheet and typically holds investments between five to seven years. Compass Diversified was founded in 2005 and is based in Westport, Connecticut with an additional office in Irvine, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Westport",
        "zipcode": "06880",
        "website": "http://compassdiversified.com",
        "market_cap": null
    },
    "CODI": {
        "short_name": "D/B/A Compass Diversified Holdi",
        "long_name": "Compass Diversified",
        "summary": "Compass Diversified is a private equity firm specializing in add on acquisitions, buyouts, industry consolidation, recapitalization, late stage and middle market investments. It seeks to invest in niche industrial or branded consumer companies, manufacturing, distribution, consumer products, business services sector, safety & security, electronic components, food, foodservice. The firm prefers to invest in companies based in North America. It seeks to invest between $100 million and $800 million in companies with an EBITDA between $15 million to $80 million. It seeks to acquire controlling ownership interests in its portfolio companies and can make additional platform acquisitions. The firm prefer to have majority stake in companies. The firm invests through its balance sheet and typically holds investments between five to seven years. Compass Diversified was founded in 2005 and is based in Westport, Connecticut with an additional office in Irvine, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Westport",
        "zipcode": "06880",
        "website": "http://compassdiversified.com",
        "market_cap": 1723094912
    },
    "CTLE": {
        "short_name": "NANO LABS CORP",
        "long_name": "Nano Labs Corp.",
        "summary": "Nano Labs Corp., a development stage company, focuses on acquiring coatings and laminates made from nanotechnology for its own use or licensing to others. The company was formerly known as Colorado Ceramic Tile, Inc. and changed its name to Nano Labs Corp. in April 2012. Nano Labs Corp. was founded in 1995 and is based in Detroit, Michigan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MI",
        "city": "Detroit",
        "zipcode": "48226",
        "website": "http://www.coloradotile.com/",
        "market_cap": 8356
    },
    "ECSL": {
        "short_name": "ECARE SOLUTIONS INC",
        "long_name": "EncounterCare Solutions, Inc.",
        "summary": "EncounterCare Solutions, Inc. operates as an energy and healthcare company in the United States. It operates through three divisions: Energy, Healthcare Technology, and Healthcare Services. The Energy division produces and distributes a fuel additive under the EcoFlex 96 brand name. The Healthcare Technology division provides Electronic House Call, a remote patient vital signs monitoring device. The Healthcare Services division offers a suite of pediatric and neonatal services, including skilled nursing, home infusion, medical equipment, and others. The company was formerly known as Ecare Solutions, Inc. and changed its name to EncounterCare Solutions, Inc. in November 2000. EncounterCare Solutions, Inc. is headquartered in Palm Beach Gardens, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Palm Beach Gardens",
        "zipcode": "33410",
        "website": "http://www.encountercare.com",
        "market_cap": 54257584
    },
    "EFSH": {
        "short_name": "1847 HOLDINGS LLC",
        "long_name": "1847 Holdings LLC",
        "summary": "1847 Holdings LLC, through its subsidiaries, provides home and kitchen appliances, professional services, and construction services in North America. It operates through three segments: Retail and Appliances, Land Management Services, and Construction. The Retail and Appliances segment sells home and kitchen appliances, including cooking, refrigeration, laundry clean up, and outdoor products to residential and commercial customers; and provides a range of appliance services, including delivery/installation, in-home service and repair, extended warranties, and financing to homeowners, builders, and designers. The Land Management Services segment provides waste disposal and various agricultural services, such as manure spreading, land rolling, bin whipping, cleaning of bulk storage bins and silos, equipment rental, trucking, vacuuming, building erection, various shop, and other services to local agricultural and farming communities; and wholesales agricultural equipment and parts. The Construction segment engages in construction and sale of custom cabinetry, including kitchen and bath cabinets, fireplace mantels and surrounds, entertainment systems and wall units, bookcases, and office cabinets. 1847 Partners LLC serves as the manager of the company. 1847 Holdings LLC was founded in 1948 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022",
        "website": "http://www.1847holdings.com",
        "market_cap": 11283840
    },
    "ELGL": {
        "short_name": "ELEMENT GLOBAL INC",
        "long_name": "Element Global, Inc.",
        "summary": "Element Global, Inc. operates in mining, renewable energy, technology, sports, media, and finance businesses. The company was formerly known as Global Holdings, Inc. and changed its name to Element Global, Inc. in July 2015. Element Global, Inc. is headquartered in Los Angeles, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90038",
        "website": "http://www.elementglobal.com",
        "market_cap": 8738625
    },
    "GLOH": {
        "short_name": "GLOW HOLDINGS INC",
        "long_name": "Glow Holdings, Inc.",
        "summary": "Glow Holdings Inc., a diversified holdings company, engages in retail packaged foods, hospitality business and consulting services, specialty foods franchising, wellness and health products, and mobile technology marketing development businesses. It offers mobile apps for enterprises and individuals seeking to use mobile devices as channels for personal and business branding. The company also engages in developing, branding, managing, and funding hotel and resort properties. In addition, it offers consumer packaged foods. Further, Glow Holdings Inc. is involved in the consumer food and beverage industry. The company was formerly known as GlobalOne Real Estate, Inc. and changed its name to Glow Holdings, Inc. in August 2011. The company was incorporated in 1997 and is based in Seattle, Washington.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Seattle",
        "zipcode": "98121",
        "website": "http://www.glowholdings.com",
        "market_cap": 21886066
    },
    "GRPX": {
        "short_name": "GREENPLEX SERVICES INC",
        "long_name": "GreenPlex Services, Inc.",
        "summary": "GreenPlex Services, Inc. operates a cannabis testing laboratory in Washington, the United States. It tests cannabis and cannabis related products for growers and processors. The company was founded in 2009 and is based in Spokane, Washington.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Spokane",
        "zipcode": "99223",
        "website": null,
        "market_cap": 4562700
    },
    "GTII": {
        "short_name": "GLOBAL TECH INDUSTRIES GROUP IN",
        "long_name": "Global Tech Industries Group, Inc.",
        "summary": "Global Tech Industries Group, Inc. does not have significant operations. Previously, it was engaged in various clean-tech and environmentally friendly technologies, and intellectual properties in the areas of hazardous waste destruction, energetic materials, chemical recycling processes, and coal gasification. The company was formerly known as Tree Top Industries, Inc. and changed its name to Global Tech Industries Group, Inc. in July 2016. Global Tech Industries Group, Inc. is based in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10011",
        "website": "http://gtii-us.com",
        "market_cap": 442492128
    },
    "GTLL": {
        "short_name": "GLOBAL TECHNOLOGIES",
        "long_name": "Global Technologies, Ltd.",
        "summary": "Global Technologies, Ltd., through its subsidiaries, engages in the online sale of CBD and hemp related products in the United States. The company operates a portal that provides access to live shopping, e-commerce, and product placement in brick and mortar retail outlets, and logistics. It also offers sales and distribution, and third-party logistics services. Global Technologies, Ltd. was founded in 1999 and is based in Saint Petersburg, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Saint Petersburg",
        "zipcode": "33701",
        "website": "http://www.globaltechnologiesltd.info",
        "market_cap": 41944836
    },
    "IEP": {
        "short_name": "Icahn Enterprises L.P. - Deposi",
        "long_name": "Icahn Enterprises L.P.",
        "summary": "Icahn Enterprises L.P., through its subsidiaries, operates in investment, energy, automotive, food packaging, metals, real estate, home fashion, and pharma businesses in the United States and Internationally. The company's Investment segment invests its proprietary capital through various private investment funds. Its Energy segment refines and markets transportation fuels; and produces and markets nitrogen fertilizers in the form of urea ammonium nitrate and ammonia. The company's Automotive segment is involved in the retail and wholesale distribution of automotive parts; and offers automotive repair and maintenance services. This segment also purchases and leases vehicles. Its Food Packaging segment produces and sells cellulosic, fibrous, and plastic casings that are used for preparing processed meat products. The company's Metals segment collects, processes, and sells ferrous and non-ferrous metals, as well as processes and distributes steel pipe and plate products. Its Real Estate segment is involved in the rental of retail, office, and industrial properties; construction and sale of single-family and multi-family homes, lots in subdivisions and planned communities, and raw land for residential development; and golf and club operations. The company's Home Fashion segment manufactures, sources, markets, distributes, and sells home fashion consumer products. Its Pharma segment offers pharmaceutical products and services. Icahn Enterprises L.P. was incorporated in 1987 and is headquartered in Sunny Isles Beach, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Sunny Isles Beach",
        "zipcode": "33160",
        "website": "http://www.ielp.com",
        "market_cap": 14371737600
    },
    "IGC": {
        "short_name": "India Globalization Capital Inc",
        "long_name": "India Globalization Capital, Inc.",
        "summary": "India Globalization Capital, Inc. purchases and resells physical infrastructure commodities. The company operates through two segments, Infrastructure Business, and Life Sciences. It buys and sells infrastructure commodities, such as steel, wooden doors, marble, and tiles; rents heavy construction equipment, including motor grader, transit mixers and rollers; and undertakes highway construction contracts. The company also develops cannabinoid-based products and therapies, such as Hyalolex for the treatment of patients from anxiety, agitation, dementia, depression, and sleep disorder diseases; and Serosapse for the treatment of Parkinson's disease. In addition, it offers offer extraction, distillation, tolling, and white labeling services under the Holi Hemp brand; and hemp crude extracts, hemp isolates, and hemp distillates. The company operates in the United States, India, and Hong Kong. India Globalization Capital, Inc. was founded in 2005 and is based in Potomac, Maryland.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Potomac",
        "zipcode": "20854",
        "website": "http://www.igcinc.us",
        "market_cap": 63966480
    },
    "IGS1.F": {
        "short_name": "INDIA GLOBAL.CAP. DL -,01",
        "long_name": "India Globalization Capital, Inc.",
        "summary": "India Globalization Capital, Inc. purchases and resells physical infrastructure commodities. The company operates through two segments, Infrastructure Business, and Life Sciences. It buys and sells infrastructure commodities, such as steel, wooden doors, marble, and tiles; rents heavy construction equipment, including motor grader, transit mixers and rollers; and undertakes highway construction contracts. The company also develops cannabinoid-based products and therapies, such as Hyalolex for the treatment of patients from anxiety, agitation, dementia, depression, and sleep disorder diseases; and Serosapse for the treatment of Parkinson's disease. In addition, it offers offer extraction, distillation, tolling, and white labeling services under the Holi Hemp brand; and hemp crude extracts, hemp isolates, and hemp distillates. The company operates in the United States, India, and Hong Kong. India Globalization Capital, Inc. was founded in 2005 and is based in Potomac, Maryland.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MD",
        "city": "Potomac",
        "zipcode": "20854",
        "website": "http://www.igcinc.us",
        "market_cap": 54678168
    },
    "IRNS": {
        "short_name": "IRONSTONE GROUP INC",
        "long_name": "Ironstone Group, Inc.",
        "summary": "Ironstone Group, Inc. does not have significant operations. It seeks appropriate business combination opportunities. The company was incorporated in 1972 and is based in San Francisco, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94133",
        "website": "http://www.ironstonegroupinc.com",
        "market_cap": 1348732
    },
    "IVST": {
        "short_name": "INNOVEST GLOBAL INC",
        "long_name": "Innovest Global, Inc.",
        "summary": "Innovest Global, Inc. engages in the commercial and industrial, energy, and biotechnology and health services sectors. It designs, engineers, tests, and manufactures curtain wall systems; supplies personal protection equipment, apparel, and safety supplies; offers inbound and outbound call services; negotiates and purchases various exterior building products. The company also provides energy services to reduce businesses overall energy costs; and LED lighting products, as well as acts as independent energy broker. In addition, it develops immunotherapeutic for treating patients with glioblastoma multiforme. The company was formerly known as Aurum Resource and Asset Management, Inc. and changed its name to Innovest Global, Inc. in January 2017. Innovest Global, Inc. was incorporated in 1999 and is based in Chesterland, Ohio.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Chesterland",
        "zipcode": "44026",
        "website": "http://www.innovestglobal.com",
        "market_cap": 14363730
    },
    "KGHI": {
        "short_name": "KAISER GROUP HOLDINGS INC",
        "long_name": "Kaiser Group Holdings, Inc.",
        "summary": "Kaiser Group Holdings, Inc., through its subsidiary, Kaiser Aircraft Industries, Inc., provides aircraft maintenance and modification services for government, military, and commercial customers. It also manufactures and assemblies parts and kits. The company was founded in 1969 and is headquartered in Birmingham, Alabama.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "AL",
        "city": "Birmingham",
        "zipcode": "35212",
        "website": null,
        "market_cap": 40644604
    },
    "LIDM": {
        "short_name": "LIMCO DEL MAR LTD",
        "long_name": "Limco Del Mar, Ltd.",
        "summary": "Limco Del Mar, Ltd. produces fruits and related agricultural products. The company is based in Ventura, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Ventura",
        "zipcode": "93003",
        "website": null,
        "market_cap": null
    },
    "LPTC": {
        "short_name": "LEAP TECHNOLOGY INC",
        "long_name": "Le@p Technology, Inc.",
        "summary": "Le@P Technology, Inc. does not have significant operations. The company plans to pursue acquisition, joint venture, and investment opportunities primarily in the areas of health care technology, and products and services, as well as life sciences. Previously, it was involved in leasing a real property. Le@P Technology, Inc. was founded in 1997 and is based in Fort Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Fort Lauderdale",
        "zipcode": "33334",
        "website": "http://www.leaptec.com",
        "market_cap": 7979968
    },
    "LWCTF": {
        "short_name": "LCTI LOW CARBON TECHNOLOGIES IN",
        "long_name": "LCTI Low Carbon Technologies International Inc.",
        "summary": "LCTI Low Carbon Technologies International Inc., a technology company, focuses on securing, licensing, and deploying green technologies. The company has technologies in various stages of development in the cleantech sector. LCTI Low Carbon Technologies International Inc. was formerly known as Sustainable Energy Properties Inc. and changed its name to LCTI Low Carbon Technologies International Inc. in January 2012. The company was incorporated in 2009 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77056",
        "website": "http://www.lctiinc.com",
        "market_cap": 1343895
    },
    "MATW": {
        "short_name": "Matthews International Corporat",
        "long_name": "Matthews International Corporation",
        "summary": "Matthews International Corporation provides brand solutions, memorialization products, and industrial technologies worldwide. The company's SGK Brand Solutions segment offers brand management and pre-media services, printing plates and cylinders, engineered products, imaging services, digital asset management, merchandising display systems, and marketing and design services primarily for the consumer goods and retail industries. Its Memorialization segment manufactures and markets a range of memorialization products for use in cemeteries, funeral homes, and crematories. This segment offers cast bronze memorials, flush bronze and granite memorials, upright granite memorials and monuments, cremation memorialization products, granite benches, flower vases, crypt plates and letters, cremation urns, niche units, cemetery features and statues, caskets, community and family mausoleums, bronze plaques, letters, emblems, vases, lights, and photo ceramics, as well as architectural products to identify or commemorate people, places, events, and accomplishments. The company's Industrial Technologies segment designs, manufactures, and distributes marking and coding equipment and consumables, industrial automation products, warehouse automation systems, and order fulfillment systems for identifying, tracking, picking, and conveying consumer and industrial products. This segment serves manufacturers, suppliers, and distributors of durable goods and building products; consumer goods manufacturers; and pharmaceutical producers. Matthews International Corporation was founded in 1850 and is headquartered in Pittsburgh, Pennsylvania.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Pittsburgh",
        "zipcode": "15212-5851",
        "website": "http://www.matw.com",
        "market_cap": 1231426176
    },
    "MLCG": {
        "short_name": "ML CAPITAL GROUP INC",
        "long_name": "ML Capital Group, Inc.",
        "summary": "ML Capital Group, Inc. produces products and provides services that support the medical marijuana industry. It is producing and marketing its products and services under the Superstar Products brand name, including vapor pens, mobile applications, and books. The company offers SUPERSTAR MMJ DISPENSARIES APP, a smartphone application that provides location based on services and detailed information on medical marijuana dispensaries; SUPERSTAR VAPOR PEN, an vapor smokeless devise, which enables consumers to consume tobacco, wax, or liquid form in clean and safer manner; and SUPERSTAR MMJ RECIPE BOOK, which enables consumers to create various meals, drinks, and sweets favorites with recipe book. ML Capital Group, Inc. was founded in 2009 and is based in Fountain Hills, Arizona.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Fountain Hills",
        "zipcode": "85268",
        "website": "http://mlcapitalgroupinc.com",
        "market_cap": 8071
    },
    "MVNT": {
        "short_name": "MOVEMENT INDS CORP",
        "long_name": "Movement Industries Corporation",
        "summary": "Movement Industries Corporation, through its subsidiaries, provides computer numerically controlled (CNC) machining and fabrication services to energy organizations. It also offers valves for the oil and gas industry. The company was formerly known as Visual Healthcare Corp. and changed its name to Movement Industries Corporation in August 2019. The company is based in Houston, Texas. Movement Industries Corporation is a subsidiary of LTN Capital Ventures, LLC.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77040",
        "website": null,
        "market_cap": 10728
    },
    "MVPT": {
        "short_name": "MVP HOLDINGS INC",
        "long_name": "MVP Holdings Inc.",
        "summary": "MVP Holdings Inc. engages in the real estate, consumer goods, consumer services, and web-based service businesses. It is also involved in the health and benefits, financial services, manufacturing, hospitality, technology, and logistics businesses. The company is based in Fresno, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Fresno",
        "zipcode": "93711",
        "website": "http://mvpholdingsinc.com",
        "market_cap": 41833
    },
    "MW1A.F": {
        "short_name": "MATTHEWS INTL CORP.A DL 1",
        "long_name": "Matthews International Corporation",
        "summary": "Matthews International Corporation provides brand solutions, memorialization products, and industrial technologies worldwide. The company's SGK Brand Solutions segment offers brand management and pre-media services, printing plates and cylinders, engineered products, imaging services, digital asset management, merchandising display systems, and marketing and design services primarily for the consumer goods and retail industries. Its Memorialization segment manufactures and markets a range of memorialization products for use in cemeteries, funeral homes, and crematories. This segment offers cast bronze memorials, flush bronze and granite memorials, upright granite memorials and monuments, cremation memorialization products, granite benches, flower vases, crypt plates and letters, cremation urns, niche units, cemetery features and statues, caskets, community and family mausoleums, bronze plaques, letters, emblems, vases, lights, and photo ceramics, as well as architectural products to identify or commemorate people, places, events, and accomplishments. The company's Industrial Technologies segment designs, manufactures, and distributes marking and coding equipment and consumables, industrial automation products, warehouse automation systems, and order fulfillment systems for identifying, tracking, picking, and conveying consumer and industrial products. This segment serves manufacturers, suppliers, and distributors of durable goods and building products; consumer goods manufacturers; and pharmaceutical producers. Matthews International Corporation was founded in 1850 and is headquartered in Pittsburgh, Pennsylvania.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Pittsburgh",
        "zipcode": "15212-5851",
        "website": "http://www.matw.com",
        "market_cap": 1078493696
    },
    "NNBR": {
        "short_name": "NN, Inc.",
        "long_name": "NN, Inc.",
        "summary": "NN, Inc., a diversified industrial company, designs, manufactures, and sells high-precision components and assemblies primarily for the electrical, automotive, general industrial, aerospace and defense, and medical markets. It operates through Mobile Solutions and Power Solutions segments. The Mobile Solutions segment manufactures and sells system critical components for fuel systems, engines and transmissions, power steering systems, and electromechanical motors for general industrial and automotive end markets. The Power Solutions segment designs, manufactures, and sells a range of high-precision metal and plastic components, assemblies, and finished devices used in applications ranging from power control to flight control and for military devices. Its products include electrical contacts, connectors, contact assemblies, and precision stampings for the electrical end market; and high precision products for the aerospace and defense end markets. This segment also produces various tools and instruments for the orthopaedics and medical/surgical end markets. The company sells its products worldwide primarily to manufacturers directly. NN, Inc. was founded in 1980 and is headquartered in Charlotte, North Carolina.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NC",
        "city": "Charlotte",
        "zipcode": "28277",
        "website": "http://www.nninc.com",
        "market_cap": 324678432
    },
    "NSRS": {
        "short_name": "NORTH SPRINGS RESOURCES CORP",
        "long_name": "North Springs Resources Corp",
        "summary": "North Springs Resources Corp. focuses on the evaluation, acquisition, exploration, and development of mineral resource properties. It also focuses on the acquisition and development of various products and services in the pharmaceutical and medical technology industries. The company was formerly known as Aurum Resources Corp. and changed its name to North Springs Resources Corp. in June 2011. North Springs Resources Corp. was founded in 2009 and is based in Riverview, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Riverview",
        "zipcode": "33569",
        "website": "http://www.northspringsresourcescorp.com",
        "market_cap": 2422025
    },
    "OBC.F": {
        "short_name": "OCEAN BIO-CHEM INC.DL-,01",
        "long_name": "Ocean Bio-Chem, Inc.",
        "summary": "Ocean Bio-Chem, Inc. manufactures, markets, and distributes appearance, performance, and maintenance products for the marine, automotive, power sports, recreational vehicle, home care, and outdoor power equipment markets in the United States and Canada. The company offers marine products, including polishes, cleaners, protectants, waxes, enzyme fuel treatments, private label products, motor and teak oils, boat washes, vinyl and teak cleaners, bilge and hull cleaners, silicone and polyurethane sealants, polysulfide sealants, gasket materials, lubricants, antifouling additives, and anti-freeze coolants; and brushes, brush handles, tie-downs, and other related accessories. It also manufactures automotive products, such as fuel treatments for gas and diesel engines, motor oils, greases, and related items; anti-freeze and windshield washes; and automotive polishes, cleaners, and other items. In addition, the company offers fuel treatment and other specialty products to the recreational vehicle market; solutions to various problems associated with E-10 fuel; and other specialty recreational vehicle/power sports products, including cleaners, polishes, detergents, fabric cleaners and protectors, silicone sealants, waterproofers, gasket materials, degreasers, vinyl cleaners and protectors, toilet treatment fluids, and anti-freeze/coolants. Further, it provides solutions to rectify operating engine problems in commercial lawn, and other home and garden power equipment; deodorizers, disinfectants, and sanitizers, as well as mildew odor control bags and boat odor sanitizers; blends and packages chemical formulations; and manufactures PVC and HDPE blow molded bottles. The company sells its products under the Star Tron, Performacide, and Star brite brands through retailers and online retailers, as well as to distributors. Ocean Bio-Chem, Inc. was founded in 1973 and is headquartered in Fort Lauderdale, Florida.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "FL",
        "city": "Fort Lauderdale",
        "zipcode": "33314",
        "website": "http://www.oceanbiochem.com",
        "market_cap": 104395504
    },
    "OBCI": {
        "short_name": "Ocean Bio-Chem, Inc.",
        "long_name": "Ocean Bio-Chem, Inc.",
        "summary": "Ocean Bio-Chem, Inc. manufactures, markets, and distributes appearance, performance, and maintenance products for the marine, automotive, power sports, recreational vehicle, home care, and outdoor power equipment markets in the United States and Canada. The company offers marine products, including polishes, cleaners, protectants, waxes, enzyme fuel treatments, private label products, motor and teak oils, boat washes, vinyl and teak cleaners, bilge and hull cleaners, silicone and polyurethane sealants, polysulfide sealants, gasket materials, lubricants, antifouling additives, and anti-freeze coolants; and brushes, brush handles, tie-downs, and other related accessories. It also manufactures automotive products, such as fuel treatments for gas and diesel engines, motor oils, greases, and related items; anti-freeze and windshield washes; and automotive polishes, cleaners, and other items. In addition, the company offers fuel treatment and other specialty products to the recreational vehicle market; solutions to various problems associated with E-10 fuel; and other specialty recreational vehicle/power sports products, including cleaners, polishes, detergents, fabric cleaners and protectors, silicone sealants, waterproofers, gasket materials, degreasers, vinyl cleaners and protectors, toilet treatment fluids, and anti-freeze/coolants. Further, it provides solutions to rectify operating engine problems in commercial lawn, and other home and garden power equipment; deodorizers, disinfectants, and sanitizers, as well as mildew odor control bags and boat odor sanitizers; blends and packages chemical formulations; and manufactures PVC and HDPE blow molded bottles. The company sells its products under the Star Tron, Performacide, and Star brite brands through retailers and online retailers, as well as to distributors. Ocean Bio-Chem, Inc. was founded in 1973 and is headquartered in Fort Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Fort Lauderdale",
        "zipcode": "33314",
        "website": "http://www.oceanbiochem.com",
        "market_cap": 126204432
    },
    "PRTT": {
        "short_name": "PROTECT PHARMACEUTICALS CORPORA",
        "long_name": "Protect Pharmaceutical Corporation",
        "summary": "Protect Pharmaceutical Corporation primarily focuses on crop farming and agricultural businesses. It acquires the Can Noguera property located in Selva Girona region in Spain. Its property consists of 60 hectares of arable land, 390 hectares of forests, 6 mineral and freshwater wells, and 3000 square meters of built properties. The company was formerly known as Pro-Tect, Inc. and changed its name to Protect Pharmaceutical Corporation in March 2010. Protect Pharmaceutical Corporation was founded in 1987 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89115",
        "website": "http://agropharmacy.com",
        "market_cap": 2401417
    },
    "RAGL": {
        "short_name": "RA GLOBAL SERVICES INC",
        "long_name": "RA Global Services, Inc.",
        "summary": "RA Global Services, Inc. provides oilfield services to the oil and gas industry. It offers logistics/project freight management, supply, and procurement services; and fabrication, oilfield inspections, and testing and services. The company also offers catering and facilities management services. It operates in the United States, Canada, West and Central Africa, the Middle East, Central Asia, and Russia. The company was formerly known as RealAmerica Co. and changed its name to RA Global Services, Inc. in March 2007. RA Global Services, Inc. is headquartered in Dallas, Texas with an additional office in London, United Kingdom.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75205",
        "website": null,
        "market_cap": 13009
    },
    "RIGG": {
        "short_name": "RICHLAND RES INTL GROUP INC",
        "long_name": "Richland Resources International Group Inc.",
        "summary": "Richland Resources International Group Inc., a development stage company, does not have significant operations. It intends effect a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses. The company was formerly known as Nevtah Capital Management Corporation and changed its name to Richland Resources International Group Inc. in July 2020. Richland Resources International Group Inc. was founded in 1986 and is based in Oceanside, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Oceanside",
        "zipcode": "11572",
        "website": null,
        "market_cap": 2344793
    },
    "RJDG": {
        "short_name": "RJD GREEN INC",
        "long_name": "RJD Green, Inc.",
        "summary": "RJD Green, Inc., a development stage company, focuses on acquiring and managing assets and companies in green environmental, energy, and specialty contracting services sectors. The company was formerly known as Silex Holdings, Inc. and changed its name to RJD Green, Inc. in October 2014. RJD Green, Inc. was founded in 2009 and is based in Tulsa, Oklahoma.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74135",
        "website": "http://www.rjdgreen.com",
        "market_cap": 1213303
    },
    "S0V.F": {
        "short_name": "SEABOARD CORP (DEL.) DL 1",
        "long_name": "Seaboard Corporation",
        "summary": "Seaboard Corporation operates as an agribusiness and transportation company worldwide. It operates through six segments: Pork, Commodity Trading and Milling (CT&M), Marine, Sugar and Alcohol, Power, and Turkey. The Pork segment produces and sells fresh and frozen pork products to further processors, foodservice operators, grocery stores, and distributors; hogs; and biodiesel. The CT&M segment sources, transports, and markets wheat, corn, soybeans, soybean meal, and other commodities; and produces wheat flour, maize meal, manufactured feed, and oilseed crush commodities. The Marine segment provides cargo shipping services in the United States, as well as in 26 countries in the Caribbean, and Central and South America; dry, refrigerated, and specialized containers, as well as other related equipment; and operates a terminal and an off-port warehouse for cargo consolidation and temporary storage. This segment operates through a fleet of 21 chartered and 3 owned vessels. The Sugar and Alcohol segment produces and sells sugar and alcohol; and generates and sells energy through its 51-megawatt cogeneration power plant that is fueled by sugarcane by-products, natural gas, and other biomass. The Power segment operates as an independent power producer that generates electricity for the power grid in the Dominican Republic. The Turkey segment produces and processes organic turkey products to retail stores, foodservice outlets, and industrial entities, as well as exports products to Mexico and internationally. The company also processes and sells jalapeÃ±o peppers. Seaboard Corporation was founded in 1918 and is headquartered in Merriam, Kansas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "KS",
        "city": "Merriam",
        "zipcode": "66202",
        "website": "http://www.seaboardcorp.com",
        "market_cap": 3687064064
    },
    "SBDG": {
        "short_name": "SMALL BUSINESS DEVELOPMENT GROU",
        "long_name": "Small Business Development Group, Inc.",
        "summary": "Small Business Development Group, Inc., a business solutions firm, provides financial advisory services. It offers advisory services related to merchant banking for small and mid-cap, private, or public companies; crisis management and turnaround consulting; buy-side and sell-side transactions; mergers and acquisitions; and formation of business development companies. The company is based in Saint Cloud, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Saint Cloud",
        "zipcode": "34769",
        "website": "http://www.rysgp.com/sbdg",
        "market_cap": 3144176
    },
    "SBOX": {
        "short_name": "SUPERBOX INC",
        "long_name": "QuantumKore Inc.",
        "summary": "QuantumKore Inc. provides technology solutions related to the waste conversion process and energy sector. It engages in the research and development of technology solutions related to desulphurization of fuels, nano emulsions, and waste to energy. The company was formerly known as SuperBox Inc. and changed its name to QuantumKore Inc. in March 2021. QuantumKore Inc. was incorporated in 1999 and is based in Oceanside, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Oceanside",
        "zipcode": "11572",
        "website": "http://www.quantumkore.com",
        "market_cap": 7956487
    },
    "SEB": {
        "short_name": "Seaboard Corporation",
        "long_name": "Seaboard Corporation",
        "summary": "Seaboard Corporation operates as an agribusiness and transportation company worldwide. It operates through six segments: Pork, Commodity Trading and Milling (CT&M), Marine, Sugar and Alcohol, Power, and Turkey. The Pork segment produces and sells fresh and frozen pork products to further processors, foodservice operators, grocery stores, and distributors; hogs; and biodiesel. The CT&M segment sources, transports, and markets wheat, corn, soybeans, soybean meal, and other commodities; and produces wheat flour, maize meal, manufactured feed, and oilseed crush commodities. The Marine segment provides cargo shipping services in the United States, as well as in 26 countries in the Caribbean, and Central and South America; dry, refrigerated, and specialized containers, as well as other related equipment; and operates a terminal and an off-port warehouse for cargo consolidation and temporary storage. This segment operates through a fleet of 21 chartered and 3 owned vessels. The Sugar and Alcohol segment produces and sells sugar and alcohol; and generates and sells energy through its 51-megawatt cogeneration power plant that is fueled by sugarcane by-products, natural gas, and other biomass. The Power segment operates as an independent power producer that generates electricity for the power grid in the Dominican Republic. The Turkey segment produces and processes organic turkey products to retail stores, foodservice outlets, and industrial entities, as well as exports products to Mexico and internationally. The company also processes and sells jalapeÃ±o peppers. Seaboard Corporation was founded in 1918 and is headquartered in Merriam, Kansas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "KS",
        "city": "Merriam",
        "zipcode": "66202",
        "website": "http://www.seaboardcorp.com",
        "market_cap": 4377289728
    },
    "SIGN": {
        "short_name": "SIGNET INTERNATIONAL HOLDINGS I",
        "long_name": "Signet International Holdings, Inc.",
        "summary": "Signet International Holdings, Inc., a development stage company, focuses on developing advanced technologies, energy solutions, and medical devices. It focuses on development of bioscience and sport medicines, including Sterilal self-sanitizing devices, PASS smart denture mouth guards, handheld heart attack sensors, and melanoma detection systems. The company also offers InCharge magnetic-based battery device that provides energy; and develops applications for de-icing application of graphene for use in the airline industry, as well as technology for arc melted glass piles for structural foundations. Signet International Holdings, Inc., was founded in 2003 and is based in Palm Beach, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Palm Beach",
        "zipcode": "33480",
        "website": "http://www.signetinternationalholdings.com",
        "market_cap": 3620220
    },
    "SPGX": {
        "short_name": "SUSTAINABLE PROJECTS GROUP INC",
        "long_name": "Sustainable Projects Group Inc.",
        "summary": "Sustainable Projects Group Inc., a business development company, engages in project development and holdings through value based investments and collaborative partnerships with companies in various sectors. The company, through its 55% joint venture interest in Hero Wellness Systems Inc., engages in importing, marketing, distributing, and selling luxury massage therapeutic chairs. The company was formerly known as Sustainable Petroleum Group Inc. and changed its name to Sustainable Projects Group Inc. in October 2017. Sustainable Projects Group Inc. was founded in 2009 and is headquartered in Naples, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Naples",
        "zipcode": "34102",
        "website": "http://www.spgroupe.com",
        "market_cap": 691254
    },
    "SPLP-PA": {
        "short_name": "Steel Partners Holdings LP 6.0%",
        "long_name": "Steel Partners Holdings L.P.",
        "summary": "Steel Partners Holdings L.P., through its subsidiaries, engages in industrial products, energy, defense, supply chain management, logistics, direct marketing, banking, and youth sports businesses worldwide. It operates through Diversified Industrial, Energy, and Financial Services segments. The company fabricates precious metals and alloys into brazing alloys; manufactures and sells seamless stainless steel tubing coils; fasteners, adhesives, and fastening systems for the commercial low slope roofing industry, as well as specialty fasteners for the building products industry; and woven substrates of fiberglass, quartz, carbon, and aramid materials for specialty applications. It also designs, manufactures, and markets power electronics and protection, motion control, power quality electromagnetic equipment, custom ball-screws, and gears and gearboxes used in medical, commercial and military aerospace, computer, datacom, industrial, specialty LED lighting, test and measurement, and telecom applications. In addition, the company provides meat-room blade products, repair services, and distributed products for the meat and deli departments of supermarkets, restaurants, and meat and fish processing plants, as well as for electrical saws and cutting equipment distributors; cutting blades for bakeries; and wood cutting blade products for the pallet manufacturing, pallet recycler, and portable saw mill industries. Further, it manufactures and distributes coated, laminated and metallized films for imaging, aerospace, insulation and solar photo-voltaic markets; originates and funds consumer and small business loans; issues credit cards; takes deposits; participates in syndicated commercial and industrial, and asset based credit facilities and securitizations; and offers drilling and production services to the oil and gas industry. Steel Partners Holdings GP Inc. serves as the general partner of the company. The company was founded in 1990 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022",
        "website": "http://www.steelpartners.com",
        "market_cap": 369456480
    },
    "SPLP": {
        "short_name": "Steel Partners Holdings LP LTD ",
        "long_name": "Steel Partners Holdings L.P.",
        "summary": "Steel Partners Holdings L.P., through its subsidiaries, engages in industrial products, energy, defense, supply chain management, logistics, direct marketing, banking, and youth sports businesses worldwide. It operates through Diversified Industrial, Energy, and Financial Services segments. The company fabricates precious metals and alloys into brazing alloys; manufactures and sells seamless stainless steel tubing coils; fasteners, adhesives, and fastening systems for the commercial low slope roofing industry, as well as specialty fasteners for the building products industry; and woven substrates of fiberglass, quartz, carbon, and aramid materials for specialty applications. It also designs, manufactures, and markets power electronics and protection, motion control, power quality electromagnetic equipment, custom ball-screws, and gears and gearboxes used in medical, commercial and military aerospace, computer, datacom, industrial, specialty LED lighting, test and measurement, and telecom applications. In addition, the company provides meat-room blade products, repair services, and distributed products for the meat and deli departments of supermarkets, restaurants, and meat and fish processing plants, as well as for electrical saws and cutting equipment distributors; cutting blades for bakeries; and wood cutting blade products for the pallet manufacturing, pallet recycler, and portable saw mill industries. Further, it manufactures and distributes coated, laminated and metallized films for imaging, aerospace, insulation and solar photo-voltaic markets; originates and funds consumer and small business loans; issues credit cards; takes deposits; participates in syndicated commercial and industrial, and asset based credit facilities and securitizations; and offers drilling and production services to the oil and gas industry. Steel Partners Holdings GP Inc. serves as the general partner of the company. The company was founded in 1990 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022",
        "website": "http://www.steelpartners.com",
        "market_cap": 503072608
    },
    "STCN": {
        "short_name": "Steel Connect, Inc. Common Stoc",
        "long_name": "Steel Connect, Inc.",
        "summary": "Steel Connect, Inc., together with its subsidiaries, provides direct marketing and supply chain services in the United States, China, the Netherlands, and internationally. It offers data-driven marketing solutions, including strategy, data and analytics, response analysis, creative services, lithographic and digital printing, envelope printing and converting, component manufacturing, promotional cards, data processing and hygiene, content and asset management, personalization, lettershop and bindery, and postal optimization for paper-based direct marketing and omnichannel marketing campaigns, as well as provides business continuity and disaster recovery services. The company also offers product configuration and packaging, kitting, and assembly of components and parts into finished goods; and value-added processes, such as product testing, radio frequency identification tagging, product or service activation, language settings, personalization and engraving, multi-channel packaging, and packaging design services. In addition, it provides fulfillment services comprising order management, pick, pack and ship, retail compliance, and demand planning services; and reverse logistics services that simplifies the returns process for retailers and manufacturers, as well as operates a cloud-based e-commerce platform. Steel Connect, Inc. offers its supply chain services to customers in the consumer electronics, communications, computing, medical devices, software, storage, and retail markets. The company was formerly known as ModusLink Global Solutions, Inc. and changed its name to Steel Connect, Inc. in February 2018. Steel Connect, Inc. was incorporated in 1986 and is headquartered in Waltham, Massachusetts.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Waltham",
        "zipcode": "02451",
        "website": "http://www.steelconnectinc.com",
        "market_cap": 130410616
    },
    "SYVN": {
        "short_name": "SYCAMORE VENTURES INC",
        "long_name": "Sycamore Ventures, Inc.",
        "summary": "Sycamore Ventures, Inc. engages in the manufacture and supply of food based meals and snacks, and non-toxic personal care products in the United States. The company provides Appulse, a snack and meal replacement; and food energy bars. Its personal care products include shampoos and lip balms; Congest Ease, a decongestant that eliminate congestion in the respiratory system; Breathe Easy products to moisturize and sooth irritated nasal passages; and Divine skin care creams. The company also offers Tooth Fairy, a cleanser, deodorizer, and breath freshener. In addition, it publishes farmacist desk reference books; and educational posters. The company was founded in 2006 and is based in Park City, Utah.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "UT",
        "city": "Park City",
        "zipcode": "84098",
        "website": null,
        "market_cap": 145440
    },
    "TALC": {
        "short_name": "TAL CAP INC",
        "long_name": "Tal-Cap, Inc.",
        "summary": "Tal Cap, Inc. does not have significant operations. It focuses on acquiring a viable business. The company is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89118",
        "website": null,
        "market_cap": 30484
    },
    "TRC": {
        "short_name": "Tejon Ranch Co",
        "long_name": "Tejon Ranch Co.",
        "summary": "Tejon Ranch Co. operates as a diversified real estate development and agribusiness company. It operates through five segments: Commercial/Industrial Real Estate Development, Resort/Residential Real Estate Development, Mineral Resources, Farming, and Ranch Operations. The Commercial/Industrial Real Estate Development segment engages in the planning and permitting of land for development; construction of infrastructure projects, pre-leased buildings, and buildings to be leased or sold; and sale of land to third parties for their own development. It is also involved in the activities related to communications leases, and landscape maintenance. This segment leases land to two auto service stations with convenience stores, 13 fast-food operations, a full-service restaurants, a motel, an antique shop, and a post office; various microwave repeater locations, radio and cellular transmitter sites, and fiber optic cable routes; and 32 acres of land for an electric power plant. The Resort/Residential Real Estate Development segment engages in land entitlement, planning, pre-construction engineering, stewardship, and conservation activities. The Mineral Resources segment includes oil and gas royalties, rock and aggregate royalties, and royalties from a cement operation leased to National Cement Company of California, Inc.; and the management of water assets and infrastructure projects. The Farming segment farms permanent crops, such as wine grapes in 835 acres, almonds in 2,281 acres, and pistachios in 1,053 acres. It also manages the farming of alfalfa and forage mix on 626 acres in the Antelope Valley; and leases 720 acres of land for growing vegetables, as well as almonds. The Ranch Operations segment provides game management and ancillary land services comprising grazing leases and filming, as well as various guided hunts. The company was founded in 1843 and is headquartered in Lebec, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Lebec",
        "zipcode": "93243",
        "website": "http://tejonranch.com",
        "market_cap": 402686624
    },
    "TRRE": {
        "short_name": "TERRA ENERGY & RESOURCE TECHNOL",
        "long_name": "Terra Energy Resources, Ltd.",
        "summary": "Terra Energy Resources, Ltd. engages in the process of polymer based recycling and reformation activities. The company produces and sells various kinds of oil based polymer materials to manufacturers for re-use. It serves food, maritime, auto, and construction industries. The company was formerly known as Terra Media, Ltd. and changed its name to Terra Energy Resources, Ltd. in June 2008. Terra Energy Resources, Ltd. is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10001",
        "website": null,
        "market_cap": 563144
    },
    "TTHG": {
        "short_name": "TITANIUM HOLDINGS GROUP INC",
        "long_name": "Titanium Holdings Group, Inc.",
        "summary": "Titanium Holdings Group, Inc., together with its subsidiary, Cleaning Ideas Corp. manufactures and distributes sanitary maintenance supplies and paper products in the United States. It operates nine Cleaning Ideas retail stores. The company is based in San Antonio, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "San Antonio",
        "zipcode": "78207",
        "website": "http://www.titaniumholdings.com",
        "market_cap": 1123478
    },
    "UATG": {
        "short_name": "UMBRA APPLIED TECHNOLOGIES GROU",
        "long_name": "Umbra Applied Technologies Group, Inc.",
        "summary": "Umbra Applied Technologies Group, Inc. operates as a green technology development, fabrication, and commercialization company. The company develops and manufactures equipment, products, and systems to global remediation projects. Its technologies include power generation, oil and sand processing, oil shale processing, inland and salt water oil spill remediation, water remediation, water desalinization and medical waste remediation, and e-waste remediation. The company was formerly known as Green Processing Technologies, Inc. and changed its name to Umbra Applied Technologies Group, Inc. in January 2014. The company is headquartered in Tampa, Florida. Umbra Applied Technologies Group, Inc. is a subsidiary of Green Processing Technologies, Inc.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Tampa",
        "zipcode": "33607",
        "website": "http://www.uatgroup.com",
        "market_cap": 963213
    },
    "UMCN": {
        "short_name": "UMC INC",
        "long_name": "UMC, Inc.",
        "summary": "UMC, Inc. provides medical insurance claims coding and processing, electronic medical records storage, chargemaster review, pricing comparison, and accounts receivable management services to healthcare providers. Its customers primarily include hospitals, medical clinics, and physician practitioners in the United States. The company was formerly known as United Medicorp, Inc. and changed its name to UMC, Inc. in May 2007. UMC, Inc. was incorporated in 1989 and is based in Pampa, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Pampa",
        "zipcode": "79065",
        "website": null,
        "market_cap": 632952
    },
    "UPIN": {
        "short_name": "UNIVERSAL POWER INDUSTRY CORP",
        "long_name": "Universal Power Industry Corporation",
        "summary": "Universal Power Industry Corporation engages in the development of certified offshore programmers database. Its database is used to locate and refer qualified programmers. The company also intends to offer programming services in an offshore floating vessel. The company was formerly known as Code Navy and changed its name to Universal Power Industry Corporation in April 2016. Universal Power Industry Corporation was founded in 2007 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10018",
        "website": "http://www.upinholdings.com",
        "market_cap": 20893286
    },
    "USDF": {
        "short_name": "US-DADI FERTILIZER IND INTL INC",
        "long_name": "US-Dadi Fertilizer Industry International, Inc.",
        "summary": "US-DADI Fertilizer Industry International, Inc. focuses on fertilizer-related products and equipment exporting business. The company was founded in 2010 and is based in Pasadena, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Pasadena",
        "zipcode": "91107",
        "website": null,
        "market_cap": 369792
    },
    "VBVT": {
        "short_name": "VIABUILT VENTURES INC",
        "long_name": "Viabuilt Ventures Inc.",
        "summary": "Firetainment, Inc. designs and manufactures fire pit tables for home and commercial outdoor patio, deck, and backyard spaces. The company was founded in 2011 and is based in Orlando, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Orlando",
        "zipcode": "32804",
        "website": "http://www.firetainment.com",
        "market_cap": 463008
    },
    "VIVC": {
        "short_name": "VIVIC CORP",
        "long_name": "Vivic Corp.",
        "summary": "Vivic Corp. operates as a travel agency in the Dominican Republic. The company organizes individual and group tours, such as cultural, recreational, sport, business, eco tours, and other travel tours. It also engages in the construction of marinas and yachts under the brand Monte Fino; operation of Joy Wave, an online platform that offers yacht rental and leisure services; development of energy-saving yacht engines; and provision of tourism consultancy and of yacht services. The company was incorporated in 2017 and is based in Las Vegas, Nevada. Vivic Corp. is a subsidiary of Honetech Inc.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89119",
        "website": "http://www.vivic.biz",
        "market_cap": 46493380
    },
    "VRTV.MX": {
        "short_name": "VERITIV CORP",
        "long_name": "Veritiv Corporation",
        "summary": "Veritiv Corporation operates as a business-to-business provider of value-added packaging products and services, as well as facility solutions, print, and publishing products and services in the United States, Canada, Mexico, and internationally. The Packaging segment provides custom and standard packaging solutions. The Facility Solutions segment sources and sells cleaning, break-room, and other supplies, such as towels, tissues, commercial cleaning chemicals, personal protective equipment and safety supplies, wipers, can liners, soaps and sanitizers, dispensers, sanitary maintenance supplies and equipment, hazard supplies, and shampoos and amenities. The Print segment sells and distributes commercial printing, writing, copying, digital, and specialty products; and graphics consumables and equipment. It also provides customized paper conversion services of commercial printing paper for distribution to document centers and form printers. The Publishing segment sells and distributes coated and uncoated commercial printing papers to publishers, retailers, converters, printers, and specialty businesses for use in magazines, catalogs, books, directories, gaming, couponing, retail inserts, and direct mail. This segment also provides print management, procurement, and supply chain management solutions. The company also offers logistics solutions. Veritiv Corporation offers its products under the Endurance, nordic+, Comet, Starbrite Opaque Select, TUFflex, Reliable, and Spring Grove brands, as well as other brands to customers in manufacturing, food processing and service, fulfillment and internet retail, property management, higher education, healthcare, entertainment and hospitality, commercial printing and publishing sectors. As of December 31, 2020 the Company operated approximately 125 distribution centers. Veritiv Corporation was incorporated in 2013 and is headquartered in Atlanta, Georgia.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30328",
        "website": "http://www.veritivcorp.com",
        "market_cap": 20238006272
    },
    "VRTV": {
        "short_name": "Veritiv Corporation",
        "long_name": "Veritiv Corporation",
        "summary": "Veritiv Corporation operates as a business-to-business provider of value-added packaging products and services, as well as facility solutions, print, and publishing products and services in the United States, Canada, Mexico, and internationally. The Packaging segment provides custom and standard packaging solutions. The Facility Solutions segment sources and sells cleaning, break-room, and other supplies, such as towels, tissues, commercial cleaning chemicals, personal protective equipment and safety supplies, wipers, can liners, soaps and sanitizers, dispensers, sanitary maintenance supplies and equipment, hazard supplies, and shampoos and amenities. The Print segment sells and distributes commercial printing, writing, copying, digital, and specialty products; and graphics consumables and equipment. It also provides customized paper conversion services of commercial printing paper for distribution to document centers and form printers. The Publishing segment sells and distributes coated and uncoated commercial printing papers to publishers, retailers, converters, printers, and specialty businesses for use in magazines, catalogs, books, directories, gaming, couponing, retail inserts, and direct mail. This segment also provides print management, procurement, and supply chain management solutions. The company also offers logistics solutions. Veritiv Corporation offers its products under the Endurance, nordic+, Comet, Starbrite Opaque Select, TUFflex, Reliable, and Spring Grove brands, as well as other brands to customers in manufacturing, food processing and service, fulfillment and internet retail, property management, higher education, healthcare, entertainment and hospitality, commercial printing and publishing sectors. As of December 31, 2020 the Company operated approximately 125 distribution centers. Veritiv Corporation was incorporated in 2013 and is headquartered in Atlanta, Georgia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30328",
        "website": "http://www.veritivcorp.com",
        "market_cap": 748886848
    },
    "WNRS": {
        "short_name": "WINNERS INC",
        "long_name": "Winners, Inc.",
        "summary": "VegasWinners, Inc. provides sports gaming information, analysis, advice, and predictions services. The company provides analysis, and handicapping advice, and analyzes and predicts sports event winners for sports bettors. The company caters to sports fans, both major bettors and newcomers in the betting landscape. The company was incorporated in 2018 and is based in Henderson, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Henderson",
        "zipcode": "89002",
        "website": "http://vegaswinners.com",
        "market_cap": null
    },
    "ZNNC": {
        "short_name": "ZANN CORP",
        "long_name": "Zann Corp.",
        "summary": "Zann Corp. does not have significant operations. It intends to acquire, or merge with other operating entity. Previously, the company was engaged in the marketing and sale of nutritional supplements. Zann Corp. was incorporated in 1999 and is based in Fenton, Michigan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MI",
        "city": "Fenton",
        "zipcode": "48430",
        "website": "http://www.zann-pjt.com",
        "market_cap": 5867
    }
}