{
  "1AW.F": {
    "city": "Rockville",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "Argan, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "ARGAN INC.  DL-,15",
    "state": "MD",
    "summary": "Argan, Inc., through its subsidiaries, provides engineering, procurement, construction, commissioning, operations management, maintenance, project development, technical, and consulting services to the power generation and renewable energy markets. The company operates through three segments: Power Industry Services, Industrial Fabrication and Field Services, and Telecommunications Infrastructure Services. The Power Industry Services segment offers engineering, procurement, and construction (EPC) contracting services to the owners of alternative energy facilities, such as biomass plants, wind farms, and solar fields; and design, construction, project management, start-up, and operation services for projects with approximately 15 gigawatts of power-generating capacity. This segment serves independent power project owners, public utilities, power plant equipment suppliers, and energy plant construction companies. The Industrial Fabrication and Field Services segment provides industrial field, and pipe and vessel fabrication services for forest products, industrial gas, large fertilizer, mining, and petrochemical companies in southeast region of the United States. The Telecommunications Infrastructure Services segment offers trenchless directional boring and excavation for underground communication and power networks, as well as aerial cabling services; and installs buried cable, high and low voltage electric lines, and private area outdoor lighting systems. It also provides structuring, cabling, terminations, and connectivity that offers the physical transport for high speed data, voice, video, and security networks. This segment serves state and local government agencies, regional communications service providers, electric utilities, and other commercial customers, as well as federal government facilities comprising cleared facilities in the mid-Atlantic region of the United States. Argan, Inc. was incorporated in 1961 and is headquartered in Rockville, Maryland.",
    "website": "http://www.arganinc.com",
    "zipcode": "20850"
  },
  "1PM.F": {
    "city": "Dallas",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "Primoris Services Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "PRIMORIS SERVICES CORP.",
    "state": "TX",
    "summary": "Primoris Services Corporation, a specialty contractor company, provides a range of construction, fabrication, maintenance, replacement, and engineering services in the United States and Canada. It operates in five segments: Power, Industrial, and Engineering; Pipeline and Underground; Utilities and Distribution; Transmission and Distribution; and Civil. The Power, Industrial, and Engineering segment offers engineering, procurement, construction, retrofit, upgrade, repair, outage, and maintenance services for entities in the petroleum and petrochemical industries, as well as traditional and renewable power generators. The Pipeline and Underground segment provides a range of services comprising pipeline construction, maintenance, facility, and integrity services; installation of compressor and pump stations; and metering facilities for entities in the petroleum and petrochemical industries, as well as gas, water, and sewer utilities. The Utilities and Distribution segment offers installation and maintenance services for natural gas utility distribution systems; and pipeline integrity services for entities in the gas utility market. The Transmission and Distribution segment provides installation and maintenance services for electric utility transmission, substation, and distribution systems for entities in the electric utility market. The Civil segment undertakes highway and bridge construction, airport runway construction, demolition, site work, soil stabilization, mass excavation, flood control, and drainage projects for entities in the petroleum and petrochemical industries, state and municipal departments of transportation, and airports. The company was founded in 1960 and is headquartered in Dallas, Texas.",
    "website": "http://www.primoriscorp.com",
    "zipcode": "75201"
  },
  "28T.F": {
    "city": "Daytona Beach",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "TopBuild Corp.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "TOPBUILD CORP.  DL -,01",
    "state": "FL",
    "summary": "TopBuild Corp. installs and distributes insulation and other building products to the United States construction industry. The company operates in two segments, Installation and Distribution. It offers insulation products, rain gutters, glass and windows, afterpaint products, fireproofing and firestopping products, garage doors, fireplaces, closet shelving, roofing materials, accessories, and other products; and insulation installation services. The company also provides various services and tools to assist builders in applying the principles of building science to new home construction, which include pre-construction plan reviews, various inspection services, and diagnostic testing; and home energy rating services. It serves single-family homebuilders, single-family custom builders, multi-family builders, commercial general contractors, remodelers, and individual homeowners, as well as insulation contractors, gutter contractors, weatherization contractors, other contractors, dealers, metal building erectors, and modular home builders. The company operates approximately 200 installation branches and 75 distribution centers in the United States. The company was formerly known as Masco SpinCo Corp. and changed its name to TopBuild Corp. in March 2015. TopBuild Corp. was incorporated in 2015 and is headquartered in Daytona Beach, Florida.",
    "website": "http://www.topbuild.com",
    "zipcode": "32114"
  },
  "4AM.F": {
    "city": "Framingham",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "Ameresco, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "AMERESCO INC.CL.A DL-0001",
    "state": "MA",
    "summary": "Ameresco, Inc. provides comprehensive energy services for businesses and organizations in the United States, Canada, and internationally. It offers energy efficiency, infrastructure upgrades, energy security and resilience, asset sustainability, and renewable energy solutions. The company operates through U.S. Regions, U.S. Federal, Canada, and Non-Solar Distributed Generation segments. It designs, develops, engineers, and installs projects that reduce the energy, as well as operations and maintenance costs of customers' facilities. The company's projects primarily include various measures customized for the facility and designed to enhance the efficiency of building systems, such as heating, ventilation, cooling, and lighting systems. It also offers renewable energy products and services, such as the construction of small-scale plants for customers that produce electricity, gas, heat, or cooling from renewable sources of energy; and sells electricity and processed renewable gas fuel, heat, or cooling. In addition, the company provides integrated- photovoltaic (PV) and consulting, and enterprise energy management services; sells solar PV energy products and systems; and owns and operates a wind power project located in Ireland. It serves federal, state, and local governments, as well as healthcare and educational institutions, airports, public housing authorities and public universities, and commercial and industrial customers. As of December 31, 2020, the company owned and operated 130 small-scale renewable energy plants and solar PV installations. Ameresco, Inc. was founded in 2000 and is headquartered in Framingham, Massachusetts.",
    "website": "http://www.ameresco.com",
    "zipcode": "01701"
  },
  "4EG.F": {
    "city": "Houston",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "ENGlobal Corporation",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ENGLOBAL  DL-,001",
    "state": "TX",
    "summary": "ENGlobal Corporation provides engineering and automation services primarily to the energy sector in the United States and internationally. It operates through two segments, EPCM and Automation. The EPCM segment provides multi-disciplined engineering services relating to the development, management, and execution of projects requiring professional engineering and related project management services. It offers feasibility studies, engineering, design, procurement, construction management, project definition, cost estimating, environmental compliance, project management, and fabrication services. The Automation segment provides design, integration, and implementation of process distributed control and analyzer systems, advanced automated data gathering systems, and information technology, as well as the maintenance of these systems primarily to the energy industry. This segment also designs, assembles, integrates, and services control and instrumentation systems for specific applications in the energy and processing related industries. The company serves Fortune 500 companies in the energy industry and the United States government. ENGlobal Corporation company was founded in 1985 and is headquartered in Houston, Texas.",
    "website": "http://www.englobal.com",
    "zipcode": "77060-5914"
  },
  "5GL.F": {
    "city": "Houston",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "Great Lakes Dredge & Dock Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "GREAT LA.DR.+DO.NEW DL-01",
    "state": "TX",
    "summary": "Great Lakes Dredge & Dock Corporation provides dredging services in the United States. The company engages in capital dredging that consists of port expansion projects, coastal restoration and land reclamations, trench digging for pipelines, tunnels and cables, and other dredging related to the construction of breakwaters, jetties, canals, and other marine structures. It is also involved in coastal protection projects, which involves moving sand from the ocean floor to shoreline locations where erosion threatens shoreline assets; maintenance dredging, which consists of the re-dredging of previously deepened waterways and harbors to remove silt, sand and other accumulated sediments; land reclamations, channel deepening, and port infrastructure development; lake and river dredging, inland levee and construction dredging, environmental restoration and habitat improvement, and other marine construction projects. The company serves federal, state, and local governments; foreign governments; and domestic and foreign private concerns, such as utilities, oil, and other energy companies. It operates a fleet of 20 dredges, 17 material transportation barges, 1 drillboat, and various other support vessels. The company was formerly known as Lydon & Drews Partnership and changed its name to Great Lakes Dredge & Dock Corporation in 1905. Great Lakes Dredge & Dock Corporation was founded in 1890 and is headquartered in Houston, Texas.",
    "website": "http://www.gldd.com",
    "zipcode": "77024"
  },
  "ACM": {
    "city": "Los Angeles",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Engineering & Construction",
    "long_name": "AECOM",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "AECOM",
    "state": "CA",
    "summary": "AECOM, together with its subsidiaries, delivers professional services to program and construction management in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It operates through three segments: Americas, International, and AECOM Capital. The company engages in planning, consulting, architectural, engineering, and construction management services for commercials and governments clients. It also invests in and develops real estate projects. In addition, the company provides building construction and energy, as well as infrastructure and industrial construction services. It serves transportation, water, government, facilities, environmental, and energy sectors. The company was formerly known as AECOM Technology Corporation and changed its name to AECOM in January 2015. AECOM was founded in 1980 and is headquartered in Los Angeles, California.",
    "website": "http://www.aecom.com",
    "zipcode": "90071"
  },
  "AEGN": {
    "city": "Saint Louis",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Engineering & Construction",
    "long_name": "Aegion Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Aegion Corp",
    "state": "MO",
    "summary": "Aegion Corporation provides technologies to maintain, rehabilitate, and strengthen infrastructure in the United States, Canada, Europe, and internationally. It operates through two segments, Infrastructure Solutions and Corrosion Protection. The company offers various solutions for rehabilitating and maintaining aging or deteriorating infrastructure; protecting new infrastructure from corrosion and other threats; and providing integrated professional services in engineering, procurement, construction, maintenance, and turnaround services for oil and natural gas companies. Its solutions include rehabilitation of water and wastewater pipelines; fusible polyvinyl chloride products for rehabilitation and new installation; fiber reinforced polymer systems for rehabilitation and strengthening; cathodic protection for corrosion engineering control and infrastructure rehabilitation; pipe coatings for corrosion and thermal control and prevention; thermoplastic pipe lining for corrosion control, abrasion protection, and pipeline rehabilitation; and construction and maintenance of oil and gas facilities. The company serves municipal, state, and federal governments, as well as corporate customers in various industries, including pipelines, energy, oil and gas, refinery, mining, general and industrial construction, infrastructure, water and wastewater, transportation, utilities, maritime, and defense. Aegion Corporation was founded in 1971 and is headquartered in Saint Louis, Missouri.",
    "website": "http://www.aegion.com",
    "zipcode": "63005-1195"
  },
  "AGX": {
    "city": "Rockville",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Engineering & Construction",
    "long_name": "Argan, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Argan, Inc.",
    "state": "MD",
    "summary": "Argan, Inc., through its subsidiaries, provides engineering, procurement, construction, commissioning, operations management, maintenance, project development, technical, and consulting services to the power generation and renewable energy markets. The company operates through three segments: Power Industry Services, Industrial Fabrication and Field Services, and Telecommunications Infrastructure Services. The Power Industry Services segment offers engineering, procurement, and construction (EPC) contracting services to the owners of alternative energy facilities, such as biomass plants, wind farms, and solar fields; and design, construction, project management, start-up, and operation services for projects with approximately 15 gigawatts of power-generating capacity. This segment serves independent power project owners, public utilities, power plant equipment suppliers, and energy plant construction companies. The Industrial Fabrication and Field Services segment provides industrial field, and pipe and vessel fabrication services for forest products, industrial gas, large fertilizer, mining, and petrochemical companies in southeast region of the United States. The Telecommunications Infrastructure Services segment offers trenchless directional boring and excavation for underground communication and power networks, as well as aerial cabling services; and installs buried cable, high and low voltage electric lines, and private area outdoor lighting systems. It also provides structuring, cabling, terminations, and connectivity that offers the physical transport for high speed data, voice, video, and security networks. This segment serves state and local government agencies, regional communications service providers, electric utilities, and other commercial customers, as well as federal government facilities comprising cleared facilities in the mid-Atlantic region of the United States. Argan, Inc. was incorporated in 1961 and is headquartered in Rockville, Maryland.",
    "website": "http://www.arganinc.com",
    "zipcode": "20850"
  },
  "AMLC": {
    "city": "Gardena",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Engineering & Construction",
    "long_name": "Amelco Corporation",
    "market": "us_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "AMELCO CORP",
    "state": "CA",
    "summary": "Amelco Corporation provides electrical construction and engineering services to wastewater and water treatment facilities, transportation systems and building contractors. The company was founded in 1945 and is based in Gardena, California.",
    "website": null,
    "zipcode": "90248-4414"
  },
  "AMRC": {
    "city": "Framingham",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Engineering & Construction",
    "long_name": "Ameresco, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "Ameresco, Inc.",
    "state": "MA",
    "summary": "Ameresco, Inc. provides comprehensive energy services for businesses and organizations in the United States, Canada, and internationally. It offers energy efficiency, infrastructure upgrades, energy security and resilience, asset sustainability, and renewable energy solutions. The company operates through U.S. Regions, U.S. Federal, Canada, and Non-Solar Distributed Generation segments. It designs, develops, engineers, and installs projects that reduce the energy, as well as operations and maintenance costs of customers' facilities. The company's projects primarily include various measures customized for the facility and designed to enhance the efficiency of building systems, such as heating, ventilation, cooling, and lighting systems. It also offers renewable energy products and services, such as the construction of small-scale plants for customers that produce electricity, gas, heat, or cooling from renewable sources of energy; and sells electricity and processed renewable gas fuel, heat, or cooling. In addition, the company provides integrated- photovoltaic (PV) and consulting, and enterprise energy management services; sells solar PV energy products and systems; and owns and operates a wind power project located in Ireland. It serves federal, state, and local governments, as well as healthcare and educational institutions, airports, public housing authorities and public universities, and commercial and industrial customers. As of December 31, 2020, the company owned and operated 130 small-scale renewable energy plants and solar PV installations. Ameresco, Inc. was founded in 2000 and is headquartered in Framingham, Massachusetts.",
    "website": "http://www.ameresco.com",
    "zipcode": "01701"
  },
  "APG": {
    "city": "New Brighton",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Engineering & Construction",
    "long_name": "APi Group Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "APi Group Corporation",
    "state": "MN",
    "summary": "APi Group Corporation provides safety, specialty, and industrial services primarily in North America. It operates through three segments: Safety Services, Specialty Services, and Industrial Services. The Safety Services segment offers safety solutions focusing on end-to-end integrated occupancy systems, such as fire protection solutions, and HVAC and entry systems, which include the design, installation, inspection, and service of these integrated systems. The Specialty Services segment offers infrastructure services and specialized industrial plant solutions, including maintenance and repair of underground electric, gas, water, sewer, and telecommunications infrastructure. The Industrial Services segment provides various services and solutions comprising oil and gas pipeline infrastructure, access and road construction, supporting facilities, and integrity management and maintenance to the energy industry focused on transmission and distribution. APi Group Corporation serves customers in the public and private sectors, including commercial, industrial, data center, distribution, manufacturing, education, healthcare, communications, utilities, energy, high tech, and governmental markets. The company was formerly known as J2 Acquisition Limited and changed its name to APi Group Corporation in October 2019. APi Group Corporation was founded in 1926 and is headquartered in New Brighton, Minnesota.",
    "website": "http://www.apigroupinc.com",
    "zipcode": "55112"
  },
  "ATCX": {
    "city": "Austin",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Engineering & Construction",
    "long_name": "Atlas Technical Consultants, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Atlas Technical Consultants, In",
    "state": "TX",
    "summary": "Atlas Technical Consultants, Inc. provides professional testing, inspection, engineering, environmental, and program management and consulting services in the United States. The company provides a range of technical services, helping its clients test, inspect, plan, design, certify, and manage various projects across various end markets. It offers testing, inspection, and certification services, such as construction materials testing; non-destructive testing and evaluations, materials testing and inspection, laboratory, and geophysics; construction quality assurance; owner verification and inspection; forensic and structural investigations; and materials laboratory services. The company also provides environmental services, including environmental permitting, compliance assistance, and auditing and compliance management system implementation; air quality; water, hazardous material permitting, and registration; underground storage tank management; leak detection and repair program management; water resource management; industrial hygiene and building science; and disaster response and recovery. In addition, it offers engineering and design comprising civil site, transportation, and geotechnical engineering; hydrogeology; water/wastewater; solid waste/landfill; land acquisition; subsurface utility engineering; surveying and mapping; and geographic information system asset inventory and assessments. Further, the company offers program management/construction management/quality management services consisting of programmatic planning and phasing; contract document preparation; bid evaluation and award analysis; alternative/value engineering; project estimating and scheduling; project cost/schedule control; contract administration; project management; community relations/affairs; asset management; construction management services; quality management and assurance; and construction engineering and inspection. The company is headquartered in Austin, Texas.",
    "website": "http://www.oneatlas.com",
    "zipcode": "78738"
  },
  "BBCP": {
    "city": "Thornton",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Engineering & Construction",
    "long_name": "Concrete Pumping Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Concrete Pumping Holdings, Inc.",
    "state": "CO",
    "summary": "Concrete Pumping Holdings, Inc. provides concrete pumping and waste management services in the United States and the United Kingdom. The company offers concrete pumping services to general contractors and concrete finishing companies in the commercial, infrastructure, and residential sectors under the Brundage-Bone and Camfaud brands; and industrial cleanup and containment services primarily to customers in the construction industry under the Eco-Pan brand. It also leases and rents concrete pumping equipment, pans, and containers. Concrete Pumping Holdings, Inc. was founded in 1983 and is headquartered in Thornton, Colorado.",
    "website": "http://www.concretepumpingholdings.com",
    "zipcode": "80229"
  },
  "BFTI": {
    "city": "Hollywood",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Engineering & Construction",
    "long_name": "Befut Global, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "BEFUT GLOBAL INC",
    "state": "FL",
    "summary": "Befut Global, Inc. operates as an industrial infrastructure company. It specializes in the general contracting of residential, commercial, health care, and government facilities; building restorations; and luxury condo and home renovations comprising interior and exterior facilities. The company operates in the United States, South America, Asia, West Africa, and the Caribbean. The company was formerly known as Befut International Co, Ltd and changed its name to Befut Global, Inc. in October 2017. The company is headquartered in Hollywood, Florida. Befut Global, Inc. is a subsidiary of BEFUT Corp.",
    "website": "http://www.befutglobal.net",
    "zipcode": "33020"
  },
  "BLD": {
    "city": "Daytona Beach",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Engineering & Construction",
    "long_name": "TopBuild Corp.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "TopBuild Corp.",
    "state": "FL",
    "summary": "TopBuild Corp. installs and distributes insulation and other building products to the United States construction industry. The company operates in two segments, Installation and Distribution. It offers insulation products, rain gutters, glass and windows, afterpaint products, fireproofing and firestopping products, garage doors, fireplaces, closet shelving, roofing materials, accessories, and other products; and insulation installation services. The company also provides various services and tools to assist builders in applying the principles of building science to new home construction, which include pre-construction plan reviews, various inspection services, and diagnostic testing; and home energy rating services. It serves single-family homebuilders, single-family custom builders, multi-family builders, commercial general contractors, remodelers, and individual homeowners, as well as insulation contractors, gutter contractors, weatherization contractors, other contractors, dealers, metal building erectors, and modular home builders. The company operates approximately 200 installation branches and 75 distribution centers in the United States. The company was formerly known as Masco SpinCo Corp. and changed its name to TopBuild Corp. in March 2015. TopBuild Corp. was incorporated in 2015 and is headquartered in Daytona Beach, Florida.",
    "website": "http://www.topbuild.com",
    "zipcode": "32114"
  },
  "BLD.MX": {
    "city": "Daytona Beach",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Engineering & Construction",
    "long_name": "TopBuild Corp.",
    "market": "mx_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "TOPBUILD CORP",
    "state": "FL",
    "summary": "TopBuild Corp. installs and distributes insulation and other building products to the United States construction industry. The company operates in two segments, Installation and Distribution. It offers insulation products, rain gutters, glass and windows, afterpaint products, fireproofing and firestopping products, garage doors, fireplaces, closet shelving, roofing materials, accessories, and other products; and insulation installation services. The company also provides various services and tools to assist builders in applying the principles of building science to new home construction, which include pre-construction plan reviews, various inspection services, and diagnostic testing; and home energy rating services. It serves single-family homebuilders, single-family custom builders, multi-family builders, commercial general contractors, remodelers, and individual homeowners, as well as insulation contractors, gutter contractors, weatherization contractors, other contractors, dealers, metal building erectors, and modular home builders. The company operates approximately 200 installation branches and 75 distribution centers in the United States. The company was formerly known as Masco SpinCo Corp. and changed its name to TopBuild Corp. in March 2015. TopBuild Corp. was incorporated in 2015 and is headquartered in Daytona Beach, Florida.",
    "website": "http://www.topbuild.com",
    "zipcode": "32114"
  },
  "CNRD": {
    "city": "Morgan City",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Engineering & Construction",
    "long_name": "Conrad Industries, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "CONRAD INDUSTRIES INC",
    "state": "LA",
    "summary": "Conrad Industries, Inc. engages in the construction, conversion, and repair of various steel and aluminum marine vessels in the United States. The company builds harbor tugs; specialty barges, such as crane, deck, ABS class, dry bulk cargo, aggregate, and well stim barges; inland tank, LPG inland tank, LPG pressure, LPG tank, and DS tank barges; and offshore support vessels, including liftboats, crew boats, offshore supply vessels, and offshore tugs, as well as other support equipment, such as deck and crane barges. It also builds inland pushboats comprising inland towboats, inland river push boats, and towboats; and ferries, which consist of passenger, and passenger and vehicle ferries. In addition, the company offers repairs and conversions, including electrical, mechanical, propulsion, and hull repairs to large-scale conversions of ships and barges; and engages in the fabrication of modular components for offshore floating production, storage, and offloading vessels, as well as drilling rigs. The company was founded in 1948 and is headquartered in Morgan City, Louisiana.",
    "website": "http://www.conradindustries.com",
    "zipcode": "70380"
  },
  "CQY.F": {
    "city": "Dothan",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "Construction Partners, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "CONSTRUCTION PART DL-,001",
    "state": "AL",
    "summary": "Construction Partners, Inc., a civil infrastructure company, engages in the construction and maintenance of roadways across Alabama, Florida, Georgia, North Carolina, and South Carolina. The company, through its subsidiaries, provides various products and services to public and private infrastructure projects, with a focus on highways, roads, bridges, airports, and commercial and residential developments. It also engages in manufacturing and distributing hot mix asphalt (HMA) for internal use and sales to third parties in connection with construction projects; paving activities, including the construction of roadway base layers and application of asphalt pavement; site development, including the installation of utility and drainage systems; mining aggregates, such as sand and gravel that are used as raw materials in the production of HMA; and distributing liquid asphalt cement for internal use and sales to third parties in connection with HMA production. The company was formerly known as SunTx CPI Growth Company, Inc. and changed its name to Construction Partners, Inc. in September 2017. Construction Partners, Inc. was founded in 2001 and is headquartered in Dothan, Alabama.",
    "website": "http://www.constructionpartners.net",
    "zipcode": "36303"
  },
  "DBMG": {
    "city": "Phoenix",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Engineering & Construction",
    "long_name": "DBM Global Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "DBM GLOBAL INC",
    "state": "AZ",
    "summary": "DBM Global Inc., together with its subsidiaries, operates as a steel fabrication and erection contractor primarily in the United States. The company offers integrated steel construction services; and professional services, including design-build, design-assist, engineering, building information modeling participation, 3D steel modeling/detailing, fabrication, advanced field erection, project management, and single-source steel management systems. It also manufactures joists and joist girders. The company provides its services for projects in a range of markets that comprise industrial, public works, bridges, healthcare, gaming and hospitality, convention centers, stadiums, mixed-use and retail, and transportation. It has operations in Arizona, Florida, Georgia, Texas, Kansas, and California. The company was formerly known as Schuff International, Inc. and changed its name to DBM Global Inc. in September 2016. DBM Global Inc. was founded in 1976 and is headquartered in Phoenix, Arizona.",
    "website": "http://www.dbmglobal.com",
    "zipcode": "85016"
  },
  "DY": {
    "city": "Palm Beach Gardens",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Engineering & Construction",
    "long_name": "Dycom Industries, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "Dycom Industries, Inc.",
    "state": "FL",
    "summary": "Dycom Industries, Inc. provides specialty contracting services in the United States. The company offers various specialty contracting services, including program management, engineering, construction, maintenance, and installation services, such as placement and splicing of fiber, copper, and coaxial cables to telecommunications providers. It also provides tower construction, lines and antenna installation, foundation and equipment pad construction, and small cell site placement for wireless carriers, as well as equipment installation and material fabrication, and site testing services; and installs and maintains customer premise equipment, such as digital video recorders, set top boxes, and modems for cable system operators. In addition, the company offers construction and maintenance services for electric and gas utilities, and other customers; and underground facility locating services, such as locating telephone, cable television, power, water, sewer, and gas lines for various utility companies, including telecommunication providers. Dycom Industries, Inc. was incorporated in 1969 and is headquartered in Palm Beach Gardens, Florida.",
    "website": "http://www.dycomind.com",
    "zipcode": "33408"
  },
  "DYI.F": {
    "city": "Palm Beach Gardens",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "Dycom Industries, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "DYCOM INDS INC.  DL-,333",
    "state": "FL",
    "summary": "Dycom Industries, Inc. provides specialty contracting services in the United States. The company offers various specialty contracting services, including program management, engineering, construction, maintenance, and installation services, such as placement and splicing of fiber, copper, and coaxial cables to telecommunications providers. It also provides tower construction, lines and antenna installation, foundation and equipment pad construction, and small cell site placement for wireless carriers, as well as equipment installation and material fabrication, and site testing services; and installs and maintains customer premise equipment, such as digital video recorders, set top boxes, and modems for cable system operators. In addition, the company offers construction and maintenance services for electric and gas utilities, and other customers; and underground facility locating services, such as locating telephone, cable television, power, water, sewer, and gas lines for various utility companies, including telecommunication providers. Dycom Industries, Inc. was incorporated in 1969 and is headquartered in Palm Beach Gardens, Florida.",
    "website": "http://www.dycomind.com",
    "zipcode": "33408"
  },
  "E6Z.F": {
    "city": "Los Angeles",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "AECOM",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "AECOM  DL -,01",
    "state": "CA",
    "summary": "AECOM, together with its subsidiaries, delivers professional services to program and construction management in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It operates through three segments: Americas, International, and AECOM Capital. The company engages in planning, consulting, architectural, engineering, and construction management services for commercials and governments clients. It also invests in and develops real estate projects. In addition, the company provides building construction and energy, as well as infrastructure and industrial construction services. It serves transportation, water, government, facilities, environmental, and energy sectors. The company was formerly known as AECOM Technology Corporation and changed its name to AECOM in January 2015. AECOM was founded in 1980 and is headquartered in Los Angeles, California.",
    "website": "http://www.aecom.com",
    "zipcode": "90071"
  },
  "EM4.F": {
    "city": "Norwalk",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "EMCOR Group, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "EMCOR GRP INC.  DL-,01",
    "state": "CT",
    "summary": "EMCOR Group, Inc. provides electrical and mechanical construction, and facilities services in the United States. The company offers design, integration, installation, starts-up, operation, and maintenance services related to electrical power transmission and distribution systems; premises electrical and lighting systems; process instrumentation in the refining, chemical processing, food processing, and mining industries; low-voltage systems, such as fire alarm, security, and process control systems; voice and data communications systems; roadway and transit lighting, and fiber optic lines; heating, ventilation, air conditioning, refrigeration, and clean-room process ventilation systems; fire protection systems; plumbing, process, and high-purity piping systems; controls and filtration systems; water and wastewater treatment systems; central plant heating and cooling systems; crane and rigging services; millwright services; and steel fabrication, erection, and welding services. It also provides building services that cover commercial and government site-based operations and maintenance; facility management, maintenance, and services outage services to utilities and industrial plants; military base operations support services; mobile mechanical maintenance and services; services for indoor air quality; floor care and janitorial services; landscaping, lot sweeping, and snow removal; other building services; vendor management; call center services; installation and support for building systems; program development, management, and maintenance for energy systems; technical consulting and diagnostic services; infrastructure and building projects; and small modification and retrofit projects. In addition, the company provides industrial services for oil, gas, and petrochemical industries. EMCOR Group, Inc. was incorporated in 1987 and is headquartered in Norwalk, Connecticut.",
    "website": "http://www.emcorgroup.com",
    "zipcode": "06851-1092"
  },
  "EME": {
    "city": "Norwalk",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Engineering & Construction",
    "long_name": "EMCOR Group, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "EMCOR Group, Inc.",
    "state": "CT",
    "summary": "EMCOR Group, Inc. provides electrical and mechanical construction, and facilities services in the United States. The company offers design, integration, installation, starts-up, operation, and maintenance services related to electrical power transmission and distribution systems; premises electrical and lighting systems; process instrumentation in the refining, chemical processing, food processing, and mining industries; low-voltage systems, such as fire alarm, security, and process control systems; voice and data communications systems; roadway and transit lighting, and fiber optic lines; heating, ventilation, air conditioning, refrigeration, and clean-room process ventilation systems; fire protection systems; plumbing, process, and high-purity piping systems; controls and filtration systems; water and wastewater treatment systems; central plant heating and cooling systems; crane and rigging services; millwright services; and steel fabrication, erection, and welding services. It also provides building services that cover commercial and government site-based operations and maintenance; facility management, maintenance, and services outage services to utilities and industrial plants; military base operations support services; mobile mechanical maintenance and services; services for indoor air quality; floor care and janitorial services; landscaping, lot sweeping, and snow removal; other building services; vendor management; call center services; installation and support for building systems; program development, management, and maintenance for energy systems; technical consulting and diagnostic services; infrastructure and building projects; and small modification and retrofit projects. In addition, the company provides industrial services for oil, gas, and petrochemical industries. EMCOR Group, Inc. was incorporated in 1987 and is headquartered in Norwalk, Connecticut.",
    "website": "http://www.emcorgroup.com",
    "zipcode": "06851-1092"
  },
  "ENG": {
    "city": "Houston",
    "country": "United States",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Engineering & Construction",
    "long_name": "ENGlobal Corporation",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ENGlobal Corporation",
    "state": "TX",
    "summary": "ENGlobal Corporation provides engineering and automation services primarily to the energy sector in the United States and internationally. It operates through two segments, EPCM and Automation. The EPCM segment provides multi-disciplined engineering services relating to the development, management, and execution of projects requiring professional engineering and related project management services. It offers feasibility studies, engineering, design, procurement, construction management, project definition, cost estimating, environmental compliance, project management, and fabrication services. The Automation segment provides design, integration, and implementation of process distributed control and analyzer systems, advanced automated data gathering systems, and information technology, as well as the maintenance of these systems primarily to the energy industry. This segment also designs, assembles, integrates, and services control and instrumentation systems for specific applications in the energy and processing related industries. The company serves Fortune 500 companies in the energy industry and the United States government. ENGlobal Corporation company was founded in 1985 and is headquartered in Houston, Texas.",
    "website": "http://www.englobal.com",
    "zipcode": "77060-5914"
  },
  "ENMI": {
    "city": "Seekonk",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Engineering & Construction",
    "long_name": "Energy Management International, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ENERGY MANAGEMENT INTERNATIONAL",
    "state": "MA",
    "summary": "Energy Management International, Inc., a consultancy firm, specializes in energy control, monitoring, management, and utility rate analysis. It specializes in conducting industrial energy and water management projects, and installing energy management and monitoring systems; providing strategic planning for long term macro control of utilities consumed at industrial facilities; and energy procurement and rate analysis services. The company's services also include energy management and monitoring system analysis, energy management monitoring systems installation, historic energy use modeling utility, billing audits production energy requirement, planning production energy ratio control programs, water and wastewater management programs, total quality energy observations, start-up and shutdown procedures development, start-up and shutdown procedures development, start-up and shutdown procedures development, energy investment cost benefit analysis, HVAC energy analysis, thermographic heat loss analysis, dust collection systems analysis, hydraulic systems analysis, conveyance systems analysis, combustion efficiency analysis, electric motor vibration analysis, steam generation and distribution analysis compressed air systems analysis, refrigeration and chiller systems analysis, and scrap and rework analysis. Energy Management International, Inc. was formerly known as Gust Engineering & Speed Production, Inc. and changed its name to Energy Management International, Inc. in December 2009. The company was founded in 2002 and is headquartered in Seekonk, Massachusetts.",
    "website": "http://www.wesaveenergy.com",
    "zipcode": "02771"
  },
  "ESOA": {
    "city": "Huntington",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Engineering & Construction",
    "long_name": "Energy Services of America Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ENERGY SERVICES OF AMERICA CORP",
    "state": "WV",
    "summary": "Energy Services of America Corporation provides contracting services for utilities and energy related companies in the United States. It constructs, replaces, and repairs interstate and intrastate natural gas pipelines and storage facilities for utility companies and private natural gas companies; and provides services relating to pipeline, storage facilities, and plant works. The company also offers a range of electrical and mechanical installation, and repair services, including substation and switchyard, site preparation, equipment setting, pipe fabrication and installation, packaged buildings, transformers, and other ancillary works for the gas, petroleum power, chemical, water and sewer, and automotive industries. It provides liquid pipeline and pump station construction, production facility construction, water and sewer pipeline installation, and various maintenance and repair services, as well as other services related to pipeline construction. The company serves customers primarily in West Virginia, Virginia, Ohio, Pennsylvania, and Kentucky. Energy Services of America Corporation was founded in 2006 and is based in Huntington, West Virginia.",
    "website": "http://www.energyservicesofamerica.com",
    "zipcode": "25701"
  },
  "FIX": {
    "city": "Houston",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Engineering & Construction",
    "long_name": "Comfort Systems USA, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "Comfort Systems USA, Inc.",
    "state": "TX",
    "summary": "Comfort Systems USA, Inc. provides mechanical and electrical installation, renovation, maintenance, repair, and replacement services for the mechanical and electrical services industry in the United States. It engages in the design, engineering, integration, installation, and start-up of mechanical, electrical, and plumbing (MEP) systems; and maintenance, repair, replacement, renovation, expansion, reconfiguration, and monitoring of existing buildings The company offers its services for heating, ventilation, and air conditioning (HVAC) systems, as well as plumbing, piping and controls, off-site construction, electrical, monitoring, and fire protection. It serves building owners and developers, general contractors, architects, consulting engineers, and property managers in the commercial, industrial, and institutional MEP markets. Comfort Systems USA, Inc. was founded in 1917 and is headquartered in Houston, Texas.",
    "website": "http://www.comfortsystemsusa.com",
    "zipcode": "77057"
  },
  "FLR": {
    "city": "Irving",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Engineering & Construction",
    "long_name": "Fluor Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "Fluor Corporation",
    "state": "TX",
    "summary": "Fluor Corporation provides engineering, procurement, construction, fabrication and modularization, operation, maintenance and asset integrity, and project management services worldwide. It operates through six segments: Energy & Chemicals; Mining & Industrial; Infrastructure & Power; Government; Diversified Services; and Other. The Energy & Chemicals segment offers a range of design, engineering, procurement, construction, fabrication, and project management services in the upstream, midstream, downstream, chemical, petrochemical, offshore and onshore oil and gas production, and liquefied natural gas and pipeline markets. The Mining & Industrial segment provides design, engineering, procurement, construction, and project management services to the mining and metals, life sciences, and advanced manufacturing and technologies sectors. The Infrastructure & Power segment offers design, engineering, procurement, construction, and project management services to the infrastructure sector. The Government segment provides engineering and construction services, logistics, and life-support services, as well as contingency operations support services to the defense sector. It also offers support services to the United States (U.S.) intelligence community, the U.S. Department of Energy and National Nuclear Security Administration, and the U.S. Department of Homeland Security. The Diversified Services segment provides asset maintenance and asset integrity services to the oil and gas, chemicals, life sciences, power, mining and metals, consumer products, and manufacturing industries; and staffing services. The Other segment researches, develops, licenses, and commercializes small modular nuclear reactor technology; and serves as a subcontractor for the construction of nitrocellulose manufacturing facility. The company also offers unionized management and construction services. Fluor Corporation was founded in 1912 and is headquartered in Irving, Texas.",
    "website": "http://www.fluor.com",
    "zipcode": "75039"
  },
  "FLR.MX": {
    "city": "Irving",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Engineering & Construction",
    "long_name": "Fluor Corporation",
    "market": "mx_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "FLUOR CORP",
    "state": "TX",
    "summary": "Fluor Corporation provides engineering, procurement, construction, fabrication and modularization, operation, maintenance and asset integrity, and project management services worldwide. It operates through six segments: Energy & Chemicals; Mining & Industrial; Infrastructure & Power; Government; Diversified Services; and Other. The Energy & Chemicals segment offers a range of design, engineering, procurement, construction, fabrication, and project management services in the upstream, midstream, downstream, chemical, petrochemical, offshore and onshore oil and gas production, and liquefied natural gas and pipeline markets. The Mining & Industrial segment provides design, engineering, procurement, construction, and project management services to the mining and metals, life sciences, and advanced manufacturing and technologies sectors. The Infrastructure & Power segment offers design, engineering, procurement, construction, and project management services to the infrastructure sector. The Government segment provides engineering and construction services, logistics, and life-support services, as well as contingency operations support services to the defense sector. It also offers support services to the United States (U.S.) intelligence community, the U.S. Department of Energy and National Nuclear Security Administration, and the U.S. Department of Homeland Security. The Diversified Services segment provides asset maintenance and asset integrity services to the oil and gas, chemicals, life sciences, power, mining and metals, consumer products, and manufacturing industries; and staffing services. The Other segment researches, develops, licenses, and commercializes small modular nuclear reactor technology; and serves as a subcontractor for the construction of nitrocellulose manufacturing facility. The company also offers unionized management and construction services. Fluor Corporation was founded in 1912 and is headquartered in Irving, Texas.",
    "website": "http://www.fluor.com",
    "zipcode": "75039"
  },
  "FLU.F": {
    "city": "Irving",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "Fluor Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "FLUOR CORP. (NEW)  DL-,01",
    "state": "TX",
    "summary": "Fluor Corporation provides engineering, procurement, construction, fabrication and modularization, operation, maintenance and asset integrity, and project management services worldwide. It operates through six segments: Energy & Chemicals; Mining & Industrial; Infrastructure & Power; Government; Diversified Services; and Other. The Energy & Chemicals segment offers a range of design, engineering, procurement, construction, fabrication, and project management services in the upstream, midstream, downstream, chemical, petrochemical, offshore and onshore oil and gas production, and liquefied natural gas and pipeline markets. The Mining & Industrial segment provides design, engineering, procurement, construction, and project management services to the mining and metals, life sciences, and advanced manufacturing and technologies sectors. The Infrastructure & Power segment offers design, engineering, procurement, construction, and project management services to the infrastructure sector. The Government segment provides engineering and construction services, logistics, and life-support services, as well as contingency operations support services to the defense sector. It also offers support services to the United States (U.S.) intelligence community, the U.S. Department of Energy and National Nuclear Security Administration, and the U.S. Department of Homeland Security. The Diversified Services segment provides asset maintenance and asset integrity services to the oil and gas, chemicals, life sciences, power, mining and metals, consumer products, and manufacturing industries; and staffing services. The Other segment researches, develops, licenses, and commercializes small modular nuclear reactor technology; and serves as a subcontractor for the construction of nitrocellulose manufacturing facility. The company also offers unionized management and construction services. Fluor Corporation was founded in 1912 and is headquartered in Irving, Texas.",
    "website": "http://www.fluor.com",
    "zipcode": "75039"
  },
  "FRCN": {
    "city": "Fort Worth",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Engineering & Construction",
    "long_name": "Firemans Contractors, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "FIREMANS CONTRACTORS INC",
    "state": "TX",
    "summary": "Firemans Contractors, Inc. provides parking lot maintenance services in the United States. Its services include asphalt maintenance and repair, concrete repair, crack/joint sealing, excavation, line removal, painting, pressure washing, seal coating, signage, speed bumps, parking lot and warehouse striping, and wheel stops. The company was founded in 2009 and is headquartered in Fort Worth, Texas.",
    "website": "http://www.firemanscontractors.com",
    "zipcode": "76118"
  },
  "GLDD": {
    "city": "Houston",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Engineering & Construction",
    "long_name": "Great Lakes Dredge & Dock Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Great Lakes Dredge & Dock Corpo",
    "state": "TX",
    "summary": "Great Lakes Dredge & Dock Corporation provides dredging services in the United States. The company engages in capital dredging that consists of port expansion projects, coastal restoration and land reclamations, trench digging for pipelines, tunnels and cables, and other dredging related to the construction of breakwaters, jetties, canals, and other marine structures. It is also involved in coastal protection projects, which involves moving sand from the ocean floor to shoreline locations where erosion threatens shoreline assets; maintenance dredging, which consists of the re-dredging of previously deepened waterways and harbors to remove silt, sand and other accumulated sediments; land reclamations, channel deepening, and port infrastructure development; lake and river dredging, inland levee and construction dredging, environmental restoration and habitat improvement, and other marine construction projects. The company serves federal, state, and local governments; foreign governments; and domestic and foreign private concerns, such as utilities, oil, and other energy companies. It operates a fleet of 20 dredges, 17 material transportation barges, 1 drillboat, and various other support vessels. The company was formerly known as Lydon & Drews Partnership and changed its name to Great Lakes Dredge & Dock Corporation in 1905. Great Lakes Dredge & Dock Corporation was founded in 1890 and is headquartered in Houston, Texas.",
    "website": "http://www.gldd.com",
    "zipcode": "77024"
  },
  "GRG.F": {
    "city": "Watsonville",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "Granite Construction Incorporated",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "GRANITE CONSTR.  DL-,01",
    "state": "CA",
    "summary": "Granite Construction Incorporated operates as an infrastructure contractor and a construction materials producer in the United States. The company operates through Transportation, Water, Specialty, and Materials segments. The Transportation segment engages in the construction and rehabilitation of roads, pavement preservation, bridges, rail lines, airports, and marine ports. The Water segment focuses on water-related construction and water management solutions, as well as provides trenchless cured-in-place pipe and storm water rehabilitation services. The Specialty segment constructs various complex projects, including infrastructure/site development, mining, public safety, tunnel, and power projects; and undertakes bid-build, design-build, and construction management/general contractor contracts. The Materials segment focuses on production of aggregates, asphalt, and construction related materials, as well as sanitary and storm water rehabilitation products, such as cured-in-place pipe felt and fiberglass-based lining tubes. The company also engages in the construction of streets, highways, mass transit facilities, trenchless and underground utilities, well drilling, dams, and other infrastructure-related projects. In addition, it performs site preparation, mining, and infrastructure services for residential development, energy development, commercial and industrial sites, and other facilities; and provides construction management professional services. The company serves federal agencies, state departments of transportation, local transit authorities, county and city public works departments, school districts and developers, utilities, contractors, landscapers, manufacturers of products requiring aggregate materials, retailers, homeowners, farmers, brokers, and private owners of industrial, commercial, and residential sites. Granite Construction Incorporated was founded in 1922 and is headquartered in Watsonville, California.",
    "website": "http://www.graniteconstruction.com",
    "zipcode": "95076"
  },
  "GVA": {
    "city": "Watsonville",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Engineering & Construction",
    "long_name": "Granite Construction Incorporated",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Granite Construction Incorporat",
    "state": "CA",
    "summary": "Granite Construction Incorporated operates as an infrastructure contractor and a construction materials producer in the United States. The company operates through Transportation, Water, Specialty, and Materials segments. The Transportation segment engages in the construction and rehabilitation of roads, pavement preservation, bridges, rail lines, airports, and marine ports. The Water segment focuses on water-related construction and water management solutions, as well as provides trenchless cured-in-place pipe and storm water rehabilitation services. The Specialty segment constructs various complex projects, including infrastructure/site development, mining, public safety, tunnel, and power projects; and undertakes bid-build, design-build, and construction management/general contractor contracts. The Materials segment focuses on production of aggregates, asphalt, and construction related materials, as well as sanitary and storm water rehabilitation products, such as cured-in-place pipe felt and fiberglass-based lining tubes. The company also engages in the construction of streets, highways, mass transit facilities, trenchless and underground utilities, well drilling, dams, and other infrastructure-related projects. In addition, it performs site preparation, mining, and infrastructure services for residential development, energy development, commercial and industrial sites, and other facilities; and provides construction management professional services. The company serves federal agencies, state departments of transportation, local transit authorities, county and city public works departments, school districts and developers, utilities, contractors, landscapers, manufacturers of products requiring aggregate materials, retailers, homeowners, farmers, brokers, and private owners of industrial, commercial, and residential sites. Granite Construction Incorporated was founded in 1922 and is headquartered in Watsonville, California.",
    "website": "http://www.graniteconstruction.com",
    "zipcode": "95076"
  },
  "HIL": {
    "city": "Philadelphia",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Engineering & Construction",
    "long_name": "Hill International, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Hill International, Inc.",
    "state": "PA",
    "summary": "Hill International, Inc. provides project and construction management, and other consulting services primarily for the buildings, transportation, environmental, energy, and industrial markets. The company offers program management, project management, construction management, project management oversight, troubled project turnaround, staff augmentation, project labor agreement consulting, commissioning, estimating and cost management, and labor compliance and facilities management services. It primarily serves the United States federal, state and local governments, other national governments, and the private sector customers. The company operates in the United States, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. Hill International, Inc. was founded in 1976 and is headquartered in Philadelphia, Pennsylvania.",
    "website": "http://www.hillintl.com",
    "zipcode": "19103"
  },
  "IEA": {
    "city": "Indianapolis",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Engineering & Construction",
    "long_name": "Infrastructure and Energy Alternatives, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Infrastructure and Energy Alter",
    "state": "IN",
    "summary": "Infrastructure and Energy Alternatives, Inc., through various subsidiaries, operates as a diversified infrastructure construction company in the United States. The company engages in providing engineering, procurement, and construction (EPC) services for the renewable energy, traditional power, and civil infrastructure industries. It operates in two segments, the Renewables and the Specialty Civil. The Renewables segment specializes in a range of services that include full EPC project delivery, design, site development, construction, installation, and restoration of infrastructure services for the wind and solar industries. The Specialty Civil segment offers a range of services that comprise heavy civil construction services, such as road and bridge construction, specialty paving, and industrial maintenance, as well as other local, state, and government projects; environmental remediation services, including site development, environmental site closure, and outsourced contract mining and coal ash management services; and rail infrastructure services consisting of planning, design, procurement, construction, and maintenance of infrastructure projects for railway and intermodal facilities construction. The company was founded in 1947 is headquartered in Indianapolis, Indiana.",
    "website": "http://www.iea.net",
    "zipcode": "46278"
  },
  "IESC": {
    "city": "Houston",
    "country": "United States",
    "currency": "USD",
    "exchange": "NGM",
    "industry": "Engineering & Construction",
    "long_name": "IES Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "IES Holdings, Inc.",
    "state": "TX",
    "summary": "IES Holdings, Inc. designs and installs integrated electrical and technology systems, and provides infrastructure products and services in the United States. Its Commercial & Industrial segment offers electrical and mechanical design, construction, and maintenance services for office buildings, manufacturing facilities, data centers, chemical plants, refineries, wind farms, solar facilities, municipal infrastructures, and health care facilities. Its Communications segment designs, installs, and maintains network infrastructure within data centers for co-location and managed hosting customers; corporate, educational, financial, hospitality, and healthcare buildings; e-commerce distribution centers; and high-tech manufacturing facilities. This segment also provides design and installation services for audio/visual, telephone, fire, and wireless access and intrusion alarm systems; and engages in designing/building, servicing, and maintaining data network systems. Its Infrastructure Solutions segment maintains and repairs alternating and direct current electric motors and generators, and power generating and distribution equipment; manufactures custom-engineered metal enclosed bus duct solutions used in power distribution; manufactures custom commercial and industrial generator enclosures; manufactures, re-manufactures, and repairs industrial lifting magnets; and maintains and repairs railroad main and auxiliary generators, main alternators, and traction motors. Its Residential segment offers electrical installations to single-family housing and multi-family apartments; and cable television installations to residential and light commercial applications, as well as installs residential solar power for new construction and existing residences. The company was formerly known as Integrated Electrical Services, Inc. and changed its name to IES Holdings, Inc. in May 2016. The company was founded in 1997 and is headquartered in Houston, Texas.",
    "website": "http://www.ies-co.com",
    "zipcode": "77056"
  },
  "IT3A.F": {
    "city": "Saint Louis",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "Aegion Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "AEGION CORP. A  DL-,01",
    "state": "MO",
    "summary": "Aegion Corporation provides technologies to maintain, rehabilitate, and strengthen infrastructure in the United States, Canada, Europe, and internationally. It operates through two segments, Infrastructure Solutions and Corrosion Protection. The company offers various solutions for rehabilitating and maintaining aging or deteriorating infrastructure; protecting new infrastructure from corrosion and other threats; and providing integrated professional services in engineering, procurement, construction, maintenance, and turnaround services for oil and natural gas companies. Its solutions include rehabilitation of water and wastewater pipelines; fusible polyvinyl chloride products for rehabilitation and new installation; fiber reinforced polymer systems for rehabilitation and strengthening; cathodic protection for corrosion engineering control and infrastructure rehabilitation; pipe coatings for corrosion and thermal control and prevention; thermoplastic pipe lining for corrosion control, abrasion protection, and pipeline rehabilitation; and construction and maintenance of oil and gas facilities. The company serves municipal, state, and federal governments, as well as corporate customers in various industries, including pipelines, energy, oil and gas, refinery, mining, general and industrial construction, infrastructure, water and wastewater, transportation, utilities, maritime, and defense. Aegion Corporation was founded in 1971 and is headquartered in Saint Louis, Missouri.",
    "website": "http://www.aegion.com",
    "zipcode": "63005-1195"
  },
  "J": {
    "city": "Dallas",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Engineering & Construction",
    "long_name": "Jacobs Engineering Group Inc.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "Jacobs Engineering Group Inc.",
    "state": "TX",
    "summary": "Jacobs Engineering Group Inc. provides consulting, technical, scientific, and project delivery services for the government and private sectors in the United States, Europe, Canada, India, rest of Asia, Australia, New Zealand, South America, Mexico, the Middle East, and Africa. The company operates in two segments, Critical Mission Solutions and People & Places Solutions. The Critical Mission Solutions segment provides cybersecurity, data analytics, systems and software application integration and consulting, enterprise and mission IT, engineering and design, nuclear, enterprise level operations and maintenance, and other technical consulting solutions. The People & Places Solutions segment offers data analytics, artificial intelligence and automation, software development, digitally driven consulting, planning and architecture, program management, and other technical consulting solutions. The company is also involved in the management and execution of wind-tunnel design-build projects; and design-build for water and construction management. Jacobs Engineering Group Inc. was founded in 1947 and is headquartered in Dallas, Texas.",
    "website": "http://www.jacobs.com",
    "zipcode": "75201"
  },
  "J1EG34.SA": {
    "city": "Dallas",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Engineering & Construction",
    "long_name": "Jacobs Engineering Group Inc.",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "JACOBS ENGINDRN",
    "state": "TX",
    "summary": "Jacobs Engineering Group Inc. provides consulting, technical, scientific, and project delivery services for the government and private sectors in the United States, Europe, Canada, India, rest of Asia, Australia, New Zealand, South America, Mexico, the Middle East, and Africa. The company operates in two segments, Critical Mission Solutions and People & Places Solutions. The Critical Mission Solutions segment provides cybersecurity, data analytics, systems and software application integration and consulting, enterprise and mission IT, engineering and design, nuclear, enterprise level operations and maintenance, and other technical consulting solutions. The People & Places Solutions segment offers data analytics, artificial intelligence and automation, software development, digitally driven consulting, planning and architecture, program management, and other technical consulting solutions. The company is also involved in the management and execution of wind-tunnel design-build projects; and design-build for water and construction management. Jacobs Engineering Group Inc. was founded in 1947 and is headquartered in Dallas, Texas.",
    "website": "http://www.jacobs.com",
    "zipcode": "75201"
  },
  "J2A.F": {
    "city": "Anaheim",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "Willdan Group, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "WILLDAN GROUP INC. DL-,01",
    "state": "CA",
    "summary": "Willdan Group, Inc., together with its subsidiaries, provides professional, technical and consulting services primarily in the United States. It operates in two segments, Energy, and Engineering and Consulting. The Energy segment offers comprehensive audit and surveys, program design, master planning, demand reduction, grid optimization, benchmarking analyses, design engineering, construction management, performance contracting, installation, alternative financing, and measurement and verification services, as well as software and data analytics. The Engineering and Consulting segment provides building and safety, city engineering, code enforcement, development plan review and inspection, disaster recovery, geotechnical and earthquake engineering, planning and surveying, contract staff support, program and construction management, structural engineering, transportation and traffic engineering, and water resources services. This segment also offers district administration, financial consulting, and federal compliance services; emergency preparedness, planning, training, and exercise services; and communications and technology services. The company serves public and governmental agencies, including cities, counties, redevelopment agencies, water districts, school districts, and universities; investor and municipal owned energy utilities; state and federal agencies; commercial and industrial firms; and tribal governments, as well as various other special districts and agencies. Willdan Group, Inc. was founded in 1964 and is headquartered in Anaheim, California.",
    "website": "http://www.willdan.com",
    "zipcode": "92806"
  },
  "JEG.F": {
    "city": "Dallas",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "Jacobs Engineering Group Inc.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "JACOBS ENGINEERING  DL 1",
    "state": "TX",
    "summary": "Jacobs Engineering Group Inc. provides consulting, technical, scientific, and project delivery services for the government and private sectors in the United States, Europe, Canada, India, rest of Asia, Australia, New Zealand, South America, Mexico, the Middle East, and Africa. The company operates in two segments, Critical Mission Solutions and People & Places Solutions. The Critical Mission Solutions segment provides cybersecurity, data analytics, systems and software application integration and consulting, enterprise and mission IT, engineering and design, nuclear, enterprise level operations and maintenance, and other technical consulting solutions. The People & Places Solutions segment offers data analytics, artificial intelligence and automation, software development, digitally driven consulting, planning and architecture, program management, and other technical consulting solutions. The company is also involved in the management and execution of wind-tunnel design-build projects; and design-build for water and construction management. Jacobs Engineering Group Inc. was founded in 1947 and is headquartered in Dallas, Texas.",
    "website": "http://www.jacobs.com",
    "zipcode": "75201"
  },
  "K6B.F": {
    "city": "Houston",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "KBR, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "KBR INC.  DL -,001",
    "state": "TX",
    "summary": "KBR, Inc. provides scientific, technology, and engineering solutions to governments and commercial customers worldwide. The company operates through three segments: Government Solutions, Technology Solutions, and Energy Solutions. The Government Solutions segment offers life-cycle support solutions to defense, intelligence, space, aviation, and other programs and missions for military and other government agencies in the United States, the United Kingdom, and Australia. Its services cover research and development, systems engineering, test and evaluation, systems integration and program management, operations support, readiness, and logistics. This segment also offers software and engineering solutions to critical national security missions across space, cyber, intelligence, surveillance, reconnaissance, missile defense, and intelligence domains to the United States government and related defense agencies. The Technology Solutions segment provides proprietary technologies, equipment and catalyst supply, digital solutions, and associated knowledge-based services into a global business for refining, petrochemicals, inorganic, and specialty chemicals, as well as gasification, syngas, ammonia, nitric acid, and fertilizers. The Energy Solutions segment provides life-cycle support solutions across the upstream, midstream, and downstream markets, including advisory services focused on energy transition and net zero carbon objective; technology led industrial solutions focused on advanced remote operations capabilities to improve throughput, reliability, and environmental sustainability; digitally-enabled professional services, such as complex program management, engineering and design, and advanced project integration; and other construction services. KBR, Inc. is headquartered in Houston, Texas.",
    "website": "http://www.kbr.com",
    "zipcode": "77002"
  },
  "KBR": {
    "city": "Houston",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Engineering & Construction",
    "long_name": "KBR, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "KBR, Inc.",
    "state": "TX",
    "summary": "KBR, Inc. provides scientific, technology, and engineering solutions to governments and commercial customers worldwide. The company operates through three segments: Government Solutions, Technology Solutions, and Energy Solutions. The Government Solutions segment offers life-cycle support solutions to defense, intelligence, space, aviation, and other programs and missions for military and other government agencies in the United States, the United Kingdom, and Australia. Its services cover research and development, systems engineering, test and evaluation, systems integration and program management, operations support, readiness, and logistics. This segment also offers software and engineering solutions to critical national security missions across space, cyber, intelligence, surveillance, reconnaissance, missile defense, and intelligence domains to the United States government and related defense agencies. The Technology Solutions segment provides proprietary technologies, equipment and catalyst supply, digital solutions, and associated knowledge-based services into a global business for refining, petrochemicals, inorganic, and specialty chemicals, as well as gasification, syngas, ammonia, nitric acid, and fertilizers. The Energy Solutions segment provides life-cycle support solutions across the upstream, midstream, and downstream markets, including advisory services focused on energy transition and net zero carbon objective; technology led industrial solutions focused on advanced remote operations capabilities to improve throughput, reliability, and environmental sustainability; digitally-enabled professional services, such as complex program management, engineering and design, and advanced project integration; and other construction services. KBR, Inc. is headquartered in Houston, Texas.",
    "website": "http://www.kbr.com",
    "zipcode": "77002"
  },
  "KBR.MX": {
    "city": "Houston",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Engineering & Construction",
    "long_name": "KBR, Inc.",
    "market": "mx_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "KBR INC",
    "state": "TX",
    "summary": "KBR, Inc. provides scientific, technology, and engineering solutions to governments and commercial customers worldwide. The company operates through three segments: Government Solutions, Technology Solutions, and Energy Solutions. The Government Solutions segment offers life-cycle support solutions to defense, intelligence, space, aviation, and other programs and missions for military and other government agencies in the United States, the United Kingdom, and Australia. Its services cover research and development, systems engineering, test and evaluation, systems integration and program management, operations support, readiness, and logistics. This segment also offers software and engineering solutions to critical national security missions across space, cyber, intelligence, surveillance, reconnaissance, missile defense, and intelligence domains to the United States government and related defense agencies. The Technology Solutions segment provides proprietary technologies, equipment and catalyst supply, digital solutions, and associated knowledge-based services into a global business for refining, petrochemicals, inorganic, and specialty chemicals, as well as gasification, syngas, ammonia, nitric acid, and fertilizers. The Energy Solutions segment provides life-cycle support solutions across the upstream, midstream, and downstream markets, including advisory services focused on energy transition and net zero carbon objective; technology led industrial solutions focused on advanced remote operations capabilities to improve throughput, reliability, and environmental sustainability; digitally-enabled professional services, such as complex program management, engineering and design, and advanced project integration; and other construction services. KBR, Inc. is headquartered in Houston, Texas.",
    "website": "http://www.kbr.com",
    "zipcode": "77002"
  },
  "LMB": {
    "city": "Pittsburgh",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Engineering & Construction",
    "long_name": "Limbach Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Limbach Holdings, Inc.",
    "state": "PA",
    "summary": "Limbach Holdings, Inc. operates as an integrated building systems solutions company in the United States. It operates in two segments, Construction and Service. The company engages in the design, prefabrication, installation, management, and maintenance of mechanical, electrical, plumbing, and control systems, as well as heating, ventilation, air-conditioning (HVAC) system; and maintenance, and equipment upgradation, emergency service work, automatic temperature control, specialty contracting, and energy monitoring services. Its facility services comprise mechanical construction, HVAC service and maintenance, energy audits and retrofits, engineering and design build, constructability evaluation, equipment and materials selection, offsite/prefabrication construction, and sustainable building solutions and practices. The company serves research, acute care, and inpatient hospitals; public and private colleges, universities, research centers and K-12 facilities; sports arenas; entertainment facilities, and amusement rides; passenger terminals and maintenance facilities for rail and airports; government facilities comprising federal, state, and local agencies; hotels and resorts; office building and other commercial structures; multi-family apartments; data centers; and industrial manufacturing facilities. It operates in Florida, California, Massachusetts, New Jersey, Pennsylvania, Delaware, Maryland, Washington DC, Virginia, West Virginia, Ohio, and Michigan. The company was founded in 1901 and is headquartered in Pittsburgh, Pennsylvania.",
    "website": "http://www.limbachinc.com",
    "zipcode": "15222"
  },
  "MCDIF": {
    "city": "Houston",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Engineering & Construction",
    "long_name": "Mcdermott International Ltd.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "MCDERMOTT INTERNATIONAL LTD",
    "state": "TX",
    "summary": "McDermott International Ltd. provides engineering and construction solutions to the energy industry worldwide. It offers integrated engineering, procurement, construction, and installation services for offshore field developments. The company is also involved in the concept development, design, fabrication, construction, commissioning, start-up, and operation of liquefied natural gas facilities; and designing and building of downstream oil and gas processing facilities, storage facilities, tanks, and terminals. In addition, it provides design, engineering, procurement, fabrication, construction, and commissioning services for natural gas, solid-fuel, and renewable generating facilities. The company was incorporated in 2020 and is based in Houston, Texas.",
    "website": "http://www.mcdermott.com",
    "zipcode": "77079"
  },
  "MRCR": {
    "city": "Wayne",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Engineering & Construction",
    "long_name": "Moro Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "MORO CORP",
    "state": "PA",
    "summary": "Moro Corporation, together with its subsidiaries, engages in the construction contracting business in the United States. The company is involved in the sale, installation, and service of heating, ventilation, and air conditioning systems and related piping and sheet metal works; fabrication and installation, and distribution of reinforcing, structural, and miscellaneous steel; and distribution of construction accessories. It also offers electrical contracting services for public and private sector. The company was formerly known as Food court Entertainment Network, Inc. and changed its name to Moro Corporation in June 1999. Moro Corporation was founded in 1992 and is based in Wayne, Pennsylvania.",
    "website": "http://www.morocorp.com",
    "zipcode": "19087"
  },
  "MTRX": {
    "city": "Tulsa",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Engineering & Construction",
    "long_name": "Matrix Service Company",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Matrix Service Company",
    "state": "OK",
    "summary": "Matrix Service Company provides engineering, fabrication, infrastructure, construction, and maintenance services primarily to the oil, gas, power, petrochemical, industrial, agricultural, mining, and minerals markets in the United States, Canada, South Korea, Australia, and internationally. The company's Electrical Infrastructure segment offers power delivery services, including construction of new substations, upgrades of existing substations, short-run transmission line installations, distribution upgrades, and maintenance; and emergency and storm restoration services. It also provides construction and maintenance services to combined cycle plants and other natural gas fired power stations. The company's Oil Gas & Chemical segment offers plant maintenance, turnarounds, engineering, and capital construction services; and hydro-blasting and excavating, advanced chemical cleaning, and vacuum services, as well as performs work in the petrochemical, sulfur extraction, and recovery and processing markets. Its Storage Solutions segment undertakes work related to aboveground storage tanks and terminals; and liquefied natural gas, liquid nitrogen/liquid oxygen, liquid petroleum, and other specialty vessels, which comprise spheres, as well as marine structures, and truck and rail loading/offloading facilities. Its services include engineering, fabrication and construction, and maintenance and repair, including planned and emergency services, as well as geodesic domes, aluminum internal floating roofs, floating suction and skimmer systems, roof drain systems, and floating roof seals. The company's Industrial segment offers engineering, fabrication and construction, and maintenance and repair, which include planned and emergency services; designs instrumentation and control systems; and offer specialized expertise in the design and construction of bulk material handling systems. The company was founded in 1984 and is headquartered in Tulsa, Oklahoma.",
    "website": "http://www.matrixservicecompany.com",
    "zipcode": "74135"
  },
  "MTZ": {
    "city": "Coral Gables",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Engineering & Construction",
    "long_name": "MasTec, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "MasTec, Inc.",
    "state": "FL",
    "summary": "MasTec, Inc., an infrastructure construction company, provides engineering, building, installation, maintenance, and upgrade services for communications, energy, utility, and other infrastructure primarily in the United States and Canada. It operates through five segments: Communications, Clean Energy and Infrastructure, Oil and Gas, Electrical Transmission, and Other. The company builds underground and overhead distribution systems, including trenches, conduits, cell towers, cable, and power lines, which provide wireless and wireline/fiber communications; clean energy infrastructure comprising renewable energy; natural gas, crude oil, and refined product transport pipelines; electrical power generation, transmission, and distribution systems; heavy industrial plants; compressor and pump stations, and treatment plants; water and sewer infrastructure, including water pipelines; and other civil construction infrastructure. It also installs electrical and other energy distribution and transmission systems, power generation facilities, buried and aerial fiber optic and other cables, and satellite dishes, as well as home automation and energy management solutions. In addition, the company offers maintenance and upgrade support services comprising maintenance of customers' distribution facilities, networks, and infrastructure, including communications, power generation, pipeline, electrical distribution and transmission, and heavy civil infrastructure; emergency services for accidents or storm damage; and routine replacements and upgrades to overhauls. Its customers include public and private energy providers, pipeline operators, wireless and wireline/fiber service providers, broadband operators, install-to-the-home service providers, and government entities. MasTec, Inc. was founded in 1929 and is headquartered in Coral Gables, Florida.",
    "website": "http://www.mastec.com",
    "zipcode": "33134"
  },
  "MX2.F": {
    "city": "Tulsa",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "Matrix Service Company",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "MATRIX SERV. CO.  DL-,01",
    "state": "OK",
    "summary": "Matrix Service Company provides engineering, fabrication, infrastructure, construction, and maintenance services primarily to the oil, gas, power, petrochemical, industrial, agricultural, mining, and minerals markets in the United States, Canada, South Korea, Australia, and internationally. The company's Electrical Infrastructure segment offers power delivery services, including construction of new substations, upgrades of existing substations, short-run transmission line installations, distribution upgrades, and maintenance; and emergency and storm restoration services. It also provides construction and maintenance services to combined cycle plants and other natural gas fired power stations. The company's Oil Gas & Chemical segment offers plant maintenance, turnarounds, engineering, and capital construction services; and hydro-blasting and excavating, advanced chemical cleaning, and vacuum services, as well as performs work in the petrochemical, sulfur extraction, and recovery and processing markets. Its Storage Solutions segment undertakes work related to aboveground storage tanks and terminals; and liquefied natural gas, liquid nitrogen/liquid oxygen, liquid petroleum, and other specialty vessels, which comprise spheres, as well as marine structures, and truck and rail loading/offloading facilities. Its services include engineering, fabrication and construction, and maintenance and repair, including planned and emergency services, as well as geodesic domes, aluminum internal floating roofs, floating suction and skimmer systems, roof drain systems, and floating roof seals. The company's Industrial segment offers engineering, fabrication and construction, and maintenance and repair, which include planned and emergency services; designs instrumentation and control systems; and offer specialized expertise in the design and construction of bulk material handling systems. The company was founded in 1984 and is headquartered in Tulsa, Oklahoma.",
    "website": "http://www.matrixservicecompany.com",
    "zipcode": "74135"
  },
  "MY8.F": {
    "city": "Coral Gables",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "MasTec, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "MASTEC INC.  DL-,10",
    "state": "FL",
    "summary": "MasTec, Inc., an infrastructure construction company, provides engineering, building, installation, maintenance, and upgrade services for communications, energy, utility, and other infrastructure primarily in the United States and Canada. It operates through five segments: Communications, Clean Energy and Infrastructure, Oil and Gas, Electrical Transmission, and Other. The company builds underground and overhead distribution systems, including trenches, conduits, cell towers, cable, and power lines, which provide wireless and wireline/fiber communications; clean energy infrastructure comprising renewable energy; natural gas, crude oil, and refined product transport pipelines; electrical power generation, transmission, and distribution systems; heavy industrial plants; compressor and pump stations, and treatment plants; water and sewer infrastructure, including water pipelines; and other civil construction infrastructure. It also installs electrical and other energy distribution and transmission systems, power generation facilities, buried and aerial fiber optic and other cables, and satellite dishes, as well as home automation and energy management solutions. In addition, the company offers maintenance and upgrade support services comprising maintenance of customers' distribution facilities, networks, and infrastructure, including communications, power generation, pipeline, electrical distribution and transmission, and heavy civil infrastructure; emergency services for accidents or storm damage; and routine replacements and upgrades to overhauls. Its customers include public and private energy providers, pipeline operators, wireless and wireline/fiber service providers, broadband operators, install-to-the-home service providers, and government entities. MasTec, Inc. was founded in 1929 and is headquartered in Coral Gables, Florida.",
    "website": "http://www.mastec.com",
    "zipcode": "33134"
  },
  "MYP.F": {
    "city": "Henderson",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "MYR Group Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "MYR GROUP INC. (DEL.)",
    "state": "CO",
    "summary": "MYR Group Inc., through its subsidiaries, provides electrical construction services in the United States and Canada. It operates through two segments, Transmission and Distribution, and Commercial and Industrial. The company's Transmission and Distribution segment offers a range of services on electric transmission and distribution networks, and substation facilities, including design, engineering, procurement, construction, upgrade, maintenance, and repair services with primary focus on construction, maintenance, and repair to customers in the electric utility industry. Its services include construction and maintenance of high voltage transmission lines, substations, and lower voltage underground and overhead distribution systems, and renewable power facilities; and limited gas construction services, as well as emergency restoration services in response to hurricane, ice, or other storm related damages. This segment serves as a prime contractor to customers, such as investor-owned utilities, cooperatives, private developers, government-funded utilities, independent power producers, independent transmission companies, industrial facility owners, and other contractors. Its Commercial and Industrial segment provides services, such as design, installation, maintenance, and repair of commercial and industrial wiring; and installation of traffic networks, bridge, roadway, and tunnel lighting. This segment offers its services for airports, hospitals, data centers, hotels, stadiums, convention centers, renewable energy projects, manufacturing plants, processing facilities, waste-water treatment facilities, mining facilities, and transportation control and management systems. It serves general contractors, commercial and industrial facility owners, governmental agencies, and developers. MYR Group Inc. was founded in 1891 and is headquartered in Henderson, Colorado.",
    "website": "http://www.myrgroup.com",
    "zipcode": "80640"
  },
  "MYRG": {
    "city": "Henderson",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Engineering & Construction",
    "long_name": "MYR Group Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "MYR Group, Inc.",
    "state": "CO",
    "summary": "MYR Group Inc., through its subsidiaries, provides electrical construction services in the United States and Canada. It operates through two segments, Transmission and Distribution, and Commercial and Industrial. The company's Transmission and Distribution segment offers a range of services on electric transmission and distribution networks, and substation facilities, including design, engineering, procurement, construction, upgrade, maintenance, and repair services with primary focus on construction, maintenance, and repair to customers in the electric utility industry. Its services include construction and maintenance of high voltage transmission lines, substations, and lower voltage underground and overhead distribution systems, and renewable power facilities; and limited gas construction services, as well as emergency restoration services in response to hurricane, ice, or other storm related damages. This segment serves as a prime contractor to customers, such as investor-owned utilities, cooperatives, private developers, government-funded utilities, independent power producers, independent transmission companies, industrial facility owners, and other contractors. Its Commercial and Industrial segment provides services, such as design, installation, maintenance, and repair of commercial and industrial wiring; and installation of traffic networks, bridge, roadway, and tunnel lighting. This segment offers its services for airports, hospitals, data centers, hotels, stadiums, convention centers, renewable energy projects, manufacturing plants, processing facilities, waste-water treatment facilities, mining facilities, and transportation control and management systems. It serves general contractors, commercial and industrial facility owners, governmental agencies, and developers. MYR Group Inc. was founded in 1891 and is headquartered in Henderson, Colorado.",
    "website": "http://www.myrgroup.com",
    "zipcode": "80640"
  },
  "NVEE": {
    "city": "Hollywood",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Engineering & Construction",
    "long_name": "NV5 Global, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "NV5 Global, Inc.",
    "state": "FL",
    "summary": "NV5 Global, Inc. provides professional and technical engineering and consulting services to public and private sector clients in the infrastructure, utility services, construction, real estate, and environmental markets in the United States and internationally. It operates through three segments: Infrastructure; Building, Technology & Sciences; and Geospatial Solutions. The company offers site selection and planning, design, water resources, transportation, structural engineering, land development, surveying, power delivery, building code compliance, and other services; and construction materials testing and engineering, geotechnical engineering and consulting, and forensic consulting services. It also provides governmental outsourcing and consulting, and technical outsourcing services; and geospatial data analytic and mapping services. In addition, the company offers mechanical, electrical, and plumbing design; commissioning; energy performance, management, and optimization; building program management; acoustical design consulting; and audiovisualsecurity and surveillanceinformation technologydata center services, as well as energy services. Further, it provides various services, such as investigating and analyzing environmental conditions, and recommending corrective measures and procedures; occupational health and safety services; radiation exposure and protection, and nuclear safety and industrial hygiene analyses services; hydrogeological modeling and environmental programs; water resource planning, monitoring, and environmental management of wastewater facilities; solid waste landfill investigations; permitting and compliance; storm water pollution; environmental impact statement support; agricultural waste management and permitting; and wetland evaluations. The company was formerly known as NV5 Holdings, Inc. and changed its name to NV5 Global, Inc. in December 2015. NV5 Global, Inc. was founded in 1949 and is headquartered in Hollywood, Florida.",
    "website": "http://www.nv5.com",
    "zipcode": "33021"
  },
  "ORN": {
    "city": "Houston",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Engineering & Construction",
    "long_name": "Orion Group Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Orion Group Holdings, Inc.",
    "state": "TX",
    "summary": "Orion Group Holdings, Inc. operates as a specialty construction company in the building, industrial, and infrastructure sectors in the continental United States, Alaska, Canada, and the Caribbean Basin. It operates in two segments, Marine and Concrete. The company provides various marine construction services, including construction, restoration, dredging, maintenance, and repair of marine transportation facilities and pipelines, bridges and causeways, and marine environmental structures. Its marine transportation facility projects comprise public port facilities, cruise ship port facilities, private terminals, special-use navy terminals, recreational use marinas and docks, and other marine-based facilities. The company also offers on-going maintenance and repair, inspection, emergency repair, and demolition and salvage services to marine transportation facilities. Its marine pipeline service projects include the installation and removal of underwater buried pipeline transmission lines; the installation of pipeline intakes and outfalls for industrial facilities; the construction of pipeline outfalls for wastewater and industrial discharges; river crossing and directional drilling; the creation of hot taps and tie-ins; and inspection, maintenance, and repair services. The company's bridge and causeway projects include the construction, repair, and maintenance of overwater bridges and causeways, as well as the development of fendering systems in marine environments; and marine environmental structures used for erosion control, wetlands creation, and environmental remediation. The company also provides specialty services, such as design, salvage, demolition, surveying, towing, diving and underwater inspection, excavation, and repair services. In addition, it offers light commercial, structural, and other concrete construction services. Orion Group Holdings, Inc. was founded in 1994 and is headquartered in Houston, Texas.",
    "website": "http://www.oriongroupholdingsinc.com",
    "zipcode": "77034"
  },
  "PE2.F": {
    "city": "Sylmar",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "Tutor Perini Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "TUTOR PERINI CORP.  DL 1",
    "state": "CA",
    "summary": "Tutor Perini Corporation, a construction company, provides diversified general contracting, construction management, and design-build services to private customers and public agencies worldwide. The company operates through three segments: Civil, Building, and Specialty Contractors. The Civil segment engages in the public works construction and the replacement and reconstruction of infrastructure, including highways, bridges, tunnels, mass-transit systems, military defense facilities, and water management and wastewater treatment facilities. This segment also provides drilling, foundation, and excavation support for shoring, bridges, piers, roads, and highway projects. The Building segment offers services in various specialized building markets, including hospitality and gaming, transportation, health care, commercial offices, government facilities, sports and entertainment, education, correctional facilities, biotech, pharmaceutical, and industrial and high-tech. The Specialty Contractors segment provides electrical, mechanical, plumbing, fire protection systems, and pneumatically placed concrete services, as well as heating, ventilation, and air conditioning services (HVAC) for the industrial, commercial, hospitality and gaming, and mass-transit end markets. It also offers general contracting, pre-construction planning, and project management services, including planning and scheduling of manpower, equipment, materials, and subcontractors; and self-performed construction services comprising site work, concrete forming and placement, steel erection, electrical, plumbing, HVAC, and mechanical. The company was formerly known as Perini Corporation and changed its name to Tutor Perini Corporation in 2009. Tutor Perini Corporation was founded in 1894 and is headquartered in Sylmar, California.",
    "website": "http://www.tutorperini.com",
    "zipcode": "91342"
  },
  "PRIM": {
    "city": "Dallas",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Engineering & Construction",
    "long_name": "Primoris Services Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Primoris Services Corporation",
    "state": "TX",
    "summary": "Primoris Services Corporation, a specialty contractor company, provides a range of construction, fabrication, maintenance, replacement, and engineering services in the United States and Canada. It operates in five segments: Power, Industrial, and Engineering; Pipeline and Underground; Utilities and Distribution; Transmission and Distribution; and Civil. The Power, Industrial, and Engineering segment offers engineering, procurement, construction, retrofit, upgrade, repair, outage, and maintenance services for entities in the petroleum and petrochemical industries, as well as traditional and renewable power generators. The Pipeline and Underground segment provides a range of services comprising pipeline construction, maintenance, facility, and integrity services; installation of compressor and pump stations; and metering facilities for entities in the petroleum and petrochemical industries, as well as gas, water, and sewer utilities. The Utilities and Distribution segment offers installation and maintenance services for natural gas utility distribution systems; and pipeline integrity services for entities in the gas utility market. The Transmission and Distribution segment provides installation and maintenance services for electric utility transmission, substation, and distribution systems for entities in the electric utility market. The Civil segment undertakes highway and bridge construction, airport runway construction, demolition, site work, soil stabilization, mass excavation, flood control, and drainage projects for entities in the petroleum and petrochemical industries, state and municipal departments of transportation, and airports. The company was founded in 1960 and is headquartered in Dallas, Texas.",
    "website": "http://www.primoriscorp.com",
    "zipcode": "75201"
  },
  "PWR": {
    "city": "Houston",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Engineering & Construction",
    "long_name": "Quanta Services, Inc.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "Quanta Services, Inc.",
    "state": "TX",
    "summary": "Quanta Services, Inc. provides specialty contracting services worldwide. The Electric Power Infrastructure Solutions segment engages in the design, construction, upgrade, repair, and maintenance of electric power transmission and distribution infrastructure and substation facilities; energized installation, maintenance, and upgrade of electric power infrastructure; installation of smart grid technologies on electric power networks; and design, installation, maintenance, and repair of commercial and industrial wirings. This segment also offers other engineering and technical services; emergency restoration services; engineering and construction services for the switchyards and transmission infrastructures; engineering and construction services related to micro-grids and battery storage; design and construction solutions to wireline and wireless communications companies and cable multi-system operators; aviation services; and training for electric workers, and gas distribution and communications industries. The Underground Utility and Infrastructure Solutions segment provides design, engineering, construction, upgrade repair, and maintenance services to customers involved in the transportation, distribution, storage and processing of natural gas, oil and other products; pipeline protection, integrity testing, rehabilitation and replacement; catalyst replacement, high-pressure and critical-path turnaround, instrumentation and electrical, and piping, and fabrication and storage tank services; engineering and construction services for pipeline systems, storage systems, and compressor and pump stations; fabrication of pipeline support systems and related structures and facilities; trenching, directional boring, and mechanized welding services; and construction services for the offshore energy market, as well as designs, installs, and maintains fueling systems and water and sewer infrastructure. The company was incorporated in 1997 and is headquartered in Houston, Texas.",
    "website": "http://www.quantaservices.com",
    "zipcode": "77056"
  },
  "Q1UA34.SA": {
    "city": "Houston",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Engineering & Construction",
    "long_name": "Quanta Services, Inc.",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "QUANTA SERVIDRN",
    "state": "TX",
    "summary": "Quanta Services, Inc. provides specialty contracting services worldwide. The Electric Power Infrastructure Solutions segment engages in the design, construction, upgrade, repair, and maintenance of electric power transmission and distribution infrastructure and substation facilities; energized installation, maintenance, and upgrade of electric power infrastructure; installation of smart grid technologies on electric power networks; and design, installation, maintenance, and repair of commercial and industrial wirings. This segment also offers other engineering and technical services; emergency restoration services; engineering and construction services for the switchyards and transmission infrastructures; engineering and construction services related to micro-grids and battery storage; design and construction solutions to wireline and wireless communications companies and cable multi-system operators; aviation services; and training for electric workers, and gas distribution and communications industries. The Underground Utility and Infrastructure Solutions segment provides design, engineering, construction, upgrade repair, and maintenance services to customers involved in the transportation, distribution, storage and processing of natural gas, oil and other products; pipeline protection, integrity testing, rehabilitation and replacement; catalyst replacement, high-pressure and critical-path turnaround, instrumentation and electrical, and piping, and fabrication and storage tank services; engineering and construction services for pipeline systems, storage systems, and compressor and pump stations; fabrication of pipeline support systems and related structures and facilities; trenching, directional boring, and mechanized welding services; and construction services for the offshore energy market, as well as designs, installs, and maintains fueling systems and water and sewer infrastructure. The company was incorporated in 1997 and is headquartered in Houston, Texas.",
    "website": "http://www.quantaservices.com",
    "zipcode": "77056"
  },
  "QAA.F": {
    "city": "Houston",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "Quanta Services, Inc.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "QUANTA SVCS  DL-,00001",
    "state": "TX",
    "summary": "Quanta Services, Inc. provides specialty contracting services worldwide. The Electric Power Infrastructure Solutions segment engages in the design, construction, upgrade, repair, and maintenance of electric power transmission and distribution infrastructure and substation facilities; energized installation, maintenance, and upgrade of electric power infrastructure; installation of smart grid technologies on electric power networks; and design, installation, maintenance, and repair of commercial and industrial wirings. This segment also offers other engineering and technical services; emergency restoration services; engineering and construction services for the switchyards and transmission infrastructures; engineering and construction services related to micro-grids and battery storage; design and construction solutions to wireline and wireless communications companies and cable multi-system operators; aviation services; and training for electric workers, and gas distribution and communications industries. The Underground Utility and Infrastructure Solutions segment provides design, engineering, construction, upgrade repair, and maintenance services to customers involved in the transportation, distribution, storage and processing of natural gas, oil and other products; pipeline protection, integrity testing, rehabilitation and replacement; catalyst replacement, high-pressure and critical-path turnaround, instrumentation and electrical, and piping, and fabrication and storage tank services; engineering and construction services for pipeline systems, storage systems, and compressor and pump stations; fabrication of pipeline support systems and related structures and facilities; trenching, directional boring, and mechanized welding services; and construction services for the offshore energy market, as well as designs, installs, and maintains fueling systems and water and sewer infrastructure. The company was incorporated in 1997 and is headquartered in Houston, Texas.",
    "website": "http://www.quantaservices.com",
    "zipcode": "77056"
  },
  "RCMT": {
    "city": "Pennsauken",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Engineering & Construction",
    "long_name": "RCM Technologies, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "RCM Technologies, Inc.",
    "state": "NJ",
    "summary": "RCM Technologies, Inc. provides business and technology solutions in the United States, Canada, Puerto Rico, and Serbia. It operates through three segments: Engineering, Specialty Health Care, and Information Technology. The Engineering segment offers a range of engineering services, including project management engineering and design, engineering analysis, engineer-procure-construct, configuration management, hardware/software validation and verification, quality assurance, technical writing and publications, manufacturing process planning and improvement, and 3D/BIM integrated design. The Specialty Health Care segment provides long-term and short-term staffing, executive search, and placement services in the fields of allied and therapy staffing, correctional healthcare staffing, health information management, nursing, physician and advanced practice, school, services, and telepractice. The Information Technology segment provides enterprise business solutions, application services, infrastructure solutions, competitive advantage and productivity solutions, life sciences solutions, and other vertical market specific solutions. The company serves aerospace and defense, energy, financial services, health care, life sciences, manufacturing and distribution, and technology industries, as well as educational institutions and the public sector. RCM Technologies, Inc. was founded in 1971 and is headquartered in Pennsauken, New Jersey.",
    "website": "http://www.rcmt.com",
    "zipcode": "08109-4613"
  },
  "RELT": {
    "city": "Austin",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Engineering & Construction",
    "long_name": "Reliant Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "RELIANT HOLDINGS INC",
    "state": "TX",
    "summary": "Reliant Holdings, Inc., through its subsidiary, Reliant Pools, Inc., designs and installs swimming pools in the United States. The company primarily constructs residential pools. It also focuses on constructing custom homes. Reliant Holdings, Inc. was incorporated in 2014 and is headquartered in Austin, Texas.",
    "website": "http://reliantholdingsinc.com",
    "zipcode": "78750"
  },
  "RIII": {
    "city": "Tulsa",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Engineering & Construction",
    "long_name": "Renavotio, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "RENAVOTIO INC",
    "state": "OK",
    "summary": "Renavotio, Inc., through its subsidiaries, engages in the medical infrastructure, utility, and underground infrastructure installation businesses. It produces, sells, and markets personal protection equipment, gowns, mask, gloves and disinfectant products. The company is also involved in the management and operation of water utility systems; water and waste management technology; the internet of all things; underground infrastructure, construction, and installation; and 5G technology solutions. In addition, it provides geographic information system solutions, infrastructure management, and smart city infrastructure technology to construction, environmental consulting, utility, and government clients. The company was formerly known as Success Entertainment Group International Inc. and changed its name to Renavotio, Inc. in September 2020. Renavotio, Inc. was incorporated in 2013 and is based in Tulsa, Oklahoma.",
    "website": "http://www.renavotio.com",
    "zipcode": "74119"
  },
  "ROAD": {
    "city": "Dothan",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Engineering & Construction",
    "long_name": "Construction Partners, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Construction Partners, Inc.",
    "state": "AL",
    "summary": "Construction Partners, Inc., a civil infrastructure company, engages in the construction and maintenance of roadways across Alabama, Florida, Georgia, North Carolina, and South Carolina. The company, through its subsidiaries, provides various products and services to public and private infrastructure projects, with a focus on highways, roads, bridges, airports, and commercial and residential developments. It also engages in manufacturing and distributing hot mix asphalt (HMA) for internal use and sales to third parties in connection with construction projects; paving activities, including the construction of roadway base layers and application of asphalt pavement; site development, including the installation of utility and drainage systems; mining aggregates, such as sand and gravel that are used as raw materials in the production of HMA; and distributing liquid asphalt cement for internal use and sales to third parties in connection with HMA production. The company was formerly known as SunTx CPI Growth Company, Inc. and changed its name to Construction Partners, Inc. in September 2017. Construction Partners, Inc. was founded in 2001 and is headquartered in Dothan, Alabama.",
    "website": "http://www.constructionpartners.net",
    "zipcode": "36303"
  },
  "SFHI": {
    "city": "St. Charles",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Engineering & Construction",
    "long_name": "Sports Field Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SPORTS FIELD HOLDINGS INC",
    "state": "IL",
    "summary": "Sports Field Holdings, Inc., a product development company, engages in the design, engineering, and construction of athletic fields and facilities, and sports complexes. It develops, sells, and installs PrimePlay line of synthetic turf and track products, infill materials, and shock/drainage pads; and Replicated Grass synthetic turf systems. The company's target markets include colleges, universities, high schools, primary schools, municipal parks and recreations departments, commercial and residential landscaping projects, private club sports associations, and independent athletic training facilities, as well as golf and golf related activities. Sports Field Holdings, Inc. was founded in 2011 and is headquartered in St. Charles, Illinois.",
    "website": "http://sportsfieldholdingsinc.com",
    "zipcode": "60174"
  },
  "SODE": {
    "city": "Alamo",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Engineering & Construction",
    "long_name": "Social Detention, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SOCIAL DETENTION INC",
    "state": "CA",
    "summary": "Social Detention, Inc. provides infrastructure and security solutions. The company is based in Alamo, California.",
    "website": "http://sodetention.com",
    "zipcode": "94507"
  },
  "STRL": {
    "city": "The Woodlands",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Engineering & Construction",
    "long_name": "Sterling Construction Company, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Sterling Construction Company I",
    "state": "TX",
    "summary": "Sterling Construction Company, Inc., a construction company, engages in the heavy civil, specialty services, and residential construction activities primarily in the southern United States, the Rocky Mountain states, California, and Hawaii. The company undertakes various heavy civil construction projects, including highways, roads, bridges, airfields, ports, light rail, water, wastewater and storm drainage systems for the departments of transportation in various states, regional transit authorities, airport authorities, port authorities, water authorities, and railroads. It offers specialty services such as foundations for multi-family homes, parking structures, and other commercial concrete projects for blue-chip end users in the e-commerce, data center, distribution center and warehousing, energy, mixed use, and multi-family sectors. The company also undertakes concrete foundations for single-family homes. In addition, it provides surveying, clearing and grubbing, erosion control, grading, grassing, site excavation, storm drainage, sanitary sewer and water main installation, drilling and blasting, curb and gutter, paving, concrete work, and landfill services. The company was formerly known as Oakhurst Company, Inc. and changed its name to Sterling Construction Company, Inc. in November 2001. Sterling Construction Company, Inc. was founded in 1955 and is headquartered in The Woodlands, Texas.",
    "website": "http://www.strlco.com",
    "zipcode": "77380"
  },
  "TPC": {
    "city": "Sylmar",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Engineering & Construction",
    "long_name": "Tutor Perini Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Tutor Perini Corporation",
    "state": "CA",
    "summary": "Tutor Perini Corporation, a construction company, provides diversified general contracting, construction management, and design-build services to private customers and public agencies worldwide. The company operates through three segments: Civil, Building, and Specialty Contractors. The Civil segment engages in the public works construction and the replacement and reconstruction of infrastructure, including highways, bridges, tunnels, mass-transit systems, military defense facilities, and water management and wastewater treatment facilities. This segment also provides drilling, foundation, and excavation support for shoring, bridges, piers, roads, and highway projects. The Building segment offers services in various specialized building markets, including hospitality and gaming, transportation, health care, commercial offices, government facilities, sports and entertainment, education, correctional facilities, biotech, pharmaceutical, and industrial and high-tech. The Specialty Contractors segment provides electrical, mechanical, plumbing, fire protection systems, and pneumatically placed concrete services, as well as heating, ventilation, and air conditioning services (HVAC) for the industrial, commercial, hospitality and gaming, and mass-transit end markets. It also offers general contracting, pre-construction planning, and project management services, including planning and scheduling of manpower, equipment, materials, and subcontractors; and self-performed construction services comprising site work, concrete forming and placement, steel erection, electrical, plumbing, HVAC, and mechanical. The company was formerly known as Perini Corporation and changed its name to Tutor Perini Corporation in 2009. Tutor Perini Corporation was founded in 1894 and is headquartered in Sylmar, California.",
    "website": "http://www.tutorperini.com",
    "zipcode": "91342"
  },
  "TT6.F": {
    "city": "Pasadena",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "Tetra Tech, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "TETRA TECH INC.  DL-,01",
    "state": "CA",
    "summary": "Tetra Tech, Inc. provides consulting and engineering services worldwide. The company operates through Government Services Group (GSG) and Commercial/International Services Group (CIG) segments. The GSG segment offers early data collection and monitoring, data analysis and information technology, science and engineering applied research, engineering design, construction management, and operations and maintenance services; and climate change and energy management consulting, as well as greenhouse gas inventory assessment, certification, reduction, and management services. This segment serves federal, state, and local governments, and development agencies in water resources analysis and water management, environmental monitoring, data analytics, government consulting, waste management, and a range of civil infrastructure master planning and engineering design markets. The CIG segment provides early data collection and monitoring, data analysis and information management, feasibility studies and assessments, science and engineering applied research, engineering design, construction management, and operations and maintenance services. This segment serves natural resources, energy, and utilities markets, as well as civil infrastructure master planning and engineering design markets. Tetra Tech, Inc. was founded in 1966 and is headquartered in Pasadena, California.",
    "website": "http://www.tetratech.com",
    "zipcode": "91107-6024"
  },
  "TTEK": {
    "city": "Pasadena",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Engineering & Construction",
    "long_name": "Tetra Tech, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "Tetra Tech, Inc.",
    "state": "CA",
    "summary": "Tetra Tech, Inc. provides consulting and engineering services worldwide. The company operates through Government Services Group (GSG) and Commercial/International Services Group (CIG) segments. The GSG segment offers early data collection and monitoring, data analysis and information technology, science and engineering applied research, engineering design, construction management, and operations and maintenance services; and climate change and energy management consulting, as well as greenhouse gas inventory assessment, certification, reduction, and management services. This segment serves federal, state, and local governments, and development agencies in water resources analysis and water management, environmental monitoring, data analytics, government consulting, waste management, and a range of civil infrastructure master planning and engineering design markets. The CIG segment provides early data collection and monitoring, data analysis and information management, feasibility studies and assessments, science and engineering applied research, engineering design, construction management, and operations and maintenance services. This segment serves natural resources, energy, and utilities markets, as well as civil infrastructure master planning and engineering design markets. Tetra Tech, Inc. was founded in 1966 and is headquartered in Pasadena, California.",
    "website": "http://www.tetratech.com",
    "zipcode": "91107-6024"
  },
  "UAO.F": {
    "city": "The Woodlands",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Engineering & Construction",
    "long_name": "Sterling Construction Company, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "STERLING CON  DL-,01",
    "state": "TX",
    "summary": "Sterling Construction Company, Inc., a construction company, engages in the heavy civil, specialty services, and residential construction activities primarily in the southern United States, the Rocky Mountain states, California, and Hawaii. The company undertakes various heavy civil construction projects, including highways, roads, bridges, airfields, ports, light rail, water, wastewater and storm drainage systems for the departments of transportation in various states, regional transit authorities, airport authorities, port authorities, water authorities, and railroads. It offers specialty services such as foundations for multi-family homes, parking structures, and other commercial concrete projects for blue-chip end users in the e-commerce, data center, distribution center and warehousing, energy, mixed use, and multi-family sectors. The company also undertakes concrete foundations for single-family homes. In addition, it provides surveying, clearing and grubbing, erosion control, grading, grassing, site excavation, storm drainage, sanitary sewer and water main installation, drilling and blasting, curb and gutter, paving, concrete work, and landfill services. The company was formerly known as Oakhurst Company, Inc. and changed its name to Sterling Construction Company, Inc. in November 2001. Sterling Construction Company, Inc. was founded in 1955 and is headquartered in The Woodlands, Texas.",
    "website": "http://www.strlco.com",
    "zipcode": "77380"
  },
  "VICT": {
    "city": "Fort Worth",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Engineering & Construction",
    "long_name": "Victura Construction Group, Inc.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "VICTURA CONSTRUCTION GROUP INC",
    "state": "TX",
    "summary": "As of April 28, 2021,  operates as a subsidiary of Saint James Holding & Investment Co Trust.",
    "website": "http://www.victuraconstruction.com",
    "zipcode": "76108"
  },
  "WAXS": {
    "city": "Atlanta",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Engineering & Construction",
    "long_name": "World Access, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "WORLD ACCESS INC",
    "state": "GA",
    "summary": "World Access, Inc. operates as a global services company providing solutions in customer care to organizations in the travel, financial, health care, and call center industries. It consists of three full service companies and three specialized services companies. World Access Service Corporation serves companies located in the US and companies that have travelers or employees visiting North America. World Access Canada serves companies located in Canada; and World Access Asia serves companies located in eastern Asia, including Japan. World Access Europe provides members of World Access with logistical and medical support throughout the region. Other companies include World Access Provider Network Services; and World Access Transport Services that manages and coordinates all medical evacuation and repatriation activities for World Access. The company is based in Atlanta, Georgia. In April 2001, the company filed voluntary petitions for Chapter 11 relief in the United States Bankruptcy Court on behalf of itself and certain of its U.S. subsidiaries.",
    "website": null,
    "zipcode": "30326"
  },
  "WLDN": {
    "city": "Anaheim",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Engineering & Construction",
    "long_name": "Willdan Group, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Willdan Group, Inc.",
    "state": "CA",
    "summary": "Willdan Group, Inc., together with its subsidiaries, provides professional, technical and consulting services primarily in the United States. It operates in two segments, Energy, and Engineering and Consulting. The Energy segment offers comprehensive audit and surveys, program design, master planning, demand reduction, grid optimization, benchmarking analyses, design engineering, construction management, performance contracting, installation, alternative financing, and measurement and verification services, as well as software and data analytics. The Engineering and Consulting segment provides building and safety, city engineering, code enforcement, development plan review and inspection, disaster recovery, geotechnical and earthquake engineering, planning and surveying, contract staff support, program and construction management, structural engineering, transportation and traffic engineering, and water resources services. This segment also offers district administration, financial consulting, and federal compliance services; emergency preparedness, planning, training, and exercise services; and communications and technology services. The company serves public and governmental agencies, including cities, counties, redevelopment agencies, water districts, school districts, and universities; investor and municipal owned energy utilities; state and federal agencies; commercial and industrial firms; and tribal governments, as well as various other special districts and agencies. Willdan Group, Inc. was founded in 1964 and is headquartered in Anaheim, California.",
    "website": "http://www.willdan.com",
    "zipcode": "92806"
  }
}
