{
  "5TUA.F": {
    "city": "Fairless Hills",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Hydrofarm Holdings Group, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "HYDROFARM HLD. GRP -,0001",
    "state": "PA",
    "summary": "Hydrofarm Holdings Group, Inc., together with its subsidiaries, engages in the manufacture and distribution of controlled environment agriculture (CEA) equipment and supplies in the United States and Canada. The company offers agricultural lighting devices, indoor climate control equipment, hydroponics and nutrients, and plant additives used to grow, farm, and cultivate cannabis, flowers, fruits, plants, vegetables, grains, and herbs in controlled environment; and distributes CEA equipment and supplies, which include grow light systems; heating, ventilation, and air conditioning systems; humidity and carbon dioxide monitors and controllers; water pumps, heaters, chillers, and filters; nutrient and fertilizer delivery systems; and various growing media made from soil, rock wool or coconut fiber. It also provides hydroponics systems, such as hydro systems, hydro trays and components, meters and solutions, pumps and irrigation systems, water filtration systems, pots and containers, and tents and tarps; atmospheric control equipment comprising controllers, monitors and timers, ventilation/air conditioning equipment, air purification equipment, and CO2 equipment; and nutrients and additives. The company offers its products under the PHOTOBIO, Phantom, Quantum, Digilux, Jump Start, Active Aqua, Active Air, Autopilot, Xtrasun, Active Eye, Agrobrite, GROW!T, Phat, and oxyClone brands. Hydrofarm Holdings Group, Inc. was founded in 1977 and is based in Fairless Hills, Pennsylvania.",
    "website": "http://www.hydrofarm.com",
    "zipcode": "19030"
  },
  "AGCO": {
    "city": "Duluth",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "AGCO Corporation",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "AGCO Corporation",
    "state": "GA",
    "summary": "AGCO Corporation manufactures and distributes agricultural equipment and related replacement parts worldwide. It offers high horsepower tractors for row crop production, soil cultivation, planting, land leveling, seeding, and commercial hay operations; utility tractors for small- and medium-sized farms, as well as for dairy, livestock, orchards, and vineyards; and compact tractors for small farms, specialty agricultural industries, landscaping, equestrian, and residential uses. The company also provides grain storage bins and related drying and handling equipment systems; seed-processing systems; swine and poultry feed storage and delivery; ventilation and watering systems; and egg production systems and broiler production equipment. In addition, it offers round and rectangular balers, loader wagons, self-propelled windrowers, forage harvesters, disc mowers, spreaders, rakes, tedders, and mower conditioners for harvesting and packaging vegetative feeds used in the beef cattle, dairy, horse, and renewable fuel industries. Further, the company provides implements, including disc harrows leveling seed beds and mixing chemicals with the soils; heavy tillage to break up soil and mix crop residue into topsoil; field cultivators that prepare smooth seed bed and destroy weeds; drills for small grain seeding; planters and other planting equipment; and loaders. Additionally, it offers combines for harvesting grain crops, such as corn, wheat, soybeans, and rice; and application equipment, such as self-propelled, three- and four-wheeled vehicles, and related equipment for liquid and dry fertilizers and crop protection chemicals, and for after crops emerge from the ground, as well as produces diesel engines, gears, and generating sets. The company markets its products under the Challenger, Fendt, GSI, Massey Ferguson, and Valtra brands through a network of independent dealers and distributors. AGCO Corporation was founded in 1990 and is headquartered in Duluth, Georgia.",
    "website": "http://www.agcocorp.com",
    "zipcode": "30096"
  },
  "AGJ.F": {
    "city": "Duluth",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "AGCO Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "AGCO CORP.  DL-,01",
    "state": "GA",
    "summary": "AGCO Corporation manufactures and distributes agricultural equipment and related replacement parts worldwide. It offers high horsepower tractors for row crop production, soil cultivation, planting, land leveling, seeding, and commercial hay operations; utility tractors for small- and medium-sized farms, as well as for dairy, livestock, orchards, and vineyards; and compact tractors for small farms, specialty agricultural industries, landscaping, equestrian, and residential uses. The company also provides grain storage bins and related drying and handling equipment systems; seed-processing systems; swine and poultry feed storage and delivery; ventilation and watering systems; and egg production systems and broiler production equipment. In addition, it offers round and rectangular balers, loader wagons, self-propelled windrowers, forage harvesters, disc mowers, spreaders, rakes, tedders, and mower conditioners for harvesting and packaging vegetative feeds used in the beef cattle, dairy, horse, and renewable fuel industries. Further, the company provides implements, including disc harrows leveling seed beds and mixing chemicals with the soils; heavy tillage to break up soil and mix crop residue into topsoil; field cultivators that prepare smooth seed bed and destroy weeds; drills for small grain seeding; planters and other planting equipment; and loaders. Additionally, it offers combines for harvesting grain crops, such as corn, wheat, soybeans, and rice; and application equipment, such as self-propelled, three- and four-wheeled vehicles, and related equipment for liquid and dry fertilizers and crop protection chemicals, and for after crops emerge from the ground, as well as produces diesel engines, gears, and generating sets. The company markets its products under the Challenger, Fendt, GSI, Massey Ferguson, and Valtra brands through a network of independent dealers and distributors. AGCO Corporation was founded in 1990 and is headquartered in Duluth, Georgia.",
    "website": "http://www.agcocorp.com",
    "zipcode": "30096"
  },
  "AI2.F": {
    "city": "Chattanooga",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Astec Industries, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "ASTEC INDS INC.  DL-,20",
    "state": "TN",
    "summary": "Astec Industries, Inc. designs, engineers, manufactures, and markets equipment and components used primarily in road building and related construction activities in the United States and internationally. The company's Infrastructure Solutions segment designs, engineers, manufactures, and markets asphalt plants and related components, heaters, concrete dust control systems, asphalt pavers, vaporizers, concrete material handling systems, screeds, heat recovery units, paste back-fill plants, asphalt storage tanks, hot oil heaters, bagging plants, fuel storage tanks, industrial and asphalt burners and systems, custom batch plants, material transfer vehicles, soil stabilizing-reclaiming machinery, blower trucks and trailers, milling machines, soil remediation plants, wood chippers and grinders, pump trailers, concrete batch plants, control systems, liquid terminals, storage equipment and related parts, construction and retrofits, polymer plants, and concrete mixers, as well as offers engineering and environmental permitting services. This segment offers its products to asphalt producers, highway and heavy equipment contractors, ready mix concrete producers, contractors in the construction and demolition recycling markets, and governmental agencies. Its Materials Solutions segment designs and manufactures crushing equipment, track-mounted systems, bulk material handling solutions, vibrating equipment, screening equipment, electrical control centers, modular relocatable stationary plants, conveying equipment, plant automation products, mobile portable plants, and mineral processing equipment, as well as provides consulting and engineering services. Astec Industries, Inc. was founded in 1972 and is based in Chattanooga, Tennessee.",
    "website": "http://www.astecindustries.com",
    "zipcode": "37421"
  },
  "AL3.F": {
    "city": "Seguin",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Alamo Group Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "ALAMO GRP INC.  DL-,10",
    "state": "TX",
    "summary": "Alamo Group Inc. designs, manufactures, distributes, and services agricultural and infrastructure maintenance equipment for governmental and industrial use worldwide. The company offers hydraulically-powered and tractor-mounted mowers, such as boom-mounted mowers; other cutters and replacement parts for heavy-duty and intensive uses; and heavy duty, tractor-and truck-mounted mowing, and vegetation maintenance equipment and replacement parts. It also provides truck-mounted air vacuum, mechanical broom, and regenerative air sweepers; pothole patchers; leaf collection equipment and replacement brooms; parking lot and street sweepers; excavators; catch basin cleaners and roadway debris vacuum systems; truck-mounted vacuum trucks, combination sewer cleaners, and hydro excavators; ice control products; snow plows and heavy duty snow removal equipment, hitches, attachments, and graders; landscape and vegetation maintenance equipment; and public works and runway maintenance products, parts, and services. In addition, the company offers rotary and finishing mowers, flail and disc mowers, front-end loaders, backhoes, rotary tillers, posthole diggers, scraper blades, and replacement parts, as well as zero turn radius mowers; cutting parts, plain and hard-faced replacement tillage tools, disc blades, and fertilizer application components; aftermarket agricultural parts; and heavy-duty mechanical rotary mowers, snow blowers, rock removal equipment, and replacement parts. Further, it provides tractor attachments; agricultural implements; hydraulic and boom-mounted hedge and grass cutters, and other tractor attachments and implements; hedgerow cutters, industrial grass mowers, and agricultural seedbed preparation cultivators; self-propelled sprayers and multi-drive load-carrying vehicles; cutting blades; hydraulic and mechanical boom mowers; and high pressure cleaning systems and trenchers. Alamo Group Inc. was founded in 1955 and is headquartered in Seguin, Texas.",
    "website": "http://www.alamo-group.com",
    "zipcode": "78155"
  },
  "ALG": {
    "city": "Seguin",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Alamo Group Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Alamo Group, Inc.",
    "state": "TX",
    "summary": "Alamo Group Inc. designs, manufactures, distributes, and services agricultural and infrastructure maintenance equipment for governmental and industrial use worldwide. The company offers hydraulically-powered and tractor-mounted mowers, such as boom-mounted mowers; other cutters and replacement parts for heavy-duty and intensive uses; and heavy duty, tractor-and truck-mounted mowing, and vegetation maintenance equipment and replacement parts. It also provides truck-mounted air vacuum, mechanical broom, and regenerative air sweepers; pothole patchers; leaf collection equipment and replacement brooms; parking lot and street sweepers; excavators; catch basin cleaners and roadway debris vacuum systems; truck-mounted vacuum trucks, combination sewer cleaners, and hydro excavators; ice control products; snow plows and heavy duty snow removal equipment, hitches, attachments, and graders; landscape and vegetation maintenance equipment; and public works and runway maintenance products, parts, and services. In addition, the company offers rotary and finishing mowers, flail and disc mowers, front-end loaders, backhoes, rotary tillers, posthole diggers, scraper blades, and replacement parts, as well as zero turn radius mowers; cutting parts, plain and hard-faced replacement tillage tools, disc blades, and fertilizer application components; aftermarket agricultural parts; and heavy-duty mechanical rotary mowers, snow blowers, rock removal equipment, and replacement parts. Further, it provides tractor attachments; agricultural implements; hydraulic and boom-mounted hedge and grass cutters, and other tractor attachments and implements; hedgerow cutters, industrial grass mowers, and agricultural seedbed preparation cultivators; self-propelled sprayers and multi-drive load-carrying vehicles; cutting blades; hydraulic and mechanical boom mowers; and high pressure cleaning systems and trenchers. Alamo Group Inc. was founded in 1955 and is headquartered in Seguin, Texas.",
    "website": "http://www.alamo-group.com",
    "zipcode": "78155"
  },
  "AMMX": {
    "city": "Chico",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "AmeraMex International, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "AMERAMEX INTERNATIONAL INC",
    "state": "CA",
    "summary": "AmeraMex International, Inc. sells, leases, and rents new and refurbished heavy equipment primarily in the United States. Its products are used in light and infrastructure construction, shipping logistics, logging, mining, transportation, commercial farming, and forestry industries. The company also sells parts; and provides repair and maintenance services. It serves customers in the United States, Canada, Latin America, Asia, and Africa. The company was incorporated in 1989 and is based in Chico, California.",
    "website": "http://www.ammx.net",
    "zipcode": "95973"
  },
  "ARTW": {
    "city": "Armstrong",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Art's-Way Manufacturing Co., Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Art's-Way Manufacturing Co., In",
    "state": "IA",
    "summary": "Art's-Way Manufacturing Co., Inc. manufactures and sells agricultural equipment, specialized modular science buildings, and steel cutting tools in the United States and internationally. The company operates through three segments: Agricultural Products, Modular Buildings, and Tools. The Agricultural Products segment offers various specialized farm machinery, including portable and stationary animal feed processing equipment and related attachments; hay and forage equipment, such as forage boxes, blowers, running gears, and dump boxes; portable grinder mixers; manure spreaders; sugar beet harvesting equipment; land maintenance equipment; moldboard plows; reels for combines and swathers; silage blowers and reels; land management equipment; and after-market service parts. The Modular Buildings segment produces, sells, and leases swine buildings, complex containment research laboratories, and research facilities for academic research institutions, government research and diagnostic centers, public health institutions, and private research and pharmaceutical companies. This segment also designs, manufactures, delivers, installs, and rents building units. The Tools segment offers standard single point brazed carbide tipped tools, polycrystalline diamond and cubic boron nitride inserts and tools, and original equipment manufacturer (OEM) specialty tools to the automotive, aerospace, oil and gas piping, and appliances industries. The company markets and sells its products through independent farm equipment dealers, manufacturers' representatives, direct sales, and OEM sales channels. Art's-Way Manufacturing Co., Inc. was founded in 1956 and is based in Armstrong, Iowa.",
    "website": "http://www.artsway-mfg.com",
    "zipcode": "50514"
  },
  "ASTE": {
    "city": "Chattanooga",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Astec Industries, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Astec Industries, Inc.",
    "state": "TN",
    "summary": "Astec Industries, Inc. designs, engineers, manufactures, and markets equipment and components used primarily in road building and related construction activities in the United States and internationally. The company's Infrastructure Solutions segment designs, engineers, manufactures, and markets asphalt plants and related components, heaters, concrete dust control systems, asphalt pavers, vaporizers, concrete material handling systems, screeds, heat recovery units, paste back-fill plants, asphalt storage tanks, hot oil heaters, bagging plants, fuel storage tanks, industrial and asphalt burners and systems, custom batch plants, material transfer vehicles, soil stabilizing-reclaiming machinery, blower trucks and trailers, milling machines, soil remediation plants, wood chippers and grinders, pump trailers, concrete batch plants, control systems, liquid terminals, storage equipment and related parts, construction and retrofits, polymer plants, and concrete mixers, as well as offers engineering and environmental permitting services. This segment offers its products to asphalt producers, highway and heavy equipment contractors, ready mix concrete producers, contractors in the construction and demolition recycling markets, and governmental agencies. Its Materials Solutions segment designs and manufactures crushing equipment, track-mounted systems, bulk material handling solutions, vibrating equipment, screening equipment, electrical control centers, modular relocatable stationary plants, conveying equipment, plant automation products, mobile portable plants, and mineral processing equipment, as well as provides consulting and engineering services. Astec Industries, Inc. was founded in 1972 and is based in Chattanooga, Tennessee.",
    "website": "http://www.astecindustries.com",
    "zipcode": "37421"
  },
  "CAT": {
    "city": "Deerfield",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Caterpillar Inc.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "Caterpillar, Inc.",
    "state": "IL",
    "summary": "Caterpillar Inc. manufactures and sells construction and mining equipment, diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives worldwide. Its Construction Industries segment offers asphalt pavers, compactors, cold planers, motorgraders, pipelayers, road reclaimers, telehandlers, and utility vehicles; backhoe, compact track, multi-terrain, skid steer, and track-type loaders; forestry and wheel excavators; and site prep and track-type tractors. The company's Resource Industries segment provides electric rope and hydraulic shovels, draglines, rotary drills, hard rock vehicles, track-type tractors, mining trucks, longwall miners, wheel loaders, off-highway and articulated trucks, wheel tractor scrapers, wheel dozers, landfill and soil compactors, machinery components, autonomous ready vehicles and solutions, and select work tools. Its Energy & Transportation segment offers reciprocating engine powered generator sets; reciprocating engines and integrated systems for the power generation, marine, oil, and gas industries; turbines, centrifugal gas compressors, and related services; remanufactured reciprocating engines and components; and diesel-electric locomotives and components, and other rail-related products. The company's Financial Products segment provides operating and finance leases, installment sale contracts, working capital loans, and wholesale financing; and insurance and risk management, as well as other equipment-related loans. Its All Other Operating segment offers filters and fluids, undercarriage, ground engaging tools, fluid transfer products, precision seals, and rubber sealing and connecting components; parts distribution; integrated logistics solutions; portfolio management; brand management and marketing strategy; and digital investments services. The company was formerly known as Caterpillar Tractor Co. The company was founded in 1925 and is headquartered in Deerfield, Illinois.",
    "website": "http://www.caterpillar.com",
    "zipcode": "60015"
  },
  "CAT.BA": {
    "city": "Deerfield",
    "country": "United States",
    "currency": "ARS",
    "exchange": "BUE",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Caterpillar Inc.",
    "market": "ar_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "CATERPILLAR INC",
    "state": "IL",
    "summary": "Caterpillar Inc. manufactures and sells construction and mining equipment, diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives worldwide. Its Construction Industries segment offers asphalt pavers, compactors, cold planers, motorgraders, pipelayers, road reclaimers, telehandlers, and utility vehicles; backhoe, compact track, multi-terrain, skid steer, and track-type loaders; forestry and wheel excavators; and site prep and track-type tractors. The company's Resource Industries segment provides electric rope and hydraulic shovels, draglines, rotary drills, hard rock vehicles, track-type tractors, mining trucks, longwall miners, wheel loaders, off-highway and articulated trucks, wheel tractor scrapers, wheel dozers, landfill and soil compactors, machinery components, autonomous ready vehicles and solutions, and select work tools. Its Energy & Transportation segment offers reciprocating engine powered generator sets; reciprocating engines and integrated systems for the power generation, marine, oil, and gas industries; turbines, centrifugal gas compressors, and related services; remanufactured reciprocating engines and components; and diesel-electric locomotives and components, and other rail-related products. The company's Financial Products segment provides operating and finance leases, installment sale contracts, working capital loans, and wholesale financing; and insurance and risk management, as well as other equipment-related loans. Its All Other Operating segment offers filters and fluids, undercarriage, ground engaging tools, fluid transfer products, precision seals, and rubber sealing and connecting components; parts distribution; integrated logistics solutions; portfolio management; brand management and marketing strategy; and digital investments services. The company was formerly known as Caterpillar Tractor Co. The company was founded in 1925 and is headquartered in Deerfield, Illinois.",
    "website": "http://www.caterpillar.com",
    "zipcode": "60015"
  },
  "CAT.MX": {
    "city": "Deerfield",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Caterpillar Inc.",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "CATERPILLAR INC",
    "state": "IL",
    "summary": "Caterpillar Inc. manufactures and sells construction and mining equipment, diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives worldwide. Its Construction Industries segment offers asphalt pavers, compactors, cold planers, motorgraders, pipelayers, road reclaimers, telehandlers, and utility vehicles; backhoe, compact track, multi-terrain, skid steer, and track-type loaders; forestry and wheel excavators; and site prep and track-type tractors. The company's Resource Industries segment provides electric rope and hydraulic shovels, draglines, rotary drills, hard rock vehicles, track-type tractors, mining trucks, longwall miners, wheel loaders, off-highway and articulated trucks, wheel tractor scrapers, wheel dozers, landfill and soil compactors, machinery components, autonomous ready vehicles and solutions, and select work tools. Its Energy & Transportation segment offers reciprocating engine powered generator sets; reciprocating engines and integrated systems for the power generation, marine, oil, and gas industries; turbines, centrifugal gas compressors, and related services; remanufactured reciprocating engines and components; and diesel-electric locomotives and components, and other rail-related products. The company's Financial Products segment provides operating and finance leases, installment sale contracts, working capital loans, and wholesale financing; and insurance and risk management, as well as other equipment-related loans. Its All Other Operating segment offers filters and fluids, undercarriage, ground engaging tools, fluid transfer products, precision seals, and rubber sealing and connecting components; parts distribution; integrated logistics solutions; portfolio management; brand management and marketing strategy; and digital investments services. The company was formerly known as Caterpillar Tractor Co. The company was founded in 1925 and is headquartered in Deerfield, Illinois.",
    "website": "http://www.caterpillar.com",
    "zipcode": "60015"
  },
  "CAT.SN": {
    "city": "Deerfield",
    "country": "United States",
    "currency": "USD",
    "exchange": "SGO",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Caterpillar Inc.",
    "market": "cl_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "CATERPILLAR INC",
    "state": "IL",
    "summary": "Caterpillar Inc. manufactures and sells construction and mining equipment, diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives worldwide. Its Construction Industries segment offers asphalt pavers, compactors, cold planers, motorgraders, pipelayers, road reclaimers, telehandlers, and utility vehicles; backhoe, compact track, multi-terrain, skid steer, and track-type loaders; forestry and wheel excavators; and site prep and track-type tractors. The company's Resource Industries segment provides electric rope and hydraulic shovels, draglines, rotary drills, hard rock vehicles, track-type tractors, mining trucks, longwall miners, wheel loaders, off-highway and articulated trucks, wheel tractor scrapers, wheel dozers, landfill and soil compactors, machinery components, autonomous ready vehicles and solutions, and select work tools. Its Energy & Transportation segment offers reciprocating engine powered generator sets; reciprocating engines and integrated systems for the power generation, marine, oil, and gas industries; turbines, centrifugal gas compressors, and related services; remanufactured reciprocating engines and components; and diesel-electric locomotives and components, and other rail-related products. The company's Financial Products segment provides operating and finance leases, installment sale contracts, working capital loans, and wholesale financing; and insurance and risk management, as well as other equipment-related loans. Its All Other Operating segment offers filters and fluids, undercarriage, ground engaging tools, fluid transfer products, precision seals, and rubber sealing and connecting components; parts distribution; integrated logistics solutions; portfolio management; brand management and marketing strategy; and digital investments services. The company was formerly known as Caterpillar Tractor Co. The company was founded in 1925 and is headquartered in Deerfield, Illinois.",
    "website": "http://www.caterpillar.com",
    "zipcode": "60015"
  },
  "CAT.VI": {
    "city": "Deerfield",
    "country": "United States",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Caterpillar Inc.",
    "market": "at_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "CATERPILLAR INC",
    "state": "IL",
    "summary": "Caterpillar Inc. manufactures and sells construction and mining equipment, diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives worldwide. Its Construction Industries segment offers asphalt pavers, compactors, cold planers, motorgraders, pipelayers, road reclaimers, telehandlers, and utility vehicles; backhoe, compact track, multi-terrain, skid steer, and track-type loaders; forestry and wheel excavators; and site prep and track-type tractors. The company's Resource Industries segment provides electric rope and hydraulic shovels, draglines, rotary drills, hard rock vehicles, track-type tractors, mining trucks, longwall miners, wheel loaders, off-highway and articulated trucks, wheel tractor scrapers, wheel dozers, landfill and soil compactors, machinery components, autonomous ready vehicles and solutions, and select work tools. Its Energy & Transportation segment offers reciprocating engine powered generator sets; reciprocating engines and integrated systems for the power generation, marine, oil, and gas industries; turbines, centrifugal gas compressors, and related services; remanufactured reciprocating engines and components; and diesel-electric locomotives and components, and other rail-related products. The company's Financial Products segment provides operating and finance leases, installment sale contracts, working capital loans, and wholesale financing; and insurance and risk management, as well as other equipment-related loans. Its All Other Operating segment offers filters and fluids, undercarriage, ground engaging tools, fluid transfer products, precision seals, and rubber sealing and connecting components; parts distribution; integrated logistics solutions; portfolio management; brand management and marketing strategy; and digital investments services. The company was formerly known as Caterpillar Tractor Co. The company was founded in 1925 and is headquartered in Deerfield, Illinois.",
    "website": "http://www.caterpillar.com",
    "zipcode": "60015"
  },
  "CAT1.DE": {
    "city": "Deerfield",
    "country": "United States",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Caterpillar Inc.",
    "market": "de_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "CATERPILLAR INC.  DL 1",
    "state": "IL",
    "summary": "Caterpillar Inc. manufactures and sells construction and mining equipment, diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives worldwide. Its Construction Industries segment offers asphalt pavers, compactors, cold planers, motorgraders, pipelayers, road reclaimers, telehandlers, and utility vehicles; backhoe, compact track, multi-terrain, skid steer, and track-type loaders; forestry and wheel excavators; and site prep and track-type tractors. The company's Resource Industries segment provides electric rope and hydraulic shovels, draglines, rotary drills, hard rock vehicles, track-type tractors, mining trucks, longwall miners, wheel loaders, off-highway and articulated trucks, wheel tractor scrapers, wheel dozers, landfill and soil compactors, machinery components, autonomous ready vehicles and solutions, and select work tools. Its Energy & Transportation segment offers reciprocating engine powered generator sets; reciprocating engines and integrated systems for the power generation, marine, oil, and gas industries; turbines, centrifugal gas compressors, and related services; remanufactured reciprocating engines and components; and diesel-electric locomotives and components, and other rail-related products. The company's Financial Products segment provides operating and finance leases, installment sale contracts, working capital loans, and wholesale financing; and insurance and risk management, as well as other equipment-related loans. Its All Other Operating segment offers filters and fluids, undercarriage, ground engaging tools, fluid transfer products, precision seals, and rubber sealing and connecting components; parts distribution; integrated logistics solutions; portfolio management; brand management and marketing strategy; and digital investments services. The company was formerly known as Caterpillar Tractor Co. The company was founded in 1925 and is headquartered in Deerfield, Illinois.",
    "website": "http://www.caterpillar.com",
    "zipcode": "60015"
  },
  "CAT1.F": {
    "city": "Deerfield",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Caterpillar Inc.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "CATERPILLAR INC.  DL 1",
    "state": "IL",
    "summary": "Caterpillar Inc. manufactures and sells construction and mining equipment, diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives worldwide. Its Construction Industries segment offers asphalt pavers, compactors, cold planers, motorgraders, pipelayers, road reclaimers, telehandlers, and utility vehicles; backhoe, compact track, multi-terrain, skid steer, and track-type loaders; forestry and wheel excavators; and site prep and track-type tractors. The company's Resource Industries segment provides electric rope and hydraulic shovels, draglines, rotary drills, hard rock vehicles, track-type tractors, mining trucks, longwall miners, wheel loaders, off-highway and articulated trucks, wheel tractor scrapers, wheel dozers, landfill and soil compactors, machinery components, autonomous ready vehicles and solutions, and select work tools. Its Energy & Transportation segment offers reciprocating engine powered generator sets; reciprocating engines and integrated systems for the power generation, marine, oil, and gas industries; turbines, centrifugal gas compressors, and related services; remanufactured reciprocating engines and components; and diesel-electric locomotives and components, and other rail-related products. The company's Financial Products segment provides operating and finance leases, installment sale contracts, working capital loans, and wholesale financing; and insurance and risk management, as well as other equipment-related loans. Its All Other Operating segment offers filters and fluids, undercarriage, ground engaging tools, fluid transfer products, precision seals, and rubber sealing and connecting components; parts distribution; integrated logistics solutions; portfolio management; brand management and marketing strategy; and digital investments services. The company was formerly known as Caterpillar Tractor Co. The company was founded in 1925 and is headquartered in Deerfield, Illinois.",
    "website": "http://www.caterpillar.com",
    "zipcode": "60015"
  },
  "CATP34.SA": {
    "city": "Deerfield",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Caterpillar Inc.",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "CATERPILLAR DRN",
    "state": "IL",
    "summary": "Caterpillar Inc. manufactures and sells construction and mining equipment, diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives worldwide. Its Construction Industries segment offers asphalt pavers, compactors, cold planers, motorgraders, pipelayers, road reclaimers, telehandlers, and utility vehicles; backhoe, compact track, multi-terrain, skid steer, and track-type loaders; forestry and wheel excavators; and site prep and track-type tractors. The company's Resource Industries segment provides electric rope and hydraulic shovels, draglines, rotary drills, hard rock vehicles, track-type tractors, mining trucks, longwall miners, wheel loaders, off-highway and articulated trucks, wheel tractor scrapers, wheel dozers, landfill and soil compactors, machinery components, autonomous ready vehicles and solutions, and select work tools. Its Energy & Transportation segment offers reciprocating engine powered generator sets; reciprocating engines and integrated systems for the power generation, marine, oil, and gas industries; turbines, centrifugal gas compressors, and related services; remanufactured reciprocating engines and components; and diesel-electric locomotives and components, and other rail-related products. The company's Financial Products segment provides operating and finance leases, installment sale contracts, working capital loans, and wholesale financing; and insurance and risk management, as well as other equipment-related loans. Its All Other Operating segment offers filters and fluids, undercarriage, ground engaging tools, fluid transfer products, precision seals, and rubber sealing and connecting components; parts distribution; integrated logistics solutions; portfolio management; brand management and marketing strategy; and digital investments services. The company was formerly known as Caterpillar Tractor Co. The company was founded in 1925 and is headquartered in Deerfield, Illinois.",
    "website": "http://www.caterpillar.com",
    "zipcode": "60015"
  },
  "CATR.PA": {
    "city": "Deerfield",
    "country": "United States",
    "currency": "EUR",
    "exchange": "PAR",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Caterpillar Inc.",
    "market": "fr_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "CATERPILLAR INC",
    "state": "IL",
    "summary": "Caterpillar Inc. manufactures and sells construction and mining equipment, diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives worldwide. Its Construction Industries segment offers asphalt pavers, compactors, cold planers, motorgraders, pipelayers, road reclaimers, telehandlers, and utility vehicles; backhoe, compact track, multi-terrain, skid steer, and track-type loaders; forestry and wheel excavators; and site prep and track-type tractors. The company's Resource Industries segment provides electric rope and hydraulic shovels, draglines, rotary drills, hard rock vehicles, track-type tractors, mining trucks, longwall miners, wheel loaders, off-highway and articulated trucks, wheel tractor scrapers, wheel dozers, landfill and soil compactors, machinery components, autonomous ready vehicles and solutions, and select work tools. Its Energy & Transportation segment offers reciprocating engine powered generator sets; reciprocating engines and integrated systems for the power generation, marine, oil, and gas industries; turbines, centrifugal gas compressors, and related services; remanufactured reciprocating engines and components; and diesel-electric locomotives and components, and other rail-related products. The company's Financial Products segment provides operating and finance leases, installment sale contracts, working capital loans, and wholesale financing; and insurance and risk management, as well as other equipment-related loans. Its All Other Operating segment offers filters and fluids, undercarriage, ground engaging tools, fluid transfer products, precision seals, and rubber sealing and connecting components; parts distribution; integrated logistics solutions; portfolio management; brand management and marketing strategy; and digital investments services. The company was formerly known as Caterpillar Tractor Co. The company was founded in 1925 and is headquartered in Deerfield, Illinois.",
    "website": "http://www.caterpillar.com",
    "zipcode": "60015"
  },
  "CLEV": {
    "city": "Canton",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Concrete Leveling Systems, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "CONCRETE LEVELING SYSTEMS INC",
    "state": "OH",
    "summary": "Concrete Leveling Systems, Inc. manufactures and sells specialized equipment for end users in the concrete leveling industry. The company was founded in 2007 and is based in Canton, Ohio.",
    "website": "http://www.clsfabricating.com",
    "zipcode": "44718"
  },
  "CMCO": {
    "city": "Buffalo",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Columbus McKinnon Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Columbus McKinnon Corporation",
    "state": "NY",
    "summary": "Columbus McKinnon Corporation designs, manufactures, and markets intelligent motion solutions to ergonomically move, lift, position, and secure materials worldwide. It offers material handling equipment, such as electric and air hoists, manual hoists, trolleys, and winches; crane systems, including crane components, crane kits, enclosed track rail systems, mobile workstation and jib cranes, lift assists, and fall protection systems; rigging equipment comprising below-the-hook lifters, wire grips, hooks, shackles, chains, forestry and hand tools, lifting slings, lashing systems, tie-downs, and load binders; and power fluid transfer technology, such as rotary unions and swivel joints. The company also provides power and motion technology, including AC motor controls systems, AC line regenerative systems, actuators, automation and diagnostics, brakes, cable and festoon systems, collision avoidance systems, conductor bar systems, DC motor and magnet control systems, elevator drives, inverter duty motors, mining drives, pendant pushbutton stations, and wind inverters; sanitary and vertical elevation conveyor systems, as well as pallet system conveyors; and lifting solutions, such as legacy crane solutions, industrial products, and engineered products. It serves market verticals, including general industries, mobile industries, energy and utilities, process industries, industrial automation, construction and infrastructure, food processing, entertainment, life sciences, consumer packaged goods, and e-commerce/supply chain/warehousing. The company offers its products to end users directly, as well as through distributors, private companies, engineering procurement contractors, crane builders, integrators of factory production systems, and original equipment manufacturers. Columbus McKinnon Corporation was founded in 1875 and is headquartered in Buffalo, New York.",
    "website": "http://www.columbusmckinnon.com",
    "zipcode": "14068"
  },
  "DCO.DE": {
    "city": "Moline",
    "country": "United States",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Deere & Company",
    "market": "de_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "DEERE CO.  DL 1",
    "state": "IL",
    "summary": "Deere & Company, together with its subsidiaries, manufactures and distributes various equipment worldwide. The company operates through three segments: Agriculture and Turf, Construction and Forestry, and Financial Services. The Agriculture and Turf segment provides various agriculture and turf equipment, and related service parts, including large, medium, and utility tractors; tractor loaders; combines, cotton pickers, cotton strippers, and sugarcane harvesters; harvesting front-end equipment; sugarcane loaders and pull-behind scrapers; tillage, seeding, and application equipment comprising sprayers, nutrient management, and soil preparation machinery; self-propelled forage harvesters and attachments, balers, and mowers; riding lawn equipment, golf course equipment, utility vehicles, and commercial mowing equipment along with associated implements; integrated agricultural solutions and precision technologies; and other outdoor power products. The Construction and Forestry segment offers a range of machines and service parts used in construction, earthmoving, road building, material handling, and timber harvesting, including backhoe loaders; crawler dozers and loaders; four-wheel-drive loaders; excavators; motor graders; articulated dump trucks; landscape loaders; skid-steer loaders; milling machines; recyclers; slipform pavers; surface miners; asphalt pavers; compactors; tandem and static rollers; mobile crushers and screens; mobile and stationary asphalt plants; log skidders; feller bunchers; log loaders; log forwarders; and log harvesters and related logging attachments. The Financial Services segment finances sales and leases agriculture and turf, and construction and forestry equipment. It also offers wholesale financing to dealers of the foregoing equipment; and extended equipment warranties, as well as finances retail revolving charge accounts. Deere & Company was founded in 1837 and is headquartered in Moline, Illinois.",
    "website": "http://www.deere.com",
    "zipcode": "61265"
  },
  "DCO.F": {
    "city": "Moline",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Deere & Company",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "DEERE CO.  DL 1",
    "state": "IL",
    "summary": "Deere & Company, together with its subsidiaries, manufactures and distributes various equipment worldwide. The company operates through three segments: Agriculture and Turf, Construction and Forestry, and Financial Services. The Agriculture and Turf segment provides various agriculture and turf equipment, and related service parts, including large, medium, and utility tractors; tractor loaders; combines, cotton pickers, cotton strippers, and sugarcane harvesters; harvesting front-end equipment; sugarcane loaders and pull-behind scrapers; tillage, seeding, and application equipment comprising sprayers, nutrient management, and soil preparation machinery; self-propelled forage harvesters and attachments, balers, and mowers; riding lawn equipment, golf course equipment, utility vehicles, and commercial mowing equipment along with associated implements; integrated agricultural solutions and precision technologies; and other outdoor power products. The Construction and Forestry segment offers a range of machines and service parts used in construction, earthmoving, road building, material handling, and timber harvesting, including backhoe loaders; crawler dozers and loaders; four-wheel-drive loaders; excavators; motor graders; articulated dump trucks; landscape loaders; skid-steer loaders; milling machines; recyclers; slipform pavers; surface miners; asphalt pavers; compactors; tandem and static rollers; mobile crushers and screens; mobile and stationary asphalt plants; log skidders; feller bunchers; log loaders; log forwarders; and log harvesters and related logging attachments. The Financial Services segment finances sales and leases agriculture and turf, and construction and forestry equipment. It also offers wholesale financing to dealers of the foregoing equipment; and extended equipment warranties, as well as finances retail revolving charge accounts. Deere & Company was founded in 1837 and is headquartered in Moline, Illinois.",
    "website": "http://www.deere.com",
    "zipcode": "61265"
  },
  "DE": {
    "city": "Moline",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Deere & Company",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "Deere & Company",
    "state": "IL",
    "summary": "Deere & Company, together with its subsidiaries, manufactures and distributes various equipment worldwide. The company operates through three segments: Agriculture and Turf, Construction and Forestry, and Financial Services. The Agriculture and Turf segment provides various agriculture and turf equipment, and related service parts, including large, medium, and utility tractors; tractor loaders; combines, cotton pickers, cotton strippers, and sugarcane harvesters; harvesting front-end equipment; sugarcane loaders and pull-behind scrapers; tillage, seeding, and application equipment comprising sprayers, nutrient management, and soil preparation machinery; self-propelled forage harvesters and attachments, balers, and mowers; riding lawn equipment, golf course equipment, utility vehicles, and commercial mowing equipment along with associated implements; integrated agricultural solutions and precision technologies; and other outdoor power products. The Construction and Forestry segment offers a range of machines and service parts used in construction, earthmoving, road building, material handling, and timber harvesting, including backhoe loaders; crawler dozers and loaders; four-wheel-drive loaders; excavators; motor graders; articulated dump trucks; landscape loaders; skid-steer loaders; milling machines; recyclers; slipform pavers; surface miners; asphalt pavers; compactors; tandem and static rollers; mobile crushers and screens; mobile and stationary asphalt plants; log skidders; feller bunchers; log loaders; log forwarders; and log harvesters and related logging attachments. The Financial Services segment finances sales and leases agriculture and turf, and construction and forestry equipment. It also offers wholesale financing to dealers of the foregoing equipment; and extended equipment warranties, as well as finances retail revolving charge accounts. Deere & Company was founded in 1837 and is headquartered in Moline, Illinois.",
    "website": "http://www.deere.com",
    "zipcode": "61265"
  },
  "DE.MX": {
    "city": "Moline",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Deere & Company",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "DEERE & CO",
    "state": "IL",
    "summary": "Deere & Company, together with its subsidiaries, manufactures and distributes various equipment worldwide. The company operates through three segments: Agriculture and Turf, Construction and Forestry, and Financial Services. The Agriculture and Turf segment provides various agriculture and turf equipment, and related service parts, including large, medium, and utility tractors; tractor loaders; combines, cotton pickers, cotton strippers, and sugarcane harvesters; harvesting front-end equipment; sugarcane loaders and pull-behind scrapers; tillage, seeding, and application equipment comprising sprayers, nutrient management, and soil preparation machinery; self-propelled forage harvesters and attachments, balers, and mowers; riding lawn equipment, golf course equipment, utility vehicles, and commercial mowing equipment along with associated implements; integrated agricultural solutions and precision technologies; and other outdoor power products. The Construction and Forestry segment offers a range of machines and service parts used in construction, earthmoving, road building, material handling, and timber harvesting, including backhoe loaders; crawler dozers and loaders; four-wheel-drive loaders; excavators; motor graders; articulated dump trucks; landscape loaders; skid-steer loaders; milling machines; recyclers; slipform pavers; surface miners; asphalt pavers; compactors; tandem and static rollers; mobile crushers and screens; mobile and stationary asphalt plants; log skidders; feller bunchers; log loaders; log forwarders; and log harvesters and related logging attachments. The Financial Services segment finances sales and leases agriculture and turf, and construction and forestry equipment. It also offers wholesale financing to dealers of the foregoing equipment; and extended equipment warranties, as well as finances retail revolving charge accounts. Deere & Company was founded in 1837 and is headquartered in Moline, Illinois.",
    "website": "http://www.deere.com",
    "zipcode": "61265"
  },
  "DEEC34.SA": {
    "city": "Moline",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Deere & Company",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "DEERE CO    DRN",
    "state": "IL",
    "summary": "Deere & Company, together with its subsidiaries, manufactures and distributes various equipment worldwide. The company operates through three segments: Agriculture and Turf, Construction and Forestry, and Financial Services. The Agriculture and Turf segment provides various agriculture and turf equipment, and related service parts, including large, medium, and utility tractors; tractor loaders; combines, cotton pickers, cotton strippers, and sugarcane harvesters; harvesting front-end equipment; sugarcane loaders and pull-behind scrapers; tillage, seeding, and application equipment comprising sprayers, nutrient management, and soil preparation machinery; self-propelled forage harvesters and attachments, balers, and mowers; riding lawn equipment, golf course equipment, utility vehicles, and commercial mowing equipment along with associated implements; integrated agricultural solutions and precision technologies; and other outdoor power products. The Construction and Forestry segment offers a range of machines and service parts used in construction, earthmoving, road building, material handling, and timber harvesting, including backhoe loaders; crawler dozers and loaders; four-wheel-drive loaders; excavators; motor graders; articulated dump trucks; landscape loaders; skid-steer loaders; milling machines; recyclers; slipform pavers; surface miners; asphalt pavers; compactors; tandem and static rollers; mobile crushers and screens; mobile and stationary asphalt plants; log skidders; feller bunchers; log loaders; log forwarders; and log harvesters and related logging attachments. The Financial Services segment finances sales and leases agriculture and turf, and construction and forestry equipment. It also offers wholesale financing to dealers of the foregoing equipment; and extended equipment warranties, as well as finances retail revolving charge accounts. Deere & Company was founded in 1837 and is headquartered in Moline, Illinois.",
    "website": "http://www.deere.com",
    "zipcode": "61265"
  },
  "DEER.VI": {
    "city": "Moline",
    "country": "United States",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Deere & Company",
    "market": "at_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "DEERE & CO",
    "state": "IL",
    "summary": "Deere & Company, together with its subsidiaries, manufactures and distributes various equipment worldwide. The company operates through three segments: Agriculture and Turf, Construction and Forestry, and Financial Services. The Agriculture and Turf segment provides various agriculture and turf equipment, and related service parts, including large, medium, and utility tractors; tractor loaders; combines, cotton pickers, cotton strippers, and sugarcane harvesters; harvesting front-end equipment; sugarcane loaders and pull-behind scrapers; tillage, seeding, and application equipment comprising sprayers, nutrient management, and soil preparation machinery; self-propelled forage harvesters and attachments, balers, and mowers; riding lawn equipment, golf course equipment, utility vehicles, and commercial mowing equipment along with associated implements; integrated agricultural solutions and precision technologies; and other outdoor power products. The Construction and Forestry segment offers a range of machines and service parts used in construction, earthmoving, road building, material handling, and timber harvesting, including backhoe loaders; crawler dozers and loaders; four-wheel-drive loaders; excavators; motor graders; articulated dump trucks; landscape loaders; skid-steer loaders; milling machines; recyclers; slipform pavers; surface miners; asphalt pavers; compactors; tandem and static rollers; mobile crushers and screens; mobile and stationary asphalt plants; log skidders; feller bunchers; log loaders; log forwarders; and log harvesters and related logging attachments. The Financial Services segment finances sales and leases agriculture and turf, and construction and forestry equipment. It also offers wholesale financing to dealers of the foregoing equipment; and extended equipment warranties, as well as finances retail revolving charge accounts. Deere & Company was founded in 1837 and is headquartered in Moline, Illinois.",
    "website": "http://www.deere.com",
    "zipcode": "61265"
  },
  "GENC": {
    "city": "Orlando",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Gencor Industries, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Gencor Industries Inc.",
    "state": "FL",
    "summary": "Gencor Industries, Inc., together with its subsidiaries, designs, manufactures, and sells heavy machinery used in the production of highway construction materials and environmental control equipment. The company offers hot-mix asphalt plants to produce asphalt paving materials; related asphalt plant equipment, including hot-mix storage silos, fabric filtration systems, cold feed bins, and other plant components; and a range of mobile batch plants. It also provides combustion systems that transform solid, liquid, or gaseous fuels into usable energy, or burn multiple fuels in asphalt and aggregate drying industries; and combustion systems for rotary dryers, kilns, fume and liquid incinerators, and fuel heaters, as well as industrial incinerators. In addition, the company offers thermal fluid heat transfer systems that transfer heat for storage, heating, and pumping viscous materials, such as asphalt, chemicals, heavy oils, etc. in various industrial and petrochemical applications; specialty storage tanks for various industrial uses; and asphalt pavers under the Blaw-Knox brand. Gencor Industries, Inc. sells its products primarily to the highway construction industry through its sales representatives, and independent dealers and agents worldwide. The company was formerly known as Mechtron International Corporation and changed its name to Gencor Industries, Inc. in 1987. Gencor Industries, Inc. is based in Orlando, Florida.",
    "website": "http://www.gencor.com",
    "zipcode": "32810"
  },
  "GRNH": {
    "city": "Anaheim",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "GreenGro Technologies, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "GREENGRO TECHNOLOGIES INC",
    "state": "CA",
    "summary": "GreenGro Technologies, Inc. designs, manufactures, and markets green eco-friendly vertical cultivation systems in the United States. It offers flux lighting products, table stands, nutrient mixers, home units, cloning systems, and tea brewers, as well as provides consulting and management services to its clients. The company also markets lights, fans, hoods, automatic watering systems, and nutrients under the GreenGro brand. GreenGro Technologies, Inc. offers its products to consumers and industrial cultivators through its Website. The company has a strategic alliance with Solaris Power Cells; and an alliance agreement with Organna LLC for CBD ventures division. The company, formerly known as Authoriszor, Inc., was founded in 1996 and is based in Anaheim, California.",
    "website": "http://www.greengrotech.com",
    "zipcode": "92801"
  },
  "GRSO": {
    "city": "Denver",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Grow Solutions Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "GROW SOLUTIONS HLDGS INC",
    "state": "CO",
    "summary": "Grow Solutions Holdings, Inc. provides products and services to the regulated legal cannabis industry in the United States and internationally. Its operations focus on the retail sale and distribution of indoor and outdoor garden supplies and grow equipment, including for the legal growing of cannabis. The company also provides consulting services that include design and construction to approved and licensed legal cannabis operators, as well as assistance with licensure and related applications for legal cannabis operators. In addition, it designs and manufactures vaporizers, extraction presses, quartz accessories, and storage solutions which are used to sale in tobacco stores, smoke shops, and cannabis dispensaries. Grow Solutions Holdings, Inc. was founded in 2014 and is based in Denver, Colorado.",
    "website": "http://www.grsoinvest.com",
    "zipcode": "80203"
  },
  "GWPD": {
    "city": "Corona",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "GP Solutions, Inc.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "GP SOLUTIONS INC",
    "state": "CA",
    "summary": "GP Solutions, Inc. provides growing systems for growing specialty and leaf crops, and herbs. The company offers containers and stacks, as well as automation solutions to remotely monitor and manage grow room. It also provides services, including system lease or purchase; shipment, installation, and on-site training; custom planting and harvesting schedule; growing supplies, seeds, nutrients, packaging, branding, and repair materials; indoor cultivation pods to grow lettuce and other produce without the contamination; on-site visits; on-call and scheduled maintenance, cleanliness, and re-supply; classroom education and hands on training; remote monitoring and automated controls; technical assistance; and consulting and custom systems design. The company serves cannabis, non-profits, and urban farming markets. GP Solutions, Inc. was formerly known as Grow Pod Solutions. GP Solutions, Inc. was founded in 2012 and is based in Corona, California with an assembly plant in Corona, California.",
    "website": "http://www.growpodsolutions.com",
    "zipcode": "92879"
  },
  "HY": {
    "city": "Cleveland",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Hyster-Yale Materials Handling, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Hyster-Yale Materials Handling,",
    "state": "OH",
    "summary": "Hyster-Yale Materials Handling, Inc., through its subsidiaries, designs, engineers, manufactures, sells, and services a line of lift trucks, attachments, and aftermarket parts worldwide. It manufactures components, such as frames, masts, and transmissions; and assembles lift trucks. The company markets its products primarily under the Hyster and Yale brand names to independent Hyster and Yale retail dealerships. It also sells aftermarket parts under the Hyster and Yale, as well as UNISOURCE and PREMIER brands to Hyster and Yale dealers for the service of competitor lift trucks. In addition, the company produces and distributes attachments, forks, and lift tables under the Bolzoni, Auramo, and Meyer brand names; and designs and produces products in the port equipment and rough terrain forklift markets. Further, it designs, manufactures, and sells hydrogen fuel-cell stacks and engines. The company serves light and heavy manufacturers, trucking and automotive companies, rental companies, building materials and paper suppliers, lumber, metal products, warehouses, retailers, food distributors, container handling companies, and U.S. and non-U.S. governmental agencies. The company was incorporated in 1991 and is headquartered in Cleveland, Ohio.",
    "website": "http://www.hyster-yale.com",
    "zipcode": "44124-4069"
  },
  "HYEA.F": {
    "city": "Cleveland",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Hyster-Yale Materials Handling, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "HYSTER-YALE MAT.H.A DL-01",
    "state": "OH",
    "summary": "Hyster-Yale Materials Handling, Inc., through its subsidiaries, designs, engineers, manufactures, sells, and services a line of lift trucks, attachments, and aftermarket parts worldwide. It manufactures components, such as frames, masts, and transmissions; and assembles lift trucks. The company markets its products primarily under the Hyster and Yale brand names to independent Hyster and Yale retail dealerships. It also sells aftermarket parts under the Hyster and Yale, as well as UNISOURCE and PREMIER brands to Hyster and Yale dealers for the service of competitor lift trucks. In addition, the company produces and distributes attachments, forks, and lift tables under the Bolzoni, Auramo, and Meyer brand names; and designs and produces products in the port equipment and rough terrain forklift markets. Further, it designs, manufactures, and sells hydrogen fuel-cell stacks and engines. The company serves light and heavy manufacturers, trucking and automotive companies, rental companies, building materials and paper suppliers, lumber, metal products, warehouses, retailers, food distributors, container handling companies, and U.S. and non-U.S. governmental agencies. The company was incorporated in 1991 and is headquartered in Cleveland, Ohio.",
    "website": "http://www.hyster-yale.com",
    "zipcode": "44124-4069"
  },
  "HYFM": {
    "city": "Fairless Hills",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Hydrofarm Holdings Group, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "Hydrofarm Holdings Group, Inc.",
    "state": "PA",
    "summary": "Hydrofarm Holdings Group, Inc., together with its subsidiaries, engages in the manufacture and distribution of controlled environment agriculture (CEA) equipment and supplies in the United States and Canada. The company offers agricultural lighting devices, indoor climate control equipment, hydroponics and nutrients, and plant additives used to grow, farm, and cultivate cannabis, flowers, fruits, plants, vegetables, grains, and herbs in controlled environment; and distributes CEA equipment and supplies, which include grow light systems; heating, ventilation, and air conditioning systems; humidity and carbon dioxide monitors and controllers; water pumps, heaters, chillers, and filters; nutrient and fertilizer delivery systems; and various growing media made from soil, rock wool or coconut fiber. It also provides hydroponics systems, such as hydro systems, hydro trays and components, meters and solutions, pumps and irrigation systems, water filtration systems, pots and containers, and tents and tarps; atmospheric control equipment comprising controllers, monitors and timers, ventilation/air conditioning equipment, air purification equipment, and CO2 equipment; and nutrients and additives. The company offers its products under the PHOTOBIO, Phantom, Quantum, Digilux, Jump Start, Active Aqua, Active Air, Autopilot, Xtrasun, Active Eye, Agrobrite, GROW!T, Phat, and oxyClone brands. Hydrofarm Holdings Group, Inc. was founded in 1977 and is based in Fairless Hills, Pennsylvania.",
    "website": "http://www.hydrofarm.com",
    "zipcode": "19030"
  },
  "IHR.F": {
    "city": "Lisle",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Navistar International Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "NAVISTAR INTL  DL-,10",
    "state": "IL",
    "summary": "Navistar International Corporation, through its subsidiaries, manufactures and sells commercial trucks, diesel engines, school and commercial buses, and service parts for trucks and diesel engines worldwide. The company operates through four segments: Truck, Parts, Global Operations, and Financial Services. It manufactures and distributes Class 4 through 8 trucks and buses in the common carrier, private carrier, government, leasing, construction, energy/petroleum, and student and commercial transportation markets under the International and IC brands; and designs, engineers, and produces sheet metal components, including truck cabs and engines. The company also provides customers with proprietary products needed to support the International commercial truck, IC bus, and engine lines, as well as other product lines; and a selection of other standard truck, trailer, and engine aftermarket parts. In addition, it manufactures and distributes mid-range diesel engines, as well as provides customers with additional engine offerings in the agriculture, marine, genset, and light truck markets; sells engines to original equipment manufacturers (OEM) for various on-and-off-road applications; and offers contract manufacturing services under the MWM brand to OEMs for the assembly of their engines. Further, the company provides retail, wholesale, and lease financing of products of its trucks and parts, as well as financing for wholesale and retail accounts receivable. Additionally, it exports trucks, buses, and engines. The company markets its commercial products through an independent dealer network, as well as through retail outlets; and its reconditioned used trucks to owner-operators and fleet buyers through its network of used truck dealers. It operates approximately 1,052 outlets in the United States and Canada, and 89 outlets in Mexico. Navistar International Corporation was founded in 1902 and is headquartered in Lisle, Illinois.",
    "website": "http://www.navistar.com",
    "zipcode": "60532"
  },
  "LMF.F": {
    "city": "Omaha",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Lindsay Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "LINDSAY CORP.  DL 1",
    "state": "NE",
    "summary": "Lindsay Corporation, together with its subsidiaries, provides water management and road infrastructure products and services in the United States and internationally. The company operates in two segments, Irrigation and Infrastructure. The Irrigation segment manufactures and markets center pivot, lateral move irrigation systems, and irrigation controls under the Zimmatic brand; hose reel travelers under the Perrot and Greenfield brands; and chemical injection systems, variable rate irrigation systems, flow meters, weather stations, soil moisture sensors, and remote monitoring and control systems under the GrowSmart brand. It also offers repair and replacement parts for its irrigation systems and controls; global positioning system positioning and guidance, variable rate irrigation, wireless irrigation management, irrigation scheduling, and smartphone applications; and machine-to-machine communication technology solutions, data acquisition and management systems, and custom electronic equipment under the Elecsys brand. The Infrastructure segment provides Quickchange moveable barrier systems that help in highway reconstruction, paving and resurfacing, road widening, median and shoulder construction, and tunnels and bridge repairs; and re-directive and non-re-directive crash cushions, which are used to enhance highway safety at locations, such as toll booths, freeway off-ramps, medians and roadside barrier ends, bridge supports, utility poles, and other fixed roadway hazards. It also offers specialty barrier products; road marking and road safety equipment; and railroad signals and structures, and diameter steel tubing products, as well as outsourced manufacturing and production services for other companies. The company serves departments of transportation, municipal transportation road agencies, roadway contractors, subcontractors, distributors, and dealers. Lindsay Corporation was founded in 1954 and is headquartered in Omaha, Nebraska.",
    "website": "http://www.lindsay.com",
    "zipcode": "68022"
  },
  "LNN": {
    "city": "Omaha",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Lindsay Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Lindsay Corporation",
    "state": "NE",
    "summary": "Lindsay Corporation, together with its subsidiaries, provides water management and road infrastructure products and services in the United States and internationally. The company operates in two segments, Irrigation and Infrastructure. The Irrigation segment manufactures and markets center pivot, lateral move irrigation systems, and irrigation controls under the Zimmatic brand; hose reel travelers under the Perrot and Greenfield brands; and chemical injection systems, variable rate irrigation systems, flow meters, weather stations, soil moisture sensors, and remote monitoring and control systems under the GrowSmart brand. It also offers repair and replacement parts for its irrigation systems and controls; global positioning system positioning and guidance, variable rate irrigation, wireless irrigation management, irrigation scheduling, and smartphone applications; and machine-to-machine communication technology solutions, data acquisition and management systems, and custom electronic equipment under the Elecsys brand. The Infrastructure segment provides Quickchange moveable barrier systems that help in highway reconstruction, paving and resurfacing, road widening, median and shoulder construction, and tunnels and bridge repairs; and re-directive and non-re-directive crash cushions, which are used to enhance highway safety at locations, such as toll booths, freeway off-ramps, medians and roadside barrier ends, bridge supports, utility poles, and other fixed roadway hazards. It also offers specialty barrier products; road marking and road safety equipment; and railroad signals and structures, and diameter steel tubing products, as well as outsourced manufacturing and production services for other companies. The company serves departments of transportation, municipal transportation road agencies, roadway contractors, subcontractors, distributors, and dealers. Lindsay Corporation was founded in 1954 and is headquartered in Omaha, Nebraska.",
    "website": "http://www.lindsay.com",
    "zipcode": "68022"
  },
  "MNGN.F": {
    "city": "Milwaukee",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "The Manitowoc Company, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "MANITOWOC CO. NEW  DL-,01",
    "state": "WI",
    "summary": "The Manitowoc Company, Inc. provides engineered lifting solutions in the Americas, Europe, Africa, the Middle East, and the Asia Pacific. It designs, manufactures, and distributes crawler-mounted lattice-boom cranes under the Manitowoc brand; a line of top-slewing and self-erecting tower cranes under the Potain brand; mobile hydraulic cranes under the Grove, Shuttlelift, and National Crane brands; and hydraulic boom trucks under the National Crane brand. The company also provides crane product parts and services; and crane rebuilding, remanufacturing, and training services. Its crane products are used in various applications, including energy production/distribution and utilities; petrochemical and industrial projects; infrastructure, such as road, bridge, and airport construction; and commercial and high-rise residential construction. The company serves a range of customers, including dealers, rental companies, contractors, and government entities in the petrochemical, industrial, commercial construction, power and utilities, infrastructure, and residential construction end markets. The Manitowoc Company, Inc. was founded in 1902 and is headquartered in Milwaukee, Wisconsin.",
    "website": "http://www.manitowoc.com",
    "zipcode": "53224"
  },
  "MNTX": {
    "city": "Bridgeview",
    "country": "United States",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Manitex International, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Manitex International, Inc.",
    "state": "IL",
    "summary": "Manitex International, Inc. provides engineered lifting solutions in the United States, Italy, Canada, France, Chile, and internationally. It designs, manufactures, and distributes products that are used in various industries. The company also offers boom trucks, truck cranes, and sign cranes products primarily for use in industrial projects, energy exploration, and infrastructure development comprising roads, bridges, and commercial construction. In addition, it manufactures and sells rough terrain cranes and material handling products for construction, municipality, and railroad industries; truck mounted hydraulic knuckle boom cranes; and shipping articulated cranes. The company provides its products under the Manitex, PM, MAC, PM-Tadano, Oil & Steel, Badger, and Valla brands. It also sells its products through dealers and rental distribution channel. The company was formerly known as Veri-Tek International, Corp. and changed its name to Manitex International, Inc. in May 2008. Manitex International, Inc. was founded in 1993 and is headquartered in Bridgeview, Illinois.",
    "website": "http://www.manitexinternational.com",
    "zipcode": "60455"
  },
  "MTW": {
    "city": "Milwaukee",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "The Manitowoc Company, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Manitowoc Company, Inc. (The)",
    "state": "WI",
    "summary": "The Manitowoc Company, Inc. provides engineered lifting solutions in the Americas, Europe, Africa, the Middle East, and the Asia Pacific. It designs, manufactures, and distributes crawler-mounted lattice-boom cranes under the Manitowoc brand; a line of top-slewing and self-erecting tower cranes under the Potain brand; mobile hydraulic cranes under the Grove, Shuttlelift, and National Crane brands; and hydraulic boom trucks under the National Crane brand. The company also provides crane product parts and services; and crane rebuilding, remanufacturing, and training services. Its crane products are used in various applications, including energy production/distribution and utilities; petrochemical and industrial projects; infrastructure, such as road, bridge, and airport construction; and commercial and high-rise residential construction. The company serves a range of customers, including dealers, rental companies, contractors, and government entities in the petrochemical, industrial, commercial construction, power and utilities, infrastructure, and residential construction end markets. The Manitowoc Company, Inc. was founded in 1902 and is headquartered in Milwaukee, Wisconsin.",
    "website": "http://www.manitowoc.com",
    "zipcode": "53224"
  },
  "NAV": {
    "city": "Lisle",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Navistar International Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "Navistar International Corporat",
    "state": "IL",
    "summary": "Navistar International Corporation, through its subsidiaries, manufactures and sells commercial trucks, diesel engines, school and commercial buses, and service parts for trucks and diesel engines worldwide. The company operates through four segments: Truck, Parts, Global Operations, and Financial Services. It manufactures and distributes Class 4 through 8 trucks and buses in the common carrier, private carrier, government, leasing, construction, energy/petroleum, and student and commercial transportation markets under the International and IC brands; and designs, engineers, and produces sheet metal components, including truck cabs and engines. The company also provides customers with proprietary products needed to support the International commercial truck, IC bus, and engine lines, as well as other product lines; and a selection of other standard truck, trailer, and engine aftermarket parts. In addition, it manufactures and distributes mid-range diesel engines, as well as provides customers with additional engine offerings in the agriculture, marine, genset, and light truck markets; sells engines to original equipment manufacturers (OEM) for various on-and-off-road applications; and offers contract manufacturing services under the MWM brand to OEMs for the assembly of their engines. Further, the company provides retail, wholesale, and lease financing of products of its trucks and parts, as well as financing for wholesale and retail accounts receivable. Additionally, it exports trucks, buses, and engines. The company markets its commercial products through an independent dealer network, as well as through retail outlets; and its reconditioned used trucks to owner-operators and fleet buyers through its network of used truck dealers. It operates approximately 1,052 outlets in the United States and Canada, and 89 outlets in Mexico. Navistar International Corporation was founded in 1902 and is headquartered in Lisle, Illinois.",
    "website": "http://www.navistar.com",
    "zipcode": "60532"
  },
  "OK3.F": {
    "city": "Oshkosh",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Oshkosh Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "OSHKOSH CORP.  DL -,01",
    "state": "WI",
    "summary": "Oshkosh Corporation designs, manufactures, and markets specialty vehicles and vehicle bodies worldwide. The company's Access Equipment segment provides aerial work platforms and telehandlers for use in various construction, industrial, institutional, and general maintenance applications. This segment also offers rental fleet loans and leases, and floor plan and retail financing through third-party funding arrangements; towing and recovery equipment; carriers and wreckers; equipment installation services; and chassis and service parts sales. Its Defense segment provides heavy, medium, and light tactical wheeled vehicles and related services for the department of defense. The company's Fire & Emergency segment offers custom and commercial firefighting vehicles and equipment; and commercial fire apparatus and emergency vehicles, such as pumpers, aerial platform, ladder and tiller trucks, tankers, rescue vehicles, wild land rough terrain response vehicles, mobile command and control centers, bomb squad vehicles, hazardous materials control vehicles, and other emergency response vehicles. This segment also provides aircraft rescue and firefighting, snow removal, and broadcast vehicles, as well as command trucks, and military simulator shelters and trailers. Its Commercial segment offers front-and rear-discharge concrete mixers for the concrete ready-mix industry; refuse collection vehicles and related components to commercial and municipal waste haulers; and field service vehicles and truck-mounted cranes for the construction, equipment dealer, building supply, utility, tire service, railroad, and mining industries. Oshkosh Corporation provides its products through direct sales representatives, dealers, and distributors. The company was formerly known as Oshkosh Truck Corporation and changed its name to Oshkosh Corporation in February 2008. Oshkosh Corporation was founded in 1917 and is headquartered in Oshkosh, Wisconsin.",
    "website": "http://www.oshkoshcorp.com",
    "zipcode": "54902"
  },
  "OSK": {
    "city": "Oshkosh",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Oshkosh Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "Oshkosh Corporation (Holding Co",
    "state": "WI",
    "summary": "Oshkosh Corporation designs, manufactures, and markets specialty vehicles and vehicle bodies worldwide. The company's Access Equipment segment provides aerial work platforms and telehandlers for use in various construction, industrial, institutional, and general maintenance applications. This segment also offers rental fleet loans and leases, and floor plan and retail financing through third-party funding arrangements; towing and recovery equipment; carriers and wreckers; equipment installation services; and chassis and service parts sales. Its Defense segment provides heavy, medium, and light tactical wheeled vehicles and related services for the department of defense. The company's Fire & Emergency segment offers custom and commercial firefighting vehicles and equipment; and commercial fire apparatus and emergency vehicles, such as pumpers, aerial platform, ladder and tiller trucks, tankers, rescue vehicles, wild land rough terrain response vehicles, mobile command and control centers, bomb squad vehicles, hazardous materials control vehicles, and other emergency response vehicles. This segment also provides aircraft rescue and firefighting, snow removal, and broadcast vehicles, as well as command trucks, and military simulator shelters and trailers. Its Commercial segment offers front-and rear-discharge concrete mixers for the concrete ready-mix industry; refuse collection vehicles and related components to commercial and municipal waste haulers; and field service vehicles and truck-mounted cranes for the construction, equipment dealer, building supply, utility, tire service, railroad, and mining industries. Oshkosh Corporation provides its products through direct sales representatives, dealers, and distributors. The company was formerly known as Oshkosh Truck Corporation and changed its name to Oshkosh Corporation in February 2008. Oshkosh Corporation was founded in 1917 and is headquartered in Oshkosh, Wisconsin.",
    "website": "http://www.oshkoshcorp.com",
    "zipcode": "54902"
  },
  "OSRS": {
    "city": "Baldwin",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Osiris Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "OSIRIS CORPORATION",
    "state": "NY",
    "summary": "Osiris Corporation, through its subsidiaries, manufactures and distributes industrial and construction equipment. The company offers a line of skid steer and mini skid steer loaders, rough terrain forklifts, and telescopic handlers, as well as attachments, mortar/plaster mixers, mortar boxes, buggies, mobile screening plants, and six models of mini excavators. It distributes its products through a network of distributors, wholesalers, and private label partnerships, as well as through direct sales offices. In addition, it manufactures specialty industrial and construction products, a line of potato harvesting and handling equipment, fluid power components, pneumatic and hydraulic systems, spiral wound metal gaskets, and packing material. It offers its products to customers in the pulp and paper, aluminum plant, forestry equipment, automotive, oil and gas, heavy equipment, hydraulics, injection molding, and power generation industries. The company was formerly known as Thomas Equipment, Inc. and changed its name to Osiris Corporation in January 2008. Osiris Corporation was founded in 1943 and is based in Baldwin, New York. Osiris Corporation is a former subsidiary of McCain Foods Limited.",
    "website": "http://www.thomasloaders.com",
    "zipcode": "11510"
  },
  "P1AC34.SA": {
    "city": "Bellevue",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "PACCAR Inc",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "PACCAR INC  DRN",
    "state": "WA",
    "summary": "PACCAR Inc designs, manufactures, and distributes light, medium, and heavy-duty commercial trucks in the United States, Europe, and internationally. It operates through three segments: Truck, Parts, and Financial Services. The Truck segment designs, manufactures, and distributes trucks for the over-the-road and off-highway hauling of commercial and consumer goods. It sells its trucks through a network of independent dealers under the Kenworth, Peterbilt, and DAF nameplates. The Parts segment distributes aftermarket parts for trucks and related commercial vehicles. The Financial Services segment conducts full-service leasing operations under the PacLease trade name. It also provides equipment financing and administrative support services for its franchisees; retail loan and leasing services for small, medium, and large commercial trucking companies, as well as independent owners/operators and other businesses; and truck inventory financing services to independent dealers. In addition, this segment offers loans and leases directly to customers for the acquisition of trucks and related equipment. The company also manufactures and markets industrial winches under the Braden, Carco, and Gearmatic nameplates. PACCAR Inc was founded in 1905 and is headquartered in Bellevue, Washington.",
    "website": "http://www.paccar.com",
    "zipcode": "98004"
  },
  "PAE.F": {
    "city": "Bellevue",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "PACCAR Inc",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "PACCAR INC.  DL 1",
    "state": "WA",
    "summary": "PACCAR Inc designs, manufactures, and distributes light, medium, and heavy-duty commercial trucks in the United States, Europe, and internationally. It operates through three segments: Truck, Parts, and Financial Services. The Truck segment designs, manufactures, and distributes trucks for the over-the-road and off-highway hauling of commercial and consumer goods. It sells its trucks through a network of independent dealers under the Kenworth, Peterbilt, and DAF nameplates. The Parts segment distributes aftermarket parts for trucks and related commercial vehicles. The Financial Services segment conducts full-service leasing operations under the PacLease trade name. It also provides equipment financing and administrative support services for its franchisees; retail loan and leasing services for small, medium, and large commercial trucking companies, as well as independent owners/operators and other businesses; and truck inventory financing services to independent dealers. In addition, this segment offers loans and leases directly to customers for the acquisition of trucks and related equipment. The company also manufactures and markets industrial winches under the Braden, Carco, and Gearmatic nameplates. PACCAR Inc was founded in 1905 and is headquartered in Bellevue, Washington.",
    "website": "http://www.paccar.com",
    "zipcode": "98004"
  },
  "PCAR": {
    "city": "Bellevue",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "PACCAR Inc",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "PACCAR Inc.",
    "state": "WA",
    "summary": "PACCAR Inc designs, manufactures, and distributes light, medium, and heavy-duty commercial trucks in the United States, Europe, and internationally. It operates through three segments: Truck, Parts, and Financial Services. The Truck segment designs, manufactures, and distributes trucks for the over-the-road and off-highway hauling of commercial and consumer goods. It sells its trucks through a network of independent dealers under the Kenworth, Peterbilt, and DAF nameplates. The Parts segment distributes aftermarket parts for trucks and related commercial vehicles. The Financial Services segment conducts full-service leasing operations under the PacLease trade name. It also provides equipment financing and administrative support services for its franchisees; retail loan and leasing services for small, medium, and large commercial trucking companies, as well as independent owners/operators and other businesses; and truck inventory financing services to independent dealers. In addition, this segment offers loans and leases directly to customers for the acquisition of trucks and related equipment. The company also manufactures and markets industrial winches under the Braden, Carco, and Gearmatic nameplates. PACCAR Inc was founded in 1905 and is headquartered in Bellevue, Washington.",
    "website": "http://www.paccar.com",
    "zipcode": "98004"
  },
  "PCAR.VI": {
    "city": "Bellevue",
    "country": "United States",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "PACCAR Inc",
    "market": "at_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "PACCAR INC",
    "state": "WA",
    "summary": "PACCAR Inc designs, manufactures, and distributes light, medium, and heavy-duty commercial trucks in the United States, Europe, and internationally. It operates through three segments: Truck, Parts, and Financial Services. The Truck segment designs, manufactures, and distributes trucks for the over-the-road and off-highway hauling of commercial and consumer goods. It sells its trucks through a network of independent dealers under the Kenworth, Peterbilt, and DAF nameplates. The Parts segment distributes aftermarket parts for trucks and related commercial vehicles. The Financial Services segment conducts full-service leasing operations under the PacLease trade name. It also provides equipment financing and administrative support services for its franchisees; retail loan and leasing services for small, medium, and large commercial trucking companies, as well as independent owners/operators and other businesses; and truck inventory financing services to independent dealers. In addition, this segment offers loans and leases directly to customers for the acquisition of trucks and related equipment. The company also manufactures and markets industrial winches under the Braden, Carco, and Gearmatic nameplates. PACCAR Inc was founded in 1905 and is headquartered in Bellevue, Washington.",
    "website": "http://www.paccar.com",
    "zipcode": "98004"
  },
  "REVG": {
    "city": "Brookfield",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "REV Group, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "REV Group, Inc.",
    "state": "WI",
    "summary": "REV Group, Inc. designs, manufactures, and distributes specialty vehicles in the United States, Canada, Europe, Africa, the Middle East, the Latin America, the Caribbean, and internationally. It operates through three segments: Fire & Emergency, Commercial, and Recreation. The Fire & Emergency segment offers various fire apparatus and ambulance products for municipalities and private contractors. This segment sells its products primarily under the Emergency One, Kovatch Mobile Equipment, and Ferrara brands; and ambulances under the American Emergency Vehicles, Horton Emergency Vehicles, Leader Emergency Vehicles, Marque, McCoy Miller, Road Rescue, Wheeled Coach, and Frontline brands. The Commercial segment provides type A school buses, transit buses, terminal trucks, and sweepers. The segment sells its products directly, as well as through dealers primarily under the Collins Bus, Capacity, ENC, and Lay-Mor brands to governmental bodies, including municipalities, such as fire departments, school districts, hospitals, and the U.S. federal government. The Recreation segment offers motorized and towable recreational vehicles, and luxury coaches. This segment sells its vehicles under the American Coach, Fleetwood RV, Holiday Rambler, Renegade RV, Midwest, and Lance brands through dealers. The company also provides aftermarket parts and services. The company was formerly known as Allied Specialty Vehicles, Inc. and changed its name to REV Group, Inc. in November 2015. REV Group, Inc. is based in Brookfield, Wisconsin.",
    "website": "http://www.revgroup.com",
    "zipcode": "53005"
  },
  "SET.F": {
    "city": "Fort Myers",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Somero Enterprises, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "SOMERO ENTER.REGS DL-,001",
    "state": "FL",
    "summary": "Somero Enterprises, Inc., together with its subsidiaries, designs, assembles, remanufactures, sells, and distributes concrete leveling, contouring, and placing equipment worldwide. It also offers related parts and accessories, as well as provides training services. The company's proprietary products include the CopperHead, Mini Screed C, S-485 Laser Screed, S-940 Laser Screed, S-22EZ Advanced Laser Screed, S-15R Laser Screed, S-10A Laser Screed, S-840 Laser Screed, S-158C Laser Screed, and S-22E Laser Screed machines, as well as the 3-D Profiler System software and the Somero Floor Levelness System. It also provides Somero Sky Screed 25, a Laser Screed machine, which allows screeding on structural high-rise and slab-on grade applications; Somero line dragon line-pulling and -placing system; STS-11M topping spreaders; SiteShape, a software package for real three-dimensional grade shaping; and factory certified remanufactured equipment. The company's equipment is used to place and screed the concrete slab in various building types, including floors in multi-story buildings; and used in the construction of warehouses, assembly plants, exterior paving and parking structures, retail centers, and other commercial construction projects. The company markets and sells its products primarily to small, medium, and large concrete contractors, as well as to self-performing general contractors. Somero Enterprises, Inc. was founded in 1985 and is headquartered in Fort Myers, Florida.",
    "website": "http://www.somero.com",
    "zipcode": "33913"
  },
  "SHYF": {
    "city": "Novi",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "The Shyft Group, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "The Shyft Group, Inc.",
    "state": "MI",
    "summary": "The Shyft Group, Inc. manufactures and assembles specialty vehicles for the commercial vehicle and recreational vehicle industries in the United States and internationally. The company's Fleet Vehicles and Services segment manufactures and sells commercial vehicles that are used in the e-commerce/last mile/parcel delivery, beverage and grocery delivery, laundry and linen, mobile retail, and trades and construction industries. This segment markets its commercial vehicles under the Aeromaster, Velocity, Trademaster, and Utilivan brand names; and vocation-specific equipment upfit services under the Utilimaster Upfit Services and Strobes-R-Us brands. It also installs specialty interior and exterior up-fit equipment for walk-in vans, truck bodies, and passenger vans under the Specialty Upfit name; provides aftermarket support, including parts sales and field services; and parts and accessories for its walk-in vans and truck bodies. The company's Specialty Vehicle segment engages in the engineering and manufacture of luxury class A diesel motor home chassis; manufacture and assemble of truck body options for various trades, service truck bodies, stake body trucks, contractor trucks, and dump bed trucks under the Royal Truck Body and DuraMag go-to-market brand names; and provision of chassis and complete vehicle assembly services for other specialty chassis and vehicles. This segment also offers assembly services for Isuzu N-gas and F-series chassis; and parts and accessories for motorhome and specialty chassis, as well as related maintenance and repair services. The company sells its products to commercial users, original equipment manufacturers, dealers, individuals, municipalities, and other government entities. The company was formerly known as Spartan Motors, Inc. and changed its name to The Shyft Group, Inc. in June 2020. The Shyft Group, Inc. was incorporated in 1975 and is headquartered in Novi, Michigan.",
    "website": "http://www.theshyftgroup.com",
    "zipcode": "48375"
  },
  "SOM.L": {
    "city": "Fort Myers",
    "country": "United States",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Somero Enterprises, Inc.",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "SOMERO ENTERPRISE INC. COM STK ",
    "state": "FL",
    "summary": "Somero Enterprises, Inc., together with its subsidiaries, designs, assembles, remanufactures, sells, and distributes concrete leveling, contouring, and placing equipment worldwide. It also offers related parts and accessories, as well as provides training services. The company's proprietary products include the CopperHead, Mini Screed C, S-485 Laser Screed, S-940 Laser Screed, S-22EZ Advanced Laser Screed, S-15R Laser Screed, S-10A Laser Screed, S-840 Laser Screed, S-158C Laser Screed, and S-22E Laser Screed machines, as well as the 3-D Profiler System software and the Somero Floor Levelness System. It also provides Somero Sky Screed 25, a Laser Screed machine, which allows screeding on structural high-rise and slab-on grade applications; Somero line dragon line-pulling and -placing system; STS-11M topping spreaders; SiteShape, a software package for real three-dimensional grade shaping; and factory certified remanufactured equipment. The company's equipment is used to place and screed the concrete slab in various building types, including floors in multi-story buildings; and used in the construction of warehouses, assembly plants, exterior paving and parking structures, retail centers, and other commercial construction projects. The company markets and sells its products primarily to small, medium, and large concrete contractors, as well as to self-performing general contractors. Somero Enterprises, Inc. was founded in 1985 and is headquartered in Fort Myers, Florida.",
    "website": "http://www.somero.com",
    "zipcode": "33913"
  },
  "SRNA": {
    "city": "Boulder",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Surna Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SURNA INC",
    "state": "CO",
    "summary": "Surna Inc. designs, engineers, and sells environmental control and other technologies for controlled environment agriculture to state- and provincial-regulated cannabis cultivators in the United States, Canada, and internationally. Its products and services include liquid-based process cooling systems and other climate control systems; air handling equipment and systems; a full-service engineering package for designing and engineering commercial scale thermodynamic systems for cannabis cultivation facilities; and automation and control devices, systems, and technologies used for environmental, lighting, and climate control. The company also offers mechanical, electrical, and plumbing engineering services; develops and sells a four-pipe environmental control system with Surna branded fan coil units and custom air handlers; and develops destratification fans, as well as provides facility retrofit services. Surna Inc. was incorporated in 2009 and is headquartered in Boulder, Colorado.",
    "website": "http://www.surna.com",
    "zipcode": "80301"
  },
  "TEX": {
    "city": "Norwalk",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Terex Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "Terex Corporation",
    "state": "CT",
    "summary": "Terex Corporation manufactures and sells aerial work platforms and materials processing machinery worldwide. The company operates in two segments, Aerial Work Platforms (AWP) and Materials Processing (MP). The AWP segment designs, manufactures, services, and markets aerial work platform equipment, utility equipment, and telehandlers principally under the Terex and Genie brand names. Its products include portable material lifts, portable aerial work platforms, trailer-mounted articulating booms, self-propelled articulating and telescopic booms, scissor lifts, utility equipment, and telehandlers, as well as their related components and replacement parts. The MP segment provides materials processing and specialty equipment, including crushers, washing systems, screens, apron feeders, material handlers, pick and carry cranes, rough terrain cranes, tower cranes, wood processing, biomass and recycling equipment, concrete mixer trucks and concrete pavers, conveyors, and their related components and replacement parts principally under the Terex, Powerscreen, Fuchs, EvoQuip, Canica, Cedarapids, CBI, Simplicity, Franna, Terex Ecotec, Terex Finlay, Terex Washing Systems, Terex MPS, Terex Jaques, Terex Advance, Terex Conveying Systems, ProStacktm, and Terex Bid-Well brand names and business lines. Its products are used in construction, infrastructure, and recycling projects; various quarrying and mining, and material handling applications; and maintenance applications to lift equipment or material, as well as landscaping and biomass production industries. In addition, the company provides financing solutions to assist customers in the rental, leasing, and acquisition of its products. Terex Corporation was incorporated in 1986 and is based in Norwalk, Connecticut.",
    "website": "http://www.terex.com",
    "zipcode": "06850"
  },
  "TURV": {
    "city": "Aurora",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Two Rivers Water & Farming Company",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "TWO RIVERS WATER & FARMING COMP",
    "state": "CO",
    "summary": "Two Rivers Water & Farming Company owns a portfolio of water rights in the Arkansas River Basin in southeastern Colorado. It operates through Greenhouse and Water segments. As of December 31, 2018, the company managed a total of 6,265 acres of land. It also develops and leases greenhouses and warehouses. The company was formerly known as Two Rivers Water Company and changed its name to Two Rivers Water & Farming Company in December 2012. Two Rivers Water & Farming Company was founded in 2002 and is headquartered in Aurora, Colorado.",
    "website": "http://www.2riverswater.com",
    "zipcode": "80014"
  },
  "TWI": {
    "city": "Quincy",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Titan International, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Titan International, Inc. (DE)",
    "state": "IL",
    "summary": "Titan International, Inc., together with its subsidiaries, manufactures and sells wheels, tires, and undercarriage systems and components for off-highway vehicles in North America, Europe, Latin America, the Commonwealth of Independent States region, the Middle East, Africa, Russia, and internationally. The company operates in three segments: Agricultural, Earthmoving/Construction, and Consumer. It offers rims, wheels, tires, and undercarriage systems and components for various agricultural equipment, including tractors, combines, skidders, plows, planters, and irrigation equipment. The company also offers rims, wheels, tires, and undercarriage systems and components for off-the-road earthmoving, mining, military, construction, and forestry equipment, including skid steers, aerial lifts, cranes, graders and levelers, scrapers, self-propelled shovel loaders, articulated dump trucks, load transporters, haul trucks, backhoe loaders, crawler tractors, lattice cranes, shovels, and hydraulic excavators. In addition, it provides bias and light truck tires; and products for ATVs, turf, and golf cart applications, as well as specialty and train brakes. The company sells its products directly to original equipment manufacturers, as well as to the aftermarket through independent distributors, equipment dealers, and own distribution centers. Titan International, Inc. was founded in 1890 and is headquartered in Quincy, Illinois.",
    "website": "http://www.titan-intl.com",
    "zipcode": "62301"
  },
  "TXG.F": {
    "city": "Norwalk",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Terex Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "TEREX CORP.  DL-,01",
    "state": "CT",
    "summary": "Terex Corporation manufactures and sells aerial work platforms and materials processing machinery worldwide. The company operates in two segments, Aerial Work Platforms (AWP) and Materials Processing (MP). The AWP segment designs, manufactures, services, and markets aerial work platform equipment, utility equipment, and telehandlers principally under the Terex and Genie brand names. Its products include portable material lifts, portable aerial work platforms, trailer-mounted articulating booms, self-propelled articulating and telescopic booms, scissor lifts, utility equipment, and telehandlers, as well as their related components and replacement parts. The MP segment provides materials processing and specialty equipment, including crushers, washing systems, screens, apron feeders, material handlers, pick and carry cranes, rough terrain cranes, tower cranes, wood processing, biomass and recycling equipment, concrete mixer trucks and concrete pavers, conveyors, and their related components and replacement parts principally under the Terex, Powerscreen, Fuchs, EvoQuip, Canica, Cedarapids, CBI, Simplicity, Franna, Terex Ecotec, Terex Finlay, Terex Washing Systems, Terex MPS, Terex Jaques, Terex Advance, Terex Conveying Systems, ProStacktm, and Terex Bid-Well brand names and business lines. Its products are used in construction, infrastructure, and recycling projects; various quarrying and mining, and material handling applications; and maintenance applications to lift equipment or material, as well as landscaping and biomass production industries. In addition, the company provides financing solutions to assist customers in the rental, leasing, and acquisition of its products. Terex Corporation was incorporated in 1986 and is based in Norwalk, Connecticut.",
    "website": "http://www.terex.com",
    "zipcode": "06850"
  },
  "TYTN": {
    "city": "Kalama",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Tytan Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "TYTAN HLDGS INC",
    "state": "WA",
    "summary": "Tytan Holdings, Inc., through its subsidiary, Tytan International, Inc., engages in the manufacture of tractors and crawlers in China. The company sells its products in the United States. It also has various patents in the United States on the design and construction of implements used with the tractors and crawlers. The company was formerly known as Ault Glazer & Co., Inc. and changed its name to Tytan Holdings, Inc. in October 2009. Tytan Holdings, Inc. was founded in 1975 and is headquartered in Kalama, Washington.",
    "website": "http://www.tytantractor.com",
    "zipcode": "98625"
  },
  "TZ4.F": {
    "city": "Quincy",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Titan International, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "TITAN INTL INC.  DL-,01",
    "state": "IL",
    "summary": "Titan International, Inc., together with its subsidiaries, manufactures and sells wheels, tires, and undercarriage systems and components for off-highway vehicles in North America, Europe, Latin America, the Commonwealth of Independent States region, the Middle East, Africa, Russia, and internationally. The company operates in three segments: Agricultural, Earthmoving/Construction, and Consumer. It offers rims, wheels, tires, and undercarriage systems and components for various agricultural equipment, including tractors, combines, skidders, plows, planters, and irrigation equipment. The company also offers rims, wheels, tires, and undercarriage systems and components for off-the-road earthmoving, mining, military, construction, and forestry equipment, including skid steers, aerial lifts, cranes, graders and levelers, scrapers, self-propelled shovel loaders, articulated dump trucks, load transporters, haul trucks, backhoe loaders, crawler tractors, lattice cranes, shovels, and hydraulic excavators. In addition, it provides bias and light truck tires; and products for ATVs, turf, and golf cart applications, as well as specialty and train brakes. The company sells its products directly to original equipment manufacturers, as well as to the aftermarket through independent distributors, equipment dealers, and own distribution centers. Titan International, Inc. was founded in 1890 and is headquartered in Quincy, Illinois.",
    "website": "http://www.titan-intl.com",
    "zipcode": "62301"
  },
  "UGRO": {
    "city": "Lafayette",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "urban-gro, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "urban-gro, Inc.",
    "state": "CO",
    "summary": "urban-gro, Inc. operates as an engineering design services company that integrates complex environmental equipment systems to create indoor cultivation facilities for the commercial horticulture market the United States, Canada, and Europe. The company offers engineering and design services, including cultivation space programming, integrated cultivation design, and full-facility mechanical, electrical, and plumbing engineering; training services ranging from equipment standard operating procedure libraries to staff training sessions; facility and equipment commissioning services; program overview and pricing; and related-party hardware and software platforms. It also offers an integrated suite of cultivation equipment systems and crop management products, which include environmental controls, fertigation and irrigation distribution, water treatment and wastewater reclamation systems, and purpose-built heating, ventilation, and air conditioning equipment systems; commercial horticulture lighting solutions; rolling and automated container benching systems; specialty fans; and microbial mitigation and odor reduction systems. The company was founded in 2014 and is based in Lafayette, Colorado.",
    "website": "http://www.urban-gro.com",
    "zipcode": "80026"
  },
  "VC3.F": {
    "city": "Buffalo",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Columbus McKinnon Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "COLUMBUS MCKINNON  DL-,01",
    "state": "NY",
    "summary": "Columbus McKinnon Corporation designs, manufactures, and markets intelligent motion solutions to ergonomically move, lift, position, and secure materials worldwide. It offers material handling equipment, such as electric and air hoists, manual hoists, trolleys, and winches; crane systems, including crane components, crane kits, enclosed track rail systems, mobile workstation and jib cranes, lift assists, and fall protection systems; rigging equipment comprising below-the-hook lifters, wire grips, hooks, shackles, chains, forestry and hand tools, lifting slings, lashing systems, tie-downs, and load binders; and power fluid transfer technology, such as rotary unions and swivel joints. The company also provides power and motion technology, including AC motor controls systems, AC line regenerative systems, actuators, automation and diagnostics, brakes, cable and festoon systems, collision avoidance systems, conductor bar systems, DC motor and magnet control systems, elevator drives, inverter duty motors, mining drives, pendant pushbutton stations, and wind inverters; sanitary and vertical elevation conveyor systems, as well as pallet system conveyors; and lifting solutions, such as legacy crane solutions, industrial products, and engineered products. It serves market verticals, including general industries, mobile industries, energy and utilities, process industries, industrial automation, construction and infrastructure, food processing, entertainment, life sciences, consumer packaged goods, and e-commerce/supply chain/warehousing. The company offers its products to end users directly, as well as through distributors, private companies, engineering procurement contractors, crane builders, integrators of factory production systems, and original equipment manufacturers. Columbus McKinnon Corporation was founded in 1875 and is headquartered in Buffalo, New York.",
    "website": "http://www.columbusmckinnon.com",
    "zipcode": "14068"
  },
  "VE8.F": {
    "city": "Bridgeview",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Manitex International, Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "MANITEX INTERNATION.INC.",
    "state": "IL",
    "summary": "Manitex International, Inc. provides engineered lifting solutions in the United States, Italy, Canada, France, Chile, and internationally. It designs, manufactures, and distributes products that are used in various industries. The company also offers boom trucks, truck cranes, and sign cranes products primarily for use in industrial projects, energy exploration, and infrastructure development comprising roads, bridges, and commercial construction. In addition, it manufactures and sells rough terrain cranes and material handling products for construction, municipality, and railroad industries; truck mounted hydraulic knuckle boom cranes; and shipping articulated cranes. The company provides its products under the Manitex, PM, MAC, PM-Tadano, Oil & Steel, Badger, and Valla brands. It also sells its products through dealers and rental distribution channel. The company was formerly known as Veri-Tek International, Corp. and changed its name to Manitex International, Inc. in May 2008. Manitex International, Inc. was founded in 1993 and is headquartered in Bridgeview, Illinois.",
    "website": "http://www.manitexinternational.com",
    "zipcode": "60455"
  },
  "WA9.F": {
    "city": "Lafayette",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Wabash National Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "WABASH NATL CORP.  DL-,01",
    "state": "IN",
    "summary": "Wabash National Corporation designs, manufactures, and distributes engineered solutions for the transportation, logistics, and distribution industries primarily in the United States. The company operates through three segments: Commercial Trailer Products, Diversified Products, and Final Mile Products. The Commercial Trailer Products segment provides dry van and platform trailers; refrigerated trailers; converter dollies; aftermarket parts and services; and used trailers, as well as laminated hardwood oak flooring products. The Diversified Products segment offers stainless steel and aluminum liquid and dry bulk tank trailers, and other transport solutions for the dairy, food and beverage, chemical, environmental, petroleum, and refined fuel industries; and parts, and maintenance and repair services for tank trailers and other related equipment. This segment also offers process vessels, and round horizontal and vertical storage silo tanks; containment and isolation systems for the pharmaceutical, chemical, biotech, and nuclear industries; and composite products, including truck bodies, overhead doors, and other industrial application products. The Final Mile Products segment provides van bodies for dry-freight transportation; cutaway van bodies for commercial applications; service bodies; insulated van bodies; stake bodies; and refrigerated and dry freight truck bodies. The company offers its products under the Wabash National, Benson, Brenner Tank, Bulk Tank International, DuraPlate, Extract Technology, Supreme, Transcraft, Walker Engineered Products, Walker Transport, DuraPlateHD, ArcticLite, Iner-City, Spartan, and Kold King brands. It distributes its product directly, as well as through its retail operations and independent dealers to truckload common carriers, leasing companies, private fleet carriers, less-than-truckload common carriers, and package carriers. Wabash National Corporation was founded in 1985 and is headquartered in Lafayette, Indiana.",
    "website": "http://www.wabashnational.com",
    "zipcode": "47905"
  },
  "WNC": {
    "city": "Lafayette",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Wabash National Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Wabash National Corporation",
    "state": "IN",
    "summary": "Wabash National Corporation designs, manufactures, and distributes engineered solutions for the transportation, logistics, and distribution industries primarily in the United States. The company operates through three segments: Commercial Trailer Products, Diversified Products, and Final Mile Products. The Commercial Trailer Products segment provides dry van and platform trailers; refrigerated trailers; converter dollies; aftermarket parts and services; and used trailers, as well as laminated hardwood oak flooring products. The Diversified Products segment offers stainless steel and aluminum liquid and dry bulk tank trailers, and other transport solutions for the dairy, food and beverage, chemical, environmental, petroleum, and refined fuel industries; and parts, and maintenance and repair services for tank trailers and other related equipment. This segment also offers process vessels, and round horizontal and vertical storage silo tanks; containment and isolation systems for the pharmaceutical, chemical, biotech, and nuclear industries; and composite products, including truck bodies, overhead doors, and other industrial application products. The Final Mile Products segment provides van bodies for dry-freight transportation; cutaway van bodies for commercial applications; service bodies; insulated van bodies; stake bodies; and refrigerated and dry freight truck bodies. The company offers its products under the Wabash National, Benson, Brenner Tank, Bulk Tank International, DuraPlate, Extract Technology, Supreme, Transcraft, Walker Engineered Products, Walker Transport, DuraPlateHD, ArcticLite, Iner-City, Spartan, and Kold King brands. It distributes its product directly, as well as through its retail operations and independent dealers to truckload common carriers, leasing companies, private fleet carriers, less-than-truckload common carriers, and package carriers. Wabash National Corporation was founded in 1985 and is headquartered in Lafayette, Indiana.",
    "website": "http://www.wabashnational.com",
    "zipcode": "47905"
  }
}
