{
    "46Q.F": {
        "short_name": "BIOHITECH GLOBAL DL-,0001",
        "long_name": "BioHiTech Global, Inc.",
        "summary": "BioHiTech Global, Inc., through its subsidiaries, provides technological, biological, and mechanical engineering solutions of organic and municipal waste worldwide. Its suite of technologies includes on-site biological processing equipment for food waste, patented processing facilities for the conversion of municipal solid waste into renewable fuel, and proprietary real-time data analytics tools to reduce food waste generation. The company also markets Revolution Series Digesters, an aerobic digestion technology solution for the disposal of food waste at the point of generation; and High Efficiency Biological Treatment Resource Recovery Technology to process waste at the municipal or enterprise level. In addition, it offers BioHiTech Cloud and Cirrus mobile applications for digester customers. Its principal customers include producers of food waste. The company serves healthcare, grocery, prison, retail food service, education, and hospitality sectors, as well as food distributors, convention centers, hotels, restaurants, stadiums, municipalities and academic institutions, and stadiums. BioHiTech Global, Inc. is headquartered in Chestnut Ridge, New York.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "Chestnut Ridge",
        "zipcode": "10977",
        "website": "http://www.biohitech.com",
        "market_cap": "Small Cap"
    },
    "4CC.F": {
        "short_name": "CLEARSIGN TECHNO.DL-,0001",
        "long_name": "ClearSign Technologies Corporation",
        "summary": "ClearSign Technologies Corporation designs and develops products and technologies to enhance operational performance, energy efficiency, emission reduction, safety, and overall cost-effectiveness of industrial and commercial systems in the United States and the People's Republic of China. Its ClearSign Core Burner Technology consists of an industrial burner body and a downstream porous ceramic structure or metal flame stabilizing device; ClearSign Core Plug & Play technology provides direct burner replacement for traditional refinery process heaters; and ClearSign Eye Flame Sensor, an electrical flame sensor for industrial applications. The company also provides ClearSign Core Boiler Burner; and ClearSign Core Flaring Burners technologies. It serves energy, institutional, commercial and industrial boiler, chemical, and petrochemical industries. The company was formerly known as ClearSign Combustion Corporation and changed its name ClearSign Technologies Corporation in November 2019. ClearSign Technologies Corporation was incorporated in 2008 and is headquartered in Seattle, Washington.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "WA",
        "city": "Seattle",
        "zipcode": "98168",
        "website": "http://www.clearsign.com",
        "market_cap": "Small Cap"
    },
    "4SVE.F": {
        "short_name": "FLUENCE CORP. LTD",
        "long_name": "Fluence Corporation Limited",
        "summary": "Fluence Corporation Limited provides water and wastewater treatment, and reuse solutions for the municipal, commercial, and industrial markets worldwide. The company offers NIROBOX for desalination of seawater and brackish water, as well as for the treatment of fresh and wastewater; NIROFLEX systems for desalination; ultrafiltration systems; and reverse osmosis systems. It also provides wastewater treatment products, such as Aspiral, a wastewater treatment solution; SUBRE membrane aerated biofilm reactor modules; EcoBox water reuse systems; Tipton packaged wastewater treatment plants; aeration equipment comprising aerators, mixers, and diffusers; and dissolved air flotation systems. In addition, the company offers food processing and recovery solutions; and waste-to-energy solutions. Further, it provides project finance, Smart Operations data analytics software, and after-sale support services. Fluence Corporation Limited was founded in 2017 and is headquartered in White Plains, New York.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "White Plains",
        "zipcode": "10606",
        "website": "http://www.fluencecorp.com",
        "market_cap": "Small Cap"
    },
    "ADES": {
        "short_name": "Advanced Emissions Solutions, I",
        "long_name": "Advanced Emissions Solutions, Inc.",
        "summary": "Advanced Emissions Solutions, Inc., together with its subsidiaries, provides environmental technologies and specialty chemicals in the United States. It operates through two segments, Refined Coal and Advanced Purification Technologies. The company offers CyClean technology, a pre-combustion coal treatment process to enhance combustion, as well as to reduce emissions of nitrogen oxide and mercury from coals burned in cyclone boilers; and M-45 and M-45-PC technologies, which are pre-combustion coal treatment technologies used to control emissions from circulating fluidized bed boilers and pulverized coal boilers. It also provides mercury and other air contaminants controls; and activated carbon products, such as powdered activated carbon and granular activated carbon, as well as owns an associated lignite mine that supplies the raw material for the powdered activated carbon plant. The company's products are used in removal of heavy metal pollutants; treatment of drinking and waste waters; industrial acid gas and odor removal; automotive gasoline emission control; soil and ground water remediation; and food and beverage process and product purifications. It serves customers in the coal-fired power generation and industrial boiler processes. The company was founded in 1996 and is headquartered in Greenwood Village, Colorado.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Greenwood Village",
        "zipcode": "80111",
        "website": "http://www.advancedemissionssolutions.com",
        "market_cap": "Small Cap"
    },
    "AMSU": {
        "short_name": "AMANASU ENVIRONMENT CORPORATION",
        "long_name": "Amanasu Environment Corporation",
        "summary": "Amanasu Environment Corporation, a development stage company, engages in the research and development, marketing, and sale of environmental technologies. It provides Amanasu Furnace, a technology that disposes toxic and hazardous wastes through a high temperature combustion system; hot water boiler technology, which incinerates waste tires in a non-polluting manner and extracts heat energy from the incineration process; and ring-tube desalination methodology that purifies seawater and removes hazardous pollutants from wastewater. The company was formerly known as Amanasu Energy Corporation and changed its name to Amanasu Environment Corporation in November 2002. The company was incorporated in 1999 and is headquartered in New York, New York. Amanasu Environment Corporation is a subsidiary of Amanasu Corporation.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022",
        "website": "http://www.amanasu.net/en/business/environment/index.html",
        "market_cap": "Small Cap"
    },
    "AQUA": {
        "short_name": "Evoqua Water Technologies Corp.",
        "long_name": "Evoqua Water Technologies Corp.",
        "summary": "Evoqua Water Technologies Corp. provides water and wastewater treatment systems and technologies, and mobile and emergency water supply solutions and services for industrial, commercial, and municipal water treatment markets. It operates in two segments, Integrated Solutions and Services, and Applied Product Technologies. The Integrated Solutions and Services segment offers capital systems and related recurring aftermarket services, parts, and consumables, as well as long-term and short-term service contracts, and emergency services for treating industrial process water, utility water, and wastewater. This segment also provides odor and corrosion control services for municipalities. It serves healthcare, pharmaceutical, light manufacturing, microelectronics, food and beverage, and power and chemical processing industries. The Applied Product Technologies segment offers advanced filtration and separation products, such as VAF self-cleaning filters, Ionpure technologies, and Vortisand systems; wastewater treatment technologies, including the BioMag systems, clarification systems, and odor control and sludge management solutions; disinfection solutions from chlorine to ultraviolet light and ozone technologies; electrocatalytic and materials, which include electro chlorination, cathodic protection, and anode products; and aquatics technologies and solutions. This segment serves recreational and commercial pool market. The company has operations in the United States, Canada, the United Kingdom, the Netherlands, Germany, Australia, China, Singapore, Korea, and India. Evoqua Water Technologies Corp. was incorporated in 2013 and is headquartered in Pittsburgh, Pennsylvania.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Pittsburgh",
        "zipcode": "15222",
        "website": "http://www.evoqua.com",
        "market_cap": "Mid Cap"
    },
    "AWGI": {
        "short_name": "AMBIENT WATER CORP",
        "long_name": "Ambient Water Corporation",
        "summary": "Ambient Water Corporation designs and builds air-to-water appliances for residential and commercial drinking water applications based on patented, patent pending, and proprietary technologies in the United States. The company's air-to-water technology systems produce water from the atmosphere by using a condensing surface and a proprietary filtration system that removes dust, airborne particles, and bacteria to generate drinking water. It serves businesses, governments, and individuals. The company was formerly known as AWG International Water Corporation and changed its name to Ambient Water Corporation in June 2014. Ambient Water Corporation was founded in 2010 and is headquartered in Spokane Valley, Washington.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Spokane Valley",
        "zipcode": "99212",
        "website": null,
        "market_cap": "Small Cap"
    },
    "BHTG": {
        "short_name": "BioHiTech Global, Inc.",
        "long_name": "BioHiTech Global, Inc.",
        "summary": "BioHiTech Global, Inc., through its subsidiaries, provides technological, biological, and mechanical engineering solutions of organic and municipal waste worldwide. Its suite of technologies includes on-site biological processing equipment for food waste, patented processing facilities for the conversion of municipal solid waste into renewable fuel, and proprietary real-time data analytics tools to reduce food waste generation. The company also markets Revolution Series Digesters, an aerobic digestion technology solution for the disposal of food waste at the point of generation; and High Efficiency Biological Treatment Resource Recovery Technology to process waste at the municipal or enterprise level. In addition, it offers BioHiTech Cloud and Cirrus mobile applications for digester customers. Its principal customers include producers of food waste. The company serves healthcare, grocery, prison, retail food service, education, and hospitality sectors, as well as food distributors, convention centers, hotels, restaurants, stadiums, municipalities and academic institutions, and stadiums. BioHiTech Global, Inc. is headquartered in Chestnut Ridge, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Chestnut Ridge",
        "zipcode": "10977",
        "website": "http://www.biohitech.com",
        "market_cap": "Small Cap"
    },
    "BNET": {
        "short_name": "BION ENVIRONMENTAL TECHNOLOGIES",
        "long_name": "Bion Environmental Technologies, Inc.",
        "summary": "Bion Environmental Technologies, Inc. develops patented and proprietary technology that provides environmental solutions to water air and water quality problems and concentrated animal feeding operations (CAFOs) in the United States and internationally. The company's technology remediates environmental problems and improve operational/resource efficiencies through recovering co-products from the CAFOs' waste stream, including renewable energy and water, and nutrients comprising ammonia nitrogen and phosphorus. It focuses on the installation of its systems to retrofit and environmentally remediate existing CAFOs; development of waste treatment facilities; and licensing and/or joint venturing of its technology and applications. The company was founded in 1987 and is based in Old Bethpage, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Old Bethpage",
        "zipcode": "11804",
        "website": "http://www.biontech.com",
        "market_cap": "Small Cap"
    },
    "CECE": {
        "short_name": "CECO Environmental Corp.",
        "long_name": "CECO Environmental Corp.",
        "summary": "CECO Environmental Corp. provides industrial air quality and fluid handling systems for the energy, industrial, and other niche markets worldwide. It operates through three segments: Energy Solutions, Industrial Solutions, and Fluid Handling Solutions. The company engineers, designs, builds, and installs systems that capture, clean, and destroy airborne contaminants from industrial facilities, as well as equipment that control emissions from such facilities; and fluid handling and filtration systems. Its products and services include dampers and diverters, selective catalytic reduction and selective non-catalytic reduction systems, cyclonic technology, thermal oxidizers, filtration systems, scrubbers, and fluid handling equipment, as well as plant engineering services and engineered design build fabrication. The company markets its products and services to natural gas processors, transmission and distribution companies, refineries, power generators, industrial manufacturing, engineering and construction companies, semiconductor manufacturers, compressor manufacturers, metals and minerals, and electric vehicle producer companies. CECO Environmental Corp. was incorporated in 1966 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75254",
        "website": "http://www.cecoenviro.com",
        "market_cap": "Small Cap"
    },
    "CLIR": {
        "short_name": "ClearSign Technologies Corporat",
        "long_name": "ClearSign Technologies Corporation",
        "summary": "ClearSign Technologies Corporation designs and develops products and technologies to enhance operational performance, energy efficiency, emission reduction, safety, and overall cost-effectiveness of industrial and commercial systems in the United States and the People's Republic of China. Its ClearSign Core Burner Technology consists of an industrial burner body and a downstream porous ceramic structure or metal flame stabilizing device; ClearSign Core Plug & Play technology provides direct burner replacement for traditional refinery process heaters; and ClearSign Eye Flame Sensor, an electrical flame sensor for industrial applications. The company also provides ClearSign Core Boiler Burner; and ClearSign Core Flaring Burners technologies. It serves energy, institutional, commercial and industrial boiler, chemical, and petrochemical industries. The company was formerly known as ClearSign Combustion Corporation and changed its name ClearSign Technologies Corporation in November 2019. ClearSign Technologies Corporation was incorporated in 2008 and is headquartered in Seattle, Washington.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Seattle",
        "zipcode": "98168",
        "website": "http://www.clearsign.com",
        "market_cap": "Small Cap"
    },
    "CPSL": {
        "short_name": "CATAPULT SOLUTIONS INC",
        "long_name": "Catapult Solutions, Inc.",
        "summary": "Catapult Solutions, Inc. focuses on effecting an asset acquisition, merger, exchange of capital stock, or other business combination with a domestic or foreign business. The company was founded in 2010 and is based in Cranston, Rhode Island.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "RI",
        "city": "Cranston",
        "zipcode": "02910",
        "website": null,
        "market_cap": "Small Cap"
    },
    "E0W.F": {
        "short_name": "EVOQUA WATER TECHN.DL-,01",
        "long_name": "Evoqua Water Technologies Corp.",
        "summary": "Evoqua Water Technologies Corp. provides water and wastewater treatment systems and technologies, and mobile and emergency water supply solutions and services for industrial, commercial, and municipal water treatment markets. It operates in two segments, Integrated Solutions and Services, and Applied Product Technologies. The Integrated Solutions and Services segment offers capital systems and related recurring aftermarket services, parts, and consumables, as well as long-term and short-term service contracts, and emergency services for treating industrial process water, utility water, and wastewater. This segment also provides odor and corrosion control services for municipalities. It serves healthcare, pharmaceutical, light manufacturing, microelectronics, food and beverage, and power and chemical processing industries. The Applied Product Technologies segment offers advanced filtration and separation products, such as VAF self-cleaning filters, Ionpure technologies, and Vortisand systems; wastewater treatment technologies, including the BioMag systems, clarification systems, and odor control and sludge management solutions; disinfection solutions from chlorine to ultraviolet light and ozone technologies; electrocatalytic and materials, which include electro chlorination, cathodic protection, and anode products; and aquatics technologies and solutions. This segment serves recreational and commercial pool market. The company has operations in the United States, Canada, the United Kingdom, the Netherlands, Germany, Australia, China, Singapore, Korea, and India. Evoqua Water Technologies Corp. was incorporated in 2013 and is headquartered in Pittsburgh, Pennsylvania.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Pittsburgh",
        "zipcode": "15222",
        "website": "http://www.evoqua.com",
        "market_cap": "Mid Cap"
    },
    "EAUI": {
        "short_name": "EAU TECHNOLOGIES INC",
        "long_name": "EAU Technologies, Inc.",
        "summary": "EAU Technologies, Inc. develops, manufactures, and markets equipment that uses water electrolysis to create non-toxic cleaning and disinfecting fluids for food safety applications and dairy drinking water in the United States. Its products include Primacide A, a disinfecting and sanitizing fluid that kills bacteria, yeast, molds, viruses, and other organisms; Primacide B, an alkaline based cleaner; and Primacide C, which is used to stabilize acid water. The company's fluids are used in commercial food processing, and organic or non-organic agricultural and consumer products that clean, disinfect, remediate, hydrate, and moisturize. It markets its products primarily for food and beverage processing, dairy production and processing, meat and poultry processing, and agricultural grow-out and processing industries, as well as environmental remediation, medical, seafood processing, and grocery store produce and meat departments. The company was formerly known as Electric Aquagenics Unlimited, Inc. and changed its name to EAU Technologies, Inc. in January 2007. EAU Technologies, Inc. was founded in 1998 and is headquartered in Kennesaw, Georgia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Kennesaw",
        "zipcode": "30152",
        "website": "http://www.eautechnologies.com",
        "market_cap": "Small Cap"
    },
    "EAWD": {
        "short_name": "ENERGY AND WATER DEVELOPMENT CO",
        "long_name": "Energy and Water Development Corp.",
        "summary": "Energy and Water Development Corp., a green-tech engineering solutions company, focuses on delivering water generation, water purification, and green energy production technologies. The company provides atmosphere water generators and aqua mission systems to produce pure potable water from the air's humidity; solar power water purification systems for water purification utilizing solar, photovoltaic, wind, and renewable energy; and steam energy generators. It also offers plasma converter system, a closed-loop elemental recycling system that destroys waste and produces commodity products; and Plasma Arc Flow, a patented technology that converts most liquid waste into a clean fuel called syngas. In addition, the company provides engineering and technical services; and design, construction, maintenance, and specialty consulting services to private companies, government entities, and non-government organizations. Further, it builds water and energy systems. The company was formerly known as Eurosport Active World Corp. and changed its name to Energy and Water Development Corp. in October 2019. Energy and Water Development Corp. is based in St. Petersburg, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "St. Petersburg",
        "zipcode": "33702",
        "website": "http://www.eawctechnologies.com",
        "market_cap": "Small Cap"
    },
    "EESH": {
        "short_name": "EESTECH INC",
        "long_name": "EESTech, Inc.",
        "summary": "EESTech, Inc. provides waste management solutions to the mining and resource industries worldwide. It promotes modular waste to energy platforms that can be fuelled by waste combustibles to generate electrical energy; and offers water systems for the treatment and purification of waste water streams. The company was formerly known as Aqua Dyne, Inc. and changed its name to EESTech, Inc. in June 2006. EESTech, Inc. was founded in 2000 and is based in Chino Valley, Arizona.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Chino Valley",
        "zipcode": "86323",
        "website": "http://www.eestechinc.com",
        "market_cap": "Small Cap"
    },
    "EIHC": {
        "short_name": "ENVIRONMENTAL INFRASTRUCTURE HL",
        "long_name": "Environmental Infrastructure Holdings Corp",
        "summary": "Environmental Infrastructure Holdings Corp., an equipment solutions provider, through its subsidiary, Equisol, LLC, provides environmentally friendly products, services, and engineering solutions. It designs, fabricates, and sells equipment systems, including water treatment systems; sells equipment systems and spare parts, as well as basic maintenance, repair, and operations components; offers optimization, calibration, installation, and maintenance services; and provides environmental engineering and consulting services. It primarily serves refineries, power plants, engineering firms, and manufacturing facilities, as well as supports commercial, municipal, and governmental facilities principally in the United States. The company is headquartered in West Conshohocken, Pennsylvania.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "West Conshohocken",
        "zipcode": "19428",
        "website": "http://www.environmentalinfrastructureholdings.com",
        "market_cap": "Small Cap"
    },
    "EMFGF": {
        "short_name": "FLUENCE CORPORATION LTD",
        "long_name": "Fluence Corporation Limited",
        "summary": "Fluence Corporation Limited provides water and wastewater treatment, and reuse solutions for the municipal, commercial, and industrial markets worldwide. The company offers NIROBOX for desalination of seawater and brackish water, as well as for the treatment of fresh and wastewater; NIROFLEX systems for desalination; ultrafiltration systems; and reverse osmosis systems. It also provides wastewater treatment products, such as Aspiral, a wastewater treatment solution; SUBRE membrane aerated biofilm reactor modules; EcoBox water reuse systems; Tipton packaged wastewater treatment plants; aeration equipment comprising aerators, mixers, and diffusers; and dissolved air flotation systems. In addition, the company offers food processing and recovery solutions; and waste-to-energy solutions. Further, it provides project finance, Smart Operations data analytics software, and after-sale support services. Fluence Corporation Limited was founded in 2017 and is headquartered in White Plains, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "White Plains",
        "zipcode": "10606",
        "website": "http://www.fluencecorp.com",
        "market_cap": "Small Cap"
    },
    "EMHI": {
        "short_name": "EAST MORGAN HOLDINGS INC",
        "long_name": "East Morgan Holdings, Inc.",
        "summary": "East Morgan Holdings, Inc. provides environmental technologies in the United States. The company offers Air Emissions Control Technology, a mercury control technology, for the treatment of mercury and other heavy metals in contaminated soils, sludges, and other solid waste streams, as well as to remediate the ash, sludge, and effluent by-products generated in the coal-fired power plants. Its technologies also include chemical systems for self-remediating batteries. The company was founded in 2001 and is based in Lakewood, New Jersey.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Lakewood",
        "zipcode": "08701",
        "website": "http://www.eastmorgan.com",
        "market_cap": "Small Cap"
    },
    "ERII": {
        "short_name": "Energy Recovery, Inc.",
        "long_name": "Energy Recovery, Inc.",
        "summary": "Energy Recovery, Inc., together with its subsidiaries, designs, manufactures, and sells various solutions for industrial fluid-flow markets worldwide. The company operates through Water, and Oil & Gas segments. It designs, engineers, manufactures, and supplies various energy recovery devices (ERDs), including positive displacement isobaric ERDs and centrifugal-type ERDs, such as our hydraulic turbochargers; and high-pressure feed and circulation pumps. The company also provides spare parts, as well as repair, field, and commissioning services. In addition, it offers a solution to reduce energy consumption in natural gas processing, as well as to reduce waste, redundancy, and indirectly lower emissions associated with hydraulic fracturing; and products for use in the gas processing, chemical processing, and hydraulic fracturing applications. The company provides its products under the ERI, Ultra PX, PX, Pressure Exchanger, PX Pressure Exchanger (PX), PX PowerTrain, VorTeq, IsoBoost, AT, and AquaBold trademarks to large engineering, procurement, and construction (EPC) firms; end-users and industry consultants; original equipment manufacturers (OEMs); and aftermarket customers. Energy Recovery, Inc. was incorporated in 1992 and is headquartered in San Leandro, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Leandro",
        "zipcode": "94577",
        "website": "http://www.energyrecovery.com",
        "market_cap": "Small Cap"
    },
    "ESFS": {
        "short_name": "ECO-SAFE SYSTEMS USA INC",
        "long_name": "Eco Safe Systems USA, Inc.",
        "summary": "Eco Safe Systems USA, Inc. manufactures water treatment and water reclamation systems. It offers R-1000-HS Home Units for food and surface disinfection, and general cleanup in homes; R-1000 Restaurant Single Sink System for food and surface disinfection, and general cleanup in restaurants; R-1000-3S Restaurant Systems for restaurants or supermarkets; and MD-1500 System and MD-1500-C System to handle various departments of supermarkets or restaurants. The company also offers MD-2000 System for use on produce, meat, poultry, and seafood products to reduce bacteria counts, extend the shelf life, and reduce the risk of salmonella or any other bacteria or virus; and Ozone Hazmat Disinfection Systems for emergency first-responders to disinfect and decontaminate personnel and equipment after exposure to various biohazards and pathogens. In addition, it provides leasing services. The company serves various industries, including supermarkets, health care, food processing, restaurants, golf courses, laundry, animal care, and home system. Eco Safe Systems USA, Inc. was incorporated in 1998 and is headquartered in Tarzana, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Tarzana",
        "zipcode": "91356",
        "website": "http://www.ecosafeusa.com",
        "market_cap": "Small Cap"
    },
    "ETII": {
        "short_name": "ENVIROTECHNOLOGIES INTL INC",
        "long_name": "EnviroTechnologies International, Inc",
        "summary": "EnviroTechnologies International, Inc. develops and markets various environmentally safe technologies and products primarily in the oil and gas, food, and agriculture industries worldwide. Its food and product processing technologies include Cleaner Answer and Powered Water products that provide nontoxic and anti-microbial solutions for cleaning and sanitizing fruits and vegetables, meats, and fish for food packing and retail operations. The company also offers Powered Water, Bio-N-Liven, and Carbon and Greener Answer, which are non-toxic solutions to clean and remediate soils and water bodies damaged by oil exploration and retrieval, and to help extract natural products from rock formations in the oil and gas industry. EnviroTechnologies International, Inc. was incorporated in 2013 and is headquartered in Pleasant Grove, Utah.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "UT",
        "city": "Pleasant Grove",
        "zipcode": "84062",
        "website": "http://www.envirotechnologiesinternational.com",
        "market_cap": "Small Cap"
    },
    "FLC.AX": {
        "short_name": "FLUENCE FPO",
        "long_name": "Fluence Corporation Limited",
        "summary": "Fluence Corporation Limited provides water and wastewater treatment, and reuse solutions for the municipal, commercial, and industrial markets worldwide. The company offers NIROBOX for desalination of seawater and brackish water, as well as for the treatment of fresh and wastewater; NIROFLEX systems for desalination; ultrafiltration systems; and reverse osmosis systems. It also provides wastewater treatment products, such as Aspiral, a wastewater treatment solution; SUBRE membrane aerated biofilm reactor modules; EcoBox water reuse systems; Tipton packaged wastewater treatment plants; aeration equipment comprising aerators, mixers, and diffusers; and dissolved air flotation systems. In addition, the company offers food processing and recovery solutions; and waste-to-energy solutions. Further, it provides project finance, Smart Operations data analytics software, and after-sale support services. Fluence Corporation Limited was founded in 2017 and is headquartered in White Plains, New York.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ASX",
        "market": "au_market",
        "country": "United States",
        "state": "NY",
        "city": "White Plains",
        "zipcode": "10606",
        "website": "http://www.fluencecorp.com",
        "market_cap": "Small Cap"
    },
    "FQCC": {
        "short_name": "FUQUAN CAPITAL MANAGEMENT INC",
        "long_name": "Fuquan Capital Management, Inc.",
        "summary": "International Sustainability Group, Inc. manufactures and markets algae-based nutritional and algae-containing products. The company offers algae-based biomass for human, fish, and animal consumption; algae cakes for livestock and aquaculture products; astaxanthin for use in joint pain relief and treatments of muscular degeneration; omega-3 to prevent heart disease/cancer and boost the immune system; algae oils for producing bio-fuel; and bio-oil, bio-plastic, and carbon reduction and sequestration solutions. It provides nutraceutical and natural products that prevent and treat diseases; and spirulina, a nutrient and protein solution for human dietary functions and malnutrition. The company also offers sports medicine devices to increase mobility and balance, decrease joint pain, define muscle tone, and promote weight loss. It serves nutraceutical, pharmaceutical, and health and wellness markets. The company is based in Malvern, Pennsylvania. As of September 28, 2017, International Sustainability Group, Inc. operates as a subsidiary of Fuquan Capital Corporation, Inc.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Malvern",
        "zipcode": "19355",
        "website": "http://www.isgpglobal.com",
        "market_cap": null
    },
    "FSG.F": {
        "short_name": "FED. SIGNAL CORP.  DL 1",
        "long_name": "Federal Signal Corporation",
        "summary": "Federal Signal Corporation, together with its subsidiaries, designs, manufactures, and supplies a suite of products and integrated solutions for municipal, governmental, industrial, and commercial customers in the United States, Canada, Europe, and internationally. It operates through two segments, Environmental Solutions Group, and Safety and Security Systems Group. The Environmental Solutions Group segment offers a range of street sweepers, sewer cleaners, industrial vacuum loaders, safe-digging trucks, waterblasting equipment, road-marking and line-removal equipment, dump truck bodies, and trailers under the Elgin, Vactor, Guzzler, TRUVAC, Westech, Jetstream, Mark Rite Lines, Ox Bodies, Crysteel, J-Craft, Duraclass, Rugby, and Travis brand names. It also offers refuse and recycling collection vehicles, camera systems, ice resurfacing equipment, and snow-removal equipment. In addition, this segment engages in the sale of parts, service and repair, equipment rental, and training activities. The Safety and Security Systems Group segment provides systems and products for community alerting, emergency vehicles, first responder interoperable communications, and industrial communications. Its products include vehicle lightbars and sirens, industrial signaling equipment, public warning systems, general alarm systems, and public address systems. This segment sells its products under the Federal Signal, Federal Signal VAMA, and Victor brand names. The company sells its products through wholesaler, distributor, independent manufacturer representative, original equipment manufacturer, and direct sales force, as well as independent foreign distributor. Federal Signal Corporation was founded in 1901 and is headquartered in Oak Brook, Illinois.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IL",
        "city": "Oak Brook",
        "zipcode": "60523",
        "website": "http://www.federalsignal.com",
        "market_cap": "Mid Cap"
    },
    "FSS": {
        "short_name": "Federal Signal Corporation",
        "long_name": "Federal Signal Corporation",
        "summary": "Federal Signal Corporation, together with its subsidiaries, designs, manufactures, and supplies a suite of products and integrated solutions for municipal, governmental, industrial, and commercial customers in the United States, Canada, Europe, and internationally. It operates through two segments, Environmental Solutions Group, and Safety and Security Systems Group. The Environmental Solutions Group segment offers a range of street sweepers, sewer cleaners, industrial vacuum loaders, safe-digging trucks, waterblasting equipment, road-marking and line-removal equipment, dump truck bodies, and trailers under the Elgin, Vactor, Guzzler, TRUVAC, Westech, Jetstream, Mark Rite Lines, Ox Bodies, Crysteel, J-Craft, Duraclass, Rugby, and Travis brand names. It also offers refuse and recycling collection vehicles, camera systems, ice resurfacing equipment, and snow-removal equipment. In addition, this segment engages in the sale of parts, service and repair, equipment rental, and training activities. The Safety and Security Systems Group segment provides systems and products for community alerting, emergency vehicles, first responder interoperable communications, and industrial communications. Its products include vehicle lightbars and sirens, industrial signaling equipment, public warning systems, general alarm systems, and public address systems. This segment sells its products under the Federal Signal, Federal Signal VAMA, and Victor brand names. The company sells its products through wholesaler, distributor, independent manufacturer representative, original equipment manufacturer, and direct sales force, as well as independent foreign distributor. Federal Signal Corporation was founded in 1901 and is headquartered in Oak Brook, Illinois.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Oak Brook",
        "zipcode": "60523",
        "website": "http://www.federalsignal.com",
        "market_cap": "Mid Cap"
    },
    "FTEK": {
        "short_name": "Fuel Tech, Inc.",
        "long_name": "Fuel Tech, Inc.",
        "summary": "Fuel Tech, Inc. provides boiler optimization, efficiency improvement, and air pollution reduction and control solutions to utility and industrial customers worldwide. It operates through two segments, Air Pollution Control Technology and FUEL CHEM Technology. The Air Pollution Control Technology segment offers technologies to reduce nitrogen oxide (NOx) emissions in flue gas from boilers, incinerators, furnaces, and other stationary combustion sources by low and ultra-low NOx burners; over-fire air systems; NOxOUT and HERT selective non-catalytic reduction systems; advanced selective catalytic reduction systems comprising ULNB, OFA, and SNCR components, as well as downsized SCR catalyst, ammonia injection grid, and graduated straightening grid systems; NOxOUT CASCADE and NOxOUT-SCR processes; ULTRA technology; and flue gas conditioning systems. The FUEL CHEM Technology segment provides programs to improve the efficiency, reliability, fuel flexibility, boiler heat rate, and environmental status of combustion units by controlling slagging, fouling, corrosion, opacity, and acid plume, as well as the formation of sulfur trioxide, ammonium bisulfate, particulate matter, sulfur dioxide, and carbon dioxide through the addition of chemicals into the furnace using TIFI targeted in-furnace injection technology. This segment offers its FUEL CHEM program for plants operating in the electric utility, industrial, pulp and paper, waste-to-energy, and university, and district heating markets; and the owners of boilers, furnaces, and other combustion units. The company was incorporated in 1987 and is headquartered in Warrenville, Illinois.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Warrenville",
        "zipcode": "60555-1617",
        "website": "http://www.ftek.com",
        "market_cap": "Small Cap"
    },
    "FUE1.F": {
        "short_name": "FUEL TECHS INC.  DL-,01",
        "long_name": "Fuel Tech, Inc.",
        "summary": "Fuel Tech, Inc. provides boiler optimization, efficiency improvement, and air pollution reduction and control solutions to utility and industrial customers worldwide. It operates through two segments, Air Pollution Control Technology and FUEL CHEM Technology. The Air Pollution Control Technology segment offers technologies to reduce nitrogen oxide (NOx) emissions in flue gas from boilers, incinerators, furnaces, and other stationary combustion sources by low and ultra-low NOx burners; over-fire air systems; NOxOUT and HERT selective non-catalytic reduction systems; advanced selective catalytic reduction systems comprising ULNB, OFA, and SNCR components, as well as downsized SCR catalyst, ammonia injection grid, and graduated straightening grid systems; NOxOUT CASCADE and NOxOUT-SCR processes; ULTRA technology; and flue gas conditioning systems. The FUEL CHEM Technology segment provides programs to improve the efficiency, reliability, fuel flexibility, boiler heat rate, and environmental status of combustion units by controlling slagging, fouling, corrosion, opacity, and acid plume, as well as the formation of sulfur trioxide, ammonium bisulfate, particulate matter, sulfur dioxide, and carbon dioxide through the addition of chemicals into the furnace using TIFI targeted in-furnace injection technology. This segment offers its FUEL CHEM program for plants operating in the electric utility, industrial, pulp and paper, waste-to-energy, and university, and district heating markets; and the owners of boilers, furnaces, and other combustion units. The company was incorporated in 1987 and is headquartered in Warrenville, Illinois.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IL",
        "city": "Warrenville",
        "zipcode": "60555-1617",
        "website": "http://www.ftek.com",
        "market_cap": "Small Cap"
    },
    "GCHK": {
        "short_name": "GREENCHEK TECHNOLOGY INC",
        "long_name": "GreenChek Technology Inc.",
        "summary": "GreenChek Technology Inc., a development stage company, focuses on manufacturing, marketing, and distributing hydrogen technology products that are designed to reduce gas emissions by motor vehicles. The company develops emission reduction device (ERD-3.0) for installation on various vehicles with an internal combustion engine. Its ERD-3.0 product generates hydrogen by means of electrolysis. The company was formerly known as Ridgestone Resources, Inc. and changed its name to GreenChek Technology Inc. in August 2008. GreenChek Technology Inc. was founded in 2006 and is based in San Francisco, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94111",
        "website": "http://www.greenchektech.com",
        "market_cap": "Small Cap"
    },
    "GLEC": {
        "short_name": "GLOBAL ECOLOGY COR",
        "long_name": "Global Ecology Corp.",
        "summary": "Global Ecology Corporation, through its subsidiary and joint ventures, engages in the production and sale of soil and water remediation technologies. Its products include Mobile PureWater System, a mobile water purification system for use in areas where safe and clean drinking water is scarce or affected by natural disasters; and IMS1000, an ionized mineral solution for treating reservoirs, lakes, and other large bodies of water, as well as for large HVAC systems, waste water systems, drilling water de-contamination, and various agricultural applications. The company's products also comprise soil remediation products, including natural fertilizers/soil additives and compost products for enhancing crop yield and turf growth. It has a strategic partnership with International Renewable Energy Organization. The company was formerly known as Homeland Security Network, Inc. and changed its name to Global Ecology Corporation in August 2009. Global Ecology Corporation was founded in 1986 and is based in Montclair, New Jersey.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Montclair",
        "zipcode": "07042",
        "website": "http://www.geco.us",
        "market_cap": "Small Cap"
    },
    "GOGR": {
        "short_name": "GO GREEN GLOBAL TECHNOLOGIES CO",
        "long_name": "Go Green Global Technologies Corp.",
        "summary": "Go Green Global Technologies Corp. operates as a water and fuel technology licensing, marketing, manufacturing, and development company worldwide. The company, through its wholly owned subsidiary, Go Green Technologies Corp., provides solutions utilizing the proprietary patented Sonical technology for non-chemical water treatment and fuel combustion applications. It offers Sonical Water Treatment System for food, coffee, home and restaurant, pharma, and other industries, including paper, textile, electronics, petrochemical, plastics molding, glass trade, and tanneries; and Sonical Fuel Charger, an electro-physical device, which is installed in the fuel supply circuit feeding motors, burners, and boilers that are used in cars, trucks, boats, and boilers. The company was founded in 2009 and is based in Monroe, Connecticut.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Monroe",
        "zipcode": "06468",
        "website": "http://www.gogreentechcorp.com",
        "market_cap": "Small Cap"
    },
    "GWTR": {
        "short_name": "GLOBAL WATER TECHNOLOGIES",
        "long_name": "Global Water Technologies, Inc.",
        "summary": "Global Water Technologies, Inc., through its subsidiary, Electric H2O, Inc., identifies, develops, and commercializes non-chemical, filtration, and other technologies to improve water efficiency in the United States. The company utilizes non-chemical water treatment to prevent scaling in cooling towers through its line of ED2000, ED2000PLUS, and AquaPhysics systems. Its technologies address scale, microbiological growth, corrosion, and fouling in cooling water systems. The company also engages in developing software-as-a-service platform to provide usage data, analysis, education, and rewards to the customers of utilities; and reviewing and commercializing underground pipeline technologies. The company was formerly known as Fi-Tek VI, Inc. and changed its name to Global Water Technologies, Inc. in November 1997. Global Water Technologies, Inc. was incorporated in 1990 and is based in Indianapolis, Indiana.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "IN",
        "city": "Indianapolis",
        "zipcode": "46202",
        "website": "http://www.gwtr.com",
        "market_cap": "Small Cap"
    },
    "KNOS": {
        "short_name": "KRONOS ADVANCED TECH INC",
        "long_name": "Kronos Advanced Technologies Inc.",
        "summary": "Kronos Advanced Technologies Inc. manufactures and distributes air movement and purification equipment. The company was formerly known as TSET, Inc. and changed its name to Kronos Advanced Technologies Inc. in January 2001. Kronos Advanced Technologies Inc. was incorporated in 1980 and is based in Lake Oswego, Oregon.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "OR",
        "city": "Lake Oswego",
        "zipcode": "97034",
        "website": "http://silentnightairfilter.com",
        "market_cap": "Small Cap"
    },
    "LQWC": {
        "short_name": "LIFEQUEST WORLD CORP",
        "long_name": "LifeQuest World Corporation",
        "summary": "LifeQuest World Corporation, through its subsidiaries, provides effluent treatment and sewage treatment solutions. The company develops onsite sewage wastewater treatment system, which treats grey and black water that can be reused for irrigation, flushing, and cleaning. It also focuses on providing solutions for treatment of effluents in textile, tannery, fisheries, dairy, and processed water industries. The company offers Biopipe, a biological wastewater treatment system that could be used in detached houses, commercial and multi-family buildings, hotels, hospitals, industrial complexes, campgrounds, and parks; and Abrimix, a water treatment technology for treating wastewater, processed water, or raw water. In addition, it provides Glanris, a non-toxic filtration media for water filtration for municipalities, businesses, homeowners, and consumers; and Goslyn, a grease recovery device to remove fats, oils, and grease from wastewater effluent. The company was incorporated in 1997 and is based in Ridgefield Park, New Jersey.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Ridgefield Park",
        "zipcode": "07660",
        "website": "http://lifequestcorp.com",
        "market_cap": "Small Cap"
    },
    "MEEC": {
        "short_name": "MIDWEST ENERGY EMISSIONS CORP",
        "long_name": "Midwest Energy Emissions Corp.",
        "summary": "Midwest Energy Emissions Corp. operates as an environmental services and technology company. It focuses on the delivery of mercury capture technologies to coal-fired power plants in the United States, Canada, Europe, and Asia. The company was incorporated in 1983 and is headquartered in Corsicana, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Corsicana",
        "zipcode": "75109",
        "website": "http://www.me2cenvironmental.com",
        "market_cap": "Small Cap"
    },
    "MPML": {
        "short_name": "MPM TECHNOLOGIES INC",
        "long_name": "MPM Technologies, Inc.",
        "summary": "MPM Technologies, Inc., through its subsidiaries, designs, engineers, supplies, and services air pollution control systems for environmental and industrial companies in the United States and internationally. The company provides air pollution control systems by utilizing wet and dry scrubbers, wet electrostatic precipitators, and venturi absorbers that control air pollution. It also involves in the development and commercialization of Skygas, a waste-to-energy process that converts solid and semi-solid wastes into a clean-burning medium BTU gas that can be used for steam production for electric power generation, as well as for downstream conversion into chemicals. The company's Skygas technology is used for the disposal and gasification of carbonaceous wastes, such as municipal solid waste, municipal sewage sludge, pulp and paper mill sludge, auto fluff, medical waste, and used tires. It has a strategic alliance with Foton Technologies, LLC to develop projects to produce power, chemicals, and liquid fuels utilizing Skygas gasification-derived syngas. The company was formerly known as Montana Precision Mining, Ltd. and changed its name to MPM Technologies, Inc. in August 1995. MPM Technologies, Inc. was founded in 1983 and is based in Spokane Valley, Washington. MPM Technologies, Inc. operates as a subsidiary of Carbon Cycle Investments, LLC.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Spokane Valley",
        "zipcode": "99216",
        "website": null,
        "market_cap": "Small Cap"
    },
    "MYX.L": {
        "short_name": "MYCELX TECHNOLOGIES CORPORATION",
        "long_name": "MYCELX Technologies Corporation",
        "summary": "MYCELX Technologies Corporation, a clean water technology company, provides water treatment solutions to the oil and gas, power, marine, and heavy manufacturing sectors in the Middle East, the United States, and internationally. The company offers oil removal solutions for upstream produced water to oil companies; and hydrocarbons removal services from downstream process wastewater that are used in petrochemical facilities and refineries. It also sells or leases its equipment; and sells consumable filtration media. The company was incorporated in 1994 is headquartered in Duluth, Georgia.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United States",
        "state": "GA",
        "city": "Duluth",
        "zipcode": "30096",
        "website": "http://www.mycelx.com",
        "market_cap": null
    },
    "OWUV": {
        "short_name": "ONE WORLD UNIVERSE INC",
        "long_name": "One World Universe Inc.",
        "summary": "One World Universe Inc. engages in the manufacture, sale, and rental of water purification equipment utilizing reverse osmosis filtration processes and water vending equipment. Its products are used in various water treatment applications for commercial, residential, industrial, and institutional purposes. The company was formerly known as Ultra Pure Water Technologies, Inc. and changed its name to One World Universe Inc. in October 2020. One World Universe Inc. was incorporated in 1989 and is based in Lafayette, Louisiana.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "LA",
        "city": "Lafayette",
        "zipcode": "70507",
        "website": null,
        "market_cap": null
    },
    "OXQ1.F": {
        "short_name": "ADVANCED EMISS. SOL.",
        "long_name": "Advanced Emissions Solutions, Inc.",
        "summary": "Advanced Emissions Solutions, Inc., together with its subsidiaries, provides environmental technologies and specialty chemicals in the United States. It operates through two segments, Refined Coal and Advanced Purification Technologies. The company offers CyClean technology, a pre-combustion coal treatment process to enhance combustion, as well as to reduce emissions of nitrogen oxide and mercury from coals burned in cyclone boilers; and M-45 and M-45-PC technologies, which are pre-combustion coal treatment technologies used to control emissions from circulating fluidized bed boilers and pulverized coal boilers. It also provides mercury and other air contaminants controls; and activated carbon products, such as powdered activated carbon and granular activated carbon, as well as owns an associated lignite mine that supplies the raw material for the powdered activated carbon plant. The company's products are used in removal of heavy metal pollutants; treatment of drinking and waste waters; industrial acid gas and odor removal; automotive gasoline emission control; soil and ground water remediation; and food and beverage process and product purifications. It serves customers in the coal-fired power generation and industrial boiler processes. The company was founded in 1996 and is headquartered in Greenwood Village, Colorado.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CO",
        "city": "Greenwood Village",
        "zipcode": "80111",
        "website": "http://www.advancedemissionssolutions.com",
        "market_cap": "Small Cap"
    },
    "PCT": {
        "short_name": "PureCycle Technologies, Inc.",
        "long_name": "PureCycle Technologies, Inc.",
        "summary": "PureCycle Technologies LLC produces recycled polypropylene. It uses a recycling process that separates color, odor, and contaminants from plastic waste feedstock into recycled polypropylene. Its recycling service converts waste plastic into virgin-like plastic. The company was founded in 2015 and is based in Orlando, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Orlando",
        "zipcode": "32817",
        "website": "http://purecycletech.com",
        "market_cap": "Small Cap"
    },
    "PCTL": {
        "short_name": "PCT LTD",
        "long_name": "PCT Ltd",
        "summary": "PCT Ltd, through its subsidiary, Paradigm Convergence Technologies Corporation, designs, develops manufactures, and licenses environmentally safe solutions worldwide. The company offers Hydrolyte, a sanitizer/disinfectant microbiocide for use in institutional facilities, including hospitals, nursing homes, hotels, correctional facilities, and schools; agriculture industry for pre- and post-harvest disinfection of crops, sanitization in food processing, and applications in animal husbandry; oil and gas industry to disinfect water and to kill sulfate reducing bacteria in oil and gas wells; and disinfecting and sanitizing water in public and private water systems and industrial waste-water systems. It also provides Catholyte, a mild detergent, degreaser, and surfactant that is used for janitorial cleaning purposes. The company was formerly known as Bingham Canyon Corporation and changed its name to PCT LTD in February 2018. PCT Ltd was incorporated in 1986 and is headquartered in Little River, South Carolina.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "SC",
        "city": "Little River",
        "zipcode": "29566",
        "website": "http://www.para-con.com",
        "market_cap": "Small Cap"
    },
    "PCTTU": {
        "short_name": "PureCycle Technologies, Inc.",
        "long_name": "PureCycle Technologies, Inc.",
        "summary": "PureCycle Technologies LLC produces recycled polypropylene. It uses a recycling process that separates color, odor, and contaminants from plastic waste feedstock into recycled polypropylene. Its recycling service converts waste plastic into virgin-like plastic. The company was founded in 2015 and is based in Orlando, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Orlando",
        "zipcode": "32817",
        "website": "http://purecycletech.com",
        "market_cap": null
    },
    "PGTK": {
        "short_name": "PACIFIC GREEN TECHNOLOGIES INC",
        "long_name": "Pacific Green Technologies Inc.",
        "summary": "Pacific Green Technologies Inc. acquires, develops, and markets emission control technologies in North America, Europe, and Asia. The company offers ENVI-Clean, a system that removes sulphur dioxides, particulate matters, greenhouse gases, and other hazardous air pollutants; and ENVI-Pure, which removes acid gases, particulate matter, dioxins, VOCs, and other regulated hazardous air pollutants from the flue gases produced by the combustion of coal, biomass, municipal solid waste, diesel, and other fuels. It also provides ENVI-Marine, a scrubber for application in diesel exhaust emissions. The company was founded incorporated in 1994 and is based in Dover, Delaware.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "DE",
        "city": "Dover",
        "zipcode": "19901",
        "website": "http://www.pacificgreentechnologies.com",
        "market_cap": "Small Cap"
    },
    "PURA": {
        "short_name": "PURATION INC",
        "long_name": "Puration, Inc.",
        "summary": "Puration, Inc. engages in the design, development, production, marketing, and distribution of personal or individual water purification products. The company's personal water filtration systems include personal water filter bottles, sports bottles, collapsible water pouches, portable purification devices, portable biological filtration devices, replacement filters, and travel filters. Its products also include water filter pitchers, canteens, shower head filters, water filter pumps, and air-to-water machines. Puration, Inc. sells its products under the Filter 2GO brand. The company has a partnership with Alkame Holdings Inc. to produce and test market a CBD infused liquid sugar, a CBD infused pet food supplement and a CBD sexual wellness flavored lubricant. Puration, Inc. was founded in 2011 and is based in Farmers Branch, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Farmers Branch",
        "zipcode": "75244",
        "website": "http://www.purationinc.com",
        "market_cap": "Small Cap"
    },
    "SINX": {
        "short_name": "SIONIX CORP",
        "long_name": "Sionix Corp.",
        "summary": "Sionix Corp. designs, constructs, and operates mobile water treatment systems based on its proprietary dissolved air flotation (DAF) technology. Its systems are used in energy applications; government facilities; healthcare facilities; emergency water supplies during natural disasters; housing development projects; and various industrial processes, including subterranean fracturing used in oil and gas drilling, as well as for pre-treatment of desalination and other membrane filtration applications. The company's system is also used to remove organic and inorganic compounds, including hydrocarbons, insoluble metals, infectious bacteria from contaminated water, algae, color, and more, as well as serves dairy, agribusiness, meat processing, mining, poultry operations, and other industries that uses water in the manufacture of their products or delivery of their services. Sionix Corp. was founded in 1985 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77018",
        "website": null,
        "market_cap": "Small Cap"
    },
    "SYEV": {
        "short_name": "SEYCHELLE ENVIRONMENTAL TECHNOL",
        "long_name": "Seychelle Environmental Technologies, Inc.",
        "summary": "Seychelle Environmental Technologies, Inc. designs, assembles, and distributes absorption micron filters for portable filter devices worldwide. Its products include flip-top and pull top bottles, canteens, water pitchers, pure water pumps, stainless steel bottles, in-line filters, pure water bags, pure water pouches, and pure water straws, as well as Pump N' Pure. The company sells its products to individuals, dealers, distributors, multilevel marketing companies and missionaries, non-governmental organizations, and emergency relief organizations. It also sells its products as a private label supplier. The company was formerly known as Royal Net, Inc. and changed its name to Seychelle Environmental Technologies, Inc. in January 1998. Seychelle Environmental Technologies, Inc. was incorporated in 1986 and is based in Aliso Viejo, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Aliso Viejo",
        "zipcode": "92656",
        "website": "http://www.seychelle.com",
        "market_cap": "Small Cap"
    },
    "TEGY": {
        "short_name": "TRANSACT ENERGY CORPORATION",
        "long_name": "TransAct Energy Corp.",
        "summary": "TransAct Energy Corp. develops and manages zero emissions waste to value plants worldwide. The company principal products are carbon black, phenol resins, and levoglucosan. It also produces fertilizers for the agricultural industry; a brick mix for the construction industry; reclaimed metals and purified water; and acetic acid and furfural for industrial chemical manufacturers. The company target service customers include corporations or municipalities, airlines, shipping companies, bus companies, trucking companies, or fuel retailers; friction and wood product manufacturers; manufacturers of biodegradable plastics and pharmaceuticals; and tire and rubber manufacturers, lithographers, and printers. TransAct Energy Corp. was incorporated in 2006 and is headquartered in Bellingham, Washington.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Bellingham",
        "zipcode": "98226",
        "website": "http://www.transactenergycorp.com",
        "market_cap": "Small Cap"
    },
    "TNKE": {
        "short_name": "TANKE INCORPORATED",
        "long_name": "Tanke, Inc.",
        "summary": "Tanke, Inc., through its subsidiaries, develops and markets environmental and water technologies. The company offers Tripple R Water Recycling for the reclamation, treatment, and recycling of wastewater or storm water collected from homes, commercial buildings and industrial facilities; and Tripple R Water Recycling, a water recycling system for hotels, dry kitchens, and buildings. It also provides uSMART, a Software-as-a-Service enterprise resource planning proprietary software technology. Tanke, Inc. was formerly known as LP Holdings Inc. and changed its name to Tanke, Inc. in 2007. The company was incorporated in 1984 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89101",
        "website": null,
        "market_cap": "Small Cap"
    },
    "TOMZ": {
        "short_name": "TOMI Environmental Solutions, I",
        "long_name": "TOMI Environmental Solutions, Inc.",
        "summary": "TOMI Environmental Solutions, Inc., a bacteria decontamination and infectious disease control company, provides environmental solutions for indoor surface decontamination in the United States and internationally. Its products and services include SteraMist Surface Unit, a fully portable, handheld, point and spray disinfection/decontamination system intended to provide quick turnover of any affected space; SteraMist Environment System, a transportable, remotely controlled system that provides complete room disinfection/decontamination of a sealed space up to 103.8 m3; and The SteraMist Hospital Disinfection Cart, a solution to aid its hospital-healthcare customers in providing the quality of care and safety to their patients by disinfecting patient and operating rooms, pharmacies, ambulances, and emergency environments in a hospital or healthcare facility. The company also offers SteraMist Select Surface Unit; Stainless Steel 90-Degree Applicator; iHP Plasma Decontamination Chamber; SteraMist Custom Engineered System; and iHP Corporate Service Decontamination. In addition, it provides full room, equipment, facility, and emergency disinfection and decontamination services. The company manufactures, sells, services, and licenses SteraMist Binary Ionization Technology, a hydrogen peroxide-based mist and fog. Its products and services are used in pharmaceutical companies, clean rooms, hospitals and medical facilities, ambulances, bio-safety labs, tissue and blood labs, pharmaceutical labs, vivariums, research universities military and government agencies, office buildings, schools, athletic facilities, single-family homes and multi-unit residences, cruise ships, schools, and entertainment establishments; patient medical transport airline, hospitality, and transportation industries; and cannabis market. The company was incorporated in 1979 and is headquartered in Frederick, Maryland.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Frederick",
        "zipcode": "21701",
        "website": "http://tomimist.com",
        "market_cap": "Small Cap"
    },
    "UVFT": {
        "short_name": "UV FLU TECHNOLOGIES INC",
        "long_name": "UV Flu Technologies, Inc.",
        "summary": "UV Flu Technologies, Inc. engages in the research, development, manufacture, and sale of air purification systems and products primarily in the United States. Its flagship product is the ViraTech UV-400, which utilizes high-intensity germicidal ultraviolet radiation inside a killing chamber that goes beyond filtering to trap and destroy harmful microbes. The company also offers RX Air product line, which include HEPA based air purifiers. Its products are used in hotels, hair and nail salons, pet kennels, test labs, hospitals, restaurants, casinos, and military installations. The company was formerly known as Northwest Chariots Incorporated and changed its name to UV Flu Technologies, Inc. in November 2009. UV Flu Technologies, Inc. was founded in 2006 and is based in Lincolnshire, Illinois.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Lincolnshire",
        "zipcode": "60069",
        "website": "http://www.uvflutech.com",
        "market_cap": "Small Cap"
    },
    "WCE.F": {
        "short_name": "CECO ENVIRONMTL  DL-,01",
        "long_name": "CECO Environmental Corp.",
        "summary": "CECO Environmental Corp. provides industrial air quality and fluid handling systems for the energy, industrial, and other niche markets worldwide. It operates through three segments: Energy Solutions, Industrial Solutions, and Fluid Handling Solutions. The company engineers, designs, builds, and installs systems that capture, clean, and destroy airborne contaminants from industrial facilities, as well as equipment that control emissions from such facilities; and fluid handling and filtration systems. Its products and services include dampers and diverters, selective catalytic reduction and selective non-catalytic reduction systems, cyclonic technology, thermal oxidizers, filtration systems, scrubbers, and fluid handling equipment, as well as plant engineering services and engineered design build fabrication. The company markets its products and services to natural gas processors, transmission and distribution companies, refineries, power generators, industrial manufacturing, engineering and construction companies, semiconductor manufacturers, compressor manufacturers, metals and minerals, and electric vehicle producer companies. CECO Environmental Corp. was incorporated in 1966 and is headquartered in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75254",
        "website": "http://www.cecoenviro.com",
        "market_cap": "Small Cap"
    },
    "WTII": {
        "short_name": "WATER TECHNOLOGIES INTERNATIONA",
        "long_name": "Water Technologies International, Inc.",
        "summary": "Water Technologies International, Inc. engages in designing, manufacturing, and distributing atmospheric water generators and related products (AWG) in the United States. Its AWGs produce drinking water from humidity in the atmosphere, as well as provide air conditioning during the use. The company also provides packaged wastewater plants for the wastewater treatment. In addition, it provides filtration devices for AWGs. Further, the company produces and sells CBD and non-THC products, including CBD, hemp derived cannabidiol specialty water. It serves restaurants, hospitals, schools, hotels/motels, restaurants, large institutions, and military/emergency and disaster deployments. The company is based in Port St. Lucie, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Port St. Lucie",
        "zipcode": "34952",
        "website": "http://www.gr8water.net",
        "market_cap": "Small Cap"
    },
    "WTNW": {
        "short_name": "WATER NOW INC",
        "long_name": "Water Now, Inc.",
        "summary": "Water Now, Inc. develops and commercializes gas/diesel or electric powered portable devices for processing and purifying contaminated water. Its products include The Aqua 125 model for purifying fresh water that is contaminated primarily with partially dissolved solid materials, microorganisms, and other pathogens; The Aqua 1000 model to desalinate salt water with a capacity of up to 800 gallons per day; and an upgraded Aqua 1000 unit that is complemented with a reservoir mounted on a trailer with a capacity of purifying up to 800 gallons of water per day. The company also engages in the installation and operation of oil recovery systems. The company offers its products for disaster relief, military, and agricultural applications. Water Now, Inc. was founded in 2016 and is based in Fort Worth, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Fort Worth",
        "zipcode": "76115",
        "website": "http://www.waternowinc.com",
        "market_cap": "Small Cap"
    }
}