{
    "8HY.F": {
        "short_name": "HYRECAR INC.  DL-,00001",
        "long_name": "HyreCar Inc.",
        "summary": "HyreCar Inc., together with subsidiaries, operates a web-based car-sharing marketplace in the United States. Its marketplace allows car owners to rent their idle cars to ride-sharing service drivers, such as Uber and Lyft drivers. HyreCar Inc. was incorporated in 2014 and is headquartered in Los Angeles, California.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "8HY.SG": {
        "short_name": "HyreCar Inc. Registered Shares ",
        "long_name": "HyreCar Inc.",
        "summary": "HyreCar Inc., together with subsidiaries, operates a web-based car-sharing marketplace in the United States. Its marketplace allows car owners to rent their idle cars to ride-sharing service drivers, such as Uber and Lyft drivers. HyreCar Inc. was incorporated in 2014 and is headquartered in Los Angeles, California.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "9FL.F": {
        "short_name": "FLEXSHOPPER NEW  DL-,001",
        "long_name": "FlexShopper, Inc.",
        "summary": "FlexShopper, Inc., a financial and technology company, operates an e-commerce marketplace to shop electronics, home furnishings, and other durable goods on a lease-to-own (LTO) basis. It offers durable products, such as consumer electronics; home appliances; computers, including tablets and wearables; smartphones; tires; and jewelry and furniture, such accessories. The company was formerly known as Anchor Funding Services, Inc. and changed its name to FlexShopper, Inc. in October 2013. FlexShopper, Inc. was founded in 2003 and is based in Boca Raton, Florida.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Boca Raton"
    },
    "ACY": {
        "short_name": "AeroCentury Corp.",
        "long_name": "AeroCentury Corp.",
        "summary": "AeroCentury Corp., together with its subsidiaries, provides leasing and finance services to regional airlines worldwide. The company primarily engages in leasing its aircraft portfolio consisting of mid-life regional aircraft through operating and finance leases. It also sells aircraft from its operating lease portfolio to third parties, which include other leasing companies, financial services companies, and airlines. As of December 31, 2020, the company's aircraft portfolio consisted of six aircraft held for lease, seven aircraft held for sale, and two aircraft being sold in parts. AeroCentury Corp. was incorporated in 1997 and is headquartered in Burlingame, California. On March 29, 2021, AeroCentury Corp., along with its affiliates, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the District of Delaware.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "city": "Burlingame"
    },
    "AL": {
        "short_name": "Air Lease Corporation",
        "long_name": "Air Lease Corporation",
        "summary": "Air Lease Corporation, an aircraft leasing company, engages in the purchase and leasing of new commercial jet aircraft to airlines worldwide. The company also sells aircraft from its operating lease portfolio to third parties, including other leasing companies, financial services companies, airlines, and other investors. In addition, it provides fleet management services to investors and owners of aircraft portfolios. As of December 31, 2020, the company owned a fleet of 332 aircraft, including 236 narrowbody aircraft and 96 widebody aircraft. Air Lease Corporation was incorporated in 2010 and is headquartered in Los Angeles, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "ALTG-PA": {
        "short_name": "Alta Equipment Group Inc. Depos",
        "long_name": "Alta Equipment Group Inc.",
        "summary": "Alta Equipment Group Inc. owns and operates integrated equipment dealership platforms in the United States. It operates in two segments, Material Handling and Construction Equipment. The company operates a branch network that sells, rents, and provides parts and service support for various categories of specialized equipment, including lift trucks and aerial work platforms, cranes, earthmoving equipment, and other material handling and construction equipment. It also offers repair and maintenance services for its equipment. In addition, the company designs and builds warehouses, as well as provides automated equipment installation and system integration solutions. It serves diversified manufacturing, food and beverage, wholesale/retail, construction, automotive, municipal/government, and medical sectors. Alta Equipment Group Inc. was founded in 1984 and is based in Livonia, Michigan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Livonia"
    },
    "ALTG": {
        "short_name": "Alta Equipment Group Inc.",
        "long_name": "Alta Equipment Group Inc.",
        "summary": "Alta Equipment Group Inc. owns and operates integrated equipment dealership platforms in the United States. It operates in two segments, Material Handling and Construction Equipment. The company operates a branch network that sells, rents, and provides parts and service support for various categories of specialized equipment, including lift trucks and aerial work platforms, cranes, earthmoving equipment, and other material handling and construction equipment. It also offers repair and maintenance services for its equipment. In addition, the company designs and builds warehouses, as well as provides automated equipment installation and system integration solutions. It serves diversified manufacturing, food and beverage, wholesale/retail, construction, automotive, municipal/government, and medical sectors. Alta Equipment Group Inc. was founded in 1984 and is based in Livonia, Michigan.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Livonia"
    },
    "AUK.F": {
        "short_name": "AMERCO  DL-,25",
        "long_name": "AMERCO",
        "summary": "AMERCO operates as a do-it-yourself moving and storage operator for household and commercial goods in the United States and Canada. The company's Moving and Storage segment rents trucks, trailers, portable moving and storage units, specialty rental items, and self-storage spaces primarily to the household movers; and sells moving supplies, towing accessories, and propane. It also provides uhaul.com, an online marketplace that connects consumers to independent Moving Help service providers and independent self-storage affiliates; auto transport and tow dolly options to transport vehicles; and specialty boxes for dishes, computers, and sensitive electronic equipment, as well as tapes, security locks, and packing supplies. This segment rents its products and services through a network of approximately 2,065 company operated retail moving stores and 20,100 independent U-Haul dealers. As of March 31, 2020, it had a rental fleet of approximately 176,000 trucks, 127,000 trailers, and 41,000 towing devices; and 1,745 self-storage locations with approximately 774,000 rentable storage units. The company's Property and Casualty Insurance segment offers loss adjusting and claims handling services. It also provides moving and storage protection packages, such as Safemove and Safetow packages, which offer moving and towing customers with a damage waiver, cargo protection, and medical and life insurance coverage; Safestor that protects storage customers from loss on their goods in storage; Safestor Mobile, which protects customers stored belongings; and Safemove Plus, which provides rental customers with a layer of primary liability protection. The company's Life Insurance segment provides life and health insurance products primarily to the senior market through the direct writing and reinsuring of life insurance, medicare supplement, and annuity policies. AMERCO was founded in 1945 and is based in Reno, Nevada.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Reno"
    },
    "AVLA.F": {
        "short_name": "AIR LEASE CORP. A DL -,01",
        "long_name": "Air Lease Corporation",
        "summary": "Air Lease Corporation, an aircraft leasing company, engages in the purchase and leasing of new commercial jet aircraft to airlines worldwide. The company also sells aircraft from its operating lease portfolio to third parties, including other leasing companies, financial services companies, airlines, and other investors. In addition, it provides fleet management services to investors and owners of aircraft portfolios. As of December 31, 2020, the company owned a fleet of 332 aircraft, including 236 narrowbody aircraft and 96 widebody aircraft. Air Lease Corporation was incorporated in 2010 and is headquartered in Los Angeles, California.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "AZD.F": {
        "short_name": "PROG HOLDINGS A  DL-,50",
        "long_name": "PROG Holdings, Inc.",
        "summary": "PROG Holdings, Inc. operates as an omnichannel provider of lease-purchase solutions to underserved and credit-challenged customers. It operates in two segments, Progressive Leasing and Vive. The Progressive Leasing segment offers lease-purchase solutions to customers for various merchandize in the furniture, appliances, electronics, jewelry, mobile phones and accessories, mattresses, and automobile electronics and accessories markets through point-of-sale and e-commerce retail partners, as well in-store, mobile, and online solutions. The Vive segment provides second-look and revolving credit products to customers that may not qualify for traditional prime lending through private label and Vive-branded credit cards. It offers lease-purchase solutions through approximately 25,000 third-party point-of-sale partner locations and e-commerce websites in 45 states and the District of Columbia. The company was formerly known as Aaron's Holdings Company, Inc. and changed its name to PROG Holdings, Inc. in December 2020. PROG Holdings, Inc. was founded in 1955 and is based in Draper, Utah.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Draper"
    },
    "AZK.F": {
        "short_name": "HERTZ GLOBAL HOLDING INC.",
        "long_name": "Hertz Global Holdings, Inc.",
        "summary": "Hertz Global Holdings, Inc., together with its subsidiaries, provides airport and off airport vehicle rental and leasing services. It operates through three segments: U.S. RAC, International RAC, and All Other Operations. The company provides its vehicle rental services under the Hertz, Dollar, Thrifty, Firefly, and Flexicar brands from approximately 12,000 corporate and franchisee locations in North America, Europe, Latin America, Africa, Asia, Australia, the Caribbean, the Middle East, and New Zealand. It rents vehicles on an hourly, daily, weekend, weekly, and monthly or multi-month basis. In addition, the company offers vehicle and lease financing; acquisition and remarketing; license, title, and registration; vehicle maintenance consultation; fuel, accident, and toll management; telematics-based location, and driver performance and scorecard reporting; and fleet management services. As of December 31, 2020, it operated a rental fleet of approximately 515,700 vehicles in the United States and 131,500 vehicles in international operations. The company serves corporate and leisure customers. Hertz Global Holdings, Inc. was founded in 1918 and is headquartered in Estero, Florida.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Estero"
    },
    "CAI-PA": {
        "short_name": "CAI International, Inc. 8.50% S",
        "long_name": "CAI International, Inc.",
        "summary": "CAI International, Inc. operates as a transportation finance company in the United States, Switzerland, France, Korea, Singapore, rest of Asia, rest of Europe, and internationally. The company leases, re-leases, and disposes equipment; and contracts for the repair, repositioning, and storage of equipment. It leases its container equipment to lessees under long-term, short-term, and finance leases. The company also sells containers; and manages equipment for to third-party investors, as well as sells used containers. As of December 31, 2020, it had a container fleet comprised 1,798,520 cost equivalent units. The company was formerly known as Container Applications International, Inc. and changed its name to CAI International, Inc. in February 2007. CAI International, Inc. was incorporated in 1989 and is headquartered in San Francisco, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "San Francisco"
    },
    "CAI-PB": {
        "short_name": "CAI International, Inc. 8.50% S",
        "long_name": "CAI International, Inc.",
        "summary": "CAI International, Inc. operates as a transportation finance company in the United States, Switzerland, France, Korea, Singapore, rest of Asia, rest of Europe, and internationally. The company leases, re-leases, and disposes equipment; and contracts for the repair, repositioning, and storage of equipment. It leases its container equipment to lessees under long-term, short-term, and finance leases. The company also sells containers; and manages equipment for to third-party investors, as well as sells used containers. As of December 31, 2020, it had a container fleet comprised 1,798,520 cost equivalent units. The company was formerly known as Container Applications International, Inc. and changed its name to CAI International, Inc. in February 2007. CAI International, Inc. was incorporated in 1989 and is headquartered in San Francisco, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "San Francisco"
    },
    "CAI": {
        "short_name": "CAI International, Inc.",
        "long_name": "CAI International, Inc.",
        "summary": "CAI International, Inc. operates as a transportation finance company in the United States, Switzerland, France, Korea, Singapore, rest of Asia, rest of Europe, and internationally. The company leases, re-leases, and disposes equipment; and contracts for the repair, repositioning, and storage of equipment. It leases its container equipment to lessees under long-term, short-term, and finance leases. The company also sells containers; and manages equipment for to third-party investors, as well as sells used containers. As of December 31, 2020, it had a container fleet comprised 1,798,520 cost equivalent units. The company was formerly known as Container Applications International, Inc. and changed its name to CAI International, Inc. in February 2007. CAI International, Inc. was incorporated in 1989 and is headquartered in San Francisco, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "San Francisco"
    },
    "CAR.MX": {
        "short_name": "AVIS BUDGET GROUP INC",
        "long_name": "Avis Budget Group, Inc.",
        "summary": "Avis Budget Group, Inc., together with its subsidiaries, provides car and truck rentals, car sharing, and ancillary services to businesses and consumers. It operates the Avis brand, a vehicle rental system that supply rental cars to the premium commercial and leisure segments of the travel industry; the Budget Truck brand, a local and one-way truck rental businesses with a fleet of approximately 20,000 vehicles, which are rented through a network of approximately 515 dealer-operated and 410 company-operated locations that serve the consumer and light commercial sectors in the continental United States; and the Zipcar brand, a car sharing network. The company also operates various other car rental brands, such as Budget, Payless, Apex, Maggiore, MoriniRent, FranceCars, Amicoblue, Turiscar, and ACL Hire. In addition, it offers optional insurance products and coverages, such as supplemental liability, personal accident, personal effects protection, emergency sickness protection, and cargo insurance products; fuel service options, roadside assistance services, electronic toll collection services, curbside delivery, tablet rentals, access to satellite radio, portable navigation units, and child safety seat rentals; automobile towing equipment and other moving accessories, such as hand trucks, furniture pads, and moving supplies; and Business Intelligence solution, an online portal for corporate travel. Avis Budget Group, Inc. operates in approximately 10,600 locations worldwide. The company was formerly known as Cendant Corporation and changed its name to Avis Budget Group, Inc. in September 2006. Avis Budget Group, Inc. was founded in 1946 and is headquartered in Parsippany, New Jersey.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Parsippany"
    },
    "CAR": {
        "short_name": "Avis Budget Group, Inc.",
        "long_name": "Avis Budget Group, Inc.",
        "summary": "Avis Budget Group, Inc., together with its subsidiaries, provides car and truck rentals, car sharing, and ancillary services to businesses and consumers. It operates the Avis brand, a vehicle rental system that supply rental cars to the premium commercial and leisure segments of the travel industry; the Budget Truck brand, a local and one-way truck rental businesses with a fleet of approximately 20,000 vehicles, which are rented through a network of approximately 515 dealer-operated and 410 company-operated locations that serve the consumer and light commercial sectors in the continental United States; and the Zipcar brand, a car sharing network. The company also operates various other car rental brands, such as Budget, Payless, Apex, Maggiore, MoriniRent, FranceCars, Amicoblue, Turiscar, and ACL Hire. In addition, it offers optional insurance products and coverages, such as supplemental liability, personal accident, personal effects protection, emergency sickness protection, and cargo insurance products; fuel service options, roadside assistance services, electronic toll collection services, curbside delivery, tablet rentals, access to satellite radio, portable navigation units, and child safety seat rentals; automobile towing equipment and other moving accessories, such as hand trucks, furniture pads, and moving supplies; and Business Intelligence solution, an online portal for corporate travel. Avis Budget Group, Inc. operates in approximately 10,600 locations worldwide. The company was formerly known as Cendant Corporation and changed its name to Avis Budget Group, Inc. in September 2006. Avis Budget Group, Inc. was founded in 1946 and is headquartered in Parsippany, New Jersey.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Parsippany"
    },
    "CTOS": {
        "short_name": "Custom Truck One Source, Inc.",
        "long_name": "Custom Truck One Source, Inc.",
        "summary": "Custom Truck One Source, Inc. provides specialty equipment, parts, tools, accessories, and services to the electric utility transmission and distribution, telecommunications, and rail industries in North America. It operates through two segments: Equipment Rental and Sales; and Parts, Tools and Accessories. The company offers specialized equipment to various customer base for the maintenance, repair, upgrade, and installation of critical infrastructure assets, including electric lines, telecommunications networks, and rail systems. As of March 8, 2021, it had a coast-to-coast rental fleet of approximately 4,500 units comprising insulated and non-insulated bucket trucks, digger derricks, line equipment, cranes, pressure diggers and drills, underground equipment, aerial devices, boom trucks, stringing gear, and hi-rail equipment, as well as repair parts, tools, and accessories. The company was formerly known as Nesco Holdings, Inc. and changed its name to Custom Truck One Source, Inc. in April 2021. Custom Truck One Source, Inc. was founded in 1988 and is based in the Kansas City, Missouri.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Kansas City"
    },
    "CUCA.F": {
        "short_name": "AVIS BUDGET GROUP  DL-,01",
        "long_name": "Avis Budget Group, Inc.",
        "summary": "Avis Budget Group, Inc., together with its subsidiaries, provides car and truck rentals, car sharing, and ancillary services to businesses and consumers. It operates the Avis brand, a vehicle rental system that supply rental cars to the premium commercial and leisure segments of the travel industry; the Budget Truck brand, a local and one-way truck rental businesses with a fleet of approximately 20,000 vehicles, which are rented through a network of approximately 515 dealer-operated and 410 company-operated locations that serve the consumer and light commercial sectors in the continental United States; and the Zipcar brand, a car sharing network. The company also operates various other car rental brands, such as Budget, Payless, Apex, Maggiore, MoriniRent, FranceCars, Amicoblue, Turiscar, and ACL Hire. In addition, it offers optional insurance products and coverages, such as supplemental liability, personal accident, personal effects protection, emergency sickness protection, and cargo insurance products; fuel service options, roadside assistance services, electronic toll collection services, curbside delivery, tablet rentals, access to satellite radio, portable navigation units, and child safety seat rentals; automobile towing equipment and other moving accessories, such as hand trucks, furniture pads, and moving supplies; and Business Intelligence solution, an online portal for corporate travel. Avis Budget Group, Inc. operates in approximately 10,600 locations worldwide. The company was formerly known as Cendant Corporation and changed its name to Avis Budget Group, Inc. in September 2006. Avis Budget Group, Inc. was founded in 1946 and is headquartered in Parsippany, New Jersey.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Parsippany"
    },
    "DW4.F": {
        "short_name": "CAI INTL INC.  DL -,0001",
        "long_name": "CAI International, Inc.",
        "summary": "CAI International, Inc. operates as a transportation finance company in the United States, Switzerland, France, Korea, Singapore, rest of Asia, rest of Europe, and internationally. The company leases, re-leases, and disposes equipment; and contracts for the repair, repositioning, and storage of equipment. It leases its container equipment to lessees under long-term, short-term, and finance leases. The company also sells containers; and manages equipment for to third-party investors, as well as sells used containers. As of December 31, 2020, it had a container fleet comprised 1,798,520 cost equivalent units. The company was formerly known as Container Applications International, Inc. and changed its name to CAI International, Inc. in February 2007. CAI International, Inc. was incorporated in 1989 and is headquartered in San Francisco, California.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Francisco"
    },
    "FPAY": {
        "short_name": "FlexShopper, Inc.",
        "long_name": "FlexShopper, Inc.",
        "summary": "FlexShopper, Inc., a financial and technology company, operates an e-commerce marketplace to shop electronics, home furnishings, and other durable goods on a lease-to-own (LTO) basis. It offers durable products, such as consumer electronics; home appliances; computers, including tablets and wearables; smartphones; tires; and jewelry and furniture, such accessories. The company was formerly known as Anchor Funding Services, Inc. and changed its name to FlexShopper, Inc. in October 2013. FlexShopper, Inc. was founded in 2003 and is based in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Boca Raton"
    },
    "FTAI-PB": {
        "short_name": "Fortress Transportation and Inf",
        "long_name": "Fortress Transportation and Infrastructure Investors LLC",
        "summary": "Fortress Transportation and Infrastructure Investors LLC owns and acquires infrastructure and related equipment for the transportation of goods and people in Africa, Asia, Europe, North America, and South America. It operates through three segments: Aviation Leasing, Jefferson Terminal, and Ports and Terminals. The Aviation Leasing segment leases aircraft and aircraft engines. As of December 31, 2020, this segment owned and managed 264 aviation assets, including 78 commercial aircraft and 186 engines. The Jefferson Terminal segment engages in the development of a multi-modal crude oil and refined products handling terminal in Beaumont, Texas; and ownership of various other assets for the transportation and processing of crude oil and related products. The Ports and Terminals segment operates Repauno, a 1,630 acre deep-water port located along the Delaware River; and Long Ridge, which is a 1,660 acre multi-modal port located along the Ohio River. The company also owns and leases offshore energy equipment and shipping containers. It serves operators of transportation and infrastructure networks comprising airlines, offshore energy service providers, energy providers, and shipping lines. The company is externally managed by FIG LLC, an affiliate of Fortress Investment Group LLC. Fortress Transportation and Infrastructure Investors LLC was founded in 2011 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "FTAI-PC": {
        "short_name": "Fortress Transportation and Inf",
        "long_name": "Fortress Transportation and Infrastructure Investors LLC",
        "summary": "Fortress Transportation and Infrastructure Investors LLC owns and acquires infrastructure and related equipment for the transportation of goods and people in Africa, Asia, Europe, North America, and South America. It operates through three segments: Aviation Leasing, Jefferson Terminal, and Ports and Terminals. The Aviation Leasing segment leases aircraft and aircraft engines. As of December 31, 2020, this segment owned and managed 264 aviation assets, including 78 commercial aircraft and 186 engines. The Jefferson Terminal segment engages in the development of a multi-modal crude oil and refined products handling terminal in Beaumont, Texas; and ownership of various other assets for the transportation and processing of crude oil and related products. The Ports and Terminals segment operates Repauno, a 1,630 acre deep-water port located along the Delaware River; and Long Ridge, which is a 1,660 acre multi-modal port located along the Ohio River. The company also owns and leases offshore energy equipment and shipping containers. It serves operators of transportation and infrastructure networks comprising airlines, offshore energy service providers, energy providers, and shipping lines. The company is externally managed by FIG LLC, an affiliate of Fortress Investment Group LLC. Fortress Transportation and Infrastructure Investors LLC was founded in 2011 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "FTAI": {
        "short_name": "Fortress Transportation and Inf",
        "long_name": "Fortress Transportation and Infrastructure Investors LLC",
        "summary": "Fortress Transportation and Infrastructure Investors LLC owns and acquires infrastructure and related equipment for the transportation of goods and people in Africa, Asia, Europe, North America, and South America. It operates through three segments: Aviation Leasing, Jefferson Terminal, and Ports and Terminals. The Aviation Leasing segment leases aircraft and aircraft engines. As of December 31, 2020, this segment owned and managed 264 aviation assets, including 78 commercial aircraft and 186 engines. The Jefferson Terminal segment engages in the development of a multi-modal crude oil and refined products handling terminal in Beaumont, Texas; and ownership of various other assets for the transportation and processing of crude oil and related products. The Ports and Terminals segment operates Repauno, a 1,630 acre deep-water port located along the Delaware River; and Long Ridge, which is a 1,660 acre multi-modal port located along the Ohio River. The company also owns and leases offshore energy equipment and shipping containers. It serves operators of transportation and infrastructure networks comprising airlines, offshore energy service providers, energy providers, and shipping lines. The company is externally managed by FIG LLC, an affiliate of Fortress Investment Group LLC. Fortress Transportation and Infrastructure Investors LLC was founded in 2011 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "GATX": {
        "short_name": "GATX Corporation",
        "long_name": "GATX Corporation",
        "summary": "GATX Corporation (NYSE: GATX) strives to be recognized as the finest railcar leasing company in the world by our customers, our shareholders, our employees and the communities where we operate. As the leading global railcar lessor, GATX has been providing quality railcars and services to its customers for more than 122 years. GATX has been headquartered in Chicago, Illinois since its founding in 1898.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Chicago"
    },
    "GAX.F": {
        "short_name": "GATX CORP.  DL-,625",
        "long_name": "GATX Corporation",
        "summary": "GATX Corporation (NYSE: GATX) strives to be recognized as the finest railcar leasing company in the world by our customers, our shareholders, our employees and the communities where we operate. As the leading global railcar lessor, GATX has been providing quality railcars and services to its customers for more than 122 years. GATX has been headquartered in Chicago, Illinois since its founding in 1898.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Chicago"
    },
    "GFN": {
        "short_name": "General Finance Corporation",
        "long_name": "General Finance Corporation",
        "summary": "General Finance Corporation, a specialty rental services company, provides portable storage, modular space, and liquid containment solutions in North America and the Asia-Pacific regions. The company's portable storage products include storage containers for classroom equipment storage, construction equipment and tool storage, disaster shelters, landscaping sheds, recreational equipment storage, and retail inventory storage applications; and freight containers used in freight transportation. Its modular space products comprise office or portable building containers, ground level offices, and modular buildings and offices for use in general administrative office spaces, military installations, workforce living accommodations, bank branches, classrooms/education, construction offices, day-care facilities, dormitories, general administrative office space, healthcare and rental facilities, retail space, and shelters. The company's liquid containment products consist of portable liquid storage tanks for well-site liquid containment needs, expansion/upgrade projects, highway construction/groundwater sewage, infrastructure projects, major industrial projects, mining pit pump works, municipal sewer and water projects, non-residential construction projects, pipeline construction and maintenance, and refinery turnarounds. It also provides steps, ramps, furniture, portable toilets, security systems, shelving, mud pumps, hoses, splitter valves, tee connectors, and other items used in connection with leased equipment. In addition, the company offers temporary prison holding cells, hoarding units, blast-resistant units, workforce living accommodations, temporary retail frontage units, and observatory units customized from storage containers, as well as shipping container modifications, specialty trailers and tanks, chassis, storm shelters, and trash hoppers. The company was founded in 2005 and is headquartered in Pasadena, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Pasadena"
    },
    "GFNCP": {
        "short_name": "General Finance Corporation - C",
        "long_name": "General Finance Corporation",
        "summary": "General Finance Corporation, a specialty rental services company, provides portable storage, modular space, and liquid containment solutions in North America and the Asia-Pacific regions. The company's portable storage products include storage containers for classroom equipment storage, construction equipment and tool storage, disaster shelters, landscaping sheds, recreational equipment storage, and retail inventory storage applications; and freight containers used in freight transportation. Its modular space products comprise office or portable building containers, ground level offices, and modular buildings and offices for use in general administrative office spaces, military installations, workforce living accommodations, bank branches, classrooms/education, construction offices, day-care facilities, dormitories, general administrative office space, healthcare and rental facilities, retail space, and shelters. The company's liquid containment products consist of portable liquid storage tanks for well-site liquid containment needs, expansion/upgrade projects, highway construction/groundwater sewage, infrastructure projects, major industrial projects, mining pit pump works, municipal sewer and water projects, non-residential construction projects, pipeline construction and maintenance, and refinery turnarounds. It also provides steps, ramps, furniture, portable toilets, security systems, shelving, mud pumps, hoses, splitter valves, tee connectors, and other items used in connection with leased equipment. In addition, the company offers temporary prison holding cells, hoarding units, blast-resistant units, workforce living accommodations, temporary retail frontage units, and observatory units customized from storage containers, as well as shipping container modifications, specialty trailers and tanks, chassis, storm shelters, and trash hoppers. The company was founded in 2005 and is headquartered in Pasadena, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "city": "Pasadena"
    },
    "H6P.F": {
        "short_name": "H+E EQUIPMENT SERV.DL-,01",
        "long_name": "H&E Equipment Services, Inc.",
        "summary": "H&E Equipment Services, Inc. operates as an integrated equipment services company. The company operates in five segments: Equipment Rentals, New Equipment Sales, Used Equipment Sales, Parts Sales, and Repair and Maintenance Services. It rents, sells, and provides parts and support services for hi-lift or aerial work platform equipment, cranes, earthmoving equipment, and industrial lift trucks. The company offers heavy construction and industrial equipment for rent on a daily, weekly, and monthly basis. As of December 31, 2018, its rental fleet consisted of 43,939 pieces of equipment. The company also sells new and used equipment, as well as parts; and provides maintenance and repair services for the customers' owned equipment. In addition, it offers ancillary equipment support activities, including transportation, hauling, parts shipping, and loss damage waivers. The company serves industrial and commercial companies, construction contractors, manufacturers, public utilities, municipalities, maintenance contractors, and various other industrial account customers. As of March 2, 2020, it had a network of 94 locations throughout the Pacific Northwest, West Coast, Intermountain, Southwest, Gulf Coast, Southeast, and Mid-Atlantic regions of the United States. H&E Equipment Services, Inc. was founded in 1961 and is headquartered in Baton Rouge, Louisiana.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Baton Rouge"
    },
    "H9B1.F": {
        "short_name": "HERC HOLDINGS INC. DL-,01",
        "long_name": "Herc Holdings Inc.",
        "summary": "Herc Holdings Inc., through its subsidiaries, operates as an equipment rental supplier primarily in the United States and internationally. It rents aerial, earthmoving, material handling, trucks and trailers, air compressors, compaction, and lighting equipment. The company also provides ProSolutions, an industry specific solution based services, such as power generation, climate control, remediation and restoration, and studio and production equipment; and ProContractor professional grade tools. In addition, it offers various services, including repair, maintenance, equipment management, and safety training; and equipment re-rental and on-site support services, as well as ancillary services, such as equipment transport, rental protection, cleaning, refueling, and labor. Further, the company sells used equipment and contractor supplies, such as construction consumables, tools, small equipment, and safety supplies. It serves non-residential and residential construction, specialty trade, restoration, remediation and environment, and facility maintenance contractors; industrial manufacturing industries, including automotive and aerospace, power, metals and mining, agriculture, pulp, paper and wood, food and beverage, and refineries and petrochemical industries; infrastructure and government sectors; and commercial and retail service, hospitality, healthcare, recreation, entertainment production, and special event management customers. The company sells its products through its sales team and industry catalogs, as well as through participation and sponsorship of industry events, trade shows, and Internet. Herc Holdings Inc. was founded in 1965 and is based in Bonita Springs, Florida.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Bonita Springs"
    },
    "HEES": {
        "short_name": "H&E Equipment Services, Inc.",
        "long_name": "H&E Equipment Services, Inc.",
        "summary": "H&E Equipment Services, Inc. operates as an integrated equipment services company. The company operates in five segments: Equipment Rentals, New Equipment Sales, Used Equipment Sales, Parts Sales, and Repair and Maintenance Services. It rents, sells, and provides parts and support services for hi-lift or aerial work platform equipment, cranes, earthmoving equipment, and industrial lift trucks. The company offers heavy construction and industrial equipment for rent on a daily, weekly, and monthly basis. As of December 31, 2018, its rental fleet consisted of 43,939 pieces of equipment. The company also sells new and used equipment, as well as parts; and provides maintenance and repair services for the customers' owned equipment. In addition, it offers ancillary equipment support activities, including transportation, hauling, parts shipping, and loss damage waivers. The company serves industrial and commercial companies, construction contractors, manufacturers, public utilities, municipalities, maintenance contractors, and various other industrial account customers. As of March 2, 2020, it had a network of 94 locations throughout the Pacific Northwest, West Coast, Intermountain, Southwest, Gulf Coast, Southeast, and Mid-Atlantic regions of the United States. H&E Equipment Services, Inc. was founded in 1961 and is headquartered in Baton Rouge, Louisiana.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Baton Rouge"
    },
    "HRI.MX": {
        "short_name": "HERC HOLDINGS INC",
        "long_name": "Herc Holdings Inc.",
        "summary": "Herc Holdings Inc., through its subsidiaries, operates as an equipment rental supplier primarily in the United States and internationally. It rents aerial, earthmoving, material handling, trucks and trailers, air compressors, compaction, and lighting equipment. The company also provides ProSolutions, an industry specific solution based services, such as power generation, climate control, remediation and restoration, and studio and production equipment; and ProContractor professional grade tools. In addition, it offers various services, including repair, maintenance, equipment management, and safety training; and equipment re-rental and on-site support services, as well as ancillary services, such as equipment transport, rental protection, cleaning, refueling, and labor. Further, the company sells used equipment and contractor supplies, such as construction consumables, tools, small equipment, and safety supplies. It serves non-residential and residential construction, specialty trade, restoration, remediation and environment, and facility maintenance contractors; industrial manufacturing industries, including automotive and aerospace, power, metals and mining, agriculture, pulp, paper and wood, food and beverage, and refineries and petrochemical industries; infrastructure and government sectors; and commercial and retail service, hospitality, healthcare, recreation, entertainment production, and special event management customers. The company sells its products through its sales team and industry catalogs, as well as through participation and sponsorship of industry events, trade shows, and Internet. Herc Holdings Inc. was founded in 1965 and is based in Bonita Springs, Florida.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Bonita Springs"
    },
    "HRI": {
        "short_name": "Herc Holdings Inc.",
        "long_name": "Herc Holdings Inc.",
        "summary": "Herc Holdings Inc., through its subsidiaries, operates as an equipment rental supplier primarily in the United States and internationally. It rents aerial, earthmoving, material handling, trucks and trailers, air compressors, compaction, and lighting equipment. The company also provides ProSolutions, an industry specific solution based services, such as power generation, climate control, remediation and restoration, and studio and production equipment; and ProContractor professional grade tools. In addition, it offers various services, including repair, maintenance, equipment management, and safety training; and equipment re-rental and on-site support services, as well as ancillary services, such as equipment transport, rental protection, cleaning, refueling, and labor. Further, the company sells used equipment and contractor supplies, such as construction consumables, tools, small equipment, and safety supplies. It serves non-residential and residential construction, specialty trade, restoration, remediation and environment, and facility maintenance contractors; industrial manufacturing industries, including automotive and aerospace, power, metals and mining, agriculture, pulp, paper and wood, food and beverage, and refineries and petrochemical industries; infrastructure and government sectors; and commercial and retail service, hospitality, healthcare, recreation, entertainment production, and special event management customers. The company sells its products through its sales team and industry catalogs, as well as through participation and sponsorship of industry events, trade shows, and Internet. Herc Holdings Inc. was founded in 1965 and is based in Bonita Springs, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Bonita Springs"
    },
    "HTZGQ": {
        "short_name": "HERTZ GLOBAL HOLDINGS INC",
        "long_name": "Hertz Global Holdings, Inc.",
        "summary": "Hertz Global Holdings, Inc., together with its subsidiaries, provides airport and off airport vehicle rental and leasing services. It operates through three segments: U.S. RAC, International RAC, and All Other Operations. The company provides its vehicle rental services under the Hertz, Dollar, Thrifty, Firefly, and Flexicar brands from approximately 12,000 corporate and franchisee locations in North America, Europe, Latin America, Africa, Asia, Australia, the Caribbean, the Middle East, and New Zealand. It rents vehicles on an hourly, daily, weekend, weekly, and monthly or multi-month basis. In addition, the company offers vehicle and lease financing; acquisition and remarketing; license, title, and registration; vehicle maintenance consultation; fuel, accident, and toll management; telematics-based location, and driver performance and scorecard reporting; and fleet management services. As of December 31, 2020, it operated a rental fleet of approximately 515,700 vehicles in the United States and 131,500 vehicles in international operations. The company serves corporate and leisure customers. Hertz Global Holdings, Inc. was founded in 1918 and is headquartered in Estero, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Estero"
    },
    "HYRE": {
        "short_name": "HyreCar Inc.",
        "long_name": "HyreCar Inc.",
        "summary": "HyreCar Inc., together with subsidiaries, operates a web-based car-sharing marketplace in the United States. Its marketplace allows car owners to rent their idle cars to ride-sharing service drivers, such as Uber and Lyft drivers. HyreCar Inc. was incorporated in 2014 and is headquartered in Los Angeles, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "LEAS": {
        "short_name": "STRATEGIC ASSET LEASING INC",
        "long_name": "Strategic Asset Leasing Inc.",
        "summary": "Strategic Asset Leasing Inc., a development stage company, focuses on acquiring, developing, and operating mining energy reserves worldwide. It is also involved in the wholesale distribution of lithium and other minerals. The company was formerly known as Mammoth Energy Group, Inc. and changed its name to Strategic Asset Leasing Inc. in November 2014. Strategic Asset Leasing Inc. was founded in 2006 and is based in New York, New York. Strategic Asset Leasing Inc. operates as a subsidiary of Cede & Company.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "MGRC": {
        "short_name": "McGrath RentCorp",
        "long_name": "McGrath RentCorp",
        "summary": "McGrath RentCorp operates as a business to business rental company in the United States and internationally. It rents and sells relocatable modular buildings, portable storage containers, electronic test equipment and related accessories, and liquid and solid containment tanks and boxes. The company operates through four segments: Mobile Modular, TRS-RenTelco, Adler Tanks, and Enviroplex. The Mobile Modular segment rents and sells modular buildings designed for use as classrooms, temporary offices adjacent to existing facilities, sales offices, construction field offices, restroom buildings, health care clinics, child care facilities, office spaces, and various other purposes; and portable storage containers. The TRS-RenTelco segment rents and sells general purpose electronic test equipment, such as oscilloscopes, amplifiers, analyzers, signal source, and power source test equipment primarily to aerospace, defense, electronics, industrial, research, and semiconductor industries. It also provides communications test equipment, including network and transmission test equipment for various fiber, copper, and wireless networks to the manufacturers of communications equipment and products, electrical and communications installation contractors, field technicians, and service providers. The Adler Tanks segment rents fixed axle steel tanks for storing groundwater, wastewater, volatile organic liquids, sewage, slurry and bio sludge, oil and water mixtures, and chemicals; vacuum containers for sludge and solid materials; dewatering boxes for the separation of water contained in sludge and slurry; and roll-off and trash boxes for temporary storage and transportation of solid waste. The Enviroplex segment manufactures and sells portable classrooms directly to public school districts and other educational institutions in California. The company was incorporated in 1979 and is headquartered in Livermore, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Livermore"
    },
    "PRG": {
        "short_name": "PROG Holdings, Inc.",
        "long_name": "PROG Holdings, Inc.",
        "summary": "PROG Holdings, Inc. operates as an omnichannel provider of lease-purchase solutions to underserved and credit-challenged customers. It operates in two segments, Progressive Leasing and Vive. The Progressive Leasing segment offers lease-purchase solutions to customers for various merchandize in the furniture, appliances, electronics, jewelry, mobile phones and accessories, mattresses, and automobile electronics and accessories markets through point-of-sale and e-commerce retail partners, as well in-store, mobile, and online solutions. The Vive segment provides second-look and revolving credit products to customers that may not qualify for traditional prime lending through private label and Vive-branded credit cards. It offers lease-purchase solutions through approximately 25,000 third-party point-of-sale partner locations and e-commerce websites in 45 states and the District of Columbia. The company was formerly known as Aaron's Holdings Company, Inc. and changed its name to PROG Holdings, Inc. in December 2020. PROG Holdings, Inc. was founded in 1955 and is based in Draper, Utah.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Draper"
    },
    "R": {
        "short_name": "Ryder System, Inc.",
        "long_name": "Ryder System, Inc.",
        "summary": "Ryder System, Inc. operates as a logistics and transportation company worldwide. The company operates through three segments: Fleet Management Solutions (FMS), Supply Chain Solutions (SCS), and Dedicated Transportation Solutions (DTS). The FMS segment offers full service leasing and leasing with flexible maintenance options, as well as maintenance services, supplies, and related equipment for operation of the vehicles; commercial vehicle rental services; and contract or transactional maintenance services of trucks, tractors, and trailers, as well as fleet support services. This segment also provides access to diesel fuel; offers fuel planning and tax reporting, cards, and monitoring services, and centralized billing; and sells used vehicles through its 59 retail sales centers and Usedtrucks.Ryder.com website. The DTS segment offers equipment, maintenance, drivers, administrative, and additional services, as well as routing and scheduling, fleet sizing, safety, regulatory compliance, risk management, technology and communication systems support, and other technical support services. The SCS segment comprises distribution management services, such as designing and managing customer's distribution network and facilities; providing e-commerce services; coordinating warehousing and transportation for inbound and outbound material flows; handling import and export for international shipments; coordinating just-in-time replenishment of component parts to manufacturing and final assembly; and offering shipments to customer distribution centers or end customer delivery points, as well as other value added services, such as light assembly of components. This segment also offers transportation management services, such as shipment optimization, load scheduling, and delivery confirmation services through technological and web-based solutions; and knowledge-based professional services. Ryder System, Inc. was founded in 1933 and is headquartered in Miami, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Miami"
    },
    "RAC.F": {
        "short_name": "RENT-A-CENTER INC. DL-,01",
        "long_name": "Rent-A-Center, Inc.",
        "summary": "Rent-A-Center, Inc., together with its subsidiaries, leases household durable goods to customers on a lease-to-own basis. The company operates in four segments: Rent-A-Center Business, Preferred Lease, Mexico, and Franchising. It offers furniture and accessories, appliances, consumer electronics, computers, tablets and smartphones, tools, tires, handbags, and other accessories under rental purchase agreements. The company also provides merchandise on an installment sales basis; and the lease-to-own transaction to consumers who do not qualify for financing from the traditional retailer through kiosks located within retailer's locations. It operates retail installment sales stores under the Get It Now and Home Choice names; lease-to-own and franchised lease-to-own stores under the Rent-A-Centre, ColorTyme, and RimTyme names; and rentacenter.com, an e-commerce platform. As of December 31, 2020, the company owned and operated approximately 1,845 stores in the United States and Puerto Rico, including 44 retail installment sales stores; 45 preferred lease staffed locations in North Carolina; and 121 stores in Mexico, as well as franchised 462 lease-to-own stores in 33 states. Rent-A-Center, Inc. was founded in 1960 and is headquartered in Plano, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Plano"
    },
    "RCII": {
        "short_name": "Rent-A-Center Inc.",
        "long_name": "Rent-A-Center, Inc.",
        "summary": "Rent-A-Center, Inc., together with its subsidiaries, leases household durable goods to customers on a lease-to-own basis. The company operates in four segments: Rent-A-Center Business, Preferred Lease, Mexico, and Franchising. It offers furniture and accessories, appliances, consumer electronics, computers, tablets and smartphones, tools, tires, handbags, and other accessories under rental purchase agreements. The company also provides merchandise on an installment sales basis; and the lease-to-own transaction to consumers who do not qualify for financing from the traditional retailer through kiosks located within retailer's locations. It operates retail installment sales stores under the Get It Now and Home Choice names; lease-to-own and franchised lease-to-own stores under the Rent-A-Centre, ColorTyme, and RimTyme names; and rentacenter.com, an e-commerce platform. As of December 31, 2020, the company owned and operated approximately 1,845 stores in the United States and Puerto Rico, including 44 retail installment sales stores; 45 preferred lease staffed locations in North Carolina; and 121 stores in Mexico, as well as franchised 462 lease-to-own stores in 33 states. Rent-A-Center, Inc. was founded in 1960 and is headquartered in Plano, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Plano"
    },
    "RYD.F": {
        "short_name": "RYDER SYST.  DL-,50",
        "long_name": "Ryder System, Inc.",
        "summary": "Ryder System, Inc. operates as a logistics and transportation company worldwide. The company operates through three segments: Fleet Management Solutions (FMS), Supply Chain Solutions (SCS), and Dedicated Transportation Solutions (DTS). The FMS segment offers full service leasing and leasing with flexible maintenance options, as well as maintenance services, supplies, and related equipment for operation of the vehicles; commercial vehicle rental services; and contract or transactional maintenance services of trucks, tractors, and trailers, as well as fleet support services. This segment also provides access to diesel fuel; offers fuel planning and tax reporting, cards, and monitoring services, and centralized billing; and sells used vehicles through its 59 retail sales centers and Usedtrucks.Ryder.com website. The DTS segment offers equipment, maintenance, drivers, administrative, and additional services, as well as routing and scheduling, fleet sizing, safety, regulatory compliance, risk management, technology and communication systems support, and other technical support services. The SCS segment comprises distribution management services, such as designing and managing customer's distribution network and facilities; providing e-commerce services; coordinating warehousing and transportation for inbound and outbound material flows; handling import and export for international shipments; coordinating just-in-time replenishment of component parts to manufacturing and final assembly; and offering shipments to customer distribution centers or end customer delivery points, as well as other value added services, such as light assembly of components. This segment also offers transportation management services, such as shipment optimization, load scheduling, and delivery confirmation services through technological and web-based solutions; and knowledge-based professional services. Ryder System, Inc. was founded in 1933 and is headquartered in Miami, Florida.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Miami"
    },
    "U1RI34.SA": {
        "short_name": "UNITED RENTADRN",
        "long_name": "United Rentals, Inc.",
        "summary": "United Rentals, Inc., through its subsidiaries, operates as an equipment rental company. It operates in two segments, General Rentals; and Trench, Power and Fluid Solutions. The General Rentals segment rents general construction and industrial equipment, including backhoes, skid-steer loaders, forklifts, earthmoving equipment, and material handling equipment; aerial work platforms, such as boom lifts and scissor lifts; and general tools and light equipment comprising pressure washers, water pumps, and power tools. It serves construction and industrial companies, manufacturers, utilities, municipalities, homeowners, and government entities. The Trench, Power and Fluid Solutions segment rents specialty construction products that include trench safety equipment, which comprise trench shields, aluminum hydraulic shoring systems, slide rails, crossing plates, construction lasers, and line testing equipment for underground work; and power, as well as heating, ventilating, and air conditioning equipment, including portable diesel generators, electrical distribution equipment, and temperature control equipment. It is also involved in the rental of fluid solutions equipment primarily used for fluid containment, transfer, and treatment. This segment serves construction companies involved in infrastructure projects, and municipalities and industrial companies. The company also sells aerial lifts, reach forklifts, telehandlers, compressors, and generators; construction consumables, tools, small equipment, and safety supplies; and parts for equipment that is owned by its customers, as well as provides repair and maintenance services. United Rentals, Inc. sells its used equipment through its sales force, brokers, and Website, as well as at auctions and directly to manufacturers. As of January 1, 2021, the company operated a network of 1,165 rental locations, including 1,018 of these locations are in the United States, 136 are in Canada, and 11 are in Europe. United Rentals, Inc. was founded in 1997 and is headquartered in Stamford, Connecticut.",
        "currency": "BRL",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Stamford"
    },
    "UHAL": {
        "short_name": "Amerco",
        "long_name": "AMERCO",
        "summary": "AMERCO operates as a do-it-yourself moving and storage operator for household and commercial goods in the United States and Canada. The company's Moving and Storage segment rents trucks, trailers, portable moving and storage units, specialty rental items, and self-storage spaces primarily to the household movers; and sells moving supplies, towing accessories, and propane. It also provides uhaul.com, an online marketplace that connects consumers to independent Moving Help service providers and independent self-storage affiliates; auto transport and tow dolly options to transport vehicles; and specialty boxes for dishes, computers, and sensitive electronic equipment, as well as tapes, security locks, and packing supplies. This segment rents its products and services through a network of approximately 2,065 company operated retail moving stores and 20,100 independent U-Haul dealers. As of March 31, 2020, it had a rental fleet of approximately 176,000 trucks, 127,000 trailers, and 41,000 towing devices; and 1,745 self-storage locations with approximately 774,000 rentable storage units. The company's Property and Casualty Insurance segment offers loss adjusting and claims handling services. It also provides moving and storage protection packages, such as Safemove and Safetow packages, which offer moving and towing customers with a damage waiver, cargo protection, and medical and life insurance coverage; Safestor that protects storage customers from loss on their goods in storage; Safestor Mobile, which protects customers stored belongings; and Safemove Plus, which provides rental customers with a layer of primary liability protection. The company's Life Insurance segment provides life and health insurance products primarily to the senior market through the direct writing and reinsuring of life insurance, medicare supplement, and annuity policies. AMERCO was founded in 1945 and is based in Reno, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Reno"
    },
    "UR3.DE": {
        "short_name": "UNITED RENTALS INC.DL-,01",
        "long_name": "United Rentals, Inc.",
        "summary": "United Rentals, Inc., through its subsidiaries, operates as an equipment rental company. It operates in two segments, General Rentals; and Trench, Power and Fluid Solutions. The General Rentals segment rents general construction and industrial equipment, including backhoes, skid-steer loaders, forklifts, earthmoving equipment, and material handling equipment; aerial work platforms, such as boom lifts and scissor lifts; and general tools and light equipment comprising pressure washers, water pumps, and power tools. It serves construction and industrial companies, manufacturers, utilities, municipalities, homeowners, and government entities. The Trench, Power and Fluid Solutions segment rents specialty construction products that include trench safety equipment, which comprise trench shields, aluminum hydraulic shoring systems, slide rails, crossing plates, construction lasers, and line testing equipment for underground work; and power, as well as heating, ventilating, and air conditioning equipment, including portable diesel generators, electrical distribution equipment, and temperature control equipment. It is also involved in the rental of fluid solutions equipment primarily used for fluid containment, transfer, and treatment. This segment serves construction companies involved in infrastructure projects, and municipalities and industrial companies. The company also sells aerial lifts, reach forklifts, telehandlers, compressors, and generators; construction consumables, tools, small equipment, and safety supplies; and parts for equipment that is owned by its customers, as well as provides repair and maintenance services. United Rentals, Inc. sells its used equipment through its sales force, brokers, and Website, as well as at auctions and directly to manufacturers. As of January 1, 2021, the company operated a network of 1,165 rental locations, including 1,018 of these locations are in the United States, 136 are in Canada, and 11 are in Europe. United Rentals, Inc. was founded in 1997 and is headquartered in Stamford, Connecticut.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Stamford"
    },
    "UR3.F": {
        "short_name": "UNITED RENTALS INC.DL-,01",
        "long_name": "United Rentals, Inc.",
        "summary": "United Rentals, Inc., through its subsidiaries, operates as an equipment rental company. It operates in two segments, General Rentals; and Trench, Power and Fluid Solutions. The General Rentals segment rents general construction and industrial equipment, including backhoes, skid-steer loaders, forklifts, earthmoving equipment, and material handling equipment; aerial work platforms, such as boom lifts and scissor lifts; and general tools and light equipment comprising pressure washers, water pumps, and power tools. It serves construction and industrial companies, manufacturers, utilities, municipalities, homeowners, and government entities. The Trench, Power and Fluid Solutions segment rents specialty construction products that include trench safety equipment, which comprise trench shields, aluminum hydraulic shoring systems, slide rails, crossing plates, construction lasers, and line testing equipment for underground work; and power, as well as heating, ventilating, and air conditioning equipment, including portable diesel generators, electrical distribution equipment, and temperature control equipment. It is also involved in the rental of fluid solutions equipment primarily used for fluid containment, transfer, and treatment. This segment serves construction companies involved in infrastructure projects, and municipalities and industrial companies. The company also sells aerial lifts, reach forklifts, telehandlers, compressors, and generators; construction consumables, tools, small equipment, and safety supplies; and parts for equipment that is owned by its customers, as well as provides repair and maintenance services. United Rentals, Inc. sells its used equipment through its sales force, brokers, and Website, as well as at auctions and directly to manufacturers. As of January 1, 2021, the company operated a network of 1,165 rental locations, including 1,018 of these locations are in the United States, 136 are in Canada, and 11 are in Europe. United Rentals, Inc. was founded in 1997 and is headquartered in Stamford, Connecticut.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Stamford"
    },
    "URI.MX": {
        "short_name": "UNITED RENTALS INC",
        "long_name": "United Rentals, Inc.",
        "summary": "United Rentals, Inc., through its subsidiaries, operates as an equipment rental company. It operates in two segments, General Rentals; and Trench, Power and Fluid Solutions. The General Rentals segment rents general construction and industrial equipment, including backhoes, skid-steer loaders, forklifts, earthmoving equipment, and material handling equipment; aerial work platforms, such as boom lifts and scissor lifts; and general tools and light equipment comprising pressure washers, water pumps, and power tools. It serves construction and industrial companies, manufacturers, utilities, municipalities, homeowners, and government entities. The Trench, Power and Fluid Solutions segment rents specialty construction products that include trench safety equipment, which comprise trench shields, aluminum hydraulic shoring systems, slide rails, crossing plates, construction lasers, and line testing equipment for underground work; and power, as well as heating, ventilating, and air conditioning equipment, including portable diesel generators, electrical distribution equipment, and temperature control equipment. It is also involved in the rental of fluid solutions equipment primarily used for fluid containment, transfer, and treatment. This segment serves construction companies involved in infrastructure projects, and municipalities and industrial companies. The company also sells aerial lifts, reach forklifts, telehandlers, compressors, and generators; construction consumables, tools, small equipment, and safety supplies; and parts for equipment that is owned by its customers, as well as provides repair and maintenance services. United Rentals, Inc. sells its used equipment through its sales force, brokers, and Website, as well as at auctions and directly to manufacturers. As of January 1, 2021, the company operated a network of 1,165 rental locations, including 1,018 of these locations are in the United States, 136 are in Canada, and 11 are in Europe. United Rentals, Inc. was founded in 1997 and is headquartered in Stamford, Connecticut.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Stamford"
    },
    "URI": {
        "short_name": "United Rentals, Inc.",
        "long_name": "United Rentals, Inc.",
        "summary": "United Rentals, Inc., through its subsidiaries, operates as an equipment rental company. It operates in two segments, General Rentals; and Trench, Power and Fluid Solutions. The General Rentals segment rents general construction and industrial equipment, including backhoes, skid-steer loaders, forklifts, earthmoving equipment, and material handling equipment; aerial work platforms, such as boom lifts and scissor lifts; and general tools and light equipment comprising pressure washers, water pumps, and power tools. It serves construction and industrial companies, manufacturers, utilities, municipalities, homeowners, and government entities. The Trench, Power and Fluid Solutions segment rents specialty construction products that include trench safety equipment, which comprise trench shields, aluminum hydraulic shoring systems, slide rails, crossing plates, construction lasers, and line testing equipment for underground work; and power, as well as heating, ventilating, and air conditioning equipment, including portable diesel generators, electrical distribution equipment, and temperature control equipment. It is also involved in the rental of fluid solutions equipment primarily used for fluid containment, transfer, and treatment. This segment serves construction companies involved in infrastructure projects, and municipalities and industrial companies. The company also sells aerial lifts, reach forklifts, telehandlers, compressors, and generators; construction consumables, tools, small equipment, and safety supplies; and parts for equipment that is owned by its customers, as well as provides repair and maintenance services. United Rentals, Inc. sells its used equipment through its sales force, brokers, and Website, as well as at auctions and directly to manufacturers. As of January 1, 2021, the company operated a network of 1,165 rental locations, including 1,018 of these locations are in the United States, 136 are in Canada, and 11 are in Europe. United Rentals, Inc. was founded in 1997 and is headquartered in Stamford, Connecticut.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Stamford"
    },
    "WIJ.F": {
        "short_name": "WILLIS LEASE FIN.  DL-,01",
        "long_name": "Willis Lease Finance Corporation",
        "summary": "Willis Lease Finance Corporation operates as a lessor and servicer of commercial aircraft and aircraft engines worldwide. The company operates through two segments, Leasing and Related Operations, and Spare Parts Sales. The Leasing and Related Operations segment engages in acquiring and leasing commercial aircraft, aircraft engines, and other aircraft equipment, as well as the purchase and resale of commercial aircraft engines and other aircraft equipment, and other related businesses. The Spare Parts Sales segment purchases and resells after-market engine parts, whole engines, engine modules, and portable aircraft components. Willis Lease Finance Corporation was founded in 1985 and is headquartered in Coconut Creek, Florida.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Coconut Creek"
    },
    "WLFC": {
        "short_name": "Willis Lease Finance Corporatio",
        "long_name": "Willis Lease Finance Corporation",
        "summary": "Willis Lease Finance Corporation operates as a lessor and servicer of commercial aircraft and aircraft engines worldwide. The company operates through two segments, Leasing and Related Operations, and Spare Parts Sales. The Leasing and Related Operations segment engages in acquiring and leasing commercial aircraft, aircraft engines, and other aircraft equipment, as well as the purchase and resale of commercial aircraft engines and other aircraft equipment, and other related businesses. The Spare Parts Sales segment purchases and resells after-market engine parts, whole engines, engine modules, and portable aircraft components. Willis Lease Finance Corporation was founded in 1985 and is headquartered in Coconut Creek, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Coconut Creek"
    },
    "WS11.F": {
        "short_name": "WILLSCOT MOB.MINI  DL-,01",
        "long_name": "WillScot Mobile Mini Holdings Corp.",
        "summary": "WillScot Mobile Mini Holdings Corp. provides modular space and portable storage solutions in the United States, Canada, Mexico, and the United Kingdom. The company leases various office space and storage solutions for temporary applications across a customer base in the commercial and industrial, construction, retail, education, natural resources, health care, government, transportation, security, and energy sectors. It operates a fleet of over 350,000 portable offices and storage containers. WillScot Mobile Mini Holdings Corp. is headquartered in Phoenix, Arizona.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Phoenix"
    },
    "WSC": {
        "short_name": "WillScot Mobile Mini Holdings C",
        "long_name": "WillScot Mobile Mini Holdings Corp.",
        "summary": "WillScot Mobile Mini Holdings Corp. provides modular space and portable storage solutions in the United States, Canada, Mexico, and the United Kingdom. The company leases various office space and storage solutions for temporary applications across a customer base in the commercial and industrial, construction, retail, education, natural resources, health care, government, transportation, security, and energy sectors. It operates a fleet of over 350,000 portable offices and storage containers. WillScot Mobile Mini Holdings Corp. is headquartered in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Phoenix"
    },
    "WSHE": {
        "short_name": "GREENLINK INTERNATIONAL INC",
        "long_name": "GreenLink International Inc.",
        "summary": "GreenLink International Inc., through its subsidiaries, provides integrated electronic commerce and payment solutions. It operates through three segments: Payment Services, Merchant Services, and Card Issuing. The company provides a range of transaction processing, switching, and card issuance services in the prepaid and private-label payroll card products. The Payment Services segment provides consumer-to-consumer money transfers, consumer-to-business transfers, and prepaid services. The Merchant Services segment offers merchant acquiring services; automated teller machine (ATM) and point of sale (POS) equipment sales and services; ATM and POS equipment financing services; and network acquiring and processing services. The Card Issuing segment provides debit network issuing and processing, credit and retail card processing, and software processing services. This segment offers its services under the brand name of E-Debit International Inc. The company was formerly known as E-Debit Global Corporation and changed its name to GreenLink International Inc. in July 2018. GreenLink International Inc. was incorporated in 1998 and is based in Tacoma, Washington.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Tacoma"
    }
}