{
    "2VI.F": {
        "short_name": "ARLO TECHS INC.  DL-,001",
        "long_name": "Arlo Technologies, Inc.",
        "summary": "Arlo Technologies, Inc., together with its subsidiaries, provides smart connected devices to monitor the environments in real-time with a Wi-Fi or a cellular connection in the Americas, Europe, the Middle-East and Africa, and the Asia Pacific regions. It offers Arlo Q and Arlo Q Plus, an indoor wired solution that allow users to monitor their surroundings; Arlo Go, a LTE-enabled wire-free camera that provides untethered mobile security; Arlo Baby, a baby monitor with air quality and temperature sensors, motion and audio detection, and advanced night vision; Arlo Chime, a product that plugs into standard wall outlet and pairs with the Arlo Audio Doorbell to play various ringtones or act as a siren; and Arlo Ultra, an integrated spotlight and crystal-clear two-way audio with advanced noise cancellations camera. The company also offers Arlo Pro 3, an integrated spotlight with color night vision camera; Arlo Video Doorbell delivers direct-to-mobile video calls and personalized alerts; and Arlo Floodlight Camera, a wire-free variant LED camera, as well as Arlo Essential Spotlight; Arlo Ultra 2; and Arlo Essential XL Spotlight. In addition, it provides Arlo accessories, such as charging accessories, device mounts, and device skins; Arlo Essential Wire-Free Video Doorbell that joins a robust ecosystem of home security products and services; and Arlo Pro 4 Wire-Free Spotlight. Further, the company offers Arlo app for iOS and Android devices that allow users to connect various devices; and prepaid services, including seven-day cloud video storage with the ability to connect up to five cameras and 90 days of customer support. The company offers its products through retail channels, wholesale distribution and wireless carrier channels, and paid subscription services. Arlo Technologies, Inc. was incorporated in 2018 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "San Jose",
        "zipcode": "95134",
        "website": "http://www.arlo.com",
        "market_cap": "Small Cap"
    },
    "3RT.DE": {
        "short_name": "RESIDEO TECHN. WI DL,-001",
        "long_name": "Resideo Technologies, Inc.",
        "summary": "Resideo Technologies, Inc. develops, manufactures, and sells comfort, residential thermal, and security solutions to the commercial and residential end markets in the United States, Europe, and internationally. The company operates in two segments, Products & Solutions, and ADI Global Distribution. It offers temperature and humidity control, thermal and combustion solutions, and water and air solutions; and security panels, sensors, peripherals, wires and cables, communication devices, video cameras, awareness solutions, cloud infrastructure, installation and maintenance tools, and related software products under the Honeywell Home brand. In addition, the company distributes security products comprising video, intrusion, and access control products; and smart home, fire, power, audio, ProAV, networking, communication, wire and cable, enterprise connectivity, and structured wiring products to contractors that service non-residential and residential end-users. It sells its products through a network of distributors, original equipment manufacturers, and service providers, as well as retail and online channels. Resideo Technologies, Inc. was incorporated in 2018 and is headquartered in Austin, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "TX",
        "city": "Austin",
        "zipcode": "78702",
        "website": "http://www.resideo.com",
        "market_cap": "Mid Cap"
    },
    "3RT.F": {
        "short_name": "RESIDEO TECHN. WI DL,-001",
        "long_name": "Resideo Technologies, Inc.",
        "summary": "Resideo Technologies, Inc. develops, manufactures, and sells comfort, residential thermal, and security solutions to the commercial and residential end markets in the United States, Europe, and internationally. The company operates in two segments, Products & Solutions, and ADI Global Distribution. It offers temperature and humidity control, thermal and combustion solutions, and water and air solutions; and security panels, sensors, peripherals, wires and cables, communication devices, video cameras, awareness solutions, cloud infrastructure, installation and maintenance tools, and related software products under the Honeywell Home brand. In addition, the company distributes security products comprising video, intrusion, and access control products; and smart home, fire, power, audio, ProAV, networking, communication, wire and cable, enterprise connectivity, and structured wiring products to contractors that service non-residential and residential end-users. It sells its products through a network of distributors, original equipment manufacturers, and service providers, as well as retail and online channels. Resideo Technologies, Inc. was incorporated in 2018 and is headquartered in Austin, Texas.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Austin",
        "zipcode": "78702",
        "website": "http://www.resideo.com",
        "market_cap": "Mid Cap"
    },
    "ABPR": {
        "short_name": "AIRBORNE SECURITY & PROTECTION ",
        "long_name": "Airborne Security & Protective Services, Inc.",
        "summary": "Airborne Security & Protective Services, Inc. operates as a security service company in the United States. It offers personnel security services, including event security, fire watch or incident watch, investigations, loss prevention, security consultants, interior and exterior escort services, off duty LEO, motor escort, and K9, as well as concierge, front desk, and doorman services. The company also provides unarmed officers, who observe, report, and maintain access control; unarmed officer with tasers, batons, and handcuffs used in medium risk facilities; armed officers with firearms, batons, and handcuffs used in high risk facilities; and executive protection specialists. In addition, it offers security system services, such as access control, anti-terrorism standards and training, drug and alcohol detection, evacuation planning, law enforcement communication, inventory control, ID/badge systems, incident management, post-order/safety, security plan development, vehicle bomb search techniques, perimeter protection, alarm monitoring, CCTV installation and monitoring, client training, ATM servicing, high Value/risk transport, and secure transactions, as well as CPR, first aid, and AED services. The company was formerly known as Quality Restaurant Ventures, Inc. and changed its name to Airborne Security & Protective Services, Inc. in April 2010. Airborne Security & Protective Services, Inc. is headquartered in North Miami Beach, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "North Miami Beach",
        "zipcode": "33162",
        "website": "http://airbornesecurityservice.com",
        "market_cap": "Small Cap"
    },
    "ADT": {
        "short_name": "ADT Inc.",
        "long_name": "ADT Inc.",
        "summary": "ADT Inc. provides security, automation, and smart home solutions to consumer and business customers in the United States. It provides a range of fire detection, fire suppression, video surveillance, and access control systems to residential, commercial, and multi-site customers. The company primarily offers monitored security and automation solutions, including the installation and monitoring of security and premises automation systems designed to detect intrusion, control access, sense movement, smoke, fire, carbon monoxide, flooding, temperature, and other environmental conditions and hazards; and address personal emergencies, such as injuries, medical emergencies, or incapacitation. It also provides interactive and smart home solutions that allow customers to use their smart phones, tablets, and laptops to arm and disarm their security systems, adjust lighting or thermostat levels, and view real-time video of their premises; and create customized and automated schedules for managing lights, thermostats, appliances, garage doors, cameras, and other connected devices, as well as offers monitoring and maintenance services. The company offers its products under the ADT, ADT Pulse, Protection 1, ADT Commercial, and Blue by ADT names. As of December 31, 2020, it operated through a network of approximately 300 sales and service offices, 9 underwriter laboratories listed monitoring centers, 18 sales and customer and field support locations, 4 national sales call centers, and 3 regional distribution centers. The company was formerly known as Prime Security Services Parent, Inc. and changed its name to ADT Inc. in September 2017. ADT Inc. was founded in 1874 and is headquartered in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Boca Raton",
        "zipcode": "33431",
        "website": "http://www.adt.com",
        "market_cap": "Mid Cap"
    },
    "AFAP": {
        "short_name": "AFA PROTECTIVE SYSTEMS INC",
        "long_name": "AFA Protective Systems, Inc.",
        "summary": "AFA Protective Systems, Inc., together with its subsidiaries, installs, operates, maintains, and sells protective systems to safeguard life and property from various hazards primarily in the eastern United States. It offers fire alarm and mass notification systems; burglar alarm, access control, and video surveillance systems; business systems, such as time keeping and telecom; communication systems, including audio/visual intercom, public address, and school communication; and emergency systems comprising mass notification, nurse call, blue light emergency, and bi-directional amplifier solutions. The company also provides fire alarm services, such as installation, maintenance, and inspection; and monitoring and security services. It serves customers in the commercial, residential, real estate, industrial, retail, government, transportation, banking and financial, healthcare, and education sectors; architects and engineers; and national accounts. The company was formerly known as Automatic Fire Alarm Co. and changed its name to AFA Protective Systems, Inc. in 1970. AFA Protective Systems, Inc. was founded in 1873 and is headquartered in Syosset, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Syosset",
        "zipcode": "11791",
        "website": "http://www.afap.com",
        "market_cap": "Small Cap"
    },
    "ALLQ": {
        "short_name": "ALL-Q-TELL CORP",
        "long_name": "ALL-Q-TELL Corp.",
        "summary": "ALL-Q-TELL Corp., through its subsidiaries, develops integrated solutions in the areas of security, intelligence, and law enforcement for addressing threats to the United States and other its allies nations' national security. It also provides strategic, tactical intelligence, and security services to multinational organizations, and the United States and international government customers. The company was formerly known as Sleep Holdings Inc. and changed its name to ALL-Q-TELL Corp. in November 2010. ALL-Q-TELL Corp. is based in Dallas, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75234",
        "website": null,
        "market_cap": "Small Cap"
    },
    "ARGL": {
        "short_name": "ARGYLE SECURITY INC",
        "long_name": "Argyle Security, Inc.",
        "summary": "Argyle Security, Inc., a detention and commercial security provider, engages in designing and integrating electronic security solutions in the United States. It operates through ISI, MCS, PDI, Com-Tec, and MCS Fire & Security business units. The ISI business unit designs, engineers, supplies, installs, and maintains an array of detention systems and equipment that include detention hardware, such as prison bars, locks, and locking systems; security glass; security furniture comprising metal furniture; detention grade hollow metal doors; frames; and windows and related accessories. Its customers include general contractors and governmental or private entities. The MCS business unit is involved in the design, engineering, supply, installation, and maintenance of complex electronic security systems for correctional facilities. This business unit provides access and door controls, intercoms, closed circuit television, and software for command center controls and intrusion perimeter systems primarily to the general contractors. The PDI business unit manufactures high security metal barriers, high security observation window systems, wire mesh, bar grating, detention furniture, and accessories. The Com-Tec business unit designs electronic security and communications systems and provides touch screen controls, UL 508A control panels, door and gate controls, closed circuit televisions, intercom and paging, security management, access control, and perimeter intrusion detection systems. The MCS Fire & Security business unit designs, engineers, supplies, installs, and maintains professional security, access control, video and fire alarm, closed circuit television, sound paging systems, and structured cabling primarily for petro-chemical, healthcare, utilities, and education customers. The company was formerly known as Argyle Security Acquisition Corporation. Argyle Security, Inc. was founded in 2005 and is headquartered in San Antonio, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "San Antonio",
        "zipcode": "78247",
        "website": "http://www.isisecurity.com",
        "market_cap": "Small Cap"
    },
    "ARLO": {
        "short_name": "Arlo Technologies, Inc.",
        "long_name": "Arlo Technologies, Inc.",
        "summary": "Arlo Technologies, Inc., together with its subsidiaries, provides smart connected devices to monitor the environments in real-time with a Wi-Fi or a cellular connection in the Americas, Europe, the Middle-East and Africa, and the Asia Pacific regions. It offers Arlo Q and Arlo Q Plus, an indoor wired solution that allow users to monitor their surroundings; Arlo Go, a LTE-enabled wire-free camera that provides untethered mobile security; Arlo Baby, a baby monitor with air quality and temperature sensors, motion and audio detection, and advanced night vision; Arlo Chime, a product that plugs into standard wall outlet and pairs with the Arlo Audio Doorbell to play various ringtones or act as a siren; and Arlo Ultra, an integrated spotlight and crystal-clear two-way audio with advanced noise cancellations camera. The company also offers Arlo Pro 3, an integrated spotlight with color night vision camera; Arlo Video Doorbell delivers direct-to-mobile video calls and personalized alerts; and Arlo Floodlight Camera, a wire-free variant LED camera, as well as Arlo Essential Spotlight; Arlo Ultra 2; and Arlo Essential XL Spotlight. In addition, it provides Arlo accessories, such as charging accessories, device mounts, and device skins; Arlo Essential Wire-Free Video Doorbell that joins a robust ecosystem of home security products and services; and Arlo Pro 4 Wire-Free Spotlight. Further, the company offers Arlo app for iOS and Android devices that allow users to connect various devices; and prepaid services, including seven-day cloud video storage with the ability to connect up to five cameras and 90 days of customer support. The company offers its products through retail channels, wholesale distribution and wireless carrier channels, and paid subscription services. Arlo Technologies, Inc. was incorporated in 2018 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Jose",
        "zipcode": "95134",
        "website": "http://www.arlo.com",
        "market_cap": "Small Cap"
    },
    "ATWT": {
        "short_name": "ATWEC TECHNOLOGIES INC",
        "long_name": "ATWEC Technologies, Inc.",
        "summary": "ATWEC Technologies, Inc. develops pre school and daycare safety products related to the transportation industry. It offers Kiddie Voice Child Safety Alarm for school buses and vans, which forces the driver to the rear of the bus, and to check for passengers and reset the system; Kiddie Alert Commercial Voice Warning Backup System, a system that has volume for SUVs, church/daycare vans, buses, and trucks for preventing accidental back overs; and Kiddie Alert Voice Warning Backup System, a system that has volume for personal vehicles for preventing accidental back overs. The company was founded in 1979 and is based in Memphis, Tennessee.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TN",
        "city": "Memphis",
        "zipcode": "38112",
        "website": "http://www.atwec.com",
        "market_cap": "Small Cap"
    },
    "BCO": {
        "short_name": "Brinks Company (The)",
        "long_name": "The Brink's Company",
        "summary": "The Brink's Company provides secure transportation, cash management, and other security-related services in North America, Latin America, Europe, and internationally. The company offers armored vehicle transportation of valuables; automated teller machine (ATM) management services, such as cash replenishment, replenishment forecasting, cash optimization, ATM remote monitoring, service call dispatching, transaction processing, installation, and first and second line maintenance services; network infrastructure; and cash-in-transit services. It also provides transportation services for diamonds, jewelry, precious metals, securities, bank notes, currency, high-tech devices, electronics, and pharmaceuticals; vault outsourcing and money processing services; and services related to deploying and servicing intelligent safes and safe control devices, as well as cashier balancing, counterfeit detection, account consolidation, electronic reporting, check imaging, and reconciliation services. In addition, the company offers technology applications, including online cash tracking, cash inventory management, and other web-based tools. Further, it provides bill payment acceptance and processing services; prepaid cards and corporate debit cards; and security system design and installation services that include alarms, motion detectors, closed-circuit televisions, and digital video recorders, as well as access control systems comprising card and biometric readers, electronic locks, and turnstiles. Additionally, the company offers monitoring services; and security and guarding services to protect airports, offices, warehouses, stores, and public venues. It serves banks and financial institutions, retailers, government agencies, mints, jewelers, and other commercial operations. The company was formerly known as The Pittston Company and changed its name to The Brink's Company in May 2003. The Brink's Company was founded in 1859 and is headquartered in Richmond, Virginia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Richmond",
        "zipcode": "23226-8100",
        "website": "http://www.brinks.com",
        "market_cap": "Mid Cap"
    },
    "BJO.F": {
        "short_name": "BIO-KEY INTL  DL-,01",
        "long_name": "BIO-key International, Inc.",
        "summary": "BIO-key International, Inc., together with its subsidiaries, develops and markets fingerprint identification biometric technology, enterprise-ready identity access management solutions, and software solutions to commercial, government, and education customers in the United States and internationally. The company offers BIO-key PortalGuard and PortalGuard IDaaS solutions, a customer-controlled and neutral-by-design cloud-based identity platform that allows customers to integrate with any cloud or on-premise SaaS application, as well as windows device authentication through IAM platform. Its solutions enable its customers to secure their workforces and student populations; and make their partner networks more collaborative. In addition, it provides BIO-key VST and WEB-key products; and Civil and Large-Scale ID Infrastructure solutions develops finger-based biometric technology. Further, it offers finger scanners for enterprise and consumer markets under SideSwipe, EcoID, and SidePass brand names. The company was formerly known as SAC Technologies and changed its name to BIO-key International, Inc. in 2002. BIO-key International, Inc. was founded in 1993 and is headquartered in Wall, New Jersey.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NJ",
        "city": "Wall",
        "zipcode": "07719",
        "website": "http://www.bio-key.com",
        "market_cap": "Small Cap"
    },
    "BKYI": {
        "short_name": "BIO-key International, Inc.",
        "long_name": "BIO-key International, Inc.",
        "summary": "BIO-key International, Inc., together with its subsidiaries, develops and markets fingerprint identification biometric technology, enterprise-ready identity access management solutions, and software solutions to commercial, government, and education customers in the United States and internationally. The company offers BIO-key PortalGuard and PortalGuard IDaaS solutions, a customer-controlled and neutral-by-design cloud-based identity platform that allows customers to integrate with any cloud or on-premise SaaS application, as well as windows device authentication through IAM platform. Its solutions enable its customers to secure their workforces and student populations; and make their partner networks more collaborative. In addition, it provides BIO-key VST and WEB-key products; and Civil and Large-Scale ID Infrastructure solutions develops finger-based biometric technology. Further, it offers finger scanners for enterprise and consumer markets under SideSwipe, EcoID, and SidePass brand names. The company was formerly known as SAC Technologies and changed its name to BIO-key International, Inc. in 2002. BIO-key International, Inc. was founded in 1993 and is headquartered in Wall, New Jersey.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Wall",
        "zipcode": "07719",
        "website": "http://www.bio-key.com",
        "market_cap": "Small Cap"
    },
    "BLPG": {
        "short_name": "BLUE LINE PROTECTION GROUP INC",
        "long_name": "Blue Line Protection Group, Inc.",
        "summary": "Blue Line Protection Group, Inc. provides armed protection, logistics, and compliance services for businesses engaged in the legal cannabis industry in the United States. It offers asset logistic services comprising armored transportation services; security services, including shipment protection, money escort, security monitoring, asset vaulting, and VIP and dignitary protection; financial services, such as handling transportation and storage of currency; and training services. The company was formerly known as The Engraving Masters, Inc. and changed its name to Blue Line Protection Group, Inc. in May 2014. Blue Line Protection Group, Inc. was founded in 2006 and is headquartered in Denver, Colorado.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Denver",
        "zipcode": "80216",
        "website": "http://www.bluelineprotectiongroup.com",
        "market_cap": "Small Cap"
    },
    "BRC": {
        "short_name": "Brady Corporation",
        "long_name": "Brady Corporation",
        "summary": "Brady Corporation manufactures and supplies identification solutions (IDS) and workplace safety (WPS) products to identify and protect premises, products, and people in the United States and internationally. The IDS segment offers safety signs, floor-marking tapes, pipe markers, labeling systems, spill control products, and lockout/tagout devices for facility identification and protection; materials and printing systems for product identification, brand protection and work in process labeling, and finished product identification; and hand-held printers, wire markers, sleeves, and tags for wire identification, as well as software and services for safety compliance auditing, procedure writing, and training. Its products also comprise name tags, badges, lanyards, and access control software for people identification; wristbands and labels for tracking and enhancing the safety of patients; and custom wristbands for use in theme parks, concerts, and festivals. This segment serves customers in various industries, such as industrial and electronic manufacturing, healthcare, chemical, oil, gas, automotive, aerospace, governments, mass transit, electrical contractors, leisure and entertainment, telecommunications, and others through distributors, direct sales, catalog marketing, and digital channels. The WPS segment provides workplace safety and compliance products, such as safety and compliance signs, tags, labels, informational signage and markings, asset tracking labels, first aid products, facility safety and personal protection equipment, and labor law compliance posters for various industries, including process, government, education, construction, and utilities, as well as manufacturers through catalog and digital channels. It also offers stock and custom identification products, as well as sells related resale products. Brady Corporation was founded in 1914 and is headquartered in Milwaukee, Wisconsin.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "WI",
        "city": "Milwaukee",
        "zipcode": "53223",
        "website": "http://www.bradyid.com",
        "market_cap": "Mid Cap"
    },
    "BRV.F": {
        "short_name": "BRADY CORP.N.V.C.A DL-,01",
        "long_name": "Brady Corporation",
        "summary": "Brady Corporation manufactures and supplies identification solutions (IDS) and workplace safety (WPS) products to identify and protect premises, products, and people in the United States and internationally. The IDS segment offers safety signs, floor-marking tapes, pipe markers, labeling systems, spill control products, and lockout/tagout devices for facility identification and protection; materials and printing systems for product identification, brand protection and work in process labeling, and finished product identification; and hand-held printers, wire markers, sleeves, and tags for wire identification, as well as software and services for safety compliance auditing, procedure writing, and training. Its products also comprise name tags, badges, lanyards, and access control software for people identification; wristbands and labels for tracking and enhancing the safety of patients; and custom wristbands for use in theme parks, concerts, and festivals. This segment serves customers in various industries, such as industrial and electronic manufacturing, healthcare, chemical, oil, gas, automotive, aerospace, governments, mass transit, electrical contractors, leisure and entertainment, telecommunications, and others through distributors, direct sales, catalog marketing, and digital channels. The WPS segment provides workplace safety and compliance products, such as safety and compliance signs, tags, labels, informational signage and markings, asset tracking labels, first aid products, facility safety and personal protection equipment, and labor law compliance posters for various industries, including process, government, education, construction, and utilities, as well as manufacturers through catalog and digital channels. It also offers stock and custom identification products, as well as sells related resale products. Brady Corporation was founded in 1914 and is headquartered in Milwaukee, Wisconsin.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "WI",
        "city": "Milwaukee",
        "zipcode": "53223",
        "website": "http://www.bradyid.com",
        "market_cap": "Mid Cap"
    },
    "CIX": {
        "short_name": "CompX International Inc.",
        "long_name": "CompX International Inc.",
        "summary": "CompX International Inc. manufactures and sells security products and recreational marine components primarily in North America. It operates in two segments, Security Products and Marine Components. The Security Products segment manufactures mechanical and electrical cabinet locks, and other locking mechanisms used in various applications, including ignition systems, mailboxes, file cabinets, desk drawers, tool storage cabinets, high security medical cabinetry, integrated inventory and access control secured narcotics boxes, electrical circuit panels, storage compartments, gas station security, and vending and cash containment machines. It serves recreational transportation, postal, office and institutional furniture, cabinetry, tool storage, healthcare, and other industries. The Marine Components segment manufactures and distributes stainless steel exhaust components, exhaust pipes, mufflers and other exhaust components; gauges, such as GPS speedometers and tachometers; mechanical and electronic controls and throttles; wake enhancement systems, trim tabs, steering wheels, and billet aluminum accessories; dash panels, LED indicators, and wire harnesses; and grab handles, pin cleats, and related hardware and accessories primarily for performance and ski/wakeboard boats for the recreational marine and other industries. CompX International Inc. sells its products directly to original equipment manufacturers, as well as through distributors. The company was incorporated in 1993 and is based in Dallas, Texas. CompX International Inc. is a subsidiary of NL Industries, Inc.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75240-2620",
        "website": "http://www.compx.com",
        "market_cap": "Small Cap"
    },
    "CSTI": {
        "short_name": "COSTAR TECHNOLOGIES INC",
        "long_name": "Costar Technologies, Inc.",
        "summary": "Costar Technologies, Inc., together with its subsidiaries, designs, develops, manufactures, and distributes various products for the video surveillance and machine vision markets in the United States. The company operates through three segments: Costar Video Systems, CohuHD Costar, and Other. Its products include video management software, surveillance cameras, network video and digital video recorders, lenses, and high speed domes, as well as industrial vision products; and monitors, cables, lighting, and other video accessories. The company also provides IP video solutions for traffic monitoring, security, surveillance, and military applications; and accessories, such as cables, camera mounts, and data storage devices. It provides its solutions for financial institutions, educational facilities, retail stores, manufacturing plants, highways, government buildings, military bases, borders, and other applications. The company was formerly known as Sielox, Inc. and changed its name to Costar Technologies, Inc. in October 2011. Costar Technologies, Inc. was founded in 1997 and is based in Coppell, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Coppell",
        "zipcode": "75019",
        "website": "http://www.costartechnologies.com",
        "market_cap": "Small Cap"
    },
    "DGLY": {
        "short_name": "Digital Ally, Inc.",
        "long_name": "Digital Ally, Inc.",
        "summary": "Digital Ally, Inc. produces and sells digital video imaging, storage, and disinfectant and related safety products for use in law enforcement, security, and commercial applications in the United States and internationally. The company offers in-car digital video mirror systems for law enforcement; in-car digital video event recorder systems for commercial fleets; a suite of data management web-based tools to assist fleet managers in the organization, archival, and management of videos and telematics information; miniature body-worn digital video systems for law enforcement and private security; and VuLink, an in-car device that enables an in-car digital audio/video system and a body worn digital audio/video camera system to automatically and simultaneously start recording. It also provides VuVault.net, a law enforcement cloud storage solution; FleetVU Manager, a web-based software for commercial fleet tracking and monitoring; ThermoVu, a non-contact temperature-screening instrument that measures temperature through the wrist and controls entry to facilities when temperature measurements exceed pre-determined parameters; and shield disinfectants and cleansers, as well as other personal protective equipment and supplies, such as masks and gloves to health care workers and other consumers. The company sells its products through direct sales and third-party distributors. Digital Ally, Inc. is headquartered in Lenexa, Kansas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "KS",
        "city": "Lenexa",
        "zipcode": "66219",
        "website": "http://www.digitalallyinc.com",
        "market_cap": "Small Cap"
    },
    "DIRV": {
        "short_name": "DIRECTVIEW HOLDINGS INC",
        "long_name": "DirectView Holdings, Inc.",
        "summary": "DirectView Holdings, Inc., through its subsidiaries, operates as a full-service provider of teleconferencing products and services to businesses and organizations. The company operates in two divisions, Security and Surveillance; and Video Conferencing Services. The Security and Surveillance division provides surveillance systems, and digital video recording and services, including DVR recorders and cameras, video intercoms, NVR recorders and IP cameras, laser and video beam perimeter security products, motion detection and thermal imagery products, security design and consulting, remote control device management, equipment maintenance service plans, and access control solutions. It also develops customized software programs; and DirectView Security App, a mobile application to enable full remote management of deployed surveillance devices, such as positioning cameras, setting recording parameters, and replay of selected video. This division serves transportation, hospitality, industrial, educational, and residential markets. The Video Conferencing Services division provides multipoint video conferencing, network integration, custom room design, staffing, document conferencing, and IP/Web conferencing services that enable its clients to conduct remote meetings by linking participants in geographically dispersed locations. It is also involved in the sale of conferencing services based upon usage, sale and installation of video equipment, and sale of maintenance agreements. This division provides its services to organizations, such as professional service firms, investment banks, high tech companies, law firms, investor relations firms, and other domestic and multinational companies in commercial, government, medical, and educational sectors. The company sells its products and services in the United States and internationally through direct sales force, referrals, and its Website. DirectView Holdings, Inc. was founded in 2006 and is based in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Boca Raton",
        "zipcode": "33433",
        "website": "http://directview.com",
        "market_cap": "Small Cap"
    },
    "DTII": {
        "short_name": "DEFENSE TECHNOLOGIES INTL CORP",
        "long_name": "Defense Technologies International Corp.",
        "summary": "Defense Technologies International Corp., through its subsidiary, Passive Security Systems, Inc., develops and sells passive scanning technology for detection and identifying concealed threats to be used for the security of schools and other public venues. It offers passive security scanning units for either walk-through or hand-held use to improve security for schools and other public facilities. The company was formerly known as Canyon Gold Corp. and changed its name to Defense Technologies International Corp. in June 2016. The company was incorporated in 1998 and is based in Del Mar, California. Defense Technologies International Corp. is a subsidiary of Emac Handels AG.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Del Mar",
        "zipcode": "92014",
        "website": "http://www.defensetechnologiesintl.com",
        "market_cap": "Small Cap"
    },
    "EKCS": {
        "short_name": "ELECTRONIC CONTROL SECURITY INC",
        "long_name": "Electronic Control Security Inc.",
        "summary": "Electronic Control Security Inc. designs, develops, manufactures, and markets technology-based integrated security solutions in the United States and the Middle East. The company offers automated vehicle/personnel gate systems to read vehicle tags, license plate cameras, personnel card readers and keypad, intercom and camera, anti-tailgating sensors, and electric gates; and infrared perimeter intrusion detection systems that offer a barrier of pulsed infrared beams to create various intrusion detection zones. Its products also include fiber optic intelligence detection systems for fence/wall line perimeter monitoring and intrusion detection; PTZ cameras to track an intruder based on an alarm; day/night and thermal imaging cameras; and long range day/night cameras for border security, port security, and critical infrastructure applications. In addition, the company provides vehicle gate automation products; long range radars to remotely detect and monitor intruders entering oil fields, refineries, bases, or crossing borders; water infrastructure sensing equipment to monitor water flow for chemical and biological contaminants, report out-of-parameter conditions, and draw sample of contaminated water; and interoperable device management systems for the command control communication and computer centers to operate as the custodial and security nerve center and perform monitoring and control process. Further, it offers emergency response stations for potential security incursions; and site survey/risk assessment, design and engineering, systems manufacturing and integration, factory acceptance testing, installation supervision, commissioning, operations, and maintenance training services. The company markets its products to government entities, chemical and petrochemical facilities, energy facilities, commercial transportation centers, border security, and water and agricultural resources. The company was founded in 1976 and is headquartered in Clifton, New Jersey.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Clifton",
        "zipcode": "07012",
        "website": "http://www.anti-terrorism.com",
        "market_cap": "Small Cap"
    },
    "FAKC": {
        "short_name": "FACEKEY CORP",
        "long_name": "FaceKey Corporation",
        "summary": "FaceKey Corporation, a development stage company, engages in the manufacture and sale of security equipment for the home and business. The company develops access control, and time and attendance products. Its products include EntryGuard access control systems with fingerprint recognition; EntryGuard time and attendance systems; and EntryGuard muster stations. The company sells its products through a network of distributors, dealers, and system integrators worldwide. FaceKey Corporation was founded in 1999 and is based in San Antonio, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "San Antonio",
        "zipcode": "78209",
        "website": "http://www.facekey.com",
        "market_cap": "Small Cap"
    },
    "FPVD": {
        "short_name": "FORCE PROTECTION VIDEO EQUPMNT ",
        "long_name": "Force Protection Video Equipment Corp.",
        "summary": "Force Protection Video Equipment Corp., a data technology company that provides tools and services to identify and reach consumers for the purpose of marketing and advertising communication. The company offers a consumer based mobile application that allows consumers to own and earn from their digital data. Its consumer-based platform and technologies assists clients in identifying consumers and consumers' characteristics across various channels in order to discover new and measurable opportunities associated with advertising campaigns; and gaining insight into the activities of customers. The company also provides a consumer based mobile application that allows consumers to own and earn from their digital data. In addition, it sells proprietary consumer data and digital advertising campaigns. The company is headquartered in Westlake Village, California. Force Protection Video Equipment Corp. is a subsidiary of SRAX, Inc.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Westlake Village",
        "zipcode": "91361",
        "website": null,
        "market_cap": "Small Cap"
    },
    "GDSI": {
        "short_name": "GLOBAL DIGITAL SOLUTIONS INC",
        "long_name": "Global Digital Solutions, Inc.",
        "summary": "Global Digital Solutions, Inc. focuses on providing security and technology solutions. It develops Pilot Assisted Landing System, which generates a host of new applications through landing trajectory optimization that provides safety margin against weather related hazardous conditions, such as wind shear, wake turbulence, icing, and low ceilings and fog. The company is based in West Palm Beach, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "West Palm Beach",
        "zipcode": "33401",
        "website": "http://www.gdsi.co",
        "market_cap": "Small Cap"
    },
    "GWSN": {
        "short_name": "GULF WEST SECURITY NETWORK INC",
        "long_name": "Gulf West Security Network, Inc.",
        "summary": "Gulf West Security Network, Inc., together with its subsidiaries, engages in the engineering, design, installation, remote monitoring, and after-market servicing of residential and commercial electronic security, and home automation systems in the United States. It offers home burglar, fire, and medical alarm systems, as well as fully integrated business security and automation systems. The company is based in Lafayette, Louisiana.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "LA",
        "city": "Lafayette",
        "zipcode": "70503",
        "website": "http://www.gulfwestsecurity.com",
        "market_cap": "Small Cap"
    },
    "HCGS": {
        "short_name": "HIGHCOM GLOBAL SECURITY INC",
        "long_name": "HighCom Global Security, Inc.",
        "summary": "HighCom Global Security, Inc., together with its subsidiaries, designs, develops, manufactures, and distributes security products and personal protective gears in the United States and internationally. The company offers ballistic helmets, hard armor plates, soft armor vests, and ballistic shields. It also provides BlastWrap, a blast mitigation technology that contains explosions and suppresses resulting flash fires. The company was formerly known as BlastGard International, Inc. and changed its name to HighCom Global Security, Inc. in June 2017. HighCom Global Security, Inc. was incorporated in 2003 and is based in Columbus, Ohio.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Columbus",
        "zipcode": "43219",
        "website": "http://www.highcomglobal.com",
        "market_cap": "Small Cap"
    },
    "HLCN": {
        "short_name": "HOLOCO INC",
        "long_name": "Holoco Inc.",
        "summary": "Holoco Inc. develops holographic technologies and solutions. Its technologies are used in various products, including file protection and security through biometrics. The company is based in Philadelphia, Pennsylvania.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19130",
        "website": null,
        "market_cap": null
    },
    "HWSY": {
        "short_name": "HAWK SYSTEMS INC",
        "long_name": "Hawk Systems, Inc.",
        "summary": "Hawk Systems, Inc., through its subsidiaries, develops fingerprint authentication technology. Its technology would offer security, convenience, and ease of use in applications, such as automobile locks and theft-protection. The company offers Print Access Security System (PASS), an automotive security product. Its technology could also used for security in banking, healthcare, hotel/casino operations, employee time clock and attendance, stadium security, and sporting and gaming applications where identity management is required. The company was incorporated in 2001 and is based in West Palm Beach, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "West Palm Beach",
        "zipcode": "33401",
        "website": null,
        "market_cap": "Small Cap"
    },
    "IVDA": {
        "short_name": "IVEDA SOLUTIONS INC",
        "long_name": "Iveda Solutions, Inc.",
        "summary": "Iveda Solutions, Inc. develops and sells software as a service video surveillance management platform under Sentir name in the United States and internationally. Its Sentir platform consists of surveillance software, cloud management software, servers, storage, and networking protocols that enables real-time viewing and recorded playback of video on computers and mobile devices with push notifications and alerts for the distribution of hosted video surveillance services. The company also sells Sentir-enabled plug-and-play cloud cameras under Zee brand name, and an in-vehicle streaming video surveillance system under VEMO brand name to telecommunications companies, Internet service providers, data centers, and cable companies. In addition, it also provides real-time Internet protocol video hosting and remote surveillance services; and deploys video surveillance systems for banks, storage facilities, homeowners associations, law enforcement, food processing plants, public pools and parks, and government agencies, as well as airports, commercial buildings, data centers, shopping centers, and hotels. The company was formerly known as Iveda Corporation and changed its name to Iveda Solutions, Inc. in December 2010. Iveda Solutions, Inc. is headquartered in Mesa, Arizona.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Mesa",
        "zipcode": "85206",
        "website": "http://www.iveda.com",
        "market_cap": "Small Cap"
    },
    "IWAL": {
        "short_name": "IWALLET CORP",
        "long_name": "iWallet Corporation",
        "summary": "iWallet Corporation designs, develops, manufactures, and sells personal security products to protect against identity, personal, and financial information theft in the United States and internationally. The company offers biometric locking luxury storage cases that protect cash, credit cards, and personal information with a proprietary fingerprint security system. It intends to serve customers in luxury secure storage cases and accessories markets. The company was founded in 2009 and is based in San Diego, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92121",
        "website": "http://iwalletusa.com",
        "market_cap": "Small Cap"
    },
    "LGTT": {
        "short_name": "LIGATT SECURITY INTERNATIONAL I",
        "long_name": "LIGATT Security International, Inc.",
        "summary": "LIGATT Security International, Inc. offers computer security services in the United States. The company's services include IPSNITCH, a service that combines Internet protocol (IP) retrieval and email spoofing; PORTSNITCH, a vulnerability scanner that scans computers for open ports and displaying loopholes in which computer hackers use to capture one's identity; and SPOOFNET that allows user to surf the Internet by hiding IP address and displaying IP addresses that cannot be traced back. The company also offers hackers on hire services, including cyber stalking, online identity theft, stolen computers, cyber espionage, computer hacking investigation, cyber fraud, computer forensics, cyber bullying, and cyber crime, as well as conducting background checks. In addition, it provides various computer security and hi-tech crime investigations courses for information technology managers, law enforcements, private investigators, computer enthusiasts, consumers, or individuals. Further, the company operates an online shopping mall, which offers anti-spam software, anti-phishing software, anti-virus software, backup and recovery software, remote access software, spyware software, computer security, firewalls Â\u0096 hardware, firewalls Â\u0096 software, books and videos, spyshop, smartphone security, and cell phone tracking/recovery products. In addition, it offers BoobyTrap; and LocatePC to track stolen computer or laptop. The company was founded in 2003 and is headquartered in Norcross, Georgia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Norcross",
        "zipcode": "30092",
        "website": null,
        "market_cap": null
    },
    "LSKA": {
        "short_name": "LISKA BIOMETRY INC",
        "long_name": "Liska Biometry, Inc.",
        "summary": "Liska Biometry, Inc. provides fingerprint biometric solutions that enable individual authentication, precise identification searches, and cross-platform data interoperability in the United States and internationally. Its identification (ID) management solutions include BIN 1.0 descriptor authentication software, BIN 1.0 descriptor enrollment software, and BIN 1.0 database management software. These solutions provide a biometric identifier number that could be embedded in credit cards and driver's licenses, as well as travel documents, such as visas and passports, and a host of other personal identification credentials. The company also offers ID card design software, printer hardware, camera hardware, and software to support its solutions. Its customers include various government and law enforcement agencies, regional and state education systems, and corporations. Liska Biometry, Inc. is based in Dover, New Hampshire.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NH",
        "city": "Dover",
        "zipcode": "03820",
        "website": null,
        "market_cap": "Small Cap"
    },
    "LT1B.F": {
        "short_name": "VERIFYME INC.",
        "long_name": "VerifyMe, Inc.",
        "summary": "VerifyMe, Inc. provides technology solutions for brand protection and supply chain functions in the United States. The company's brand protection and supply chain functions include counterfeit prevention, authentication, serialization, consumer engagement, and track and trace features for labels, packaging, and products. It provides RainbowSecure technology that combines an invisible ink with a proprietary tuned laser to enable counterfeit products to be exposed; VeriPAS technology, which provides brand owners geographical business intelligence on counterfeiting; and VeriPAS Smartphone Authenticator technology, a piece of hardware with a built-in lighting system and software that scans invisible RainbowSecure codes. The company also offers VerifyMe as Authentic technology, a dual-purpose pre-printed label with a visible serialized QR code for consumer scanning purposes, as well as an invisible serialized IR code for inspector scanning, authentication, and tracking purposes; VerifyMe Beeper technology, an authentication tool that is designed for customers who desire instant authentication on items, such as event tickets at an entry gate; and VerifyMe Web that enables customers to effectively tackle counterfeit websites, domains, and e-commerce platforms offering counterfeit products. It has strategic partnerships with INX International Ink Company; and Techind Engineers & Consultants-Impex. The company was formerly known as LaserLock Technologies, Inc. and changed its name to VerifyMe, Inc. in July 2015. VerifyMe, Inc. was incorporated in 1999 and is based in Rochester, New York.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "Rochester",
        "zipcode": "14604",
        "website": "http://www.verifyme.com",
        "market_cap": "Small Cap"
    },
    "M07.F": {
        "short_name": "MSA SAFETY INC.",
        "long_name": "MSA Safety Incorporated",
        "summary": "MSA Safety Incorporated develops, manufactures, and supplies safety products that protect people and facility infrastructures in the oil, gas, petrochemical, fire service, construction, industrial manufacturing applications, utilities, military, and mining industries in North America, Latin America, and internationally. The company's core product offerings include permanently installed fixed gas and flame detection instruments, such as permanently installed gas detection monitoring systems, and flame detectors and open-path infrared gas detectors, as well as replacement components and related services to detect the presence or absence of various gases in the air. Its core product offerings also comprise breathing apparatus products, such as self-contained breathing apparatus; hand-held portable gas detection instruments; industrial head protection products; firefighter helmets and protective apparel; and fall protection equipment, including confined space equipment, harnesses, lanyards, and self-retracting lifelines, as well as engineered systems. In addition, the company offers air-purifying respirators, eye and face protection products, ballistic helmets, and gas masks. It serves distributors and end-users through indirect and direct sales channels. The company offers its product under the V-Gard, Cairns, and Gallet brand names. MSA Safety Incorporated was founded in 1914 and is based in Cranberry Township, Pennsylvania.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Cranberry Township",
        "zipcode": "16066-5207",
        "website": "http://www.msasafety.com",
        "market_cap": "Mid Cap"
    },
    "MACE": {
        "short_name": "MACE SECURITY INTERNATIONAL INC",
        "long_name": "Mace Security International, Inc.",
        "summary": "Mace Security International, Inc. designs, manufactures, and sells personal safety and security products to retailers, distributors, and individual consumers worldwide. The company offers pepper sprays, gels, and guns, as well as animal deterrent sprays; personal alarms; stun guns; and combo kits under the Mace brand, as well as self defense products for women. It also sells tactical spray products and systems to law enforcement, security professionals, correctional institutions, and military markets. The company distributes and supports its branded products and services through mass market retailers, wholesale distributors, independent dealers, e-commerce marketers, and installation service providers, as well as Mace.com website. Mace Security International, Inc. was founded in 1965 and is headquartered in Cleveland, Ohio.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Cleveland",
        "zipcode": "44103",
        "website": "http://www.mace.com",
        "market_cap": "Small Cap"
    },
    "MG": {
        "short_name": "Mistras Group Inc",
        "long_name": "Mistras Group, Inc.",
        "summary": "Mistras Group, Inc. provides technology-enabled asset protection solutions worldwide. The company operates through three segments: Services, International, and Products and Systems. It offers non-destructive testing services, as well as predictive maintenance assessments of fixed and rotating assets, and inline inspection for pipelines; and engineering consulting services primarily for process equipment, technologies, and facilities. The company also provides maintenance and light mechanical services, such as corrosion removal, mitigation and prevention, insulation installation and removal, electrical, heat tracing, industrial cleaning, pipefitting, and welding; develops enterprise inspection database management software and plant condition management software for process industries and equipment; and utilizes scaffolding and rope access to access at-height and confined assets. In addition, it offers certified divers for subsea inspection and maintenance; unmanned aerial, land-based, and subsea systems for a range of inspection applications; online condition-monitoring solutions; various Web-based solutions; and custom-developed software for an automated data analysis. Further, the company provides quality assurance and quality control solutions for new and existing metal and alloy components, materials, and composites. The company also designs, manufactures, sells acoustic emission sensors, instruments, and turnkey systems for monitoring and testing materials, pressure components, processes, and structures, as well as automated ultrasonic systems and scanners. It serves oil and gas, commercial aerospace and defense, fossil and nuclear power, alternative and renewable energy, public infrastructure, chemicals, transportation, primary metals and metalworking, pharmaceutical/biotechnology, and food processing industries, as well as research and engineering institutions. Mistras Group, Inc. was founded in 1978 and is headquartered in Princeton Junction, New Jersey.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Princeton Junction",
        "zipcode": "08550",
        "website": "http://www.mistrasgroup.com",
        "market_cap": "Small Cap"
    },
    "MGNT": {
        "short_name": "MEGANET CORPORATION",
        "long_name": "Meganet Corporation",
        "summary": "Meganet Corporation invents, develops, and markets data security, intelligence/counter-intelligence, and military operational devices. It provides encrypted products that protect data in biometric USB storage devices, computer files, email, chat, file transfer protocol, and others, as well as digital signature applications and an electronic file shredder that allows for the secure shredding of confidential files, folders, and disks. The company also offers bomb jammers that include motorcade applications for protecting convoys and soldier backpack applications for protecting foot patrols, dismounted backpack portable jammers, and facility jammers; communication interception products, including real-time cell phones, as well as satellite, Wi-Fi, and other communication interceptors; and secure communication applications consisting of encrypted cell phones, land lines, fax, PDA, radios, satellite phones, and others. In addition, it offers intelligence/counter-intelligence products include bugs, bug detectors, bomb sniffers, miniature cameras, and SPY and RAT phones, as well as digital video recorders; national security solutions for border protection from land, sea, and air; unmanned aerial vehicles, including airplanes and helicopters; ballistic projectiles and anti-aircraft guns, and optics; over the horizon radar system enabling to see ships in sea from the shore; and military products. The company develops data security solutions for enterprise, large organizations, and corporations worldwide, including the U.S. Department of Defense, military intelligence, and the Federal Government. It markets and sells its products through Federal Government GSA (U.S. General Services Administration) schedule, a government SEWP (Solutions for Enterprise-Wide Procurement), Website, email, electronic catalogs, and domestic and international distributors. Meganet Corporation was founded in 2009 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89120",
        "website": "http://www.meganet.com",
        "market_cap": "Small Cap"
    },
    "MIHL": {
        "short_name": "MONTAGUE INTERNATIONAL HOLDING ",
        "long_name": "Montague International Holding Ltd.",
        "summary": "Montague International Holding Ltd., through its subsidiaries, engages in the businesses of financial services, energy, mining, entertainment, healthcare, consumer, industrial trade, and business development in the European Union, the Russian Federation, Latin America, and the United States. It offers investment advisory services and other investment solutions to corporate clients and high net worth individuals. The company also provides securities brokerage/dealership services; owns and operates a gold mining project; and designs, manufactures, and installs modular oil refining plants. In addition, it engages in real estate development business, as well as owns and operates entertainment centers, such as clubs. Montague International Holding Ltd. was formerly known as High Tech Crime Solutions Inc. and changed its name to Montague International Holding Ltd. in July 2012. The company was incorporated in 2009 and is based in Philadelphia, Pennsylvania. Montague International Holding Ltd. is a former subsidiary of LIGATT Security International, Inc.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19103",
        "website": "http://www.montagueholding.com",
        "market_cap": "Small Cap"
    },
    "MIY.F": {
        "short_name": "MISTRAS GROUP INC. DL-,01",
        "long_name": "Mistras Group, Inc.",
        "summary": "Mistras Group, Inc. provides technology-enabled asset protection solutions worldwide. The company operates through three segments: Services, International, and Products and Systems. It offers non-destructive testing services, as well as predictive maintenance assessments of fixed and rotating assets, and inline inspection for pipelines; and engineering consulting services primarily for process equipment, technologies, and facilities. The company also provides maintenance and light mechanical services, such as corrosion removal, mitigation and prevention, insulation installation and removal, electrical, heat tracing, industrial cleaning, pipefitting, and welding; develops enterprise inspection database management software and plant condition management software for process industries and equipment; and utilizes scaffolding and rope access to access at-height and confined assets. In addition, it offers certified divers for subsea inspection and maintenance; unmanned aerial, land-based, and subsea systems for a range of inspection applications; online condition-monitoring solutions; various Web-based solutions; and custom-developed software for an automated data analysis. Further, the company provides quality assurance and quality control solutions for new and existing metal and alloy components, materials, and composites. The company also designs, manufactures, sells acoustic emission sensors, instruments, and turnkey systems for monitoring and testing materials, pressure components, processes, and structures, as well as automated ultrasonic systems and scanners. It serves oil and gas, commercial aerospace and defense, fossil and nuclear power, alternative and renewable energy, public infrastructure, chemicals, transportation, primary metals and metalworking, pharmaceutical/biotechnology, and food processing industries, as well as research and engineering institutions. Mistras Group, Inc. was founded in 1978 and is headquartered in Princeton Junction, New Jersey.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NJ",
        "city": "Princeton Junction",
        "zipcode": "08550",
        "website": "http://www.mistrasgroup.com",
        "market_cap": "Small Cap"
    },
    "MPIN": {
        "short_name": "MESSAGE PROCESSING INTL",
        "long_name": "Message Processing International, Inc.",
        "summary": "Message Processing International, Inc. manufactures and markets emergency notification systems. It offers the NovAlert automated multi-port out dial telephone communications system, which is activated directly or remotely by telephone or sensors and can contact officials, emergency response teams, and others. The company was incorporated in 1991 and is based in Bartlesville, Oklahoma.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "OK",
        "city": "Bartlesville",
        "zipcode": "74006",
        "website": null,
        "market_cap": null
    },
    "MSA": {
        "short_name": "MSA Safety Incorporated",
        "long_name": "MSA Safety Incorporated",
        "summary": "MSA Safety Incorporated develops, manufactures, and supplies safety products that protect people and facility infrastructures in the oil, gas, petrochemical, fire service, construction, industrial manufacturing applications, utilities, military, and mining industries in North America, Latin America, and internationally. The company's core product offerings include permanently installed fixed gas and flame detection instruments, such as permanently installed gas detection monitoring systems, and flame detectors and open-path infrared gas detectors, as well as replacement components and related services to detect the presence or absence of various gases in the air. Its core product offerings also comprise breathing apparatus products, such as self-contained breathing apparatus; hand-held portable gas detection instruments; industrial head protection products; firefighter helmets and protective apparel; and fall protection equipment, including confined space equipment, harnesses, lanyards, and self-retracting lifelines, as well as engineered systems. In addition, the company offers air-purifying respirators, eye and face protection products, ballistic helmets, and gas masks. It serves distributors and end-users through indirect and direct sales channels. The company offers its product under the V-Gard, Cairns, and Gallet brand names. MSA Safety Incorporated was founded in 1914 and is based in Cranberry Township, Pennsylvania.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Cranberry Township",
        "zipcode": "16066-5207",
        "website": "http://www.msasafety.com",
        "market_cap": "Mid Cap"
    },
    "NL": {
        "short_name": "NL Industries, Inc.",
        "long_name": "NL Industries, Inc.",
        "summary": "NL Industries, Inc., through its subsidiary, CompX International Inc., operates in the component products industry in the United States and internationally. The company manufactures and sells mechanical and electronic cabinet locks, and other locking mechanisms, including disc tumbler locks, pin tumbler locking mechanisms, and CompX eLock and StealthLock electronic locks for use in various applications, such as ignition systems, mailboxes, file cabinets, desk drawers, tool storage cabinets, integrated inventory and access control secured narcotics boxes, vending and cash containment machines, medical cabinetry, electronic circuit panels, storage compartments, and gas station security. It also offers original equipment and aftermarket stainless steel exhaust headers, exhaust pipes, mufflers, and other exhaust components; gauges, such as GPS speedometers and tachometers; mechanical and electronic controls and throttles; wake enhancement devices, trim tabs, steering wheels and other billet aluminum accessories; grab handles, pin cleats, and other accessories; and dash panels, LED indicators, wire harnesses, and other accessories primarily for performance and ski/wakeboard boats. In addition, the company offers insurance brokerage and risk management services. It sells its component products directly to original equipment manufacturers, as well as through distributors. The company was founded in 1891 and is based in Dallas, Texas. NL Industries, Inc. is a subsidiary of Valhi, Inc.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75240-2620",
        "website": "http://www.nl-ind.com",
        "market_cap": "Small Cap"
    },
    "NS1.F": {
        "short_name": "NAPCO SEC.TECH.INC.DL-,01",
        "long_name": "Napco Security Technologies, Inc.",
        "summary": "Napco Security Technologies, Inc. develops, manufactures, and sells security products in the United States and internationally. The company offers access control systems, door-locking products, intrusion and fire alarm systems, and video surveillance systems for commercial, residential, institutional, industrial, and governmental applications. Its access control systems include various types of identification readers, control panels, PC-based computers, and electronically activated door-locking devices; and door locking devices comprise microprocessor-based electronic door locks with push button, card readers and bio-metric operation, door alarms, mechanical door locks, and simple dead bolt locks. The company's alarm systems include automatic communicators, cellular communication devices, control panels, combination control panels/digital communicators and digital keypad systems, fire alarm control panels, and area detectors; and video surveillance systems comprise video cameras, control panels, video monitors, or PCs. It also buys and resells various identification readers, video cameras, PC-based computers, and peripheral equipment for access control and video surveillance systems; offers school security products; and markets peripheral and related equipment manufactured by other companies. The company markets and sells its products primarily to independent distributors, dealers, and installers of security equipment. Napco Security Technologies, Inc. was founded in 1969 and is headquartered in Amityville, New York.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "Amityville",
        "zipcode": "11701",
        "website": "http://www.napcosecurity.com",
        "market_cap": "Small Cap"
    },
    "NSSC": {
        "short_name": "NAPCO Security Technologies, In",
        "long_name": "Napco Security Technologies, Inc.",
        "summary": "Napco Security Technologies, Inc. develops, manufactures, and sells security products in the United States and internationally. The company offers access control systems, door-locking products, intrusion and fire alarm systems, and video surveillance systems for commercial, residential, institutional, industrial, and governmental applications. Its access control systems include various types of identification readers, control panels, PC-based computers, and electronically activated door-locking devices; and door locking devices comprise microprocessor-based electronic door locks with push button, card readers and bio-metric operation, door alarms, mechanical door locks, and simple dead bolt locks. The company's alarm systems include automatic communicators, cellular communication devices, control panels, combination control panels/digital communicators and digital keypad systems, fire alarm control panels, and area detectors; and video surveillance systems comprise video cameras, control panels, video monitors, or PCs. It also buys and resells various identification readers, video cameras, PC-based computers, and peripheral equipment for access control and video surveillance systems; offers school security products; and markets peripheral and related equipment manufactured by other companies. The company markets and sells its products primarily to independent distributors, dealers, and installers of security equipment. Napco Security Technologies, Inc. was founded in 1969 and is headquartered in Amityville, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Amityville",
        "zipcode": "11701",
        "website": "http://www.napcosecurity.com",
        "market_cap": "Small Cap"
    },
    "NTCI": {
        "short_name": "NUTECH INC",
        "long_name": "Nutech, Inc.",
        "summary": "Nutech, Inc. provides technology solutions to the security industry. Its services include security solutions for homes and businesses; network and server administration; and servers and workstations consultations and designs. Nutech, Inc. was formerly known as CFE Enterprises, Inc. and changed its name to Nutech, Inc. in 2006. The company is based in Willis, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Willis",
        "zipcode": "77318",
        "website": null,
        "market_cap": null
    },
    "NXTD": {
        "short_name": "NXT-ID Inc.",
        "long_name": "Nxt-ID, Inc.",
        "summary": "Nxt-ID, Inc. provides technology products and services for healthcare applications. It develops and markets solutions for payment, Internet of Things (IoT), and healthcare applications with experience in access control, biometric and behavior-metric identity verification, security and privacy, encryption and data protection, payments, miniaturization, and sensor technologies. The company, through its subsidiary, LogicMark LLC, manufactures and distributes non-monitored and monitored personal emergency response systems sold through healthcare durable medical equipment and monitored security dealers/distributors, and the United States Department of Veterans Affairs. It serves various end markets, including the security, healthcare, financial technology, and the IoT markets. Nxt-ID, Inc. was founded in 2011 and is based in Oxford, Connecticut.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Oxford",
        "zipcode": "06478",
        "website": "http://www.nxt-id.com",
        "market_cap": "Small Cap"
    },
    "PERL": {
        "short_name": "PERLA GROUP INTERN",
        "long_name": "Perla Group International, Inc.",
        "summary": "Perla Group International, Inc. provides aviation, telecom, armored vehicles, and K-9 products and services in the burgeoning military, police, and security sectors in the United States and internationally. It offers satellite and telecoms products, including satellite antennas, RF components, I-Direct, military products, and Viasat networks; auto deploy antennas, communication on the move, and VOIP products; power generators; asset tracking products; and network design, implementation, and consultancy services, as well as distributes Sumeru microwave antenna's. The company also provides armored 4x4, VIP, APC, and cash in transit vehicles, as well as buses and ATVs; night vision products comprising monoculars, binoculars, goggles, riflescopes, weapon scopes, day/night systems, thermal multi-purpose systems, thermal imaging systems and cameras, and flashlights; and spare parts consisting of bullet proof glass and screens, heavy duty brake discs and pads, gun ports, run flat tires, strobe light kits, intercom systems, heavy duty jacks, sealed battery systems, and VHF-UHF radio equipment. In addition, it offers a host of aviation services, including passenger jet, cargo aircraft, helicopter, and passenger aircraft chartering; involves in the sale and lease of cargo and passenger aircraft; provides scheduled maintenance, re-fueling, and engineering services; manufactures AK1-3 helicopters; operates a trailer/landing pad/re-fueling station; and offers internationally accredited courses in the training of pilots for private pilot license and commercial pilot license on the AK-3 and Mi-2 helicopters through a college. Further, the company provides k-9 services, such as supply of law enforcement and detection dogs in Australia; training seminars; and tactical, anti terrorism, and security training services. The company is headquartered in Ft. Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Ft. Lauderdale",
        "zipcode": "33308",
        "website": "http://www.perlagrp.com",
        "market_cap": "Small Cap"
    },
    "PTSS": {
        "short_name": "PEARTRACK SECURITY SYSTEMS  INC",
        "long_name": "Enigma-Bulwark, Limited",
        "summary": "Enigma-Bulwark, Limited operates as an integrated security and risk management company that delivers security solutions to government, corporations, and individuals worldwide. It operates in two markets, Remote/Mobile Asset Tracking and Environmental Transportation and Products. The company develops and commercializes proprietary battery system through global positioning system tracking and management technologies. It offers PearLoxx secure locking technology that has a built-in GPS tracking system that enables a shipping container to be sealed securely and tracked using the same device; and PearTrack TeleAsset, a remote asset management, GPS tracking, and monitoring system that enable organizations to manage their remote assets. The company also focuses on development of an environmental car rental operation; and development of ecologically friendly product, Ecologic Shine, a device and system for near-waterless car washing. The company was formerly known as Peartrack Security Systems, Inc. and changed its name to Enigma-Bulwark, Limited in October 2019. Enigma-Bulwark, Limited is headquartered in Santa Monica, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90401",
        "website": "http://www.enigma-bulwark.com",
        "market_cap": "Small Cap"
    },
    "PTY.F": {
        "short_name": "BRINKS CO.  DL 1",
        "long_name": "The Brink's Company",
        "summary": "The Brink's Company provides secure transportation, cash management, and other security-related services in North America, Latin America, Europe, and internationally. The company offers armored vehicle transportation of valuables; automated teller machine (ATM) management services, such as cash replenishment, replenishment forecasting, cash optimization, ATM remote monitoring, service call dispatching, transaction processing, installation, and first and second line maintenance services; network infrastructure; and cash-in-transit services. It also provides transportation services for diamonds, jewelry, precious metals, securities, bank notes, currency, high-tech devices, electronics, and pharmaceuticals; vault outsourcing and money processing services; and services related to deploying and servicing intelligent safes and safe control devices, as well as cashier balancing, counterfeit detection, account consolidation, electronic reporting, check imaging, and reconciliation services. In addition, the company offers technology applications, including online cash tracking, cash inventory management, and other web-based tools. Further, it provides bill payment acceptance and processing services; prepaid cards and corporate debit cards; and security system design and installation services that include alarms, motion detectors, closed-circuit televisions, and digital video recorders, as well as access control systems comprising card and biometric readers, electronic locks, and turnstiles. Additionally, the company offers monitoring services; and security and guarding services to protect airports, offices, warehouses, stores, and public venues. It serves banks and financial institutions, retailers, government agencies, mints, jewelers, and other commercial operations. The company was formerly known as The Pittston Company and changed its name to The Brink's Company in May 2003. The Brink's Company was founded in 1859 and is headquartered in Richmond, Virginia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "VA",
        "city": "Richmond",
        "zipcode": "23226-8100",
        "website": "http://www.brinks.com",
        "market_cap": "Mid Cap"
    },
    "PWLK": {
        "short_name": "POWERLOCK",
        "long_name": "Powerlock International Corp.",
        "summary": "Task Management Inc., formerly known as Integra Computer Corporation, provides sales management and training services. The company is based in Burbank, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Burbank",
        "zipcode": "91504",
        "website": "http://www.taskmgmt.com",
        "market_cap": null
    },
    "REZI.MX": {
        "short_name": "RESIDEO TECHNOLOGIES INC",
        "long_name": "Resideo Technologies, Inc.",
        "summary": "Resideo Technologies, Inc. develops, manufactures, and sells comfort, residential thermal, and security solutions to the commercial and residential end markets in the United States, Europe, and internationally. The company operates in two segments, Products & Solutions, and ADI Global Distribution. It offers temperature and humidity control, thermal and combustion solutions, and water and air solutions; and security panels, sensors, peripherals, wires and cables, communication devices, video cameras, awareness solutions, cloud infrastructure, installation and maintenance tools, and related software products under the Honeywell Home brand. In addition, the company distributes security products comprising video, intrusion, and access control products; and smart home, fire, power, audio, ProAV, networking, communication, wire and cable, enterprise connectivity, and structured wiring products to contractors that service non-residential and residential end-users. It sells its products through a network of distributors, original equipment manufacturers, and service providers, as well as retail and online channels. Resideo Technologies, Inc. was incorporated in 2018 and is headquartered in Austin, Texas.",
        "currency": "MXN",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "TX",
        "city": "Austin",
        "zipcode": "78702",
        "website": "http://www.resideo.com",
        "market_cap": "Large Cap"
    },
    "REZI": {
        "short_name": "Resideo Technologies, Inc.",
        "long_name": "Resideo Technologies, Inc.",
        "summary": "Resideo Technologies, Inc. develops, manufactures, and sells comfort, residential thermal, and security solutions to the commercial and residential end markets in the United States, Europe, and internationally. The company operates in two segments, Products & Solutions, and ADI Global Distribution. It offers temperature and humidity control, thermal and combustion solutions, and water and air solutions; and security panels, sensors, peripherals, wires and cables, communication devices, video cameras, awareness solutions, cloud infrastructure, installation and maintenance tools, and related software products under the Honeywell Home brand. In addition, the company distributes security products comprising video, intrusion, and access control products; and smart home, fire, power, audio, ProAV, networking, communication, wire and cable, enterprise connectivity, and structured wiring products to contractors that service non-residential and residential end-users. It sells its products through a network of distributors, original equipment manufacturers, and service providers, as well as retail and online channels. Resideo Technologies, Inc. was incorporated in 2018 and is headquartered in Austin, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Austin",
        "zipcode": "78702",
        "website": "http://www.resideo.com",
        "market_cap": "Mid Cap"
    },
    "RSKIA": {
        "short_name": "RISK GEORGE INDUSTRIES INC",
        "long_name": "George Risk Industries, Inc.",
        "summary": "George Risk Industries, Inc. designs, manufactures, and sells various electronic components worldwide. The company offers computer keyboards, push button switches, burglar alarm components and systems, pool alarms, thermostats, EZ duct wire covers, and water sensors, as well as door and window contact switches, environmental products, wire and cable installation tools, and proximity switches. Its products are used for residential, commercial, industrial, and government installations. The company sells its products to security alarm distributors, alarm installers, original equipment manufacturers, and distributors of off-the-shelf keyboards of proprietary design. George Risk Industries, Inc. was founded in 1965 and is headquartered in Kimball, Nebraska.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NE",
        "city": "Kimball",
        "zipcode": "69145",
        "website": "http://www.grisk.com",
        "market_cap": "Small Cap"
    },
    "SCTY": {
        "short_name": "MONITRONICS INTERNATIONAL",
        "long_name": "Monitronics International, Inc.",
        "summary": "Monitronics International, Inc., doing business as Brinks Home Security, provides security alarm monitoring and related services to residential and commercial customers in the United States, Canada, and Puerto Rico. It provides monitoring services for alarm signals arising from burglaries, fires, medical alerts, and other events through security systems at customers' premises. The company also offers home automation and life safety services, such as remote activation and control of security systems; support for video monitoring, flood sensors, and automated garage door and door lock capabilities; and thermostat integration services. In addition, it provides hands-free two-way interactive voice communication between its monitoring center and customers; customer and technical support related services to home monitoring systems and home automation services; and do-it-yourself and professional installation security solutions. It serves its customers through a network of authorized dealers. The company was founded in 1994 and is based in Farmers Branch, Texas.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Farmers Branch",
        "zipcode": "75234",
        "website": "http://www.brinkshome.com",
        "market_cap": "Small Cap"
    },
    "SITS": {
        "short_name": "SOUTHERN ITS INTERNATIONAL INC",
        "long_name": "Southern ITS International, Inc.",
        "summary": "Southern ITS International, Inc. engages in the turnkey integration of electronic security systems for transportation, gaming, and other secure operation industries in government and private sectors primarily in the United States. The company's integration solutions include surveillance, access control, network infrastructure, data communications, and fire and burglar alarm systems. It provides Greeniosk, a payment to sales technology solution that offers a transaction record from payment-to-sales, which combines with seeds-to-sales software and hardware. The company also offers phone and data solutions, such as cable infrastructure, networking, and IT tools and services, as well as various certification services. In addition, it provides data and security system integration services comprising system specification, design, cable infrastructure installation, system installation, system training, and technical support services; and casino system integration solutions, such as system design, and project and facilities management services. Southern ITS International, Inc. is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89117",
        "website": "http://www.sitsint.com",
        "market_cap": "Small Cap"
    },
    "SKVY": {
        "short_name": "SENTRY TECHNOLOGY CORP",
        "long_name": "Sentry Technology Corp.",
        "summary": "Sentry Technology Corp. designs, manufactures, markets, and services closed circuit television (CCTV), library patron self service, and radio frequency identification (RFID) solutions, as well as EAS security systems. It offers SentryVision SmartTrack, a traveling video system that transmit images from a PTZ camera mounted on a carriage that travels along a rail mounted to the ceiling of any facility; VideoRailway, a traveling camera technology; security and information services through inventory management, self-service, and book detection systems to school, public, and academic libraries; and OperationalVideo, a browser based video application to assist retailers with real time management of security, merchandising audits, and employee procedure compliance. The company also offers EAS security systems, including electromagnetic and RF systems for reducing theft in bookstores; and designs, installs, and maintains CCTV systems for retailers, transportation and distribution, and commercial and industrial companies. It serves retailers, transportation and distribution hubs, couriers and public transportation facilities, libraries, and data centers through dealers in North America, Europe, Latin America, the Middle East, Asia, and Africa. The company was founded in 1996 and is based in Ronkonkoma, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Ronkonkoma",
        "zipcode": "11779",
        "website": "http://www.sentrytechnology.com",
        "market_cap": "Small Cap"
    },
    "USN.F": {
        "short_name": "UNIV. SEC. INSTR.  DL-,01",
        "long_name": "Universal Security Instruments, Inc.",
        "summary": "Universal Security Instruments, Inc., together with its subsidiary, designs, markets, and distributes safety and security products for use in homes and businesses in the United States and internationally. It offers a line of safety alarms, including units powered by replaceable batteries, sealed batteries, and battery backup alarms; and smoke alarms, which include hearing impaired and heat alarms, as well as carbon monoxide alarms, door chimes, ventilation products, ground fault circuit interrupters, and other electrical devices. The company provides its products to wholesale distributors; chain, discount, and television retailers; home center stores; catalog and mail order companies; electrical and lighting distributors, and manufactured housing companies; and other distributors. It also sells its products through independent sales organizations and sales representatives, as well as through its own sales catalogs and brochures, and Website. The company was founded in 1969 and is headquartered in Owings Mills, Maryland.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MD",
        "city": "Owings Mills",
        "zipcode": "21117-6218",
        "website": "http://www.universalsecurity.com",
        "market_cap": "Small Cap"
    },
    "UUU": {
        "short_name": "Universal Security Instruments,",
        "long_name": "Universal Security Instruments, Inc.",
        "summary": "Universal Security Instruments, Inc., together with its subsidiary, designs, markets, and distributes safety and security products for use in homes and businesses in the United States and internationally. It offers a line of safety alarms, including units powered by replaceable batteries, sealed batteries, and battery backup alarms; and smoke alarms, which include hearing impaired and heat alarms, as well as carbon monoxide alarms, door chimes, ventilation products, ground fault circuit interrupters, and other electrical devices. The company provides its products to wholesale distributors; chain, discount, and television retailers; home center stores; catalog and mail order companies; electrical and lighting distributors, and manufactured housing companies; and other distributors. It also sells its products through independent sales organizations and sales representatives, as well as through its own sales catalogs and brochures, and Website. The company was founded in 1969 and is headquartered in Owings Mills, Maryland.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Owings Mills",
        "zipcode": "21117-6218",
        "website": "http://www.universalsecurity.com",
        "market_cap": "Small Cap"
    },
    "VRME": {
        "short_name": "VerifyMe, Inc.",
        "long_name": "VerifyMe, Inc.",
        "summary": "VerifyMe, Inc. provides technology solutions for brand protection and supply chain functions in the United States. The company's brand protection and supply chain functions include counterfeit prevention, authentication, serialization, consumer engagement, and track and trace features for labels, packaging, and products. It provides RainbowSecure technology that combines an invisible ink with a proprietary tuned laser to enable counterfeit products to be exposed; VeriPAS technology, which provides brand owners geographical business intelligence on counterfeiting; and VeriPAS Smartphone Authenticator technology, a piece of hardware with a built-in lighting system and software that scans invisible RainbowSecure codes. The company also offers VerifyMe as Authentic technology, a dual-purpose pre-printed label with a visible serialized QR code for consumer scanning purposes, as well as an invisible serialized IR code for inspector scanning, authentication, and tracking purposes; VerifyMe Beeper technology, an authentication tool that is designed for customers who desire instant authentication on items, such as event tickets at an entry gate; and VerifyMe Web that enables customers to effectively tackle counterfeit websites, domains, and e-commerce platforms offering counterfeit products. It has strategic partnerships with INX International Ink Company; and Techind Engineers & Consultants-Impex. The company was formerly known as LaserLock Technologies, Inc. and changed its name to VerifyMe, Inc. in July 2015. VerifyMe, Inc. was incorporated in 1999 and is based in Rochester, New York.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Rochester",
        "zipcode": "14604",
        "website": "http://www.verifyme.com",
        "market_cap": "Small Cap"
    },
    "VRRM": {
        "short_name": "Verra Mobility Corporation",
        "long_name": "Verra Mobility Corporation",
        "summary": "Verra Mobility Corporation provides smart mobility technology solutions and services in the United States, Canada, and Europe. It operates through two segments, Government Solutions and Commercial Services. The Government Solutions segment offers automated safety solutions, including services and technologies that enable photo enforcement through road safety camera programs, which detects and process traffic violations related to red light, speed, school bus, and city bus lanes. This segment serves municipalities, counties, school districts, and law enforcement agencies. The Commercial Services segment provides automated toll and violations management, and title and registration solutions to rental car companies, fleet management companies, and other large fleet owners. The company was incorporated in 2016 and is headquartered in Mesa, Arizona.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Mesa",
        "zipcode": "85201",
        "website": "http://www.verramobility.com",
        "market_cap": "Mid Cap"
    },
    "VSYM": {
        "short_name": "VIEW SYSTEMS INC",
        "long_name": "View Systems, Inc.",
        "summary": "View Systems, Inc. develops, produces, and markets computer software and hardware systems for security and surveillance applications in the United States. The company offers concealed weapons detector, which uses data sensing technology to pinpoint the location, size, and number of concealed weapons under the ViewScan and Secure Scan names; and Viewmaxx digital video systems. It serves federal and state government courthouses, county and municipal buildings, and correctional facilities. The company was formerly known as Beneficial Investment Group, Inc. and changed its name to View Systems, Inc. in September 1998. View Systems, Inc. was incorporated in 1989 and is based in Greenbelt, Maryland.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Greenbelt",
        "zipcode": "20770",
        "website": "http://www.viewsystems.com",
        "market_cap": "Small Cap"
    },
    "VVNT": {
        "short_name": "Vivint Smart Home, Inc.",
        "long_name": "Vivint Smart Home, Inc.",
        "summary": "Vivint Smart Home, Inc., together with its subsidiaries, engages in the sale, installation, servicing, and monitoring of smart home and security systems primarily in the United States and Canada. The company's smart home platform includes cloud-enabled smart home operating systems; Vivint Assist, an AI-driven smart home automation and assistance software; software-enabled smart home devices; and tech-enabled services to educate, manage, and support the smart home. It also offers other devices, including control panel, security cameras and smoke alarms, door and window sensors, door locks, motion and tilt sensors, glass break detectors, key fobs, medical pendants, carbon monoxide detectors, flood sensors, and lamp modules. The company's solutions enable subscribers to interact with various aspects of home with voice or mobile device, including engaging with people at front door, and viewing live and recorded video inside and outside homes; and control thermostats, locks, lights, and garage doors, as well as managing movement of families, friends, and strangers. As of March 31, 2020, its smart home platform had approximately 1.5 million subscribers and managed approximately 20 million in-home devices. It markets its products through direct-to-home, inside sales channels, and retail partnerships programs. The company was founded in 1999 and is headquartered in Provo, Utah.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "UT",
        "city": "Provo",
        "zipcode": "84604",
        "website": "http://www.vivint.com",
        "market_cap": "Mid Cap"
    },
    "WCCP": {
        "short_name": "WEALTHCRAFT CAPITAL INC",
        "long_name": "Wealthcraft Capital, Inc.",
        "summary": "Wealthcraft Capital, Inc. focuses on the investment of capital in private companies that are interested in expanding their business by gaining better access to capital, management consulting, and business development. The company was formerly known as Wealthcraft Systems, Inc. and changed its name to Wealthcraft Capital, Inc. in February 2017. Wealthcraft Capital, Inc. was founded in 2003 and is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": null,
        "website": "http://www.wealthcraftcapital.com",
        "market_cap": "Small Cap"
    }
}