{"5AR1.F": {"short_name": "JANONE INC.", "long_name": "JanOne Inc.", "summary": "JanOne Inc. develops treatments for conditions that cause severe pain. The company, through its non-addictive pain-relieving drugs, focuses on reduction for need of opioid prescriptions to treat disease associated pain that can lead to opioid abuse. Its lead candidate JAN101 provides slow-release formulation of sodium nitrite therapeutic for treatment of peripheral artery disease (PAD). The company was formerly known as Appliance Recycling Centers of America, Inc. and changed its name to JanOne Inc. in September 2019. JanOne Inc. was founded in 1976 and is headquartered in Las Vegas, Nevada.", "currency": "EUR", "sector": "Industrials", "industry": "Waste Management", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Las Vegas"}, "7AR.F": {"short_name": "CHARAH SOLUTIONS  DL-,01", "long_name": "Charah Solutions, Inc.", "summary": "Charah Solutions, Inc. provides environmental and maintenance services to the power generation industry in the United States. The company operates in two segments, Environmental Solutions; and Maintenance and Technical Services. The Environmental Solutions segment offers remediation and compliance services, including development, construction, and management of landfills for coal-fired power generation facilities, and new and existing ash ponds; and active pond management services, such as clean closure, cap-in-place, and design and construction of new ponds. This segment also sells recycling of recurring and contracted volumes of coal-fired power generation waste byproducts comprising bottom ash, fly ash, and gypsum byproducts for the use in various industrial purposes. The Maintenance and Technical Services segment provides fossil services, including coal ash management, silo management, on-site ash transportation, landfill management, and capture and disposal of ash byproducts, as well as staffing solutions for coal-fired power generation facilities; and manages combustion byproducts comprising bottom ash, as well as disposal of flue gas desulfurization gypsum, Pozatec/fixated scrubber sludge, and fluidized bed combustion fly ash. This segment also offers nuclear services consisting of routine maintenance, outage services, facility maintenance, and staffing solutions for nuclear power generation facilities. Charah Solutions, Inc. was founded in 1987 and is headquartered in Louisville, Kentucky.", "currency": "EUR", "sector": "Industrials", "industry": "Waste Management", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Louisville"}, "AFBG": {"short_name": "AMERICAN FIBER GREEN PRODUCTS I", "long_name": "American Fiber Green Products, Inc.", "summary": "American Fiber Green Products, Inc., through its subsidiaries, focuses on the reclamation manufacturing of commercial fiberglass products from molded fiberglass waste and outdated resin waste. The company intends to produce and market railroad ties, parking stops, dock fendering systems, vessel fendering systems, bridge fendering systems, and seawalls. It also focuses on producing fiberglass vintage car replicas, boats, and other leisure products. American Fiber Green Products, Inc. was founded in 1993 and is based in Tampa, Florida.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Tampa"}, "AGLX.OL": {"short_name": "AGILYX AS", "long_name": "Agilyx AS", "summary": "Agilyx AS engages in the chemical recycling of post-use plastics back into plastics, chemical intermediates, and low carbon fuels. The company develops systems and technologies to transform non-recyclable plastics into a range of valuable products, including a liquid from styrofoam recycling that is used in pharmaceutical, agricultural, safety, construction, food packaging, durable goods, composites, insulation, and shipping industry products; and a drop-in replacement for fossil crude oil used by refineries. It serves waste and recycling companies, municipalities, and industrial waste plastics generators. The company was founded in 2004 and is headquartered in Tigard, Oregon.", "currency": "NOK", "sector": "Industrials", "industry": "Waste Management", "exchange": "OSL", "market": "no_market", "country": "United States", "city": "Tigard"}, "ALAN": {"short_name": "ALANCO TECHNOLOGIES INC", "long_name": "Alanco Technologies, Inc.", "summary": "Alanco Technologies, Inc., together with its subsidiaries, engages in the treatment and disposal of produced water generated as a byproduct from oil and natural gas producers in Western Colorado. It is also involved in oil reclamation activities. The company was founded in 1969 and is headquartered in Scottsdale, Arizona.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Scottsdale"}, "AQK.F": {"short_name": "AQUA METALS INC.  DL-,001", "long_name": "Aqua Metals, Inc.", "summary": "Aqua Metals, Inc. engages in the recycling of lead primarily in the United States. It produces and sells lead bullion, lead compounds, and plastics. The company was founded in 2014 and is headquartered in McCarran, Nevada.", "currency": "EUR", "sector": "Industrials", "industry": "Waste Management", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "McCarran"}, "AQMS": {"short_name": "Aqua Metals, Inc.", "long_name": "Aqua Metals, Inc.", "summary": "Aqua Metals, Inc. engages in the recycling of lead primarily in the United States. It produces and sells lead bullion, lead compounds, and plastics. The company was founded in 2014 and is headquartered in McCarran, Nevada.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "McCarran"}, "AWX": {"short_name": "Avalon Holdings Corporation", "long_name": "Avalon Holdings Corporation", "summary": "Avalon Holdings Corporation provides waste management services to industrial, commercial, municipal, and governmental customers in the United States. It operates through Waste Management Services, and Golf and Related Operations segments. The Waste Management Services segment offers hazardous and nonhazardous waste disposal brokerage and management services; and captive landfill management services, as well as engages in salt water injection well operations. This segment also provides turnkey services, including daily operations, facilities management, and management reporting; and sells construction mats. The Golf and Related Operations segment operates and manages three golf courses and related clubhouses, a hotel, and a travel agency. Its golf and country club facilities provide swimming pools, fitness centers, tennis courts, dining, and banquet and conference facilities, as well as spa services. The company also owns and operates hotel under the brand of The Grand Resort, which provides various facilities, such as swimming pool, fitness center, rooms, restaurants, bars, banquet, and conference facilities, as well as adjoining tennis center. The company was founded in 1998 and is headquartered in Warren, Ohio. Avalon Holdings Corporation operates as a subsidiary of The Hain Celestial Group, Inc.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Warren"}, "BEEN": {"short_name": "BETTER ENVIRONMENT CONCEPTS INC", "long_name": "Better Environment Concepts, Inc.", "summary": "Better Environment Concepts Inc. operates as an energy consulting company in the United States. It acquires interests in, or participates in the creation of projects while providing financial, management, and technical support to development stage businesses, primarily in the green or alternative energy industry. It focuses on developing four energy projects. The company was formerly known as Unidigitel Inc. and changed its name to Better Environment Concepts Inc. in June 2009. Better Environment Concepts Inc. was incorporated in 1995 and is based in Seattle, Washington.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Seattle"}, "BEHL": {"short_name": "BIOCENTRIC ENERGY HOLDINGS INC", "long_name": "Biocentric Energy Holdings, Inc.", "summary": "Biocentric Energy Holdings, Inc. manufactures waste recycling equipment. The company is based in Scottsdale, Arizona.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Scottsdale"}, "C3K.F": {"short_name": "COVANTA HLDG CORP. DL-,10", "long_name": "Covanta Holding Corporation", "summary": "Covanta Holding Corporation, through its subsidiaries, provides waste and energy services to municipal entities primarily in the United States and Canada. It owns and operates infrastructure for the conversion of waste to energy, as well as engages in related waste transport and disposal, and other renewable energy production businesses. The company disposes waste and generates electricity and/or steam; sells metal recovered during the energy-from-waste (EfW) process; and offers waste management solutions, such as site clean-up, wastewater treatment, pharmaceutical and healthcare solutions, reverse distribution, transportation and logistics, recycling, and depackaging. As of December 31, 2019, it owned and operated 41 EfW operations, 14 transfer stations, 20 material processing facilities, four landfills, two wood waste energy projects, one regional metals recycling facility, and one ash processing facility. Covanta Holding Corporation has a strategic partnership with the Green Investment Group Limited to develop EfW projects in Ireland and the United Kingdom. The company was formerly known as Danielson Holding Corporation and changed its name to Covanta Holding Corporation in September 2005. Covanta Holding Corporation was incorporated in 1992 and is headquartered in Morristown, New Jersey.", "currency": "EUR", "sector": "Industrials", "industry": "Waste Management", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Morristown"}, "CESX": {"short_name": "CES SYNERGIES INC", "long_name": "CES Synergies, Inc.", "summary": "CES Synergies, Inc., an asbestos and lead abatement contracting firm, engages in the removal of asbestos and lead from buildings and other structures, and demolition of structures in the United States. It operates through three segments: Remediation, Demolition, and Insulation. The Remediation segment engages in the asbestos abatement, lead removal, mold remediation, and indoor air quality/duct cleaning activities; and removal of contaminated soil, animal waste removal, manual selective and complete interior demolition comprising removal of floor covering, and adhesive removal services for commercial, retail, governmental, industrial, military, and public and private schools. The Demolition segment is involved in the building separations, concrete breaking, and saw-cutting using its own man-lifts, bobcats, roll-off containers, and roll-off trucks for the hauling and disposal of construction debris. This segment also offers full-scale commercial demolition and wrecking, as well as underground and above ground storage tank removal, and full-scale site clearing, including underground pipe removal and installation. The Insulation segment engages in the re-insulation and insulation of new and remodeling projects. CES Synergies, Inc. is also involved in the construction, installation, and repair of ceilings. The company serves city, state, and federal agencies, as well as general contractors, developers, project owners, and industrial and commercial clients. CES Synergies, Inc. was founded in 1988 and is headquartered in Crystal Springs, Florida.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Crystal Springs"}, "CHRA": {"short_name": "Charah Solutions, Inc.", "long_name": "Charah Solutions, Inc.", "summary": "Charah Solutions, Inc. provides environmental and maintenance services to the power generation industry in the United States. The company operates in two segments, Environmental Solutions; and Maintenance and Technical Services. The Environmental Solutions segment offers remediation and compliance services, including development, construction, and management of landfills for coal-fired power generation facilities, and new and existing ash ponds; and active pond management services, such as clean closure, cap-in-place, and design and construction of new ponds. This segment also sells recycling of recurring and contracted volumes of coal-fired power generation waste byproducts comprising bottom ash, fly ash, and gypsum byproducts for the use in various industrial purposes. The Maintenance and Technical Services segment provides fossil services, including coal ash management, silo management, on-site ash transportation, landfill management, and capture and disposal of ash byproducts, as well as staffing solutions for coal-fired power generation facilities; and manages combustion byproducts comprising bottom ash, as well as disposal of flue gas desulfurization gypsum, Pozatec/fixated scrubber sludge, and fluidized bed combustion fly ash. This segment also offers nuclear services consisting of routine maintenance, outage services, facility maintenance, and staffing solutions for nuclear power generation facilities. Charah Solutions, Inc. was founded in 1987 and is headquartered in Louisville, Kentucky.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Louisville"}, "CLH": {"short_name": "Clean Harbors, Inc.", "long_name": "Clean Harbors, Inc.", "summary": "Clean Harbors, Inc. provides environmental, energy, and industrial services in North America. The company operates through two segments, Environmental Services and Safety-Kleen. The Environmental Services segment collects, transports, treats, and disposes hazardous and non-hazardous waste, such as resource recovery, physical treatment, fuel blending, incineration, landfill disposal, wastewater treatment, lab chemicals disposal, and explosives management services; and CleanPack services, which comprise collection, identification and categorization, specialized packaging, transportation, and disposal of laboratory chemicals and household hazardous waste. It also provides industrial maintenance and specialty industrial services, and utilizes specialty equipment and resources that performs field services. The Safety-Kleen segment offers specially designed parts washers; automotive and industrial cleaning products, such as degreasers, glass and floor cleaners, hand cleaners, absorbents, antifreeze, windshield washer fluids, mats, and spill kits; pickup and transportation services for hazardous and non-hazardous containerized waste for recycling or disposal; and vacuum services to remove solids, residual oily water and sludge, and other fluids from customers oil/water separators, sumps, and collection tanks, as well as remove and collect waste fluids found at metal fabricators, auto maintenance providers, and general manufacturers. This segment also manufactures, formulates, packages, distributes, and markets lubricants; and provides containerized waste, vac services, used motor oil collection, and contract blending and packaging services. Clean Harbors, Inc. was founded in 1980 and is headquartered in Norwell, Massachusetts.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Norwell"}, "CVA": {"short_name": "Covanta Holding Corporation", "long_name": "Covanta Holding Corporation", "summary": "Covanta Holding Corporation, through its subsidiaries, provides waste and energy services to municipal entities primarily in the United States and Canada. It owns and operates infrastructure for the conversion of waste to energy, as well as engages in related waste transport and disposal, and other renewable energy production businesses. The company disposes waste and generates electricity and/or steam; sells metal recovered during the energy-from-waste (EfW) process; and offers waste management solutions, such as site clean-up, wastewater treatment, pharmaceutical and healthcare solutions, reverse distribution, transportation and logistics, recycling, and depackaging. As of December 31, 2019, it owned and operated 41 EfW operations, 14 transfer stations, 20 material processing facilities, four landfills, two wood waste energy projects, one regional metals recycling facility, and one ash processing facility. Covanta Holding Corporation has a strategic partnership with the Green Investment Group Limited to develop EfW projects in Ireland and the United Kingdom. The company was formerly known as Danielson Holding Corporation and changed its name to Covanta Holding Corporation in September 2005. Covanta Holding Corporation was incorporated in 1992 and is headquartered in Morristown, New Jersey.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Morristown"}, "CWSS": {"short_name": "CREATIVE WASTE SOLUTIONS INC", "long_name": "Creative Waste Solutions, Inc.", "summary": "Creative Waste Solutions, Inc., through its subsidiaries, provides waste management environmental services to residential, commercial, industrial, and municipal customers in the United States. It offers waste management brokerage services; and operates waste transfer station that accepts various waste. The company is based in Boca Raton, Florida.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Boca Raton"}, "CWST": {"short_name": "Casella Waste Systems, Inc.", "long_name": "Casella Waste Systems, Inc.", "summary": "Casella Waste Systems, Inc., together with its subsidiaries, operates as a vertically-integrated solid waste services company in the northeastern United States. The company operates through Eastern Region, Western Region, Recycling, and Other segments. It offers resource management services primarily in the areas of solid waste collection and disposal, transfer, recycling, and organics services to residential, commercial, municipal, and industrial customers. The company provides a range of non-hazardous solid waste services, including collections, transfer stations, material recovery facilities, and disposal facilities. It also markets recyclable metals, aluminum, plastics, and paper and corrugated cardboard that are processed at its facilities, as well as recyclables purchased from third parties. In addition, the company is involved in commodity brokerage operations. As of January 31, 2020, it owned and/or operated 43 solid waste collection operations, 58 transfer stations, 20 recycling facilities, 8 Subtitle D landfills, 4 landfill gas-to-energy facilities, and 1 landfill permitted to accept construction and demolition materials. The company was founded in 1975 and is headquartered in Rutland, Vermont.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Rutland"}, "DGWR": {"short_name": "DEEP GREEN WASTE & RECYCLING IN", "long_name": "Deep Green Waste & Recycling, Inc.", "summary": "Deep Green Waste & Recycling, Inc. focuses on providing waste and recycle management services. It intends to offers recycling services that reduce the disposal of plastics, electronic wastes, food wastes, and hazardous wastes. The company was founded in 1995 and is based in Woodinville, Washington.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Woodinville"}, "ECCI": {"short_name": "ECOLOCLEAN INDUSTRIES INC", "long_name": "Ecoloclean Industries, Inc.", "summary": "Ecoloclean Industries, Inc., together with its subsidiaries, engages in the manufacture and sale of machines for the treatment of contaminated water through a process, known as electrocoagulation. It designs and manufactures portable electrocoagulation units for ground water cleanup; process rinse and wash water; potable water; sewage treatment; cooling towers; radioactive isotope removal; pretreatment for reverse osmosis, ultra-filtration, nano-filtration, and photocatlytics; water reuse resulting in zero discharge; metal recovery; influent quality water control; and industrial waste water. The company provides its products and services to the petroleum exploration, petroleum, chemical, transportation, refining, and dairy industries worldwide. The company was founded in 2001 and is based in Crystal City, Texas.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Crystal City"}, "ECEZ": {"short_name": "ECOSCIENCES INC", "long_name": "Ecosciences, Inc.", "summary": "Ecosciences, Inc. engages in the development, production, and sale of environmentally focused wastewater products to food and sanitation industries, as well as residential consumers in the United States and internationally. It produces organic tablets and powders to be used regularly and in lieu of harmful chemical cleaning products in grease trap and septic tank systems. The company provides bio-remediation services for sewers, sludge ponds, septic tanks, lagoons, farms, car washes, portable sanitation facilities, grease tanks, lakes, and ponds. Its products include Tank-Eze Wastewater Tablets, which provide active oxygen, nutrients, buffers, and safe aerobic microorganisms to clean, control odor, and keep wastewater systems running with reduced downtime; Trap-Eze Grease Trap Tablets that offer active oxygen, nutrients, buffers, and safe anaerobic and aerobic microorganisms to clean, deodorize, and keep grease traps running with reduced downtime; and Wash-Eze Car Wash Tablet, which reduces noxious odors, spotting, and other problems associated with the use of reclaimed water. The company primarily sells its products to municipalities, retail consumers, commercial and industrial users, food processors, hospitals, supermarkets, restaurants, and the janitorial supply industry through a network of master distributors, full line distributors, and sales representatives. Ecosciences, Inc. is based in Jericho, New York.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Jericho"}, "ECOL": {"short_name": "US Ecology, Inc.", "long_name": "US Ecology, Inc.", "summary": "US Ecology, Inc., through its subsidiaries, provides environmental services to commercial and government entities in the United States, Canada, Europe, the Middle East, Africa, Mexico, internationally. It operates through two segments, Environmental Services, and Field & Industrial Services. The Environmental Services segment offers specialty material management services, including transportation, recycling, treatment, and disposal of hazardous, non-hazardous, E&P, and radioactive waste at its landfill, wastewater, deep-well injection, and other treatment facilities. The Field & Industrial Services segment provides specialty field services, which includes standby services, emergency response, industrial cleaning and maintenance, remediation, lab packs, retail services, transportation, and other services; and waste management services, such as on-site management, waste characterization, and transportation and disposal of non- hazardous and hazardous waste to commercial and industrial facilities, and government entities. US Ecology, Inc. serves oil refineries, chemical production plants, steel mills, real estate developers, and waste brokers/aggregators serving small manufacturers, and other industrial customers. The company was formerly known as American Ecology Corporation and changed its name to US Ecology, Inc. in February 2010. US Ecology, Inc. was founded in 1952 and is headquartered in Boise, Idaho.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Boise"}, "ECPL": {"short_name": "ECOPLUS INC", "long_name": "EcoPlus Inc.", "summary": "EcoPlus Inc. provides a solution for managing fats, oils, and grease (FOG) from food service establishments and food processors. Its process technology converts sticky fats, oils, and grease along with incorporated food matter into a solid, granular material that is used as a soil amending agent in agricultural applications. The company's technology is used in combined energy and waste heat plants, conventional steam plants, and cement plants. It markets primarily to cities, counties, and wastewater agencies who have issues with excessive FOG uptake into their wastewater operations. The company was founded in 2004 and is based in Huntersville, North Carolina.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Huntersville"}, "EQTE": {"short_name": "EQM TECHNOLOGIES & ENERGY INC", "long_name": "EQM Technologies & Energy, Inc.", "summary": "Environmental Quality Management, Inc. provides environmental consulting, engineering and compliance, and remediation and construction management services in the United States. Its environmental consulting services include air management services; community relations; compliance outsourcing; environmental, health, and safety auditing; industrial hygiene, and occupational safety and health; mergers and acquisitions/due diligence; remediation and construction management; storm water engineering services; storm water monitoring; storm water and wastewater management; tank testing; and waste management services. The company also provides engineering solutions comprising study and detailed, electrical, mechanical, piping, civil/environmental, HVAC, project management, cost estimating, construction management, and wastewater engineering services, as well as structural design and inspection services. In addition, it offers remediation and construction services, such as agency interface, building remediation and demolition, construction management, data validation, hazardous waste management/disposal, long-term monitoring and operation, multimedia compliance sampling, phase I/II site assessment, RCRA/CERCLA compliance, site demolition/decontamination, site closeout/decision documents, site remediation and rapid response, soil and groundwater assessment, and sustainable remedial design and construction, as well as operation, maintenance, and optimization of remedial systems. The company serves automotive, chemical/petrochemical, food and beverage, industrial/manufacturing, institutions, paper, pharmaceutical, power, steel/cement, and tank testing sectors, as well as US Air Force, US Army Corps of Engineers, US EPA Emergency Response and Remediation Services, US EPA Great Lakes National Program Office Cleanup Services, and US Navy. Environmental Quality Management, Inc. was founded in 1990 and is headquartered in Cincinnati, Ohio. As of July 1, 2019, EQM Technologies & Energy, Inc. operates as a subsidiary of ASRC Industrial Services, LLC.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Cincinnati"}, "EVSP": {"short_name": "ENVIRONMENTAL SVC PROFESSIONAL ", "long_name": "Environmental Service Professionals, Inc.", "summary": "Environmental Service Professionals, Inc., through its subsidiaries, provides environmental consulting services for addressing mold and moisture intrusion and the associated acute or chronic issues that impact the interior air quality of commercial and residential buildings. The company offers Certified Environmental Home Inspector (CEHI) program, a training, certification, inspection, and results reporting analysis program that provides moisture and toxin inspection, as well as energy use awareness to residential and commercial clients. It also provides cross-training on CEHI programs for insurance companies, underwriters, and loss control and risk management personnel. Environmental Service Professionals, Inc. was formerly known as Pacific Environmental Sampling, Inc. and changed its name to Environmental Service Professionals, Inc. in October 2006. The company was incorporated in 1992 and is based in Palm Springs, California.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Palm Springs"}, "EXPL": {"short_name": "ENDURANCE EXPLORATION GROUP INC", "long_name": "Endurance Exploration Group, Inc.", "summary": "Endurance Exploration Group, Inc., through its subsidiaries, engages in the exploration and recovery of deep-ocean shipwrecks worldwide. The company focuses on aquatic research, survey, inspection, and recovery, as well as maritime contract and consulting services. It also recovers bullion precious metals, numismatic-grade coinage, non-ferrous metals, and other valuable cargos from historic and modern shipwrecks. The company was founded in 2009 and is headquartered in Clearwater, Florida.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Clearwater"}, "EXSO": {"short_name": "CONSOLIDATED ECO SYSTEMS INC", "long_name": "Consolidated Eco-Systems, Inc.", "summary": "Consolidated EcoSystems, Inc. provides various environmental, industrial, and technical services in the United States and internationally. It primarily offers environmental remediation, industrial clean-up, emergency response, recycling, and various specialized environmental services. The company also manufactures and markets an organic peat moss-based absorbent material used primarily to clean up oil and other hydrocarbon based materials. It serves clients in various industries, including petrochemicals; agricultural chemicals; oil exploration, refining, and marketing; gas pipelines; pulp and paper/forest products; manufacturing; waste disposal and management; state and local government; and law firms. The company was incorporated as Sentinel Mines Corporation in 1930 and changed its name to Exsorbet Industries, Inc. in November 1993. It further changed its name to Consolidated Eco-Systems, Inc in January 1997. Consolidated Eco-Systems is based in Lake Charles, Louisiana.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Lake Charles"}, "GARB": {"short_name": "GARB OIL & POWER CORP", "long_name": "Garb Oil & Power Corporation", "summary": "Garb Oil & Power Corporation engages in the waste recycling and related waste-to-energy businesses in the United States. It recovers rubber that is used in producing retread tires, as well as used an alternate fuel source in the generation of electric power. The company was formerly known as Garb Corporation and changed its name to Garb Oil & Power Corporation in February 2014. Garb Oil & Power Corporation was incorporated in 1972 and is based in Largo, Florida.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Largo"}, "GCEI": {"short_name": "GLOBAL CLEAN ENERGY INC", "long_name": "Global Clean Energy, Inc.", "summary": "Global Clean Energy, Inc. operates as a waste-to-energy alternative fuels company in North America. It focuses on developing build-own-operate waste-to-energy conversion sites that converts waste into energy in the end-of-life plastic, tires, and platinum group metal recover verticals. The company is headquartered in Humble, Texas.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Humble"}, "GERS": {"short_name": "GREENSHIFT CORPORATION", "long_name": "GreenShift Corporation", "summary": "GreenShift Corporation develops and commercializes clean technologies that facilitate the use of natural resources for the ethanol industry in the United States. The company's corn oil extraction technology integrates into the back-end of existing dry mill corn ethanol plants to extract and recover inedible crude corn oil, which is used in the production of advanced carbon-neutral liquid fuels and other biomass-derived alternatives to fossil fuel-based products. The company licenses its technologies to ethanol producers. GreenShift Corporation was founded in 1984 and is headquartered in Alpharetta, Georgia.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Alpharetta"}, "GETH": {"short_name": "GREEN ENVIROTECH HOLDINGS CORP", "long_name": "Green EnviroTech Holdings Corp.", "summary": "Green EnviroTech Holdings Corp. operates as a plastics recovery, separation, cleaning, and recycling company. The company transforms unusable scrap tires into various end products, such as carbon black, oil, and steel. It also offers Generation One, which produces a blend stock oil, char/carbon, and steel. The company was founded in 2008 and is based in Jamestown, California.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Jamestown"}, "GEVI": {"short_name": "GENERAL ENVIRONMENTAL MANAGEMEN", "long_name": "General Environmental Management, Inc.", "summary": "General Environmental Management, Inc. provides industrial liquid waste treatment and remediation services. It offers field services, remediation, transportation, and site treatment for hazardous and non-hazardous materials to the oil and gas industry, industrial clients, and domestic waste generators. The company also provides on-site waste treatment systems and environmental incidents and spills cleanup services. It manages the services provided by web-based enterprise software, GEMWare. General Environmental Management, Inc. was incorporated in 2003 and is based in Pomona, California.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Pomona"}, "GMND": {"short_name": "GREEN MOUNTAIN DEVELOPMENT CORP", "long_name": "Green Mountain Development Corp.", "summary": "Green Mountain Development Corp provides project development services for capital providers and technology operators; and distributes licensed products related to the energy, agricultural, and environmental sectors. The company assists clients with preliminary development work, including project due diligence, investor presentations, identification of project capital sources and technology vendors, and negotiation of a joint venture agreement between investors and the client. It also distributes Bio-Miracle microbial blends that are used for agricultural growth enhancement, composting acceleration, pond and lake water treatment, hydrocarbon reduction in soil and water, and animal and green waste treatment. The Bio-Miracle product lines include Remediline remediation products comprising SPILL KILL PRO, an oil spill cleanup product for soil and tank applications, and SIZZLE CLEAN, a microbe water based fizzing tablet for parts cleaning applications; Wasteline waste management products consisting of MANURE KING for cow/horse/pig manure control and SPARKLE CLEAN for septic and cesspool cleanup; and Bi-Agra agricultural products for increased plant health, size, and yield improvement, such as Bi-Agra-100, Bi-Agra-200, TOO TALL TOMATOES, and COMPOST PAL for backyard and commercial composting acceleration, as well as non-invasive dethatch applications. In addition, it focuses on the research, development, and production of a range of life science products. The company is based in Carlsbad, California.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Carlsbad"}, "GNCC": {"short_name": "GENCO CORPORATION", "long_name": "Genco Corporation", "summary": "Genco Corporation provides financial advisory, corporate restructuring, and merger and acquisition services. It is also involved in the investment activities. The company was incorporated in 1985 and is based in Las Vegas, Nevada.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "GNPT": {"short_name": "GREEN PARTS INTERNATIONAL INC", "long_name": "GreenParts International, Inc.", "summary": "Greenparts International, Inc. operates as a salvage and reclamation company, dealing with non-landfill materials through sorting, recycling, and containment and disposal of bio-hazard. It operates through two segments, Metal Purchasing, Processing, Recycling, and Selling; and Used Auto Parts. The company recycles automobiles and appliances providing raw materials for manufactures in the United States, China, Korea, and India. It also recycles various materials, including steel, aluminum, and copper, as well as automotive oils and greases. In addition, it sells used parts and rebuilds vehicles for resale. Greenparts International, Inc. supplies recycled and used auto parts through its salvage yards, retail stores, and call centers, as well as through Internet or through its toll-free number. The company was formerly known as Thrive Development, Inc. and changed its name to Greenparts International, Inc. in 2005. Greenparts International, Inc. was incorporated in 1998 and is based in Atlanta, Georgia.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Atlanta"}, "GRCO": {"short_name": "GREENBELT RESOURCE CORPORATION", "long_name": "Greenbelt Resources Corporation", "summary": "Greenbelt Resources Corporation designs, manufactures, operates, and sells modular systems that recycle food wastes, beverage, and cellulosic waste into sellable products. The company provides resource-to-ethanol technology solutions designed for localized processing of locally generated waste or energy crops into locally consumed ethanol, fertilizer, animal feed, electricity, and filtered and distilled water. It also offers technical support and monitoring services. Greenbelt Resources Corporation was formerly known as Originally New York, Inc. and changed its name to Greenbelt Resources Corporation in June 2007. The company was founded in 2001 and is headquartered in Paso Robles, California. Greenbelt Resources Corporation operates as a subsidiary of James Monroe Capital Corporation.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Paso Robles"}, "GRNL": {"short_name": "GREENLITE VENTURES INC", "long_name": "Greenlite Ventures Inc.", "summary": "Greenlite Ventures Inc. operates as a carbon offsets marketing company. It intends to sell carbon offsets through its Website to voluntary markets where no verification is required; verified carbon offsets through other markets; and verified emission reduction, and reduced emissions from deforestation and degradation carbon offsets through global restoration projects to companies, foundations, and other entities that wish to offset their carbon footprints to support climate change mitigation efforts. The company was founded in 2000 and is based in North Las Vegas, Nevada.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "North Las Vegas"}, "GSPI": {"short_name": "GREEN STAR PRODUCTS INC", "long_name": "Green Star Products, Inc.", "summary": "Green Star Products, Inc. produces algae based renewable burning fuels in the United States. It involves in designing and engineering bio-diesel reactors and process control systems that produce bio-diesel and cellulosic ethanol. The company also develops and produces anti-friction metal treatment products, which include lubricants and additives that reduce emissions and enhances fuel economy in vehicles, machinery, and power plants. It sells its lubricants and additives under SuperBat TVT brand name for use in various internal combustion engines, transmissions, power steering, wheel bearings, and differentials. The company was formerly known as B.A.T. International, Inc. and changed its name to Green Star Products, Inc. in July 2002. Green Star Products, Inc. was founded in 1984 and is based in Salt Lake City, Utah.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Salt Lake City"}, "HCCI": {"short_name": "Heritage-Crystal Clean, Inc.", "long_name": "Heritage-Crystal Clean, Inc", "summary": "Heritage-Crystal Clean, Inc., through its subsidiary, Heritage-Crystal Clean, LLC, provides parts cleaning, hazardous and non-hazardous waste, and used oil collection services to small and mid-sized customers in the industrial and vehicle maintenance services industries in North America. It operates in two segments, Environmental Services and Oil Business. The Environmental Services segment offers parts cleaning, containerized waste management, vacuum truck, antifreeze recycling, and field services. The Oil Business segment engages in the collection of used oil, the sale of recycled fuel oil, and used oil filter removal and disposal activities, as well as the re-refining of used oil into lubricant base oil and other products. This segment also collects and disposes waste water. As of March 02, 2020, the company operated through 89 branches serving approximately 90,000 customer locations. Heritage-Crystal Clean, Inc. was incorporated in 2007 and is headquartered in Elgin, Illinois.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Elgin"}, "JAN": {"short_name": "JanOne Inc.", "long_name": "JanOne Inc.", "summary": "JanOne Inc. develops treatments for conditions that cause severe pain. The company, through its non-addictive pain-relieving drugs, focuses on reduction for need of opioid prescriptions to treat disease associated pain that can lead to opioid abuse. Its lead candidate JAN101 provides slow-release formulation of sodium nitrite therapeutic for treatment of peripheral artery disease (PAD). The company was formerly known as Appliance Recycling Centers of America, Inc. and changed its name to JanOne Inc. in September 2019. JanOne Inc. was founded in 1976 and is headquartered in Las Vegas, Nevada.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "JPEX": {"short_name": "JPX GLOBAL INC", "long_name": "JPX Global, Inc.", "summary": "JPX Global, Inc., a development stage company, intends to provide waste management services primarily in Mexico. The company's services include the storage, recycling, and disposal of industrial, toxic, and hazardous wastes. Its target customers comprise commercial, industrial, municipal, and residential customers, as well as other waste management companies, electric utilities, and governmental entity properties. The company was formerly known as Jasper Explorations, Inc. and changed its name to JPX Global, Inc. in January 2013. JPX Global, Inc. was founded in 2008 and is based in Draper, Utah.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Draper"}, "LEIC": {"short_name": "LEAD INNOVATION CORPORATION", "long_name": "Lead Innovation Corporation", "summary": "Lead Innovation Corporation engages in off the road tire pyrolysis processing business. It collects and processes oversize off road tires, such as large mining trucks and agricultural vehicles tires into component parts comprising pyrolysis oil, syngas, carbon black, and steel, as well as sells these component parts to petroleum product manufacturers and rubber blenders. The company was formerly known as Hitec Corp. and changed its name to Lead Innovation Corporation in February 2018. Lead Innovation Corporation is headquartered in Jefferson City, Missouri.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Jefferson City"}, "MCIM": {"short_name": "MACAU CAPITAL INVESTMENTS INC", "long_name": "Macau Capital Investments, Inc.", "summary": "Macau Capital Investments, Inc. though its subsidiary offers solid waste and medical waste management services. Its subsidiary includes ECO Medical Waste Holdings, Inc. Macau Capital Investments, Inc. was formerly known as Silicon Valley Research, Inc. and changed its name to Macau Capital Investments, Inc. in March 2008. The company is based in San Jose, California.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "San Jose"}, "MEG": {"short_name": "Montrose Environmental Group, I", "long_name": "Montrose Environmental Group, Inc.", "summary": "Montrose Environmental Group, Inc. operates as an environmental services company in the United States. The company operates in three segments: Assessment, Permitting and Response; Measurement and Analysis; and Remediation and Reuse. The Assessment, Permitting and Response segment provides scientific advisory and consulting services to support environmental assessments, environmental emergency response, and environmental audits and permits for current operations, facility upgrades, new projects, decommissioning projects, and development projects. Its technical advisory and consulting services include regulatory compliance support and planning, environmental, and ecosystem and toxicological assessments and support during responses to environmental disruptions. The Measurement and Analysis segment tests and analyzes air, water, and soil to determine concentrations of contaminants, as well as the toxicological impact of contaminants on flora, fauna, and human health. Its services include source and ambient air testing and monitoring, leak detection, and advanced analytical laboratory services, such as air, storm water, wastewater, and drinking water analysis. The Remediation and Reuse segment provides engineering, design, implementation, and operations and maintenance services primarily to treat contaminated water, remove contaminants from soil, or create biogas from agricultural waste. The company was founded in 2012 and is headquartered in Irvine, California.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Irvine"}, "MJWL": {"short_name": "MAJIC WHEELS CORPORATION", "long_name": "Majic Wheels Corp.", "summary": "Majic Wheels Corp., a development stage company, operates in waste management business. It intends to engage in environmental safe junk removal, trash hauling, recycling, commercial and residential construction cleanup, and demolition business activities, as well as roll off dumpster rentals and site work services. The company was founded in 2007 and is based in Fort Myers, Florida.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Fort Myers"}, "MPHD": {"short_name": "MEDIA PAL HOLDINGS CORP", "long_name": "Media Pal Holdings, Corp.", "summary": "Media Pal Holdings, Corp. operates as a non-hazardous waste treatment and disposal facility. It operates a 250-gallon per minute waste stream separation system at the Wyoming Avenue terminal facility. This system separates liquid waste streams and pumpable waste streams containing a mixture of liquids and solids. Its customers are located primarily throughout the Great Lakes region. The company, formerly known as Rich Coast, Inc. Media Pal Holdings, Corp. was founded in 1936 and is based in Sarasota, Florida.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Sarasota"}, "NES": {"short_name": "Nuverra Environmental Solutions", "long_name": "Nuverra Environmental Solutions, Inc.", "summary": "Nuverra Environmental Solutions, Inc. provides water logistics and oilfield services to customers focused on the development and ongoing production of oil and natural gas from shale formations in the United States. The company provides water transfer, disposal, rental, and other services associated with the drilling, completion, and ongoing production of shale oil and natural gas. It operates through three divisions: the Rocky Mountain, the Northeast, and the Southern. The Rocky Mountain Division manages a fleet of 204 trucks; owns, manages, and leases a network of 20 salt water disposal wells under the Landtech brand names; and maintains and leases rental equipment, including tanks, loaders, manlifts, light towers, winch trucks, and other miscellaneous equipment used in drilling and completion activities to oil and gas operators and others, as well as provides oilfield labor services. The Northeast Division manages a fleet of 201 trucks; owns, manages, and leases a network of 14 salt water disposal wells under the Nuverra, Heckmann, and Clearwater brands; and maintains and leases rental equipment, including tanks and winch trucks used in drilling and completion activities to oil and gas operators and others. The Southern Division manages a fleet of 34 trucks; owns and operates 60-mile underground twin pipeline network; owns, manages, and leases a network of 7 salt water disposal wells; and maintains and leases rental equipment, including tanks and winch trucks used in drilling and completion activities to oil and gas operators and others. The company was formerly known as Heckmann Corporation and changed its name to Nuverra Environmental Solutions, Inc. in May 2013. Nuverra Environmental Solutions, Inc. was founded in 2007 and is headquartered in Scottsdale, Arizona.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Scottsdale"}, "NWMH": {"short_name": "NATIONAL WASTE MGMT HLDGS INC", "long_name": "National Waste Management Holdings, Inc.", "summary": "National Waste Management Holdings, Inc. operates as a waste management company in Upstate New York and Central Florida. The company offers construction and demolition landfill services; and commercial and residential dumpster services and roll-off boxes for construction and clean-up projects specializing in the removal of debris, garbage, waste, hauling construction, and demolition debris. It also provides trash collection services, roll-off services, and a full service transfer station; and wood grinding, demolition, mulch, and gravel services for the industrial and residential markets. The company was founded in 1986 and is headquartered in Hernando, Florida.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Hernando"}, "NXSI": {"short_name": "NEXIS INTERNATIONAL INDUSTRIES ", "long_name": "Nexis International Industries, Inc.", "summary": "Nexis International Industries, Inc. develops security solutions that provide defense against acts of terrorism and other security threats. Its Milliscope prototype, a handheld device that utilizes millimeter wave technology to detect plastic explosives and other concealed contraband, such as weapons and drugs. The company was founded in 1983 and is based in Bellevue, Washington.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Bellevue"}, "OCLN": {"short_name": "ORIGINCLEAR INC", "long_name": "OriginClear, Inc.", "summary": "OriginClear, Inc. provides water treatment solutions. The company licenses its Electro Water Separation technology worldwide to treat heavily polluted waters, as well as to remove harmful micro-contaminants from drinking water using minimal energy, chemicals, and materials. It also designs and manufactures a line of water treatment systems for municipal, industrial, and pure water applications. In addition, the company offers a range of services, including maintenance contracts, retrofits, and replacement assistance; and rents equipment through contracts of varying duration, as well as provides prefabricated water transport and wastewater treatment products. It primarily operates in the United States, Canada, Argentina, and the Middle East. The company was formerly known as OriginOil, Inc. and changed its name to OriginClear, Inc. in April 2015. OriginClear, Inc. was founded in 2007 and is headquartered in McKinney, Texas.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "McKinney"}, "PESI": {"short_name": "Perma-Fix Environmental Service", "long_name": "Perma-Fix Environmental Services, Inc.", "summary": "Perma-Fix Environmental Services, Inc., through its subsidiaries, operates as an environmental and technology know-how company in the United States. It operates in three segments: Treatment, Services, and Medical. The Treatment segment offers nuclear, low-level radioactive, mixed waste, hazardous and non-hazardous waste treatment, and processing and disposal services through treatment and storage facilities. This segment is also involved in the research and development activities to identify, develop, and implement waste processing techniques for problematic waste streams. The Services segment provides technical services, including professional radiological measurement and site survey of large government and commercial installations; integrated occupational safety and health services; and consulting, engineering, project and waste management, environmental, decontamination and decommissioning (D&D) field, technical, on-site waste management services, and management personnel and services. This segment also offers nuclear services, including technology-based services comprising engineering, D&D, specialty, construction, logistics, transportation, processing, and disposal; offers remediation of nuclear licensed and federal facilities, as well as cleanup of nuclear legacy sites; and owns an equipment calibration and maintenance laboratory that services, maintains, calibrates, and sources health physics, industrial hygiene, and customized nuclear, environmental, and occupational safety and health instrumentation, as well as laboratory for analysis of oil and gas industry solids and liquids. The Medical segment is involved in the research and development of medical isotope production technology. The company provides its services to research institutions, commercial companies, public utilities, and governmental agencies through direct sales to customers or through intermediaries. Perma-Fix Environmental Services, Inc. was founded in 1990 and is based in Atlanta, Georgia.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Atlanta"}, "PTOI": {"short_name": "PLASTIC2OIL INC", "long_name": "Plastic2Oil, Inc.", "summary": "Plastic2Oil, Inc. engages in the transforming waste plastics to oil and other fuel products in the United States. It produces light and heavy fuel products, such as naphtha, fuel oil No. 2 and fuel oil No. 6. The company also produces by-products, including a reusable off-gas similar to natural gas and a carbon residue known as petcoke. Plastic2Oil, Inc. sells its products through fuel wholesalers, as well as directly to commercial and industrial end-users. The company was formerly known as JBI, Inc. and changed its name to Plastic2Oil, Inc. in August 2014. Plastic2Oil, Inc. was incorporated in 2006 and is headquartered in Niagara Falls, New York.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Niagara Falls"}, "QHYG": {"short_name": "QHY GROUP", "long_name": "QHY Group", "summary": "QHY Group provides wastewater treatment solutions in the United States. The company is based in New York, New York.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}, "QRHC": {"short_name": "Quest Resource Holding Corporat", "long_name": "Quest Resource Holding Corporation", "summary": "Quest Resource Holding Corporation, through its subsidiaries, provides solutions for the reuse, recycling, and disposal of various waste streams and recyclables in the United States. It offers disposal and recycling services for used motor oil, oil filters, scrap tires, solid waste, metals, grease, cooking oil, food waste, and expired food products. The company also provides landfill diversion services. It offers sustainability programs, including strategic planning, writing policies and procedures, LEED certification, life cycle assessment, and building commissioning. The company's services focus on the waste streams and recyclables from big box, food chain, and other retailers; automotive maintenance, quick lube, dealerships, and collision repair; transportation, logistics, and internal fleet operators; manufacturing plants; multi-family and commercial properties; restaurant chains and food operations; and construction and demolition projects. Quest Resource Holding Corporation markets its services to automotive, manufacturing, hospitality and retail, construction and demolition, and commercial and multi-family property management industries through direct sales force and strategic partnerships. The company was formerly known as Infinity Resources Holdings Corp. and changed its name to Quest Resource Holding Corporation in October 2013. Quest Resource Holding Corporation is based in The Colony, Texas.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "The Colony"}, "RGDEF": {"short_name": "RDX TECHNOLOGIES CORP", "long_name": "RDX Technologies Corporation", "summary": "RDX Technologies Corporation operates as an energy services and water treatment company in Canada and the United States. It operates through Environmental and Reclamation, Energy, Water, and Equipment Sales and Rentals segments. The Environmental and Reclamation segment engages in the acquisition and liquidation of distressed biofuel and water treatment facilities, including engineering consulting services and the disposal of excess real property and equipment. The Energy segment produces refined fuel. The Water segment offers waste water treatment and related services. The Equipment Sales and Rentals manufacture and sale of components and systems, comprising the sale and rental of complete waste water treatment systems. RDX Technologies Corporation manufactures waste treatment systems, including No Pump interceptor / grease trap system and Sans Tanker fluid transportation systems for water contaminants and the mining of contaminates. The company was formerly known as Ridgeline Energy Services Inc. and changed its name to RDX Technologies Corporation in August 2013. RDX Technologies Corporation is headquartered in Scottsdale, Arizona. On December 5, 2017, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the District of Arizona.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Scottsdale"}, "RNWB": {"short_name": "RENEWABLE CORP", "long_name": "The Renewable Corporation", "summary": "The Renewable Corporation, a development stage company, engages in the distribution of alternative energy, clean technologies, and energy efficient related products and services to individuals, homes, businesses, and municipalities. The company primarily distributes wind, solar, lighting, HVAC, automotive, water, preparedness, energy efficiency, and other specialized products and services through a network of certified agents. It also provides plastics and other chemicals from renewable resources as an alternative to petroleum or petrochemicals, as well as acquires, develops, licenses, and integrates intellectual property that would enable the economic implementation of energy efficient, clean technologies, and sustainable products and services. In addition, the company offers durable flooring systems that are applied over existing hard flooring surfaces; and manufactures and distributes nano-technology glass coatings for corrosion protection, self-cleaning, self-sterilization, slip resistance, chemical resistance, anti-graffiti, and energy and cosmetic improvement applications. Further, it provides skin protection products, including a DNA based SPF-30 day cream; an anti-aging night cream with the hydration system, Chinese herbs, and aloe; a medical radiation protection and healing cream for use by dermatologists in radiation therapy for skin cancer; and a DNA protection cream for the tanning bed industry for DNA damage protection. Additionally, The Renewable Corporation trains merchant representatives; consolidates and provides green industry information and recommendations; evaluates, selects, and sells various products and services; and offers assistance with related government rebate and incentive programs. The company was formerly known as Industrial Biotechnology Corporation and changed its name to The Renewable Corporation in October 2008. The Renewable Corporation was founded in 1992 and is based in Lake Park, Florida.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Lake Park"}, "RPU.F": {"short_name": "REPUBLIC SERVIC. DL-,01", "long_name": "Republic Services, Inc.", "summary": "Republic Services, Inc., together with its subsidiaries, provides non-hazardous solid waste collection, transfer, disposal, recycling, and environmental services in the United States. The company serves small-container, large-container, and municipal and residential customers. The company's collection services include curbside collection of waste for transport to transfer stations, landfills, or recycling processing centers; supply of waste containers; and renting of compactors. It is also involved in the processing and sale of old corrugated containers, old newsprint, aluminum, glass, and other materials; temporary waste and recycling collection services; and provision of landfill services. As of December 31, 2019, the company operated through 340 collection operations, 212 transfer stations, 189 active landfills, 79 recycling processing centers, and 15 salt water disposal wells, as well as 7 treatment, recovery, and disposal facilities in 41 states and Puerto Rico. It also operated 75 landfill gas-to-energy and renewable energy projects and had 130 closed landfills. The company was founded in 1996 and is headquartered in Phoenix, Arizona.", "currency": "EUR", "sector": "Industrials", "industry": "Waste Management", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Phoenix"}, "RSG": {"short_name": "Republic Services, Inc.", "long_name": "Republic Services, Inc.", "summary": "Republic Services, Inc., together with its subsidiaries, provides non-hazardous solid waste collection, transfer, disposal, recycling, and environmental services in the United States. The company serves small-container, large-container, and municipal and residential customers. The company's collection services include curbside collection of waste for transport to transfer stations, landfills, or recycling processing centers; supply of waste containers; and renting of compactors. It is also involved in the processing and sale of old corrugated containers, old newsprint, aluminum, glass, and other materials; temporary waste and recycling collection services; and provision of landfill services. As of December 31, 2019, the company operated through 340 collection operations, 212 transfer stations, 189 active landfills, 79 recycling processing centers, and 15 salt water disposal wells, as well as 7 treatment, recovery, and disposal facilities in 41 states and Puerto Rico. It also operated 75 landfill gas-to-energy and renewable energy projects and had 130 closed landfills. The company was founded in 1996 and is headquartered in Phoenix, Arizona.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Phoenix"}, "SCPJ": {"short_name": "SCOPE INDUSTRIES", "long_name": "Scope Industries", "summary": "Scope Industries offers waste material recycling services in the United States. It operates plants for the collection and processing of bakery waste materials into a food supplement for animals. The company sells this food supplement to poultry farms, dairies, feed lots, and pet food manufacturers. Scope Industries also owns and operates a plant in Vernon, California, where certain bakery waste material is processed and converted into edible breadcrumbs for human consumption. The company's customers include prepackaged and restaurant supply food processors. Scope Industries was organized in 1938 and its principal executive offices are located in Santa Monica, California. Scope Industries sold all of the outstanding shares of its wholly owned subsidiary, Scope Beauty Enterprises, Inc., doing business as Marinello Schools of Beauty, to B & H Education, Inc. in March 2004.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Santa Monica"}, "SENR": {"short_name": "STRATEGIC ENVIROMENTAL & ENERGY", "long_name": "Strategic Environmental & Energy Resources, Inc.", "summary": "Strategic Environmental & Energy Resources, Inc. provides environmental, clean-technologies, and related services in the United States and internationally. The company operates through three segments: Industrial Cleaning, Environmental Solutions, and Solid Waste. It offers general industrial cleaning and waste management services to various industry sectors. The company also designs and sells H2SPlus and OdorFilter dry scrubber system solutions for management of hydrogen sulfide in biogas, landfill gas, and petroleum processing operations; and develops waste destruction technology using pyrolytic heating process combined with non-thermal plasma assisted oxidation. In addition, it develops renewable natural gas projects; and chemical absorbents and catalysts that enhance the capability of biogas produced from landfill, wastewater treatment, and agricultural digester operations. The company serves companies primarily in the oil and gas refineries, landfills, medical waste destruction operations, agricultural companies, and food and beverage companies, as well as other commercial and industrial customers. Strategic Environmental & Energy Resources, Inc. is headquartered in Broomfield, Colorado. Strategic Environmental & Energy Resources, Inc. is a subsidiary of New Stratus Energy Inc.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Broomfield"}, "SMED": {"short_name": "Sharps Compliance Corp.", "long_name": "Sharps Compliance Corp.", "summary": "Sharps Compliance Corp. provides medical, pharmaceutical, and hazardous waste management services in the United States. It offers Sharps Recovery System for the containment, transportation, treatment, and tracking of medical waste generated outside the hospital and health care facility settings; TakeAway Recovery System to treat used needles, syringes, and other used healthcare products; Route-Based Pickup Service, a medical and hazardous waste pick-up services; and MedSafe, a solution for the safe collection, transportation, and disposal of unwanted and expired ultimate-user medications. The company also provides TakeAway Medication Recovery System that facilitates the proper disposal of unused medications; Black Pail Program for Rx, a solution with minimal segregation for the disposal of various pharmaceuticals; Inhaler Disposal to collect, transport, and destroy used pharmaceutical inhalers; Hazardous Drug Spill Control Kit for the cleanup of chemotherapy and other HD spills; TakeAway Recycle System for the collection and recycling of single-use medical devices from surgical centers and other healthcare facilities; ComplianceTRAC, a Web-based compliance and training program; and Universal Waste Shipback Systems to collect, transport, and recycle light bulbs, batteries, and other mercury containing devices. In addition, it offers other solutions, such as TakeAway Environmental Return System, SharpsTracer, Sharps Secure, Needle Disposal System, Complete Needle Collection and Disposal System, Pitch-It IV Poles, Asset Return System, and Spill Kit Recovery System, as well as Sharps MWMS, a medical waste management system. The company serves customers in home health care, retail clinics and immunizing pharmacies, pharmaceutical manufacturers, professional offices, assisted living and long-term care facilities, and government agencies, as well as distributors. Sharps Compliance Corp. was founded in 1992 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Houston"}, "SRCL": {"short_name": "Stericycle, Inc.", "long_name": "Stericycle, Inc.", "summary": "Stericycle, Inc., together with its subsidiaries, provides regulated and compliance solutions to the healthcare, retail, and commercial businesses in the United States, Europe, and internationally. It operates through three segments: North America RWCS; International RWCS; and Domestic Communication and Related Services. It collects and processes regulated and specialized waste for disposal services; and collects personal and confidential information for secure destruction, recall/return, and communication services. The company's services also include medical waste disposal, pharmaceutical waste disposal, hazardous waste management, sustainability solutions for expired or unused inventory, secure information destruction of documents and e-media, and compliance services; and regulated recall and returns management communication, logistics, and data management services for expired, withdrawn, or recalled products. In addition, it offers compliance programs under the Steri-Safe, Clinical Services, First Practice Management, SeguriMed, and EnviroAssure brand names. The company serves healthcare businesses, including hospitals, physician and dental practices, outpatient clinics, long-term care facilities, etc.; retailers and manufacturers; financial and professional service providers; governmental entities; and other businesses. Stericycle, Inc. was founded in 1989 and is headquartered in Bannockburn, Illinois.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Bannockburn"}, "SUNC": {"short_name": "SUNCAST SOLAR ENERGY INC", "long_name": "Suncast Solar Energy, Inc.", "summary": "Suncast Solar Energy, Inc., through its subsidiary, Environmental Testing Laboratories, Inc., provides environmental testing services in the northeast United States. The company's services include resource conservation recovery act and hazardous waste characterization, toxic characteristic leaching procedure analyses, underground storage tank analytical assessment, landfill/ground water monitoring, and pesticide and herbicide testing in soil and groundwater services. Its services also comprise national pollution discharge elimination system effluent characteristics analysis, PCB (polychlorinated biphenyls) and PCB congener analysis, HUD lead abatement testing, fingerprint categorization, petroleum analyses, client specific deliverables, and electronic data deliverables. The company was formerly known as Paradise Music & Entertainment, Inc. and changed its name to Suncast Solar Energy, Inc. in December 2011. Suncast Solar Energy, Inc. was founded in 1984 and is based in Denver, Colorado.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Denver"}, "TEXC": {"short_name": "TEXCOM INC", "long_name": "TexCom, Inc.", "summary": "Texcom, Inc. provides environmental services to the oil and gas industry in the U.S. Gulf Region. It disposes non-hazardous oilfield wastes and naturally occurring radioactive materials generated from the exploration and production of oil and natural gas. The company was founded in 2003 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "TRTI": {"short_name": "TRANSTECH INDUSTRIES", "long_name": "Transtech Industries, Inc.", "summary": "Transtech Industries, Inc., through its subsidiaries, generates electricity utilizing methane gas and provides environmental services. It supervises and performs landfill monitoring and closure procedures; manages methane gas recovery operations; and provides a range of construction, remedial, and maintenance services at landfills, commercial, and industrial sites. The company also provides clay or synthetic, erosion control, and vegetation landfill caps services; and methane control services, such as turnkey methane recovery systems, electrical generating, flaring, well installation, and migration testing and monitoring. In addition, it offers water treatment services, such as collection systems and pre-treatment facilities; ground water services, including well installation, monitoring, and chain of custody; and surface water services that include downshoots, gabions, berms, and retention basins. Further, the company provides electrical instrumentation, property maintenance, land clearing, earth moving, excavation, and equipment rental services; use of recyclable materials as substitutes for conventional fill and drainage layers; and turnkey contaminated soil abatement programs. Transtech Industries, Inc. was formerly known as Scientific, Inc. The company was incorporated in 1965 and is based in Sewell, New Jersey.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Sewell"}, "UVSS": {"short_name": "UNIVERSAL SYSTEM INC WASHINGTON", "long_name": "Universal Systems, Inc.", "summary": "Universal Systems, Inc. provides turn-key water treatment services to the oil industry. The company specializes in slop oil and coal bed methane produced water. Its services include slop oil separation into oil; BTEX separation from liquid; conversion of heavy metal ions to metal oxides for easy disposal; separation of coal bed methane water into stream quality water and solids; production and fracturing of water clean up for safe disposal; silica removal for boiler steam stimulation of the oil field; and separation of suspended solids from water for reuse. Universal Systems, Inc. was incorporated in 1997 and is based in Baker City, Oregon.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Baker City"}, "UWS.F": {"short_name": "WASTE MANAGEMENT (DEL.)", "long_name": "Waste Management, Inc.", "summary": "Waste Management, Inc., through its subsidiaries, provides waste management environmental services to residential, commercial, industrial, and municipal customers in North America. It offers collection services, including picking up and transporting waste and recyclable materials from where it was generated to a transfer station, material recovery facility (MRF), or disposal site; and owns, develops, and operates landfill gas-to-energy facilities in the United States, as well as owns and operates transfer stations. As of December 31, 2019, the company owned or operated 244 solid waste landfills; 5 secure hazardous waste landfills; 103 MRFs; and 302 transfer stations. It also provides materials processing and commodities recycling services; recycling brokerage services, such as managing the marketing of recyclable materials for third parties; and other strategic business solutions. In addition, the company offers construction and remediation services; services related with the disposal of fly ash, and residue generated from the combustion of coal and other fuel stocks; in-plant services comprising full-service waste management solutions and consulting services; and specialized disposal services for oil and gas exploration and production operations. Further, it offers fluorescent bulb and universal waste mail-back services through LampTracker program; portable restroom services under the Port-o-Let name; and street and parking lot sweeping services, as well as holds interests in oil and gas producing properties. The company was formerly known as USA Waste Services, Inc. and changed its name to Waste Management, Inc. in 1998. Waste Management, Inc. was incorporated in 1987 and is based in Houston, Texas.", "currency": "EUR", "sector": "Industrials", "industry": "Waste Management", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "VVIT": {"short_name": "VISTA INTERNATIONAL TECHNOLOGIE", "long_name": "Vista International Technologies, Inc.", "summary": "Vista International Technologies, Inc. engages in developing, commercializing, and operating renewable energy and waste-to-energy technologies and projects. The company utilizes and offers its Thermal Gasifier technology, a horizontal multi-stage gasification system that converts residential, industrial, and commercial waste, biomass, waste tires, and other solid hydrocarbon-based material into clean thermal and electrical energy. It is also involved in the processing, storage, and transportation of scrap tires. In addition, the company produces tire shreds for landfill for use as leachate material and as sanitary landfill cover, as well as for gas wells; and tire derived fuel for use as fuel for cement kilns, paper mills, or other heat intensive processes. Further, it produces a steel wire product as a byproduct of the tire shredding process. The company's customers include generators and tire transporters. Vista International Technologies, Inc. is headquartered in Commerce City, Colorado.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Commerce City"}, "WA3.F": {"short_name": "CASELLA WASTE SYS A DL-01", "long_name": "Casella Waste Systems, Inc.", "summary": "Casella Waste Systems, Inc., together with its subsidiaries, operates as a vertically-integrated solid waste services company in the northeastern United States. The company operates through Eastern Region, Western Region, Recycling, and Other segments. It offers resource management services primarily in the areas of solid waste collection and disposal, transfer, recycling, and organics services to residential, commercial, municipal, and industrial customers. The company provides a range of non-hazardous solid waste services, including collections, transfer stations, material recovery facilities, and disposal facilities. It also markets recyclable metals, aluminum, plastics, and paper and corrugated cardboard that are processed at its facilities, as well as recyclables purchased from third parties. In addition, the company is involved in commodity brokerage operations. As of January 31, 2020, it owned and/or operated 43 solid waste collection operations, 58 transfer stations, 20 recycling facilities, 8 Subtitle D landfills, 4 landfill gas-to-energy facilities, and 1 landfill permitted to accept construction and demolition materials. The company was founded in 1975 and is headquartered in Rutland, Vermont.", "currency": "EUR", "sector": "Industrials", "industry": "Waste Management", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Rutland"}, "WCN": {"short_name": "Waste Connections, Inc.", "long_name": "Waste Connections, Inc.", "summary": "Waste Connections, Inc. provides waste collection, transfer, disposal, and recycling services in the United States and Canada. The company operates through six segments: Southern, Western, Eastern, Canada, Central, and Exploration and Production (E&P). It offers collection services to residential, commercial, municipal, industrial, and E&P customers; landfill disposal services; and recycling services for various recyclable materials, including compost, cardboard, mixed paper, plastic containers, glass bottles, and ferrous and aluminum metals. The company also owns and operates transfer stations that receive compact and/or load waste to be transported to landfills or treatment facilities through truck, rail, or barge; and intermodal services for the rail haul movement of cargo and solid waste containers in the Pacific Northwest through a network of intermodal facilities. In addition, it provides E&P waste treatment, recovery, and disposal services for waste resulting from oil and natural gas exploration and production activity, such as drilling fluids, drill cuttings, completion fluids, and flowback water; production wastes and produced water during a well's operating life; contaminated soils that require treatment during site reclamation; and substances, which require clean-up after a spill, reserve pit clean-up, or pipeline rupture. Further, the company offers container and chassis sales and leasing services to its customers. As of December 31, 2019, it owned or operated a network of 300 solid waste collection operations; 124 transfer stations; 60 municipal solid waste (MSW) landfills; 12 E&P waste landfills; 14 non-MSW landfills; 66 recycling operations; 4 intermodal operations; 23 E&P liquid waste injection wells; and 19 E&P waste treatment and oil recovery facilities. It also operated an additional 51 transfer stations, 10 MSW landfills, and 2 intermodal operations. Waste Connections, Inc. was founded in 1997 and is based in Vaughan, Canada.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "None"}, "WCN.TO": {"short_name": "WASTE CONNECTIONS INC", "long_name": "Waste Connections, Inc.", "summary": "Waste Connections, Inc. provides waste collection, transfer, disposal, and recycling services in the United States and Canada. The company operates through six segments: Southern, Western, Eastern, Canada, Central, and Exploration and Production (E&P). It offers collection services to residential, commercial, municipal, industrial, and E&P customers; landfill disposal services; and recycling services for various recyclable materials, including compost, cardboard, mixed paper, plastic containers, glass bottles, and ferrous and aluminum metals. The company also owns and operates transfer stations that receive compact and/or load waste to be transported to landfills or treatment facilities through truck, rail, or barge; and intermodal services for the rail haul movement of cargo and solid waste containers in the Pacific Northwest through a network of intermodal facilities. In addition, it provides E&P waste treatment, recovery, and disposal services for waste resulting from oil and natural gas exploration and production activity, such as drilling fluids, drill cuttings, completion fluids, and flowback water; production wastes and produced water during a well's operating life; contaminated soils that require treatment during site reclamation; and substances, which require clean-up after a spill, reserve pit clean-up, or pipeline rupture. Further, the company offers container and chassis sales and leasing services to its customers. As of December 31, 2019, it owned or operated a network of 300 solid waste collection operations; 124 transfer stations; 60 municipal solid waste (MSW) landfills; 12 E&P waste landfills; 14 non-MSW landfills; 66 recycling operations; 4 intermodal operations; 23 E&P liquid waste injection wells; and 19 E&P waste treatment and oil recovery facilities. It also operated an additional 51 transfer stations, 10 MSW landfills, and 2 intermodal operations. Waste Connections, Inc. was founded in 1997 and is based in Vaughan, Canada.", "currency": "CAD", "sector": "Industrials", "industry": "Waste Management", "exchange": "TOR", "market": "ca_market", "country": "United States", "city": "None"}, "WM": {"short_name": "Waste Management, Inc.", "long_name": "Waste Management, Inc.", "summary": "Waste Management, Inc., through its subsidiaries, provides waste management environmental services to residential, commercial, industrial, and municipal customers in North America. It offers collection services, including picking up and transporting waste and recyclable materials from where it was generated to a transfer station, material recovery facility (MRF), or disposal site; and owns, develops, and operates landfill gas-to-energy facilities in the United States, as well as owns and operates transfer stations. As of December 31, 2019, the company owned or operated 244 solid waste landfills; 5 secure hazardous waste landfills; 103 MRFs; and 302 transfer stations. It also provides materials processing and commodities recycling services; recycling brokerage services, such as managing the marketing of recyclable materials for third parties; and other strategic business solutions. In addition, the company offers construction and remediation services; services related with the disposal of fly ash, and residue generated from the combustion of coal and other fuel stocks; in-plant services comprising full-service waste management solutions and consulting services; and specialized disposal services for oil and gas exploration and production operations. Further, it offers fluorescent bulb and universal waste mail-back services through LampTracker program; portable restroom services under the Port-o-Let name; and street and parking lot sweeping services, as well as holds interests in oil and gas producing properties. The company was formerly known as USA Waste Services, Inc. and changed its name to Waste Management, Inc. in 1998. Waste Management, Inc. was incorporated in 1987 and is based in Houston, Texas.", "currency": "USD", "sector": "Industrials", "industry": "Waste Management", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "ZSC.SG": {"short_name": "Sharps Compliance Corp. Registe", "long_name": "Sharps Compliance Corp.", "summary": "Sharps Compliance Corp. provides medical, pharmaceutical, and hazardous waste management services in the United States. It offers Sharps Recovery System for the containment, transportation, treatment, and tracking of medical waste generated outside the hospital and health care facility settings; TakeAway Recovery System to treat used needles, syringes, and other used healthcare products; Route-Based Pickup Service, a medical and hazardous waste pick-up services; and MedSafe, a solution for the safe collection, transportation, and disposal of unwanted and expired ultimate-user medications. The company also provides TakeAway Medication Recovery System that facilitates the proper disposal of unused medications; Black Pail Program for Rx, a solution with minimal segregation for the disposal of various pharmaceuticals; Inhaler Disposal to collect, transport, and destroy used pharmaceutical inhalers; Hazardous Drug Spill Control Kit for the cleanup of chemotherapy and other HD spills; TakeAway Recycle System for the collection and recycling of single-use medical devices from surgical centers and other healthcare facilities; ComplianceTRAC, a Web-based compliance and training program; and Universal Waste Shipback Systems to collect, transport, and recycle light bulbs, batteries, and other mercury containing devices. In addition, it offers other solutions, such as TakeAway Environmental Return System, SharpsTracer, Sharps Secure, Needle Disposal System, Complete Needle Collection and Disposal System, Pitch-It IV Poles, Asset Return System, and Spill Kit Recovery System, as well as Sharps MWMS, a medical waste management system. The company serves customers in home health care, retail clinics and immunizing pharmacies, pharmaceutical manufacturers, professional offices, assisted living and long-term care facilities, and government agencies, as well as distributors. Sharps Compliance Corp. was founded in 1992 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Industrials", "industry": "Waste Management", "exchange": "STU", "market": "dr_market", "country": "United States", "city": "Houston"}}