{
    "0135.HK": {
        "short_name": "KUNLUN ENERGY",
        "long_name": "Kunlun Energy Company Limited",
        "summary": "Kunlun Energy Company Limited, an investment holding company, engages in the exploration, development, production, and sale of crude oil and natural gas. It operates through four segments: Exploration and Production, Natural Gas Sales, Liquefied Natural Gas (LNG) Processing and Terminal, and Natural Gas Pipeline. The company is also involved in the processing, unloading, storing, gasification, and transportation of LNG; transmission of natural gas through pipeline; and wholesale and retail of various natural gas and LPG products. It operates in the People's Republic of China, the Republic of Kazakhstan, the Sultanate of Oman, the Republic of Peru, the Kingdom of Thailand, and the Republic of Azerbaijan. The company was formerly known as CNPC (Hong Kong) Limited and changed its name to Kunlun Energy Company Limited in March 2010. The company is based in Hong Kong, Hong Kong, and is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange. Kunlun Energy Company Limited is a subsidiary of PetroChina Hong Kong Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "0206.HK": {
        "short_name": "CMIC OCEAN",
        "long_name": "CMIC Ocean En-Tech Holding Co., Ltd.",
        "summary": "CMIC Ocean En-Tech Holding Co., Ltd., an investment holding company, engages in the design, manufacture, installation, and commissioning of capital equipment and packages on land and offshore rigs worldwide. The company operates through three segments: Capital Equipment and Packages, Oilfield Expendables and Supplies, and Engineering Services. It provides integrated financing and asset solutions; and specific equipment products, which include cranes, machine rack pipes, jacking systems, power control and transmission systems, tension adjustment and compensation devices and systems, etc. The company also offers rigs maintenance, repair, and operation products and services comprising oilfield expendables, accessories and parts manufacturing, and sale and repair services; and provides engineering services. In addition, it offers rig turnkey solutions; trades in rig equipment and oilfield expendables; and designs and manufactures mechanical handling equipment. The company was formerly known as TSC Group Holdings Limited and changed its name to CMIC Ocean En-Tech Holding Co., Ltd. in February 2019. CMIC Ocean En-Tech Holding Co., Ltd. was founded in 1995 and is headquartered in Hung Hom, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Hung Hom"
    },
    "0342.HK": {
        "short_name": "NEWOCEAN ENERGY",
        "long_name": "NewOcean Energy Holdings Limited",
        "summary": "NewOcean Energy Holdings Limited, an investment holding company, distributes and sells liquefied petroleum gas (LPG) and natural gas, and oil/chemical products in the People's Republic of China. The company sells LPG to industrial customers, auto-gas operators, wholesalers, bottled LPG end-users, auto-gas end-users, etc. It also trades in electronic products, such as integrated circuits and mobile phones. Further, it is involved in the property investment and development activities. The company is headquartered in Wanchai, Hong Kong. NewOcean Energy Holdings Limited is a subsidiary of Uniocean Investments Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0346.HK": {
        "short_name": "YANCHANG PETRO",
        "long_name": "Yanchang Petroleum International Limited",
        "summary": "Yanchang Petroleum International Limited, an investment holding company, engages in the supply and procurement operation of oil related products in the People's Republic of China. The company operates through Exploration, Exploitation and Operation Business; and Supply and Procurement Business segments. It engages in the wholesale, retail, storage, and transportation of refined oil. The company also acquires, explores for, exploits, develops, and produces crude oil and natural gas; and provides oil related services. It owns interests in oilfield blocks located in Saskatchewan and Alberta, Canada; and two onshore exploration blocks in the Republic of Madagascar, including Madagascar Exploration Block 3113 and Madagascar Exploration Block 2104. The company was formerly known as Sino Union Energy Investment Group Limited and changed its name to Yanchang Petroleum International Limited in May 2012. The company was incorporated in 2001 and is headquartered in Causeway Bay, Hong Kong. Yanchang Petroleum International Limited is a subsidiary of Yanchang Petroleum Group (Hong Kong) Co., Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "0567.HK": {
        "short_name": "DAISHOMICROLINE",
        "long_name": "Daisho Microline Holdings Limited",
        "summary": "Daisho Microline Holdings Limited, an investment holding company, manufactures and trades in printed circuit boards. The company is also involved in the trading of petroleum and energy products, and related business; and vessel chartering and property holding activities. It has operations in the People's Republic of China, Hong Kong, Singapore, North America, Japan, Europe, and internationally. The company is headquartered in Chai Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Chai Wan"
    },
    "0578.HK": {
        "short_name": "ROSAN RES",
        "long_name": "Rosan Resources Holdings Limited",
        "summary": "Rosan Resources Holdings Limited, together with its subsidiaries, produces and sells coal and building materials, and trades in purchased coal in the People's Republic of China. The company operates through Coal Business and Building Materials Business segment. It also provides management services; and engages in project investment, asset management, and investment consultation activities, as well as produces and leases aluminum boundary wall moulds. The company is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0704.HK": {
        "short_name": "HUSCOKE HLDGS",
        "long_name": "Huscoke Holdings Limited",
        "summary": "Huscoke Holdings Limited, an investment holding company, produces and trades in coke in the People's Republic of China. The company operates through three segments: Coke Trading, Coal-Related Ancillary, and Coke Production. The Coke Trading segment purchases and sells coal and coke. The Coal-Related Ancillary segment is involved in the washing of raw coal into refined coal for sale and processing, as well as sale of electricity and heat, which are generated as the by-products during the washing of raw coal. The Coke Production segment processes refined coal into coke for sale, as well as sells coke by-products. Huscoke Resources Holdings Limited also holds assets. The company was formerly known as Huscoke Resources Holdings Limited and changed its name to Huscoke Holdings Limited in December 2018. The company is based in Admiralty, Hong Kong. Huscoke Holdings Limited is a subsidiary of Shun Wang Investments Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Admiralty"
    },
    "0852.HK": {
        "short_name": "STRONG PETRO",
        "long_name": "Strong Petrochemical Holdings Limited",
        "summary": "Strong Petrochemical Holdings Limited, an investment holding company, engages in trading crude oil, iron ore, petroleum, petrochemical, and coal products. The company is also involved in the provision of storage services for petroleum products and petrochemicals. It offers its products in the People's Republic of China, France, Japan, and Vietnam. The company was founded in 1999 and is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Admiralty"
    },
    "0866.HK": {
        "short_name": "CHINA QINFA",
        "long_name": "China Qinfa Group Limited",
        "summary": "China Qinfa Group Limited, an investment holding company, engages in the mining, purchase and sale, filtering, storage, blending, shipping, and transportation of coal in the People's Republic of China. The company operates through Coal Business and Shipping Transportation segments. As of December 31, 2019, the company owned and operated five coal mines. It is also involved in goods transportation and logistics, and charter hire activities. The company was founded in 1996 and is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0883.HK": {
        "short_name": "CNOOC",
        "long_name": "CNOOC Limited",
        "summary": "CNOOC Limited, an investment holding company, explores for, develops, produces, and sells crude oil and natural gas in offshore China, Canada, the United States, the United Kingdom, Nigeria, Argentina, Indonesia, Uganda, Iraq, Brazil, Guyana, Russia, Australia, and internationally. The company operates through three segments: E&P, Trading Business, and Corporate. It produces offshore crude oil and natural gas primarily in Bohai, the Western South China Sea, the Eastern South China Sea, and the East China Sea in offshore China. The company also holds interests in various oil and gas assets in Asia, Africa, North America, South America, Oceania, and Europe. As of December 31, 2019, it had net proved reserves of approximately 5.18 billion barrels of oil equivalent. In addition, the company is involved in the issuance of bonds; sale and marketing of petroleum and natural gas; and surface exploration and sale of coalbed methane. The company was incorporated in 1999 and is based in Central, Hong Kong. CNOOC Limited is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "1101.HK": {
        "short_name": "HUARONG ENERGY",
        "long_name": "China Huarong Energy Company Limited",
        "summary": "China Huarong Energy Company Limited, an investment holding company, engages in the energy exploration and production businesses. The company explores for, produces, and sells crude oil. The company operates five oilfields in the Fergana Valley of the Republic of Kyrgyzstan; and sells petroleum products. It is also involved in commodity trading business. The company was formerly known as China Rongsheng Heavy Industries Group Holdings Limited and changed its name to China Huarong Energy Company Limited in April 2015. China Huarong Energy Company Limited was incorporated in 2010 and is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "1142.HK": {
        "short_name": "SIBERIAN MINING",
        "long_name": "Siberian Mining Group Company Limited",
        "summary": "Siberian Mining Group Company Limited, an investment holding company, trades in gasoline in the Republic of Korea. It operates through Mining; and Mineral Resources, Commodities and Other Trading segments. The company is also involved in the trading of commodities and mineral resources. In addition, it holds coal mining and exploration rights in Russia. The company was incorporated in 2002 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "16Q.F": {
        "short_name": "CHINA QINFA GROUP  HD-,10",
        "long_name": "China Qinfa Group Limited",
        "summary": "China Qinfa Group Limited, an investment holding company, engages in the mining, purchase and sale, filtering, storage, blending, shipping, and transportation of coal in the People's Republic of China. The company operates through Coal Business and Shipping Transportation segments. As of December 31, 2019, the company owned and operated five coal mines. It is also involved in goods transportation and logistics, and charter hire activities. The company was founded in 1996 and is based in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "1738.HK": {
        "short_name": "FS ANTHRACITE",
        "long_name": "Feishang Anthracite Resources Limited",
        "summary": "Feishang Anthracite Resources Limited, an investment holding company, produces anthracite coal in the People's Republic of China. It primarily engages in the acquisition, construction, and development of anthracite coal mines; and extraction, sale, and trade of anthracite coal. The company's mining assets consist of seven underground anthracite coal mines in Guizhou province. It is also involved in the coal washing activities. The company was formerly known as Wealthy Year Limited. The company was founded in 2010 and is based in Sheung Wan, Hong Kong. Feishang Anthracite Resources Limited is a subsidiary of Feishang Group Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Sheung Wan"
    },
    "8011.HK": {
        "short_name": "POLYARD PETRO",
        "long_name": "Polyard Petroleum International Group Limited",
        "summary": "Polyard Petroleum International Group Limited, an investment holding company, engages in the exploration, exploitation, and development of oil and natural gas in the Philippines. The company holds interests in the Central Luzon gas project that covers approximately 6,840 square kilometers located in Central Luzon; and the South Cebu oil and gas project covering an area of 1,970 square kilometers located in Cebu Island. It also provides technical services; and consultancy services for oil and gas exploration and development, as well as trades in minerals, energy, and petroleum-related products. The company was formerly known as Kanstar Environmental Paper Products Holdings Limited and changed its name to Polyard Petroleum International Group Limited in November 2007. Polyard Petroleum International Group Limited is based in Wan Chai, Hong Kong. Polyard Petroleum International Group Limited is a subsidiary of Silver Star Enterprises Holdings Inc.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "BRZV": {
        "short_name": "BREEZER VENTURES INC",
        "long_name": "Fitvia Corp.",
        "summary": "Fitvia Corp. engages in the writing of patents. The company is also involved in writing business plans for small, medium, and large companies. It also provides valuation services that figure out dead net costs on food products. The company was formerly known as Breezer Ventures Inc. and changed its name to Fitvia Corp. in February 2016. Fitvia Corp. was founded in 2005 and is based in Yau Tong, Hong Kong.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Yau Tong"
    },
    "CEO": {
        "short_name": "CNOOC Limited",
        "long_name": "CNOOC Limited",
        "summary": "CNOOC Limited, an investment holding company, explores for, develops, produces, and sells crude oil and natural gas in offshore China, Canada, the United States, the United Kingdom, Nigeria, Argentina, Indonesia, Uganda, Iraq, Brazil, Guyana, Russia, Australia, and internationally. The company operates through three segments: E&P, Trading Business, and Corporate. It produces offshore crude oil and natural gas primarily in Bohai, the Western South China Sea, the Eastern South China Sea, and the East China Sea in offshore China. The company also holds interests in various oil and gas assets in Asia, Africa, North America, South America, Oceania, and Europe. As of December 31, 2019, it had net proved reserves of approximately 5.18 billion barrels of oil equivalent. In addition, the company is involved in the issuance of bonds; sale and marketing of petroleum and natural gas; and surface exploration and sale of coalbed methane. The company was incorporated in 1999 and is based in Central, Hong Kong. CNOOC Limited is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "CEOHF": {
        "short_name": "CNOOC LIMITED",
        "long_name": "CNOOC Limited",
        "summary": "CNOOC Limited, an investment holding company, explores for, develops, produces, and sells crude oil and natural gas in offshore China, Canada, the United States, the United Kingdom, Nigeria, Argentina, Indonesia, Uganda, Iraq, Brazil, Guyana, Russia, Australia, and internationally. The company operates through three segments: E&P, Trading Business, and Corporate. It produces offshore crude oil and natural gas primarily in Bohai, the Western South China Sea, the Eastern South China Sea, and the East China Sea in offshore China. The company also holds interests in various oil and gas assets in Asia, Africa, North America, South America, Oceania, and Europe. As of December 31, 2019, it had net proved reserves of approximately 5.18 billion barrels of oil equivalent. In addition, the company is involved in the issuance of bonds; sale and marketing of petroleum and natural gas; and surface exploration and sale of coalbed methane. The company was incorporated in 1999 and is based in Central, Hong Kong. CNOOC Limited is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "CEON.MX": {
        "short_name": "CNOOC LIMITED",
        "long_name": "CNOOC Limited",
        "summary": "CNOOC Limited, an investment holding company, explores for, develops, produces, and sells crude oil and natural gas in offshore China, Canada, the United States, the United Kingdom, Nigeria, Argentina, Indonesia, Uganda, Iraq, Brazil, Guyana, Russia, Australia, and internationally. The company operates through three segments: E&P, Trading Business, and Corporate. It produces offshore crude oil and natural gas primarily in Bohai, the Western South China Sea, the Eastern South China Sea, and the East China Sea in offshore China. The company also holds interests in various oil and gas assets in Asia, Africa, North America, South America, Oceania, and Europe. As of December 31, 2019, it had net proved reserves of approximately 5.18 billion barrels of oil equivalent. In addition, the company is involved in the issuance of bonds; sale and marketing of petroleum and natural gas; and surface exploration and sale of coalbed methane. The company was incorporated in 1999 and is based in Central, Hong Kong. CNOOC Limited is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "MXN",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "CNU.TO": {
        "short_name": "CNOOC LIMITED",
        "long_name": "CNOOC Limited",
        "summary": "CNOOC Limited, an investment holding company, explores for, develops, produces, and sells crude oil and natural gas in offshore China, Canada, the United States, the United Kingdom, Nigeria, Argentina, Indonesia, Uganda, Iraq, Brazil, Guyana, Russia, Australia, and internationally. The company operates through three segments: E&P, Trading Business, and Corporate. It produces offshore crude oil and natural gas primarily in Bohai, the Western South China Sea, the Eastern South China Sea, and the East China Sea in offshore China. The company also holds interests in various oil and gas assets in Asia, Africa, North America, South America, Oceania, and Europe. As of December 31, 2019, it had net proved reserves of approximately 5.18 billion barrels of oil equivalent. In addition, the company is involved in the issuance of bonds; sale and marketing of petroleum and natural gas; and surface exploration and sale of coalbed methane. The company was incorporated in 1999 and is based in Central, Hong Kong. CNOOC Limited is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "CTJ1.F": {
        "short_name": "KUNLUN ENERGY CO.  HD-,01",
        "long_name": "Kunlun Energy Company Limited",
        "summary": "Kunlun Energy Company Limited, an investment holding company, engages in the exploration, development, production, and sale of crude oil and natural gas. It operates through four segments: Exploration and Production, Natural Gas Sales, Liquefied Natural Gas (LNG) Processing and Terminal, and Natural Gas Pipeline. The company is also involved in the processing, unloading, storing, gasification, and transportation of LNG; transmission of natural gas through pipeline; and wholesale and retail of various natural gas and LPG products. It operates in the People's Republic of China, the Republic of Kazakhstan, the Sultanate of Oman, the Republic of Peru, the Kingdom of Thailand, and the Republic of Azerbaijan. The company was formerly known as CNPC (Hong Kong) Limited and changed its name to Kunlun Energy Company Limited in March 2010. The company is based in Hong Kong, Hong Kong, and is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange. Kunlun Energy Company Limited is a subsidiary of PetroChina Hong Kong Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "EGYF": {
        "short_name": "ENERGY FINDERS INC",
        "long_name": "Energy Finders, Inc.",
        "summary": "Energy Finders, Inc. does not have significant operations. The company intends to consummate a merger or acquisition with a partner that may involve a change in the company's business. Previously, it was engaged in the oil and gas exploration activities. The company was incorporated in 2006 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "GWCC.F": {
        "short_name": "EPI HOLDINGS LTD  HD -,01",
        "long_name": "EPI (Holdings) Limited",
        "summary": "EPI (Holdings) Limited, an investment holding company, engages in the exploration and production of petroleum in Argentina, Hong Kong, and the People's Republic of China. The company primarily holds an interest in the ChaÃ±ares Herrados concession located in the Cuyana Basin, Mendoza Province of Argentina. It also engages in money lending, and securities investment and management activities. The company is based in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "HPG1.F": {
        "short_name": "CHINA ENERGY DEV.H.HD-,05",
        "long_name": "China Energy Development Holdings Limited",
        "summary": "China Energy Development Holdings Limited, an investment holding company, engages in the exploration, development, production, and distribution of natural gas. It operates through three segments: Exploration, Production, and Distribution of Natural Gas; Sales of Food and Beverages Business; and Money Lending Business. The company drills, explores for, develops, exploits, and produces oil and/or natural gas from site located in North Kashi Block, Tarim Basin, Xinjiang; and distributes natural gas through pipelines in the People's Republic of China. It is also involved in the sale of food and beverages; provision of loans to third parties; and operation of a chain of Chinese restaurants in Hong Kong. The company was incorporated in 2001 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "KLYCY": {
        "short_name": "KUNLUN ENERGY COMPANY LIMITED",
        "long_name": "Kunlun Energy Company Limited",
        "summary": "Kunlun Energy Company Limited, an investment holding company, engages in the exploration, development, production, and sale of crude oil and natural gas. It operates through four segments: Exploration and Production, Natural Gas Sales, Liquefied Natural Gas (LNG) Processing and Terminal, and Natural Gas Pipeline. The company is also involved in the processing, unloading, storing, gasification, and transportation of LNG; transmission of natural gas through pipeline; and wholesale and retail of various natural gas and LPG products. It operates in the People's Republic of China, the Republic of Kazakhstan, the Sultanate of Oman, the Republic of Peru, the Kingdom of Thailand, and the Republic of Azerbaijan. The company was formerly known as CNPC (Hong Kong) Limited and changed its name to Kunlun Energy Company Limited in March 2010. The company is based in Hong Kong, Hong Kong, and is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange. Kunlun Energy Company Limited is a subsidiary of PetroChina Hong Kong Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "KUNUF": {
        "short_name": "KUNLUN ENERGY COMPANY LIMITED",
        "long_name": "Kunlun Energy Company Limited",
        "summary": "Kunlun Energy Company Limited, an investment holding company, engages in the exploration, development, production, and sale of crude oil and natural gas. It operates through four segments: Exploration and Production, Natural Gas Sales, Liquefied Natural Gas (LNG) Processing and Terminal, and Natural Gas Pipeline. The company is also involved in the processing, unloading, storing, gasification, and transportation of LNG; transmission of natural gas through pipeline; and wholesale and retail of various natural gas and LPG products. It operates in the People's Republic of China, the Republic of Kazakhstan, the Sultanate of Oman, the Republic of Peru, the Kingdom of Thailand, and the Republic of Azerbaijan. The company was formerly known as CNPC (Hong Kong) Limited and changed its name to Kunlun Energy Company Limited in March 2010. The company is based in Hong Kong, Hong Kong, and is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange. Kunlun Energy Company Limited is a subsidiary of PetroChina Hong Kong Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "NE6.F": {
        "short_name": "NEWOCEAN ENERGY HLD.HD-10",
        "long_name": "NewOcean Energy Holdings Limited",
        "summary": "NewOcean Energy Holdings Limited, an investment holding company, distributes and sells liquefied petroleum gas (LPG) and natural gas, and oil/chemical products in the People's Republic of China. The company sells LPG to industrial customers, auto-gas operators, wholesalers, bottled LPG end-users, auto-gas end-users, etc. It also trades in electronic products, such as integrated circuits and mobile phones. Further, it is involved in the property investment and development activities. The company is headquartered in Wanchai, Hong Kong. NewOcean Energy Holdings Limited is a subsidiary of Uniocean Investments Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "RYZR.F": {
        "short_name": "CHINA LNG GROUP  HD-,02",
        "long_name": "China LNG Group Limited",
        "summary": "China LNG Group Limited, an investment holding company, sells and distributes liquefied natural gas (LNG) in the People's Republic of China. The company engages in the wholesale and point-to-point supply of LNG; and provision of LNG in the midstream and downstream market through fueling/refueling of LNG in road refueling stations for commercial vehicles, as well as water refueling stations for vessels and specific designed refueling facilities for equipment. It also provides LNG logistic services; finance leasing services for LNG vehicles and equipment; and securities brokerage, margin financing, and securities investments and financial services, as well as sells LNG vehicles. In addition, the company develops and operates oil-to-gas conversion and LNG refueling facilities on floating barges; develops LNG related technologies; operates LNG refueling stations; trades in gas ignition equipment; utilizes new energy sources and new energy related businesses; and supplies and manages LNG. Further, it is involved in the construction and operation of natural gas filling stations; wholesale of ethanol and liquefied petroleum gas; and trading of natural gas and transportation. Additionally, the company offers commercial vehicle user's long distance IT control, insurance handling, and new/used LNG/diesel vehicles purchase/sale services; and LNG consultancy services. The company was formerly known as Artel Solutions Group Holdings Limited and changed its name to China LNG Group Limited in June 2014. China LNG Group Limited was founded in 1995 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "SAN.AX": {
        "short_name": "SAGALIO EN FPO",
        "long_name": "Sagalio Energy Limited",
        "summary": "Sagalio Energy Limited, together with its subsidiaries, engages in the exploration, evaluation, and development of petroleum resources in the central Asia region. It holds interest in three oil projects located in the Kyrgyz Republic. The company was formerly known as FeOre Limited and changed its name to Sagalio Energy Limited in May 2015. Sagalio Energy Limited was incorporated in 2011 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "SCNG": {
        "short_name": "SC HLDGS CORP",
        "long_name": "Strattner Financial Group Corp.",
        "summary": "Strattner Financial Group Corp., an investment management company, manages multiple alternative asset classes, including private equity, convertibles, credit, and hedge funds. It also focuses on selling satellite based communications devices. The company was formerly known as SC Holdings Corp. and changed its name to Strattner Financial Group Corp. in March 2020. The company was founded in 2012 and is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "UNEGF": {
        "short_name": "UNITED ENERGY GROUP LTD.",
        "long_name": "United Energy Group Limited",
        "summary": "United Energy Group Limited, an investment holding company, engages in the investment and operation of upstream oil, natural gas, and other energy related businesses in Hong Kong, South Asia, Pakistan, the Middle East, and North Africa. The company explores for and produces crude oil and natural gas. Its proved and probable reserves consist of 931.3 million barrels of oil equivalent. United Energy Group Limited is headquartered in Admiralty, Hong Kong.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Admiralty"
    },
    "VBO.F": {
        "short_name": "CGN MINING CO.LTD  HD-,01",
        "long_name": "CGN Mining Company Limited",
        "summary": "CGN Mining Company Limited engages in the investment and trading of natural uranium resources. The company is also involved in the property investment activities. It has operations in Hong Kong, the People's Republic of China, Kazakhstan, Canada, and the United Kingdom, rest of Europe. The company was incorporated in 2001 and is headquartered in Wanchai, Hong Kong. CGN Mining Company Limited is a subsidiary of China Uranium Development Company Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Uranium",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "XYTA.F": {
        "short_name": "CHINA HUARONG ENER.HD-,50",
        "long_name": "China Huarong Energy Company Limited",
        "summary": "China Huarong Energy Company Limited, an investment holding company, engages in the energy exploration and production businesses. The company explores for, produces, and sells crude oil. The company operates five oilfields in the Fergana Valley of the Republic of Kyrgyzstan; and sells petroleum products. It is also involved in commodity trading business. The company was formerly known as China Rongsheng Heavy Industries Group Holdings Limited and changed its name to China Huarong Energy Company Limited in April 2015. China Huarong Energy Company Limited was incorporated in 2010 and is based in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    }
}