{
    "0135.HK": {
        "short_name": "KUNLUN ENERGY",
        "long_name": "Kunlun Energy Company Limited",
        "summary": "Kunlun Energy Company Limited, an investment holding company, engages in the exploration, development, production, and sale of crude oil and natural gas. It operates through four segments: Natural Gas Sales; Sales of Liquefied Petroleum Gas (LPG); Liquefied Natural Gas (LNG) Processing and Terminal; and Exploration and Production. The company is also involved in the processing, unloading, storing, gasification, and entrucking of LNG; trading, distribution, and retail sale of various natural gas products; and wholesale and retail of various LPG products. It operates in the People's Republic of China, the Republic of Kazakhstan, the Sultanate of Oman, the Republic of Peru, the Kingdom of Thailand, and the Republic of Azerbaijan. The company was formerly known as CNPC (Hong Kong) Limited and changed its name to Kunlun Energy Company Limited in March 2010. The company is based in Hong Kong, Hong Kong. Kunlun Energy Company Limited is a subsidiary of PetroChina Hong Kong Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.kunlun.com.hk",
        "market_cap": 60266643456
    },
    "0206.HK": {
        "short_name": "CMIC OCEAN",
        "long_name": "CMIC Ocean En-Tech Holding Co., Ltd.",
        "summary": "CMIC Ocean En-Tech Holding Co., Ltd., an investment holding company, engages in the design, manufacture, installation, and commissioning of capital equipment and packages on land and offshore rigs worldwide. The company operates through three segments: Capital Equipment and Packages, Oilfield Expendables and Supplies, and Management and Engineering Services. It provides asset investment and operation management of offshore engineering platforms; and specific equipment products, which include cranes, machine rack pipes, jacking systems, power control and transmission systems, tension adjustment and compensation devices and systems, etc. The company also offers drilling rigs maintenance, repair, and operation products and services comprising oilfield expendables, accessories and parts manufacturing, and sale and repair services; and provides management and engineering services, as well as professional technical services. In addition, it offers rig turnkey solutions; trades in rig equipment, oilfield expendables, and rig electrical control systems; manufactures and trades in machinery parts; designs and manufactures mechanical handling equipment; and sub-leases drilling rigs. The company was formerly known as TSC Group Holdings Limited and changed its name to CMIC Ocean En-Tech Holding Co., Ltd. in February 2019. CMIC Ocean En-Tech Holding Co., Ltd. was founded in 1995 and is headquartered in Hung Hom, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hung Hom",
        "zipcode": null,
        "website": "http://www.cmicholding.com",
        "market_cap": 745988864
    },
    "0260.HK": {
        "short_name": "AVIC JOY HLDG",
        "long_name": "AVIC Joy Holdings (HK) Limited",
        "summary": "AVIC Joy Holdings (HK) Limited, an investment holding company, provides finance lease and loan services in the People's Republic of China. It also provides property investment and land development services; sells construction materials; and manages and operates light-emitting diode energy management contracts. The company was formerly known as China Environmental Investment Holdings Limited and changed its name to AVIC Joy Holdings (HK) Limited in November 2014. AVIC Joy Holdings (HK) Limited is based in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.avicjoyhk.com",
        "market_cap": 190200016
    },
    "0342.HK": {
        "short_name": "NEWOCEAN ENERGY",
        "long_name": "NewOcean Energy Holdings Limited",
        "summary": "NewOcean Energy Holdings Limited, an investment holding company, distributes and sells liquefied petroleum gas (LPG) and natural gas, and oil/chemical products in the People's Republic of China. The company sells LPG to industrial customers, auto-gas operators, wholesalers, bottled LPG end-users, auto-gas end-users, etc. It also trades in electronic products, such as integrated circuits and mobile phones. Further, it is involved in the property investment and development activities. The company is headquartered in Wanchai, Hong Kong. NewOcean Energy Holdings Limited is a subsidiary of Uniocean Investments Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.newoceanhk.com",
        "market_cap": 653313408
    },
    "0346.HK": {
        "short_name": "YANCHANG PETRO",
        "long_name": "Yanchang Petroleum International Limited",
        "summary": "Yanchang Petroleum International Limited, an investment holding company, engages in the supply and procurement operation of oil related products in the People's Republic of China. The company operates through Exploration, Exploitation and Operation Business; and Supply and Procurement Business segments. It engages in the wholesale, retail, storage, and transportation of refined oil. The company also acquires, explores for, exploits, develops, and produces crude oil and natural gas; and provides oil related services. It owns interests in oilfield blocks located in Saskatchewan and Alberta, Canada; and two onshore exploration blocks in the Republic of Madagascar, including Madagascar Exploration Block 3113 and Madagascar Exploration Block 2104. The company was formerly known as Sino Union Energy Investment Group Limited and changed its name to Yanchang Petroleum International Limited in May 2012. The company was incorporated in 2001 and is headquartered in Causeway Bay, Hong Kong. Yanchang Petroleum International Limited is a subsidiary of Yanchang Petroleum Group (Hong Kong) Co., Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.yanchanginternational.com",
        "market_cap": 1448465152
    },
    "0567.HK": {
        "short_name": "DAISHOMICROLINE",
        "long_name": "Daisho Microline Holdings Limited",
        "summary": "Daisho Microline Holdings Limited, an investment holding company, manufactures and trades in printed circuit boards. The company is also involved in the trading of petroleum and energy products, and related business; and vessel chartering and property holding activities. It has operations in the People's Republic of China, Hong Kong, Singapore, North America, Japan, Europe, and internationally. The company is headquartered in Chai Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Chai Wan",
        "zipcode": null,
        "website": "http://www.daisho-microline.com",
        "market_cap": 137936128
    },
    "0578.HK": {
        "short_name": "ROSAN RES",
        "long_name": "Rosan Resources Holdings Limited",
        "summary": "Rosan Resources Holdings Limited, together with its subsidiaries, produces and sells coal and building materials, and trades in purchased coal in the People's Republic of China. The company operates through Coal Business and Building Materials Business segment. It also provides management services; and engages in project investment, asset management, and investment consultation activities, as well as produces and leases aluminum boundary wall moulds. The company is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://rosanresources.com",
        "market_cap": 49928160
    },
    "0852.HK": {
        "short_name": "STRONG PETRO",
        "long_name": "Strong Petrochemical Holdings Limited",
        "summary": "Strong Petrochemical Holdings Limited, an investment holding company, engages in trading crude oil, iron ore, petroleum, petrochemical, and coal products. The company is also involved in the provision of storage and other ancillary services for petroleum products and petrochemicals; and property investment activities. It offers its products in the People's Republic of China, Hong Kong, Macao, Singapore, Korea, France, Japan, Vietnam, and the United Kingdom. The company was incorporated in 1999 and is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.strongpetrochem.com",
        "market_cap": 700708800
    },
    "0866.HK": {
        "short_name": "CHINA QINFA",
        "long_name": "China Qinfa Group Limited",
        "summary": "China Qinfa Group Limited, an investment holding company, engages in the mining, purchase and sale, filtering, storage, blending, shipping, and transportation of coal in the People's Republic of China. The company operates through Coal Business and Shipping Transportation segments. As of December 31, 2019, the company owned and operated five coal mines. It is also involved in goods transportation and logistics, and charter hire activities. The company was founded in 1996 and is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.qinfagroup.com",
        "market_cap": 354064224
    },
    "0883.HK": {
        "short_name": "CNOOC",
        "long_name": "CNOOC Limited",
        "summary": "CNOOC Limited, an investment holding company, explores for, develops, produces, and sells crude oil and natural gas in offshore China, Canada, the United States, the United Kingdom, Nigeria, Argentina, Indonesia, Uganda, Iraq, Brazil, Guyana, Russia, Australia, and internationally. The company operates through three segments: E&P, Trading Business, and Corporate. It produces offshore crude oil and natural gas primarily in Bohai, the Western South China Sea, the Eastern South China Sea, and the East China Sea in offshore China. The company also holds interests in various oil and gas assets in Asia, Africa, North America, South America, Oceania, and Europe. As of December 31, 2019, it had net proved reserves of approximately 5.18 billion barrels of oil equivalent. In addition, the company is involved in the issuance of bonds; sale and marketing of petroleum and natural gas; and surface exploration and sale of coalbed methane. The company was incorporated in 1999 and is based in Central, Hong Kong. CNOOC Limited is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.cnoocltd.com",
        "market_cap": 349143465984
    },
    "0934.HK": {
        "short_name": "SINOPEC KANTONS",
        "long_name": "Sinopec Kantons Holdings Limited",
        "summary": "Sinopec Kantons Holdings Limited, an investment holding company, provides crude oil jetty services. It operates through, Crude Oil Jetty and Storage Services; and Vessel Chartering and Logistics Services segments. The company offers crude oil transportation, unloading, storage, and other jetty services for oil tankers in the People's Republic of China (PRC), Europe, and the Middle East; and vessel chartering services for liquefied natural gas transportation in the PRC, Australia, and the Papua New Guinea. It also engages in the trading of crude oil; and provision of oil supporting and ancillary services. The company was founded in 1998 and is headquartered in Causeway Bay, Hong Kong. Sinopec Kantons Holdings Limited is a subsidiary of Sinopec Kantons International Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.sinopec.com.hk",
        "market_cap": 8055157760
    },
    "1101.HK": {
        "short_name": "HUARONG ENERGY",
        "long_name": "China Huarong Energy Company Limited",
        "summary": "China Huarong Energy Company Limited, an investment holding company, engages in the energy exploration and production businesses. The company explores for, produces, and sells crude oil. The company operates five oilfields in the Fergana Valley of the Republic of Kyrgyzstan; and sells petroleum products. It is also involved in commodity trading business. The company was formerly known as China Rongsheng Heavy Industries Group Holdings Limited and changed its name to China Huarong Energy Company Limited in April 2015. China Huarong Energy Company Limited was incorporated in 2010 and is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.huarongenergy.com.hk",
        "market_cap": 505671904
    },
    "1142.HK": {
        "short_name": "SIBERIAN MINING",
        "long_name": "Siberian Mining Group Company Limited",
        "summary": "Siberian Mining Group Company Limited, an investment holding company, trades in gasoline in the Republic of Korea. It operates through Mining; and Mineral Resources, Commodities and Other Trading segments. The company is also involved in the trading of commodities and mineral resources. In addition, it holds coal mining and exploration rights in Russia. The company was incorporated in 2002 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://siberian.todayir.com",
        "market_cap": 221876000
    },
    "1621.HK": {
        "short_name": "VICO INTL HLDGS",
        "long_name": "Vico International Holdings Limited",
        "summary": "Vico International Holdings Limited, an investment holding company, distributes third-party branded petrochemicals in Hong Kong, Macau, Vietnam, Dubai, Malaysia, and Singapore. It offers diesel; lubricant oils, including self-branded lubricant and third-party branded lubricant oils; and other petrochemicals, such as bitumen, as well as kerosene. The company also provides fleet card and transportation services. As of March 31, 2020, it operated a total number of 38,380 fleet card accounts. The company was formerly known as Rico International Holdings Limited and changed its name to Vico International Holdings Limited in May 2017. The company was founded in 1977 and is headquartered in Cheung Sha Wan, Hong Kong. Vico International Holdings Limited is a subsidiary of Max Fortune Holdings Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Cheung Sha Wan",
        "zipcode": null,
        "website": "http://www.vicointernational.hk",
        "market_cap": 147000000
    },
    "16Q.F": {
        "short_name": "CHINA QINFA GROUP  HD-,10",
        "long_name": "China Qinfa Group Limited",
        "summary": "China Qinfa Group Limited, an investment holding company, engages in the mining, purchase and sale, filtering, storage, blending, shipping, and transportation of coal in the People's Republic of China. The company operates through Coal Business and Shipping Transportation segments. As of December 31, 2019, the company owned and operated five coal mines. It is also involved in goods transportation and logistics, and charter hire activities. The company was founded in 1996 and is based in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.qinfagroup.com",
        "market_cap": 9468199
    },
    "1738.HK": {
        "short_name": "FS ANTHRACITE",
        "long_name": "Feishang Anthracite Resources Limited",
        "summary": "Feishang Anthracite Resources Limited, an investment holding company, produces anthracite coal in the People's Republic of China. It primarily engages in the acquisition, construction, and development of anthracite coal mines; and extraction, sale, and trade of anthracite coal. The company's mining assets consist of four underground anthracite coal mines in Guizhou province. It is also involved in the coal washing activities. The company was formerly known as Wealthy Year Limited. Feishang Anthracite Resources Limited was incorporated in 2010 and is based in Sheung Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": null,
        "website": "http://www.fsanthracite.com",
        "market_cap": 1504799616
    },
    "1878.HK": {
        "short_name": "SOUTHGOBI-S",
        "long_name": "SouthGobi Resources Ltd.",
        "summary": "SouthGobi Resources Ltd., together with its subsidiaries, operates as an integrated coal mining, development, and exploration company in Mongolia, Hong Kong, and China. It primarily explores for coking and thermal coal. The company's flagship project is the Ovoot Tolgoi open pit coal mine located in the Umnugobi Aimag of Mongolia. It also engages in the logistics and trading of coal in Mongolia and China. The company was formerly known as SouthGobi Energy Resources Ltd. and changed its name to SouthGobi Resources Ltd. in May 2010. SouthGobi Resources Ltd. was incorporated in 2002 and is based in Mong kok, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Mong Kok",
        "zipcode": null,
        "website": "http://www.southgobi.com",
        "market_cap": 1311218048
    },
    "8011.HK": {
        "short_name": "POLYARD PETRO",
        "long_name": "Polyard Petroleum International Group Limited",
        "summary": "Polyard Petroleum International Group Limited, an investment holding company, engages in the exploration, exploitation, and development of oil and natural gas in the Philippines. The company holds interests in the South Cebu oil and gas project. It also provides technical services; offers consultancy services for oil and gas exploration and development; engages in mineral and energy related business; and operates a power plant. The company was formerly known as Kanstar Environmental Paper Products Holdings Limited and changed its name to Polyard Petroleum International Group Limited in November 2007. Polyard Petroleum International Group Limited is based in Wan Chai, Hong Kong. Polyard Petroleum International Group Limited is a subsidiary of Silver Star Enterprises Holdings Inc.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.ppig.com.hk",
        "market_cap": 345328224
    },
    "8117.HK": {
        "short_name": "CHI P ENERGY",
        "long_name": "China Primary Energy Holdings Limited",
        "summary": "China Primary Energy Holdings Limited, an investment holding company, primarily engages in the transmission and distribution of natural gas in the People's Republic of China and Hong Kong. The company operates through three segments: Transmission and Distribution of Natural Gas; Trading of Electronic Components; and Property Investment. It also engages in the development and use of energy technology; operation of heat and power cogeneration plant; and heat generation activities. The company was formerly known as China Primary Resources Holdings Limited. China Primary Energy Holdings Limited was incorporated in 2001 and is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://china-p-energy.etnet.com.hk",
        "market_cap": 204798000
    },
    "8203.HK": {
        "short_name": "KAISUN HOLDINGS",
        "long_name": "Kaisun Holdings Limited",
        "summary": "Kaisun Holdings Limited, an investment holding company, engages in the mining, exploitation, processing, production, and sale of coal. It operates through coal mining business, consulting and media service business, and corporate and investment business segments. The company mines for thermal coal. It also provides supply chain management services for the mineral business; produces mining and metallurgical machineries; trades in securities; and manufactures coal mining related equipment. In addition, the company engages in the provision of corporate, consulting, logistics, advertising and public relationship event, media, and trust and trustee services; and e-sport, and financial lease and general trading businesses. It has operations in Hong Kong, rest of the People's Republic of China, Taiwan, Australia, Vietnam, Dubai, and internationally. The company was formerly known as Kaisun Energy Group Limited and changed its name to Kaisun Holdings Limited in July 2018. Kaisun Holdings Limited was incorporated in 2002 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://kaisun.hk",
        "market_cap": 74953576
    },
    "8347.HK": {
        "short_name": "F8 ENT",
        "long_name": "F8 Enterprises (Holdings) Group Limited",
        "summary": "F8 Enterprises (Holdings) Group Limited, an investment holding company, primarily engages in the sale and transportation of diesel oil and related products in Hong Kong and the People's Republic of China. It also supplies marine diesel oil used for construction vessels and lubricant oil used for construction machinery and vehicles. In addition, the company manufactures, distributes, and sells steel products. As of March 31, 2020, it operated a fleet of eight diesel tank wagons; and a marine oil barge. The company was incorporated in 2016 and is headquartered in Kowloon Bay, Hong Kong. F8 Enterprises (Holdings) Group Limited is a subsidiary of Grand Tycoon Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon Bay",
        "zipcode": null,
        "website": "http://www.f8.com.hk",
        "market_cap": 92190000
    },
    "AR9.F": {
        "short_name": "NAN NAN RES ENTERPR.HD-10",
        "long_name": "Nan Nan Resources Enterprise Limited",
        "summary": "Nan Nan Resources Enterprise Limited, an investment holding company, mines, sells, and distributes coal in the People's Republic of China, Hong Kong, Singapore, the United Kingdom, and Malaysia. The company operates through three segments: Coal Mining Business, Renewable Energy Business, and Information Technology Services Business. It owns mining right in the Kaiyuan Open Pit Coal Mine and an exploration right in the Zexu Open Pit Coal Mine in Xinjiang. The company also provides renewable energy solutions and solar farm development services in Malaysia. In addition, it provides information technology outsourcing, consultancy, and technical services in Hong Kong. The company was formerly known as International Resources Enterprise Limited and changed its name to Nan Nan Resources Enterprise Limited in September 2011. Nan Nan Resources Enterprise Limited was incorporated in 1995 and is headquartered in Admiralty, Hong Kong. Nan Nan Resources Enterprise Limited is a subsidiary of Ascent Goal Investments Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.nannanlisted.com",
        "market_cap": 9341841
    },
    "BRZV": {
        "short_name": "BREEZER VENTURES INC",
        "long_name": "Fitvia Corp.",
        "summary": "Fitvia Corp. engages in the writing of patents. The company is also involved in writing business plans for small, medium, and large companies. It also provides valuation services that figure out dead net costs on food products. The company was formerly known as Breezer Ventures Inc. and changed its name to Fitvia Corp. in February 2016. Fitvia Corp. was founded in 2005 and is based in Yau Tong, Hong Kong.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Yau Tong",
        "zipcode": null,
        "website": "http://www.fitviacorp.com",
        "market_cap": 403406
    },
    "CNU.TO": {
        "short_name": "CNOOC LIMITED",
        "long_name": "CNOOC Limited",
        "summary": "CNOOC Limited, an investment holding company, explores for, develops, produces, and sells crude oil and natural gas in offshore China, Canada, the United States, the United Kingdom, Nigeria, Argentina, Indonesia, Uganda, Iraq, Brazil, Guyana, Russia, Australia, and internationally. The company operates through three segments: E&P, Trading Business, and Corporate. It produces offshore crude oil and natural gas primarily in Bohai, the Western South China Sea, the Eastern South China Sea, and the East China Sea in offshore China. The company also holds interests in various oil and gas assets in Asia, Africa, North America, South America, Oceania, and Europe. As of December 31, 2020, it had net proved reserves of approximately 5.37 billion barrels of oil equivalent. In addition, the company is involved in the issuance of bonds; sale and marketing of petroleum and natural gas; and surface exploration and sale of coalbed methane. The company was incorporated in 1999 and is based in Central, Hong Kong. CNOOC Limited is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.cnoocltd.com",
        "market_cap": 54869880832
    },
    "CTJ1.F": {
        "short_name": "KUNLUN ENERGY CO.  HD-,01",
        "long_name": "Kunlun Energy Company Limited",
        "summary": "Kunlun Energy Company Limited, an investment holding company, engages in the exploration, development, production, and sale of crude oil and natural gas. It operates through four segments: Natural Gas Sales; Sales of Liquefied Petroleum Gas (LPG); Liquefied Natural Gas (LNG) Processing and Terminal; and Exploration and Production. The company is also involved in the processing, unloading, storing, gasification, and entrucking of LNG; trading, distribution, and retail sale of various natural gas products; and wholesale and retail of various LPG products. It operates in the People's Republic of China, the Republic of Kazakhstan, the Sultanate of Oman, the Republic of Peru, the Kingdom of Thailand, and the Republic of Azerbaijan. The company was formerly known as CNPC (Hong Kong) Limited and changed its name to Kunlun Energy Company Limited in March 2010. The company is based in Hong Kong, Hong Kong. Kunlun Energy Company Limited is a subsidiary of PetroChina Hong Kong Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.kunlun.com.hk",
        "market_cap": 6279758336
    },
    "EGYF": {
        "short_name": "ENERGY FINDERS INC",
        "long_name": "Energy Finders, Inc.",
        "summary": "Energy Finders, Inc. does not have significant operations. The company intends to consummate a merger or acquisition with a partner that may involve a change in the company's business. Previously, it was engaged in the oil and gas exploration activities. The company was incorporated in 2006 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": null,
        "market_cap": 5500781
    },
    "GPI1.F": {
        "short_name": "CHINA OIL+GAS GR. HD -,01",
        "long_name": "China Oil And Gas Group Limited",
        "summary": "China Oil And Gas Group Limited, an investment holding company, primarily invests in natural gas and energy related businesses in the People's Republic of China and Canada. The company operates through three segments: Sales and Distribution of Natural Gas and Other Related Products; Gas Pipeline Construction and Connection; and Exploitation and Production of Crude Oil and Natural Gas. It is involved in the piped city gas business, as well as design and construction of gas pipelines; and the transportation, distribution, and sale of compressed natural gas and liquefied natural gas. The company also develops, produces, and sells crude oil and natural gas, and other upstream energy resources; constructs and operates gas pipelines and natural gas stations; and provision for finance, as well as involved in the trading of natural gas and related equipment. In addition, it operates natural gas stations for automobiles. The company serves approximately 1,603,096 residential users; and 14,319 industrial and commercial users. China Oil And Gas Group Limited is headquartered in Causeway Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.hk603.com",
        "market_cap": 245925440
    },
    "GWCC.F": {
        "short_name": "EPI HOLDINGS LTD  HD -,01",
        "long_name": "EPI (Holdings) Limited",
        "summary": "EPI (Holdings) Limited, an investment holding company, engages in the exploration and production of petroleum in Argentina, Hong Kong, and the People's Republic of China. The company primarily holds an interest in the ChaÃ±ares Herrados concession located in the Cuyana Basin, Mendoza Province of Argentina. It also engages in money lending, and securities investment and management activities. The company is based in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.epiholdings.com",
        "market_cap": 42441072
    },
    "HOX.F": {
        "short_name": "SOUTHGOBI RESOURCES LTD.",
        "long_name": "SouthGobi Resources Ltd.",
        "summary": "SouthGobi Resources Ltd., together with its subsidiaries, operates as an integrated coal mining, development, and exploration company in Mongolia, Hong Kong, and China. It primarily explores for coking and thermal coal. The company's flagship project is the Ovoot Tolgoi open pit coal mine located in the Umnugobi Aimag of Mongolia. It also engages in the logistics and trading of coal in Mongolia and China. The company was formerly known as SouthGobi Energy Resources Ltd. and changed its name to SouthGobi Resources Ltd. in May 2010. SouthGobi Resources Ltd. was incorporated in 2002 and is based in Mong kok, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Mong Kok",
        "zipcode": null,
        "website": "http://www.southgobi.com",
        "market_cap": 53451372
    },
    "HPG1.F": {
        "short_name": "CHINA ENERGY DEV.H.HD-,05",
        "long_name": "China Energy Development Holdings Limited",
        "summary": "China Energy Development Holdings Limited, an investment holding company, engages in the exploration, development, production, and distribution of natural gas. It operates through three segments: Exploration, Production, and Distribution of Natural Gas; Sales of Food and Beverages Business; and Money Lending Business. The company drills, explores for, develops, exploits, and produces oil and/or natural gas from site located in North Kashi Block, Tarim Basin, Xinjiang; and distributes natural gas through pipelines in the People's Republic of China. It is also involved in the sale of food and beverages; provision of loans to third parties; and operation of a chain of Chinese restaurants in Hong Kong. The company was incorporated in 2001 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.cnenergy.com.hk",
        "market_cap": 102531000
    },
    "K20A.F": {
        "short_name": "STR.PETROCH.HLDGS HD-,025",
        "long_name": "Strong Petrochemical Holdings Limited",
        "summary": "Strong Petrochemical Holdings Limited, an investment holding company, engages in trading crude oil, iron ore, petroleum, petrochemical, and coal products. The company is also involved in the provision of storage and other ancillary services for petroleum products and petrochemicals; and property investment activities. It offers its products in the People's Republic of China, Hong Kong, Macao, Singapore, Korea, France, Japan, Vietnam, and the United Kingdom. The company was incorporated in 1999 and is headquartered in Admiralty, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.strongpetrochem.com",
        "market_cap": 69449096
    },
    "KLYCY": {
        "short_name": "KUNLUN ENERGY COMPANY LIMITED",
        "long_name": "Kunlun Energy Company Limited",
        "summary": "Kunlun Energy Company Limited, an investment holding company, engages in the exploration, development, production, and sale of crude oil and natural gas. It operates through four segments: Natural Gas Sales; Sales of Liquefied Petroleum Gas (LPG); Liquefied Natural Gas (LNG) Processing and Terminal; and Exploration and Production. The company is also involved in the processing, unloading, storing, gasification, and entrucking of LNG; trading, distribution, and retail sale of various natural gas products; and wholesale and retail of various LPG products. It operates in the People's Republic of China, the Republic of Kazakhstan, the Sultanate of Oman, the Republic of Peru, the Kingdom of Thailand, and the Republic of Azerbaijan. The company was formerly known as CNPC (Hong Kong) Limited and changed its name to Kunlun Energy Company Limited in March 2010. The company is based in Hong Kong, Hong Kong. Kunlun Energy Company Limited is a subsidiary of PetroChina Hong Kong Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.kunlun.com.hk",
        "market_cap": 8268198912
    },
    "KUNUF": {
        "short_name": "KUNLUN ENERGY COMPANY LIMITED",
        "long_name": "Kunlun Energy Company Limited",
        "summary": "Kunlun Energy Company Limited, an investment holding company, engages in the exploration, development, production, and sale of crude oil and natural gas. It operates through four segments: Natural Gas Sales; Sales of Liquefied Petroleum Gas (LPG); Liquefied Natural Gas (LNG) Processing and Terminal; and Exploration and Production. The company is also involved in the processing, unloading, storing, gasification, and entrucking of LNG; trading, distribution, and retail sale of various natural gas products; and wholesale and retail of various LPG products. It operates in the People's Republic of China, the Republic of Kazakhstan, the Sultanate of Oman, the Republic of Peru, the Kingdom of Thailand, and the Republic of Azerbaijan. The company was formerly known as CNPC (Hong Kong) Limited and changed its name to Kunlun Energy Company Limited in March 2010. The company is based in Hong Kong, Hong Kong. Kunlun Energy Company Limited is a subsidiary of PetroChina Hong Kong Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.kunlun.com.hk",
        "market_cap": 7770312192
    },
    "NC2A.F": {
        "short_name": "CNOOC LTD. ADR/100 HD-,02",
        "long_name": "CNOOC Limited",
        "summary": "CNOOC Limited, an investment holding company, explores for, develops, produces, and sells crude oil and natural gas in offshore China, Canada, the United States, the United Kingdom, Nigeria, Argentina, Indonesia, Uganda, Iraq, Brazil, Guyana, Russia, Australia, and internationally. The company operates through three segments: E&P, Trading Business, and Corporate. It produces offshore crude oil and natural gas primarily in Bohai, the Western South China Sea, the Eastern South China Sea, and the East China Sea in offshore China. The company also holds interests in various oil and gas assets in Asia, Africa, North America, South America, Oceania, and Europe. As of December 31, 2020, it had net proved reserves of approximately 5.37 billion barrels of oil equivalent. In addition, the company is involved in the issuance of bonds; sale and marketing of petroleum and natural gas; and surface exploration and sale of coalbed methane. The company was incorporated in 1999 and is based in Central, Hong Kong. CNOOC Limited is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.cnoocltd.com",
        "market_cap": 39529160704
    },
    "NC2B.F": {
        "short_name": "CNOOC LTD O.N.",
        "long_name": "CNOOC Limited",
        "summary": "CNOOC Limited, an investment holding company, explores for, develops, produces, and sells crude oil and natural gas in offshore China, Canada, the United States, the United Kingdom, Nigeria, Argentina, Indonesia, Uganda, Iraq, Brazil, Guyana, Russia, Australia, and internationally. The company operates through three segments: E&P, Trading Business, and Corporate. It produces offshore crude oil and natural gas primarily in Bohai, the Western South China Sea, the Eastern South China Sea, and the East China Sea in offshore China. The company also holds interests in various oil and gas assets in Asia, Africa, North America, South America, Oceania, and Europe. As of December 31, 2020, it had net proved reserves of approximately 5.37 billion barrels of oil equivalent. In addition, the company is involved in the issuance of bonds; sale and marketing of petroleum and natural gas; and surface exploration and sale of coalbed methane. The company was incorporated in 1999 and is based in Central, Hong Kong. CNOOC Limited is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.cnoocltd.com",
        "market_cap": 42215997440
    },
    "NE6.F": {
        "short_name": "NEWOCEAN ENERGY HLD.HD-10",
        "long_name": "NewOcean Energy Holdings Limited",
        "summary": "NewOcean Energy Holdings Limited, an investment holding company, distributes and sells liquefied petroleum gas (LPG) and natural gas, and oil/chemical products in the People's Republic of China. The company sells LPG to industrial customers, auto-gas operators, wholesalers, bottled LPG end-users, auto-gas end-users, etc. It also trades in electronic products, such as integrated circuits and mobile phones. Further, it is involved in the property investment and development activities. The company is headquartered in Wanchai, Hong Kong. NewOcean Energy Holdings Limited is a subsidiary of Uniocean Investments Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.newoceanhk.com",
        "market_cap": 68084256
    },
    "RYZR.F": {
        "short_name": "CHINA LNG GROUP  HD-,02",
        "long_name": "China LNG Group Limited",
        "summary": "China LNG Group Limited, an investment holding company, sells and distributes liquefied natural gas (LNG) in the People's Republic of China. The company engages in the wholesale and point-to-point supply of LNG; and provision of LNG in the midstream and downstream market through fueling/refueling of LNG in road refueling stations for commercial vehicles, as well as water refueling stations for vessels and specific designed refueling facilities for equipment. It also provides LNG logistic services; finance leasing services for LNG vehicles and equipment; and securities brokerage, margin financing, and securities investments and financial services, as well as sells LNG vehicles. In addition, the company develops and operates oil-to-gas conversion and LNG refueling facilities on floating barges; develops LNG related technologies; operates LNG refueling stations; trades in gas ignition equipment; utilizes new energy sources and new energy related businesses; and supplies and manages LNG. Further, it is involved in the construction and operation of natural gas filling stations; wholesale of ethanol and liquefied petroleum gas; and trading of natural gas and transportation. Additionally, the company offers commercial vehicle user's long distance IT control, insurance handling, and new/used LNG/diesel vehicles purchase/sale services; and LNG consultancy services. The company was formerly known as Artel Solutions Group Holdings Limited and changed its name to China LNG Group Limited in June 2014. China LNG Group Limited was founded in 1995 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://chinalng.todayir.com",
        "market_cap": 243770704
    },
    "SAK.F": {
        "short_name": "SINOPEC KANTONS H.  HD-10",
        "long_name": "Sinopec Kantons Holdings Limited",
        "summary": "Sinopec Kantons Holdings Limited, an investment holding company, provides crude oil jetty services. It operates through, Crude Oil Jetty and Storage Services; and Vessel Chartering and Logistics Services segments. The company offers crude oil transportation, unloading, storage, and other jetty services for oil tankers in the People's Republic of China (PRC), Europe, and the Middle East; and vessel chartering services for liquefied natural gas transportation in the PRC, Australia, and the Papua New Guinea. It also engages in the trading of crude oil; and provision of oil supporting and ancillary services. The company was founded in 1998 and is headquartered in Causeway Bay, Hong Kong. Sinopec Kantons Holdings Limited is a subsidiary of Sinopec Kantons International Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.sinopec.com.hk",
        "market_cap": 840601792
    },
    "SAN.AX": {
        "short_name": "SAGALIO EN FPO",
        "long_name": "Sagalio Energy Limited",
        "summary": "Sagalio Energy Limited, together with its subsidiaries, engages in the exploration, evaluation, and development of petroleum resources in the central Asia region. It holds interest in three oil projects located in the Kyrgyz Republic. The company was formerly known as FeOre Limited and changed its name to Sagalio Energy Limited in May 2015. Sagalio Energy Limited was incorporated in 2011 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.feore.com",
        "market_cap": 4502520
    },
    "SGBH": {
        "short_name": "GRAND CHINA ENERGY GROUP LIMITE",
        "long_name": "Grand China Energy Group Limited",
        "summary": "Grand China Energy Group Limited, through its subsidiaries, engages in the exploration, development, mining, production, and sale of coal properties in the People's Republic of China. It owns and operates a coal mine in Shangzhai Village, Yongding County, Longyan City, Fujian Province. The company was formerly known as SGB International Holdings Inc. and changed its name to Grand China Energy Group Limited on August 2014. Grand China Energy Group Limited is based in Causeway Bay, Hong Kong.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": null,
        "market_cap": 53945000
    },
    "SGQ.TO": {
        "short_name": "SOUTHGOBI RESOURCES LTD",
        "long_name": "SouthGobi Resources Ltd.",
        "summary": "SouthGobi Resources Ltd., together with its subsidiaries, operates as an integrated coal mining, development, and exploration company in Mongolia, Hong Kong, and China. It primarily explores for coking and thermal coal. The company's flagship project is the Ovoot Tolgoi open pit coal mine located in the Umnugobi Aimag of Mongolia. It also engages in the logistics and trading of coal in Mongolia and China. The company was formerly known as SouthGobi Energy Resources Ltd. and changed its name to SouthGobi Resources Ltd. in May 2010. SouthGobi Resources Ltd. was incorporated in 2002 and is based in Mong kok, Hong Kong.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Mong Kok",
        "zipcode": null,
        "website": "http://www.southgobi.com",
        "market_cap": 98329320
    },
    "SGQRF": {
        "short_name": "SOUTHGOBI RESOURCES LTD",
        "long_name": "SouthGobi Resources Ltd.",
        "summary": "SouthGobi Resources Ltd., together with its subsidiaries, operates as an integrated coal mining, development, and exploration company in Mongolia, Hong Kong, and China. It primarily explores for coking and thermal coal. The company's flagship project is the Ovoot Tolgoi open pit coal mine located in the Umnugobi Aimag of Mongolia. It also engages in the logistics and trading of coal in Mongolia and China. The company was formerly known as SouthGobi Energy Resources Ltd. and changed its name to SouthGobi Resources Ltd. in May 2010. SouthGobi Resources Ltd. was incorporated in 2002 and is based in Mong kok, Hong Kong.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Mong Kok",
        "zipcode": null,
        "website": "http://www.southgobi.com",
        "market_cap": 115508688
    },
    "SPKOY": {
        "short_name": "SINOPEC KANTONS HLDGS",
        "long_name": "Sinopec Kantons Holdings Limited",
        "summary": "Sinopec Kantons Holdings Limited, an investment holding company, provides crude oil jetty services. It operates through, Crude Oil Jetty and Storage Services; and Vessel Chartering and Logistics Services segments. The company offers crude oil transportation, unloading, storage, and other jetty services for oil tankers in the People's Republic of China (PRC), Europe, and the Middle East; and vessel chartering services for liquefied natural gas transportation in the PRC, Australia, and the Papua New Guinea. It also engages in the trading of crude oil; and provision of oil supporting and ancillary services. The company was founded in 1998 and is headquartered in Causeway Bay, Hong Kong. Sinopec Kantons Holdings Limited is a subsidiary of Sinopec Kantons International Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.sinopec.com.hk",
        "market_cap": 938697728
    },
    "SUT1.F": {
        "short_name": "IDG ENERGY INVT NEW HD-01",
        "long_name": "IDG Energy Investment Limited",
        "summary": "IDG Energy Investment Limited, an investment holding company, engages in the energy assets investment and management activities in the People's Republic of China. The company is involved in the upstream oil and gas business; liquefied natural gas (LNG) liquefaction and exporting; and LNG importing, processing, and selling operations, as well as LNG logistics services. The company owns interests in upstream crude oil blocks in the United States and China; LNG export terminals in the United States and Canada; and a LNG receiving terminal in China. It also provides related energy investment fund management services; engages in the exploration, development, production, and sale of crude oil; and offers technology development and consulting, and mobility services. The company is headquartered in Central, Hong Kong. IDG Energy Investment Limited is a subsidiary of Titan Gas Technology Investment Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.idgenergyinv.com",
        "market_cap": 745165120
    },
    "SUT1.SG": {
        "short_name": "IDG Energy Investment Ltd. Regi",
        "long_name": "IDG Energy Investment Limited",
        "summary": "IDG Energy Investment Limited, an investment holding company, engages in the energy assets investment and management activities in the People's Republic of China. The company is involved in the upstream oil and gas business; liquefied natural gas (LNG) liquefaction and exporting; and LNG importing, processing, and selling operations, as well as LNG logistics services. The company owns interests in upstream crude oil blocks in the United States and China; LNG export terminals in the United States and Canada; and a LNG receiving terminal in China. It also provides related energy investment fund management services; engages in the exploration, development, production, and sale of crude oil; and offers technology development and consulting, and mobility services. The company is headquartered in Central, Hong Kong. IDG Energy Investment Limited is a subsidiary of Titan Gas Technology Investment Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.idgenergyinv.com",
        "market_cap": 745165120
    },
    "UNEGF": {
        "short_name": "UNITED ENERGY GROUP LTD.",
        "long_name": "United Energy Group Limited",
        "summary": "United Energy Group Limited, an investment holding company, engages in the investment and operation of upstream oil, natural gas, and other energy related businesses in South Asia, the Middle East, and North Africa. The company explores for and produces crude oil and natural gas. As of December 31, 2020, its proven recoverable reserves consisted of 1,073.9 million barrels of oil equivalent. United Energy Group Limited is headquartered in Admiralty, Hong Kong.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.uegl.com.hk",
        "market_cap": 4584402432
    },
    "VBO.F": {
        "short_name": "CGN MINING CO.LTD  HD-,01",
        "long_name": "CGN Mining Company Limited",
        "summary": "CGN Mining Company Limited engages in the investment and trading of natural uranium resources. The company is also involved in the property investment activities. It has operations in Hong Kong, the People's Republic of China, Kazakhstan, Canada, and the United Kingdom, rest of Europe. The company was incorporated in 2001 and is headquartered in Wanchai, Hong Kong. CGN Mining Company Limited is a subsidiary of China Uranium Development Company Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Uranium",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.cgnmc.com",
        "market_cap": 548290368
    },
    "XYTA.F": {
        "short_name": "CHINA HUARONG ENER.HD-,50",
        "long_name": "China Huarong Energy Company Limited",
        "summary": "China Huarong Energy Company Limited, an investment holding company, engages in the energy exploration and production businesses. The company explores for, produces, and sells crude oil. The company operates five oilfields in the Fergana Valley of the Republic of Kyrgyzstan; and sells petroleum products. It is also involved in commodity trading business. The company was formerly known as China Rongsheng Heavy Industries Group Holdings Limited and changed its name to China Huarong Energy Company Limited in April 2015. China Huarong Energy Company Limited was incorporated in 2010 and is based in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.huarongenergy.com.hk",
        "market_cap": 51272460
    }
}