{
    "0260.HK": {
        "short_name": "AVIC JOY HLDG",
        "long_name": "AVIC Joy Holdings (HK) Limited",
        "summary": "AVIC Joy Holdings (HK) Limited, an investment holding company, provides finance lease and loan services in the People's Republic of China. It also provides property investment and land development services; sells construction materials; and manages and operates light-emitting diode energy management contracts. The company was formerly known as China Environmental Investment Holdings Limited and changed its name to AVIC Joy Holdings (HK) Limited in November 2014. AVIC Joy Holdings (HK) Limited is based in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.avicjoyhk.com",
        "market_cap": "Nano Cap"
    },
    "0342.HK": {
        "short_name": "NEWOCEAN ENERGY",
        "long_name": "NewOcean Energy Holdings Limited",
        "summary": "NewOcean Energy Holdings Limited, an investment holding company, distributes and sells liquefied petroleum gas (LPG) and natural gas, and oil/chemical products in the People's Republic of China. The company sells LPG to industrial customers, auto-gas operators, wholesalers, bottled LPG end-users, auto-gas end-users, etc. It also trades in electronic products, such as integrated circuits and mobile phones. Further, it is involved in the property investment and development activities. The company is headquartered in Wanchai, Hong Kong. NewOcean Energy Holdings Limited is a subsidiary of Uniocean Investments Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.newoceanhk.com",
        "market_cap": "Micro Cap"
    },
    "0567.HK": {
        "short_name": "DAISHOMICROLINE",
        "long_name": "Daisho Microline Holdings Limited",
        "summary": "Daisho Microline Holdings Limited, an investment holding company, manufactures and trades in printed circuit boards. The company is also involved in the trading of petroleum and energy products, and related business; and vessel chartering and property holding activities. It has operations in the People's Republic of China, Hong Kong, Singapore, North America, Japan, Europe, and internationally. The company is headquartered in Chai Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Chai Wan",
        "zipcode": null,
        "website": "http://www.daisho-microline.com",
        "market_cap": "Nano Cap"
    },
    "0852.HK": {
        "short_name": "STRONG PETRO",
        "long_name": "Strong Petrochemical Holdings Limited",
        "summary": "Strong Petrochemical Holdings Limited, an investment holding company, engages in trading crude oil, iron ore, petroleum, petrochemical, and coal products. The company is also involved in the provision of storage and other ancillary services for petroleum products and petrochemicals; and property investment activities. It offers its products in the People's Republic of China, Hong Kong, Macao, Singapore, Korea, France, Japan, Vietnam, and the United Kingdom. The company was incorporated in 1999 and is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.strongpetrochem.com",
        "market_cap": "Micro Cap"
    },
    "1142.HK": {
        "short_name": "SIBERIAN MINING",
        "long_name": "Siberian Mining Group Company Limited",
        "summary": "Siberian Mining Group Company Limited, an investment holding company, trades in gasoline in the Republic of Korea. It operates through Mining; and Mineral Resources, Commodities and Other Trading segments. The company is also involved in the trading of commodities and mineral resources. In addition, it holds coal mining and exploration rights in Russia. The company was incorporated in 2002 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://siberian.todayir.com",
        "market_cap": "Nano Cap"
    },
    "1621.HK": {
        "short_name": "VICO INTL HLDGS",
        "long_name": "Vico International Holdings Limited",
        "summary": "Vico International Holdings Limited, an investment holding company, distributes third-party branded petrochemicals in Hong Kong, Macau, Vietnam, Dubai, Malaysia, and Singapore. It offers diesel; lubricant oils, including self-branded lubricant and third-party branded lubricant oils; and other petrochemicals, such as bitumen, as well as kerosene. The company also provides fleet card and transportation services. As of March 31, 2020, it operated a total number of 38,380 fleet card accounts. The company was formerly known as Rico International Holdings Limited and changed its name to Vico International Holdings Limited in May 2017. The company was founded in 1977 and is headquartered in Cheung Sha Wan, Hong Kong. Vico International Holdings Limited is a subsidiary of Max Fortune Holdings Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Cheung Sha Wan",
        "zipcode": null,
        "website": "http://www.vicointernational.hk",
        "market_cap": "Nano Cap"
    },
    "8347.HK": {
        "short_name": "F8 ENT",
        "long_name": "F8 Enterprises (Holdings) Group Limited",
        "summary": "F8 Enterprises (Holdings) Group Limited, an investment holding company, primarily engages in the sale and transportation of diesel oil and related products in Hong Kong and the People's Republic of China. It also supplies marine diesel oil used for construction vessels and lubricant oil used for construction machinery and vehicles. In addition, the company manufactures, distributes, and sells steel products. As of March 31, 2020, it operated a fleet of eight diesel tank wagons; and a marine oil barge. The company was incorporated in 2016 and is headquartered in Kowloon Bay, Hong Kong. F8 Enterprises (Holdings) Group Limited is a subsidiary of Grand Tycoon Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon Bay",
        "zipcode": null,
        "website": "http://www.f8.com.hk",
        "market_cap": "Nano Cap"
    },
    "GPI1.F": {
        "short_name": "CHINA OIL+GAS GR. HD -,01",
        "long_name": "China Oil And Gas Group Limited",
        "summary": "China Oil And Gas Group Limited, an investment holding company, primarily invests in natural gas and energy related businesses in the People's Republic of China and Canada. The company operates through three segments: Sales and Distribution of Natural Gas and Other Related Products; Gas Pipeline Construction and Connection; and Exploitation and Production of Crude Oil and Natural Gas. It is involved in the piped city gas business, as well as design and construction of gas pipelines; and the transportation, distribution, and sale of compressed natural gas and liquefied natural gas. The company also develops, produces, and sells crude oil and natural gas, and other upstream energy resources; constructs and operates gas pipelines and natural gas stations; and provision for finance, as well as involved in the trading of natural gas and related equipment. In addition, it operates natural gas stations for automobiles. The company serves approximately 1,603,096 residential users; and 14,319 industrial and commercial users. China Oil And Gas Group Limited is headquartered in Causeway Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.hk603.com",
        "market_cap": "Micro Cap"
    },
    "K20A.F": {
        "short_name": "STR.PETROCH.HLDGS HD-,025",
        "long_name": "Strong Petrochemical Holdings Limited",
        "summary": "Strong Petrochemical Holdings Limited, an investment holding company, engages in trading crude oil, iron ore, petroleum, petrochemical, and coal products. The company is also involved in the provision of storage and other ancillary services for petroleum products and petrochemicals; and property investment activities. It offers its products in the People's Republic of China, Hong Kong, Macao, Singapore, Korea, France, Japan, Vietnam, and the United Kingdom. The company was incorporated in 1999 and is headquartered in Admiralty, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.strongpetrochem.com",
        "market_cap": "Micro Cap"
    },
    "NE6.F": {
        "short_name": "NEWOCEAN ENERGY HLD.HD-10",
        "long_name": "NewOcean Energy Holdings Limited",
        "summary": "NewOcean Energy Holdings Limited, an investment holding company, distributes and sells liquefied petroleum gas (LPG) and natural gas, and oil/chemical products in the People's Republic of China. The company sells LPG to industrial customers, auto-gas operators, wholesalers, bottled LPG end-users, auto-gas end-users, etc. It also trades in electronic products, such as integrated circuits and mobile phones. Further, it is involved in the property investment and development activities. The company is headquartered in Wanchai, Hong Kong. NewOcean Energy Holdings Limited is a subsidiary of Uniocean Investments Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.newoceanhk.com",
        "market_cap": "Micro Cap"
    },
    "RYZR.F": {
        "short_name": "CHINA LNG GROUP  HD-,02",
        "long_name": "China LNG Group Limited",
        "summary": "China LNG Group Limited, an investment holding company, sells and distributes liquefied natural gas (LNG) in the People's Republic of China. The company engages in the wholesale and point-to-point supply of LNG; and provision of LNG in the midstream and downstream market through fueling/refueling of LNG in road refueling stations for commercial vehicles, as well as water refueling stations for vessels and specific designed refueling facilities for equipment. It also provides LNG logistic services; finance leasing services for LNG vehicles and equipment; and securities brokerage, margin financing, and securities investments and financial services, as well as sells LNG vehicles. In addition, the company develops and operates oil-to-gas conversion and LNG refueling facilities on floating barges; develops LNG related technologies; operates LNG refueling stations; trades in gas ignition equipment; utilizes new energy sources and new energy related businesses; and supplies and manages LNG. Further, it is involved in the construction and operation of natural gas filling stations; wholesale of ethanol and liquefied petroleum gas; and trading of natural gas and transportation. Additionally, the company offers commercial vehicle user's long distance IT control, insurance handling, and new/used LNG/diesel vehicles purchase/sale services; and LNG consultancy services. The company was formerly known as Artel Solutions Group Holdings Limited and changed its name to China LNG Group Limited in June 2014. China LNG Group Limited was founded in 1995 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://chinalng.todayir.com",
        "market_cap": "Micro Cap"
    }
}