{"0578.HK": {"short_name": "ROSAN RES", "long_name": "Rosan Resources Holdings Limited", "summary": "Rosan Resources Holdings Limited, together with its subsidiaries, produces and sells coal and building materials, and trades in purchased coal in the People's Republic of China. The company operates through Coal Business and Building Materials Business segment. It also provides management services; and engages in project investment, asset management, and investment consultation activities, as well as produces and leases aluminum boundary wall moulds. The company is based in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Energy", "industry": "Thermal Coal", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "0704.HK": {"short_name": "HUSCOKE HLDGS", "long_name": "Huscoke Holdings Limited", "summary": "Huscoke Holdings Limited, an investment holding company, produces and trades in coke in the People's Republic of China. The company operates through three segments: Coke Trading, Coal-Related Ancillary, and Coke Production. The Coke Trading segment purchases and sells coal and coke. The Coal-Related Ancillary segment is involved in the washing of raw coal into refined coal for sale and processing, as well as sale of electricity and heat, which are generated as the by-products during the washing of raw coal. The Coke Production segment processes refined coal into coke for sale, as well as sells coke by-products. Huscoke Resources Holdings Limited also holds assets. The company was formerly known as Huscoke Resources Holdings Limited and changed its name to Huscoke Holdings Limited in December 2018. The company is based in Admiralty, Hong Kong. Huscoke Holdings Limited is a subsidiary of Shun Wang Investments Limited.", "currency": "HKD", "sector": "Energy", "industry": "Thermal Coal", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Admiralty"}, "0866.HK": {"short_name": "CHINA QINFA", "long_name": "China Qinfa Group Limited", "summary": "China Qinfa Group Limited, an investment holding company, engages in the mining, purchase and sale, filtering, storage, blending, shipping, and transportation of coal in the People's Republic of China. The company operates through Coal Business and Shipping Transportation segments. As of December 31, 2019, the company owned and operated five coal mines. It is also involved in goods transportation and logistics, and charter hire activities. The company was founded in 1996 and is based in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Energy", "industry": "Thermal Coal", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "16Q.F": {"short_name": "CHINA QINFA GROUP  HD-,10", "long_name": "China Qinfa Group Limited", "summary": "China Qinfa Group Limited, an investment holding company, engages in the mining, purchase and sale, filtering, storage, blending, shipping, and transportation of coal in the People's Republic of China. The company operates through Coal Business and Shipping Transportation segments. As of December 31, 2019, the company owned and operated five coal mines. It is also involved in goods transportation and logistics, and charter hire activities. The company was founded in 1996 and is based in Wan Chai, Hong Kong.", "currency": "EUR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "1738.HK": {"short_name": "FS ANTHRACITE", "long_name": "Feishang Anthracite Resources Limited", "summary": "Feishang Anthracite Resources Limited, an investment holding company, produces anthracite coal in the People's Republic of China. It primarily engages in the acquisition, construction, and development of anthracite coal mines; and extraction, sale, and trade of anthracite coal. The company's mining assets consist of seven underground anthracite coal mines in Guizhou province. It is also involved in the coal washing activities. The company was formerly known as Wealthy Year Limited. The company was founded in 2010 and is based in Sheung Wan, Hong Kong. Feishang Anthracite Resources Limited is a subsidiary of Feishang Group Limited.", "currency": "HKD", "sector": "Energy", "industry": "Thermal Coal", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Sheung Wan"}}