{
    "8AS.SG": {
        "short_name": "Alam Sutera Realty Tbk PT Regis",
        "long_name": "PT Alam Sutera Realty Tbk",
        "summary": "PT Alam Sutera Realty Tbk operates as an integrated property developer in Indonesia. The company is involved in the development and management of residential areas, commercial districts, industrial areas, shopping centers, and leisure centers, as well as hospitality facilities. It also provides building management, consultancy, investment, and business management services, as well as money lending services; operates tourism area; and sells goods. The company was formerly known as PT Adhihutama Manunggal and changed its name to PT Alam Sutera Realty Tbk in September 2007. PT Alam Sutera Realty Tbk was founded in 1993 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "AKKU.JK": {
        "short_name": "Anugerah Kagum Karya Utama Tbk.",
        "long_name": "PT Anugerah Kagum Karya Utama Tbk",
        "summary": "PT Anugerah Kagum Karya Utama Tbk, through its subsidiaries, engages in general trading business in Indonesia. It offers business, management, and administration consulting; mining operations support; general mining management; and hotel management. The company is also involved in the rental of heavy equipment. It serves mining, trading, and hospitality management companies. The company was formerly known as PT Alam Karya Unggul Tbk and changed its name to PT Anugerah Kagum Karya Utama Tbk in October 2016. The company was founded in 2001 and is headquartered in Jakarta, Indonesia. PT Anugerah Kagum Karya Utama Tbk is a subsidiary of Oil and Gas Ventures Limited.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "AMAN.JK": {
        "short_name": "Makmur Berkah Amanda Tbk.",
        "long_name": "PT Makmur Berkah Amanda Tbk",
        "summary": "PT Makmur Berkah Amanda Tbk operates as a property developer in Indonesia. It develops residential, warehouse, and commercial properties. The company was founded in 1996 and is headquartered in Jakarta Barat, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "APLN.JK": {
        "short_name": "Agung Podomoro Land Tbk.",
        "long_name": "PT Agung Podomoro Land Tbk",
        "summary": "PT Agung Podomoro Land Tbk, together with its subsidiaries, owns, develops, and manages retail, residential, and commercial real estate properties in Indonesia. The company is involved in land acquisition and/or sourcing; design and development; project management, sale, commercial leasing, and marketing; and operation and management of superblock developments, shopping malls, offices, hotels, and residential apartments and houses. The company was founded in 2004 and is headquartered in West Jakarta, Indonesia. PT Agung Podomoro Land Tbk is a subsidiary of PT Indofica.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "West Jakarta"
    },
    "ASRI.JK": {
        "short_name": "Alam Sutera Realty Tbk.",
        "long_name": "PT Alam Sutera Realty Tbk",
        "summary": "PT Alam Sutera Realty Tbk operates as an integrated property developer in Indonesia. The company is involved in the development and management of residential areas, commercial districts, industrial areas, shopping centers, and leisure centers, as well as hospitality facilities. It also provides building management, consultancy, investment, and business management services, as well as money lending services; operates tourism area; and sells goods. The company was formerly known as PT Adhihutama Manunggal and changed its name to PT Alam Sutera Realty Tbk in September 2007. PT Alam Sutera Realty Tbk was founded in 1993 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "B73.SG": {
        "short_name": "Bekasi Fajar Ind.Estate Tbk PTR",
        "long_name": "PT Bekasi Fajar Industrial Estate Tbk",
        "summary": "PT Bekasi Fajar Industrial Estate Tbk develops, constructs, and manages industrial estates and properties in Indonesia. The company provides industrial estate land lots that are ready for construction; and infrastructure maintaining and supporting services. It also develops coffee shops, restaurants, hotels, etc. The company was founded in 1989 and is based in Bekasi, Indonesia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "BAPA.JK": {
        "short_name": "Bekasi Asri Pemula Tbk.",
        "long_name": "PT Bekasi Asri Pemula Tbk",
        "summary": "PT Bekasi Asri Pemula Tbk engages in real estate business in Indonesia. The company was founded in 1993 and is headquartered in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "West Jakarta"
    },
    "BAPI.JK": {
        "short_name": "Bhakti Agung Propertindo Tbk.",
        "long_name": "PT Bhakti Agung Propertindo Tbk",
        "summary": "PT Bhakti Agung Propertindo Tbk engages in real estate development activities in Indonesia. The company was formerly known as PT Paku Bumi Sejahtera and changed its name to PT Bhakti Agung Propertindo Tbk in June 2015. PT Bhakti Agung Propertindo Tbk was founded in 2012 and is headquartered in Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "BCIP.JK": {
        "short_name": "Bumi Citra Permai Tbk.",
        "long_name": "PT Bumi Citra Permai Tbk",
        "summary": "PT Bumi Citra Permai Tbk engages in the development of industrial warehousing and home offices primarily in Indonesia. The company was founded in 2000 and is headquartered in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Central Jakarta"
    },
    "BEST.JK": {
        "short_name": "Bekasi Fajar Industrial Estate ",
        "long_name": "PT Bekasi Fajar Industrial Estate Tbk",
        "summary": "PT Bekasi Fajar Industrial Estate Tbk develops, constructs, and manages industrial estates and properties in Indonesia. The company provides industrial estate land lots that are ready for construction; and infrastructure maintaining and supporting services. It also develops coffee shops, restaurants, hotels, etc. The company was founded in 1989 and is based in Bekasi, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "BIKA.JK": {
        "short_name": "Binakarya Jaya Abadi Tbk.",
        "long_name": "PT Binakarya Jaya Abadi Tbk",
        "summary": "PT Binakarya Jaya Abadi Tbk develops and constructs apartments, houses, and complexes in Indonesia. The company's property portfolio comprises hotels, kiosks, shop houses, shopping centers, condominiums, and kavling projects. The company is headquartered in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "West Jakarta"
    },
    "BIPP.JK": {
        "short_name": "Bhuwanatala Indah Permai Tbk.",
        "long_name": "PT Bhuwanatala Indah Permai Tbk",
        "summary": "PT Bhuwanatala Indah Permai Tbk, through its subsidiaries, engages in the development and management of commercial properties in Indonesia. The company develops and manages properties, including hotels, apartments, offices, shops, and housing properties. It is also involved in the equity participation business. The company was formerly known as PT Bandung Indah Plaza and changed its name to PT Bhuwanatala Indah Permai Tbk in 1990. PT Bhuwanatala Indah Permai Tbk was founded in 1981 and is headquartered in Jakarta, Indonesia. PT Bhuwanatala Indah Permai Tbk is a subsidiary of Safire Capital Pte. Ltd.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "BKDP.JK": {
        "short_name": "Bukit Darmo Property Tbk",
        "long_name": "PT Bukit Darmo Property Tbk",
        "summary": "PT Bukit Darmo Property Tbk engages in construction, development, trade, and investment activities in Indonesia. It operates through Real Estate, Shopping Mall, Construction, and Marketing Services segments. The company constructs and develops apartments, offices, shops, recreational parks, tourism destinations, and related facilities; and establishes and runs service bureaus for various activities, such as promotion, management, marketing, land selling, and purchase of buildings, apartments, offices, shops, recreational parks, restaurants, and tourism destinations. It also designs, constructs, and maintains housing properties, hotels, apartments, offices, shops, and recreational parks, as well as tourism destinations, including restaurants, golf courses, and associated facilities. The company was formerly known as PT Adhibaladika and changed its name to PT Bukit Darmo Property Tbk in April 2007. PT Bukit Darmo Property Tbk was founded in 1989 and is based in Surabaya, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Surabaya"
    },
    "BKSL.JK": {
        "short_name": "Sentul City Tbk.",
        "long_name": "PT Sentul City Tbk",
        "summary": "PT Sentul City Tbk engages in the construction, real estate, and services activities in Indonesia. It operates through Real Estate and Other segments. The company develops and sells land, residential houses, shop houses, apartments, commercial buildings, etc. It is also involved in the town, and air/water management activities; amusement park and hospital management activities; apartment management activities; and operation of restaurants and tourism, as well as provision of parking services. The company was formerly known as PT. Bukit Sentul Tbk and changed its name to PT Sentul City Tbk in July 2006. PT Sentul City Tbk was founded in 1993 and is based in Jakarta, Indonesia. PT Sentul City Tbk is a subsidiary of PT Sakti Generasi Perdana.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "BSDE.JK": {
        "short_name": "Bumi Serpong Damai Tbk.",
        "long_name": "PT Bumi Serpong Damai Tbk",
        "summary": "PT Bumi Serpong Damai Tbk, together with its subsidiaries, engages in the real estate development activities in Indonesia. It operates through Real Estate, Property, Hotel, and Others segments. The company is developing the BSD City, a planned and integrated residential area with amenities/infrastructure, environmental facilities, and parks. It is also involved in the hotel operations; and leasing of office space. In addition, the company engages in the development of apartments and shopping centers. The company was founded in 1984 and is based in Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "CPRI.JK": {
        "short_name": "Capri Nusa Satu Properti Tbk.",
        "long_name": "PT Capri Nusa Satu Properti Tbk",
        "summary": "PT Capri Nusa Satu Properti Tbk engages in the property and real estate development business in Indonesia. It develops resorts; and meeting houses and office buildings. The company was founded in 2011 and is based in East Jakarta, Indonesia. PT Capri Nusa Satu Properti Tbk is a subsidiary of PT RDW Global Investasi.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Timur"
    },
    "CTRA.JK": {
        "short_name": "Ciputra Development Tbk.",
        "long_name": "PT Ciputra Development Tbk",
        "summary": "PT Ciputra Development Tbk, together with its subsidiaries, develops and sells real estate properties in Indonesia. The company operates through Real Estate, Rental, and Others segments. It develops and operates residential projects, including land lots, residential houses, shop houses, apartments, and strata title offices; and commercial projects, such as rental of commercial centers or mall, hotels, hospitals, golf courses, and water parks. The company was formerly known as PT Citra Habitat Indonesia and changed its name to PT Ciputra Development Tbk in December 1990. The company was founded in 1981 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "DADA.JK": {
        "short_name": "Diamond Citra Propertindo Tbk.",
        "long_name": "PT Diamond Citra Propertindo Tbk",
        "summary": "PT Diamond Citra Propertindo Tbk engages in the real estate business activities in Indonesia. It provides real estate agency and brokerage services, as well as real estate management and valuation services; operates as an intermediary for buying, selling, and leasing real estate properties; and holds real estate wills. The company also engages in buying, selling, leasing, and operating real estate, such as apartment and residential buildings, as well as exhibition halls, private storage facilities, malls, shopping centers, and other facilities; and the provision of houses and flats or apartments with or without furniture for permanent use. In addition, it is involved in the land sale, building development, and real estate lot division activities, as well as land and operation of residential areas for movable homes. The company was founded in 2014 and is headquartered in Depok, Indonesia. PT Diamond Citra Propertindo Tbk is a subsidiary of PT Karya Permata Inovasi Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Depok"
    },
    "DART.JK": {
        "short_name": "Duta Anggada Realty Tbk.",
        "long_name": "PT Duta Anggada Realty Tbk.",
        "summary": "PT Duta Anggada Realty Tbk. engages in the real estate development activities in Indonesia. It develops and rents apartments, office buildings, hotels, and shopping centers in Jakarta and Bali. The company also provides tourism hospitality services. The company was formerly known as PT Duta Anggada Inti Pratama and changed its name to PT Duta Anggada Realty Tbk. in April 1997. PT Duta Anggada Realty Tbk. was founded in 1983 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "DFAM.JK": {
        "short_name": "Dafam Property Indonesia Tbk.",
        "long_name": "PT Dafam Property Indonesia Tbk",
        "summary": "PT Dafam Property Indonesia Tbk engages in the property development activities in Indonesia. It develops residential properties; and provides hotel management services. The company was founded in 2011 and is headquartered in Semarang, Indonesia. PT Dafam Property Indonesia Tbk operates as a subsidiary of Pt Dafam.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Semarang"
    },
    "DIIA.F": {
        "short_name": "INTILAND DEVELOP.  RP 250",
        "long_name": "PT Intiland Development Tbk",
        "summary": "PT Intiland Development Tbk, together with its subsidiaries, develops, manages, sells, and invests in real estate properties in Indonesia. The company operates through four segments: Real Estate; Rental of Office Building and Apartments; Industrial Estate; and Facilities. Its property portfolio includes mixed-use and high-rise developments, residential estates, and industrial estates and investment properties in the Greater Jakarta and Surabaya. The company also sells houses and land; develops hotels; operates and manages golf courses; and manages industrial and techno parks, fitness centers, sports clubs, and restaurants. In addition, it engages in the telecommunication business. The company was formerly known as PT Dharmala Intiland Tbk and changed its name to PT Intiland Development Tbk in 2007. PT Intiland Development Tbk was founded in 1983 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "DILD.JK": {
        "short_name": "Intiland Development Tbk.",
        "long_name": "PT Intiland Development Tbk",
        "summary": "PT Intiland Development Tbk, together with its subsidiaries, develops, manages, sells, and invests in real estate properties in Indonesia. The company operates through four segments: Real Estate; Rental of Office Building and Apartments; Industrial Estate; and Facilities. Its property portfolio includes mixed-use and high-rise developments, residential estates, and industrial estates and investment properties in the Greater Jakarta and Surabaya. The company also sells houses and land; develops hotels; operates and manages golf courses; and manages industrial and techno parks, fitness centers, sports clubs, and restaurants. In addition, it engages in the telecommunication business. The company was formerly known as PT Dharmala Intiland Tbk and changed its name to PT Intiland Development Tbk in 2007. PT Intiland Development Tbk was founded in 1983 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "DMAS.JK": {
        "short_name": "Puradelta Lestari Tbk.",
        "long_name": "PT Puradelta Lestari Tbk",
        "summary": "PT Puradelta Lestari Tbk engages in the real estate development business in Indonesia. It operates through five segments: Industrial, Residential, Commercial, Hotel, and Rental. The company sells commercial lots and commercial products, including shop houses; residential products, such as landed houses; and develops investment properties of rental factories and hotels, as well as provides clean water supply, waste water treatment, and estate management services comprising cleaning, security, repair and maintenance, and other services. It also develops and manages Kota Deltamas, an integrated township of 3,177 hectares consisting of industrial, residential, and commercial estates. As of December 31, 2019, the company operated 18 residential clusters, seven rental factory units, and one hotel. The company was founded in 1993 and is headquartered in West Jakarta, Indonesia. PT Puradelta Lestari Tbk is a subsidiary of Sinarmas Land Limited.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "DUTI.JK": {
        "short_name": "Duta Pertiwi Tbk",
        "long_name": "PT Duta Pertiwi Tbk",
        "summary": "PT Duta Pertiwi Tbk primarily engages in the real estate business in Indonesia. The company operates through Real Estate, Property, Hotel, and Information Technology segments. It offers houses, shop houses, condominiums, apartments, office buildings, shopping centers, and other buildings, as well as land; and rents real estate properties. It also operates hotels and a recreation arena; and provides information technology services. PT Duta Pertiwi Tbk was founded in 1972 and is headquartered in Jakarta, Indonesia. PT Duta Pertiwi Tbk is a subsidiary of PT Bumi Serpong Damai Tbk.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "ELTY.JK": {
        "short_name": "Bakrieland Development Tbk.",
        "long_name": "PT Bakrieland Development Tbk",
        "summary": "PT Bakrieland Development Tbk. operates as an integrated property company in Indonesia. The company develops and sells land, housing, apartment/condominium, and office spaces; rents and manages office, spaces, and courts; manages the shopping centers and theme park; and operates hotels. It is also involved in the construction, trading, investment, and refinancing businesses; and the management of recreation and tourism areas, a sport center, buildings, apartments, and residential areas. In addition, the company provides food and beverage services. The company was formerly known as PT Elang Realty Tbk. and changed its name to PT Bakrieland Development Tbk. in April 1997. PT Bakrieland Development Tbk. was founded in 1990 and is headquartered in Jakarta Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "EMDE.JK": {
        "short_name": "Megapolitan Developments Tbk.",
        "long_name": "PT Megapolitan Developments Tbk",
        "summary": "PT Megapolitan Developments Tbk operates as a property development company in Indonesia. It develops shopping centers, housing estates, commercial districts, and business centers. The company was founded in 1976 and is headquartered in Jakarta, Indonesia. PT Megapolitan Developments Tbk is a subsidiary of PT Cosmopolitan Persada Developments.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "FMII.JK": {
        "short_name": "Fortune Mate Indonesia Tbk",
        "long_name": "PT Fortune Mate Indonesia Tbk",
        "summary": "PT Fortune Mate Indonesia Tbk, together with its subsidiaries, provides real estate development and construction services primarily in Indonesia. Its project portfolio includes office, industrial, and residential properties, as well as land. The company was founded in 1989 and is based in Surabaya, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Surabaya"
    },
    "FORZ.JK": {
        "short_name": "Forza Land Indonesia Tbk.",
        "long_name": "PT Forza Land Indonesia Tbk",
        "summary": "PT Forza Land Indonesia Tbk engages in the property development business in Indonesia. It primarily develops industrial estates, apartment buildings, condominiums, offices, and shops and facilities, as well as other residential projects. The company was formerly known as PT Megah Satu Properti and changed its name to PT Forza Land Indonesia Tbk in 2016. PT Forza Land Indonesia Tbk was founded in 2012 and is based in Jakarta Barat, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Barat"
    },
    "GAMA.JK": {
        "short_name": "Aksara Global Development Tbk.",
        "long_name": "PT Aksara Global Development Tbk",
        "summary": "PT Aksara Global Development Tbk develops real estate properties in Indonesia. The company operates through Apartments and Houses segments. Its property portfolio includes land, apartments, shop houses, houses, and other properties. The company also constructs buildings, bridges, roads, docks, housing buildings, schools, recreational parks, market or modern markets, hospitals, and other buildings; and offers consultation service in the areas of business and management, property, architecture, landscape, design and interior, civil, property agent, and others. In addition, it is involved in export and import, and wholesale trading activities; and the manufacture of building materials and construction tools. PT Aksara Global Development Tbk serves middle-class income families in second-tier cities and urban areas. The company was formerly known as PT Gading Development Tbk. The company was founded in 2003 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "GMTD.JK": {
        "short_name": "Gowa Makassar Tourism Developme",
        "long_name": "PT Gowa Makassar Tourism Development Tbk",
        "summary": "PT Gowa Makassar Tourism Development Tbk engages in the real estate and urban development activities in Indonesia. It operates in two segments, Real Estate and Supporting. The company develops residential and commercial buildings, hotels, recreational facilities, and non-commercial supporting facilities; and planned areas, facilities, and infrastructure. It also provides ready-to-build land for consumers; and services related to township management, as well as manages built facilities and infrastructure. The company was founded in 1991 and is headquartered in Makassar, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Makassar"
    },
    "GPRA.JK": {
        "short_name": "Perdana Gapuraprima Tbk.",
        "long_name": "PT Perdana Gapuraprima Tbk",
        "summary": "PT Perdana Gapuraprima Tbk develops real estate properties in Indonesia. The company develops shopping centers, offices, apartments, hotels, condotels, houses, commercial, and mixed used projects. It also engages in planning and supervising housing and building development activities, as well as purchasing and selling of buildings and land rights. The company was founded in 1987 and is based in South Jakarta, Indonesia. PT Perdana Gapuraprima Tbk is a subsidiary of PT Citraabadi Kotapersada.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    },
    "GWSA.JK": {
        "short_name": "Greenwood Sejahtera Tbk.",
        "long_name": "PT Greenwood Sejahtera Tbk",
        "summary": "PT Greenwood Sejahtera Tbk, together with its subsidiaries, develops real estate properties in Indonesia. It is also involved in the sale and rental of apartments, shopping centers, and offices; and operation of a hotel. The company was founded in 1990 and is headquartered in Central Jakarta, Indonesia. PT Greenwood Sejahtera Tbk is a subsidiary of PT Prima Permata Sejahtera.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Central Jakarta"
    },
    "HOMI.JK": {
        "short_name": "Grand House Mulia Tbk.",
        "long_name": "PT Grand House Mulia Tbk",
        "summary": "PT Grand House Mulia Tbk engages in operating residential and commercial properties in Indonesia. It also offers property development consulting service. The company was incorporated in 2006 and is based in Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "JRPT.JK": {
        "short_name": "Jaya Real Property Tbk.",
        "long_name": "PT Jaya Real Property, Tbk.",
        "summary": "PT Jaya Real Property Tbk, together with its subsidiaries, develops residential areas, and manages commercial properties in Indonesia. It operates through Sale of Land and Buildings, and Rental and Other Services segments. The Sale of Land and Buildings segment engages in the real estate and urban development activities; and release/purchase, processing, maturation, and development of facilities and infrastructure. The Rental and Other Services segment is involved in leasing of shopping centers and areas of the city, and the water management business. PT Jaya Real Property Tbk also provides general trading and construction, building management, and transportation services, as well as operates hotels. The company was founded in 1979 and is based in Tangerang, Indonesia. PT Jaya Real Property Tbk is a subsidiary of PT Pembangunan Jaya.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "JSPT.JK": {
        "short_name": "Jakarta Setiabudi Internasional",
        "long_name": "PT Jakarta Setiabudi Internasional Tbk",
        "summary": "PT Jakarta Setiabudi Internasional Tbk, together with its subsidiaries, engages in the hospitality and property businesses in Indonesia. It operates through Hotel, Real Estate, Rental of Office Space, and Rental of Retail Center segments. It offers hotel guestroom and restaurant services; sells land and/or buildings, and apartment units; and rents office space and retail centers. The company was founded in 1975 and is headquartered in Jakarta, Indonesia. PT Jakarta Setiabudi Internasional Tbk is a subsidiary of PT Jan Darmadi Investindo.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "KOTA.JK": {
        "short_name": "DMS Propertindo Tbk.",
        "long_name": "PT DMS Propertindo Tbk",
        "summary": "PT DMS Propertindo Tbk PT operates as a property development and hospitality management company in Indonesia. The company was founded in 2011 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    },
    "KPIG.JK": {
        "short_name": "MNC Land Tbk.",
        "long_name": "PT MNC Land Tbk",
        "summary": "PT MNC Land Tbk, together with its subsidiaries, rents office spaces and provides securities and other property services in Indonesia. The company also develops and operates real estate properties, such as hotels and resorts, golf courses, conventions, and theme parks. In addition, it offers property services, including building security, housekeeping, technical, and property management services; and manpower supply services. Further, PT MNC Land Tbk engages in the food and beverage business, and investment activities. The company was formerly known as PT Global Land Development Tbk and changed its name to PT MNC Land Tbk in 2012. The company was founded in 1990 and is based in Jakarta, Indonesia. PT MNC Land Tbk is a subsidiary of PT MNC Investama Tbk.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "LAND.JK": {
        "short_name": "Trimitra Propertindo Tbk.",
        "long_name": "PT Trimitra Propertindo Tbk",
        "summary": "PT Trimitra Propertindo Tbk, a property investment and development company, develops residential and commercial projects in Indonesia. The company engages in the construction of buildings, bridges, roads, installations, pipelines, residential areas, housing apartments, and hotel infrastructure. It also acts as a general contractor; and provides property trading and agency services. In addition, the company offers consulting services in the field of architecture, landscape, design and interior, and civil construction, as well as building and apartment engineering and maintenance services. Further, it operates three stars hotel. The company was founded in 2012 and is based in South Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Tangerang"
    },
    "LCW.SG": {
        "short_name": "PT LIPPO CIKARANG Registered Sh",
        "long_name": "PT Lippo Cikarang Tbk",
        "summary": "PT Lippo Cikarang Tbk, together with its subsidiaries, engages in the development of real estate and industrial estate projects in Indonesia. The company operates through Real Estate and Support Services segments. It is also involved in the provision of supporting services, including estate management, public transport, and recreation services. In addition, the company engages in construction, purchase, sale, lease, and operation of exhibition spaces, storage facilities, private buildings, malls, shopping centers, hospitals, conference halls, houses of worship, hotels, sports centers, golf courses, clubs, restaurants, entertainment venues, medical, laboratories, pharmacies, office buildings, and parking lots. Further, it offers clean and waste water management services; trading, development, and other services; and transportation, waste management, and recycling services. Additionally, the company is involved in the professional, scientific, and technical activities; and remediation, manpower and business support, and other business activities. PT Lippo Cikarang Tbk was founded in 1987 and is headquartered in Bekasi, Indonesia. PT Lippo Cikarang Tbk is a subsidiary of PT Kemuning Satiatama.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "LPCK.JK": {
        "short_name": "Lippo Cikarang Tbk",
        "long_name": "PT Lippo Cikarang Tbk",
        "summary": "PT Lippo Cikarang Tbk, together with its subsidiaries, engages in the development of real estate and industrial estate projects in Indonesia. The company operates through Real Estate and Support Services segments. It is also involved in the provision of supporting services, including estate management, public transport, and recreation services. In addition, the company engages in construction, purchase, sale, lease, and operation of exhibition spaces, storage facilities, private buildings, malls, shopping centers, hospitals, conference halls, houses of worship, hotels, sports centers, golf courses, clubs, restaurants, entertainment venues, medical, laboratories, pharmacies, office buildings, and parking lots. Further, it offers clean and waste water management services; trading, development, and other services; and transportation, waste management, and recycling services. Additionally, the company is involved in the professional, scientific, and technical activities; and remediation, manpower and business support, and other business activities. PT Lippo Cikarang Tbk was founded in 1987 and is headquartered in Bekasi, Indonesia. PT Lippo Cikarang Tbk is a subsidiary of PT Kemuning Satiatama.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "LPKR.JK": {
        "short_name": "Lippo Karawaci Tbk.",
        "long_name": "PT Lippo Karawaci Tbk",
        "summary": "PT Lippo Karawaci Tbk provides property development services in Indonesia. It operates in three segments: Real Estate Development, Real Estate Management & Services, and Fund Management/Investments. The Real Estate Development segment is involved in the real estate activities, including urban development; development of facilities and its infrastructure; and other investments, as well as large scale integrated development projects and its infrastructure development that include residential condominiums, commercial and entertainment areas, office towers, healthcare facilities, and education facilities. The Real Estate Management & Services segment manages retail malls, hotels, restaurants, and recreation centers; and provides health, town management, water and sewage treatment, transportation, firefighting, and maintenance services. The Fund Management/Investments segment engages in provision of management services and other activities. It also provides trading, printing, agriculture, mining, workshop, home care, installation, construction, gardening, bowling, golf, recreational, building construction and management, clean water and waste management, marketing, clinic and policlinic, and other related services, as well as healthcare and hospital services. In addition, the company engages in the plantation, forestry, electrical, mechanical, engineering, computer programming, trust, financing and financial entity, management consulting, cafe and catering, and tourism activities, as well as management of leased and strata-titled malls. As of December 31, 2019, it managed 41 leased malls and 10 strata-titled malls; 37 hospitals; and 17 food and beverage outlets. The company was formerly known as PT Tunggal Reksakencana. PT Lippo Karawaci Tbk was founded in 1990 and is based in Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "MKPI.JK": {
        "short_name": "Metropolitan Kentjana Tbk.",
        "long_name": "PT Metropolitan Kentjana Tbk",
        "summary": "PT Metropolitan Kentjana Tbk develops and manages lands and buildings in Indonesia. The company operates through Shopping Center, Office, Apartment, Real Estate, Air/Water Park, and Hotel segments. It also engages in the rental of space in shopping centers, office buildings, and apartments; and sale of land and buildings. The company was founded in 1972 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    },
    "MMLP.JK": {
        "short_name": "Mega Manunggal Property Tbk.",
        "long_name": "PT Mega Manunggal Property Tbk",
        "summary": "PT Mega Manunggal Property Tbk provides logistics facilities in Indonesia. It also leases warehouses and office spaces. The company was founded in 2010 and is based in East Jakarta, Indonesia. PT Mega Manunggal Property Tbk is a subsidiary of PT Mega Mandiri Properti.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "East Jakarta"
    },
    "MPRO.JK": {
        "short_name": "Maha Properti Indonesia Tbk.",
        "long_name": "PT Maha Properti Indonesia Tbk",
        "summary": "PT Maha Properti Indonesia Tbk engages in the real estate development business in Indonesia. It develops apartments, office buildings, townhouses, and shops. The company was formerly known as PT Propertindo Mulia Investama Tbk. PT Maha Properti Indonesia Tbk was founded in 2004 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "MTLA.JK": {
        "short_name": "Metropolitan Land Tbk.",
        "long_name": "PT Metropolitan Land Tbk",
        "summary": "PT Metropolitan Land Tbk, together with its subsidiaries, engages in the residential and commercial properties development businesses in Indonesia. It operates through Real Estate, Shopping Center, Hotel, and Others segments. The company's activities include land acquisition; real estate development; renting; leasing; hotels construction and operation; and sale of land, residential houses, shop-houses, apartments, condotels, and offices. It also owns and operates shopping centers, recreation centers, and sports centers. The company was founded in 1994 and is headquartered in Bekasi, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "MTSM.JK": {
        "short_name": "Metro Realty Tbk.",
        "long_name": "PT Metro Realty Tbk",
        "summary": "PT Metro Realty Tbk engages in property management and real estate development businesses in Indonesia. The company was formerly known as PT Metro Supermarket Realty Tbk and changed its name to PT Metro Realty Tbk in July 2009. PT Metro Realty Tbk was founded in 1980 and is based in Jakarta Pusat, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Pusat"
    },
    "NICK.JK": {
        "short_name": "Charnic Capital Tbk.",
        "long_name": "PT Charnic Capital Tbk",
        "summary": "PT Charnic Capital Tbk, an investment holding company, engages in the property business in Indonesia. It engages in office building management; rental services; and invests in shares of public and non-public companies. The company was founded in 2007 is based in Jakarta, Indonesia. PT Charnic Capital Tbk is a subsidiary of Pt Indovest Central.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "NIRO.JK": {
        "short_name": "City Retail Developments Tbk.",
        "long_name": "PT City Retail Developments Tbk",
        "summary": "PT City Retail Developments Tbk, through its subsidiaries, owns, develops, and operates shopping malls in Indonesia. The company operates through Shopping Mall, Real Estate, Hotel, and Others segments. It also engages in the building construction; rental; and hotel management activities, as well as investment business. Its real estate portfolio includes land kavling, condotel, and shop house buildings. The company was formerly known as PT Nirvana Development Tbk and changed its name to PT City Retail Developments Tbk in May 2018. PT City Retail Developments Tbk was founded in 2003 and is headquartered in South Jakarta, Indonesia. PT City Retail Developments Tbk is a subsidiary of PT Mega Inti Perdana Utama.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "NZIA.JK": {
        "short_name": "Nusantara Almazia Tbk.",
        "long_name": "PT Nusantara Almazia, Tbk.",
        "summary": "PT Nusantara Almazia, Tbk. engages in the property development business in Indonesia. It develops apartments, offices, hospitals, hotels, and schools. The company was founded in 2007 and is based in Karawang, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Karawang"
    },
    "OMRE.JK": {
        "short_name": "Indonesia Prima Property Tbk",
        "long_name": "PT Indonesia Prima Property Tbk",
        "summary": "PT Indonesia Prima Property Tbk, together with its subsidiaries, operates in the property sector in Indonesia. The company operates through Office Space Rental, Shopping Center Space Rental, Rental and Sale of Apartment, Hotel, and Sale of Residentials segments. It rents offices, shopping centers, and apartments, as well as develops hotels and residential properties. The company was formerly known as PT Ometraco Realty and changed its name to PT Indonesia Prima Property Tbk in 1996. The company was founded in 1983 and is headquartered in Jakarta, Indonesia. PT Indonesia Prima Property Tbk is a subsidiary of First Pacific Capital Group Limited.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "P04.F": {
        "short_name": "PAKUWON JATI  RP 25",
        "long_name": "PT Pakuwon Jati Tbk",
        "summary": "PT Pakuwon Jati Tbk operates as a real estate developer primarily in Jakarta and Surabaya, Indonesia. It operates through Office, Shopping Center Business, and Service Apartment; Real Estate; and Hospitality segments. The company is involved in the land acquisition, development, marketing, and operational management of properties. Its property portfolio comprises retail, residential, commercial, and hospitality developments, as well as mixed-use developments of retail shopping malls, offices, condominiums, and hotels. The company was founded in 1982 and is based in Surabaya, Indonesia. PT Pakuwon Jati Tbk is a subsidiary of PT. Pakuwon Arthaniaga.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Surabaya"
    },
    "PAMG.JK": {
        "short_name": "Bima Sakti Pertiwi Tbk.",
        "long_name": "PT Bima Sakti Pertiwi Tbk",
        "summary": "PT Bima Sakti Pertiwi Tbk operates as a property developer in Riau. The company was founded in 1980 and is based in Pekanbaru, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Pekanbaru"
    },
    "PLIN.JK": {
        "short_name": "Plaza Indonesia Realty Tbk.",
        "long_name": "PT Plaza Indonesia Realty Tbk",
        "summary": "PT Plaza Indonesia Realty Tbk primarily engages in shopping center rental business in Indonesia. It operates through three segments: Shopping Center, Office Tower Rental, and Hotel Management. The company operates hotels, as well as rents office spaces and apartments. It also manages lifestyle center. The company was formerly known as PT Bimantara Eka Santosa and changed its name to PT Plaza Indonesia Realty Tbk in December 1990. PT Plaza Indonesia Realty Tbk was founded in 1983 and is based in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Pusat"
    },
    "POLI.JK": {
        "short_name": "Pollux Investasi Internasional ",
        "long_name": "PT Pollux Investasi Internasional, Tbk",
        "summary": "PT Pollux Investasi Internasional, Tbk, through its subsidiaries, operates in the property and real estate sector in Indonesia. It is involved in the management and rental of buildings, offices, malls, hotels, shophouses, and amusement parks; property management and development activities; hospitality business; and construction and apartment management activities. The company was formerly known as PT Royal Royce Properties and changed its name to PT Pollux Investasi Internasional, Tbk. PT Pollux Investasi Internasional, Tbk was founded in 2009 and is based in South Jakarta, Indonesia. PT Pollux Investasi Internasional, Tbk is a subsidiary of PT World Apparel.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    },
    "POLL.JK": {
        "short_name": "Pollux Properti Indonesia Tbk.",
        "long_name": "PT Pollux Properti Indonesia Tbk",
        "summary": "PT Pollux Properti Indonesia Tbk operates as a property developer in Indonesia. It operates through Office, Apartment, Hotel, and Others segments. The company develops apartments, condominiums, offices, shopping centers, hospitals, hotels, convention centers, housing, and industrial estates. It also purchases, sells, leases, and operates real estate properties, as well as offers real estate services, such as agents, real estate brokers, and purchasing intermediaries. In addition, the company provides specialist clinic, general polyclinic, medical center, and stem cell laboratory services. Further, it engages in the construction, mining, and transportation businesses. The company was founded in 2014 and is headquartered in South Jakarta, Indonesia. PT Pollux Properti Indonesia, Tbk is a subsidiary of PT Borneo Melawai Perkasa.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "PPRO.JK": {
        "short_name": "PP Properti Tbk.",
        "long_name": "PT Pembangunan Perumahan Properti Tbk",
        "summary": "PT Pembangunan Perumahan Properti Tbk engages in the property development, hospitality, and building construction businesses primarily in Indonesia. The company's portfolio includes housing, office, apartment, as well as retail and commercial properties. It also manages hotels, including Park Hotel Jakarta located in East Jakarta district; and PRIME PARK hotels in Pekanbaru and Bandung; and Swiss-Belhotel Balikpapan located in Balikpapan's central business district and government center. The company was founded in 2013 and is based in East Jakarta, Indonesia. PT Pembangunan Perumahan Properti Tbk is a subsidiary of PT Pembangunan Perumahan (Persero) Tbk.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "East Jakarta"
    },
    "PTLKF": {
        "short_name": "LIPPO KARAWACI",
        "long_name": "PT Lippo Karawaci Tbk",
        "summary": "PT Lippo Karawaci Tbk provides property development services in Indonesia. It operates in three segments: Real Estate Development, Real Estate Management & Services, and Fund Management/Investments. The Real Estate Development segment is involved in the real estate activities, including urban development; development of facilities and its infrastructure; and other investments, as well as large scale integrated development projects and its infrastructure development that include residential condominiums, commercial and entertainment areas, office towers, healthcare facilities, and education facilities. The Real Estate Management & Services segment manages retail malls, hotels, restaurants, and recreation centers; and provides health, town management, water and sewage treatment, transportation, firefighting, and maintenance services. The Fund Management/Investments segment engages in provision of management services and other activities. It also provides trading, printing, agriculture, mining, workshop, home care, installation, construction, gardening, bowling, golf, recreational, building construction and management, clean water and waste management, marketing, clinic and policlinic, and other related services, as well as healthcare and hospital services. In addition, the company engages in the plantation, forestry, electrical, mechanical, engineering, computer programming, trust, financing and financial entity, management consulting, cafe and catering, and tourism activities, as well as management of leased and strata-titled malls. As of December 31, 2019, it managed 41 leased malls and 10 strata-titled malls; 37 hospitals; and 17 food and beverage outlets. The company was formerly known as PT Tunggal Reksakencana. PT Lippo Karawaci Tbk was founded in 1990 and is based in Tangerang, Indonesia.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "PUDP.JK": {
        "short_name": "Pudjiadi Prestige Tbk.",
        "long_name": "PT Pudjiadi Prestige Tbk",
        "summary": "PT Pudjiadi Prestige Tbk engages in the real estate development activities in Indonesia. It operates through Apartement Rental and Real Estate, and Hotel segments. The company sells apartments, office buildings, houses, and shophouses, as well as other buildings, such as land. It is also involved in the construction activities; and the rental of space/apartments. In addition, the company owns and operates hotels; and provides building management services. PT Pudjiadi Prestige Tbk was founded in 1980 and is based in Jakarta, Indonesia. PT Pudjiadi Prestige Tbk is a subsidiary of PT Istana Kuta Ratu Prestige.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PUWA.F": {
        "short_name": "CIPUTRA DEV.  RP 250",
        "long_name": "PT Ciputra Development Tbk",
        "summary": "PT Ciputra Development Tbk, together with its subsidiaries, develops and sells real estate properties in Indonesia. The company operates through Real Estate, Rental, and Others segments. It develops and operates residential projects, including land lots, residential houses, shop houses, apartments, and strata title offices; and commercial projects, such as rental of commercial centers or mall, hotels, hospitals, golf courses, and water parks. The company was formerly known as PT Citra Habitat Indonesia and changed its name to PT Ciputra Development Tbk in December 1990. The company was founded in 1981 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PWON.JK": {
        "short_name": "Pakuwon Jati Tbk.",
        "long_name": "PT Pakuwon Jati Tbk",
        "summary": "PT Pakuwon Jati Tbk operates as a real estate developer primarily in Jakarta and Surabaya, Indonesia. It operates through Office, Shopping Center Business, and Service Apartment; Real Estate; and Hospitality segments. The company is involved in the land acquisition, development, marketing, and operational management of properties. Its property portfolio comprises retail, residential, commercial, and hospitality developments, as well as mixed-use developments of retail shopping malls, offices, condominiums, and hotels. The company was founded in 1982 and is based in Surabaya, Indonesia. PT Pakuwon Jati Tbk is a subsidiary of PT. Pakuwon Arthaniaga.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Surabaya"
    },
    "RBMS.JK": {
        "short_name": "Ristia Bintang Mahkotasejati Tb",
        "long_name": "PT Ristia Bintang Mahkotasejati Tbk",
        "summary": "PT Ristia Bintang Mahkotasejati Tbk develops housing projects in Indonesia. It sells residential buildings and land plots. The company develops housing projects under the name of Bintang Metropol in Bekasi, Mahkota Simprug in Tangerang, and Saung Riung in Karawang. PT Ristia Bintang Mahkotasejati Tbk was founded in 1985 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "RDTX.JK": {
        "short_name": "Roda Vivatex Tbk",
        "long_name": "PT Roda Vivatex Tbk",
        "summary": "PT Roda Vivatex Tbk, through its subsidiaries, engages in the rental of office spaces in Indonesia. The company was founded in 1980 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "REAL.JK": {
        "short_name": "Repower Asia Indonesia Tbk.",
        "long_name": "PT Repower Asia Indonesia Tbk",
        "summary": "PT Repower Asia Indonesia Tbk engages in the real estate property business in Indonesia. The company purchases, sells, leases, and operates real estate properties, such as apartment buildings, residential buildings, exhibition grounds, personal storage facilities, malls, shopping centers, and others. The company was founded in 2011 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    },
    "RISE.JK": {
        "short_name": "Jaya Sukses Makmur Sentosa Tbk.",
        "long_name": "PT Jaya Sukses Makmur Sentosa Tbk",
        "summary": "PT Jaya Sukses Makmur Sentosa Tbk operates as a property developer in Indonesia. It develops and leases residential properties; and commercial properties, such as apartments, shopping centers, hotels, offices, industrial land, and warehouse properties. The company was founded in 2003 and is based in Sidoarjo, Indonesia.PT Jaya Sukses Makmur Sentosa Tbk is a subsidiary of PT Tancorp Global Sentosa.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Sidoarjo"
    },
    "ROCK.JK": {
        "short_name": "Rockfields Properti Indonesia T",
        "long_name": "PT Rockfields Properti Indonesia Tbk.",
        "summary": "PT Rockfields Properti Indonesia Tbk. develops real estate properties. It designs, develops, markets, and manages commercial and residential real estate projects. The company was founded in 2013 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "RODA.JK": {
        "short_name": "Pikko Land Development Tbk.",
        "long_name": "PT Pikko Land Development Tbk",
        "summary": "PT Pikko Land Development Tbk develops and sells real estate properties in Indonesia. It also invests in shares of stocks, and various property assets, such as land and apartment units. The company was formerly known as PT Royal Oak Development Asia Tbk and changed its name to PT Pikko Land Development Tbk in October 2012. The company was founded in 1984 and is headquartered in Jakarta Pusat, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Pusat"
    },
    "RZU.F": {
        "short_name": "SUMMARECON  RP 500",
        "long_name": "PT Summarecon Agung Tbk",
        "summary": "PT Summarecon Agung Tbk engages in the development and management of real estate properties in Indonesia. The company operates through Property Development, Investment Property, Leisure and Hospitality, and Others segments. It develops and sells houses, commercial buildings, apartments, and residential land and commercial shop plots; manages and leases properties; and provides recreational club facilities. The company develops townships; rents shophouses and office buildings; owns leisure and hospitality facilities, such as sports clubs and hotels; and provides health and estate management services. In addition, it manages residential apartments, offices, and other building facilities; and develops infrastructure facilities. Further, the company operates gas stations and hospitals; retails food and beverages; and provides education, as well as trading services. PT Summarecon Agung Tbk was founded in 1975 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta Timur"
    },
    "SATU.JK": {
        "short_name": "Kota Satu Properti Tbk.",
        "long_name": "PT Kota Satu Properti Tbk",
        "summary": "PT Kota Satu Properti Tbk engages in property development activities in Indonesia. The company also engages in the management and trading of real estate property; land transportation; agriculture; provision of accommodation in the form of hotels and lodging services; and printing and workshop businesses. It also operates hotels under the allstay name and provides hotel management services. The company was founded in 2012 and is based in Semarang, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Semarang"
    },
    "SMDM.JK": {
        "short_name": "Suryamas Dutamakmur Tbk.",
        "long_name": "PT Suryamas Dutamakmur Tbk",
        "summary": "PT Suryamas Dutamakmur Tbk engages in the real estate activities in Indonesia. It operates through Real Estate and Property, Golf and Country Club, Estate Management, Hotel, and Investment and Others segments. The company is involved in the sale of land and houses; and operation of the golf courses, country clubs, hotels, and other resort facilities located in Rancamaya, Bogor, West Java. The company was founded in 1989 and is headquartered in Jakarta, Indonesia. PT Suryamas Dutamakmur Tbk is a subsidiary of Top Global Limited.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "SMRA.JK": {
        "short_name": "Summarecon Agung Tbk.",
        "long_name": "PT Summarecon Agung Tbk",
        "summary": "PT Summarecon Agung Tbk engages in the development and management of real estate properties in Indonesia. The company operates through Property Development, Investment Property, Leisure and Hospitality, and Others segments. It develops and sells houses, commercial buildings, apartments, and residential land and commercial shop plots; manages and leases properties; and provides recreational club facilities. The company develops townships; rents shophouses and office buildings; owns leisure and hospitality facilities, such as sports clubs and hotels; and provides health and estate management services. In addition, it manages residential apartments, offices, and other building facilities; and develops infrastructure facilities. Further, the company operates gas stations and hospitals; retails food and beverages; and provides education, as well as trading services. PT Summarecon Agung Tbk was founded in 1975 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Timur"
    },
    "TAMA.JK": {
        "short_name": "Lancartama Sejati Tbk.",
        "long_name": "PT Lancartama Sejati Tbk",
        "summary": "PT Lancartama Sejati TBK provides construction services in Indonesia. It operates as a general contractor for residential and commercial properties, as well as an infrastructural contractor for agricultural and manufacture companies. The company was founded in 1990 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "TARA.JK": {
        "short_name": "Agung Semesta Sejahtera Tbk.",
        "long_name": "PT Sitara Propertindo Tbk",
        "summary": "PT Sitara Propertindo Tbk primarily engages in the development of properties in Indonesia. The company constructs commercial and residential properties. PT Sitara Propertindo Tbk company was founded in 2006 and is headquartered in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Diversified",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "West Jakarta"
    },
    "TRIN.JK": {
        "short_name": "Perintis Triniti Properti Tbk.",
        "long_name": "PT Perintis Triniti Properti Tbk",
        "summary": "PT Perintis Triniti Properti Tbk engages in the real estate business in Indonesia. It purchases, sells, rents, and leases real estate, as well as sells land. The company develops and sells apartments, mixed use properties, office buildings, houses, shophouses, and other buildings. It also offers marketing services. The company was founded in 2009 and is based in Tangerang Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang Selatan"
    },
    "UANG.JK": {
        "short_name": "Pakuan Tbk.",
        "long_name": "PT Pakuan, Tbk",
        "summary": "PT Pakuan, Tbk. operates as a property developer in the residential and commercial sectors in Indonesia. It also manages Sawangan golf courses; and hotels and resorts. The company was founded in 1971 and is headquartered in Depok, Indonesia. PT Pakuan, Tbk operates as a subsidiary of Pt Sawangan Investasi Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Depok"
    },
    "URBN.JK": {
        "short_name": "Urban Jakarta Propertindo Tbk.",
        "long_name": "PT Urban Jakarta Propertindo Tbk",
        "summary": "PT Urban Jakarta Propertindo Tbk engages in the property development activities in Indonesia. It develops and/or manages office areas, shopping centers, and apartments that are integrated directly with mass transportation. The company was founded in 1995 and is based in South Jakarta, Indonesia. PT Urban Jakarta Propertindo Tbk is a subsidiary of PT Nusa Wijaya Propertindo.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    }
}