{
    "8AS.SG": {
        "short_name": "Alam Sutera Realty Tbk PT Regis",
        "long_name": "PT Alam Sutera Realty Tbk",
        "summary": "PT Alam Sutera Realty Tbk operates as an integrated property developer in Indonesia. The company is involved in the development and management of residential areas, commercial districts, industrial areas, shopping centers, and leisure centers, as well as hospitality facilities. It also provides building management, consultancy, investment, and business management services, as well as money lending services; operates tourism area; and sells goods. The company was formerly known as PT Adhihutama Manunggal and changed its name to PT Alam Sutera Realty Tbk in September 2007. PT Alam Sutera Realty Tbk was founded in 1993 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "AKKU.JK": {
        "short_name": "Anugerah Kagum Karya Utama Tbk.",
        "long_name": "PT Anugerah Kagum Karya Utama Tbk",
        "summary": "PT Anugerah Kagum Karya Utama Tbk, through its subsidiaries, engages in general trading business in Indonesia. The company offers business, management, and administration consulting; mining operations support; general mining management; and hotel management. It is also involved in the rental of heavy equipment. The company was formerly known as PT Alam Karya Unggul Tbk and changed its name to PT Anugerah Kagum Karya Utama Tbk in October 2016. The company was incorporated in 2001 and is headquartered in Jakarta, Indonesia. PT Anugerah Kagum Karya Utama Tbk is a subsidiary of PT Eka Mandiri Anugerah Sejahtera.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "ASRI.JK": {
        "short_name": "Alam Sutera Realty Tbk.",
        "long_name": "PT Alam Sutera Realty Tbk",
        "summary": "PT Alam Sutera Realty Tbk operates as an integrated property developer in Indonesia. The company is involved in the development and management of residential areas, commercial districts, industrial areas, shopping centers, and leisure centers, as well as hospitality facilities. It also provides building management, consultancy, investment, and business management services, as well as money lending services; operates tourism area; and sells goods. The company was formerly known as PT Adhihutama Manunggal and changed its name to PT Alam Sutera Realty Tbk in September 2007. PT Alam Sutera Realty Tbk was founded in 1993 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "B73.SG": {
        "short_name": "Bekasi Fajar Ind.Estate Tbk PTR",
        "long_name": "PT Bekasi Fajar Industrial Estate Tbk",
        "summary": "PT Bekasi Fajar Industrial Estate Tbk develops, constructs, and manages industrial estates and properties in Indonesia. The company provides industrial estate land lots that are ready for construction; and infrastructure maintaining and supporting services. It also develops coffee shops, restaurants, hotels, etc. The company was founded in 1989 and is based in Bekasi, Indonesia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "BEST.JK": {
        "short_name": "Bekasi Fajar Industrial Estate ",
        "long_name": "PT Bekasi Fajar Industrial Estate Tbk",
        "summary": "PT Bekasi Fajar Industrial Estate Tbk develops, constructs, and manages industrial estates and properties in Indonesia. The company provides industrial estate land lots that are ready for construction; and infrastructure maintaining and supporting services. It also develops coffee shops, restaurants, hotels, etc. The company was founded in 1989 and is based in Bekasi, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "BKDP.JK": {
        "short_name": "Bukit Darmo Property Tbk",
        "long_name": "PT Bukit Darmo Property Tbk",
        "summary": "PT Bukit Darmo Property Tbk engages in construction, development, trade, and investment activities in Indonesia. It operates through Real Estate, Shopping Mall, Construction, and Marketing Services segments. The company constructs and develops apartments, offices, shops, recreational parks, tourism destinations, and related facilities; and establishes and runs service bureaus for various activities, such as promotion, management, marketing, land selling, and purchase of buildings, apartments, offices, shops, recreational parks, restaurants, and tourism destinations. It also designs, constructs, and maintains housing properties, hotels, apartments, offices, shops, and recreational parks, as well as tourism destinations, including restaurants, golf courses, and associated facilities. The company was formerly known as PT Adhibaladika and changed its name to PT Bukit Darmo Property Tbk in April 2007. PT Bukit Darmo Property Tbk was founded in 1989 and is based in Surabaya, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Surabaya"
    },
    "CTRA.JK": {
        "short_name": "Ciputra Development Tbk.",
        "long_name": "PT Ciputra Development Tbk",
        "summary": "PT Ciputra Development Tbk, together with its subsidiaries, develops and sells real estate properties in Indonesia. The company operates through Real Estate, Rental, and Others segments. It develops and operates residential projects, including land lots, residential houses, shop houses, apartments, and strata title offices; and commercial projects, such as rental of commercial centers or mall, hotels, hospitals, golf courses, and water parks. The company was formerly known as PT Citra Habitat Indonesia and changed its name to PT Ciputra Development Tbk in December 1990. The company was founded in 1981 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "DADA.JK": {
        "short_name": "Diamond Citra Propertindo Tbk.",
        "long_name": "PT Diamond Citra Propertindo Tbk",
        "summary": "PT Diamond Citra Propertindo Tbk engages in the real estate business activities in Indonesia. It provides real estate agency and brokerage services, as well as real estate management and valuation services; operates as an intermediary for buying, selling, and leasing real estate properties; and holds real estate wills. The company also engages in buying, selling, leasing, and operating real estate, such as apartment and residential buildings, as well as exhibition halls, private storage facilities, malls, shopping centers, and other facilities; and the provision of houses and flats or apartments with or without furniture for permanent use. In addition, it is involved in the land sale, building development, and real estate lot division activities, as well as land and operation of residential areas for movable homes. The company was founded in 2014 and is headquartered in Depok, Indonesia. PT Diamond Citra Propertindo Tbk is a subsidiary of PT Karya Permata Inovasi Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Depok"
    },
    "DART.JK": {
        "short_name": "Duta Anggada Realty Tbk.",
        "long_name": "PT Duta Anggada Realty Tbk.",
        "summary": "PT Duta Anggada Realty Tbk. engages in the real estate development activities in Indonesia. It develops and rents apartments, office buildings, hotels, and shopping centers in Jakarta and Bali. The company also provides tourism hospitality services. The company was formerly known as PT Duta Anggada Inti Pratama and changed its name to PT Duta Anggada Realty Tbk. in April 1997. PT Duta Anggada Realty Tbk. was founded in 1983 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "DFAM.JK": {
        "short_name": "Dafam Property Indonesia Tbk.",
        "long_name": "PT Dafam Property Indonesia Tbk",
        "summary": "PT Dafam Property Indonesia Tbk engages in the property development activities in Indonesia. It develops residential properties; and provides hotel management services. The company was founded in 2011 and is headquartered in Semarang, Indonesia. PT Dafam Property Indonesia Tbk operates as a subsidiary of Pt Dafam.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Semarang"
    },
    "ELTY.JK": {
        "short_name": "Bakrieland Development Tbk.",
        "long_name": "PT Bakrieland Development Tbk",
        "summary": "PT Bakrieland Development Tbk. operates as an integrated property company in Indonesia. The company develops and sells land, housing, apartment/condominium, and office spaces; rents and manages office, spaces, and courts; manages the shopping centers and theme park; and operates hotels. It is also involved in the construction, trading, investment, and refinancing businesses; and the management of recreation and tourism areas, a sport center, buildings, apartments, and residential areas. In addition, the company provides food and beverage services. The company was formerly known as PT Elang Realty Tbk. and changed its name to PT Bakrieland Development Tbk. in April 1997. PT Bakrieland Development Tbk. was founded in 1990 and is headquartered in Jakarta Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "EMDE.JK": {
        "short_name": "Megapolitan Developments Tbk.",
        "long_name": "PT Megapolitan Developments Tbk",
        "summary": "PT Megapolitan Developments Tbk operates as a property development company in Indonesia. It develops shopping centers, housing estates, commercial districts, and business centers. The company was founded in 1976 and is headquartered in Jakarta, Indonesia. PT Megapolitan Developments Tbk is a subsidiary of PT Cosmopolitan Persada Developments.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "JRPT.JK": {
        "short_name": "Jaya Real Property Tbk.",
        "long_name": "PT Jaya Real Property, Tbk.",
        "summary": "PT Jaya Real Property, Tbk., together with its subsidiaries, develops residential areas and manages commercial properties in Indonesia. It operates through Sale of Land and Buildings, and Rental and Other Services segments. The Sale of Land and Buildings segment engages in the real estate and urban development activities; and release/purchase, processing, maturation, and development of facilities and infrastructure. The Rental and Other Services segment is involved in leasing of shopping centers and areas of the city, and the water management business. It also provides general trading and construction, building management, and transportation services, as well as operates hotels. The company was founded in 1979 and is based in Tangerang, Indonesia. PT Jaya Real Property, Tbk. is a subsidiary of PT Pembangunan Jaya.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "JSPT.JK": {
        "short_name": "Jakarta Setiabudi Internasional",
        "long_name": "PT Jakarta Setiabudi Internasional Tbk",
        "summary": "PT Jakarta Setiabudi Internasional Tbk, together with its subsidiaries, engages in the hospitality and property businesses in Indonesia. It operates through Hotel, Real Estate, Rental of Office Space, and Rental of Retail Center segments. It offers hotel guestroom and restaurant services; sells land and/or buildings, and apartment units; and rents office space and retail centers. The company was founded in 1975 and is headquartered in Jakarta, Indonesia. PT Jakarta Setiabudi Internasional Tbk is a subsidiary of PT Jan Darmadi Investindo.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "KOTA.JK": {
        "short_name": "DMS Propertindo Tbk.",
        "long_name": "PT DMS Propertindo Tbk",
        "summary": "PT DMS Propertindo Tbk PT operates as a property development and hospitality management company in Indonesia. The company was founded in 2011 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    },
    "KPIG.JK": {
        "short_name": "MNC Land Tbk.",
        "long_name": "PT MNC Land Tbk",
        "summary": "PT MNC Land Tbk, together with its subsidiaries, rents office spaces and provides securities and other property services in Indonesia. The company also develops and operates real estate properties, such as hotels and resorts, golf courses, conventions, and theme parks. In addition, it offers property services, including building security, housekeeping, technical, and property management services; and manpower supply services. Further, PT MNC Land Tbk engages in the food and beverage business, and investment activities. The company was formerly known as PT Global Land Development Tbk and changed its name to PT MNC Land Tbk in 2012. The company was founded in 1990 and is based in Jakarta, Indonesia. PT MNC Land Tbk is a subsidiary of PT MNC Investama Tbk.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "LAND.JK": {
        "short_name": "Trimitra Propertindo Tbk.",
        "long_name": "PT Trimitra Propertindo Tbk",
        "summary": "PT Trimitra Propertindo Tbk, a property investment and development company, develops residential and commercial projects in Indonesia. The company engages in the construction of buildings, bridges, roads, installations, pipelines, residential areas, housing apartments, and hotel infrastructure. It also acts as a general contractor; and provides property trading and agency services. In addition, the company offers consulting services in the field of architecture, landscape, design and interior, and civil construction, as well as building and apartment engineering and maintenance services. Further, it operates three stars hotel. The company was founded in 2012 and is based in South Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Tangerang"
    },
    "MKPI.JK": {
        "short_name": "Metropolitan Kentjana Tbk.",
        "long_name": "PT Metropolitan Kentjana Tbk",
        "summary": "PT Metropolitan Kentjana Tbk develops and manages lands and buildings in Indonesia. The company operates through Shopping Center, Office, Apartment, Real Estate, Air/Water Park, and Hotel segments. It also engages in the rental of space in shopping centers, office buildings, and apartments; and sale of land and buildings. The company was founded in 1972 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    },
    "MMLP.JK": {
        "short_name": "Mega Manunggal Property Tbk.",
        "long_name": "PT Mega Manunggal Property Tbk",
        "summary": "PT Mega Manunggal Property Tbk provides logistics facilities in Indonesia. It also leases warehouses and office spaces. The company was founded in 2010 and is based in East Jakarta, Indonesia. PT Mega Manunggal Property Tbk is a subsidiary of PT Mega Mandiri Properti.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "East Jakarta"
    },
    "MTLA.JK": {
        "short_name": "Metropolitan Land Tbk.",
        "long_name": "PT Metropolitan Land Tbk",
        "summary": "PT Metropolitan Land Tbk, together with its subsidiaries, engages in the residential and commercial properties development businesses in Indonesia. It operates through Real Estate, Shopping Center, Hotel, and Others segments. The company's activities include land acquisition; real estate development; renting; leasing; hotels construction and operation; and sale of land, residential houses, shop-houses, apartments, condotels, and offices. It also owns and operates shopping centers, recreation centers, and sports centers. The company was founded in 1994 and is headquartered in Bekasi, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "MTSM.JK": {
        "short_name": "Metro Realty Tbk.",
        "long_name": "PT Metro Realty Tbk",
        "summary": "PT Metro Realty Tbk engages in property management and real estate development businesses in Indonesia. The company was formerly known as PT Metro Supermarket Realty Tbk and changed its name to PT Metro Realty Tbk in July 2009. PT Metro Realty Tbk was founded in 1980 and is based in Jakarta Pusat, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Pusat"
    },
    "NICK.JK": {
        "short_name": "Charnic Capital Tbk.",
        "long_name": "PT Charnic Capital Tbk",
        "summary": "PT Charnic Capital Tbk, an investment holding company, engages in the property business in Indonesia. It engages in office building management; rental services; and invests in shares of public and non-public companies. The company was founded in 2007 is based in Jakarta, Indonesia. PT Charnic Capital Tbk is a subsidiary of Pt Indovest Central.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "NIRO.JK": {
        "short_name": "City Retail Developments Tbk.",
        "long_name": "PT City Retail Developments Tbk",
        "summary": "PT City Retail Developments Tbk, through its subsidiaries, owns, develops, and operates shopping malls in Indonesia. The company operates through Shopping Mall, Real Estate, Hotel, and Others segments. It also engages in the building construction; rental; and hotel management activities, as well as investment business. Its real estate portfolio includes land kavling, condotel, and shop house buildings. The company was formerly known as PT Nirvana Development Tbk and changed its name to PT City Retail Developments Tbk in May 2018. PT City Retail Developments Tbk was founded in 2003 and is headquartered in South Jakarta, Indonesia. PT City Retail Developments Tbk is a subsidiary of PT Mega Inti Perdana Utama.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "OMRE.JK": {
        "short_name": "Indonesia Prima Property Tbk",
        "long_name": "PT Indonesia Prima Property Tbk",
        "summary": "PT Indonesia Prima Property Tbk, together with its subsidiaries, operates in the property sector in Indonesia. The company operates through Office Space Rental, Shopping Center Space Rental, Rental and Sale of Apartment, Hotel, and Sale of Residentials segments. It rents offices, shopping centers, and apartments, as well as develops hotels and residential properties. The company was formerly known as PT Ometraco Realty and changed its name to PT Indonesia Prima Property Tbk in 1996. The company was founded in 1983 and is headquartered in Jakarta, Indonesia. PT Indonesia Prima Property Tbk is a subsidiary of First Pacific Capital Group Limited.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "P04.F": {
        "short_name": "PAKUWON JATI  RP 25",
        "long_name": "PT Pakuwon Jati Tbk",
        "summary": "PT Pakuwon Jati Tbk operates as a real estate developer primarily in Jakarta and Surabaya, Indonesia. It operates through Office, Shopping Center Business, and Service Apartment; Real Estate; and Hospitality segments. The company is involved in the land acquisition, development, marketing, and operational management of properties. Its property portfolio comprises retail, residential, commercial, and hospitality developments, as well as mixed-use developments of retail shopping malls, offices, condominiums, and hotels. The company was founded in 1982 and is based in Surabaya, Indonesia. PT Pakuwon Jati Tbk is a subsidiary of PT. Pakuwon Arthaniaga.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Surabaya"
    },
    "PUDP.JK": {
        "short_name": "Pudjiadi Prestige Tbk.",
        "long_name": "PT Pudjiadi Prestige Tbk",
        "summary": "PT Pudjiadi Prestige Tbk engages in the real estate development activities in Indonesia. It operates through Apartement Rental and Real Estate, and Hotel segments. The company sells apartments, office buildings, houses, and shophouses, as well as other buildings, such as land. It is also involved in the construction activities; and the rental of space/apartments. In addition, the company owns and operates hotels; and provides building management services. PT Pudjiadi Prestige Tbk was founded in 1980 and is based in Jakarta, Indonesia. PT Pudjiadi Prestige Tbk is a subsidiary of PT Istana Kuta Ratu Prestige.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PUWA.F": {
        "short_name": "CIPUTRA DEV.  RP 250",
        "long_name": "PT Ciputra Development Tbk",
        "summary": "PT Ciputra Development Tbk, together with its subsidiaries, develops and sells real estate properties in Indonesia. The company operates through Real Estate, Rental, and Others segments. It develops and operates residential projects, including land lots, residential houses, shop houses, apartments, and strata title offices; and commercial projects, such as rental of commercial centers or mall, hotels, hospitals, golf courses, and water parks. The company was formerly known as PT Citra Habitat Indonesia and changed its name to PT Ciputra Development Tbk in December 1990. The company was founded in 1981 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PWON.JK": {
        "short_name": "Pakuwon Jati Tbk.",
        "long_name": "PT Pakuwon Jati Tbk",
        "summary": "PT Pakuwon Jati Tbk operates as a real estate developer primarily in Jakarta and Surabaya, Indonesia. It operates through Office, Shopping Center Business, and Service Apartment; Real Estate; and Hospitality segments. The company is involved in the land acquisition, development, marketing, and operational management of properties. Its property portfolio comprises retail, residential, commercial, and hospitality developments, as well as mixed-use developments of retail shopping malls, offices, condominiums, and hotels. The company was founded in 1982 and is based in Surabaya, Indonesia. PT Pakuwon Jati Tbk is a subsidiary of PT. Pakuwon Arthaniaga.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Surabaya"
    },
    "RDTX.JK": {
        "short_name": "Roda Vivatex Tbk",
        "long_name": "PT Roda Vivatex Tbk",
        "summary": "PT Roda Vivatex Tbk, through its subsidiaries, engages in the rental of office spaces in Indonesia. The company was founded in 1980 and is headquartered in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    },
    "UANG.JK": {
        "short_name": "Pakuan Tbk.",
        "long_name": "PT Pakuan, Tbk",
        "summary": "PT Pakuan, Tbk. operates as a property developer in the residential and commercial sectors in Indonesia. It also manages Sawangan golf courses; and hotels and resorts. The company was founded in 1971 and is headquartered in Depok, Indonesia. PT Pakuan, Tbk operates as a subsidiary of Pt Sawangan Investasi Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Depok"
    }
}