{
    "1FZA.F": {
        "short_name": "FORESIGHT AUT.SP.ADR IS 1",
        "long_name": "Foresight Autonomous Holdings Ltd.",
        "summary": "Foresight Autonomous Holdings Ltd., a technology company, engages in the design, development, and commercialization of sensor systems for the automotive industry. It develops in-line-of-sight vision systems and beyond-line-of-site cellular-based applications. The company offers QuadSight system, a quad-camera multi-spectral vision system for the semi-autonomous and autonomous vehicle market; V2X (vehicle-to-everything), an accident prevention solution based on real-time multi-agents positioning algorithms that enables communication between vehicles, infrastructure, grid, home, and network; and Eye-Net Protect, a cellular-based V2X solution that provides real-time pre-collision alerts to vulnerable road users, such as pedestrians, cyclists, scooter drivers, etc. by using smartphones. It has a strategic cooperation agreement with FLIR Systems, Inc. to develop, market, and distribute QuadSight vision system. The company was formerly known as Asia Development (A.D.B.M.) Ltd. and changed its name to Foresight Autonomous Holdings Ltd. in 2016. Foresight Autonomous Holdings Ltd. was incorporated in 1977 and is headquartered in Ness Ziona, Israel.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Ness Ziona"
    },
    "ACE.TA": {
        "short_name": "ACE CAPITAL RETAIL",
        "long_name": "Ace Capital Retail (2016) Ltd",
        "summary": "Ace Capital Retail (2016) Ltd engages in the retail business in Israel. The company's stores offer home improvement, and yard and vehicle maintenance products under the ACE, AUTODEPOT, and Spetz brands. It operates 34 physical stores throughout Haaretz and 3 online commerce sites. The company was founded in 2016 and is based in Rishon Lezion, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Rishon Lezion"
    },
    "ADKA.TA": {
        "short_name": "ADIKA STYLE LTD",
        "long_name": "Adika Style Ltd.",
        "summary": "Adika Style Ltd. operates an online fashion store under the Adika brand in Israel. The company sells clothing, including T-shirts and bodysuits, dresses and skirts, pants and overalls, knitwear and sweatshirts, jackets and coats, shirts, denim, sweaters, leotards, swimwear and beachwear, and pajamas and lingerie; storage products, decorations, pillows and textiles, and shelves and racks, as well as products for use in bathrooms, kitchens, and bedrooms; and accessories, including notebooks and writing tools, necklaces and chokers, bracelets and rings, earrings, hats and hair accessories, socks and tights, belts, sunglasses, iPhone covers, and other fun stuff. It also sells backpacks, pouch bags, carrying cases, and clutches and purses; and shoes, such as sneakers, heels, sandals and flip flops, and boots. The company was founded in 2012 and is based in Tel Aviv, Israel. Adika Style Ltd. is a subsidiary of Golf & Co Ltd.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "ALMA.TA": {
        "short_name": "ALMOGIM HOLDINGS",
        "long_name": "Almogim Holdings Ltd.",
        "summary": "Almogim Holdings Ltd. develops, sells, and operates of real estate properties in Israel and internationally. It focuses on the development, construction, marketing, sale, and rental of residential neighborhoods and commercial complexes; construction, rental, and operation of residential complexes for young people; and provision of property management services. The company was founded in 1986 and is headquartered in Tirat Carmel, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tirat Carmel"
    },
    "AMX.TA": {
        "short_name": "AUTOMAX MOTORS LTD",
        "long_name": "Automax Motors Ltd",
        "summary": "Automax Motors Ltd. does not have significant operations. Previously, it was engaged in offering domain monetization and mobile digital advertising services to advertisers, advertising agencies, app developers, and domain owners. The company was formerly known as Matomy Media Group Ltd and changed its name to Automax Motors Ltd. in April 2021. Automax Motors Ltd. was incorporated in 2006 and is headquartered in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Ramat Gan"
    },
    "AVER.TA": {
        "short_name": "AVERBUCH FORMICA",
        "long_name": "Averbuch Formica Center Ltd.",
        "summary": "Averbuch Formica Center Ltd., together with its subsidiaries, produces and trades in raw materials for wood and furniture industry in Israel. It develops and markets fronts and doors for kitchen cabinets and furniture items, covered wood products, post forming high pressure laminated panels (HPL), aluminum profiles and handles, PVC doors, color-finished doors, glass and porcelain cladding, and acrylic panels. The company also imports and distributes HPL, plywood, soft/hard woods, exterior/interior wall claddings, woodworks, and wood molds for building and carpentry industries. In addition, it manufactures laminate products. Further, the company operates a showroom for architects, interior designers, carpenters, and their customers. Averbuch Formica Center Ltd. was founded in 1958 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "AVGL.TA": {
        "short_name": "AVGOL INDUSTRIES",
        "long_name": "Avgol Industries 1953 Ltd",
        "summary": "Avgol Industries 1953 Ltd manufactures and supplies nonwoven fabrics primarily for manufacturers of baby diapers, adult incontinence, and feminine hygiene products worldwide. It offers front and back ears, side panels, top sheets, leg cuffs/ leak guards, and back sheet solutions. The company offers its products primarily under the Avsoft, Avsilk, Avspun, Avgol, Avcore, and Avcuff brands. Its products are also used in medical and industrial applications. Avgol Industries 1953 Ltd was founded in 1953 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "AVIA.TA": {
        "short_name": "AVIATION LINKS",
        "long_name": "Aviation Links Ltd",
        "summary": "Aviation Links Ltd operates flights worldwide. The company also offers landing and visa arrangement, tour organization, and visiting services; tours and vacation packages; and car rental, cruise packages, hotel room booking, family park facilities, accommodation in luxury villas and estates, train tickets and seats booking, tickets for shows and sports events, organized trips, and other services, as well as hotel, resort, and club services. It serves travel agents in Israel, workers' committees of large organizations, industrial and technology companies, professional associations, and local councils. The company was founded in 1984 and is based in Tel Aviv-Yafo, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "BRAM.TA": {
        "short_name": "BRAM INDUSTRIES",
        "long_name": "Bram Industries Ltd.",
        "summary": "Bram Industries Ltd. develops, produces, and markets plastic products worldwide. It offers industrial packaging products for the food industry, including salads, meats, dairies, and others; and disposable dishes and unique household products, such as plastic kitchenware, food, and storage containers. The company was incorporated in 2004 and is based in Sderot, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Sderot"
    },
    "BRIL.TA": {
        "short_name": "BRILL SHOE INDS",
        "long_name": "Brill Shoe Industries Ltd.",
        "summary": "Brill Shoe Industries Ltd. engages in the fashion and footwear chain business in Israel. The company offers shoes, sandals, boots, sneakers, and slippers for women, men, and children. It markets and sells its products directly through the Gali, Solog, timberland, Lee Cooper, Nine West, Easy Spirit, Anne Klein, NAUTICA, and other shoe brands. The company was formerly known as Brill Shoe Industries (1988) Ltd. and changed its name to Brill Shoe Industries Ltd. in 1988. Brill Shoe Industries Ltd. was founded in 1988 and is based in Rishon LeZion, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Rishon LeZion"
    },
    "CAST.TA": {
        "short_name": "CASTRO MODEL",
        "long_name": "Castro Model Ltd.",
        "summary": "Castro Model Ltd. operates fashion stores in Israel. The company offers shirts, jeans, pants, shoes, swimwear, jackets, coats, face masks, accessories, and lingerie products for women, men, boys, and girls. It also provides knitwear, bags, and wallets for women and men; dresses and skirts for women and girls; garden suits and pajamas for boys and girls; and leotards, and sets and cases for baby girls and baby boys. In addition, the company offers gift cards. It operates through a chain of stores. The company is based in Bat Yam, Israel. Castro Model Ltd. is a subsidiary of Rotter Holdings Ltd.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Bat Yam"
    },
    "CFX.TA": {
        "short_name": "COFIX GROUP LTD",
        "long_name": "Cofix Group Ltd",
        "summary": "Cofix Group Ltd operates and franchises coffee shops, supermarkets, and bars in Israel. It has approximately 100 branches. The company is headquartered in Kefar Sava, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Kefar Sava"
    },
    "CKRT.TA": {
        "short_name": "CHAKRATEC LTD",
        "long_name": "Chakratec Ltd.",
        "summary": "Chakratec Ltd. provides economic and environmental electricity storage solutions in Israel. It offers kinetic power boosters, high power chargers, and managed charging services for electric vehicles. The company was founded in 2013 and is based in Lod, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Lod"
    },
    "CRSO.TA": {
        "short_name": "CARASSO MOTORS LTD",
        "long_name": "Carasso Motors Ltd.",
        "summary": "Carasso Motors Ltd. engages in the import and sale of automobiles in Israel. The company offers new and used cars; and various financing programs. It operates through 11 branches in Haifa, Nazareth, Afula, Tiberias, Carmiel, Netanya, Jerusalem, Kfar Saba, Rishon LeZion, Ashdod, and Be'er Sheva. Carasso Motors Ltd. was founded in 2007 and is based in Bnei Ayish, Israel. Carasso Motors Ltd. is a subsidiary of The Carasso Group.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Bnei Ayish"
    },
    "DANH.TA": {
        "short_name": "DAN HOTELS LTD",
        "long_name": "Dan Hotels Ltd",
        "summary": "Dan Hotels Ltd owns and operates a chain of hotels in Israel. It operates 15 hotels with a total of 3,950 rooms. The company also operates and manages five business lounges and a VIP lounge at Ben Gurion Airport; owns and manages apartments and commercial space at Â\u0091King David Towers' in Tel Aviv; and owns a third of the Panorama Mall commercial center in Haifa. In addition, it operates two vocational schools; and provides catering services to the Israel Defense Forces. The company was founded in 1947 and is headquartered in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "DISI.TA": {
        "short_name": "DISCOUNT INV CORP",
        "long_name": "Discount Investment Corporation Ltd.",
        "summary": "Discount Investment Corporation Ltd., a holding company, invests in companies in various sectors in Israel and internationally. it provides information security and content, landline, data communication, internet connectivity, and international telephony services; conference call, cloud computing and security, cloud transmission, integration and hosting, and IoT solutions for business customers and telecommunication operators; and television over Internet services, including television channel broadcasts, including channels which are provided through Idan+ broadcasts and video on demand, as well as end-user equipment and end-user equipment repair services. As of December 31, 2019, the company serves approximately 258 thousand television subscribers and 278 thousand internet infrastructure subscribers; and 2.74 million mobile subscribers. It is also involved in the initiating, planning, constructing, and managing hi-tech parks, industrial parks, commercial properties, office buildings, and shopping and logistics centers, as well as residential neighborhoods; and ownership of the supermarket chain under the Shufersal name, as well as provision of credit cards, which include membership in Shufersal's customer club. In addition, the company grows and exports citrus, and other fruits and vegetables; manages investment portfolios and mutual funds; and offers investment banking services. The company was founded in 1961 and is based in Tel Aviv, Israel. Discount Investment Corporation Limited is a subsidiary of Dolphin IL Investments Ltd.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "DLEA.TA": {
        "short_name": "DELEK AUTOMOTIVE S",
        "long_name": "Delek Automotive Systems Ltd.",
        "summary": "Delek Automotive Systems Ltd. imports and distributes cars and motorcycles in Israel. The company also operates technical training centers, garages, distribution centers for spare parts, and car supply centers. In addition, it offers insurance services for vehicles and car repair services. It operates through showrooms and sub-agencies, as well as operates approximately 60 service centers. The company was formerly known as Gal Â\u0096 Wisepiler and Karts Indsutiries Ltd. and changed its name to Delek Automotive Systems Ltd. in February 1994. Delek Automotive Systems Ltd. was founded in 1965 and is headquartered in Nir Tzvi, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Nir Tzvi"
    },
    "DLTI.TA": {
        "short_name": "DELTA ISRAEL BRAND",
        "long_name": "Delta Israel Brands Ltd",
        "summary": "Delta Israel Brands Ltd. engages in the design, marketing, and sale of clothing and lingerie products in Israel. It offers lingerie for women, innerwear for men and children, home wear, sleepwear, sports and leisure clothing, children's clothing, socks, and footwear under the Delta and Fix brands. The company sells its products through company operated stores, as well as stores operated by external operators. It also sells its products to large retail chains, private stores, and small chains. The company was incorporated in 2020 and is based in Caesarea, Israel. Delta Israel Brands Ltd. operates as a subsidiary of Delta Galil Industries Ltd.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Caesarea"
    },
    "FOX.TA": {
        "short_name": "FOX-WIZEL LTD",
        "long_name": "Fox-Wizel Ltd.",
        "summary": "Fox-Wizel Ltd. designs, markets, and sells clothing products and fashion accessories in Israel and internationally. The company also provides lingerie, housewares, home textiles, baby and children's products, atmosphere products, and footwear and sportswear products. It sells its products through its retail stores; and wholesalers and franchises. The company was formerly known as Wizel Textile Marketing Ltd. and changed its name to Fox-Wizel Ltd. in February 2002. Fox-Wizel Ltd. was founded in 1942 and is based in Airport City, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Airport City"
    },
    "FRSX": {
        "short_name": "Foresight Autonomous Holdings L",
        "long_name": "Foresight Autonomous Holdings Ltd.",
        "summary": "Foresight Autonomous Holdings Ltd., a technology company, engages in the design, development, and commercialization of sensor systems for the automotive industry. It develops in-line-of-sight vision systems and beyond-line-of-site cellular-based applications. The company offers QuadSight system, a quad-camera multi-spectral vision system for the semi-autonomous and autonomous vehicle market; V2X (vehicle-to-everything), an accident prevention solution based on real-time multi-agents positioning algorithms that enables communication between vehicles, infrastructure, grid, home, and network; and Eye-Net Protect, a cellular-based V2X solution that provides real-time pre-collision alerts to vulnerable road users, such as pedestrians, cyclists, scooter drivers, etc. by using smartphones. It has a strategic cooperation agreement with FLIR Systems, Inc. to develop, market, and distribute QuadSight vision system. The company was formerly known as Asia Development (A.D.B.M.) Ltd. and changed its name to Foresight Autonomous Holdings Ltd. in 2016. Foresight Autonomous Holdings Ltd. was incorporated in 1977 and is headquartered in Ness Ziona, Israel.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Ness Ziona"
    },
    "FRSX.TA": {
        "short_name": "FORESIGHT AUTONOM",
        "long_name": "Foresight Autonomous Holdings Ltd.",
        "summary": "Foresight Autonomous Holdings Ltd., a technology company, engages in the design, development, and commercialization of sensor systems for the automotive industry. It develops in-line-of-sight vision systems and beyond-line-of-site cellular-based applications. The company offers QuadSight system, a quad-camera multi-spectral vision system for the semi-autonomous and autonomous vehicle market; V2X (vehicle-to-everything), an accident prevention solution based on real-time multi-agents positioning algorithms that enables communication between vehicles, infrastructure, grid, home, and network; and Eye-Net Protect, a cellular-based V2X solution that provides real-time pre-collision alerts to vulnerable road users, such as pedestrians, cyclists, scooter drivers, etc. by using smartphones. It has a strategic cooperation agreement with FLIR Systems, Inc. to develop, market, and distribute QuadSight vision system. The company was formerly known as Asia Development (A.D.B.M.) Ltd. and changed its name to Foresight Autonomous Holdings Ltd. in 2016. Foresight Autonomous Holdings Ltd. was incorporated in 1977 and is headquartered in Ness Ziona, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Ness Ziona"
    },
    "FTAL.TA": {
        "short_name": "FATTAL HOLDINGS",
        "long_name": "Fattal Holdings (1998) Ltd",
        "summary": "Fattal Holdings (1998) Ltd owns and operates hotels. It operates 39 hotels with 16,700 rooms in Israel; and approximately 150 Leonardo-branded hotels in Europe. The company was founded in 1998 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "GNGR.TA": {
        "short_name": "GINEGAR PLASTIC",
        "long_name": "Ginegar Plastic Products Ltd.",
        "summary": "Ginegar Plastic Products Ltd. produces and sells advanced films for various agricultural and non-agricultural applications worldwide. The company offers Sun Selector films for use in greenhouse and tunnel covering applications; and Mulch More films for crops and growing applications. It also provides ozgard, a virtually impermeable film, which enhances the effectiveness of fumigants, including methyl bromide, methane sodium, dicloropropene, iodo methane, and others; Super Seal geomembranes for use in soil engineering applications, such as reservoirs, waste disposal sites, sub-terranean structures, roadworks, and other projects; and table grape cover films. In addition, the company offers polysack nets comprising thermal screens and shade nets; energy saving screens and darkening screens; shading nets; protection nets; anti-insect nets; anti-hail nets; wind breakers; and decorative single and double layer products. Further, it provides shade and mesh nets; barrier films for soil fumigation with noxious chemicals; HDPE films for pond and reservoir liners; and heavy duty bags for chemical fertilizers. Ginegar Plastic Products Ltd. was founded in 1969 and is based in Jezreel Valley, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Jezreel Valley"
    },
    "GOLF.TA": {
        "short_name": "GOLF & CO",
        "long_name": "Golf & Co Group Ltd",
        "summary": "Golf & Co Group Ltd operates as a retail company in the field of fashion, home styling, and clothing in Israel. The company offers home ware and styling products, such as kitchen-ware, dining-ware, home textile, and spa products; home textile products, including bed linens, blankets, towels, and other products; fashion apparel and accessories for men and women; intimate wear, including lingerie, night wear, leisure clothing, and swim and beach wear; and basic and fashionable collections for children and babies. It also operates approximately 330 stores primarily under the GOLF, TSUMI, MAX MORETTI, DANIEL HECHTER, TOPSHOP, KITAN, POLGAT, ROYAL SATEEN, and Adika brand names, as well as online stores, such as golfco.co.il, golfkids.co.il, il.topshop.com, and adikastyle.com. Golf & Co Group Ltd was incorporated in 1961 and is based in Tel Aviv, Israel. Golf & Co Group Ltd is a subsidiary of Clal Industries Ltd.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "HLMS.TA": {
        "short_name": "HOLMES PLACE INTER",
        "long_name": "Holmes Place International Ltd.",
        "summary": "Holmes Place International Ltd. operates fitness clubs under the Holmes Place brand name. The company was founded in 1979 and is based in Haifa, Israel. Holmes Place International Ltd. operates as a subsidiary of Holmes Place Group.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Haifa"
    },
    "INVZ": {
        "short_name": "Innoviz Technologies Ltd.",
        "long_name": "Innoviz Technologies Ltd.",
        "summary": "Innoviz Technologies Ltd. designs and manufactures solid state LiDAR sensors and develops perception software that enable the mass-production of autonomous vehicles. The company manufactures InnovizOne, a solid-state LiDAR sensor designed for automakers and robotaxi, shuttle, trucking, and delivery companies requiring an automotive-grade and mass-producible solution to achieve autonomy. Its automotive-grade sensor is integrable into Level 3 through 5 autonomous vehicles for the safety of passengers and pedestrians. The company also provides InnovizTwo, an automotive-grade LiDAR sensor that offers a solution for all levels of autonomous driving, as well as option to integrate the perception application in the LiDAR sensor; and perception application, a software application that turns the InnovizOne LiDAR's raw point cloud data into perception outputs to provide superior scene perception and deliver an automotive-grade ASIL B(D) solution. Its products can be used in various industries, including robotaxis, shuttles, delivery vehicles, buses, trucking, drones, and robotics, as well as construction, agriculture, smart city, security, mining, maritime, and mapping. The company operates in Europe, the Middle East, Africa, and North America. Innoviz Technologies Ltd. was incorporated in 2016 and is headquartered in Rosh HaAyin, Israel.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Rosh Haayin"
    },
    "ISRO.TA": {
        "short_name": "ISROTEL LTD",
        "long_name": "Isrotel Ltd.",
        "summary": "Isrotel Ltd. operates a chain of hotels in Israel. It operates 16 hotels that consist of approximately 3,300 suites and rooms with various facilities comprising restaurants, halls, swimming pools, entertainment shows, recreation, and various vacation facilities. The company was founded in 1984 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "ISTA.TA": {
        "short_name": "ISSTA LINES LTD",
        "long_name": "Issta Lines Ltd.",
        "summary": "Issta Lines Ltd. provides travel and tourism services to private and business customers, groups, and organizations in Israel and internationally. It offers outbound and domestic tourism services, including regular and international flights, charter flights, vacation packages, organized tours, ski vacations, sports, music, and cruises, as well as complementary services, such as hotels, car rentals, visas, and student cards. The company offers its products through 39 branches in Israel, as well as through call centers and online. Issta Lines Ltd. was founded in 1956 and is based in Tel Aviv-Yafo, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "LZNR.TA": {
        "short_name": "A.LUZON REAL ESTA",
        "long_name": "A. Luzon Real Estate & Finance Ltd",
        "summary": "A. Luzon Real Estate & Finance Ltd engages in the real estate, trade, and leisure businesses in Israel. It owns and manages rental residential and commercial units in the United States. It provides asset services, including administration, leasing, maintenance, and construction. The company also operates 7 hotels under the brand Holiday Inn & Crown Plaza. The company was formerly known as Netz Hotels Ltd. A. Luzon Real Estate & Finance Ltd was founded in 1992 and is based in Tel Aviv, Israel. As of December 6, 2017, A. Luzon Real Estate & Finance Ltd  operates as a subsidiary of Amos Luzon Development and Energy Group Ltd.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "MAXO.TA": {
        "short_name": "MAX STOCK LTD.",
        "long_name": "Max Stock Ltd.",
        "summary": "Max Stock Ltd. operates various discount stores in Israel. Its stores provide products in various categories, including school supplies, arts and crafts, disposable dishes, tools and hardware, clothing and textiles, toys and leisure, birthdays, plastic ware, accessories and gifts, baking utensils, cleaning products, and furniture and dÃ©cor. The company operates 50 stores. Max Stock Ltd. is based in Holon, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Holon"
    },
    "MSBI.TA": {
        "short_name": "HAMASHBIR 365 LTD",
        "long_name": "Hamashbir 365 Ltd",
        "summary": "Hamashbir 365 Ltd operates departmental stores in Israel. The company provides pants, shirts, sweaters, dresses and skirts, jackets and coats, sweatshirts, leotards, pajamas, and lingerie wear, as well as shoes and slippers for men, women, and children; tank tops, socks, towels, and thermal clothing for soldiers; sports clothing and shoes for men, women, and children; sports accessories and equipment; and bags and suitcases. It also offers vases, storage products, decorative pillows and accessories, and rugs for home; towels, bathrobes, rugs, and accessories for bathrooms; bedding, linen, sheets, mattress, cushions, blankets, and quilts for bedrooms; plates and bowl, drinking glasses, mugs and cups, dishes, maps, and runners for dining table; and cooking accessories, pots and pans, baking products, kitchen towels, aprons, knives, and templates for kitchen. In addition, the company provides electric appliances, including blenders and food processors, irons, microwaves and toaster oven, electric frying pans and bread baker, vacuum cleaners, fans, heating and winter products, coffee machines, kettles, small kitchen products, and haircut and grooming products; and personal and beauty products, and perfumes. Further, it offers its products through online retailing, as well as gift cards. The company was formerly known as Hamashbir 365 Holdings Ltd. and changed its name to Hamashbir 365 Ltd in August 2019. Hamashbir 365 Ltd was founded in 2003 and is headquartered in Netanya, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Netanya"
    },
    "PLCR.TA": {
        "short_name": "PLASTO CARGAL",
        "long_name": "Plasto-Cargal Group Ltd",
        "summary": "Plasto-Cargal Group Ltd engages in the packaging business in Israel and internationally. The company offers cardboard and wood packaging products; triplex containers; sheets; and various paper-based products. It also provides printing services for corrugated cardboards. The company was founded in 1954 and is based in Lod, Israel. Plasto-Cargal Group Ltd is a subsidiary of C.I. - Cardboard Industries Ltd.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Lod"
    },
    "PLSN.TA": {
        "short_name": "PLASSON INDUSTRIES",
        "long_name": "Plasson Industries Ltd",
        "summary": "Plasson Industries Ltd provides various solutions for connecting PE pipes worldwide. It offers electrofusion fittings, adjustable elbows, mechanical fittings, wastewater systems, PE ball valves, controllers, excess flow valves, geothermal systems, and large diameter electrofusion couplers, as well as fittings for polyethylene pipe systems. The company also offers a range of bathroom and kitchen products, such as bida seats, faucets, bathroom accessories, bath sinks, drainage channels, toilets and toilet seats, and rinsing tanks, as well as spare parts for plasaun products. It provides various systems for the controlled supply of potable water, automatic feeding, and climate control for poultry and livestock, including broilers, turkeys, breeders, layers, and swine, as well as offers professional solutions. In addition, the company offers Quality Point Management (QPM) that enables organizations to drive a pro-active quality management approach in infrastructure projects & maintenance. Its products are used in municipal water distribution, gas conveyance, industrial fluids transfer, wastewater systems, communication, mines and agriculture. The company was founded in 1963 and is headquartered in Menashe, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Menashe"
    },
    "PPIL.TA": {
        "short_name": "PLASTOPIL HAZOREA",
        "long_name": "Plastopil Hazorea Company Ltd",
        "summary": "Plastopil Hazorea Company Ltd. develops and manufactures flexible packaging solutions for the chilled food industry in Israel. It offers lidding films, thermoformable films, tbags and pouches, flow packs, and vacuum skin packaging products. The company was formerly known as Plastopil Hazorea Agricultural Cooperative Society Ltd. and changed its name to Plastopil Hazorea Company Ltd. in April 2005. Plastopil Hazorea Company Ltd. was founded in 1960 and is based in Jezreel Valley, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Jezreel Valley"
    },
    "QNCO.TA": {
        "short_name": "QUEENCO LTD(Y.Z)",
        "long_name": "Y.Z. Queenco Ltd.",
        "summary": "Y.Z. Queenco Ltd. develops, owns, and operates entertainment centers and casinos in Greece, Cambodia, and Serbia. The company owns and operates four casinos, including Casino Loutraki located in Loutraki, and Casino Rodos located on the island of Rhodes in Greece; Casino Beograd in Belgrade, Serbia; and Queenco Casino in Sihanovill, Cambodia with a total number of 165 gaming tables and 1,380 slots machines. It also operates two hotels with approximately 300 hotels rooms and suites. Y.Z. Queenco Ltd. is based in Bnei Brak, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Bnei Brak"
    },
    "QUIK.TA": {
        "short_name": "QUIK SUPER ONLINE",
        "long_name": "Quik Super Online Ltd.",
        "summary": "Quik Super Online Ltd. engages in the online retail marketing of food products. The company is headquartered in Rishon LeZion, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Rishon LeZion"
    },
    "ROTS.TA": {
        "short_name": "ROTSHTEIN REALEST",
        "long_name": "Rotshtein Realestate Ltd",
        "summary": "Rotshtein Realestate Ltd develops and constructs residential projects in Israel. It also undertakes engineering works. The company was formerly known as D. Rothstein Company and changed its name to Rotshtein Realestate Ltd in February 2013. Rotshtein Realestate Ltd is based in Petah Tikva, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Petah Tikva"
    },
    "RTSN.TA": {
        "short_name": "ROTEM SHANI ENTREP",
        "long_name": "Rotem Shani Entrepreneurship and Investment Ltd.",
        "summary": "Rotem Shani Entrepreneurship and Investment Ltd. engages in the real estate business in Israel. It is involved in the residential and/or commercial construction projects. The company was formerly known as Delta Eshbol Entrepreneurship Ltd. and changed its name to Rotem Shani Entrepreneurship and Investment Ltd. in May 1996. Rotem Shani Entrepreneurship and Investment Ltd. was incorporated in 1996 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "RVL.TA": {
        "short_name": "RAVAL ICS LTD",
        "long_name": "Raval ACS Ltd.",
        "summary": "Raval ACS Ltd. develops, produces, and sells automotive fuel tank venting systems. It offers venting system solutions for gasoline, diesel, and bio fuel systems; and cleaner and check valves. The company has operations in Israel, the United States, Luxemburg, Germany, Russia, Japan, China, Korea, and India. Raval ACS Ltd. was founded in 2000 and is headquartered in Beer-Sheva, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Beer-Sheva"
    },
    "SALG.TA": {
        "short_name": "SHALAG INDUSTRIES",
        "long_name": "Shalag Industries Ltd.",
        "summary": "Shalag Industries Ltd. develops and produces nonwoven products in Israel and internationally. The company offers baby and adult diapers, and feminine hygiene products. It also provides polypropylene viscose and cotton fiber dry wipes; wet wipes for hygienic, disinfection, and window and other surfaces cleaning applications; and industrial wipes for household, hand cleaner, disinfection, heavy duty cleaning, and various industrial applications. The company was founded in 1984 and is headquartered in Upper Galilee, Israel. Shalag Industries Ltd. is a subsidiary of Shamir Shalag Holdings Agricultural Cooperative Society Ltd.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Upper Galilee"
    },
    "SHNP.TA": {
        "short_name": "E SCHNAPP CO WORKS",
        "long_name": "E. Schnapp & Co. Works Ltd",
        "summary": "E. Schnapp & Co. Works Ltd manufactures and sells batteries for vehicles. The company offers car, start and stop, motorcycle, and ATV batteries; battery accumulators; solar fire detection UPS backup batteries; washing machine batteries; and chargers and battery testers, as well as batteries for plateau levels, cinema and electric vehicles, and trailers and boats. It also exports its products internationally. The company serves various government ministries, the Ministry of Defense, IDF, military and air industries, and Israeli ports; and electricity, bus, and rental and leasing companies, as well as companies that import cars to Israel. E. Schnapp & Co. Works Ltd was founded in 1951 and is headquartered in Netanya, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Netanya"
    },
    "SPNTC.TA": {
        "short_name": "SPUNTECH INDUSTRIE",
        "long_name": "N.R. Spuntech Industries Ltd.",
        "summary": "N.R. Spuntech Industries Ltd. develops, manufactures, and supplies spunlace hydroentangled fabrics in Israel. The company offers dry, disinfecting, hard surface scrubbing, window, bathroom, automobile, and glass wipes for use in household applications; medical swabs and gauzes, bleach wipes, bandages and tapes, germicidal wipes, and medicated wipes for medical applications; pads, face masks, make-up removal wipes, exfoliating fabrics for gentle peeling, soap impregnated facial wipes, face care wipes, and feminine hygiene wipes for cosmetic and feminine care applications; baby wipes; commercial multipurpose wipes for use in industrial facilities and restaurants; and HVAC filters and hard surface scrubbing wipes for industrial applications. The company markets its products in approximately 30 countries worldwide. N.R. Spuntech Industries Ltd. was founded in 1996 and is based in Tiberias, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tiberias"
    },
    "TDGN-L.TA": {
        "short_name": "TADIR-GAN",
        "long_name": "Tadir-Gan (Precision Products) 1993 Ltd.",
        "summary": "Tadir-Gan (Precision Products) 1993 Ltd., together with its subsidiary, produces, processes, and markets mechanical assemblies made of aluminum and magnesium for the automotive industry in Israel. The company offers products made from, including engine parts, such as oil basins, valve caps, sealing caps, parts for transfer tankers, chalk, parts of steering rods, and other products. Tadir-Gan (Precision Products) 1993 Ltd. was incorporated in 1993 and is based in Afula, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Afula"
    },
    "TFRFF": {
        "short_name": "TEFRON",
        "long_name": "Tefron Ltd.",
        "summary": "Tefron Ltd. produces and sells fashion products in Israel. It offers intimate, active, and lifestyle wear. The company was founded in 1977 and is based in Misgav, Israel.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Misgav"
    },
    "TFRLF.TA": {
        "short_name": "TEFRON",
        "long_name": "Tefron Ltd.",
        "summary": "Tefron Ltd. produces and sells fashion products in Israel. It offers intimate, active, and lifestyle wear. The company was founded in 1977 and is based in Misgav, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Misgav"
    }
}