{"DANH.TA": {"short_name": "DAN HOTELS LTD", "long_name": "Dan Hotels Ltd", "summary": "Dan Hotels Ltd owns and operates a chain of hotels in Israel. It operates 15 hotels with a total of 3,950 rooms. The company also operates and manages five business lounges and a VIP lounge at Ben Gurion Airport; owns and manages apartments and commercial space at Â\u0091King David Towers' in Tel Aviv; and owns a third of the Panorama Mall commercial center in Haifa. In addition, it operates two vocational schools; and provides catering services to the Israel Defense Forces. The company was founded in 1947 and is headquartered in Tel Aviv, Israel.", "currency": "ILA", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Tel Aviv"}, "FTAL.TA": {"short_name": "FATTAL HOLDINGS", "long_name": "Fattal Holdings (1998) Ltd", "summary": "Fattal Holdings (1998) Ltd owns and operates hotels. It operates 39 hotels with 16,700 rooms in Israel; and approximately 150 Leonardo-branded hotels in Europe. The company was founded in 1998 and is based in Tel Aviv, Israel.", "currency": "ILA", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Tel Aviv"}, "ISRO.TA": {"short_name": "ISROTEL LTD", "long_name": "Isrotel Ltd.", "summary": "Isrotel Ltd. operates a chain of hotels in Israel. It operates 16 hotels that consist of approximately 3,300 suites and rooms with various facilities comprising restaurants, halls, swimming pools, entertainment shows, recreation, and various vacation facilities. The company was founded in 1984 and is based in Tel Aviv, Israel.", "currency": "ILA", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Tel Aviv"}, "LZNR.TA": {"short_name": "A.LUZON REAL ESTA", "long_name": "A. Luzon Real Estate & Finance Ltd", "summary": "A. Luzon Real Estate & Finance Ltd engages in the real estate, trade, and leisure businesses in Israel. It owns and manages rental residential and commercial units in the United States. It provides asset services, including administration, leasing, maintenance, and construction. The company also operates 7 hotels under the brand Holiday Inn & Crown Plaza. The company was formerly known as Netz Hotels Ltd. A. Luzon Real Estate & Finance Ltd was founded in 1992 and is based in Tel Aviv, Israel. As of December 6, 2017, A. Luzon Real Estate & Finance Ltd  operates as a subsidiary of Amos Luzon Development and Energy Group Ltd.", "currency": "ILA", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Tel Aviv"}}