{
    "BRAM.TA": {
        "short_name": "BRAM INDUSTRIES",
        "long_name": "Bram Industries Ltd.",
        "summary": "Bram Industries Ltd. develops, produces, and markets plastic products worldwide. It offers industrial packaging products for the food industry, including salads, meats, dairies, and others; and disposable dishes and unique household products, such as plastic kitchenware, food, and storage containers. The company was incorporated in 2004 and is based in Sderot, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Sderot",
        "zipcode": null,
        "website": "http://www.bram.co.il",
        "market_cap": null
    },
    "PLCR.TA": {
        "short_name": "PLASTO CARGAL",
        "long_name": "Plasto-Cargal Group Ltd",
        "summary": "Plasto-Cargal Group Ltd engages in the packaging business in Israel and internationally. The company offers cardboard and wood packaging products; triplex containers; sheets; and various paper-based products. It also provides printing services for corrugated cardboards. The company was founded in 1954 and is based in Lod, Israel. Plasto-Cargal Group Ltd is a subsidiary of C.I. - Cardboard Industries Ltd.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Lod",
        "zipcode": "71100",
        "website": "http://www.cargal.co.il",
        "market_cap": null
    },
    "PPIL.TA": {
        "short_name": "PLASTOPIL HAZOREA",
        "long_name": "Plastopil Hazorea Company Ltd",
        "summary": "Plastopil Hazorea Company Ltd. develops and manufactures flexible packaging solutions for the chilled food industry in Israel. It offers lidding films, thermoformable films, tbags and pouches, flow packs, and vacuum skin packaging products. The company was formerly known as Plastopil Hazorea Agricultural Cooperative Society Ltd. and changed its name to Plastopil Hazorea Company Ltd. in April 2005. Plastopil Hazorea Company Ltd. was founded in 1960 and is based in Jezreel Valley, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Jezreel Valley",
        "zipcode": "36581",
        "website": "http://www.plastopil.com",
        "market_cap": null
    }
}