{
    "ALMA.TA": {
        "short_name": "ALMOGIM HOLDINGS",
        "long_name": "Almogim Holdings Ltd.",
        "summary": "Almogim Holdings Ltd. develops, sells, and operates of real estate properties in Israel and internationally. It focuses on the development, construction, marketing, sale, and rental of residential neighborhoods and commercial complexes; construction, rental, and operation of residential complexes for young people; and provision of property management services. The company was founded in 1986 and is headquartered in Tirat Carmel, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tirat Carmel",
        "zipcode": "3912001",
        "website": "http://www.almogim.co.il",
        "market_cap": "Small Cap"
    },
    "ROTS.TA": {
        "short_name": "ROTSHTEIN REALEST",
        "long_name": "Rotshtein Realestate Ltd",
        "summary": "Rotshtein Realestate Ltd develops and constructs residential projects in Israel. It also undertakes engineering works. The company was formerly known as D. Rothstein Company and changed its name to Rotshtein Realestate Ltd in February 2013. Rotshtein Realestate Ltd is based in Petah Tikva, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": null,
        "website": "http://www.rotshtein.co.il",
        "market_cap": "Small Cap"
    },
    "RTSN.TA": {
        "short_name": "ROTEM SHANI ENTREP",
        "long_name": "Rotem Shani Entrepreneurship and Investment Ltd.",
        "summary": "Rotem Shani Entrepreneurship and Investment Ltd. engages in the real estate business in Israel. It is involved in the residential and/or commercial construction projects. The company was formerly known as Delta Eshbol Entrepreneurship Ltd. and changed its name to Rotem Shani Entrepreneurship and Investment Ltd. in May 1996. Rotem Shani Entrepreneurship and Investment Ltd. was incorporated in 1996 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "4690500",
        "website": null,
        "market_cap": "Small Cap"
    }
}