{"07C.F": {"short_name": "COOKPAD INC.", "long_name": "Cookpad Inc.", "summary": "Cookpad Inc. operates a community platform to share recipe ideas and cooking tips worldwide. It also engages in Cookpad mart and TV businesses. The company was formerly known as Coin Ltd. and changed its name to Cookpad Inc. in June 1999. Cookpad Inc. was founded in 1997 and is based in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "0KY.F": {"short_name": "KAYAC INC.", "long_name": "KAYAC Inc.", "summary": "KAYAC Inc. engages in the game-related business in Japan. It also operates a game community under the name Lobi; Tonamel, a tournament format where organizers manage their tournaments; and Pla-cole, a matching service for couples and wedding planners, as well as provides esports event planning and management, distribution, and production services under the Well Played name. In addition, the company offers home funeral, real estate, and trading services. KAYAC Inc. was founded in 1998 and is headquartered in Kamakura, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Kamakura"}, "0YW.F": {"short_name": "ARTERIA NETWORKS CORP.", "long_name": "ARTERIA Networks Corporation", "summary": "ARTERIA Networks Corporation provides telecommunication network services in Japan. The company offers leased circuit (Ethernet) access services; virtual private network services through dedicated closed network; cloud services, including consulting, installation, and operation; Internet access; IP telephone/landline services; security/network monitoring solutions; data center services, including housing and co-location services; and mobile device management and monitoring solutions. It also provides Internet access services for condominiums; and equipment engineering services, including information and communications equipment installation. The company was founded in 1997 and is headquartered in Tokyo, Japan. ARTERIA Networks Corporation is a subsidiary of Marubeni Corporation.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "0YW.MU": {"short_name": "ARTERIA NETWORKS CORP.", "long_name": "ARTERIA Networks Corporation", "summary": "ARTERIA Networks Corporation provides telecommunication network services in Japan. The company offers leased circuit (Ethernet) access services; virtual private network services through dedicated closed network; cloud services, including consulting, installation, and operation; Internet access; IP telephone/landline services; security/network monitoring solutions; data center services, including housing and co-location services; and mobile device management and monitoring solutions. It also provides Internet access services for condominiums; and equipment engineering services, including information and communications equipment installation. The company was founded in 1997 and is headquartered in Tokyo, Japan. ARTERIA Networks Corporation is a subsidiary of Marubeni Corporation.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "MUN", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "1G9.F": {"short_name": "GUMI INC.", "long_name": "gumi Inc.", "summary": "gumi Inc. provides online games for mobiles in Japan and internationally. It also engages in block chain business; and XR business comprising VR, AR, MR, etc. The company was founded in 2007 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "1RO.SG": {"short_name": "BROCCOLI CO. LTD. Registered Sh", "long_name": "Broccoli Co., Ltd.", "summary": "Broccoli Co., Ltd. operates in the entertainment industry in Japan and internationally. It develops and creates various contents, including TV games, card games, CDs, and applications. The company was founded in 1994 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Entertainment", "exchange": "STU", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "1UN.F": {"short_name": "USEN-NEXT HLDS.", "long_name": "USEN-NEXT HOLDINGS Co.,Ltd.", "summary": "Usen-Next Holdings Co.,Ltd. offers entertainment services. Its content platform business engages in planning, developing, operating, and marketing U-NEXT, a video distribution service; and the provision of application development and infrastructure distribution services. The company also provides multi-MVNO cheap SIM, and cheap smartphone services; offers fixed-line telecommunications and optical Internet services; and operates contact centers. The company was formerly known as U-Next Co., Ltd. and changed its name to Usen-Next Holdings Co.,Ltd. in December 2017. Usen-Next Holdings Co.,Ltd. was founded in 2009 and is headquartered in Tokyo, Japan. Usen-Next Holdings Co.,Ltd. is a subsidiary of UNO-HOLDINGS Co., Ltd.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "2120.T": {"short_name": "LIFULL CO LTD", "long_name": "LIFULL Co., Ltd.", "summary": "LIFULL Co., Ltd. provides real estate information services in Japan. It offers LIFULL HOME'S, a site of real estate and housing information; LIFULL Rumah, a real estate and housing information website for Indonesia; LIFULL Concierge, a real estate agency service for Japanese employees re-assigned to Jakarta; Trovit, an aggregation website; and Mitula, a site that provides information in real estate and housing, used cars, recruitment, and fashion. The company also offers LIFULL Move that provides reviews and rankings of the moving companies; LIFULL Storage, a storage space searching web service; LIFULL Nursing Care, a special care facility searching web service; and LIFULL Revitalize Rural Japan that suggest new lifestyles to people in Japan based on refurbishment of abandoned houses. In addition, it offers LIFULL FaM that enables working mothers balance childcare with work while pursuing a career; and LIFULL rental spaces, a site for rental spaces and meeting rooms, event venues, and other rental facilities. Further, the company provides LIFULL FLOWER, an online flower gift shop; LIFULL Investment, a money funding website; LIFULL HUB, a shared office; LIFULL Table, a mixed-style deli restaurant; and LIFULL Marketing Partners that offers full Web assistance for real estate related companies. Additionally, it provides LivingAnywhere Commons, a community to live; instant house products. The company was formerly known as NEXT Co., Ltd. and changed its name to LIFULL Co., Ltd.in April 2017. LIFULL Co., Ltd. was founded in 1997 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2121.T": {"short_name": "MIXI. INC", "long_name": "mixi, Inc.", "summary": "mixi, Inc. engages in the entertainment and lifestyle businesses in Japan. It offers Monster Strike, Kotodaman, and Monster Strike Stadium gaming applications; TIPSTAR, a freemium online betting app; Chariloto, a keirin and auto race betting ticket sales site; Chiba Jets Funabashi; netkeiba.com, a national horse racing resource; and Weekly Baseball Online, a baseball information site. The company also provides FamilyAlbum, a family photo and video sharing app; minimo, a salon artist booking app; mixi, a social networking service that offers space for friendly communication; KARASTA, a karaoke video community; Find Job!, a job recruitment info site for the IT and web industries; and OKURU, a photo gift service. It also provides employment opportunities for people with disabilities; operates XFLAG stores that offer merchandise from game; organizes events; and produces and sells various goods, as well as manages professional sports team, and businesses related to publicly operated competitions and other services. The company was formerly known as eMecury Co., Ltd. and changed its name to mixi, Inc. in February 2006. mixi, Inc. was founded in 1999 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2139.T": {"short_name": "CHUCO CO.LTD", "long_name": "Chuco Co., Ltd.", "summary": "Chuco Co., Ltd. publishes magazines in Japan. Its magazines comprise life and parenting information. The company also provides employment support books for high school students; and Furimo AR, a mobile version of community life information magazine. In addition, it is involved in mail-order, event seminar, and voluntary chain businesses. Further, the company plans advertising strategies and advertising, as well as promotes sales; handles advertising media, such as TV, radio, newspaper, magazine, printed matter, outdoor advertising, etc.; and implements advertising production and sales promotion, and Internet advertising. Chuco Co., Ltd. was founded in 1978 and is headquartered in Gifu, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Gifu"}, "2148.T": {"short_name": "ITMEDIA INC.", "long_name": "ITmedia Inc.", "summary": "ITmedia Inc. engages in the development and operation of Internet-only media providing information and services centered on technology and business field in Japan. The company was formerly known as Softbank ITmedia, Inc. and changed its name to ITmedia Inc. in March 2005. ITmedia Inc. was founded in 1999 and is headquartered in Tokyo, Japan. ITmedia Inc. is a subsidiary of SB Media Holdings Corp.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2156.T": {"short_name": "SAYLOR ADVERTISING INC.", "long_name": "Saylor Advertising.Inc.", "summary": "Saylor Advertising.Inc. operates as an advertising company. It offers TV commercial, radio, newspaper, magazine, outdoor, traffic, poster, brochure, and flyer advertising services; and event, Web digital promotion, and promotion services. The company also provides marketing and sales promotion planning services; and event, exhibition, and ceremony planning and management services. The company was founded in 1951 and is headquartered in Takamatsu, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Takamatsu"}, "2164.T": {"short_name": "CHIIKISHINBUNSHA CO LTD", "long_name": "Chiikishinbunsha Co.,Ltd.", "summary": "Chiikishinbunsha Co.,Ltd. publishes newspapers in Japan. It also inserts flyers in newspapers; and provides sales promotion support and other services. The company was founded in 1984 and is headquartered in Funabashi, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Publishing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Funabashi"}, "2173.T": {"short_name": "HAKUTEN CORPORATION", "long_name": "Hakuten Corporation", "summary": "Hakuten Corporation provides marketing services in Japan. It offers event promotion services, such as product promotion, user events, and PR events; exhibitions, including domestic joint exhibitions, academic-corporate events, and overseas events; business meetings and private shows comprising company sponsored business events, new product launch exhibitions, company anniversary exhibitions, joint exhibitions, and recruiting and education fairs; and conferences and conventions consisting of roadshows, meeting events, conferences, and ceremonies. The company also provides various services for commercial spaces, such as showrooms, retail stores, office design, apartment galleries, pop-up shops, and promotional furniture; digital marketing and contents, including Web marketing, social media marketing, database marketing, and event-related digital content services; CMS and Web integration services; and marketing and communications services comprising planning and execution of communications strategy consisting of branding, advertising, research, and telesales. It serves IT, communications, precision engineering, machinery, electricity, food, toy, and fashion companies, as well as government agencies. The company was founded in 1967 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2178.T": {"short_name": "TRI-STAGE INC", "long_name": "Tri-Stage Inc.", "summary": "Tri-Stage Inc. provides direct marketing services for companies in Japan. The company offers television (TV) programs and commercial slots to companies that conduct direct marketing; and a range of services, including advisory services in areas, such as the creation of TV program, contact center operation, and distribution and payment. Its direct marketing value chain services include product development, business planning, creative planning, media selection, order support, impact analysis, information processing, distribution and payment, and customer management. The company also provides support services for direct marketing; and direct mail advertising, and envelope filling and posting services. In addition, it wholesales services to TV shopping channels; retails Japanese traditional and unique products; and offers multi-channel-marketing and marketing services, as well as operates as a media agency. Further, the company imports and exports its products. Tri-Stage Inc. was founded in 2006 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2180.T": {"short_name": "SUNNY SIDE UP GROUP INC", "long_name": "Sunny Side Up Group, Inc.", "summary": "Sunny Side Up Group, Inc., together with its subsidiaries, engages in the public relations business in Japan. It offers sales promotion, merchandising, OEM, and other services; and is involved in planning and promoting marketing communication strategies for casting of advertisement, films, program and creative consulting, commercial productions, graphic content, program creation, media purchasing, event productions, promotional activities, Web productions, video productions, content productions, casting, publicity, and others. The company also provides human resource education, certification tests, staffing agency, apprenticeship support, student ambassador, etc.; and develops and manages restaurants under the bills name. The company was formerly known as Sunny Side Up Inc. and changed its name to Sunny Side Up Group, Inc. in January 2020. Sunny Side Up Group, Inc. was founded in 1985 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2193.T": {"short_name": "COOKPAD INC.", "long_name": "Cookpad Inc.", "summary": "Cookpad Inc. operates a community platform to share recipe ideas and cooking tips worldwide. It also engages in Cookpad mart and TV businesses. The company was formerly known as Coin Ltd. and changed its name to Cookpad Inc. in June 1999. Cookpad Inc. was founded in 1997 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2329.T": {"short_name": "TOHOKUSHINSHA FILM CORPORATION", "long_name": "Tohokushinsha Film Corporation", "summary": "Tohokushinsha Film Corporation engages in the media business in Japan. The company develops and produces television programs, unrivaled web, and corporate and event video content; feature films and drama series for television; animations and games; visual media; content; documentaries; television commercials, web videos; and motion pictures. It also involves in the commercial production, promotions, broadcasting and streaming services, management of voice and translator as dubbing, and sales of media storage and recording devices, as well as operation of supermarkets and brewery, and provision of interior design services. The company was founded in 1961 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Entertainment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2341.T": {"short_name": "ARBEIT-TIMES CO LTD", "long_name": "Arbeit-Times Co., Ltd.", "summary": "Arbeit-Times Co., Ltd. edits and publishes free work magazines under the Domo name in Japan. The company also operates job sites, including domonet.jp and job.atimes.co.jp. In addition, it is involved in in-store and target media, ad agency, and paid employment introduction activities; the planning and management of new graduate job site; and the provision of consulting in the management of recruitment information Website. Arbeit-Times Co., Ltd. was founded in 1973 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Publishing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2371.T": {"short_name": "KAKAKU.COM. INC", "long_name": "Kakaku.com, Inc.", "summary": "Kakaku.com, Inc. provides purchase support, restaurant review, and other services in Japan. The company operates kakaku.com, a purchasing support site that compare prices of products and services of various genres, such as personal computers and home appliances, communication costs, and insurance; and Priceprice.com, a purchasing support site for consumers in the Philippines, Thailand, and Indonesia. It also operates tabelog.com, a restaurant search and reservation site. In addition, the company operates travel review and comparison site; real estate housing information site; movie information site; photo sharing site; women's lifestyle media; information site for car lovers; Men's fashion Web magazine; bulk search site for job information; information media for overnight travel; culture information site; comparison site for highway and night buses; and lowest price comparison site for highway buses, airplanes, and bullet trains; and bus and travel/tourism information media. Further, it engages in finance business. Kakaku.com, Inc. was founded in 1997 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2376.T": {"short_name": "SCINEX CORPORATION", "long_name": "Scinex Corporation", "summary": "Scinex Corporation engages in the publishing, Web solution, logistics, and real estate businesses in Japan. It publishes my town encyclopedia, administrative information magazine, phonebooks, parenting support general information magazine, child rearing guide, and health information magazine, as well as Telepal 50, a 50-phonetic phone directory and Nasse, a regional information magazine. It also operates hometown tax payment sites; CityDO!, an area information site; our city promotion, a local video portal site; our city and a lot of nets; and various travel sites. In addition, the company provides food at the B2B portal site for restaurants; cloud type original CMS for administrative purpose; administrative application that dispatch administrative information to residents with smartphone application; and operates Yahoo! Japan with capital and business alliances to expand business areas. Further, it offers mail delivery and posting service. Scinex Corporation was founded in 1953 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Publishing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "2402.T": {"short_name": "AMANA INC", "long_name": "amana inc.", "summary": "amana inc. provides visual communication solutions for the production, management, and application of visual component and content. The company's stock materials services include planning and selling stock materials, copyrights and subject-rights services, content database, and content production and editing. It also offers visual content services, such as still photography, movie production, and 2D and 3D computer graphics; and communication solutions, including graphic design, TV commercials and movies, Websites, applications, events, editorial content, promotion, and branding. In addition, the company produces and publishes magazines under the IMA, MilK japon, Ryori Tsushin, and NATURE&SCIENCE names. The company was formerly known as amana holdings inc. and changed its name to amana inc. in April 2014. amana inc. was founded in 1979 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2411.T": {"short_name": "GENDAI AGENCY INC", "long_name": "Gendai Agency Inc.", "summary": "Gendai Agency Inc. engages in planning and production of advertising and promotion services in Japan. The company provides advertising services, online and mass media advertising, newspaper flyers, and sales promotions. Its services include video and web content production; and research and development. The company also engages in the planning, production, construction, and management of outdoor advertising; and real estate activities. In addition, it operates casino and electronic casino facilities; sells slot machines, etc.; and offers consulting services. The company was founded in 1995 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2433.T": {"short_name": "HAKUHODO DY HLDGS INC", "long_name": "Hakuhodo DY Holdings Inc", "summary": "Hakuhodo DY Holdings Inc., through its subsidiaries, operates as a marketing services company in Japan and internationally. It offers planning, production, marketing, public relations, and other services related to the presentation of advertising in various media, such as newspapers, magazines, radio, television, and digital media. The company also provides brand building services; and specializes in business development in the entertainment field, including animated programs and live events. In addition, it is involved in the planning, production, buying, and media traffic in media and contents businesses, as well as provision of marketing solutions for advertisers, media companies, and content holders. Hakuhodo DY Holdings Inc. was founded in 2003 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2436.T": {"short_name": "KYODO PUBLIC RELATIONS CO LTD", "long_name": "Kyodo Public Relations Co., Ltd.", "summary": "Kyodo Public Relations Co., Ltd. operates as an integrated communications and public relations agency in Japan and internationally. The company offers services in media relations, branding and strategy, social and digital, influencer marketing, public affairs, crisis and risk management, media training, and localization areas. It serves technology, travel and tourism, healthcare, finance, lifestyle, and other industries. The company was founded in 1964 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2440.T": {"short_name": "GURUNAVI INC", "long_name": "Gurunavi, Inc.", "summary": "Gurunavi, Inc., together with its subsidiaries, provides Web-based information services related to restaurants through PC and smartphones in Japan. The company also offers Internet-based PR and marketing support services to restaurants in China. In addition, it provides food-related research and information services; administrative outsourcing and welfare services; and support services related to the management of restaurants. The company was incorporated in 1989 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2454.T": {"short_name": "ALL ABOUT INC", "long_name": "All About, Inc.", "summary": "All About, Inc. engages in the Internet advertising business. It is also involved in the portal site operation, sampling, and learning business. In addition, the company engages in the operation of Facebook navi, a social media related business; citrus, a decentralized media platform; Tsui Navi, a Twitter navigation site; and DL market, a platform for buying and selling digital contents. The company was founded in 2000 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2477.T": {"short_name": "TEMAIRAZU INC", "long_name": "Temairazu, Inc.", "summary": "Temairazu, Inc. develops and operates comparison and reservation sites. It operates TEMAIRAZU and comparison.com. The company was formerly known as Hikaku.com Corporation and changed its name to Temairazu, Inc. in October 2017. Temairazu, Inc. was founded in 2003 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2481.T": {"short_name": "TOWNNEWS-SHA CO LTD", "long_name": "Townnews-Sha Co.,Ltd.", "summary": "Townnews-Sha Co.,Ltd. engages in the publishing business in Japan. It issues Town News, a local information paper. The company is also involved in the planning, production, and printing of various printed materials, such as postcards, business cards, and shop menu; and offers advertisement placement services. In addition, it publishes commemorative magazines and guidebooks; and plans and operates Websites, which include Political village, a database site introducing all politicians in Kanagawa prefecture and Rare A, a community-based event information site. Townnews-Sha Co.,Ltd. was founded in 1977 and is headquartered in Yokohama, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Publishing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Yokohama"}, "2489.T": {"short_name": "ADWAYS INC", "long_name": "Adways Inc.", "summary": "Adways Inc. provides affiliate advertisement services for PC and mobiles, and mobile application and content development services in Japan, China, Taiwan, the Philippines, and the United States. The company offers Unicorn, a marketing platform for mobile apps; AppDriver, a CPI based mobile ad platform; STROBELIGHTS, an performance ad management platform; Oct-pass, a native ad platform for smart phones; Smart-C, a Web affiliate service for feature phone and smartphone; JANet, a Web affiliate service for PCs and smartphones; and YACLE, a supporting service for advertisement expressions. It also provides Dobel, a video advertisement service; MASSIVE, a service that realizes automated mass production of banners; CHANet, an affiliate ad service for PC and smart phones; Keynet, a keyword ad service for Chinese web search engines; Blue Bee Box, a DSP trading desk tool. Blue Bee Native, a CPM based native ad network; adna, an ad analytics tool for PC, feature phone, and smart phone websites; and Rewardplus, a reward ad service for PC and mobile. In addition, the company offers Yoyaku Top10, a pre-registration platform for smart phone apps; SPOT, an online media that delivers going out and sightseeing information based on writers' experiences and interviews; and Leyifan, an international shipping agent service for overseas e-commerce users. Adways Inc. was founded in 2001 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2706.T": {"short_name": "BROCOLLI CO LTD", "long_name": "Broccoli Co., Ltd.", "summary": "Broccoli Co., Ltd. operates in the entertainment industry in Japan and internationally. It develops and creates various contents, including TV games, card games, CDs, and applications. The company was founded in 1994 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Entertainment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3137.T": {"short_name": "FUNDELY CO LTD", "long_name": "Fundely Co., Ltd.", "summary": "Fundely Co., Ltd. engages in the planning, editing, and publishing of mail order catalogue under the Meal Time name. It also provides marketing support services. The company was founded in 2000 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Publishing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3323.T": {"short_name": "RECOMM CO LTD", "long_name": "Recomm Co., Ltd.", "summary": "Recomm Co., Ltd. sells information and communication equipment in Japan. It sells business phones, digital multifunction machines, network products, LED lightings, and other office automation equipment. The company is also involved in the provision of installation work and maintenance services, Website creation, and mobile terminals sales services; Internet related services; electric retail; and franchise development services. Recomm Co., Ltd. was founded in 1994 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3622.T": {"short_name": "NETYEAR GROUP CORPORATION", "long_name": "Netyear Group Corporation", "summary": "Netyear Group Corporation operates digital marketing platform. It provides consulting services on digital marketing; planning and production of digital content; systems development; and planning and sale of marketing and cloud-based office tools. It also offers data analysis/effect measurement, and social media marketing support services. The company was founded in 1993 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3624.T": {"short_name": "AXEL MARK INC", "long_name": "Axel Mark Inc.", "summary": "Axel Mark Inc. engages in the planning and development of games in Japan. It develops console games and related content; and provides advertising services. The company was incorporated in 1994 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3635.T": {"short_name": "KOEI TECMO HOLDINGS CO LTD", "long_name": "Koei Tecmo Holdings Co., Ltd.", "summary": "Koei Tecmo Holdings Co., Ltd., together with its subsidiaries, operates as an entertainment company in Japan, North America, Europe, rest of Asia, and internationally. The company operates through Entertainment, Amusement, and Real Estate segments. The Entertainment segment develops and sells entertainment contents. It offers software for personal computers and gaming consoles. The Amusement segment develops commercial amusements; and manages amusement arcades. The Real Estate segment engages in the operation, management, and lease of real estate properties. It is also involved in the venture capital and other activities. The company was founded in 2009 and is headquartered in Yokohama, Japan. Koei Tecmo Holdings Co., Ltd. is a subsidiary of Koyu Holdings Co., Ltd.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Yokohama"}, "3641.T": {"short_name": "PAPYLESS CO LTD", "long_name": "Papyless Co., Ltd.", "summary": "Papyless Co., Ltd. sells and rents electronic books in Japan, the United States, and internationally. It offers novel and non-fiction books, practical books, photo books, comics, hobbies/life/magazines, utility books, business/education books, and audio and video books. The company also operates upppi, an e-book posting and editing platform; develops and produces next-generation content; and operates e-book agency. Papyless Co., Ltd. was founded in 1995 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Publishing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3646.T": {"short_name": "EKITAN & CO LTD", "long_name": "Ekitan & Co., Ltd.", "summary": "Ekitan & Co., Ltd. provides information services using the internet in Japan. The company's consumer business provides business services through various devices, such as PCs, tablets, smartphones, phone sites, and Android and iOS applications; and mobile phone carrier collaboration services, as well as engages in the travel and advertising businesses. Its corporate business is involved in the transfer guidance ASP/data license business that include transfer search and property search services; and contract development, business solution, inbound, and healthcare businesses. The company operates web site and application under the ekitan name. It also plans, designs, develops, produces, and sells software, homepages, etc.; and provides information survey, processing, and consulting services. Ekitan & Co., Ltd. was founded in 1997 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3656.T": {"short_name": "KLAB INC", "long_name": "KLab Inc.", "summary": "KLab Inc., together with its subsidiaries, plans, develops, operates, and publishes online mobile games worldwide. It also supports game development projects by providing full or partial funding for creating games; and provides advice for mobile game development and platforms for game design, as well as offers mobile game software development toolkits and server infrastructure solutions. In addition, the company provides marketing strategies, such as promotional activities, IP acquisition, planning and operations assistance, and support for global launches. KLab Inc. was founded in 2000 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3659.T": {"short_name": "NEXON CO LTD", "long_name": "NEXON Co., Ltd.", "summary": "NEXON Co., Ltd. produces, develops, and services PC online and mobile games. It operates through five segments: Japan, Korea, China, North America, and Others. The company's PC online game titles include MapleStory, Dungeon & Fighter, and EA SPORTS FIFA ONLINE 4. It offers approximately 60 online games in 190 countries. The company was formerly known as NEXON Japan Co., Ltd. and changed its name to NEXON Co., Ltd. in April 2009. The company was founded in 1994 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3661.T": {"short_name": "M UP HOLDINGS INC", "long_name": "m-up holdings, Inc.", "summary": "m-up holdings, Inc. engages in the mobile and PC content distribution, and e-commerce businesses in Japan. The company is also involved in the official fan site management; entertainment Website management; management of music/video distribution site; e-book label management; production of digital contents; and application creation for smartphones. In addition, it engages in the fan club Website operation; YouTube channel construction; and Website creation business. Further, the company is involved in the e-commerce activities consisting of the sale of CD, DVD, and goods; the management of collection brand site; planning and production of goods; and various mail order site management, as well as electronic ticket business. m-up holdings, Inc. was founded in 2004 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3662.T": {"short_name": "ATEAM INC", "long_name": "Ateam Inc.", "summary": "Ateam Inc. engages in the entertainment, lifestyle support, and e-commerce businesses worldwide. Its Entertainment Business segment plans, develops, and operates games and tool applications for smartphones and tablets. The company's E-Commerce Business segment plans, develops, and operates a bicycle mail order site. Its Lifestyle Support Business segment plans, develops, and operates web services, such as life events, comparison sites closely related to daily life, and information sites. Ateam Inc. was founded in 1997 and is headquartered in Nagoya, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Nagoya"}, "3664.T": {"short_name": "MOBCAST HLDGS INC", "long_name": "Mobcast Holdings Inc.", "summary": "Mobcast Holdings Inc., together with its subsidiaries, engages in gaming business in Japan and internationally. It operates game platform under the Mobcast brand name. The company engages in the production business of games and digital contents; and cooking contents business, such as kitchen miscellaneous good and restaurant management. It also offers internet related services, system development, and web design services; and investment, merger and acquisition, advisory, and fund management contracts services. The company was founded in 2004 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3667.T": {"short_name": "ENISH INC", "long_name": "enish,inc.", "summary": "enish,inc. plans, develops, and manages social application games in Japan. The company was founded in 2009 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3672.T": {"short_name": "ALTPLUSINC", "long_name": "AltPlus Inc.", "summary": "AltPlus Inc. engages in the planning, development, and direction of social games. The company was founded in 2010 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3674.T": {"short_name": "AUCFAN CO LIMITED", "long_name": "Aucfan Co., Ltd.", "summary": "Aucfan Co., Ltd. operates aucfan.com, a site for shopping and auction statistical price comparison in Japan. The company allows users to compare, search, and analyze auction, and shopping product and price information, as well as to see the prices and number of previous transactions. It serves corporate clients, sole proprietors, and individuals. The company was founded in 2007 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3686.T": {"short_name": "DLE INC", "long_name": "DLE Inc.", "summary": "DLE Inc. engages in the entertainment business in Japan. The company's activities include animation, live entertainment, music, mobile app and game development, and event planning; production management, concept designing, and other activities; and marketing solutions. It is also involved in the movies and television, and fashion businesses; and operation of in-house studios. The company was formerly known as Pasania, Ltd. and changed its name to DLE Inc. in October 2003. DLE Inc. was founded in 2001 and is based in Tokyo, Japan. DLE Inc. operates as a subsidiary of Asahi Broadcasting Group Holdings Corporation.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3688.T": {"short_name": "CARTA HOLDINGS INC", "long_name": "Carta Holdings, Inc.", "summary": "Carta Holdings, Inc. provides online advertising services in Japan and internationally. It operates through three segments: Partner Sales Business, Ad Platform Business, and Consumer Business. The Partner Sales Business segment offers advertising space and solutions through a media rep. The Ad Platform Business segment operates fluct, a supply side platform; CMerTV, a video advertising distribution platform; and PORTO, an ad platform for brand advertising, as well as ad distribution platforms under the Zucks and BEYOND X names. The Consumer Business segment owns media under the EC Navi and PeX names; and operates KAMIGAME, an integrated game, as well as EC sites. This segment is also involved in the investment and consulting businesses; and provides HR related services. The company was founded in 1996 and is based in Tokyo, Japan. Carta Holdings, Inc. is a subsidiary of Dentsu Group Inc.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3690.T": {"short_name": "YRGLM INC", "long_name": "YRGLM Inc.", "summary": "YRGLM Inc. provides marketing automation platforms in Japan. It offers AD EBiS, a platform which measures and analyzes the effect obtained from Internet advertisement; THREe, which enables automatic optimization and submission to the elements of marketing automation; and EC-CUBE, a commercial distribution platform, as well as ADREPO, an automatic creation tool for operational advertisement report. The company was formerly known as LOCKON Co., LTD. and changed its name to YRGLM Inc. in August 2019. The company was founded in 2001 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "3691.T": {"short_name": "REALWORLD INC", "long_name": "REALWORLD, inc.", "summary": "REALWORLD, inc. engages in cloud and point exchange businesses in Japan. It offers cloud service that provide means to earn various points through the Internet; crowd sourcing service where pints are accumulated by work, such as writing text and data entry; and cloud media service where points are accumulated in the request of documents and online shopping. The company also offers exchange services for points with cash, electronic money, gift certificates, etc. to members in the cloud business. REALWORLD, inc. was founded in 2005 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3738.T": {"short_name": "T-GAIA CORPORATION", "long_name": "T-Gaia Corporation", "summary": "T-Gaia Corporation sells and distributes mobile phones in Japan and Singapore. The company sells mobile phones, including smartphones, tablets, and various smart device related products and services through various sales channels comprising agents' shops, shops in large retail stores, and directly-managed shops. It also provides terminals and communication lines, as well as tools to resolve issues on management and operation, improving operational efficiency, implementing security measures, and proposing optimal operation plans and solutions that meet customer needs; movino star, a cloud service that caters to a range of needs for the management and operation of various communication devices, and management of licenses, such as MDM, and fixed-line telephones used by corporate clients; and T-GAIA Smart SUPPORT, a solution package that offers a range of support services, such as help desk, security desk, kitting, and master management services. In addition, the company offers broadband and other telecommunication services; network marketing services; and prepaid settlement services through convenience stores, including the sale of prepaid mobile phones, gift cards, and prepaid cards and codes. Further, it provides ICT online educational services through ICT School NEL Online. The company's sales channels consist of approximately 1,800 shops. The company was founded in 1992 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3758.T": {"short_name": "AERIA INC", "long_name": "Aeria Inc.", "summary": "Aeria Inc. offers content and information technology services. It operates through IT Service, Content, and Asset Management segments. The company develops, distributes, and operates games for smartphones and tablets; offers data services; and rents and sells real estate properties, as well as invests in companies. The company was founded in 2002 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3760.T": {"short_name": "CAVE INTERACTIVE CO LTD", "long_name": "CAVE Interactive CO.,LTD.", "summary": "CAVE Interactive CO.,LTD. develops content for media and entertainment industries in Japan. It is involved in developing social games and social media applications; planning, developing, and managing online services and games; performing project planning and system development for mobile information services; and developing commercial arcade and home console-oriented games. The company was founded in 1994 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3765.T": {"short_name": "GUNGHO ONLINE ENTERTAINMENT", "long_name": "GungHo Online Entertainment, Inc.", "summary": "GungHo Online Entertainment, Inc. plans, develops, operates, and distributes online computer games, smartphone applications, and console games. The company was formerly known as ONSale Co., Ltd. and changed its name to GungHo Online Entertainment, Inc. in August 2002. GungHo Online Entertainment, Inc. was founded in 1998 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3793.T": {"short_name": "DRECOM CO.LTD", "long_name": "Drecom Co.,Ltd.", "summary": "Drecom Co.,Ltd. plans and develops content for smartphones in Japan. It engages in games and media business. The company was founded in 2001 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3815.T": {"short_name": "MEDIA KOBO INC", "long_name": "Media Kobo, Inc.", "summary": "Media Kobo, Inc. provides digital content in Japan and internationally. It offers fortune-telling content; contents that utilize virtual reality, augmented reality, and mixed reality; and hardware and software products, as well as operates a Website that provides contents and columns to female. The company also plans, develops, and manages mobile social and iPhones/Android applications; designs Web applications; and publishes game applications. In addition, it is involved in the cross-border medical/EC and one to one marketing businesses. The company was founded in 1997 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3843.T": {"short_name": "FREEBIT CO.LTD", "long_name": "FreeBit Co., Ltd.", "summary": "FreeBit Co., Ltd. operates as an Internet business support company. The company provides network infrastructure services and information-communication services to corporations and consumers. It also offers multiple dwelling houses with network infrastructure services, home Internet of Things solutions, and real estate-related services, such as real estate brokerage, etc.; and Internet-based advertising services and affiliate advertising services. In addition, the company provides dispensing pharmacies and nursing care facilities with IT solutions, as well as medication notebook application and dispensing pharmacy reservation services; and language education solutions, such as language training, books and e-learning system, etc. to corporations, consumers, and educational institutions. The company was formerly known as FreeBit.com Co., Ltd. and changed its name to FreeBit Co., Ltd. in December 2002. FreeBit Co., Ltd. was founded in 2000 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3845.T": {"short_name": "I-FREEK MOBILE INC", "long_name": "I-Freek Mobile Inc.", "summary": "I-Freek Mobile Inc. engages in mobile content and IP businesses primarily in Japan and internationally. It also provides temporary staffing services. The company was founded in 2000 and is headquartered in Fukuoka, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Fukuoka"}, "3851.T": {"short_name": "NIPPON ICHI SOFTWARE INC.", "long_name": "Nippon Ichi Software, Inc.", "summary": "Nippon Ichi Software, Inc. develops and sells computer software in Japan, other Asian countries, North America, and Europe. It develops software for consumer and handheld game machines, mobiles, smart phones, arcades, and web; and produces content of various genres. The company was founded in 1993 and is headquartered in Kakamigahara, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kakamigahara"}, "3901.T": {"short_name": "MARKLINES CO LTD", "long_name": "MarkLines Co., Ltd.", "summary": "MarkLines Co., Ltd. operates an automotive industry portal in Japan. The company's Information Platform offers information about suppliers, such as who supplies whom, plant data, and market trends; sales and production statistics; reports on technology and market trends; and model plan data comprising forecasts and others in Japanese, Chinese, and English. It also provides advertisement and promotion platform that offers promotional emails and banner ads under the LINES name to its Information Platform members. The company serves OEMs, parts suppliers, machinery and equipment, solution vendors, transportation companies, trading companies, consultation firms, financial institutions, government, labor unions, universities, and construction companies. MarkLines Co., Ltd. was founded in 2001 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3903.T": {"short_name": "GUMI INC", "long_name": "gumi Inc.", "summary": "gumi Inc. provides online games for mobiles in Japan and internationally. It also engages in block chain business; and XR business comprising VR, AR, MR, etc. The company was founded in 2007 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3904.T": {"short_name": "KAYAK INC", "long_name": "KAYAC Inc.", "summary": "KAYAC Inc. develops social network games in Japan. It also operates a game community under the name Lobi; and Tonamel, a tournament format where organizers manage their tournaments; Pla-cole, a matching service for couples and wedding planners, as well as provides esports event planning and management, distribution, and production services under the Well Played name. In addition, the company offers home funeral and real estate services. KAYAC Inc. was founded in 1998 and is headquartered in Kamakura, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kamakura"}, "3911.T": {"short_name": "AIMING INC", "long_name": "Aiming Inc.", "summary": "Aiming Inc. engages in the production and development of online games for PCs, browsers, smartphones, home consoles, and mobile phones in Japan. The company was founded in 2011 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3926.T": {"short_name": "OPEN DOOR INC", "long_name": "OpenDoor Inc.", "summary": "OpenDoor Inc. provides Web services through the Internet in Japan. The company operates Travelko, a travel comparison site; TRAVELKO, a multi-language travel comparison site; and GALLERY JAPAN, a Japanese traditional art crafts site. It is also involved in the development and provision of online systems for the Internet and mobile phones; and planning and operation of software development and content delivery. OpenDoor Inc. was founded in 1997 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3928.T": {"short_name": "MYNET INC", "long_name": "Mynet Inc.", "summary": "Mynet Inc. provides game services in Japan. The company engages in redesigning of game, developing new functions, creating attractive characters, and improving the communication experience. It also operates CroPro, a mutual customer network for smartphone games; owns a range of high-quality assets; and provides data / AI solutions, such as Optim Robo, a marketing AI service that promotes customer acquisition and royal customerization for long-term service operation. The company was incorporated in 2006 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3930.T": {"short_name": "HATENA CO LTD", "long_name": "Hatena Co., Ltd.", "summary": "Hatena Co., Ltd. engages in the internet-related business in Japan. The company offers content platform and marketing services; and technology solutions service, such as big data, and contract and collaborative services. It also acts as a telecommunications operator. The company was founded in 2001 and is headquartered in Kyoto, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kyoto"}, "3932.T": {"short_name": "AKATSUKI INC", "long_name": "Akatsuki Inc.", "summary": "Akatsuki Inc. engages in the mobile game and live experience businesses primarily in Japan. It develops mobiles games. The company also operates Asobuild, an entertainment facility service site; Pong!Pong!, a ping pong table activity and projection mapping service site; Sotoasobi, a service site to provide reservations for outdoor and leisure activities; and Daigomi, a Cheese restaurants. In addition, it provides Crayon, an app development support services to artists, creators, and athletes; a media franchise project of both music and audio drama CDs on themes of Jazz; and operates Kumarba Channel, an education and entertainment channel distributed through YouTube platform. The company was founded in 2010 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3935.T": {"short_name": "EDIA CO LTD", "long_name": "Edia Co., Ltd.", "summary": "Edia Co., Ltd. provides game and life entertainment services. It also offers its various solutions for mobile terminals, such as mobile and smart phones, portable game machines, and portable navigation systems. The company was founded in 1999 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3961.T": {"short_name": "SILVER EGG TECHNOLOGY CO LTD", "long_name": "Silver Egg Technology Co., Ltd.", "summary": "Silver Egg Technology Co., Ltd. develops and provides artificial intelligence (AI) based Web marketing services and technology for analyzing big data in real time in Japan. The company offers Aigent Recommender, which provides performance based recommendation services; Aigent Recogazo, a real-time recommendation email service; HotView that offers recommendation advertisements; and consultant and tuning services. It also provides AI-leveraged cloud services, which enable Web businesses to serve customers with real-time personalization. Silver Egg Technology Co., Ltd. was founded in 1998 and is headquartered in Suita, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Suita"}, "3975.T": {"short_name": "AOI TYO HLDGS INC", "long_name": "AOI TYO Holdings Inc.", "summary": "AOI TYO Holdings Inc. engages in the production of various advertising video content in Japan and internationally. It also offers post-production services; xR content production services; and video, digital, PR, event, and spatial design solutions for the advertising and marketing sector. The company was founded in 2017 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3981.T": {"short_name": "BEAGLEE INC", "long_name": "Beaglee Inc.", "summary": "Beaglee Inc. engages in the content platform business. It is involved in e-book business, which include comic distribution, as well as gaming, influencer and content marketing, and other businesses. The company was founded in 2004 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3985.T": {"short_name": "TEMONA INC", "long_name": "TEMONA.inc.", "summary": "TEMONA.inc. provides mail order support services in Japan. It operates Egg repeat, a mail order integration Web system with shopping cart; Hikiaguer, a marketing tool for individual customer service; and URARA, a beauty and health magazine for adult women. The company also plans, designs, develops, manages, sells, and rents software; plans, sells, and mediates media information of advertisement and publicity using Internet; and provides information and content services on Internet, as well as plans and operates shopping malls. In addition, it offers supplementary services through e-commerce, sales, and mediation. Further, the company provides production and maintenance of management work. Additionally, it is involved in consulting and related business services. The company was founded in 2008 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3990.T": {"short_name": "UUUM CO LTD", "long_name": "UUUM co.,ltd.", "summary": "UUUM Co.,Ltd. operates as an online creator network in Japan. The company provides services that are focused on creating content in various medium, including development of promotion plans, media planning services, and video marketing consulting. It also provides content creation services; jointly operates the BonBonTV channel; develops games; and sells original merchandise, as well as holds offline events featuring appearances by UUUM creators. The company was founded in 2013 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3995.T": {"short_name": "SKIYAKI INC", "long_name": "SKIYAKI Inc.", "summary": "SKIYAKI Inc. engages in the platform, concert event production, and travel businesses in Japan. It offers Bitfan Pro, a platform that allows updating the functions for developing official site, fan club/fan site, EC site, and ticket pre-sale from a single management screen; QR code authentication and official secondary distribution services; and SKIYAKI GOODS for design purchase/creating original goods, and design sales. It is also involved in the provision of travel packages, fan club tour, and live event participation tour, as well as fan meeting and other event services. The company was founded in 2003 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4059.T": {"short_name": "MAGMAG INC", "long_name": "Magmag, Inc.", "summary": "Magmag Inc. engages in the development and operation of content distribution platform in Japan. It is also involved in the planning, development, and operation of Internet media. The company was founded in 1997 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4170.T": {"short_name": "KAIZEN PLATFORM INC", "long_name": "Kaizen Platform, Inc.", "summary": "Kaizen Platform, Inc. operates websites to UI/UX and video production for marketing/sales/promotion materials. The company offers KAIZEN Sales, a cloud sales support solution that accelerates digital transformation of remote sales; UX solutions, including KAIZEN Engine and KAIZEN Team; and video solutions comprising KAIZEN Ad, KAIZEN Video, and KAIZEN TV. It also provides DX human resources training courses. Kaizen platform Inc. was founded in 2013 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4286.T": {"short_name": "LEGS CO LTD", "long_name": "Legs Company, Ltd.", "summary": "Legs Company, Ltd. provides corporate marketing support services in Japan and internationally. The company offers campaign planning and database marketing services; and point of purchase and visual merchandising tools, as well as develops and produces premium goods/novelties and OEM products. It also specializes in tailoring promotional programs for specific needs and services. The company was founded in 1988 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4293.T": {"short_name": "SEPTENI HOLDINGS", "long_name": "Septeni Holdings Co., Ltd.", "summary": "Septeni Holdings Co., Ltd., through its subsidiaries, engages in the digital marketing and media platform businesses in Japan and internationally. The company provides Internet marketing support services, including marketing platform with cloud-based CRM, and sale and operation of smartphone-based Internet advertising. It also cultivates and produces Manga artists and distributes Manga works online. In addition, the company operates ViViViT, a matching-type recruitment platform that matches companies with students aspiring to be IT engineers and web designers; gooddo, a social contribution platform; and Pharmarket, a platform through which it purchases immobile stock from dispensary pharmacies and sells it on to other pharmacies. Further, it provides incubation support services that foster and cultivate new businesses from the initial creation stages. The company was formerly known as Septeni Co., Ltd. and changed its name to Septeni Holdings Co., Ltd. in October 2006. Septeni Holdings Co., Ltd. was founded in 1990 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4295.T": {"short_name": "FAITH INC", "long_name": "Faith, Inc.", "summary": "Faith, Inc. engages in creating and building contents distribution systems in Japan. The company provides contents for mobile devices, PC, game equipment, TV, car navigation system, and network audio system, etc. It offers Fans, a platform integrating a full range of music business functions; ecommerce and mail order platform; and sound source and ringtone melody platform.The company also provides ringtone melody and karaoke data and entertainment-type musical composition production, as well as, copyright processing business. In addition, it operates GIGA, that provides music and entertainment distribution; VIDEO Clipper, a platform that broadcast live music performance; JOYSOUND, operates mobile entertainment business; Rightsscale, a music distribution service; and Music Reminiscence, IOS application for music and brain mechanism. Further it, provides OKMusic, a social music medium; BARKS, that delivers music, artist videos, images, interviews, and live reports; Pop'n'Roll, that focuses on idol media and hidden talents; Fans' and Fans' Music, a fan club services and support servies; and with9, offer recruitment social media service. Additionally, it offers music software planning, artist management, advertising, and sale and publication management. It also offers support services under Goody Point, FaRao PRO, and SHOP brands.Faith, Inc. was founded in 1992 and is headquartered in Kyoto, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kyoto"}, "4298.T": {"short_name": "PROTO CORPORATION", "long_name": "Proto Corporation", "summary": "Proto Corporation provides automobile-related information services on new and used cars, parts and supplies. The company was founded in 1977 and is headquartered in Nagoya, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Nagoya"}, "4301.T": {"short_name": "AMUSE INC", "long_name": "Amuse Inc.", "summary": "Amuse Inc. engages in the artist management, content, media visual, place management, and other businesses in Japan and internationally. The company engages in music distribution, license management, development of new projects, record production, music management, and artist management services; planning, development, and operation of location business and inbound business; production and organizing of concerts, theatrical plays, theatrical entertainment, movies, and lectures; operation, planning, and management of restaurants; and planning and sale of character merchandise. It is also involved in planning, production, tour attending, and consulting work related to live performances and events; development of Belgian beer bars, and importing and wholesale business; artist merchandising, and apparel business; planning, manufacturing, and sale of ladies apparel under the MUVEIL and Agris brand, and men's apparel under the Junhashimoto brand; and mail order and fan club management, as well as the provision of tickets, venue solutions, other solutions, etc. In addition, the company engages in live broadcast of live entertainment, such as concerts, events, and stage performances to movie theaters and music halls; planning, production, and distribution of pre-recorded contents, including films, concert films, and TV programs; and E-ticket sales platform business, as well as offers consulting services. Further, it is involved in operating theme parks. Amuse Inc. was incorporated in 1977 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Entertainment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4308.T": {"short_name": "J-STREAM IMC", "long_name": "J-Stream Inc.", "summary": "J-Stream Inc. engages in planning, production, licensing, and sale of content and publication in Japan. The company offers content delivery services, including the distribution of video and audio content, such as music, movies, events, corporate briefings, education, and advertisements through the Internet; and advertising planning and production, media planning, and other services. It is also involved in the content planning, video recording/editing, and direction on online live sites; voice recording; website development; digitization of existing videos and conversion of video files; and web-based membership information, e-commerce, and settlement services. In addition, the company engages in planning, development, operation, production, sales, import/export, leasing, and agent business of web-based hardware, software, and other services; and planning, production, and agency business related to advertisement. J-Stream Inc. was founded in 1997 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Entertainment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4324.T": {"short_name": "DENTSU GROUP INC", "long_name": "Dentsu Group Inc.", "summary": "Dentsu Group Inc. operates in the advertising business in Japan and internationally. The company offers advertising services, including newspapers, magazines, radio, television, internet, sales promotions, movies, outdoors, transportation, and other advertising operations and advertising expressions. It is also involved in the consulting, development, and operation of information systems; sale of various software products; and provision of marketing and comprehensive network services. In addition, the company leases office buildings; and buys and sells real estate properties, as well as offers building and commission calculation services. Dentsu Group Inc. was founded in 1901 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4326.T": {"short_name": "INTAGE HOLDINGS INC", "long_name": "INTAGE HOLDINGS Inc.", "summary": "INTAGE HOLDINGS Inc. operates as a marketing research company in Japan and internationally. It operates through Marketing Support (Consumer Goods & Services), Marketing Support (Healthcare), and Business Intelligence segments. The company offers panel and custom research services to provide marketing support for a range of clients, including consumer goods manufacturers, advertisers, government agencies, and IT companies; and prescription information analysis services, and marketing survey and research of over-the-counter (OTC) and prescription drugs for pharmaceutical companies, as well as operates as a contract research organization. It also provides system development/operation, business process outsourcing, data center operation, and data utilization services; data modeling; enterprise solutions and research; and architecture, operation, introduction support, and auditing of IT infrastructure for the pharmaceutical, health information, manufacturing, travel, publishing, consumer goods manufacturing, services, advertising, wholesale, and retail sectors. The company was formerly known as INTAGE Inc. and changed its name to INTAGE HOLDINGS Inc. in October 2013. INTAGE HOLDINGS Inc. was founded in 1960 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4334.T": {"short_name": "YUKE'S CO LTD", "long_name": "YUKE'S Co.,Ltd.", "summary": "YUKE'S Co.,Ltd. designs, develops, creates, and distributes gaming software in Japan and internationally. It offers WWE, UFC, pro wrestling, action, and other games for PS4, XBOX ONE, PS3, XBOX 360, Wii, PS2, PSP, DS, arcade, Nintendo Switch, PC, GC, DC, N64, and other platforms. The company was founded in 1993 and is headquartered in Sakai, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Sakai"}, "4341.T": {"short_name": "SEIRYO ELECTRIC CORPORATION", "long_name": "Seiryo Electric Corporation", "summary": "Seiryo Electric Corporation operates in the information and communication technology field in Japan. The company offers radio system and tracking management solutions comprising automatic vehicle monitoring, disaster prevention and administrative radio, airport vehicle positioning, cloud-based telemetry, IP radio, and golf irrigation management systems for local government and private sectors. It also provides security and visual information solutions, such as closed-circuit television, digital signage, and intruder-monitoring security sensor systems; and tsunami alerting, river information, sluice gate control and management, road traffic and weather information, and sediment and weather condition notification systems, as well as road information systems for submergence to serve local government. In addition, the company offers queue management systems for retail operations; and radio communication equipment, as well as consulting, designing, and operation of systems. The company was founded in 1966 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "4395.T": {"short_name": "ACCRETE INC", "long_name": "Accrete Inc.", "summary": "Accrete Inc. provides SMS international gateway services in Japan. It also offers IT and Internet solution services. The company was founded in 2014 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4423.T": {"short_name": "ARTERIA NETWORKS CORP", "long_name": "ARTERIA Networks Corporation", "summary": "ARTERIA Networks Corporation provides telecommunication network services in Japan. The company offers leased circuit (Ethernet) access services; virtual private network services through dedicated closed network; cloud services, including consulting, installation, and operation; Internet access; IP telephone/landline services; security/network monitoring solutions; data center services, including housing and co-location services; and mobile device management and monitoring solutions. It also provides Internet access services for condominiums; and equipment engineering services, including information and communications equipment installation. The company was founded in 1997 and is headquartered in Tokyo, Japan. ARTERIA Networks Corporation is a subsidiary of Marubeni Corporation.", "currency": "JPY", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4436.T": {"short_name": "MINKABU THE INFONOID INC", "long_name": "MINKABU THE INFONOID, Inc.", "summary": "MINKABU THE INFONOID, Inc. provides financial information services in Japan and internationally. It offers stock information distribution services; and commodity futures information services. The company also provides services, including system development services, such as planning, design, development, operation support, etc., as well as development of financial information media. MINKABU THE INFONOID, Inc. was founded in 2006 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4482.T": {"short_name": "WILLS INC", "long_name": "WILLs Inc.", "summary": "WILLs Inc. develops and offers a shareholder management platform using blockchain technology in Japan and internationally. The company develops and offers Premium Special Club, a platform that allows listed companies to exchange shareholder special points and products, and exercise electronic voting rights through WILLsVote; and Premium Special Club PORTAL, a portal site that allows the exchange of approximately 3,000 reward products by exchanging the shareholder reward points issued by each listed company with WILLsCoin. It also provides IR-navi, an institutional investor marketing platform that connects listed companies, institutional investors, and individual investors on the cloud to acquire and exchange information interactively. In addition, it plans and develops communication tools to investors, such as integrated reports and annual reports. The company was founded in 2004 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4485.T": {"short_name": "JTOWER INC", "long_name": "JTOWER Inc.", "summary": "JTOWER Inc. provides infrastructure sharing services in Japan. The company engages in the design and construction of information communication infrastructure services; design and development of communications-related solutions; and provision of information communications services. It offers in-building infrastructure sharing and cloud-managed Wi-Fi services to landlords and mobile network operators; site locator systems; and outdoor tower sharing and local 5G services. The company was founded in 2012 and is headquartered in Tokyo, Japan. JTOWER Inc. is a subsidiary of Nippon Telegraph and Telephone Corporation.", "currency": "JPY", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4497.T": {"short_name": "LOCOGUIDE INC", "long_name": "Locoguide Inc.", "summary": "Locoguide Inc. provides flyer and shopping information services in Japan. It operates Tokubai, a flyer and shopping information site that connects local consumers with local retail stores; and Lokonavi, an information site. The company was founded in 2016 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4499.T": {"short_name": "SPEEE INC", "long_name": "Speee, Inc.", "summary": "Speee, Inc. engages in the marketing intelligence and digital transformation businesses in Japan. It offers UZOU, an ad distribution platform; VOYAGER, an integrated ad operation platform; and Markeship, a digital marketing support platform, as well as consulting services. The company also operates Yeur, a site that supports real estate sales; Yeoul, a Web service for collective assessment of real estate sales; and Nurikae for requesting a quote for exterior wall/roof painting. Speee, Inc. was founded in 2007 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4728.T": {"short_name": "TOSE CO LTD", "long_name": "Tose Co., Ltd.", "summary": "Tose Co., Ltd. plans, develops, and operates home video game software, and mobile and Internet content worldwide. It also develops commercial-use game and pachinko/pachislot machines software; and smartphone games, apps, and Websites; various Web-based business systems, such as operational systems, system apps, and IT infrastructure; and partial commissioned elements that are indispensable for creating video game software, including game backgrounds, graphic designs of characters and others, as well as background music, sound effects, and other audio-related areas. In addition, the company supports for content promotion; sale of programs to local TV stations; license business with local companies, as well as provides content distribution services for smartphones. Further, it engages in the planning, development and operation of network-based content, such as home karaoke music distribution and digital comic distribution. Tose Co., Ltd. was founded in 1979 and is headquartered in Kyoto, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kyoto"}, "4800.T": {"short_name": "ORICON INC", "long_name": "Oricon Inc.", "summary": "Oricon Inc. engages in the design and operation of Websites. The company also offers news distribution services; music/book distribution services for smartphones and PCs; and content distribution service for feature phones. In addition, it publishes Confidence, a business magazine for the entertainment industry; provides marketing data and ranking information for music, video, and books; and offers music database for broadcasting stations and EC sites. The company was founded in 1999 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4816.T": {"short_name": "TOEI ANIMATION", "long_name": "Toei Animation Co.,Ltd.", "summary": "Toei Animation Co.,Ltd. produces, markets, and licenses animation products worldwide. It operates through three segments, Video Production and Sales Business, Copyright Business, and Product Sales Business. The company plans and produces various animation works for theaters and television, terrestrial broadcasting, CS broadcasting, and packaging, and sells in various media forms such as game software, mobile terminals, and the internet. It also develops and sells character products. As of March 2020, it owns 246 theater works, 223 TV works, and 12,867 episodes of content. The company was founded in 1948 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Entertainment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4833.T": {"short_name": "SUCCESS HOLDERS INC", "long_name": "Success Holders Inc.", "summary": "Success Holders Inc. engages in the publication and distribution of magazines in Japan. The company publishes Home, a regional information magazine; L'alaPado for office delivery for working women; Hama Kara; We:la and BUZZ CLIP; and Kichijoji ECCO !!, an annual magazine introducing local medical institutions. It also operates an information PC and mobile site linked with free paper, such as regional portal site Pad Navi and Baba Navi Mobile; Gurumepa, a genre site; Kirei Ba, a neighborhood doctor net; and BeYOU for beauty information. In addition, the company develops a mobile phone delivery tool, which provides an ASP service of cellular mail that can transmit information to members. The company was formerly known as Pado Corporation and changed its name to Success Holders Inc. in October 2020. Success Holders Inc. was founded in 1987 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Publishing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4838.T": {"short_name": "SPACE SHOWER NETWORKS INC", "long_name": "Space Shower Networks Inc.", "summary": "Space Shower Networks Inc., a music entertainment company, develops various media and content businesses in Japan. The company operates Space Shower TV, a music specialty channel; produces and distributes digital contents for smartphones/PCs, film production, etc.; and hosts live events. It also provides artist management, music labels, and digital music distribution services; and manufactures and sells CDs. In addition, the company offers music videos; creates and plans a range of video content, including live video, CM, corporate VP, and others; and provides indie music through records, CDs/DVDs, magazines, and books. Further, it operates six stores with maid cafe Aho-mu CafÃ©; and a fan club for community of artists and fans, as well as manages music copyrights and software. The company was founded in 1994 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Broadcasting", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4839.T": {"short_name": "WOWOW INC", "long_name": "Wowow Inc.", "summary": "Wowow Inc. provides broadcasting and related services in Japan. It procures and produces programs through satellite broadcasting, as well as offers services through cable television, satellite communication broadcasting, and IPTV. In addition, it operates three broadcasting channels that broadcast movies, musics, and documentaries, as well as offers telemarketing services. The company was formerly known as Satellite Broadcasting, Inc. and changed its name to Wowow Inc. in December 2000. Wowow Inc. was founded in 1984 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Broadcasting", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6031.T": {"short_name": "SCIGINEER INC", "long_name": "Scigineer Inc.", "summary": "Scigineer Inc. engages in the Internet media and Internet advertising agency businesses in Japan. It is also involved in the planning and development of Internet and Web, and computer systems; sale and maintenance of information systems; research and development in the fields of computer science and artificial intelligence; and provision of consulting and management services. The company was founded in 2005 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6033.T": {"short_name": "EXTREME CO LTD", "long_name": "Extreme Co.,Ltd.", "summary": "Extreme Co.,Ltd. engages in entertainment business in Japan. The company is involved in the provision of B2B solutions; and B2C contents development, including publishing games, localizing games from overseas, and licensing business. It serves financial companies, government offices, communication enterprises, and mobile game publishers. Extreme Co.,Ltd. was founded in 2005 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6045.T": {"short_name": "RENTRACKS CO LTD", "long_name": "Rentracks CO.,LTD.", "summary": "Rentracks Co.,Ltd. offers WEB consulting and Internet media services in Japan and internationally. The company's WEB consulting services include SEO, SEM, customer attraction Websites building, Web production, and advertising agency services; and Internet media services comprise planning, production, and operation of various Websites. It also operates as a closed affiliate service provider; and GAME FEAT that provides advertising services to support monetization of game apps, as well as RT Management, a cloud type personnel affairs system service. The company was formerly known as Coel Co, Ltd. and changed its name to Rentracks Co.,Ltd. in January 2006. Rentracks Co.,Ltd. was founded in 2005 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6046.T": {"short_name": "LINKBAL INC", "long_name": "Linkbal Inc.", "summary": "Linkbal Inc. operates event e-commerce and experiential consumption platforms in Japan. It also operates CoupLink, an online dating app; Pairy, an app for couples; KOIGAKU, a dating information media platform; iVERY, a marriage and dating information media platform; Jinji talk, a matchmaking app for students and HR; and Mamakon, a maternity wedding consultation counter. The company was founded in 2011 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6049.T": {"short_name": "ITOKURO INC", "long_name": "ItoKuro Inc.", "summary": "ItoKuro Inc. provides media and consulting services in Japan. It operates school information portal sites for infants, elementary school students, junior high school students, high school students, and parents to search and compare educational cram schools and preparatory schools; and for nurseries, kindergartens, elementary schools, junior high schools, high schools, vocational schools, and universities. The company also operates tutor comparison net, medical school examination manual, and medical school preparatory school guide sites. In addition, it provides consulting services in marketing to clients in the education industry. ItoKuro Inc. was founded in 2006 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6094.T": {"short_name": "FREAKOUT HOLDINGS INC", "long_name": "FreakOut Holdings, inc.", "summary": "FreakOut Holdings, inc., through its subsidiaries, offers advertising solutions in Japan and internationally. It engages in the development and sale of DSPs and DMPs; data mining, development, and sale of ad applications; and planning and sale of advertising. The company is also involved in IoT-based digital signage business; global app marketing, pubic relations, and media business; provision of trading desk and monetization platform for digital media; and female-focused media, and digital creative and performance agencies businesses. In addition, it operates a data-driven digital agency that specializes in programmatic ad operation and data science; and engages in cross-device tracking and targeted advertising business utilizing video/image/beacon recognition technology. FreakOut Holdings, inc. was formerly known as FreakOut, inc and changed its name to FreakOut Holdings, inc. in January 2017. The company was founded in 2010 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6176.T": {"short_name": "BRANGISTA INC", "long_name": "Brangista Inc.", "summary": "Brangista Inc. publishes digital magazines primarily in Japan. The company offers Tabiiro, a travel guide for adult women; GOODA, a fashion for professional man; SUPER CEO, a business magazine for leaders; and Seikeidenron that contains knowledge of politics and economics. It also provides madream, a personal lifestyle design magazine; HowB, a mobile-compatible web magazine that focuses on how to get a beautiful face and body for young girls; LiSTA, a fashion magazine; Tabesaki, a gourmet information guide; and Nomitabibon, a lifestyle magazine. In addition, the company provides support services; and cloud tools that enable the integrated management of products, orders, and inventories for e-commerce sites. Further, it offers Website translation, creation, and renewal services, as well as SEO services; and logistics services to the online shops. The company was founded in 2000 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Publishing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6177.T": {"short_name": "APPBANK INC", "long_name": "AppBank Inc.", "summary": "AppBank Inc. provides iPhone applications, iPhone case accessories, and iPhone related news through AppBank.net site. It also provides movie media services through Max Murai Channel and AppBankTV; and operates gaming Websites, including Pazudora Ultimate Capture Database and Monst Strategy, as well as iPhone and android applications. In addition, the company offers puzzle games; and sells banner and article advertisements to support companies and individual developers. Further, it engages in the rights management and store businesses. AppBank Inc. was founded in 2008 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6428.T": {"short_name": "OIZUMI CORP", "long_name": "OIZUMI Corporation", "summary": "OIZUMI Corporation manufactures and sells amusement machines and related devices and equipment in Japan. The company offers pachislot machines, preparatory devices, WICA series products, eco equipment, and medal supply collect products. It also leases and manages real estate properties. The company was founded in 1974 and is headquartered in Atsugi, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Atsugi"}, "6460.T": {"short_name": "SEGA SAMMY HLDGS INC", "long_name": "Sega Sammy Holdings Inc.", "summary": "Sega Sammy Holdings Inc., through its subsidiaries, engages in the game machine, entertainment contents, and resort businesses. The company's Pachislot and Pachinko Machines Business segment develops, manufactures, and sells pachislot and pachinko machines. Its Entertainment Contents Business segment is involved in the development and sale of digital game software, packaged game software, and amusement machines; development and operation of amusement centers; planning, production, and sale of animated films; and development, manufacture, and sale of toys. The company's Resort Business segment develops and operates hotels and golf courses, etc. in integrated resorts business and other facilities businesses. Sega Sammy Holdings Inc. was founded in 2004 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6533.T": {"short_name": "ORCHESTRA HOLDINGS", "long_name": "Orchestra Holdings Inc.", "summary": "Orchestra Holdings Inc. engages in the digital transformation, digital marketing, and other businesses in Japan. The company's solutions include operational advertisement, Website/application development, content marketing, SEO, and data analysis. It is also involved in the provision of innovation sharing services; venture capital services to entrepreneurs; talent management cloud services; and M&A advisory services. It also engages in the development, design, construction, and operation of cloud-based contact centers. The company was formerly known as Digital Identity Inc. and changed its name to Orchestra Holdings Inc. in July 2017. Orchestra Holdings Inc. was founded in 2009 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6535.T": {"short_name": "I MOBILE CO LTD", "long_name": "i-mobile Co.,Ltd.", "summary": "i-mobile Co., Ltd. provides Internet advertising platform for clients to advertise their product and for publishers to monetize their cyberspace in Japan. The company was founded in 2007 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6543.T": {"short_name": "NISSEN INC", "long_name": "Nissen Inc.", "summary": "Nissen Inc. engages in communication design/advertising, promotion strategy development/ sales promotion/consulting/surveying businesses in Japan. The company also offers graphic design/copywriting/corporate identity development/catalog production/Web site production/display design/edit/production of PR magazine/CM production/movie production/talent casting/various advertisement design services. In addition, it offers media publishing and agency services; catalog/poster/brochure/calendar/sales promotion tool/novelty printing services; and call center/various telemarketing services. Nissen Inc. was founded in 1947 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6550.T": {"short_name": "FRINGE81 CO LTD", "long_name": "Fringe81 Co, Ltd.", "summary": "Fringe81 Co, Ltd. provides Internet advertising technology development/consulting services in Japan. The company offers Unipos, a service to send and receive peer bonuses; docomo Ad Network, a service that advertises large-scale data of NTT DoCoMo using real-time processing technology of various data and distribution optimization technology in the site and application visited by users; digitalice, which measures video advertisements; Columva, an advertising operation reviewing support tool to make ad operations decision making faster/easier; and TagKnight, a solution and consulting service that allows to check the task of installing tags on behalf of advertisement companies and advertising agencies, as well as for testing tags. It also provides advertisement planning and operation services, as well as Web services in HR Tech areas, etc. The company was incorporated in 2012 and is based in Tokyo, Japan. Fringe81 Co, Ltd. is a subsidiary of Fringe81 Holdings Co., Ltd.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6552.T": {"short_name": "GAMEWITH INC", "long_name": "GameWith Inc.", "summary": "GameWith Inc. provides game information services in Japan. The company operates GameWith, a service that provides information and functions related to games. It offers game guide, which provides game-playing tips; and game review information to find a new game. The company also provides a community that allows game users to communicate with each other, as well as offers video streaming services. GameWith Inc. was founded in 2013 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6562.T": {"short_name": "GENIEE INC", "long_name": "Geniee, Inc.", "summary": "Geniee, Inc. engages in the Internet advertisement technology business in Japan and internationally. It provides Geniee SSP, a platform that compares various deals, such as pure ads, real time bids from demand side platforms and ad exchanges, and ads from multiple ad networks and affiliate ads, as well as serves ads that enhance the revenue for online publishersl; Geniee Trading Desk, an integrated operation service for display ads; DMP, a data platform that stores and analyzes data from ads, marketing, media, and users; and Data Exchange that enables the delivery of online ads and email ads using membership data and various types of medium audience data. The company also offers direct bidding tool for advertising agencies; GenieeDMP tool for advertising; GAURL, a technology that enables stable management of AdSense accounts and revenue maximization; and MAJIN, a marketing automation platform. In addition, it provides Demand Side Platform that allows advertisers and advertising agencies to buy advertising inventory, serve advertisements, and target the display destination and audience. Geniee, Inc. was founded in 2010 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6579.T": {"short_name": "LOGLY INC", "long_name": "logly,Inc.", "summary": "logly, Inc. operates as a technology company in Japan. The company operates logly lift, an advertising service platform that delivers corporate content to users through media and brand recognition, and product needs; Loyalfarm, an audience training tool to analyze action and engagement of readers who visited the site and to repeat them; and Zenback, a widget to collect information about articles from various parts of the net. It primarily serves advertisers and distributors. The company was founded in 2006 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7036.T": {"short_name": "EMNET JAPAN CO LTD", "long_name": "eMnet Japan.co.ltd.", "summary": "eMnet Japan.co.ltd. engages in the Internet advertising business. The company offers search linked, operational display, SNS, feed, and net advertising services; overseas advertising services; access analysis; and content marketing services. It is also involved in the Website creation and LP/banner production activities. The company was founded in 2007 and is based in Tokyo, Japan. eMnet Japan.co.ltd. is a subsidiary of eMnet Inc.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7044.T": {"short_name": "PIALA INC", "long_name": "Piala Inc.", "summary": "PIALA Inc. provides marketing services in Asia. It offers a range of services, such as marketing, event, system/apps development, design, etc., as well as develops various services as a general support for its clients, such as solution for real/Web media, big data analysis, and consultation. The company was founded in 2004 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7068.T": {"short_name": "FEEDFORCE INC", "long_name": "Feedforce Inc.", "summary": "Feedforce Inc. engages in data feed, digital advertising, social media marketing, and other businesses in Japan. The company offers Social PLUS, an ASP service that implements external ID collaboration on customers Website based on the social login function; and EC Booster, an advertising operation automation tool that delivers Google Shopping Ads. It also provides Dfplus.io, a data feed integrated management platform for ad managers to draw out feed advertisement performance; DF PLUS, a data feed operation ASP service that converts, optimizes, and distributes the product data of a company to various media, such as dynamic banner ads, retargeting ads, external media sites, etc.; and Feedmatic, a service that plans, designs, and operates advertising operations. The company was incorporated in 2006 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7077.T": {"short_name": "ALINK INTERNET INC", "long_name": "ALiNK Internet, Inc.", "summary": "ALiNK Internet, Inc. plans, develops, and manages Internet media. It offers Tenki.jp, an application that shows current weather, temperature, and rain clouds information. The company also provides information, such as weather explanations by weather forecasters, as well as earthquake and typhoon information. In addition, it offers Internet consulting and advertising agency services. The company was founded in 2013 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7082.T": {"short_name": "JIMOTY INC", "long_name": "Jimoty, Inc.", "summary": "Jimoty, Inc. engages in the planning, development, and operation of classified site in Japan. It operates Jimoti, a local information bulletin board. The company was founded in 2011 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7095.T": {"short_name": "MACBEE PLANET INC", "long_name": "Macbee Planet, Inc.", "summary": "Macbee Planet,Inc. engages in analytics consulting business in Japan. The company is involved in marketing analysis activities, which builds LTV prediction models by analyzing and visualizing purchasing data to derive optimal marketing methods; and the marketing technology business that offers sales and operation support for in-house developed products utilizing data and technology. Its products include Robee web customer service tool and Honeycomb data analysis platform. The company was founded in 2015 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7356.T": {"short_name": "RETTY INC", "long_name": "Retty Inc.", "summary": "Retty Inc. operates gourmet platform. It operates Retty, a platform that provides information on restaurants in Japan. The company was founded in 2010 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7357.T": {"short_name": "GEOCODE CO LTD", "long_name": "GEOCODE CO.,Ltd.", "summary": "GEOCODE CO.,Ltd. engages web marketing and cloud businesses. The company offers search engine optimization and advertisement agency services; and website and various systems planning, production, and consulting services. It also develops, operates, and sells Next IC Card, a cloud-based attendance management, transportation expenses, and expense settlement tool; and Next SFA, a cloud-based sales support tool. The company was founded in 2005 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7803.T": {"short_name": "BUSHIROAD INC", "long_name": "Bushiroad Inc.", "summary": "Bushiroad Inc. plans, develops, produces, and sells various trading card games in Japan. It also offers online mobile games; plans, produces, and manages music and video content, as well as merchandise. In addition, the company creates and distributes character goods to toy stores, general retailers, and hobby shops; manufactures and sells items for capsule toy vending machines; produces arcade prizes; and operates an e-commerce shop. Further, it edits and publishes Gekkan Bushiroad, a monthly magazine full of comics and TCG information; produces television programs; operates an Internet radio platform; and provides product planning and media agency services. Additionally, the company offers voice actor management services; pro-wrestling entertainment services, as well as management of fan club; and advertisement agency services. Bushiroad Inc. was founded in 2007 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7844.T": {"short_name": "MARVELOUS INC", "long_name": "Marvelous Inc.", "summary": "Marvelous Inc. produces and provides entertainment content in Japan. The company engages in the planning, development, and operation of online games for App stores, Google Play, and SNS platforms, as well as online games for PCs, mobiles, smartphones, tablets, etc.; planning, development, production, and sells of game software for home game consoles; production of content for market needs; and planning, development, operation, and sale of amusement enclosures. It also produces animation products; creates, commercializes, and distributes music and video content; and plans and produces stage-based and musical works based on comics, animation, and games, as well as provides theater entertainment. Marvelous Inc. was founded in 1997 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7860.T": {"short_name": "AVEX INC", "long_name": "Avex Inc.", "summary": "Avex Inc., an entertainment company, engages in music, anime, digital, and other businesses in Japan. The company plans, produces, and sells musical content, including sound sources and images; publishes and distributes music; and plans, produces, and manages live concerts, special events, stage performances/musicals, and various featuring artists. It also manages artists, celebrities, creators, athletes, intellectuals, and others; operates fan clubs; and sells tickets. In addition, the company is involved in building an integrated framework for discovering, fostering, and developing of talent. Further, it plans, produces, and sells animated shows in various forms, merchandising goods, special events, games, and movies; and designs and manages digital platforms dTV and AWA. The company was formerly known as Avex Group Holdings Inc. and changed its name to Avex Inc. in November 2017. Avex Inc. was founded in 1988 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Entertainment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7974.T": {"short_name": "NINTENDO CO LTD", "long_name": "Nintendo Co., Ltd.", "summary": "Nintendo Co., Ltd., together with its subsidiaries, develops, manufactures, and distributes electronic entertainment products in Japan, the Americas, Europe, and internationally. It offers video game platforms, playing cards, Karuta, and other products; and handheld and home console hardware systems and related software. The company was formerly known as Nintendo Playing Card Co., Ltd. and changed its name to Nintendo Co., Ltd. in 1963. Nintendo Co., Ltd. was founded in 1889 and is headquartered in Kyoto, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kyoto"}, "7NX.F": {"short_name": "NEXON CO. LTD", "long_name": "NEXON Co., Ltd.", "summary": "NEXON Co., Ltd. produces, develops, and services PC online and mobile games. It operates through five segments: Japan, Korea, China, North America, and Others. The company's PC online game titles include MapleStory, Dungeon & Fighter, and EA SPORTS FIFA ONLINE 4. It offers approximately 60 online games in 190 countries. The company was formerly known as NEXON Japan Co., Ltd. and changed its name to NEXON Co., Ltd. in April 2009. The company was founded in 1994 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "7NX.SG": {"short_name": "Nexon Co. Ltd Registered Shares", "long_name": "NEXON Co., Ltd.", "summary": "NEXON Co., Ltd. produces, develops, and services PC online and mobile games. It operates through five segments: Japan, Korea, China, North America, and Others. The company's PC online game titles include MapleStory, Dungeon & Fighter, and EA SPORTS FIFA ONLINE 4. It offers approximately 60 online games in 190 countries. The company was formerly known as NEXON Japan Co., Ltd. and changed its name to NEXON Co., Ltd. in April 2009. The company was founded in 1994 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "STU", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "7QT.F": {"short_name": "AKATSUKI INC.", "long_name": "Akatsuki Inc.", "summary": "Akatsuki Inc. engages in the mobile game and live experience businesses primarily in Japan. It develops mobiles games. The company also operates Asobuild, an entertainment facility service site; Pong!Pong!, a ping pong table activity and projection mapping service site; Sotoasobi, a service site to provide reservations for outdoor and leisure activities; and Daigomi, a Cheese restaurants. In addition, it provides Crayon, an app development support services to artists, creators, and athletes; a media franchise project of both music and audio drama CDs on themes of Jazz; and operates Kumarba Channel, an education and entertainment channel distributed through YouTube platform. The company was founded in 2010 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "88A.F": {"short_name": "ATEAM INC.", "long_name": "Ateam Inc.", "summary": "Ateam Inc. engages in the entertainment, lifestyle support, and e-commerce businesses worldwide. Its Entertainment Business segment plans, develops, and operates games and tool applications for smartphones and tablets. The company's E-Commerce Business segment plans, develops, and operates a bicycle mail order site. Its Lifestyle Support Business segment plans, develops, and operates web services, such as life events, comparison sites closely related to daily life, and information sites. Ateam Inc. was founded in 1997 and is headquartered in Nagoya, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Nagoya"}, "9401.T": {"short_name": "TBS HOLDINGS INC", "long_name": "TBS Holdings,Inc.", "summary": "TBS Holdings,Inc. engages in the broadcasting, video and cultural, and real estate businesses primarily in Japan. It is involved in the TV and radio broadcasting, and related activities; plans, produces, distributes, and sells video, audio, and music software. The company also engages in retailing of general merchandises; production and selling of cosmetic products; and mail order sales and eating out businesses. In addition, it is involved in leasing, maintenance, and servicing of real estate properties; operation and management of parking lot; provision of studio and air conditioning management; staffing and accounting work; land rental; heat supply; and leasing of equipment, as well as acts as a general insurance agent. The company was formerly known as Tokyo Broadcasting System Holdings, Inc. and changed its name to TBS Holdings,Inc. in October 2020. TBS Holdings,Inc. was founded in 1951 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Broadcasting", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9407.F": {"short_name": "RKB MAINICHI HOLDINGS CORP", "long_name": "RKB Mainichi Holdings Corporation", "summary": "RKB Mainichi Holdings Corporation engages in the radio and television broadcasting business in Japan. The company was founded in 1951 and is based in Fukuoka, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Broadcasting", "exchange": "FKA", "market": "jp_market", "country": "Japan", "city": "Fukuoka City"}, "9408.T": {"short_name": "BROADCASTING SYSTEM OF NIIGATA", "long_name": "Broadcasting System of Niigata Inc.", "summary": "Broadcasting System of Niigata Inc. engages in radio and television broadcasting business. It plans, produces, and sells broadcast programs, as well as arts, music, sports, movies, theater, science, and various entertainment; and plans, publishes, and sells publications. The company was founded in 1952 and is headquartered in Niigata, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Entertainment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Niigata"}, "9412.T": {"short_name": "SKY PERFECT JSAT HOLDINGS INC", "long_name": "SKY Perfect JSAT Holdings Inc.", "summary": "SKY Perfect JSAT Holdings Inc. provides satellite-based multichannel pay TV and satellite communications services primarily in Asia. The company operates through Media Business and Space Business segments. The Media Business segment offers platform services, such as customer management activities to broadcasting businesses; and delivers broadcasting services through communication satellite and fiber optic network. The Space Business segment provides communication satellite circuits to the broadcasting businesses; and satellite communication services, including data and mobile communication services to government, public entities, and corporations. The company also produces content; sells satellite connections; operates as telecommunications carrier and systems integrator for satellite communications and broadcasting services; designs, manufactures, and sells industrial drones; offers mobile satellite communication services; and delivers Japanese digital content to overseas audiences. In addition, it provides earth observation satellite images, network and systems integration services; and offers technical support services. The company was formerly known as SKY Perfect JSAT Corporation and changed its name to SKY Perfect JSAT Holdings Inc. in June 2008. SKY Perfect JSAT Holdings Inc. was founded in 1985 and is headquartered in Tokyo, Japan. The company was formerly known as SKY Perfect JSAT Corporation and changed its name to SKY Perfect JSAT Holdings Inc. in June 2008. SKY Perfect JSAT Holdings Inc. was founded in 1985 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Broadcasting", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Minato"}, "9418.T": {"short_name": "USEN-NEXT HOLDINGS CO LTD", "long_name": "USEN-NEXT HOLDINGS Co.,Ltd.", "summary": "Usen-Next Holdings Co.,Ltd. offers entertainment services. Its content platform business engages in planning, developing, operating, and marketing U-NEXT, a video distribution service; and the provision of application development and infrastructure distribution services. The company also provides multi-MVNO cheap SIM, and cheap smartphone services; offers fixed-line telecommunications and optical Internet services; and operates contact centers. The company was formerly known as U-Next Co., Ltd. and changed its name to Usen-Next Holdings Co.,Ltd. in December 2017. Usen-Next Holdings Co.,Ltd. was founded in 2009 and is headquartered in Tokyo, Japan. Usen-Next Holdings Co.,Ltd. is a subsidiary of UNO-HOLDINGS Co., Ltd.", "currency": "JPY", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9428.T": {"short_name": "CROPS CORPORATION", "long_name": "Crops Corporation", "summary": "Crops Corporation engages in the sale and service of mobile phones through stores in Japan. As of September 1, 2020, it operated 46 stores. The company is also involved in the temporary staffing, building maintenance, security management, restaurant leasing, wholesale of stationery packaging material, and planning and wholesale of imported stationery. Crops Corporation was founded in 1977 and is headquartered in Nagoya, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Nagoya"}, "9432.T": {"short_name": "NIPPON TEL & TEL CORP", "long_name": "Nippon Telegraph and Telephone Corporation", "summary": "Nippon Telegraph and Telephone Corporation, through its subsidiaries, provides fixed voice-related, mobile voice-related, IP/packet communications, and system integration services in Japan and internationally. The company's Mobile Communications Business segment offers mobile phone services and related services, including movie and music distribution, e-book, and finance and payment services, as well as smart life area and internet connection services. Its Regional Communications Business segment provides intra-prefectural communications services, and FTTH and other services. The company's Long Distance and International Communications Business segment offers inter-prefectural communications services, international communications services, and services related to the solutions business and related services. This segment primarily provides cloud, data center, migration and maintenance support, IT system building, professional security, ICT, network, managed, mobile connectivity, and other services, as well as teleconference, web conference, and video conference services. Its Data Communications Business segment offers network system and system integration services comprising ERP services, ICT outsourcing, consulting, system design and development, and other services. The company's Other Business segment engages in the acquisition, development, lease, and management of real estate; design, management, and maintenance of buildings, equipment, and electric power facilities; development of smart energy solutions and energy management systems; lease and sale of telecommunications-related devices; development, production, operation, and maintenance of information communications systems and software; finance; and technology transfer and technical consulting businesses. It also sells telecommunications equipment. Nippon Telegraph and Telephone Corporation was founded in 1952 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9433.T": {"short_name": "KDDI CORPORATION", "long_name": "KDDI Corporation", "summary": "KDDI Corporation provides telecommunications services in Japan and internationally. It operates through four segments: Personal Services, Life Design Services, Business Services, and Global Services. The Personal Services segment offers mobile services under the au and MVNO brands; fixed-line services under the au Hikari brand; and FTTH services, CATV services, and others. It also provides non-telecommunications services, such as the au WALLET Market product sales services through au shops; energy services under the au Denki brand; and education services under the AEON brand. The Life Design Services segment offers online and offline value-added non-telecommunications services; subscription services, such as thedigital content of au Smart Pass/au Smart Pass Premium; commerce services under the au Wowman brand; and other services, as well as insurance and other services in the financing business. The Business Services segment offers mobile services using devices that include smartphones and tablets, as well as networks, applications, and cloud services to a range ofcorporate customers, which comprise small and other corporations. It also provides various services in the IoT sector. The Global Services segment offers telecommunication services, ICT Solutions, data center services, and others for individuals and corporate customers. It is also involved in construction and maintenance of facilities, call center operations, and researchand development of technologies. KDDI Corporation has a mobile payment alliance agreement with Merpay, Inc., LINE Pay Corporation, and NTT DOCOMO, INC. for merchant stores. The company was founded in 1953 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9434.T": {"short_name": "SOFTBANK CORP.", "long_name": "SoftBank Corp.", "summary": "SoftBank Corp., together with its subsidiaries, engages in the telecommunication and information technology businesses in Japan. It operates through Consumer, Enterprise, and Distribution segments. The Consumer segment offers s mobile communications services, including voice call, data transmission, and related services to subscribers under the SoftBank, Y!mobile, and LINE MOBILE brands. It also sells mobile devices, including phones and tablets to dealers; provides Internet broadband services under the SoftBank Hikari brand; and sells and rents related customer-premises equipment for broadband services. The Enterprise segment provides a range of services comprising mobile communications, voice call and fixed-line communications, data transmission and dedicated, and telecommunications consulting services for enterprise customers; construction services for telecommunications carriers and general service providers; and rental and maintenance services for telecommunications facilities, housing, and data centers, as well as sells and rents telecommunications equipment. The Distribution segment offers hardware, software, and services in relation to information and communication technology, cloud, and Internet of Things to enterprise customers. The company also offers PC software, IoT products, and mobile device accessories to individual customers, as well as online business solutions and services, and solution services for government. SoftBank Corp. has a strategic alliance with PT Lippo Karawaci Tbk to develop artificial intelligence and Internet of Things solutions in the real estate and mobility sectors. The company was formerly known as SoftBank Mobile Corp. and changed its name to SoftBank Corp. in May 2015. The company was founded in 1984 and is headquartered in Tokyo, Japan. SoftBank Corp. is a subsidiary of SoftBank Group Japan Corporation.", "currency": "JPY", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9436.T": {"short_name": "OKINAWA CELLULAR", "long_name": "Okinawa Cellular Telephone Company", "summary": "Okinawa Cellular Telephone Company operates as a telecommunications company in Japan. The company provides telecommunication, as well as portable phone services. It also provides au WALLET prepaid and credit card services. The company was founded in 1991 and is headquartered in Naha, Japan. Okinawa Cellular Telephone Company is a subsidiary of KDDI Corporation.", "currency": "JPY", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Naha"}, "9445.T": {"short_name": "FORVAL TELECOM", "long_name": "Forval Telecom, Inc.", "summary": "Forval Telecom, Inc. provides various telecommunications carrier services in Japan. It is also involved in the security certification acquisition consulting business. The company was founded in 1995 and is based in Tokyo, Japan. Forval Telecom, Inc. is a subsidiary of Forval Corporation.", "currency": "JPY", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9446.T": {"short_name": "SAKAI HOLDINGS CO LTD", "long_name": "SAKAI Holdings CO.,LTD", "summary": "Sakai Holdings Co.,Ltd., through its subsidiaries, sells mobile phones through stores in Japan. The company is involved in the sale of mobile communication equipment; insurance agency business; and solar power generation business to sell power to electric power companies. The company also manages funeral halls. The company was formerly known as SKI Corp. and changed its name to Sakai Holdings Co.,Ltd. in October 2017. Sakai Holdings Co.,Ltd. was founded in 1991 and is based in Nagoya, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Nagoya"}, "9450.T": {"short_name": "FIBERGATE INC", "long_name": "Fibergate Inc.", "summary": "Fibergate Inc. provides communication services in Japan. It offers free Wi-Fi spot construction/operation services; free Wi-Fi services for foreigners, buses, events, and tenants; hotel Wi-Fi implementation services; and corporate network services, including Internet VPN service, IPv6 migration solution, etc. The company also develops, manufactures, and sells communication equipment, such as Wi-Fi router. In addition, it engages in the Internet advertising business and resale of mobile lines. The company was founded in 2000 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9466.T": {"short_name": "AIDMA MARKETING COMMUNICATION C", "long_name": "Aidma Marketing Communication Corporation", "summary": "Aidma Marketing Communication Corporation provides marketing support services in the fields of distribution and retail. It offers ARSS promotional solutions, market research planning, Aidoma big data platform solutions, Web SP solutions, and promotional support solutions. The company was formerly known as Aidma Corporation and changed its name to Aidma Marketing Communication Corporation in April 2015. The company was founded in 1977 and is headquartered in Toyama, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Toyama"}, "9468.T": {"short_name": "KADOKAWA CORPORATION", "long_name": "Kadokawa Corporation", "summary": "Kadokawa Corporation operates in publishing, film, publishing rights, and digital content businesses in Japan. The company also engages in the planning, development, and operation of network entertainment service and contents; and operates video-sharing website. It also offers animation, videos, games, rights, and merchandising. The company was formerly known as Kadokawa Dwango Corporation. Kadokawa Corporation was founded in 1945 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Publishing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9475.T": {"short_name": "SHOBUNSHA HOLDINGS INC", "long_name": "Shobunsha Holdings, Inc.", "summary": "Shobunsha Holdings, Inc. plans, produces, and publishes maps, magazines, and guidebooks. It also plans, produces, and sells digital data, as well as offers electronic services. The company also publishes guidebooks covering tourist sites and attractions for Japanese travelers; produces maps and guidebooks in foreign languages for tourists; offers tools available on the Internet, smartphones, and in mobile communication; and serves as an advertising media for various range clients in the hotel, transportation, retail, and other industries. In addition, it runs MAPPLE Kanko Guide and MAPPLE Tourist Maps Websites; and operates MAPPLE Travel, a hotel booking Website. Further, the company develops and runs applications, including MAPPLE TOKYO Sky Tree App that provides MAPPLE maps and guides; and MAPPLE-LINK, a service, which allows users to download information in MAPPLE Magazine to smartphones or cellphones. Additionally, it provides digital maps and travel guides for national agencies, local governments, and private enterprises for issues concerning crime and disaster prevention, disaster measures, tourism business, regional marketing, customer management, and logistics. The company also makes maps and develops geographical information systems for enterprises and local governments; provides services ranging from inputting data to developing mapping software; and offers Mapple Navi, a car navigation software for PND makers that provide driving routes, and information about restaurants. Shobunsha Holdings, Inc. was founded in 1960 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Publishing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9476.T": {"short_name": "CHUOKEIZAI-SHA HOLDINGS INC", "long_name": "Chuokeizai-Sha Holdings, Inc.", "summary": "Chuokeizai-Sha Holdings, Inc. engages in publishing business in Japan. It publishes books and magazines related to law, economy, management, accounting, taxation, qualification examinations, and other social science. The company was formerly known as Chuokeizai-Sha, Inc. and changed its name to Chuokeizai-Sha Holdings, Inc. in January 2016. Chuokeizai-Sha Holdings, Inc. was founded in 1948 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Publishing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9478.T": {"short_name": "SE HOLDINGS AND INCUBATIONS", "long_name": "SE Holdings and Incubations Co., Ltd.", "summary": "SE Holdings and Incubations Co., Ltd. primarily engages in the publishing business in Japan. The company is involved in publishing and selling computer-related books and magazines; organizing computer-related conferences and trainings; delivering computer-related technology information through Web; publishing and selling common and translated books; selling software and hardware through online shops; selling other computer-related products and services; and real estate leasing activities. It also develops and sells entertainment software and mobile Internet technologies and services. In addition, the company plans and manufactures sub-contracting services for product accessories and enclosures; as well as offers product marketing and sales promotion related services; support services for engineers; and company PR/IR support services for IT related companies. Further, it operates amusement centers; and offers IT education, as well as provides job referral services for the medical industry. Additionally, the company produces, publishes, and sells teaching materials; and plans and manages seminars for examinees of qualified certified electrician test. The company was formerly known as SHOEISHA Co., Ltd. SE Holdings and Incubations Co., Ltd. was founded in 1985 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Publishing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9479.T": {"short_name": "IMPRESS HOLDINGS INC", "long_name": "Impress Holdings, Inc.", "summary": "Impress Holdings, Inc. engages in the provision of content business in Japan. The company publishes magazines, books, and e-books for various fields, such as IT, music, design, mountain nature, and mobile services; and provides net media and target media services, as well as SP/PR tools for companies and local governments and contract production of websites, etc. It also offers planning, development, and distribution functions for content businesses, including EC platforms, electronic comic platforms, and publishing and distribution platforms. The company was founded in 1992 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Publishing", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9601.T": {"short_name": "SHOCHIKU CO LTD", "long_name": "Shochiku Co., Ltd.", "summary": "Shochiku Co., Ltd. engages in audio and video, theatre, real estate, and other businesses in Japan and internationally. The company's audio and video division is involved production, publicity, and distribution of live-action, animation, and motion pictures; audio and video rights to domestic and international parties; develops audio and video content; manages theatres and cinema complexes; arrangement of programming at theatres; production and editing of content for satellite and cable channels; basic satellite broadcasting and general broadcasting; and production, purchase, and sales of video content. The company's Theater division plans, produces, and promotes kabuki presentations and general theatre productions on tour and overseas performances; and operates Shochiku theatres. It is also involved in theatrical rights; kabuki related events; the development of theatre-related businesses; and actor and talent promotion business. The company's Real Estate division develops, manages, and leases properties. The Other Business division engages in the editing, production, and sale of motion picture pamphlets; planning, production, and sale of character merchandise; management of mobile and computer shopping websites; distribution of official content for mobile devices; operation of restaurants, parking lots, and other businesses; provision of property management and cleaning services; and development and licensing of music copyrights. The company was formerly known as Shochiku Kinema Co., Ltd. and changed its name to Shochiku Co., Ltd. in 1937. Shochiku Co., Ltd. was founded in 1895 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Entertainment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9602.T": {"short_name": "TOHO CO LTD", "long_name": "Toho Co., Ltd.", "summary": "Toho Co., Ltd. engages in the motion picture, theatrical production, and real estate businesses in Japan. It is involved in producing, buying/selling, and renting movies; producing and selling television programs, movie pamphlets, and video software; and business related to merchandising rights, and other activities. The company also engages in the planning, production, and performance of stage productions; and leasing of land/buildings, and others. Toho Co., Ltd. was founded in 1932 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Entertainment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9605.T": {"short_name": "TOEI CO LTD", "long_name": "Toei Company, Ltd.", "summary": "Toei Company, Ltd. engages in the production of movies, TV shows, animation, and various other video products in Japan. The company plans, develops, produces, and distributes theatrical movies and events; engages in online shopping business; manages and operates movie theatres and cinema complexes; offers DVDs and Blu-ray discs; and provides video content distribution services. It also offers content to Toei Channel, a CS broadcasting station, as well as various broadcasting media; and grants videogram rights to stations. In addition, the company provides commoditizing rights for toys, apparel, everyday items, food products, stationeries, publications, CDs, DVDs, games, gaming machines, and theme parks. Further, it operates movie studios; undertakes various cultural events; offers real estate leasing services for office buildings and condominiums; owns and operates a golf course; and operates hotels. Toei Company, Ltd. was incorporated in 1949 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Entertainment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9625.T": {"short_name": "CERESPO CO LTD", "long_name": "Cerespo Co., Ltd.", "summary": "Cerespo Co., Ltd. operates as an event production company in Japan. It engages in the production, site setting, operation, and progression of events, promotions, sports events, ceremonies, and recreation events. The company also plans, develops, manufactures, sells, and rents goods and fixtures. In addition, it is involved in the supervision and construction of civil engineering and architectural designs; and the provision of security services. Cerespo Co., Ltd. was founded in 1977 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9636.T": {"short_name": "KIN-EI CORP", "long_name": "Kin-Ei Corp.", "summary": "Kin-Ei Corp. engages in the management of movie entertainment and building rental businesses in Japan. It also operates and manages entertainment centers, which include movie theaters, amusement parks, parking lots, and lottery stores. The company was founded in 1937 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Entertainment", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "9684.T": {"short_name": "SQUARE ENIX HOLDINGS CO.LTD.", "long_name": "Square Enix Holdings Co., Ltd.", "summary": "Square Enix Holdings Co., Ltd. operates in the content and service businesses in Japan, North America, Europe, and rest of Asia. It operates through four segments: Digital Entertainment, Amusement, Publication, and Merchandising. The company's Digital Entertainment segment plans, develops, distributes, and operates digital entertainment content primarily in the form of games. This segment offers digital entertainment content for various customer usage environments, including personal computers and smart devices, as well as consumer game consoles, such as handheld game machines. Its Amusement segment is involved in the operation of amusement facilities. This segment also engages in the planning, development, distribution, and rental of arcade game machines and related products for amusement facilities. The company's Publication segment publishes and licenses comic magazines, comic books, and game-related books. Its Merchandising segment plans, produces, distributes, and licenses derivative products. The company publishes, distributes, and licenses entertainment content under the SQUARE ENIX and TAITO brands. Square Enix Holdings Co., Ltd. was founded in 1975 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9697.T": {"short_name": "CAPCOM CO LTD", "long_name": "Capcom Co., Ltd.", "summary": "Capcom Co., Ltd. plans, develops, manufactures, sells, and distributes home video games, online games, mobile games, and arcade games in Japan and internationally. It operates through Digital Contents, Arcade Operations, Amusement Equipments, and Other Businesses segments. The Digital Contents segment develops and sells packaged and digital game content for consumer home video game platforms, as well as mobile content and PC online games. The Arcade Operations segment operates Plaza Capcom amusement facilities primarily in commercial complexes, as well as hosts various events. The Amusement Equipments segment is involved in the development, manufacture, and sale of frames and LCD devices for gaming machines, as well as software. The Other Businesses segment publishes walkthrough and strategy guides, as well as game art books; licenses movies, animated television programs, music CDs and merchandise. Capcom Co., Ltd. was founded in 1979 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "9766.T": {"short_name": "KONAMI HOLDINGS CORPORATION", "long_name": "Konami Holdings Corporation", "summary": "Konami Holdings Corporation, together with its subsidiaries, primarily engages in the digital entertainment business. It operates through four segments: Digital Entertainment, Health & Fitness, Gaming & Systems, and Pachislot & Pachinko Machines. The Digital Entertainment segment manufactures and sells digital content and related products, including mobile games, arcade games, card games, and computer and video games. The Health & Fitness segment operates health and fitness clubs, as well as designs, manufactures, and sells fitness machines and health products. The Gaming & Systems segment designs, manufactures, sells, and services gaming machines and casino management systems. The Pachislot & Pachinko Machines segment researches, designs, produces, and sells pachinko slot and pachinko machines. It operates in Japan and other Asia/Oceania countries, the United States, and Europe. The company was formerly known as Konami Corporation and changed its name to Konami Holdings Corporation in October 2015. Konami Holdings Corporation was founded in 1969 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9984.T": {"short_name": "SOFTBANK GROUP CORP", "long_name": "SoftBank Group Corp.", "summary": "SoftBank Group Corp. provides telecommunication services in Japan and internationally. The company operates through four segments: SoftBank Vision Fund and Other SBIA-Managed Funds, SoftBank, Arm, and Brightstar. The SoftBank Vision Fund and Other SBIA-Managed Funds is involved in investment activities. The SoftBank segment offers mobile communications, broadband, and fixed-line communications services; and sells mobile devices, as well as involved in Internet advertising, e-commerce business. The Arm segment designs microprocessor intellectual property and related technology; sells software tools; and offers software services. The Brightstar segment distributes mobile devices. The company provides investment management and payment services; and generates, supplies, and sells electricity from renewable energy sources, as well as marketing activities. In addition, it offers card services; IT solutions; operates, sells, and markets PC software and online games; and distributes video, voice, and data content. The company operates professional baseball team, as well as manages and maintains baseball stadium and other sports facilities. It also operates fashion online shopping website ZOZOTOWN. The company was formerly known as SoftBank Corp. and changed its name to SoftBank Group Corp. in July 2015. SoftBank Group Corp. was founded in 1981 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "A02.F": {"short_name": "ADWAYS INC.", "long_name": "Adways Inc.", "summary": "Adways Inc. provides affiliate advertisement services for PC and mobiles, and mobile application and content development services in Japan, China, Taiwan, the Philippines, and the United States. The company offers Unicorn, a marketing platform for mobile apps; AppDriver, a CPI based mobile ad platform; STROBELIGHTS, an performance ad management platform; Oct-pass, a native ad platform for smart phones; Smart-C, a Web affiliate service for feature phone and smartphone; JANet, a Web affiliate service for PCs and smartphones; and YACLE, a supporting service for advertisement expressions. It also provides Dobel, a video advertisement service; MASSIVE, a service that realizes automated mass production of banners; CHANet, an affiliate ad service for PC and smart phones; Keynet, a keyword ad service for Chinese web search engines; Blue Bee Box, a DSP trading desk tool. Blue Bee Native, a CPM based native ad network; adna, an ad analytics tool for PC, feature phone, and smart phone websites; and Rewardplus, a reward ad service for PC and mobile. In addition, the company offers Yoyaku Top10, a pre-registration platform for smart phone apps; SPOT, an online media that delivers going out and sightseeing information based on writers' experiences and interviews; and Leyifan, an international shipping agent service for overseas e-commerce users. Adways Inc. was founded in 2001 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "AIM.F": {"short_name": "AIMING INC.", "long_name": "Aiming Inc.", "summary": "Aiming Inc. engages in the production and development of online games for PCs, browsers, smartphones, home consoles, and mobile phones in Japan. The company was founded in 2011 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "AKAFF": {"short_name": "AKATSUKI INC", "long_name": "Akatsuki Inc.", "summary": "Akatsuki Inc. engages in the mobile game and live experience businesses primarily in Japan. It develops mobiles games. The company also operates Asobuild, an entertainment facility service site; Pong!Pong!, a ping pong table activity and projection mapping service site; Sotoasobi, a service site to provide reservations for outdoor and leisure activities; and Daigomi, a Cheese restaurants. In addition, it provides Crayon, an app development support services to artists, creators, and athletes; a media franchise project of both music and audio drama CDs on themes of Jazz; and operates Kumarba Channel, an education and entertainment channel distributed through YouTube platform. The company was founded in 2010 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "AX8.F": {"short_name": "AVEX INC.", "long_name": "Avex Inc.", "summary": "Avex Inc., an entertainment company, engages in music, anime, digital, and other businesses in Japan. The company plans, produces, and sells musical content, including sound sources and images; publishes and distributes music; and plans, produces, and manages live concerts, special events, stage performances/musicals, and various featuring artists. It also manages artists, celebrities, creators, athletes, intellectuals, and others; operates fan clubs; and sells tickets. In addition, the company is involved in building an integrated framework for discovering, fostering, and developing of talent. Further, it plans, produces, and sells animated shows in various forms, merchandising goods, special events, games, and movies; and designs and manages digital platforms dTV and AWA. The company was formerly known as Avex Group Holdings Inc. and changed its name to Avex Inc. in November 2017. Avex Inc. was founded in 1988 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Entertainment", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "CCOEF": {"short_name": "CAPCOM CO LTD", "long_name": "Capcom Co., Ltd.", "summary": "Capcom Co., Ltd. plans, develops, manufactures, sells, and distributes home video games, online games, mobile games, and arcade games in Japan and internationally. It operates through Digital Contents, Arcade Operations, Amusement Equipments, and Other Businesses segments. The Digital Contents segment develops and sells packaged and digital game content for consumer home video game platforms, as well as mobile content and PC online games. The Arcade Operations segment operates Plaza Capcom amusement facilities primarily in commercial complexes, as well as hosts various events. The Amusement Equipments segment is involved in the development, manufacture, and sale of frames and LCD devices for gaming machines, as well as software. The Other Businesses segment publishes walkthrough and strategy guides, as well as game art books; licenses movies, animated television programs, music CDs and merchandise. Capcom Co., Ltd. was founded in 1979 and is headquartered in Osaka, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Osaka"}, "CCOEY": {"short_name": "CAPCOM CO LTD", "long_name": "Capcom Co., Ltd.", "summary": "Capcom Co., Ltd. plans, develops, manufactures, sells, and distributes home video games, online games, mobile games, and arcade games in Japan and internationally. It operates through Digital Contents, Arcade Operations, Amusement Equipments, and Other Businesses segments. The Digital Contents segment develops and sells packaged and digital game content for consumer home video game platforms, as well as mobile content and PC online games. The Arcade Operations segment operates Plaza Capcom amusement facilities primarily in commercial complexes, as well as hosts various events. The Amusement Equipments segment is involved in the development, manufacture, and sale of frames and LCD devices for gaming machines, as well as software. The Other Businesses segment publishes walkthrough and strategy guides, as well as game art books; licenses movies, animated television programs, music CDs and merchandise. Capcom Co., Ltd. was founded in 1979 and is headquartered in Osaka, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Osaka"}, "CKPDY": {"short_name": "COOKPAD INC.", "long_name": "Cookpad Inc.", "summary": "Cookpad Inc. operates a community platform to share recipe ideas and cooking tips worldwide. It also engages in Cookpad mart and TV businesses. The company was formerly known as Coin Ltd. and changed its name to Cookpad Inc. in June 1999. Cookpad Inc. was founded in 1997 and is based in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "CPK.F": {"short_name": "CAPCOM CO.LTD", "long_name": "Capcom Co., Ltd.", "summary": "Capcom Co., Ltd. plans, develops, manufactures, sells, and distributes home video games, online games, mobile games, and arcade games in Japan and internationally. It operates through Digital Contents, Arcade Operations, Amusement Equipments, and Other Businesses segments. The Digital Contents segment develops and sells packaged and digital game content for consumer home video game platforms, as well as mobile content and PC online games. The Arcade Operations segment operates Plaza Capcom amusement facilities primarily in commercial complexes, as well as hosts various events. The Amusement Equipments segment is involved in the development, manufacture, and sale of frames and LCD devices for gaming machines, as well as software. The Other Businesses segment publishes walkthrough and strategy guides, as well as game art books; licenses movies, animated television programs, music CDs and merchandise. Capcom Co., Ltd. was founded in 1979 and is headquartered in Osaka, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Osaka"}, "CYAGF": {"short_name": "CYBER AGENT", "long_name": "CyberAgent, Inc.", "summary": "CyberAgent, Inc. engages in the media, internet advertising, game, and investment development businesses primarily in Japan. The company operates Abema, a hybrid service that offers linear (TV) and on-demand viewing; Ameba, a blog service; Tapple for online dating; AWA, a music streaming service; and WinTicket for online betting. It also offers internet advertising agency and ad technology services; and smartphone games. In addition, the company operates a programming school for kids; CROSS ME; and Nizista, a Web magazine, as well as provides application and reward points exchange platform services. CyberAgent, Inc. was founded in 1998 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "CYGIY": {"short_name": "CYBER AGENT", "long_name": "CyberAgent, Inc.", "summary": "CyberAgent, Inc. engages in the media, internet advertising, game, and investment development businesses primarily in Japan. The company operates Abema, a hybrid service that offers linear (TV) and on-demand viewing; Ameba, a blog service; Tapple for online dating; AWA, a music streaming service; and WinTicket for online betting. It also offers internet advertising agency and ad technology services; and smartphone games. In addition, the company operates a programming school for kids; CROSS ME; and Nizista, a Web magazine, as well as provides application and reward points exchange platform services. CyberAgent, Inc. was founded in 1998 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "DEN.F": {"short_name": "DENTSU GROUP INC.", "long_name": "Dentsu Group Inc.", "summary": "Dentsu Group Inc. operates in the advertising business in Japan and internationally. The company offers advertising services, including newspapers, magazines, radio, television, internet, sales promotions, movies, outdoors, transportation, and other advertising operations and advertising expressions. It is also involved in the consulting, development, and operation of information systems; sale of various software products; and provision of marketing and comprehensive network services. In addition, the company leases office buildings; and buys and sells real estate properties, as well as offers building and commission calculation services. Dentsu Group Inc. was founded in 1901 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "DIP.F": {"short_name": "KDDI CORP.", "long_name": "KDDI Corporation", "summary": "KDDI Corporation provides telecommunications services in Japan and internationally. It operates through four segments: Personal Services, Life Design Services, Business Services, and Global Services. The Personal Services segment offers mobile services under the au and MVNO brands; fixed-line services under the au Hikari brand; and FTTH services, CATV services, and others. It also provides non-telecommunications services, such as the au WALLET Market product sales services through au shops; energy services under the au Denki brand; and education services under the AEON brand. The Life Design Services segment offers online and offline value-added non-telecommunications services; subscription services, such as thedigital content of au Smart Pass/au Smart Pass Premium; commerce services under the au Wowman brand; and other services, as well as insurance and other services in the financing business. The Business Services segment offers mobile services using devices that include smartphones and tablets, as well as networks, applications, and cloud services to a range ofcorporate customers, which comprise small and other corporations. It also provides various services in the IoT sector. The Global Services segment offers telecommunication services, ICT Solutions, data center services, and others for individuals and corporate customers. It is also involved in construction and maintenance of facilities, call center operations, and researchand development of technologies. KDDI Corporation has a mobile payment alliance agreement with Merpay, Inc., LINE Pay Corporation, and NTT DOCOMO, INC. for merchant stores. The company was founded in 1953 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "DNTUF": {"short_name": "DENTSU GROUP INC", "long_name": "Dentsu Group Inc.", "summary": "Dentsu Group Inc. operates in the advertising business in Japan and internationally. The company offers advertising services, including newspapers, magazines, radio, television, internet, sales promotions, movies, outdoors, transportation, and other advertising operations and advertising expressions. It is also involved in the consulting, development, and operation of information systems; sale of various software products; and provision of marketing and comprehensive network services. In addition, the company leases office buildings; and buys and sells real estate properties, as well as offers building and commission calculation services. Dentsu Group Inc. was founded in 1901 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "DNTUY": {"short_name": "DENTSU GROUP INC", "long_name": "Dentsu Group Inc.", "summary": "Dentsu Group Inc. operates in the advertising business in Japan and internationally. The company offers advertising services, including newspapers, magazines, radio, television, internet, sales promotions, movies, outdoors, transportation, and other advertising operations and advertising expressions. It is also involved in the consulting, development, and operation of information systems; sale of various software products; and provision of marketing and comprehensive network services. In addition, the company leases office buildings; and buys and sells real estate properties, as well as offers building and commission calculation services. Dentsu Group Inc. was founded in 1901 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "EI4.F": {"short_name": "SQUARE ENIX HLDGS CO.LTD.", "long_name": "Square Enix Holdings Co., Ltd.", "summary": "Square Enix Holdings Co., Ltd. operates in the content and service businesses in Japan, North America, Europe, and rest of Asia. It operates through four segments: Digital Entertainment, Amusement, Publication, and Merchandising. The company's Digital Entertainment segment plans, develops, distributes, and operates digital entertainment content primarily in the form of games. This segment offers digital entertainment content for various customer usage environments, including personal computers and smart devices, as well as consumer game consoles, such as handheld game machines. Its Amusement segment is involved in the operation of amusement facilities. This segment also engages in the planning, development, distribution, and rental of arcade game machines and related products for amusement facilities. The company's Publication segment publishes and licenses comic magazines, comic books, and game-related books. Its Merchandising segment plans, produces, distributes, and licenses derivative products. The company publishes, distributes, and licenses entertainment content under the SQUARE ENIX and TAITO brands. Square Enix Holdings Co., Ltd. was founded in 1975 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "FJTNY": {"short_name": "FUJI MEDIA HOLDING", "long_name": "Fuji Media Holdings, Inc.", "summary": "Fuji Media Holdings, Inc., through its subsidiaries, engages in the broadcasting activities in Japan. The company operates through Media & Content, Urban Development, Hotels & Resorts, and Other segments. It is involved in television broadcasting, including satellite broadcasting, radio broadcasting, streaming platforms, content production, games, music, advertising, publishing, and direct marketing activities. The company also develops, leases, and manages office buildings; operates commercial facilities and restaurants; sells and leases apartments; and operates hotels and marine leisure facilities. In addition, it engages in IT system architecture and human resources, and overseas business development activities; the provision of market research services on media and lifestyles; and cultivation of new businesses. The company was formerly known as Fuji Television Network, Inc. Fuji Media Holdings, Inc. was incorporated in 1957 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Broadcasting", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "FVM.F": {"short_name": "FORVAL TELECOM", "long_name": "Forval Telecom, Inc.", "summary": "Forval Telecom, Inc. provides various telecommunications carrier services in Japan. It is also involved in the security certification acquisition consulting business. The company was founded in 1995 and is based in Tokyo, Japan. Forval Telecom, Inc. is a subsidiary of Forval Corporation.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "G03.F": {"short_name": "GUNGHO ONLINE ENTMT", "long_name": "GungHo Online Entertainment, Inc.", "summary": "GungHo Online Entertainment, Inc. plans, develops, operates, and distributes online computer games, smartphone applications, and console games. The company was formerly known as ONSale Co., Ltd. and changed its name to GungHo Online Entertainment, Inc. in August 2002. GungHo Online Entertainment, Inc. was founded in 1998 and is based in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "GMOYF": {"short_name": "GMO INTERNET INC", "long_name": "GMO Internet, Inc.", "summary": "GMO Internet, Inc. provides various Internet services worldwide. It operates through Internet Infrastructure, Online Advertising and Media, Internet Finance, and Cryptocurrency segments. It offers Internet infrastructure services in the areas of domain, hosting, cloud, security, payments, e-commerce support, connection, Website creation support, marketing support, community, contents, app, and IoT. The company also provides online advertising and media services, such as media services, search, ad tech services, mobile marketing, O2O, and coupon/point services; and Internet financial services, including Internet securities, and FX and other trading services. In addition, it engages in cryptocurrency trading and mining business; and mobile, online, and other games. The company was incorporated in 1976 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "HDU.F": {"short_name": "HAKUHODO DY HLDGS INC.", "long_name": "Hakuhodo DY Holdings Inc", "summary": "Hakuhodo DY Holdings Inc., through its subsidiaries, operates as a marketing services company in Japan and internationally. It offers planning, production, marketing, public relations, and other services related to the presentation of advertising in various media, such as newspapers, magazines, radio, television, and digital media. The company also provides brand building services; and specializes in business development in the entertainment field, including animated programs and live events. In addition, it is involved in the planning, production, buying, and media traffic in media and contents businesses, as well as provision of marketing solutions for advertisers, media companies, and content holders. Hakuhodo DY Holdings Inc. was founded in 2003 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "HKUOY": {"short_name": "HAKUHODO DY HLDGS INC", "long_name": "Hakuhodo DY Holdings Inc", "summary": "Hakuhodo DY Holdings Inc., through its subsidiaries, operates as a marketing services company in Japan and internationally. It offers planning, production, marketing, public relations, and other services related to the presentation of advertising in various media, such as newspapers, magazines, radio, television, and digital media. The company also provides brand building services; and specializes in business development in the entertainment field, including animated programs and live events. In addition, it is involved in the planning, production, buying, and media traffic in media and contents businesses, as well as provision of marketing solutions for advertisers, media companies, and content holders. Hakuhodo DY Holdings Inc. was founded in 2003 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "IIJ.F": {"short_name": "INTERNET IN.JP.ADR 1 ON", "long_name": "Internet Initiative Japan Inc.", "summary": "Internet Initiative Japan Inc. offers Internet connectivity, WAN, outsourcing, systems integration, and equipment sales services in Japan. It operates in two segments, Network Services and Systems Integration Business, and ATM Operation Business. The company's Internet connectivity services for enterprise include IP services and IIJ data center connectivity services, IIJ FiberAccess/F and IIJ DSL/F services, IIJ mobile services, and dial-up access services, as well as other Internet connectivity services comprising IIJ ISDN/F and IIJ line management/F services. Its Internet connectivity services for consumers consist of various service, including ADSL, fiber optic, WiMAX, 3G, and LTE wireless data communication services under the IIJmio and hi-ho brand names. The company also offers WAN services, a closed network service primarily using dedicated lines, as well as wide-area Ethernet services and IP-VPN services to corporate customers; outsourcing services that comprise security-related, network-related, server-related, data center-related, and IIJ GIO/Hosting package services for non-customizable hosting package cloud computing services; and customer support and help desk solutions, and IP phone services. In addition, it provides systems integration services, which include consulting, project planning, systems design, and development of network systems, which focus on Internet business systems, and Intranet and Extranet corporate information systems; and systems operation and maintenance services. Further, the company sells routers, iPads, and other equipment, as well as software; and provides automated teller machine (ATM) services. As of June 29, 2018, it operated 29 primary points of presence (POP) for dedicated access and 1 universal POP for nationwide dial-up access; 27 Internet data centers; and 1,096 ATMs. The company was founded in 1992 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "IIJ.SG": {"short_name": "INTERNET INITIATIVE JAPAN INC.R", "long_name": "Internet Initiative Japan Inc.", "summary": "Internet Initiative Japan Inc. offers Internet connectivity, WAN, outsourcing, systems integration, and equipment sales services in Japan. It operates in two segments, Network Services and Systems Integration Business, and ATM Operation Business. The company's Internet connectivity services for enterprise include IP services and IIJ data center connectivity services, IIJ FiberAccess/F and IIJ DSL/F services, IIJ mobile services, and dial-up access services, as well as other Internet connectivity services comprising IIJ ISDN/F and IIJ line management/F services. Its Internet connectivity services for consumers consist of various service, including ADSL, fiber optic, WiMAX, 3G, and LTE wireless data communication services under the IIJmio and hi-ho brand names. The company also offers WAN services, a closed network service primarily using dedicated lines, as well as wide-area Ethernet services and IP-VPN services to corporate customers; outsourcing services that comprise security-related, network-related, server-related, data center-related, and IIJ GIO/Hosting package services for non-customizable hosting package cloud computing services; and customer support and help desk solutions, and IP phone services. In addition, it provides systems integration services, which include consulting, project planning, systems design, and development of network systems, which focus on Internet business systems, and Intranet and Extranet corporate information systems; and systems operation and maintenance services. Further, the company sells routers, iPads, and other equipment, as well as software; and provides automated teller machine (ATM) services. As of June 29, 2018, it operated 29 primary points of presence (POP) for dedicated access and 1 universal POP for nationwide dial-up access; 27 Internet data centers; and 1,096 ATMs. The company was founded in 1992 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "STU", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "IIJIY": {"short_name": "INTERNET INITIATIVE JAPAN INC S", "long_name": "Internet Initiative Japan Inc.", "summary": "Internet Initiative Japan Inc. offers Internet connectivity, WAN, outsourcing, systems integration, and equipment sales services in Japan. It operates in two segments, Network Services and Systems Integration Business, and ATM Operation Business. The company's Internet connectivity services for enterprise include IP services and IIJ data center connectivity services, IIJ FiberAccess/F and IIJ DSL/F services, IIJ mobile services, and dial-up access services, as well as other Internet connectivity services comprising IIJ ISDN/F and IIJ line management/F services. Its Internet connectivity services for consumers consist of various service, including ADSL, fiber optic, WiMAX, 3G, and LTE wireless data communication services under the IIJmio and hi-ho brand names. The company also offers WAN services, a closed network service primarily using dedicated lines, as well as wide-area Ethernet services and IP-VPN services to corporate customers; outsourcing services that comprise security-related, network-related, server-related, data center-related, and IIJ GIO/Hosting package services for non-customizable hosting package cloud computing services; and customer support and help desk solutions, and IP phone services. In addition, it provides systems integration services, which include consulting, project planning, systems design, and development of network systems, which focus on Internet business systems, and Intranet and Extranet corporate information systems; and systems operation and maintenance services. Further, the company sells routers, iPads, and other equipment, as well as software; and provides automated teller machine (ATM) services. As of June 29, 2018, it operated 29 primary points of presence (POP) for dedicated access and 1 universal POP for nationwide dial-up access; 27 Internet data centers; and 1,096 ATMs. The company was founded in 1992 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "IMB.F": {"short_name": "IMPRESS HOLDINGS INC.", "long_name": "Impress Holdings, Inc.", "summary": "Impress Holdings, Inc. engages in the provision of content business in Japan. The company publishes magazines, books, and e-books for various fields, such as IT, music, design, mountain nature, and mobile services; and provides net media and target media services, as well as SP/PR tools for companies and local governments and contract production of websites, etc. It also offers planning, development, and distribution functions for content businesses, including EC platforms, electronic comic platforms, and publishing and distribution platforms. The company was founded in 1992 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Publishing", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "KDDIF": {"short_name": "KDDI CORPORATION", "long_name": "KDDI Corporation", "summary": "KDDI Corporation provides telecommunications services in Japan and internationally. It operates through four segments: Personal Services, Life Design Services, Business Services, and Global Services. The Personal Services segment offers mobile services under the au and MVNO brands; fixed-line services under the au Hikari brand; and FTTH services, CATV services, and others. It also provides non-telecommunications services, such as the au WALLET Market product sales services through au shops; energy services under the au Denki brand; and education services under the AEON brand. The Life Design Services segment offers online and offline value-added non-telecommunications services; subscription services, such as thedigital content of au Smart Pass/au Smart Pass Premium; commerce services under the au Wowman brand; and other services, as well as insurance and other services in the financing business. The Business Services segment offers mobile services using devices that include smartphones and tablets, as well as networks, applications, and cloud services to a range ofcorporate customers, which comprise small and other corporations. It also provides various services in the IoT sector. The Global Services segment offers telecommunication services, ICT Solutions, data center services, and others for individuals and corporate customers. It is also involved in construction and maintenance of facilities, call center operations, and researchand development of technologies. KDDI Corporation has a mobile payment alliance agreement with Merpay, Inc., LINE Pay Corporation, and NTT DOCOMO, INC. for merchant stores. The company was founded in 1953 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "KDDIY": {"short_name": "KDDI CORPORATION", "long_name": "KDDI Corporation", "summary": "KDDI Corporation provides telecommunications services in Japan and internationally. It operates through four segments: Personal Services, Life Design Services, Business Services, and Global Services. The Personal Services segment offers mobile services under the au and MVNO brands; fixed-line services under the au Hikari brand; and FTTH services, CATV services, and others. It also provides non-telecommunications services, such as the au WALLET Market product sales services through au shops; energy services under the au Denki brand; and education services under the AEON brand. The Life Design Services segment offers online and offline value-added non-telecommunications services; subscription services, such as thedigital content of au Smart Pass/au Smart Pass Premium; commerce services under the au Wowman brand; and other services, as well as insurance and other services in the financing business. The Business Services segment offers mobile services using devices that include smartphones and tablets, as well as networks, applications, and cloud services to a range ofcorporate customers, which comprise small and other corporations. It also provides various services in the IoT sector. The Global Services segment offers telecommunication services, ICT Solutions, data center services, and others for individuals and corporate customers. It is also involved in construction and maintenance of facilities, call center operations, and researchand development of technologies. KDDI Corporation has a mobile payment alliance agreement with Merpay, Inc., LINE Pay Corporation, and NTT DOCOMO, INC. for merchant stores. The company was founded in 1953 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "KKC.F": {"short_name": "KAKAKU.COM INC.", "long_name": "Kakaku.com, Inc.", "summary": "Kakaku.com, Inc. provides purchase support, restaurant review, and other services in Japan. The company operates kakaku.com, a purchasing support site that compare prices of products and services of various genres, such as personal computers and home appliances, communication costs, and insurance; and Priceprice.com, a purchasing support site for consumers in the Philippines, Thailand, and Indonesia. It also operates tabelog.com, a restaurant search and reservation site. In addition, the company operates travel review and comparison site; real estate housing information site; movie information site; photo sharing site; women's lifestyle media; information site for car lovers; Men's fashion Web magazine; bulk search site for job information; information media for overnight travel; culture information site; comparison site for highway and night buses; and lowest price comparison site for highway buses, airplanes, and bullet trains; and bus and travel/tourism information media. Further, it engages in finance business. Kakaku.com, Inc. was founded in 1997 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "KKKUF": {"short_name": "KAKAKU.COM. INC", "long_name": "Kakaku.com, Inc.", "summary": "Kakaku.com, Inc. provides purchase support, restaurant review, and other services in Japan. The company operates kakaku.com, a purchasing support site that compare prices of products and services of various genres, such as personal computers and home appliances, communication costs, and insurance; and Priceprice.com, a purchasing support site for consumers in the Philippines, Thailand, and Indonesia. It also operates tabelog.com, a restaurant search and reservation site. In addition, the company operates travel review and comparison site; real estate housing information site; movie information site; photo sharing site; women's lifestyle media; information site for car lovers; Men's fashion Web magazine; bulk search site for job information; information media for overnight travel; culture information site; comparison site for highway and night buses; and lowest price comparison site for highway buses, airplanes, and bullet trains; and bus and travel/tourism information media. Further, it engages in finance business. Kakaku.com, Inc. was founded in 1997 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "KNAMF": {"short_name": "KONAMI HOLDINGS CORPORATION", "long_name": "Konami Holdings Corporation", "summary": "Konami Holdings Corporation, together with its subsidiaries, primarily engages in the digital entertainment business. It operates through four segments: Digital Entertainment, Health & Fitness, Gaming & Systems, and Pachislot & Pachinko Machines. The Digital Entertainment segment manufactures and sells digital content and related products, including mobile games, arcade games, card games, and computer and video games. The Health & Fitness segment operates health and fitness clubs, as well as designs, manufactures, and sells fitness machines and health products. The Gaming & Systems segment designs, manufactures, sells, and services gaming machines and casino management systems. The Pachislot & Pachinko Machines segment researches, designs, produces, and sells pachinko slot and pachinko machines. It operates in Japan and other Asia/Oceania countries, the United States, and Europe. The company was formerly known as Konami Corporation and changed its name to Konami Holdings Corporation in October 2015. Konami Holdings Corporation was founded in 1969 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "KNM.L": {"short_name": "KONAMI HOLDINGS CORPORATION JPY", "long_name": "Konami Holdings Corporation", "summary": "Konami Holdings Corporation, together with its subsidiaries, primarily engages in the digital entertainment business. It operates through four segments: Digital Entertainment, Health & Fitness, Gaming & Systems, and Pachislot & Pachinko Machines. The Digital Entertainment segment manufactures and sells digital content and related products, including mobile games, arcade games, card games, and computer and video games. The Health & Fitness segment operates health and fitness clubs, as well as designs, manufactures, and sells fitness machines and health products. The Gaming & Systems segment designs, manufactures, sells, and services gaming machines and casino management systems. The Pachislot & Pachinko Machines segment researches, designs, produces, and sells pachinko slot and pachinko machines. It operates in Japan and other Asia/Oceania countries, the United States, and Europe. The company was formerly known as Konami Corporation and changed its name to Konami Holdings Corporation in October 2015. Konami Holdings Corporation was founded in 1969 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "LSE", "market": "gb_market", "country": "Japan", "city": "Tokyo"}, "KNMCY": {"short_name": "KONAMI HOLDINGS CORPORATION", "long_name": "Konami Holdings Corporation", "summary": "Konami Holdings Corporation, together with its subsidiaries, primarily engages in the digital entertainment business. It operates through four segments: Digital Entertainment, Health & Fitness, Gaming & Systems, and Pachislot & Pachinko Machines. The Digital Entertainment segment manufactures and sells digital content and related products, including mobile games, arcade games, card games, and computer and video games. The Health & Fitness segment operates health and fitness clubs, as well as designs, manufactures, and sells fitness machines and health products. The Gaming & Systems segment designs, manufactures, sells, and services gaming machines and casino management systems. The Pachislot & Pachinko Machines segment researches, designs, produces, and sells pachinko slot and pachinko machines. It operates in Japan and other Asia/Oceania countries, the United States, and Europe. The company was formerly known as Konami Corporation and changed its name to Konami Holdings Corporation in October 2015. Konami Holdings Corporation was founded in 1969 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "KOA.F": {"short_name": "KONAMI HOLDINGS", "long_name": "Konami Holdings Corporation", "summary": "Konami Holdings Corporation, together with its subsidiaries, primarily engages in the digital entertainment business. It operates through four segments: Digital Entertainment, Health & Fitness, Gaming & Systems, and Pachislot & Pachinko Machines. The Digital Entertainment segment manufactures and sells digital content and related products, including mobile games, arcade games, card games, and computer and video games. The Health & Fitness segment operates health and fitness clubs, as well as designs, manufactures, and sells fitness machines and health products. The Gaming & Systems segment designs, manufactures, sells, and services gaming machines and casino management systems. The Pachislot & Pachinko Machines segment researches, designs, produces, and sells pachinko slot and pachinko machines. It operates in Japan and other Asia/Oceania countries, the United States, and Europe. The company was formerly known as Konami Corporation and changed its name to Konami Holdings Corporation in October 2015. Konami Holdings Corporation was founded in 1969 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "KOAA.F": {"short_name": "KONAMI HOLDINGS ADR", "long_name": "Konami Holdings Corporation", "summary": "Konami Holdings Corporation, together with its subsidiaries, primarily engages in the digital entertainment business. It operates through four segments: Digital Entertainment, Health & Fitness, Gaming & Systems, and Pachislot & Pachinko Machines. The Digital Entertainment segment manufactures and sells digital content and related products, including mobile games, arcade games, card games, and computer and video games. The Health & Fitness segment operates health and fitness clubs, as well as designs, manufactures, and sells fitness machines and health products. The Gaming & Systems segment designs, manufactures, sells, and services gaming machines and casino management systems. The Pachislot & Pachinko Machines segment researches, designs, produces, and sells pachinko slot and pachinko machines. It operates in Japan and other Asia/Oceania countries, the United States, and Europe. The company was formerly known as Konami Corporation and changed its name to Konami Holdings Corporation in October 2015. Konami Holdings Corporation was founded in 1969 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "MIXIF": {"short_name": "MIXI. INC", "long_name": "mixi, Inc.", "summary": "mixi, Inc. engages in the entertainment and lifestyle businesses in Japan. It offers Monster Strike, Kotodaman, and Monster Strike Stadium gaming applications; TIPSTAR, a freemium online betting app; Chariloto, a keirin and auto race betting ticket sales site; Chiba Jets Funabashi; netkeiba.com, a national horse racing resource; and Weekly Baseball Online, a baseball information site. The company also provides FamilyAlbum, a family photo and video sharing app; minimo, a salon artist booking app; mixi, a social networking service that offers space for friendly communication; KARASTA, a karaoke video community; Find Job!, a job recruitment info site for the IT and web industries; and OKURU, a photo gift service. It also provides employment opportunities for people with disabilities; operates XFLAG stores that offer merchandise from game; organizes events; and produces and sells various goods, as well as manages professional sports team, and businesses related to publicly operated competitions and other services. The company was formerly known as eMecury Co., Ltd. and changed its name to mixi, Inc. in February 2006. mixi, Inc. was founded in 1999 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "MXN.F": {"short_name": "MIXI INC.", "long_name": "mixi, Inc.", "summary": "mixi, Inc. engages in the entertainment and lifestyle businesses in Japan. It offers Monster Strike, Kotodaman, and Monster Strike Stadium gaming applications; TIPSTAR, a freemium online betting app; Chariloto, a keirin and auto race betting ticket sales site; Chiba Jets Funabashi; netkeiba.com, a national horse racing resource; and Weekly Baseball Online, a baseball information site. The company also provides FamilyAlbum, a family photo and video sharing app; minimo, a salon artist booking app; mixi, a social networking service that offers space for friendly communication; KARASTA, a karaoke video community; Find Job!, a job recruitment info site for the IT and web industries; and OKURU, a photo gift service. It also provides employment opportunities for people with disabilities; operates XFLAG stores that offer merchandise from game; organizes events; and produces and sells various goods, as well as manages professional sports team, and businesses related to publicly operated competitions and other services. The company was formerly known as eMecury Co., Ltd. and changed its name to mixi, Inc. in February 2006. mixi, Inc. was founded in 1999 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "NEXOF": {"short_name": "NEXON CO LTD", "long_name": "NEXON Co., Ltd.", "summary": "NEXON Co., Ltd. produces, develops, and services PC online and mobile games. It operates through five segments: Japan, Korea, China, North America, and Others. The company's PC online game titles include MapleStory, Dungeon & Fighter, and EA SPORTS FIFA ONLINE 4. It offers approximately 60 online games in 190 countries. The company was formerly known as NEXON Japan Co., Ltd. and changed its name to NEXON Co., Ltd. in April 2009. The company was founded in 1994 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "NEXOY": {"short_name": "NEXON CO LTD", "long_name": "NEXON Co., Ltd.", "summary": "NEXON Co., Ltd. produces, develops, and services PC online and mobile games. It operates through five segments: Japan, Korea, China, North America, and Others. The company's PC online game titles include MapleStory, Dungeon & Fighter, and EA SPORTS FIFA ONLINE 4. It offers approximately 60 online games in 190 countries. The company was formerly known as NEXON Japan Co., Ltd. and changed its name to NEXON Co., Ltd. in April 2009. The company was founded in 1994 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "NLV.F": {"short_name": "NIPPON TEL.+TEL.ADR", "long_name": "Nippon Telegraph and Telephone Corporation", "summary": "Nippon Telegraph and Telephone Corporation, through its subsidiaries, provides fixed voice-related, mobile voice-related, IP/packet communications, and system integration services in Japan and internationally. The company's Mobile Communications Business segment offers mobile phone services and related services, including movie and music distribution, e-book, and finance and payment services, as well as smart life area and internet connection services. Its Regional Communications Business segment provides intra-prefectural communications services, and FTTH and other services. The company's Long Distance and International Communications Business segment offers inter-prefectural communications services, international communications services, and services related to the solutions business and related services. This segment primarily provides cloud, data center, migration and maintenance support, IT system building, professional security, ICT, network, managed, mobile connectivity, and other services, as well as teleconference, web conference, and video conference services. Its Data Communications Business segment offers network system and system integration services comprising ERP services, ICT outsourcing, consulting, system design and development, and other services. The company's Other Business segment engages in the acquisition, development, lease, and management of real estate; design, management, and maintenance of buildings, equipment, and electric power facilities; development of smart energy solutions and energy management systems; lease and sale of telecommunications-related devices; development, production, operation, and maintenance of information communications systems and software; finance; and technology transfer and technical consulting businesses. It also sells telecommunications equipment. Nippon Telegraph and Telephone Corporation was founded in 1952 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "NPPXF": {"short_name": "NIPPON TEL & TEL CORP", "long_name": "Nippon Telegraph and Telephone Corporation", "summary": "Nippon Telegraph and Telephone Corporation, through its subsidiaries, provides fixed voice-related, mobile voice-related, IP/packet communications, and system integration services in Japan and internationally. The company's Mobile Communications Business segment offers mobile phone services and related services, including movie and music distribution, e-book, and finance and payment services, as well as smart life area and internet connection services. Its Regional Communications Business segment provides intra-prefectural communications services, and FTTH and other services. The company's Long Distance and International Communications Business segment offers inter-prefectural communications services, international communications services, and services related to the solutions business and related services. This segment primarily provides cloud, data center, migration and maintenance support, IT system building, professional security, ICT, network, managed, mobile connectivity, and other services, as well as teleconference, web conference, and video conference services. Its Data Communications Business segment offers network system and system integration services comprising ERP services, ICT outsourcing, consulting, system design and development, and other services. The company's Other Business segment engages in the acquisition, development, lease, and management of real estate; design, management, and maintenance of buildings, equipment, and electric power facilities; development of smart energy solutions and energy management systems; lease and sale of telecommunications-related devices; development, production, operation, and maintenance of information communications systems and software; finance; and technology transfer and technical consulting businesses. It also sells telecommunications equipment. Nippon Telegraph and Telephone Corporation was founded in 1952 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "NTDOF": {"short_name": "NINTENDO CO LTD", "long_name": "Nintendo Co., Ltd.", "summary": "Nintendo Co., Ltd., together with its subsidiaries, develops, manufactures, and distributes electronic entertainment products in Japan, the Americas, Europe, and internationally. It offers video game platforms, playing cards, Karuta, and other products; and handheld and home console hardware systems and related software. The company was formerly known as Nintendo Playing Card Co., Ltd. and changed its name to Nintendo Co., Ltd. in 1963. Nintendo Co., Ltd. was founded in 1889 and is headquartered in Kyoto, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Kyoto"}, "NTDOY": {"short_name": "NINTENDO CO LTD", "long_name": "Nintendo Co., Ltd.", "summary": "Nintendo Co., Ltd., together with its subsidiaries, develops, manufactures, and distributes electronic entertainment products in Japan, the Americas, Europe, and internationally. It offers video game platforms, playing cards, Karuta, and other products; and handheld and home console hardware systems and related software. The company was formerly known as Nintendo Playing Card Co., Ltd. and changed its name to Nintendo Co., Ltd. in 1963. Nintendo Co., Ltd. was founded in 1889 and is headquartered in Kyoto, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Kyoto"}, "NTO.F": {"short_name": "NINTENDO CO. LTD", "long_name": "Nintendo Co., Ltd.", "summary": "Nintendo Co., Ltd., together with its subsidiaries, develops, manufactures, and distributes electronic entertainment products in Japan, the Americas, Europe, and internationally. It offers video game platforms, playing cards, Karuta, and other products; and handheld and home console hardware systems and related software. The company was formerly known as Nintendo Playing Card Co., Ltd. and changed its name to Nintendo Co., Ltd. in 1963. Nintendo Co., Ltd. was founded in 1889 and is headquartered in Kyoto, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Kyoto"}, "NTOA.F": {"short_name": "NINTENDO UNS.ADR 1/8/O.N.", "long_name": "Nintendo Co., Ltd.", "summary": "Nintendo Co., Ltd., together with its subsidiaries, develops, manufactures, and distributes electronic entertainment products in Japan, the Americas, Europe, and internationally. It offers video game platforms, playing cards, Karuta, and other products; and handheld and home console hardware systems and related software. The company was formerly known as Nintendo Playing Card Co., Ltd. and changed its name to Nintendo Co., Ltd. in 1963. Nintendo Co., Ltd. was founded in 1889 and is headquartered in Kyoto, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Kyoto"}, "NTT.F": {"short_name": "NIPPON TEL. TEL.", "long_name": "Nippon Telegraph and Telephone Corporation", "summary": "Nippon Telegraph and Telephone Corporation, through its subsidiaries, provides fixed voice-related, mobile voice-related, IP/packet communications, and system integration services in Japan and internationally. The company's Mobile Communications Business segment offers mobile phone services and related services, including movie and music distribution, e-book, and finance and payment services, as well as smart life area and internet connection services. Its Regional Communications Business segment provides intra-prefectural communications services, and FTTH and other services. The company's Long Distance and International Communications Business segment offers inter-prefectural communications services, international communications services, and services related to the solutions business and related services. This segment primarily provides cloud, data center, migration and maintenance support, IT system building, professional security, ICT, network, managed, mobile connectivity, and other services, as well as teleconference, web conference, and video conference services. Its Data Communications Business segment offers network system and system integration services comprising ERP services, ICT outsourcing, consulting, system design and development, and other services. The company's Other Business segment engages in the acquisition, development, lease, and management of real estate; design, management, and maintenance of buildings, equipment, and electric power facilities; development of smart energy solutions and energy management systems; lease and sale of telecommunications-related devices; development, production, operation, and maintenance of information communications systems and software; finance; and technology transfer and technical consulting businesses. It also sells telecommunications equipment. Nippon Telegraph and Telephone Corporation was founded in 1952 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "NTTYY": {"short_name": "NIPPON TEL & TEL CORP", "long_name": "Nippon Telegraph and Telephone Corporation", "summary": "Nippon Telegraph and Telephone Corporation, through its subsidiaries, provides fixed voice-related, mobile voice-related, IP/packet communications, and system integration services in Japan and internationally. The company's Mobile Communications Business segment offers mobile phone services and related services, including movie and music distribution, e-book, and finance and payment services, as well as smart life area and internet connection services. Its Regional Communications Business segment provides intra-prefectural communications services, and FTTH and other services. The company's Long Distance and International Communications Business segment offers inter-prefectural communications services, international communications services, and services related to the solutions business and related services. This segment primarily provides cloud, data center, migration and maintenance support, IT system building, professional security, ICT, network, managed, mobile connectivity, and other services, as well as teleconference, web conference, and video conference services. Its Data Communications Business segment offers network system and system integration services comprising ERP services, ICT outsourcing, consulting, system design and development, and other services. The company's Other Business segment engages in the acquisition, development, lease, and management of real estate; design, management, and maintenance of buildings, equipment, and electric power facilities; development of smart energy solutions and energy management systems; lease and sale of telecommunications-related devices; development, production, operation, and maintenance of information communications systems and software; finance; and technology transfer and technical consulting businesses. It also sells telecommunications equipment. Nippon Telegraph and Telephone Corporation was founded in 1952 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "NXCLF": {"short_name": "LIFULL CO LTD", "long_name": "LIFULL Co., Ltd.", "summary": "LIFULL Co., Ltd. provides real estate information services in Japan. It offers LIFULL HOME'S, a site of real estate and housing information; LIFULL Rumah, a real estate and housing information website for Indonesia; LIFULL Concierge, a real estate agency service for Japanese employees re-assigned to Jakarta; Trovit, an aggregation website; and Mitula, a site that provides information in real estate and housing, used cars, recruitment, and fashion. The company also offers LIFULL Move that provides reviews and rankings of the moving companies; LIFULL Storage, a storage space searching web service; LIFULL Nursing Care, a special care facility searching web service; and LIFULL Revitalize Rural Japan that suggest new lifestyles to people in Japan based on refurbishment of abandoned houses. In addition, it offers LIFULL FaM that enables working mothers balance childcare with work while pursuing a career; and LIFULL rental spaces, a site for rental spaces and meeting rooms, event venues, and other rental facilities. Further, the company provides LIFULL FLOWER, an online flower gift shop; LIFULL Investment, a money funding website; LIFULL HUB, a shared office; LIFULL Table, a mixed-style deli restaurant; and LIFULL Marketing Partners that offers full Web assistance for real estate related companies. Additionally, it provides LivingAnywhere Commons, a community to live; instant house products. The company was formerly known as NEXT Co., Ltd. and changed its name to LIFULL Co., Ltd.in April 2017. LIFULL Co., Ltd. was founded in 1997 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "NY0.SG": {"short_name": "Netyear Group Corp. Registered ", "long_name": "Netyear Group Corporation", "summary": "Netyear Group Corporation operates digital marketing platform. It provides consulting services on digital marketing; planning and production of digital content; systems development; and planning and sale of marketing and cloud-based office tools. It also offers data analysis/effect measurement, and social media marketing support services. The company was founded in 1993 and is based in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "STU", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "OCU.MU": {"short_name": "OKINAWA CELL.TEL.", "long_name": "Okinawa Cellular Telephone Company", "summary": "Okinawa Cellular Telephone Company operates as a telecommunications company in Japan. The company provides telecommunication, as well as portable phone services. It also provides au WALLET prepaid and credit card services. The company was founded in 1991 and is headquartered in Naha, Japan. Okinawa Cellular Telephone Company is a subsidiary of KDDI Corporation.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "MUN", "market": "dr_market", "country": "Japan", "city": "Naha"}, "OI4.F": {"short_name": "OIZUMI CORP.", "long_name": "OIZUMI Corporation", "summary": "OIZUMI Corporation manufactures and sells amusement machines and related devices and equipment in Japan. The company offers pachislot machines, preparatory devices, WICA series products, eco equipment, and medal supply collect products. It also leases and manages real estate properties. The company was founded in 1974 and is headquartered in Atsugi, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Atsugi"}, "OPNDF": {"short_name": "OPEN DOOR INC", "long_name": "OpenDoor Inc.", "summary": "OpenDoor Inc. provides Web services through the Internet in Japan. The company operates Travelko, a travel comparison site; TRAVELKO, a multi-language travel comparison site; and GALLERY JAPAN, a Japanese traditional art crafts site. It is also involved in the development and provision of online systems for the Internet and mobile phones; and planning and operation of software development and content delivery. OpenDoor Inc. was founded in 1997 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "OR7.F": {"short_name": "ORICON INC.", "long_name": "Oricon Inc.", "summary": "Oricon Inc. engages in the design and operation of Websites. The company also offers news distribution services; music/book distribution services for smartphones and PCs; and content distribution service for feature phones. In addition, it publishes Confidence, a business magazine for the entertainment industry; provides marketing data and ranking information for music, video, and books; and offers music database for broadcasting stations and EC sites. The company was founded in 1999 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "RYU.F": {"short_name": "SEGA SAMMY HOLDINGS INC.", "long_name": "Sega Sammy Holdings Inc.", "summary": "Sega Sammy Holdings Inc., through its subsidiaries, engages in the game machine, entertainment contents, and resort businesses. The company's Pachislot and Pachinko Machines Business segment develops, manufactures, and sells pachislot and pachinko machines. Its Entertainment Contents Business segment is involved in the development and sale of digital game software, packaged game software, and amusement machines; development and operation of amusement centers; planning, production, and sale of animated films; and development, manufacture, and sale of toys. The company's Resort Business segment develops and operates hotels and golf courses, etc. in integrated resorts business and other facilities businesses. Sega Sammy Holdings Inc. was founded in 2004 and is based in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "SFBQF": {"short_name": "SOFTBANK CORP.", "long_name": "SoftBank Corp.", "summary": "SoftBank Corp., together with its subsidiaries, engages in the telecommunication and information technology businesses in Japan. It operates through Consumer, Enterprise, and Distribution segments. The Consumer segment offers s mobile communications services, including voice call, data transmission, and related services to subscribers under the SoftBank, Y!mobile, and LINE MOBILE brands. It also sells mobile devices, including phones and tablets to dealers; provides Internet broadband services under the SoftBank Hikari brand; and sells and rents related customer-premises equipment for broadband services. The Enterprise segment provides a range of services comprising mobile communications, voice call and fixed-line communications, data transmission and dedicated, and telecommunications consulting services for enterprise customers; construction services for telecommunications carriers and general service providers; and rental and maintenance services for telecommunications facilities, housing, and data centers, as well as sells and rents telecommunications equipment. The Distribution segment offers hardware, software, and services in relation to information and communication technology, cloud, and Internet of Things to enterprise customers. The company also offers PC software, IoT products, and mobile device accessories to individual customers, as well as online business solutions and services, and solution services for government. SoftBank Corp. has a strategic alliance with PT Lippo Karawaci Tbk to develop artificial intelligence and Internet of Things solutions in the real estate and mobility sectors. The company was formerly known as SoftBank Mobile Corp. and changed its name to SoftBank Corp. in May 2015. The company was founded in 1984 and is headquartered in Tokyo, Japan. SoftBank Corp. is a subsidiary of SoftBank Group Japan Corporation.", "currency": "USD", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "SFT.F": {"short_name": "SOFTBANK GROUP CORP.", "long_name": "SoftBank Group Corp.", "summary": "SoftBank Group Corp. provides telecommunication services in Japan and internationally. The company operates through four segments: SoftBank Vision Fund and Other SBIA-Managed Funds, SoftBank, Arm, and Brightstar. The SoftBank Vision Fund and Other SBIA-Managed Funds is involved in investment activities. The SoftBank segment offers mobile communications, broadband, and fixed-line communications services; and sells mobile devices, as well as involved in Internet advertising, e-commerce business. The Arm segment designs microprocessor intellectual property and related technology; sells software tools; and offers software services. The Brightstar segment distributes mobile devices. The company provides investment management and payment services; and generates, supplies, and sells electricity from renewable energy sources, as well as marketing activities. In addition, it offers card services; IT solutions; operates, sells, and markets PC software and online games; and distributes video, voice, and data content. The company operates professional baseball team, as well as manages and maintains baseball stadium and other sports facilities. It also operates fashion online shopping website ZOZOTOWN. The company was formerly known as SoftBank Corp. and changed its name to SoftBank Group Corp. in July 2015. SoftBank Group Corp. was founded in 1981 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "SFTBF": {"short_name": "SOFTBANK GROUP CORP", "long_name": "SoftBank Group Corp.", "summary": "SoftBank Group Corp. provides telecommunication services in Japan and internationally. The company operates through four segments: SoftBank Vision Fund and Other SBIA-Managed Funds, SoftBank, Arm, and Brightstar. The SoftBank Vision Fund and Other SBIA-Managed Funds is involved in investment activities. The SoftBank segment offers mobile communications, broadband, and fixed-line communications services; and sells mobile devices, as well as involved in Internet advertising, e-commerce business. The Arm segment designs microprocessor intellectual property and related technology; sells software tools; and offers software services. The Brightstar segment distributes mobile devices. The company provides investment management and payment services; and generates, supplies, and sells electricity from renewable energy sources, as well as marketing activities. In addition, it offers card services; IT solutions; operates, sells, and markets PC software and online games; and distributes video, voice, and data content. The company operates professional baseball team, as well as manages and maintains baseball stadium and other sports facilities. It also operates fashion online shopping website ZOZOTOWN. The company was formerly known as SoftBank Corp. and changed its name to SoftBank Group Corp. in July 2015. SoftBank Group Corp. was founded in 1981 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "SFTBY": {"short_name": "SOFTBANK GROUP CORP", "long_name": "SoftBank Group Corp.", "summary": "SoftBank Group Corp. provides telecommunication services in Japan and internationally. The company operates through four segments: SoftBank Vision Fund and Other SBIA-Managed Funds, SoftBank, Arm, and Brightstar. The SoftBank Vision Fund and Other SBIA-Managed Funds is involved in investment activities. The SoftBank segment offers mobile communications, broadband, and fixed-line communications services; and sells mobile devices, as well as involved in Internet advertising, e-commerce business. The Arm segment designs microprocessor intellectual property and related technology; sells software tools; and offers software services. The Brightstar segment distributes mobile devices. The company provides investment management and payment services; and generates, supplies, and sells electricity from renewable energy sources, as well as marketing activities. In addition, it offers card services; IT solutions; operates, sells, and markets PC software and online games; and distributes video, voice, and data content. The company operates professional baseball team, as well as manages and maintains baseball stadium and other sports facilities. It also operates fashion online shopping website ZOZOTOWN. The company was formerly known as SoftBank Corp. and changed its name to SoftBank Group Corp. in July 2015. SoftBank Group Corp. was founded in 1981 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "SFTC.VI": {"short_name": "SOFTBANK CORP", "long_name": "SoftBank Corp.", "summary": "SoftBank Corp., together with its subsidiaries, engages in the telecommunication and information technology businesses in Japan. It operates through Consumer, Enterprise, and Distribution segments. The Consumer segment offers s mobile communications services, including voice call, data transmission, and related services to subscribers under the SoftBank, Y!mobile, and LINE MOBILE brands. It also sells mobile devices, including phones and tablets to dealers; provides Internet broadband services under the SoftBank Hikari brand; and sells and rents related customer-premises equipment for broadband services. The Enterprise segment provides a range of services comprising mobile communications, voice call and fixed-line communications, data transmission and dedicated, and telecommunications consulting services for enterprise customers; construction services for telecommunications carriers and general service providers; and rental and maintenance services for telecommunications facilities, housing, and data centers, as well as sells and rents telecommunications equipment. The Distribution segment offers hardware, software, and services in relation to information and communication technology, cloud, and Internet of Things to enterprise customers. The company also offers PC software, IoT products, and mobile device accessories to individual customers, as well as online business solutions and services, and solution services for government. SoftBank Corp. has a strategic alliance with PT Lippo Karawaci Tbk to develop artificial intelligence and Internet of Things solutions in the real estate and mobility sectors. The company was formerly known as SoftBank Mobile Corp. and changed its name to SoftBank Corp. in May 2015. The company was founded in 1984 and is headquartered in Tokyo, Japan. SoftBank Corp. is a subsidiary of SoftBank Group Japan Corporation.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "VIE", "market": "at_market", "country": "Japan", "city": "Tokyo"}, "SFTU.F": {"short_name": "SOFTBANK GR.UNS.ADR1/2/ON", "long_name": "SoftBank Group Corp.", "summary": "SoftBank Group Corp. provides telecommunication services in Japan and internationally. The company operates through four segments: SoftBank Vision Fund and Other SBIA-Managed Funds, SoftBank, Arm, and Brightstar. The SoftBank Vision Fund and Other SBIA-Managed Funds is involved in investment activities. The SoftBank segment offers mobile communications, broadband, and fixed-line communications services; and sells mobile devices, as well as involved in Internet advertising, e-commerce business. The Arm segment designs microprocessor intellectual property and related technology; sells software tools; and offers software services. The Brightstar segment distributes mobile devices. The company provides investment management and payment services; and generates, supplies, and sells electricity from renewable energy sources, as well as marketing activities. In addition, it offers card services; IT solutions; operates, sells, and markets PC software and online games; and distributes video, voice, and data content. The company operates professional baseball team, as well as manages and maintains baseball stadium and other sports facilities. It also operates fashion online shopping website ZOZOTOWN. The company was formerly known as SoftBank Corp. and changed its name to SoftBank Group Corp. in July 2015. SoftBank Group Corp. was founded in 1981 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "SGAMF": {"short_name": "SEGA SAMMY HLDGS INC", "long_name": "Sega Sammy Holdings Inc.", "summary": "Sega Sammy Holdings Inc., through its subsidiaries, engages in the game machine, entertainment contents, and resort businesses. The company's Pachislot and Pachinko Machines Business segment develops, manufactures, and sells pachislot and pachinko machines. Its Entertainment Contents Business segment is involved in the development and sale of digital game software, packaged game software, and amusement machines; development and operation of amusement centers; planning, production, and sale of animated films; and development, manufacture, and sale of toys. The company's Resort Business segment develops and operates hotels and golf courses, etc. in integrated resorts business and other facilities businesses. Sega Sammy Holdings Inc. was founded in 2004 and is based in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "SGAMY": {"short_name": "SEGA SAMMY HLDGS INC", "long_name": "Sega Sammy Holdings Inc.", "summary": "Sega Sammy Holdings Inc., through its subsidiaries, engages in the game machine, entertainment contents, and resort businesses. The company's Pachislot and Pachinko Machines Business segment develops, manufactures, and sells pachislot and pachinko machines. Its Entertainment Contents Business segment is involved in the development and sale of digital game software, packaged game software, and amusement machines; development and operation of amusement centers; planning, production, and sale of animated films; and development, manufacture, and sale of toys. The company's Resort Business segment develops and operates hotels and golf courses, etc. in integrated resorts business and other facilities businesses. Sega Sammy Holdings Inc. was founded in 2004 and is based in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "SKM.F": {"short_name": "SKY PERFECT JSAT HLDG.INC", "long_name": "SKY Perfect JSAT Holdings Inc.", "summary": "SKY Perfect JSAT Holdings Inc. provides satellite-based multichannel pay TV and satellite communications services primarily in Asia. The company operates through Media Business and Space Business segments. The Media Business segment offers platform services, such as customer management activities to broadcasting businesses; and delivers broadcasting services through communication satellite and fiber optic network. The Space Business segment provides communication satellite circuits to the broadcasting businesses; and satellite communication services, including data and mobile communication services to government, public entities, and corporations. The company also produces content; sells satellite connections; operates as telecommunications carrier and systems integrator for satellite communications and broadcasting services; designs, manufactures, and sells industrial drones; offers mobile satellite communication services; and delivers Japanese digital content to overseas audiences. In addition, it provides earth observation satellite images, network and systems integration services; and offers technical support services. The company was formerly known as SKY Perfect JSAT Corporation and changed its name to SKY Perfect JSAT Holdings Inc. in June 2008. SKY Perfect JSAT Holdings Inc. was founded in 1985 and is headquartered in Tokyo, Japan. The company was formerly known as SKY Perfect JSAT Corporation and changed its name to SKY Perfect JSAT Holdings Inc. in June 2008. SKY Perfect JSAT Holdings Inc. was founded in 1985 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Broadcasting", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Minato"}, "SOBKY": {"short_name": "SOFTBANK CORP. UNSPON ADS EACH ", "long_name": "SoftBank Corp.", "summary": "SoftBank Corp., together with its subsidiaries, engages in the telecommunication and information technology businesses in Japan. It operates through Consumer, Enterprise, and Distribution segments. The Consumer segment offers s mobile communications services, including voice call, data transmission, and related services to subscribers under the SoftBank, Y!mobile, and LINE MOBILE brands. It also sells mobile devices, including phones and tablets to dealers; provides Internet broadband services under the SoftBank Hikari brand; and sells and rents related customer-premises equipment for broadband services. The Enterprise segment provides a range of services comprising mobile communications, voice call and fixed-line communications, data transmission and dedicated, and telecommunications consulting services for enterprise customers; construction services for telecommunications carriers and general service providers; and rental and maintenance services for telecommunications facilities, housing, and data centers, as well as sells and rents telecommunications equipment. The Distribution segment offers hardware, software, and services in relation to information and communication technology, cloud, and Internet of Things to enterprise customers. The company also offers PC software, IoT products, and mobile device accessories to individual customers, as well as online business solutions and services, and solution services for government. SoftBank Corp. has a strategic alliance with PT Lippo Karawaci Tbk to develop artificial intelligence and Internet of Things solutions in the real estate and mobility sectors. The company was formerly known as SoftBank Mobile Corp. and changed its name to SoftBank Corp. in May 2015. The company was founded in 1984 and is headquartered in Tokyo, Japan. SoftBank Corp. is a subsidiary of SoftBank Group Japan Corporation.", "currency": "USD", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "SQNNY": {"short_name": "SQUARE ENIX HOLDINGS CO.LTD.", "long_name": "Square Enix Holdings Co., Ltd.", "summary": "Square Enix Holdings Co., Ltd. operates in the content and service businesses in Japan, North America, Europe, and rest of Asia. It operates through four segments: Digital Entertainment, Amusement, Publication, and Merchandising. The company's Digital Entertainment segment plans, develops, distributes, and operates digital entertainment content primarily in the form of games. This segment offers digital entertainment content for various customer usage environments, including personal computers and smart devices, as well as consumer game consoles, such as handheld game machines. Its Amusement segment is involved in the operation of amusement facilities. This segment also engages in the planning, development, distribution, and rental of arcade game machines and related products for amusement facilities. The company's Publication segment publishes and licenses comic magazines, comic books, and game-related books. Its Merchandising segment plans, produces, distributes, and licenses derivative products. The company publishes, distributes, and licenses entertainment content under the SQUARE ENIX and TAITO brands. Square Enix Holdings Co., Ltd. was founded in 1975 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "SQNXF": {"short_name": "SQUARE ENIX HOLDINGS CO.LTD.", "long_name": "Square Enix Holdings Co., Ltd.", "summary": "Square Enix Holdings Co., Ltd. operates in the content and service businesses in Japan, North America, Europe, and rest of Asia. It operates through four segments: Digital Entertainment, Amusement, Publication, and Merchandising. The company's Digital Entertainment segment plans, develops, distributes, and operates digital entertainment content primarily in the form of games. This segment offers digital entertainment content for various customer usage environments, including personal computers and smart devices, as well as consumer game consoles, such as handheld game machines. Its Amusement segment is involved in the operation of amusement facilities. This segment also engages in the planning, development, distribution, and rental of arcade game machines and related products for amusement facilities. The company's Publication segment publishes and licenses comic magazines, comic books, and game-related books. Its Merchandising segment plans, produces, distributes, and licenses derivative products. The company publishes, distributes, and licenses entertainment content under the SQUARE ENIX and TAITO brands. Square Enix Holdings Co., Ltd. was founded in 1975 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "THDDY": {"short_name": "TV ASAHI HOLDINGS CORP", "long_name": "TV Asahi Holdings Corporation", "summary": "TV Asahi Holdings Corporation, through its subsidiaries, engages in television (TV) broadcasting business in Japan and internationally. The company operates through TV Broadcasting Business, Music Publication Business, and Other Businesses segments. Its TV broadcasting business comprises time sales, spot sales, special programs, and sports broadcast activities; and other businesses include internet-related businesses, TV shopping programs, and special events. The company also invests in motion pictures; and sells and leases equipment and DVDs. TV Asahi Holdings Corporation was founded in 1957 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Communication Services", "industry": "Broadcasting", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "TOE.F": {"short_name": "TOEI CO. LTD", "long_name": "Toei Company, Ltd.", "summary": "Toei Company, Ltd. engages in the production of movies, TV shows, animation, and various other video products in Japan. The company plans, develops, produces, and distributes theatrical movies and events; engages in online shopping business; manages and operates movie theatres and cinema complexes; offers DVDs and Blu-ray discs; and provides video content distribution services. It also offers content to Toei Channel, a CS broadcasting station, as well as various broadcasting media; and grants videogram rights to stations. In addition, the company provides commoditizing rights for toys, apparel, everyday items, food products, stationeries, publications, CDs, DVDs, games, gaming machines, and theme parks. Further, it operates movie studios; undertakes various cultural events; offers real estate leasing services for office buildings and condominiums; owns and operates a golf course; and operates hotels. Toei Company, Ltd. was incorporated in 1949 and is based in Tokyo, Japan.", "currency": "EUR", "sector": "Communication Services", "industry": "Entertainment", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}}