{
    "07C.F": {
        "short_name": "COOKPAD INC.",
        "long_name": "Cookpad Inc.",
        "summary": "Cookpad Inc. operates a community platform to share recipe ideas and cooking tips worldwide. It also engages in Cookpad mart and TV businesses. The company was formerly known as Coin Ltd. and changed its name to Cookpad Inc. in June 1999. Cookpad Inc. was founded in 1997 and is based in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2139.T": {
        "short_name": "CHUCO CO.LTD",
        "long_name": "Chuco Co., Ltd.",
        "summary": "Chuco Co., Ltd. publishes magazines in Japan. Its magazines comprise life and parenting information. The company also provides employment support books for high school students; and Furimo AR, a mobile version of community life information magazine. In addition, it is involved in mail-order, event seminar, and voluntary chain businesses. Further, the company plans advertising strategies and advertising, as well as promotes sales; handles advertising media, such as TV, radio, newspaper, magazine, printed matter, outdoor advertising, etc.; and implements advertising production and sales promotion, and Internet advertising. Chuco Co., Ltd. was founded in 1978 and is headquartered in Gifu, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Gifu"
    },
    "2148.T": {
        "short_name": "ITMEDIA INC.",
        "long_name": "ITmedia Inc.",
        "summary": "ITmedia Inc. engages in the development and operation of Internet-only media providing information and services centered on technology and business field in Japan. The company was formerly known as Softbank ITmedia, Inc. and changed its name to ITmedia Inc. in March 2005. ITmedia Inc. was founded in 1999 and is headquartered in Tokyo, Japan. ITmedia Inc. is a subsidiary of SB Media Holdings Corp.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2156.T": {
        "short_name": "SAYLOR ADVERTISING INC.",
        "long_name": "Saylor Advertising.Inc.",
        "summary": "Saylor Advertising.Inc. operates as an advertising company. It offers TV commercial, radio, newspaper, magazine, outdoor, traffic, poster, brochure, and flyer advertising services; and event, Web digital promotion, and promotion services. The company also provides marketing and sales promotion planning services; and event, exhibition, and ceremony planning and management services. The company was founded in 1951 and is headquartered in Takamatsu, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Takamatsu"
    },
    "2173.T": {
        "short_name": "HAKUTEN CORPORATION",
        "long_name": "Hakuten Corporation",
        "summary": "Hakuten Corporation provides marketing services in Japan. It offers event promotion services, such as product promotion, user events, and PR events; exhibitions, including domestic joint exhibitions, academic-corporate events, and overseas events; business meetings and private shows comprising company sponsored business events, new product launch exhibitions, company anniversary exhibitions, joint exhibitions, and recruiting and education fairs; and conferences and conventions consisting of roadshows, meeting events, conferences, and ceremonies. The company also provides various services for commercial spaces, such as showrooms, retail stores, office design, apartment galleries, pop-up shops, and promotional furniture; digital marketing and contents, including Web marketing, social media marketing, database marketing, and event-related digital content services; CMS and Web integration services; and marketing and communications services comprising planning and execution of communications strategy consisting of branding, advertising, research, and telesales. It serves IT, communications, precision engineering, machinery, electricity, food, toy, and fashion companies, as well as government agencies. The company was founded in 1967 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2178.T": {
        "short_name": "TRI-STAGE INC",
        "long_name": "Tri-Stage Inc.",
        "summary": "Tri-Stage Inc. provides direct marketing services for companies in Japan. The company offers television (TV) programs and commercial slots to companies that conduct direct marketing; and a range of services, including advisory services in areas, such as the creation of TV program, contact center operation, and distribution and payment. Its direct marketing value chain services include product development, business planning, creative planning, media selection, order support, impact analysis, information processing, distribution and payment, and customer management. The company also provides support services for direct marketing; and direct mail advertising, and envelope filling and posting services. In addition, it wholesales services to TV shopping channels; retails Japanese traditional and unique products; and offers multi-channel-marketing and marketing services, as well as operates as a media agency. Further, the company imports and exports its products. Tri-Stage Inc. was founded in 2006 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2180.T": {
        "short_name": "SUNNY SIDE UP GROUP INC",
        "long_name": "Sunny Side Up Group, Inc.",
        "summary": "Sunny Side Up Group, Inc., together with its subsidiaries, engages in the public relations business in Japan. It offers sales promotion, merchandising, OEM, and other services; and is involved in planning and promoting marketing communication strategies for casting of advertisement, films, program and creative consulting, commercial productions, graphic content, program creation, media purchasing, event productions, promotional activities, Web productions, video productions, content productions, casting, publicity, and others. The company also provides human resource education, certification tests, staffing agency, apprenticeship support, student ambassador, etc.; and develops and manages restaurants under the bills name. The company was formerly known as Sunny Side Up Inc. and changed its name to Sunny Side Up Group, Inc. in January 2020. Sunny Side Up Group, Inc. was founded in 1985 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2193.T": {
        "short_name": "COOKPAD INC.",
        "long_name": "Cookpad Inc.",
        "summary": "Cookpad Inc. operates a community platform to share recipe ideas and cooking tips worldwide. It also engages in Cookpad mart and TV businesses. The company was formerly known as Coin Ltd. and changed its name to Cookpad Inc. in June 1999. Cookpad Inc. was founded in 1997 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2402.T": {
        "short_name": "AMANA INC",
        "long_name": "amana inc.",
        "summary": "amana inc. provides visual communication solutions for the production, management, and application of visual component and content. The company's stock materials services include planning and selling stock materials, copyrights and subject-rights services, content database, and content production and editing. It also offers visual content services, such as still photography, movie production, and 2D and 3D computer graphics; and communication solutions, including graphic design, TV commercials and movies, Websites, applications, events, editorial content, promotion, and branding. In addition, the company produces and publishes magazines under the IMA, MilK japon, Ryori Tsushin, and NATURE&SCIENCE names. The company was formerly known as amana holdings inc. and changed its name to amana inc. in April 2014. amana inc. was founded in 1979 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2411.T": {
        "short_name": "GENDAI AGENCY INC",
        "long_name": "Gendai Agency Inc.",
        "summary": "Gendai Agency Inc. engages in planning and production of advertising and promotion services in Japan. The company provides advertising services, online and mass media advertising, newspaper flyers, and sales promotions. Its services include video and web content production; and research and development. The company also engages in the planning, production, construction, and management of outdoor advertising; and real estate activities. In addition, it operates casino and electronic casino facilities; sells slot machines, etc.; and offers consulting services. The company was founded in 1995 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2433.T": {
        "short_name": "HAKUHODO DY HLDGS INC",
        "long_name": "Hakuhodo DY Holdings Inc",
        "summary": "Hakuhodo DY Holdings Inc., through its subsidiaries, operates as a marketing services company in Japan and internationally. It offers planning, production, marketing, public relations, and other services related to the presentation of advertising in various media, such as newspapers, magazines, radio, television, and digital media. The company also provides brand building services; and specializes in business development in the entertainment field, including animated programs and live events. In addition, it is involved in the planning, production, buying, and media traffic in media and contents businesses, as well as provision of marketing solutions for advertisers, media companies, and content holders. Hakuhodo DY Holdings Inc. was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2436.T": {
        "short_name": "KYODO PUBLIC RELATIONS CO LTD",
        "long_name": "Kyodo Public Relations Co., Ltd.",
        "summary": "Kyodo Public Relations Co., Ltd. operates as an integrated communications and public relations agency in Japan and internationally. The company offers services in media relations, branding and strategy, social and digital, influencer marketing, public affairs, crisis and risk management, media training, and localization areas. It serves technology, travel and tourism, healthcare, finance, lifestyle, and other industries. The company was founded in 1964 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3622.T": {
        "short_name": "NETYEAR GROUP CORPORATION",
        "long_name": "Netyear Group Corporation",
        "summary": "Netyear Group Corporation operates digital marketing platform. It provides consulting services on digital marketing; planning and production of digital content; systems development; and planning and sale of marketing and cloud-based office tools. It also offers data analysis/effect measurement, and social media marketing support services. The company was founded in 1993 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3690.T": {
        "short_name": "YRGLM INC",
        "long_name": "YRGLM Inc.",
        "summary": "YRGLM Inc. provides marketing automation platforms in Japan. It offers AD EBiS, a platform which measures and analyzes the effect obtained from Internet advertisement; THREe, which enables automatic optimization and submission to the elements of marketing automation; and EC-CUBE, a commercial distribution platform, as well as ADREPO, an automatic creation tool for operational advertisement report. The company was formerly known as LOCKON Co., LTD. and changed its name to YRGLM Inc. in August 2019. The company was founded in 2001 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "3975.T": {
        "short_name": "AOI TYO HLDGS INC",
        "long_name": "AOI TYO Holdings Inc.",
        "summary": "AOI TYO Holdings Inc. engages in the production of various advertising video content in Japan and internationally. It also offers post-production services; xR content production services; and video, digital, PR, event, and spatial design solutions for the advertising and marketing sector. The company was founded in 2017 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4170.T": {
        "short_name": "KAIZEN PLATFORM INC",
        "long_name": "Kaizen Platform, Inc.",
        "summary": "Kaizen Platform, Inc. operates websites to UI/UX and video production for marketing/sales/promotion materials. The company offers KAIZEN Sales, a cloud sales support solution that accelerates digital transformation of remote sales; UX solutions, including KAIZEN Engine and KAIZEN Team; and video solutions comprising KAIZEN Ad, KAIZEN Video, and KAIZEN TV. It also provides DX human resources training courses. Kaizen platform Inc. was founded in 2013 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4286.T": {
        "short_name": "LEGS CO LTD",
        "long_name": "Legs Company, Ltd.",
        "summary": "Legs Company, Ltd. provides corporate marketing support services in Japan and internationally. The company offers campaign planning and database marketing services; and point of purchase and visual merchandising tools, as well as develops and produces premium goods/novelties and OEM products. It also specializes in tailoring promotional programs for specific needs and services. The company was founded in 1988 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4293.T": {
        "short_name": "SEPTENI HOLDINGS",
        "long_name": "Septeni Holdings Co., Ltd.",
        "summary": "Septeni Holdings Co., Ltd., through its subsidiaries, engages in the digital marketing and media platform businesses in Japan and internationally. The company provides Internet marketing support services, including marketing platform with cloud-based CRM, and sale and operation of smartphone-based Internet advertising. It also cultivates and produces Manga artists and distributes Manga works online. In addition, the company operates ViViViT, a matching-type recruitment platform that matches companies with students aspiring to be IT engineers and web designers; gooddo, a social contribution platform; and Pharmarket, a platform through which it purchases immobile stock from dispensary pharmacies and sells it on to other pharmacies. Further, it provides incubation support services that foster and cultivate new businesses from the initial creation stages. The company was formerly known as Septeni Co., Ltd. and changed its name to Septeni Holdings Co., Ltd. in October 2006. Septeni Holdings Co., Ltd. was founded in 1990 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4324.T": {
        "short_name": "DENTSU GROUP INC",
        "long_name": "Dentsu Group Inc.",
        "summary": "Dentsu Group Inc. operates in the advertising business in Japan and internationally. The company offers advertising services, including newspapers, magazines, radio, television, internet, sales promotions, movies, outdoors, transportation, and other advertising operations and advertising expressions. It is also involved in the consulting, development, and operation of information systems; sale of various software products; and provision of marketing and comprehensive network services. In addition, the company leases office buildings; and buys and sells real estate properties, as well as offers building and commission calculation services. Dentsu Group Inc. was founded in 1901 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4326.T": {
        "short_name": "INTAGE HOLDINGS INC",
        "long_name": "INTAGE HOLDINGS Inc.",
        "summary": "INTAGE HOLDINGS Inc. operates as a marketing research company in Japan and internationally. It operates through Marketing Support (Consumer Goods & Services), Marketing Support (Healthcare), and Business Intelligence segments. The company offers panel and custom research services to provide marketing support for a range of clients, including consumer goods manufacturers, advertisers, government agencies, and IT companies; and prescription information analysis services, and marketing survey and research of over-the-counter (OTC) and prescription drugs for pharmaceutical companies, as well as operates as a contract research organization. It also provides system development/operation, business process outsourcing, data center operation, and data utilization services; data modeling; enterprise solutions and research; and architecture, operation, introduction support, and auditing of IT infrastructure for the pharmaceutical, health information, manufacturing, travel, publishing, consumer goods manufacturing, services, advertising, wholesale, and retail sectors. The company was formerly known as INTAGE Inc. and changed its name to INTAGE HOLDINGS Inc. in October 2013. INTAGE HOLDINGS Inc. was founded in 1960 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4499.T": {
        "short_name": "SPEEE INC",
        "long_name": "Speee, Inc.",
        "summary": "Speee, Inc. engages in the marketing intelligence and digital transformation businesses in Japan. It offers UZOU, an ad distribution platform; VOYAGER, an integrated ad operation platform; and Markeship, a digital marketing support platform, as well as consulting services. The company also operates Yeur, a site that supports real estate sales; Yeoul, a Web service for collective assessment of real estate sales; and Nurikae for requesting a quote for exterior wall/roof painting. Speee, Inc. was founded in 2007 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6031.T": {
        "short_name": "SCIGINEER INC",
        "long_name": "Scigineer Inc.",
        "summary": "Scigineer Inc. engages in the Internet media and Internet advertising agency businesses in Japan. It is also involved in the planning and development of Internet and Web, and computer systems; sale and maintenance of information systems; research and development in the fields of computer science and artificial intelligence; and provision of consulting and management services. The company was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6045.T": {
        "short_name": "RENTRACKS CO LTD",
        "long_name": "Rentracks CO.,LTD.",
        "summary": "Rentracks Co.,Ltd. offers WEB consulting and Internet media services in Japan and internationally. The company's WEB consulting services include SEO, SEM, customer attraction Websites building, Web production, and advertising agency services; and Internet media services comprise planning, production, and operation of various Websites. It also operates as a closed affiliate service provider; and GAME FEAT that provides advertising services to support monetization of game apps, as well as RT Management, a cloud type personnel affairs system service. The company was formerly known as Coel Co, Ltd. and changed its name to Rentracks Co.,Ltd. in January 2006. Rentracks Co.,Ltd. was founded in 2005 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6094.T": {
        "short_name": "FREAKOUT HOLDINGS INC",
        "long_name": "FreakOut Holdings, inc.",
        "summary": "FreakOut Holdings, inc., through its subsidiaries, offers advertising solutions in Japan and internationally. It engages in the development and sale of DSPs and DMPs; data mining, development, and sale of ad applications; and planning and sale of advertising. The company is also involved in IoT-based digital signage business; global app marketing, pubic relations, and media business; provision of trading desk and monetization platform for digital media; and female-focused media, and digital creative and performance agencies businesses. In addition, it operates a data-driven digital agency that specializes in programmatic ad operation and data science; and engages in cross-device tracking and targeted advertising business utilizing video/image/beacon recognition technology. FreakOut Holdings, inc. was formerly known as FreakOut, inc and changed its name to FreakOut Holdings, inc. in January 2017. The company was founded in 2010 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6177.T": {
        "short_name": "APPBANK INC",
        "long_name": "AppBank Inc.",
        "summary": "AppBank Inc. provides iPhone applications, iPhone case accessories, and iPhone related news through AppBank.net site. It also provides movie media services through Max Murai Channel and AppBankTV; and operates gaming Websites, including Pazudora Ultimate Capture Database and Monst Strategy, as well as iPhone and android applications. In addition, the company offers puzzle games; and sells banner and article advertisements to support companies and individual developers. Further, it engages in the rights management and store businesses. AppBank Inc. was founded in 2008 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6533.T": {
        "short_name": "ORCHESTRA HOLDINGS",
        "long_name": "Orchestra Holdings Inc.",
        "summary": "Orchestra Holdings Inc. engages in the digital transformation, digital marketing, and other businesses in Japan. The company's solutions include operational advertisement, Website/application development, content marketing, SEO, and data analysis. It is also involved in the provision of innovation sharing services; venture capital services to entrepreneurs; talent management cloud services; and M&A advisory services. It also engages in the development, design, construction, and operation of cloud-based contact centers. The company was formerly known as Digital Identity Inc. and changed its name to Orchestra Holdings Inc. in July 2017. Orchestra Holdings Inc. was founded in 2009 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6535.T": {
        "short_name": "I MOBILE CO LTD",
        "long_name": "i-mobile Co.,Ltd.",
        "summary": "i-mobile Co., Ltd. provides Internet advertising platform for clients to advertise their product and for publishers to monetize their cyberspace in Japan. The company was founded in 2007 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6543.T": {
        "short_name": "NISSEN INC",
        "long_name": "Nissen Inc.",
        "summary": "Nissen Inc. engages in communication design/advertising, promotion strategy development/ sales promotion/consulting/surveying businesses in Japan. The company also offers graphic design/copywriting/corporate identity development/catalog production/Web site production/display design/edit/production of PR magazine/CM production/movie production/talent casting/various advertisement design services. In addition, it offers media publishing and agency services; catalog/poster/brochure/calendar/sales promotion tool/novelty printing services; and call center/various telemarketing services. Nissen Inc. was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6550.T": {
        "short_name": "FRINGE81 CO LTD",
        "long_name": "Fringe81 Co, Ltd.",
        "summary": "Fringe81 Co, Ltd. provides Internet advertising technology development/consulting services in Japan. The company offers Unipos, a service to send and receive peer bonuses; docomo Ad Network, a service that advertises large-scale data of NTT DoCoMo using real-time processing technology of various data and distribution optimization technology in the site and application visited by users; digitalice, which measures video advertisements; Columva, an advertising operation reviewing support tool to make ad operations decision making faster/easier; and TagKnight, a solution and consulting service that allows to check the task of installing tags on behalf of advertisement companies and advertising agencies, as well as for testing tags. It also provides advertisement planning and operation services, as well as Web services in HR Tech areas, etc. The company was incorporated in 2012 and is based in Tokyo, Japan. Fringe81 Co, Ltd. is a subsidiary of Fringe81 Holdings Co., Ltd.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7036.T": {
        "short_name": "EMNET JAPAN CO LTD",
        "long_name": "eMnet Japan.co.ltd.",
        "summary": "eMnet Japan.co.ltd. engages in the Internet advertising business. The company offers search linked, operational display, SNS, feed, and net advertising services; overseas advertising services; access analysis; and content marketing services. It is also involved in the Website creation and LP/banner production activities. The company was founded in 2007 and is based in Tokyo, Japan. eMnet Japan.co.ltd. is a subsidiary of eMnet Inc.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7044.T": {
        "short_name": "PIALA INC",
        "long_name": "Piala Inc.",
        "summary": "PIALA Inc. provides marketing services in Asia. It offers a range of services, such as marketing, event, system/apps development, design, etc., as well as develops various services as a general support for its clients, such as solution for real/Web media, big data analysis, and consultation. The company was founded in 2004 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7068.T": {
        "short_name": "FEEDFORCE INC",
        "long_name": "Feedforce Inc.",
        "summary": "Feedforce Inc. engages in data feed, digital advertising, social media marketing, and other businesses in Japan. The company offers Social PLUS, an ASP service that implements external ID collaboration on customers Website based on the social login function; and EC Booster, an advertising operation automation tool that delivers Google Shopping Ads. It also provides Dfplus.io, a data feed integrated management platform for ad managers to draw out feed advertisement performance; DF PLUS, a data feed operation ASP service that converts, optimizes, and distributes the product data of a company to various media, such as dynamic banner ads, retargeting ads, external media sites, etc.; and Feedmatic, a service that plans, designs, and operates advertising operations. The company was incorporated in 2006 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7095.T": {
        "short_name": "MACBEE PLANET INC",
        "long_name": "Macbee Planet, Inc.",
        "summary": "Macbee Planet,Inc. engages in analytics consulting business in Japan. The company is involved in marketing analysis activities, which builds LTV prediction models by analyzing and visualizing purchasing data to derive optimal marketing methods; and the marketing technology business that offers sales and operation support for in-house developed products utilizing data and technology. Its products include Robee web customer service tool and Honeycomb data analysis platform. The company was founded in 2015 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7357.T": {
        "short_name": "GEOCODE CO LTD",
        "long_name": "GEOCODE CO.,Ltd.",
        "summary": "GEOCODE CO.,Ltd. engages web marketing and cloud businesses. The company offers search engine optimization and advertisement agency services; and website and various systems planning, production, and consulting services. It also develops, operates, and sells Next IC Card, a cloud-based attendance management, transportation expenses, and expense settlement tool; and Next SFA, a cloud-based sales support tool. The company was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9466.T": {
        "short_name": "AIDMA MARKETING COMMUNICATION C",
        "long_name": "Aidma Marketing Communication Corporation",
        "summary": "Aidma Marketing Communication Corporation provides marketing support services in the fields of distribution and retail. It offers ARSS promotional solutions, market research planning, Aidoma big data platform solutions, Web SP solutions, and promotional support solutions. The company was formerly known as Aidma Corporation and changed its name to Aidma Marketing Communication Corporation in April 2015. The company was founded in 1977 and is headquartered in Toyama, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Toyama"
    },
    "9625.T": {
        "short_name": "CERESPO CO LTD",
        "long_name": "Cerespo Co., Ltd.",
        "summary": "Cerespo Co., Ltd. operates as an event production company in Japan. It engages in the production, site setting, operation, and progression of events, promotions, sports events, ceremonies, and recreation events. The company also plans, develops, manufactures, sells, and rents goods and fixtures. In addition, it is involved in the supervision and construction of civil engineering and architectural designs; and the provision of security services. Cerespo Co., Ltd. was founded in 1977 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "CKPDY": {
        "short_name": "COOKPAD INC.",
        "long_name": "Cookpad Inc.",
        "summary": "Cookpad Inc. operates a community platform to share recipe ideas and cooking tips worldwide. It also engages in Cookpad mart and TV businesses. The company was formerly known as Coin Ltd. and changed its name to Cookpad Inc. in June 1999. Cookpad Inc. was founded in 1997 and is based in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "CYAGF": {
        "short_name": "CYBER AGENT",
        "long_name": "CyberAgent, Inc.",
        "summary": "CyberAgent, Inc. engages in the media, internet advertising, game, and investment development businesses primarily in Japan. The company operates Abema, a hybrid service that offers linear (TV) and on-demand viewing; Ameba, a blog service; Tapple for online dating; AWA, a music streaming service; and WinTicket for online betting. It also offers internet advertising agency and ad technology services; and smartphone games. In addition, the company operates a programming school for kids; CROSS ME; and Nizista, a Web magazine, as well as provides application and reward points exchange platform services. CyberAgent, Inc. was founded in 1998 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "CYGIY": {
        "short_name": "CYBER AGENT",
        "long_name": "CyberAgent, Inc.",
        "summary": "CyberAgent, Inc. engages in the media, internet advertising, game, and investment development businesses primarily in Japan. The company operates Abema, a hybrid service that offers linear (TV) and on-demand viewing; Ameba, a blog service; Tapple for online dating; AWA, a music streaming service; and WinTicket for online betting. It also offers internet advertising agency and ad technology services; and smartphone games. In addition, the company operates a programming school for kids; CROSS ME; and Nizista, a Web magazine, as well as provides application and reward points exchange platform services. CyberAgent, Inc. was founded in 1998 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "DEN.F": {
        "short_name": "DENTSU GROUP INC.",
        "long_name": "Dentsu Group Inc.",
        "summary": "Dentsu Group Inc. operates in the advertising business in Japan and internationally. The company offers advertising services, including newspapers, magazines, radio, television, internet, sales promotions, movies, outdoors, transportation, and other advertising operations and advertising expressions. It is also involved in the consulting, development, and operation of information systems; sale of various software products; and provision of marketing and comprehensive network services. In addition, the company leases office buildings; and buys and sells real estate properties, as well as offers building and commission calculation services. Dentsu Group Inc. was founded in 1901 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "DNTUF": {
        "short_name": "DENTSU GROUP INC",
        "long_name": "Dentsu Group Inc.",
        "summary": "Dentsu Group Inc. operates in the advertising business in Japan and internationally. The company offers advertising services, including newspapers, magazines, radio, television, internet, sales promotions, movies, outdoors, transportation, and other advertising operations and advertising expressions. It is also involved in the consulting, development, and operation of information systems; sale of various software products; and provision of marketing and comprehensive network services. In addition, the company leases office buildings; and buys and sells real estate properties, as well as offers building and commission calculation services. Dentsu Group Inc. was founded in 1901 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "DNTUY": {
        "short_name": "DENTSU GROUP INC",
        "long_name": "Dentsu Group Inc.",
        "summary": "Dentsu Group Inc. operates in the advertising business in Japan and internationally. The company offers advertising services, including newspapers, magazines, radio, television, internet, sales promotions, movies, outdoors, transportation, and other advertising operations and advertising expressions. It is also involved in the consulting, development, and operation of information systems; sale of various software products; and provision of marketing and comprehensive network services. In addition, the company leases office buildings; and buys and sells real estate properties, as well as offers building and commission calculation services. Dentsu Group Inc. was founded in 1901 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "HDU.F": {
        "short_name": "HAKUHODO DY HLDGS INC.",
        "long_name": "Hakuhodo DY Holdings Inc",
        "summary": "Hakuhodo DY Holdings Inc., through its subsidiaries, operates as a marketing services company in Japan and internationally. It offers planning, production, marketing, public relations, and other services related to the presentation of advertising in various media, such as newspapers, magazines, radio, television, and digital media. The company also provides brand building services; and specializes in business development in the entertainment field, including animated programs and live events. In addition, it is involved in the planning, production, buying, and media traffic in media and contents businesses, as well as provision of marketing solutions for advertisers, media companies, and content holders. Hakuhodo DY Holdings Inc. was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "HKUOY": {
        "short_name": "HAKUHODO DY HLDGS INC",
        "long_name": "Hakuhodo DY Holdings Inc",
        "summary": "Hakuhodo DY Holdings Inc., through its subsidiaries, operates as a marketing services company in Japan and internationally. It offers planning, production, marketing, public relations, and other services related to the presentation of advertising in various media, such as newspapers, magazines, radio, television, and digital media. The company also provides brand building services; and specializes in business development in the entertainment field, including animated programs and live events. In addition, it is involved in the planning, production, buying, and media traffic in media and contents businesses, as well as provision of marketing solutions for advertisers, media companies, and content holders. Hakuhodo DY Holdings Inc. was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "NY0.SG": {
        "short_name": "Netyear Group Corp. Registered ",
        "long_name": "Netyear Group Corporation",
        "summary": "Netyear Group Corporation operates digital marketing platform. It provides consulting services on digital marketing; planning and production of digital content; systems development; and planning and sale of marketing and cloud-based office tools. It also offers data analysis/effect measurement, and social media marketing support services. The company was founded in 1993 and is based in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    }
}