{
    "1RO.SG": {
        "short_name": "BROCCOLI CO. LTD. Registered Sh",
        "long_name": "Broccoli Co., Ltd.",
        "summary": "Broccoli Co., Ltd. operates in the entertainment industry in Japan and internationally. It develops and creates various contents, including comics, animations, games, and music. The company was founded in 1994 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "176-0012",
        "website": "http://www.broccoli.co.jp",
        "market_cap": 105419784
    },
    "2329.T": {
        "short_name": "TOHOKUSHINSHA FILM CORPORATION",
        "long_name": "Tohokushinsha Film Corporation",
        "summary": "Tohokushinsha Film Corporation engages in the media business in Japan. The company develops and produces television programs, unrivaled web, and corporate and event video content; feature films and drama series for television; animations and games; visual media; content; documentaries; television commercials, web videos; and motion pictures. It also involves in the commercial production, promotions, broadcasting and streaming services, management of voice and translator as dubbing, and sales of media storage and recording devices, as well as operation of supermarkets and brewery, and provision of interior design services. The company was founded in 1961 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-8460",
        "website": "http://www.tfc.co.jp",
        "market_cap": 30969516032
    },
    "2706.T": {
        "short_name": "BROCOLLI CO LTD",
        "long_name": "Broccoli Co., Ltd.",
        "summary": "Broccoli Co., Ltd. operates in the entertainment industry in Japan and internationally. It develops and creates various contents, including comics, animations, games, and music. The company was founded in 1994 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "176-0012",
        "website": "http://www.broccoli.co.jp",
        "market_cap": 14100598784
    },
    "3929.T": {
        "short_name": "SOCIALWIRE CO LTD",
        "long_name": "Socialwire Co., Ltd.",
        "summary": "Socialwire Co., Ltd. engages in the news wire and incubation businesses in Japan and internationally. The company provides press release delivery agency to companies, government agencies, organizations, etc. under the @Press brand; influencer marketing services under the Find Model brand; article clipping services of newspaper, magazine, and Web media under the @clipping brand; and translation services under the TRANSMART brand. It is also involved in the rental of office services under the CROSSCOOP brand. The company was founded in 2006 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.socialwire.net",
        "market_cap": 4294456576
    },
    "4301.T": {
        "short_name": "AMUSE INC",
        "long_name": "Amuse Inc.",
        "summary": "Amuse Inc. engages in the artist management, content, media visual, place management, and other businesses in Japan and internationally. The company engages in music distribution, license management, development of new projects, record production, music management, and artist management services; planning, development, and operation of location business and inbound business; production and organizing of concerts, theatrical plays, theatrical entertainment, movies, and lectures; operation, planning, and management of restaurants; and planning and sale of character merchandise. It is also involved in planning, production, tour attending, and consulting work related to live performances and events; development of Belgian beer bars, and importing and wholesale business; artist merchandising, and apparel business; planning, manufacturing, and sale of ladies apparel under the MUVEIL and Agris brand, and men's apparel under the Junhashimoto brand; and mail order and fan club management, as well as the provision of tickets, venue solutions, other solutions, etc. In addition, the company engages in live broadcast of live entertainment, such as concerts, events, and stage performances to movie theaters and music halls; planning, production, and distribution of pre-recorded contents, including films, concert films, and TV programs; and E-ticket sales platform business, as well as offers consulting services. Further, it is involved in operating theme parks. Amuse Inc. was incorporated in 1977 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.amuse.co.jp",
        "market_cap": 40975626240
    },
    "4347.T": {
        "short_name": "BROADMEDIA CORPORATION",
        "long_name": "Broadmedia Corporation",
        "summary": "Broadmedia Corporation engages in content distribution business in Japan. The company operates through four segments: Studio & Content, Broadcast, Technology, and Education. The Studio & Content segment purchases rights for movies, TV dramas, animated programs, and other video products; sells DVDs and Blu-ray discs; distributes content to theaters; licenses broadcasting rights to TV stations; and produces video and audio for related subtitles, dubbing, trailers, and program advertisements. This segment also operates Crank In!, an entertainment information site; Crank In! Trend for latest trends and lifestyle information for women; Crank In! Video that provides video content, such as new foreign films, new Japanese films, popular animations, and dramas; and Crank In! Comic, a digital comic service, as well as rents screening rooms. The Broadcast segment produces broadcasts, and distributes programs; and delivers Fishing Vision VOD, a specialty fishing video distribution service. The Technology segment offers technology services, including the delivery of content through CDN; robust security services; CM online service that transmits large volumes of data for the industry; electronic delivery services for digital cinema; and develops cloud gaming. The Education segment operates online and credit-based e-learning high schools with various courses for students comprising of eSports, entertainment, and beauty care; and provides Japanese language education program for non-Japanese people. In addition, it manages the CYCLOPS athlete gaming, a professional eSports team and promotes eSports business. The company was founded in 1996 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0052",
        "website": "http://www.broadmedia.co.jp",
        "market_cap": 6340362240
    },
    "4816.T": {
        "short_name": "TOEI ANIMATION",
        "long_name": "Toei Animation Co.,Ltd.",
        "summary": "Toei Animation Co.,Ltd. produces, markets, and licenses animation products worldwide. It operates through three segments, Video Production and Sales Business, Copyright Business, and Product Sales Business. The company plans and produces various animation works for theaters and television, terrestrial broadcasting, CS broadcasting, and packaging, and sells in various media forms such as game software, mobile terminals, and the internet. It also develops and sells character products. As of March 2020, it owns 246 theater works, 223 TV works, and 12,867 episodes of content. The company was founded in 1948 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "164-0001",
        "website": "http://www.toei-anim.co.jp",
        "market_cap": 497271046144
    },
    "6879.T": {
        "short_name": "IMAGICA GROUP INC",
        "long_name": "IMAGICA GROUP Inc.",
        "summary": "Imagica Group Inc. operates in the film and video related business in Japan. The company's Content Creation segment produces feature films, TV dramas, animations, Web-related visual content, music videos, and advert works for TV commercials and other outlets, as well as provides rights management services. Its Production Services segment offers shooting/editing and sound services for films, TV programs, and TV commercials; and promotion/digital cinema package creation/content distribution and streaming/digital and optical composite/VFX/CGI/scanning/recording/ encoding/image restoration, and other services. This segment also provides human resource consulting services for staffing creative specialists, including digital creators, IT engineers, and production professionals; end-to-end localization solutions for feature films, episodic television series, interactive games, and new media; and dubbing, subtitling, and other media solutions in approximately 80 languages. Its Imaging Systems & Solutions segment develops, manufactures, imports, sells, and maintains equipment and software for image processing LSI. The company was formerly known as Imagica Robot Holdings Inc. and changed its name to Imagica Group Inc. in October 2018. Imagica Group Inc. was founded in 1935 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0011",
        "website": "http://www.imagicagroup.co.jp",
        "market_cap": 21605273600
    },
    "7364.T": {
        "short_name": "RYUKYU ASTEEDA SPO",
        "long_name": "Ryukyu Asteeda Sports Club K.K",
        "summary": "Ryukyu Asteeda Sports Club K.K operates a sports club in Japan. It engages in the management of professional teams participating in the professional table tennis league; and triathlon teams. The company also operates sports bars and table tennis schools; and offers personal gym services. In addition, it operates table tennis mail order site. The company was incorporated in 2018 and is based in Okinawa, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Okinawa",
        "zipcode": "901-2424",
        "website": "http://www.ryukyuasteeda.jp",
        "market_cap": 975449984
    },
    "7860.T": {
        "short_name": "AVEX INC",
        "long_name": "Avex Inc.",
        "summary": "Avex Inc., an entertainment company, engages in music, anime, digital, and other businesses in Japan. The company plans, produces, and sells musical content, including sound sources and images; publishes and distributes music; and plans, produces, and manages live concerts, special events, stage performances/musicals, and various featuring artists. It also manages artists, celebrities, creators, athletes, intellectuals, and others; operates fan clubs; and sells tickets. In addition, the company is involved in building an integrated framework for discovering, fostering, and developing of talent. Further, it plans, produces, and sells animated shows in various forms, merchandising goods, special events, games, and movies; and designs and manages digital platforms dTV and AWA. The company was formerly known as Avex Group Holdings Inc. and changed its name to Avex Inc. in November 2017. Avex Inc. was founded in 1988 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-8577",
        "website": "http://avex.com",
        "market_cap": 62149455872
    },
    "9408.T": {
        "short_name": "BROADCASTING SYSTEM OF NIIGATA",
        "long_name": "Broadcasting System of Niigata Inc.",
        "summary": "Broadcasting System of Niigata Inc. engages in radio and television broadcasting business. It plans, produces, and sells broadcast programs; various events, such as art, music, sports, movies, theater, science, etc.; and plans, publishes, and sells publications. The company was incorporated in 1952 and is headquartered in Niigata, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Niigata",
        "zipcode": "951-8655",
        "website": "http://www.ohbsn.com",
        "market_cap": 7750578688
    },
    "9601.T": {
        "short_name": "SHOCHIKU CO LTD",
        "long_name": "Shochiku Co., Ltd.",
        "summary": "Shochiku Co., Ltd. engages in audio and video, theatre, real estate, and other businesses in Japan and internationally. The company's audio and video division is involved production, publicity, and distribution of live-action, animation, and motion pictures; audio and video rights to domestic and international parties; develops audio and video content; manages theatres and cinema complexes; arrangement of programming at theatres; production and editing of content for satellite and cable channels; basic satellite broadcasting and general broadcasting; and production, purchase, and sales of video content. The company's Theater division plans, produces, and promotes kabuki presentations and general theatre productions on tour and overseas performances; and operates Shochiku theatres. It is also involved in theatrical rights; kabuki related events; the development of theatre-related businesses; and actor and talent promotion business. The company's Real Estate division develops, manages, and leases properties. The Other Business division engages in the editing, production, and sale of motion picture pamphlets; planning, production, and sale of character merchandise; management of mobile and computer shopping websites; distribution of official content for mobile devices; operation of restaurants, parking lots, and other businesses; provision of property management and cleaning services; and development and licensing of music copyrights. The company was formerly known as Shochiku Kinema Co., Ltd. and changed its name to Shochiku Co., Ltd. in 1937. Shochiku Co., Ltd. was founded in 1895 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8422",
        "website": "http://www.shochiku.co.jp",
        "market_cap": 177333043200
    },
    "9602.T": {
        "short_name": "TOHO CO LTD",
        "long_name": "Toho Co., Ltd.",
        "summary": "Toho Co., Ltd. engages in the motion picture, theatrical production, and real estate businesses in Japan. It is involved in producing, buying/selling, and renting movies; producing and selling television programs, movie pamphlets, and video software; and business related to merchandising rights, and other activities. The company also engages in the planning, production, and performance of stage productions; and leasing of land/buildings, and others. Toho Co., Ltd. was founded in 1932 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.toho.co.jp",
        "market_cap": 823157522432
    },
    "9605.T": {
        "short_name": "TOEI CO LTD",
        "long_name": "Toei Company, Ltd.",
        "summary": "Toei Company, Ltd. engages in the production of movies, TV shows, animation, and various other video products in Japan. The company plans, develops, produces, and distributes theatrical movies and events; engages in online shopping business; manages and operates movie theatres and cinema complexes; offers DVDs and Blu-ray discs; and provides video content distribution services. It also offers content to Toei Channel, a CS broadcasting station, as well as various broadcasting media; and grants videogram rights to stations. In addition, the company provides commoditizing rights for toys, apparel, everyday items, food products, stationeries, publications, CDs, DVDs, games, gaming machines, and theme parks. Further, it operates movie studios; undertakes various cultural events; offers real estate leasing services for office buildings and condominiums; owns and operates a golf course; and operates hotels. Toei Company, Ltd. was incorporated in 1949 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0061",
        "website": "http://www.toei.co.jp",
        "market_cap": 268581617664
    },
    "AX8.F": {
        "short_name": "AVEX INC.",
        "long_name": "Avex Inc.",
        "summary": "Avex Inc., an entertainment company, engages in music, anime, digital, and other businesses in Japan. The company plans, produces, and sells musical content, including sound sources and images; publishes and distributes music; and plans, produces, and manages live concerts, special events, stage performances/musicals, and various featuring artists. It also manages artists, celebrities, creators, athletes, intellectuals, and others; operates fan clubs; and sells tickets. In addition, the company is involved in building an integrated framework for discovering, fostering, and developing of talent. Further, it plans, produces, and sells animated shows in various forms, merchandising goods, special events, games, and movies; and designs and manages digital platforms dTV and AWA. The company was formerly known as Avex Group Holdings Inc. and changed its name to Avex Inc. in November 2017. Avex Inc. was founded in 1988 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-8577",
        "website": "http://avex.com",
        "market_cap": 467777216
    },
    "TOE.F": {
        "short_name": "TOEI CO. LTD",
        "long_name": "Toei Company, Ltd.",
        "summary": "Toei Company, Ltd. engages in the production of movies, TV shows, animation, and various other video products in Japan. The company plans, develops, produces, and distributes theatrical movies and events; engages in online shopping business; manages and operates movie theatres and cinema complexes; offers DVDs and Blu-ray discs; and provides video content distribution services. It also offers content to Toei Channel, a CS broadcasting station, as well as various broadcasting media; and grants videogram rights to stations. In addition, the company provides commoditizing rights for toys, apparel, everyday items, food products, stationeries, publications, CDs, DVDs, games, gaming machines, and theme parks. Further, it operates movie studios; undertakes various cultural events; offers real estate leasing services for office buildings and condominiums; owns and operates a golf course; and operates hotels. Toei Company, Ltd. was incorporated in 1949 and is based in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0061",
        "website": "http://www.toei.co.jp",
        "market_cap": 1994013056
    },
    "TOH.F": {
        "short_name": "TOHO CO. LTD",
        "long_name": "Toho Co., Ltd.",
        "summary": "Toho Co., Ltd. engages in the motion picture, theatrical production, and real estate businesses in Japan. It is involved in producing, buying/selling, and renting movies; producing and selling television programs, movie pamphlets, and video software; and business related to merchandising rights, and other activities. The company also engages in the planning, production, and performance of stage productions; and leasing of land/buildings, and others. Toho Co., Ltd. was founded in 1932 and is based in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.toho.co.jp",
        "market_cap": 5739606016
    }
}