{
    "2120.T": {
        "short_name": "LIFULL CO LTD",
        "long_name": "LIFULL Co., Ltd.",
        "summary": "LIFULL Co., Ltd. provides real estate information services in Japan. It offers LIFULL HOME'S, a site of real estate and housing information; LIFULL Rumah, a real estate and housing information website for Indonesia; LIFULL Concierge, a real estate agency service for Japanese employees re-assigned to Jakarta; Trovit, an aggregation website; and Mitula, a site that provides information in real estate and housing, used cars, recruitment, and fashion. The company also offers LIFULL Move that provides reviews and rankings of the moving companies; LIFULL Storage, a storage space searching web service; LIFULL Nursing Care, a special care facility searching web service; and LIFULL Revitalize Rural Japan that suggest new lifestyles to people in Japan based on refurbishment of abandoned houses. In addition, it offers LIFULL FaM that enables working mothers balance childcare with work while pursuing a career; and LIFULL rental spaces, a site for rental spaces and meeting rooms, event venues, and other rental facilities. Further, the company provides LIFULL FLOWER, an online flower gift shop; LIFULL Investment, a money funding website; LIFULL HUB, a shared office; LIFULL Table, a mixed-style deli restaurant; and LIFULL Marketing Partners that offers full Web assistance for real estate related companies. Additionally, it provides LivingAnywhere Commons, a community to live; instant house products. The company was formerly known as NEXT Co., Ltd. and changed its name to LIFULL Co., Ltd.in April 2017. LIFULL Co., Ltd. was founded in 1997 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0083",
        "website": "http://www.lifull.com",
        "market_cap": "Small Cap"
    },
    "2440.T": {
        "short_name": "GURUNAVI INC",
        "long_name": "Gurunavi, Inc.",
        "summary": "Gurunavi, Inc., together with its subsidiaries, provides Web-based information services related to restaurants through PC and smartphones in Japan. The company also offers Internet-based PR and marketing support services to restaurants in China. In addition, it provides food-related research and information services; administrative outsourcing and welfare services; and support services related to the management of restaurants. The company was incorporated in 1989 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0006",
        "website": "http://www.gnavi.co.jp",
        "market_cap": "Micro Cap"
    },
    "2454.T": {
        "short_name": "ALL ABOUT INC",
        "long_name": "All About, Inc.",
        "summary": "All About, Inc. engages in the Internet advertising business. It is also involved in the portal site operation, sampling, and learning business. In addition, the company engages in the operation of Facebook navi, a social media related business; citrus, a decentralized media platform; Tsui Navi, a Twitter navigation site; and DL market, a platform for buying and selling digital contents. The company was founded in 2000 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0013",
        "website": "http://www.allabout.co.jp",
        "market_cap": "Micro Cap"
    },
    "2477.T": {
        "short_name": "TEMAIRAZU INC",
        "long_name": "Temairazu, Inc.",
        "summary": "Temairazu, Inc. develops and operates comparison and reservation sites. It operates TEMAIRAZU and comparison.com. The company was formerly known as Hikaku.com Corporation and changed its name to Temairazu, Inc. in October 2017. Temairazu, Inc. was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0013",
        "website": "http://www.hikaku.com",
        "market_cap": "Small Cap"
    },
    "2489.T": {
        "short_name": "ADWAYS INC",
        "long_name": "Adways Inc.",
        "summary": "Adways Inc. provides affiliate advertisement services for PC and mobiles, and mobile application and content development services in Japan, China, Taiwan, the Philippines, and the United States. The company offers Unicorn, a marketing platform for mobile apps; AppDriver, a CPI based mobile ad platform; STROBELIGHTS, an performance ad management platform; Oct-pass, a native ad platform for smart phones; Smart-C, a Web affiliate service for feature phone and smartphone; JANet, a Web affiliate service for PCs and smartphones; and YACLE, a supporting service for advertisement expressions. It also provides Dobel, a video advertisement service; MASSIVE, a service that realizes automated mass production of banners; CHANet, an affiliate ad service for PC and smart phones; Keynet, a keyword ad service for Chinese web search engines; Blue Bee Box, a DSP trading desk tool. Blue Bee Native, a CPM based native ad network; adna, an ad analytics tool for PC, feature phone, and smart phone websites; and Rewardplus, a reward ad service for PC and mobile. In addition, the company offers Yoyaku Top10, a pre-registration platform for smart phone apps; SPOT, an online media that delivers going out and sightseeing information based on writers' experiences and interviews; and Leyifan, an international shipping agent service for overseas e-commerce users. Adways Inc. was founded in 2001 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-6138",
        "website": "http://www.adways.net",
        "market_cap": "Micro Cap"
    },
    "3624.T": {
        "short_name": "AXEL MARK INC",
        "long_name": "Axel Mark Inc.",
        "summary": "Axel Mark Inc. engages in the planning and development of games in Japan. It develops console games and related content; and provides advertising services. The company was incorporated in 1994 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "164-0012",
        "website": "http://www.axelmark.co.jp",
        "market_cap": "Nano Cap"
    },
    "3646.T": {
        "short_name": "EKITAN & CO LTD",
        "long_name": "Ekitan & Co., Ltd.",
        "summary": "Ekitan & Co., Ltd. provides information services using the internet in Japan. The company's consumer business provides business services through various devices, such as PCs, tablets, smartphones, phone sites, and Android and iOS applications; and mobile phone carrier collaboration services, as well as engages in the travel and advertising businesses. Its corporate business is involved in the transfer guidance ASP/data license business that include transfer search and property search services; and contract development, business solution, inbound, and healthcare businesses. The company operates web site and application under the ekitan name. It also plans, designs, develops, produces, and sells software, homepages, etc.; and provides information survey, processing, and consulting services. Ekitan & Co., Ltd. was founded in 1997 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0083",
        "website": "http://www.ekitan.co.jp",
        "market_cap": "Nano Cap"
    },
    "3662.T": {
        "short_name": "ATEAM INC",
        "long_name": "Ateam Inc.",
        "summary": "Ateam Inc. engages in the entertainment, lifestyle support, and e-commerce businesses worldwide. Its Entertainment Business segment plans, develops, and operates games and tool applications for smartphones and tablets. The company's E-Commerce Business segment plans, develops, and operates a bicycle mail order site. Its Lifestyle Support Business segment plans, develops, and operates web services, such as life events, comparison sites closely related to daily life, and information sites. Ateam Inc. was founded in 1997 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "450-6432",
        "website": "http://www.a-tm.co.jp",
        "market_cap": "Micro Cap"
    },
    "3674.T": {
        "short_name": "AUCFAN CO LIMITED",
        "long_name": "Aucfan Co., Ltd.",
        "summary": "Aucfan Co., Ltd. operates aucfan.com, a site for shopping and auction statistical price comparison in Japan. The company allows users to compare, search, and analyze auction, and shopping product and price information, as well as to see the prices and number of previous transactions. It serves corporate clients, sole proprietors, and individuals. The company was founded in 2007 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0021",
        "website": "http://www.aucfan.co.jp",
        "market_cap": "Micro Cap"
    },
    "3679.T": {
        "short_name": "ZIGEXN CO LTD",
        "long_name": "ZIGExN Co., Ltd.",
        "summary": "ZIGExN Co., Ltd. operates the life media platform in Japan. It operates Job change EX, a job change and job information site; Dispatch EX, a Website covering job information and dispatch company information of staffing sites and dispatching companies; Part-timer EX, a part time job search service site; d job, a job recruitment information and smartphone work recruitment service; Nurse Job EX, a nurse recruitment/career change site; and Pharmacist Job EX, a pharmacist recruitment information search site. The company also offers Rental Smocca, a search site for real estate rental housing listings; Maisumi EX, a site specialized in real estate sale, land utilization, and rental management; and Moving estimate EX, a site that offers moving estimates. In addition, it provides SmaRE, a marketing support tool for the purchase and sale of real estate properties; Minorino, a used condominium sales portal site specializing in renovation; and Provider EX, a comparison site that helps in selecting high-speed mobile communication. Further, the company offers used car EX, an used car information site; Car purchase EX, a comparison site for car purchase; Car-tana, a used car export portal site; Apple world, a portal for hotel booking; Hotelista, a hotel reservation Website; Travery, a comparison site for hotel reservations; and tradecarview, a used car export site. In addition it offers Puronuri, a service that allows to collect information and compare estimates for exterior wall painting; Exterior wall painting concierge is a free matching service; Enepi a price comparison service; Guriene, a service that supports the smart and profitable introduction of solar power generation; Hotelista, a hotel reservation site; Traveler, a comparison / reservation site for low-cost flights and LCCs; Nursery rhyme, a baby sitter service; and franchise, marriage, tutor, and study abroad comparison sites. ZIGExN Co., Ltd. was founded in 2006 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.zigexn.co.jp",
        "market_cap": "Small Cap"
    },
    "3688.T": {
        "short_name": "CARTA HOLDINGS INC",
        "long_name": "Carta Holdings, Inc.",
        "summary": "Carta Holdings, Inc. provides online advertising services in Japan and internationally. It operates through three segments: Partner Sales Business, Ad Platform Business, and Consumer Business. The Partner Sales Business segment offers advertising space and solutions through a media rep. The Ad Platform Business segment operates fluct, an SSP; PORTO, an ad platform for brand advertising; and TELECY, an operational TV commercial platform, as well as ad distribution platforms under the Zucks and BEYOND X names. This segment is also involved in the social media influencer marketing business. The Consumer Business segment owns media under the EC Navi and PeX names; and provides HR and EC related services. The company was founded in 1996 and is based in Tokyo, Japan. Carta Holdings, Inc. is a subsidiary of Dentsu Group Inc.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0043",
        "website": "http://cartaholdings.co.jp",
        "market_cap": "Small Cap"
    },
    "3691.T": {
        "short_name": "REALWORLD INC",
        "long_name": "REALWORLD, inc.",
        "summary": "REALWORLD, inc. engages in cloud and point exchange businesses in Japan. It offers cloud service that provide means to earn various points through the Internet; crowd sourcing service where pints are accumulated by work, such as writing text and data entry; and cloud media service where points are accumulated in the request of documents and online shopping. The company also offers exchange services for points with cash, electronic money, gift certificates, etc. to members in the cloud business. REALWORLD, inc. was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "151-0062",
        "website": "http://realworld.co.jp",
        "market_cap": "Nano Cap"
    },
    "3770.T": {
        "short_name": "ZAPPALLAS INC",
        "long_name": "Zappallas, Inc.",
        "summary": "Zappallas, Inc. engages in the planning, development, and management of fortune-telling services for mobiles and PCs. The company operates through Mobile Services, Overseas, and Other segments. It is also involved in the planning, development, management, and event management of fortune-telling content focusing on video distribution service. In addition, Zappallas, Inc. engages in the telephone fortune-telling and management of media sites; online fortune-telling; travel business which include production of adult trips; and e-commerce business that offers baby supplies and kids equipment through mail order. The company was formerly known as Cyber-Biz Inc. and changed its name to Zappallas, Inc. in April 2001. Zappallas, Inc. was founded in 2000 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.zappallas.com",
        "market_cap": "Micro Cap"
    },
    "3815.T": {
        "short_name": "MEDIA KOBO INC",
        "long_name": "Media Kobo, Inc.",
        "summary": "Media Kobo, Inc. provides digital content in Japan and internationally. It offers fortune-telling content; contents that utilize virtual reality, augmented reality, and mixed reality; and hardware and software products, as well as operates a Website that provides contents and columns to female. The company also plans, develops, and manages mobile social and iPhones/Android applications; designs Web applications; and publishes game applications. In addition, it is involved in the cross-border medical/EC and one to one marketing businesses. The company was founded in 1997 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0052",
        "website": "http://www.mkb.ne.jp",
        "market_cap": "Nano Cap"
    },
    "3843.T": {
        "short_name": "FREEBIT CO.LTD",
        "long_name": "FreeBit Co., Ltd.",
        "summary": "FreeBit Co., Ltd. operates as an Internet business support company. The company provides network infrastructure services and information-communication services to corporations and consumers. It also offers multiple dwelling houses with network infrastructure services, home Internet of Things solutions, and real estate-related services, such as real estate brokerage, etc.; and Internet-based advertising services and affiliate advertising services. In addition, the company provides dispensing pharmacies and nursing care facilities with IT solutions, as well as medication notebook application and dispensing pharmacy reservation services; and language education solutions, such as language training, books and e-learning system, etc. to corporations, consumers, and educational institutions. The company was formerly known as FreeBit.com Co., Ltd. and changed its name to FreeBit Co., Ltd. in December 2002. FreeBit Co., Ltd. was founded in 2000 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0044",
        "website": "http://freebit.com",
        "market_cap": "Micro Cap"
    },
    "3901.T": {
        "short_name": "MARKLINES CO LTD",
        "long_name": "MarkLines Co., Ltd.",
        "summary": "MarkLines Co., Ltd. operates an automotive industry portal in Japan. Its information platform offers online information services, including information about suppliers, such as who supplies whom, plant data, and market trends; sales and production statistics; reports on technology and market trends; and model plan data comprising forecasts and others in Japanese, Chinese, and English. The company also provides B2B promotional support and advertisement services that include promotional emails and banner ads under the LINES name to its information platform members. It serves OEMs, parts suppliers, material suppliers, machinery and equipment, solution vendors, transportation companies, trading companies, consultation firms, financial institutions, government, labor unions, universities, and construction companies. The company was founded in 2001 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-6114",
        "website": "http://www.marklines.com",
        "market_cap": "Small Cap"
    },
    "3926.T": {
        "short_name": "OPEN DOOR INC",
        "long_name": "OpenDoor Inc.",
        "summary": "OpenDoor Inc. provides Web services through the Internet in Japan. The company operates Travelko, a travel comparison site; TRAVELKO, a multi-language travel comparison site; and GALLERY JAPAN, a Japanese traditional art crafts site. It is also involved in the development and provision of online systems for the Internet and mobile phones; and planning and operation of software development and content delivery. OpenDoor Inc. was founded in 1997 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0052",
        "website": "http://www.opendoor.co.jp",
        "market_cap": "Small Cap"
    },
    "3930.T": {
        "short_name": "HATENA CO LTD",
        "long_name": "Hatena Co., Ltd.",
        "summary": "Hatena Co., Ltd. engages in the internet-related business in Japan. The company offers content platform and marketing services; and technology solutions service, such as big data, and contract and collaborative services. It also acts as a telecommunications operator. The company was founded in 2001 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "604-0835",
        "website": "http://hatenacorp.jp",
        "market_cap": "Nano Cap"
    },
    "3961.T": {
        "short_name": "SILVER EGG TECHNOLOGY CO LTD",
        "long_name": "Silver Egg Technology Co., Ltd.",
        "summary": "Silver Egg Technology Co., Ltd. develops and provides artificial intelligence (AI) based Web marketing services and technology for analyzing big data in real time in Japan. It offers Aigent Recommender, which provides performance-based recommendation services; Aigent Recogazo, a real-time recommendation mail service; HotView that offers recommendation advertising services; and Prospector, which provides marketing strategies. The company was founded in 1998 and is headquartered in Suita, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Suita",
        "zipcode": "564-0063",
        "website": "http://www.silveregg.co.jp",
        "market_cap": "Nano Cap"
    },
    "3981.T": {
        "short_name": "BEAGLEE INC",
        "long_name": "Beaglee Inc.",
        "summary": "Beaglee Inc. engages in the content platform business. It operates through Platform and Contents segments. The Platform segment provides subscription and other ancillary businesses centered on Manga Kingdom. The Contents segment offers e-books, publishing, and other ancillary services. The company is involved in the e-book business, which include comics distribution, as well as offers e-novels. It also broadcasts radio programs; and distributes smartphone games. The company was founded in 2004 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0061",
        "website": "http://www.beaglee.com",
        "market_cap": "Micro Cap"
    },
    "3985.T": {
        "short_name": "TEMONA INC",
        "long_name": "TEMONA.inc.",
        "summary": "TEMONA.inc. provides mail order support services in Japan. It operates Egg repeat, a mail order integration Web system with shopping cart; Hikiaguer, a marketing tool for individual customer service; and URARA, a beauty and health magazine for adult women. The company also plans, designs, develops, manages, sells, and rents software; plans, sells, and mediates media information of advertisement and publicity using Internet; and provides information and content services on Internet, as well as plans and operates shopping malls. In addition, it offers supplementary services through e-commerce, sales, and mediation. Further, the company provides production and maintenance of management work. Additionally, it is involved in consulting and related business services. The company was founded in 2008 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0002",
        "website": "http://temona.co.jp",
        "market_cap": "Micro Cap"
    },
    "3989.T": {
        "short_name": "SHARINGTECHNOLOGY INC",
        "long_name": "Sharingtechnology, Inc.",
        "summary": "Sharingtechnology, Inc. operates platforms for solving problems in daily life in Japan. The company operates Life 110, a platform that enables users to search, compare, and inquire about the most suitable specialists for users from approximately 150 service genres related to daily life in order to solve problems that occur in your daily life. It also operates a vertical media site to deliver useful information to users who are interested in a specific theme, which include 250 sites that solve daily problems that occur, such as Pet Funeral 110 and Replacement 110; mochiya, a platform to select and reserve living services by word of mouth; and Information media that disseminate information in easy-to-understand and easy-to-understand expressions in areas, such as finance and job changes. The company was founded in 2006 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "450-6319",
        "website": "http://www.sharing-tech.jp",
        "market_cap": "Nano Cap"
    },
    "3990.T": {
        "short_name": "UUUM CO LTD",
        "long_name": "UUUM co.,ltd.",
        "summary": "UUUM Co.,Ltd. operates as an online creator network in Japan. The company provides services that are focused on creating content in various medium, including development of promotion plans, media planning services, and video marketing consulting. It also provides content creation services; jointly operates the BonBonTV channel; develops games; and sells original merchandise, as well as holds offline events featuring appearances by UUUM creators. The company was founded in 2013 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-6137",
        "website": "http://www.uuum.jp",
        "market_cap": "Micro Cap"
    },
    "3995.T": {
        "short_name": "SKIYAKI INC",
        "long_name": "SKIYAKI Inc.",
        "summary": "SKIYAKI Inc. engages in the platform, concert event production, and travel businesses in Japan. It offers Bitfan Pro, a platform that allows updating the functions for developing official site, fan club/fan site, EC site, and ticket pre-sale from a single management screen; QR code authentication and official secondary distribution services; and SKIYAKI GOODS for design purchase/creating original goods, and design sales. It is also involved in the provision of travel packages, fan club tour, and live event participation tour, as well as fan meeting and other event services. The company was founded in 2003 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0043",
        "website": "http://skiyaki.com",
        "market_cap": "Nano Cap"
    },
    "4057.T": {
        "short_name": "INTERFACTORY INC",
        "long_name": "Interfactory, Inc.",
        "summary": "Interfactory, Inc. provides cloud solutions. It offers ebisumart, a cloud e-commerce platform. The company was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0071",
        "website": "http://www.interfactory.co.jp",
        "market_cap": "Micro Cap"
    },
    "4059.T": {
        "short_name": "MAGMAG INC",
        "long_name": "Magmag, Inc.",
        "summary": "Magmag Inc. engages in the development and operation of content distribution platform in Japan. It is also involved in the planning, development, and operation of Internet media. The company was founded in 1997 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0031",
        "website": "http://www.mag2.co.jp",
        "market_cap": "Nano Cap"
    },
    "4176.T": {
        "short_name": "COCONALA INC",
        "long_name": "coconala Inc.",
        "summary": "coconala Inc. operates a platform to buy and sell knowledge, skills, and experience in production, business support, and consultation categories. It also operates coconala Legal Consultation website, a search media to find a lawyer for individual needs; and coconala Meets, an online market that matches customers with local professionals. The company was founded in 2012 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0031",
        "website": "http://coconala.co.jp/",
        "market_cap": "Small Cap"
    },
    "4194.T": {
        "short_name": "VISIONAL INC",
        "long_name": "Visional, Inc.",
        "summary": "Visional, Inc. operates a membership-based career change platform to find professional human resources. The company was founded in 2020 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0002",
        "website": "http://www.visional.inc",
        "market_cap": "Small Cap"
    },
    "4295.T": {
        "short_name": "FAITH INC",
        "long_name": "Faith, Inc.",
        "summary": "Faith, Inc. engages in creating and building contents distribution systems in Japan. The company provides contents for mobile devices, PC, game equipment, TV, car navigation system, and network audio system, etc. It offers Fans, a platform integrating a full range of music business functions; ecommerce and mail order platform; and sound source and ringtone melody platform. The company also provides ringtone melody and karaoke data and entertainment-type musical composition production, as well as, copyright processing business. In addition, it also develops content distribution, such as GIGA, that provides music and entertainment distribution; VIDEO Clipper, a platform that broadcast live music performance; JOYSOUND, operates mobile entertainment business; Rightsscale, a music distribution service; and Music Reminiscence, IOS application for music and brain mechanism. Further it, provides OKMusic, a social music medium; BARKS, that delivers music, artist videos, images, interviews, and live reports; Pop'n'Roll, that focuses on idol media and hidden talents; Fans' and Fans' Music, a fan club services and support servies; and with9, offer recruitment social media service. Additionally, it offers music software planning, artist management, advertising, and sale and publication management services under the Nippon Columbia, Dreamusic, KSR, Flying Penguins, and Future SEVEN Studios brans. It also offers services that support store operations through commercial BGM and point services under Goody Point, FaRao PRO, and SHOP brands; and develops music-related businesses such as live house management under the Future SEVEN, PLUSTOKYO, and and CROKET MIMIC TOKYO brands. Faith, Inc. was founded in 1992 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "604-8171",
        "website": "http://www.faith-inc.com",
        "market_cap": "Micro Cap"
    },
    "4298.T": {
        "short_name": "PROTO CORPORATION",
        "long_name": "Proto Corporation",
        "summary": "Proto Corporation provides automobile-related information services on new and used cars, parts and supplies. The company was founded in 1977 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "460-0006",
        "website": "http://www.proto-g.co.jp",
        "market_cap": "Small Cap"
    },
    "4436.T": {
        "short_name": "MINKABU THE INFONOID INC",
        "long_name": "MINKABU THE INFONOID, Inc.",
        "summary": "MINKABU THE INFONOID, Inc. provides financial information services in Japan and internationally. It offers stock information distribution services; and commodity futures information services. The company also provides services, including system development services, such as planning, design, development, operation support, etc., as well as development of financial information media. MINKABU THE INFONOID, Inc. was founded in 2006 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0051",
        "website": "http://www.minkabu.co.jp",
        "market_cap": "Small Cap"
    },
    "4482.T": {
        "short_name": "WILLS INC",
        "long_name": "WILLs Inc.",
        "summary": "WILLs Inc. develops and offers a shareholder management platform using blockchain technology in Japan and internationally. The company develops and offers Premium Special Club, a platform that allows listed companies to exchange shareholder special points and products, and exercise electronic voting rights through WILLsVote; and Premium Special Club PORTAL, a portal site that allows the exchange of approximately 3,000 reward products by exchanging the shareholder reward points issued by each listed company with WILLsCoin. It also provides IR-navi, an institutional investor marketing platform that connects listed companies, institutional investors, and individual investors on the cloud to acquire and exchange information interactively. In addition, it plans and develops communication tools to investors, such as integrated reports and annual reports. The company was founded in 2004 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0001",
        "website": "http://www.wills-net.co.jp",
        "market_cap": "Micro Cap"
    },
    "4497.T": {
        "short_name": "LOCOGUIDE INC",
        "long_name": "Locoguide Inc.",
        "summary": "Locoguide Inc. provides flyer and shopping information services in Japan. It operates Tokubai, a flyer and shopping information site that connects local consumers with local retail stores; and Lokonavi, an information site. The company was founded in 2016 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0073",
        "website": "http://locoguide.co.jp",
        "market_cap": "Micro Cap"
    },
    "4644.T": {
        "short_name": "IMAGINEER CO LTD",
        "long_name": "Imagineer Co.,Ltd.",
        "summary": "Imagineer Co.,Ltd. engages in the content business in Japan and internationally. It is involved in the provision of content through characters, education, games, etc.; and product planning and sales promotion activities. The company was founded in 1977 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-0715",
        "website": "http://www.imagineer.co.jp",
        "market_cap": "Micro Cap"
    },
    "4800.T": {
        "short_name": "ORICON INC",
        "long_name": "Oricon Inc.",
        "summary": "Oricon Inc. engages in the design and operation of Websites. The company also offers news distribution services; music/book distribution services for smartphones and PCs; and content distribution service for feature phones. In addition, it publishes Confidence, a business magazine for the entertainment industry; provides marketing data and ranking information for music, video, and books; and offers music database for broadcasting stations and EC sites. The company was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-0032",
        "website": "http://www.oricon.jp",
        "market_cap": "Micro Cap"
    },
    "6032.T": {
        "short_name": "INTERWORKS INC",
        "long_name": "Interworks, Inc.",
        "summary": "Interworks, Inc. plans, develops, and manages human resources business industry recruitment sites in Japan. It also provides Internet advertising agency services for human resources business industry; and plans, develops, and manages other Websites. In addition, the company engages in the planning, development, and sale of human resources business industry staff management systems; and sale of skill check diagnostic tools. Further, it offers support services for career change in IT, manufacturing, and financial industries. The company was founded in 1991 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0003",
        "website": "http://interworks.jp",
        "market_cap": "Nano Cap"
    },
    "6037.T": {
        "short_name": "FIRSTLOGIC INC",
        "long_name": "Firstlogic,Inc.",
        "summary": "Firstlogic,Inc. operates a real estate investment portal site in Japan. The company was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0006",
        "website": "http://www.firstlogic.co.jp",
        "market_cap": "Micro Cap"
    },
    "6046.T": {
        "short_name": "LINKBAL INC",
        "long_name": "Linkbal Inc.",
        "summary": "Linkbal Inc. operates event e-commerce and experiential consumption platforms in Japan. It also operates CoupLink, an online dating app; Pairy, an app for couples; KOIGAKU, a dating information media platform; iVERY, a marriage and dating information media platform; Jinji talk, a matchmaking app for students and HR; and Mamakon, a maternity wedding consultation counter. The company was founded in 2011 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0042",
        "website": "http://www.linkbal.co.jp",
        "market_cap": "Micro Cap"
    },
    "6048.T": {
        "short_name": "DESIGNONE JAPAN INC",
        "long_name": "DesignOne Japan, Inc.",
        "summary": "DesignOne Japan, Inc. engages in Internet media business in Japan. The company operates Ekiten local information word-of-mouth sites. Its Ekiten site allows users to search various kinds of shops, such as massages, spas, beauty salons, dentists, pawn shops, schools, and others. The company was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0023",
        "website": "http://www.designone.jp",
        "market_cap": "Nano Cap"
    },
    "6049.T": {
        "short_name": "ITOKURO INC",
        "long_name": "ItoKuro Inc.",
        "summary": "ItoKuro Inc. provides media and consulting services in Japan. It operates school information portal sites for infants, elementary school students, junior high school students, high school students, and parents to search and compare educational cram schools and preparatory schools; and for nurseries, kindergartens, elementary schools, junior high schools, high schools, vocational schools, and universities. The company also operates tutor comparison net, medical school examination manual, and medical school preparatory school guide sites. In addition, it provides consulting services in marketing to clients in the education industry. ItoKuro Inc. was founded in 2006 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0052",
        "website": "http://www.itokuro.jp",
        "market_cap": "Micro Cap"
    },
    "6054.T": {
        "short_name": "LIVESENSE INC",
        "long_name": "Livesense Inc.",
        "summary": "Livesense Inc. engages in the Internet media business in Japan. The company operates various human resource domains, such as Tenshoku Kaigi to bring transparency to company information and enhance the accuracy of matching with reviews; Tenshoku Draft to provide competitive bidding-type career service; and Machbaito and Tenshoku Navi that offers job information. It also operates various real estate domains. Livesense Inc. was founded in 2006 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0021",
        "website": "http://www.livesense.co.jp",
        "market_cap": "Micro Cap"
    },
    "6081.T": {
        "short_name": "ALLIED ARCHITECTS INC",
        "long_name": "Allied Architects, Inc.",
        "summary": "Allied Architects, Inc. provides social media marketing services in Asia. The company provides SaaS-type products; Letro and Lertro Studio, a video production tool service; Monipla, a platform for marketing; echoes, a service for instant win campaigns; brandtouch, a fan marketing cloud; and Social-IN, a hashtag curation tool, as well as solutions for SNS advertising and account operations; Web promotions; and fan marketing solutionss. Allied Architects, Inc.was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0013",
        "website": "http://www.aainc.co.jp",
        "market_cap": "Micro Cap"
    },
    "6562.T": {
        "short_name": "GENIEE INC",
        "long_name": "Geniee, Inc.",
        "summary": "Geniee, Inc. engages in the Internet advertisement technology business in Japan and internationally. It provides Geniee SSP, a platform that compares various deals, such as pure ads, real time bids from demand side platforms and ad exchanges, and ads from multiple ad networks and affiliate ads, as well as serves ads that enhance the revenue for online publishersl; Geniee Trading Desk, an integrated operation service for display ads; DMP, a data platform that stores and analyzes data from ads, marketing, media, and users; and Data Exchange that enables the delivery of online ads and email ads using membership data and various types of medium audience data. The company also offers direct bidding tool for advertising agencies; GenieeDMP tool for advertising; GAURL, a technology that enables stable management of AdSense accounts and revenue maximization; and MAJIN, a marketing automation platform. In addition, it provides Demand Side Platform that allows advertisers and advertising agencies to buy advertising inventory, serve advertisements, and target the display destination and audience. Geniee, Inc. was founded in 2010 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-6006",
        "website": "http://www.geniee.co.jp",
        "market_cap": "Micro Cap"
    },
    "6579.T": {
        "short_name": "LOGLY INC",
        "long_name": "logly,Inc.",
        "summary": "logly, Inc. operates as a technology company in Japan. The company operates logly lift, an advertising service platform that delivers corporate content to users through media and brand recognition, and product needs; Loyalfarm, an audience training tool to analyze action and engagement of readers who visited the site and to repeat them; and Zenback, a widget to collect information about articles from various parts of the net. It primarily serves advertisers and distributors. The company was founded in 2006 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0043",
        "website": "http://corp.logly.co.jp",
        "market_cap": "Nano Cap"
    },
    "7077.T": {
        "short_name": "ALINK INTERNET INC",
        "long_name": "ALiNK Internet, Inc.",
        "summary": "ALiNK Internet, Inc. plans, develops, and manages Internet media. It offers Tenki.jp, an application that shows current weather, temperature, and rain clouds information. The company also provides information, such as weather explanations by weather forecasters, as well as earthquake and typhoon information. In addition, it offers Internet consulting and advertising agency services. The company was founded in 2013 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "162 0801",
        "website": "http://www.alink.ne.jp",
        "market_cap": "Nano Cap"
    },
    "7082.T": {
        "short_name": "JIMOTY INC",
        "long_name": "Jimoty, Inc.",
        "summary": "Jimoty, Inc. engages in the planning, development, and operation of classified site in Japan. It operates Jimoti, a local information bulletin board. The company was founded in 2011 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://jmty.co.jp",
        "market_cap": "Micro Cap"
    },
    "7356.T": {
        "short_name": "RETTY INC",
        "long_name": "Retty Inc.",
        "summary": "Retty Inc. operates gourmet platform. It operates Retty, a platform that provides information on restaurants in Japan. The company was founded in 2010 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0073",
        "website": "http://retty.me",
        "market_cap": "Micro Cap"
    },
    "88A.F": {
        "short_name": "ATEAM INC.",
        "long_name": "Ateam Inc.",
        "summary": "Ateam Inc. engages in the entertainment, lifestyle support, and e-commerce businesses worldwide. Its Entertainment Business segment plans, develops, and operates games and tool applications for smartphones and tablets. The company's E-Commerce Business segment plans, develops, and operates a bicycle mail order site. Its Lifestyle Support Business segment plans, develops, and operates web services, such as life events, comparison sites closely related to daily life, and information sites. Ateam Inc. was founded in 1997 and is headquartered in Nagoya, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "450-6432",
        "website": "http://www.a-tm.co.jp",
        "market_cap": "Micro Cap"
    },
    "9467.T": {
        "short_name": "ALPHAPOLIS CO LTD",
        "long_name": "AlphaPolis Co., Ltd.",
        "summary": "AlphaPolis Co., Ltd. engages in Internet site management and books publishing businesses in Japan. The company publishes light novels, cartoons, and paperbacks, as well as other books comprising general novels and translation publications of overseas books. It also operates Alphapolis, a platform for viewing content, such as novels. AlphaPolis Co., Ltd. was founded in 2000 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-6005",
        "website": "http://www.alphapolis.co.jp",
        "market_cap": "Micro Cap"
    },
    "A02.F": {
        "short_name": "ADWAYS INC.",
        "long_name": "Adways Inc.",
        "summary": "Adways Inc. provides affiliate advertisement services for PC and mobiles, and mobile application and content development services in Japan, China, Taiwan, the Philippines, and the United States. The company offers Unicorn, a marketing platform for mobile apps; AppDriver, a CPI based mobile ad platform; STROBELIGHTS, an performance ad management platform; Oct-pass, a native ad platform for smart phones; Smart-C, a Web affiliate service for feature phone and smartphone; JANet, a Web affiliate service for PCs and smartphones; and YACLE, a supporting service for advertisement expressions. It also provides Dobel, a video advertisement service; MASSIVE, a service that realizes automated mass production of banners; CHANet, an affiliate ad service for PC and smart phones; Keynet, a keyword ad service for Chinese web search engines; Blue Bee Box, a DSP trading desk tool. Blue Bee Native, a CPM based native ad network; adna, an ad analytics tool for PC, feature phone, and smart phone websites; and Rewardplus, a reward ad service for PC and mobile. In addition, the company offers Yoyaku Top10, a pre-registration platform for smart phone apps; SPOT, an online media that delivers going out and sightseeing information based on writers' experiences and interviews; and Leyifan, an international shipping agent service for overseas e-commerce users. Adways Inc. was founded in 2001 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-6138",
        "website": "http://www.adways.net",
        "market_cap": "Micro Cap"
    },
    "NXCLF": {
        "short_name": "LIFULL CO LTD",
        "long_name": "LIFULL Co., Ltd.",
        "summary": "LIFULL Co., Ltd. provides real estate information services in Japan. It offers LIFULL HOME'S, a site of real estate and housing information; LIFULL Rumah, a real estate and housing information website for Indonesia; LIFULL Concierge, a real estate agency service for Japanese employees re-assigned to Jakarta; Trovit, an aggregation website; and Mitula, a site that provides information in real estate and housing, used cars, recruitment, and fashion. The company also offers LIFULL Move that provides reviews and rankings of the moving companies; LIFULL Storage, a storage space searching web service; LIFULL Nursing Care, a special care facility searching web service; and LIFULL Revitalize Rural Japan that suggest new lifestyles to people in Japan based on refurbishment of abandoned houses. In addition, it offers LIFULL FaM that enables working mothers balance childcare with work while pursuing a career; and LIFULL rental spaces, a site for rental spaces and meeting rooms, event venues, and other rental facilities. Further, the company provides LIFULL FLOWER, an online flower gift shop; LIFULL Investment, a money funding website; LIFULL HUB, a shared office; LIFULL Table, a mixed-style deli restaurant; and LIFULL Marketing Partners that offers full Web assistance for real estate related companies. Additionally, it provides LivingAnywhere Commons, a community to live; instant house products. The company was formerly known as NEXT Co., Ltd. and changed its name to LIFULL Co., Ltd.in April 2017. LIFULL Co., Ltd. was founded in 1997 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0083",
        "website": "http://www.lifull.com",
        "market_cap": "Small Cap"
    },
    "OPNDF": {
        "short_name": "OPEN DOOR INC",
        "long_name": "OpenDoor Inc.",
        "summary": "OpenDoor Inc. provides Web services through the Internet in Japan. The company operates Travelko, a travel comparison site; TRAVELKO, a multi-language travel comparison site; and GALLERY JAPAN, a Japanese traditional art crafts site. It is also involved in the development and provision of online systems for the Internet and mobile phones; and planning and operation of software development and content delivery. OpenDoor Inc. was founded in 1997 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0052",
        "website": "http://www.opendoor.co.jp",
        "market_cap": "Small Cap"
    },
    "OR7.F": {
        "short_name": "ORICON INC.",
        "long_name": "Oricon Inc.",
        "summary": "Oricon Inc. engages in the design and operation of Websites. The company also offers news distribution services; music/book distribution services for smartphones and PCs; and content distribution service for feature phones. In addition, it publishes Confidence, a business magazine for the entertainment industry; provides marketing data and ranking information for music, video, and books; and offers music database for broadcasting stations and EC sites. The company was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "106-0032",
        "website": "http://www.oricon.jp",
        "market_cap": "Micro Cap"
    },
    "ZGE.F": {
        "short_name": "ZIGEXN CO.LTD.",
        "long_name": "ZIGExN Co., Ltd.",
        "summary": "ZIGExN Co., Ltd. operates the life media platform in Japan. It operates Job change EX, a job change and job information site; Dispatch EX, a Website covering job information and dispatch company information of staffing sites and dispatching companies; Part-timer EX, a part time job search service site; d job, a job recruitment information and smartphone work recruitment service; Nurse Job EX, a nurse recruitment/career change site; and Pharmacist Job EX, a pharmacist recruitment information search site. The company also offers Rental Smocca, a search site for real estate rental housing listings; Maisumi EX, a site specialized in real estate sale, land utilization, and rental management; and Moving estimate EX, a site that offers moving estimates. In addition, it provides SmaRE, a marketing support tool for the purchase and sale of real estate properties; Minorino, a used condominium sales portal site specializing in renovation; and Provider EX, a comparison site that helps in selecting high-speed mobile communication. Further, the company offers used car EX, an used car information site; Car purchase EX, a comparison site for car purchase; Car-tana, a used car export portal site; Apple world, a portal for hotel booking; Hotelista, a hotel reservation Website; Travery, a comparison site for hotel reservations; and tradecarview, a used car export site. In addition it offers Puronuri, a service that allows to collect information and compare estimates for exterior wall painting; Exterior wall painting concierge is a free matching service; Enepi a price comparison service; Guriene, a service that supports the smart and profitable introduction of solar power generation; Hotelista, a hotel reservation site; Traveler, a comparison / reservation site for low-cost flights and LCCs; Nursery rhyme, a baby sitter service; and franchise, marriage, tutor, and study abroad comparison sites. ZIGExN Co., Ltd. was founded in 2006 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.zigexn.co.jp",
        "market_cap": "Small Cap"
    }
}