{
    "000300.KS": {
        "short_name": "DAYOUPLUS",
        "long_name": "Dayou Plus Co.,Ltd",
        "summary": "Dayou Plus Co.,Ltd engages in the automobile parts, information and communication, and home appliance businesses in South Korea and internationally. It produces, sells, and distributes automobile steering and aluminum wheels. The company also offers network solutions and communication equipment, such as FTTx products, switches, and broadcasting and transmission equipment, as well as fiber to the home and RF overlay solutions, CATV systems, IPTV systems, and in-company and monitoring systems. In addition, it engages in the nano-material and solar power generation businesses. Further, the company offers home appliances, including air conditions, refrigerators, electric rice cookers, air purifiers, natural humidifiers, dehumidifiers, car air purifier under the WINIA, The Original Dimchae Kimchi, Alpha Mihak Dichae, and Spowasher names. It also provides operation and construction services for IT systems, as well as IT outsourcing services. The company was formerly known as Dayou Smart Aluminium Co., Ltd. has changed its name to Dayou Plus Co.,Ltd in 2016. The company was founded in 1967 and is headquartered in Gwangju-si, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Gwangju",
        "zipcode": "462-806",
        "website": "http://www.dayouplus.co.kr",
        "market_cap": "Small Cap"
    },
    "000500.KS": {
        "short_name": "GAONCABLE",
        "long_name": "GAON CABLE Co., Ltd.",
        "summary": "GAON CABLE Co., Ltd., a cable company, provides industrial power cables in South Korea. The company offers power cables, including extra-high voltage cables, such as XLPE insulation cables; overhead lines comprising overhead transmission lines, optical fiber composite overhead ground wire, overhead distribution lines, and trolley wires/messenger wires; MV/LV cables consisting of MV/LV power cables, control cables, fire protection cables, and insulated wires; and industrial specialty cables, including marine/offshore cables. It also provides telecom cables, such as local area network (LAN), including LAN cables and components; optical communication products consisting of optical cables and components, and pre-connectorized cables; and other communication cables comprising hybrid cables, CATV cables, CPEV cables, and PVC-insulated telephone jumper wires. In addition, the company offers materials, such as copper rods and oxygen free copper products; intelligent wiring solutions, including aluminum clad flex cables and smart wiring systems; and integral pipeline systems comprising threadless conduits and one-touch joint for water pipes. Its products are used in power network, building/home, plant, railway, port/airport, wind farm, marine/offshore, and broadband communication applications. The company was formerly known as Kukje Electric Wire Co., Ltd. and changed its name to GAON CABLE Co., Ltd. in September 2004. GAON CABLE Co., Ltd. was founded in 1947 and is headquartered in Anyang, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Anyang-Si",
        "zipcode": null,
        "website": "http://www.gaoncable.com",
        "market_cap": "Small Cap"
    },
    "000660.KS": {
        "short_name": "SK hynix",
        "long_name": "SK hynix Inc.",
        "summary": "SK hynix Inc., together with its subsidiaries, engages in the manufacture, distribution, and sale of semiconductor products worldwide. The company offers memory semiconductor products, including DRAM, NAND flash, multi-chip package, etc.; system semiconductors, such as CMOS image sensors, etc.; and enterprise and client solid state drives. It also provides computing, mobile, and graphics memory products. The company was formerly known as Hynix Semiconductor Inc. and changed its name to SK hynix, Inc. in March 2012. SK hynix, Inc. was founded in 1949 and is headquartered in Icheon-si, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Icheon-Si",
        "zipcode": null,
        "website": "http://www.skhynix.com",
        "market_cap": "Large Cap"
    },
    "000990.KS": {
        "short_name": "DB HiTek",
        "long_name": "DB Hitek Co., Ltd.",
        "summary": "DB HiTek Co.,Ltd. operates as an system IC foundry company in South Korea. The company provides comprehensive foundry services; and designs and manufactures system ICs. It offers process technologies nodes ranging from 90nm to 0.35um that enable the production of advanced ICs, such as power management ICs, display driver ICs, audio amplifiers, and sensors, which are deployed in mobile, drone, and medical devices, as well as automotive applications. The company's processing technologies include BCDMOS, analog CMOS, high voltage CMOS, mixed signal, CIS, flash, logic, and non volatile technologies. The company was formerly known as Dongbu HiTek Co., Ltd. and changed its name to DB HiTek Co.,Ltd. in November 2017. DB HiTek Co.,Ltd. was founded in 1997 and is based in Bucheon, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Bucheon-Si",
        "zipcode": null,
        "website": "http://www.dbhitek.com",
        "market_cap": "Small Cap"
    },
    "000995.KS": {
        "short_name": "DB HiTek(1P)",
        "long_name": "DB Hitek Co., Ltd.",
        "summary": "DB HiTek Co.,Ltd. operates as an system IC foundry company in South Korea. The company provides comprehensive foundry services; and designs and manufactures system ICs. It offers process technologies nodes ranging from 90nm to 0.35um that enable the production of advanced ICs, such as power management ICs, display driver ICs, audio amplifiers, and sensors, which are deployed in mobile, drone, and medical devices, as well as automotive applications. The company's processing technologies include BCDMOS, analog CMOS, high voltage CMOS, mixed signal, CIS, flash, logic, and non volatile technologies. The company was formerly known as Dongbu HiTek Co., Ltd. and changed its name to DB HiTek Co.,Ltd. in November 2017. DB HiTek Co.,Ltd. was founded in 1997 and is based in Bucheon, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Bucheon-Si",
        "zipcode": null,
        "website": "http://www.dbhitek.com",
        "market_cap": "Small Cap"
    },
    "001820.KS": {
        "short_name": "SamwhaCapacitor",
        "long_name": "SAMWHA CAPACITOR Co.,LTD",
        "summary": "SAMWHA CAPACITOR Co.,LTD manufactures and sells capacitors in South Korea. It offers multi-layer ceramic capacitors, disc ceramic capacitors, EMI filters, beads and inductors, disc varistors, shunt power capacitors, and energy storage capacitors. The company was founded in 1956 and is headquartered in Yongin, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Yongin-Si",
        "zipcode": null,
        "website": "http://www.samwha.com/capacitor",
        "market_cap": "Small Cap"
    },
    "002450.KS": {
        "short_name": "SamickMusInstr",
        "long_name": "SAMICK MUSICAL INSTRUMENT Co., Ltd",
        "summary": "SAMICK MUSICAL INSTRUMENT Co., Ltd, together with subsidiaries, manufactures, and sells musical instruments in South Korea. It offers pianos, digital pianos and audios, DJ, guitar and bass products, ukulele, orchestra, and other educational instruments. The company also sells its products online. The company was founded in 1958 and is headquartered in Eumseong-eup, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Eumseong-eup",
        "zipcode": null,
        "website": "http://www.samick.co.kr",
        "market_cap": "Small Cap"
    },
    "002700.KS": {
        "short_name": "SHINIL ELECTRONICS",
        "long_name": "Shinil Electronics Co.,Ltd",
        "summary": "Shinil Electronics Co.,Ltd manufactures and sells household appliances in South Korea. It offers summer appliances, such as fans, air circulators, mobile air conditioners, etc.; and winter appliances, including fan heaters, ultra-low power heaters, hand-wash humidifiers, etc.; and household, kitchen, environmental, and pet household appliances. The company was formerly known as Shinil Industrial Co.,Ltd and changed its name to Shinil Electronics Co.,Ltd in April 2020. Shinil Electronics Co.,Ltd was founded in 1959 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "07299",
        "website": "http://www.shinil.co.kr",
        "market_cap": "Small Cap"
    },
    "003160.KS": {
        "short_name": "DI",
        "long_name": "D.I Corporation",
        "summary": "D.I Corporation manufactures and supplies semiconductor testing equipment in South Korea. The company offers burn-in systems and testers, burn-in boards, and multi flexible testers for various devices. It also exports its products. The company was founded in 1955 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.di.co.kr",
        "market_cap": "Small Cap"
    },
    "004270.KS": {
        "short_name": "Namsung",
        "long_name": "Namsung Corp.",
        "summary": "Namsung Corp. manufactures and trades in electronic products under the DUAL brand in South Korea. The company offers mobile audio and video, DVD navigation, multi-media HD radio, XM satellite receiver radio, and digital AMP wireless headphone products. It is also involved in the department store and wholesale/retail distribution and rental businesses. The company was founded in 1965 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "197-22",
        "website": "http://www.namsung.com",
        "market_cap": "Small Cap"
    },
    "004380.KS": {
        "short_name": "SAMICKTHK",
        "long_name": "Samick THK Co., Ltd.",
        "summary": "Samick THK Co., Ltd. manufactures and sells industrial automation equipment in South Korea. The company's products include linear motion systems; mechanized and robot systems; linear motors; harmonic drives; and files and rasps comprising bee, saw, diamond, rasps, and iron wire lines. It also manufactures automobile parts, such as brake discs and drums; and slide rails and other parts. The company was formerly known as SAMICK LMS Co., Ltd. and changed its name to Samick THK Co., Ltd. in April 2006. Samick THK Co., Ltd. was founded in 1960 and is based in Daegu, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Daegu",
        "zipcode": "42721",
        "website": "http://www.samickthk.co.kr",
        "market_cap": "Small Cap"
    },
    "004710.KS": {
        "short_name": "HansolTechnics",
        "long_name": "Hansol Technics Co., LTD.",
        "summary": "Hansol Technics Co., LTD. manufactures and sells electronic components and materials in South Korea and internationally. The company offers digital systems, such as televisions and DID/applied products; and power systems, such as inverters, converters, switch mode power supply products, automotive, solar inverters, and home appliances. It also provides light emitting diode (LED) sapphire materials, including ingot and wafer products; solar modules and silicon ingot/wafer technology products; and LED lighting products. The company was formerly known as Hansol LCD Inc. and changed its name to Hansol Technics Co., LTD. in December 2010. Hansol Technics Co., LTD. was founded in 1995 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.hansoltechnics.com",
        "market_cap": "Small Cap"
    },
    "004920.KS": {
        "short_name": "CITECH",
        "long_name": "CITECH Co., Ltd.",
        "summary": "CITECH Co., Ltd. provides automatic document issuer and kiosk systems in South Korea. It offers certificate and ticket issuance, kiosk management, order management, DID, and smart care systems. The company was formerly known as Sam Yung Holdings Co., Ltd. and changed its name to CITECH Co., Ltd. in April 2015. CITECH Co., Ltd. was founded in 1967 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.citech.kr",
        "market_cap": "Small Cap"
    },
    "005680.KS": {
        "short_name": "SamyoungElec",
        "long_name": "Samyoung Electronics Co., Ltd",
        "summary": "Samyoung Electronics Co., Ltd. develops and sells electrolytic capacitors primarily in South Korea. The company offers surface mount, miniature aluminum, large sized aluminum, and aluminum solid electrolytic capacitors, as well as aluminum electrolytic capacitors. It also provides etched formed foils for low, intermediate, and high voltage use. The company was founded in 1968 and is based in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seongnam-si",
        "zipcode": "13209",
        "website": "http://www.samyoung.co.kr",
        "market_cap": "Small Cap"
    },
    "005870.KS": {
        "short_name": "HuneedTechnologies",
        "long_name": "Huneed Technologies",
        "summary": "Huneed Technologies develops, manufactures, and sells airborne and defense communication systems in Korea. It offers military communication equipment, including high capacity trunk radio systems, high speed wireless transmission equipment, and remote detonation devices; and command and control systems, such as weapons control systems, as well as tactical data link processing systems. The company also provides airborne systems comprising electrical panel assemblies and light civil helicopter electrical systems, as well as electronics manufacturing services for flight control computers, missile warning receivers, and master warning panel and caution warning panels; and ground control systems, which include ground system development and air traffic flow management systems. In addition, it offers commercial IT systems and logistics support services. The company was formerly known as Daeyoung Electronics Industrial Co., Ltd and changed its name to Huneed Technologies in March 2000. Huneed Technologies was founded in 1968 and is based in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Incheon",
        "zipcode": null,
        "website": "http://www.huneed.com",
        "market_cap": "Small Cap"
    },
    "005930.KS": {
        "short_name": "SamsungElec",
        "long_name": "Samsung Electronics Co., Ltd.",
        "summary": "Samsung Electronics Co., Ltd. engages in the consumer electronics, information technology and mobile communications, and device solutions businesses worldwide. It offers digital TVs, monitors, air conditioners, refrigerators, mobile phones, communication systems, and computers; semiconductor products, such as memory, foundry, and system LSI; and display products comprising LCD and OLED panels, as well as connected car systems, audio and visual products, enterprise automation solutions, and connected services. The company is also involved in the technology and venture capital investment businesses; manufacture of semiconductor equipment and components; and provision of repair services for electronic devices. In addition, it provides medical equipment; software development and supply; toll processing of semiconductors and display panels; general logistics agency, financing, marketing, consulting, and AI technology and cloud services; enterprise automation solutions and connected services; and digital advertising platforms. Further, the company offers mobile payment services; and designs and develops software products. It serves retail, hospitality, finance, transportation, education, government, and healthcare industries. Samsung Electronics Co., Ltd. was founded in 1938 and is based in Suwon, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Suwon-si",
        "zipcode": "443-742",
        "website": "http://www.samsung.com",
        "market_cap": "Large Cap"
    },
    "005935.KS": {
        "short_name": "SamsungElec(1P)",
        "long_name": "Samsung Electronics Co., Ltd.",
        "summary": "Samsung Electronics Co., Ltd. engages in the consumer electronics, information technology and mobile communications, and device solutions businesses worldwide. It offers digital TVs, monitors, air conditioners, refrigerators, mobile phones, communication systems, and computers; semiconductor products, such as memory, foundry, and system LSI; and display products comprising LCD and OLED panels, as well as connected car systems, audio and visual products, enterprise automation solutions, and connected services. The company is also involved in the technology and venture capital investment businesses; manufacture of semiconductor equipment and components; and provision of repair services for electronic devices. In addition, it provides medical equipment; software development and supply; toll processing of semiconductors and display panels; general logistics agency, financing, marketing, consulting, and AI technology and cloud services; enterprise automation solutions and connected services; and digital advertising platforms. Further, the company offers mobile payment services; and designs and develops software products. It serves retail, hospitality, finance, transportation, education, government, and healthcare industries. Samsung Electronics Co., Ltd. was founded in 1938 and is based in Suwon, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Suwon-si",
        "zipcode": "443-742",
        "website": "http://www.samsung.com",
        "market_cap": "Large Cap"
    },
    "006400.KS": {
        "short_name": "SAMSUNG SDI CO.,LTD.",
        "long_name": "Samsung SDI Co., Ltd.",
        "summary": "Samsung SDI Co., Ltd. manufactures and sells batteries worldwide. The company operates through three segments: Chemicals, Electronic Materials, and Energy and Other. It offers small-sized lithium ion batteries used in laptops, tablets, mobile phones, wearable devices, power banks, power tools, garden tools, vacuum cleaners, e-bikes, e-scooters, and ignition products; energy storage systems that are used in base transceiver stations, as well as in residential, utility, commercial, and UPS applications; and automotive batteries. The company also offers electronic materials, including semiconductor products, such as spin-on hardmasks, spin-on dielectrics, and epoxy molding compounds; LCD products, such as polarizing films and color photo resist products; OLED products comprising evaporation materials and thin film encapsulation products; and photovoltaic paste products. In addition, it is involved in the manufacture and sale of rechargeable battery raw materials; and invests in new technology venture business. The company was founded in 1970 and is headquartered in Yongin, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Yongin",
        "zipcode": null,
        "website": "http://www.samsungsdi.com",
        "market_cap": "Large Cap"
    },
    "007610.KS": {
        "short_name": "SeondoElec",
        "long_name": "Seondo Electric Co., Ltd.",
        "summary": "Seondo Electric Co., Ltd. manufactures and sells heavy electric equipment. Its products include gas insulated switchgears/vacuum circuit beakers/vacuum circuit systems, switchgears, motor control centers, and transmission line protection relay panels/pole mounted gas switches/gas load breaker switches; monitoring and control systems, including substation total automation systems, remote terminal units, distributed control systems, and supervisory control and data acquisition systems; and circuit breakers and contactors, such as earth leakage circuit breakers, magnetic contactors, home panel boards, reject filters, and ignition transformers. The company also offers environment products comprising diesel soot smoke reducers, electric dust collectors, high voltage units, ion generators, and plasma agricultural chemicals spray equipment. In addition, it provides metal-clad switchgears, instrumentation boards, bus and T/L protection panels, gas-insulated load make and break products, vacuum combination starters, air circuit breakers, solar heat hot water providers and heaters, molded case and earth leakage circuit breakers, magnetic switches, thermal overload relays, ass'y electric dust collectors, and negative ion generators, as well as undertakes electrical works. The company supplies its products for transmission and supply of electricity, atomic energy power plants, water and fire power plants, and various other plants. It serves customers in South Korea, the Middle East, the Americas, and Southeast Asia. The company was formerly known as Seondo Co., Ltd. and changed its name to Seondo Electric Co., Ltd. in May 1987. Seondo Electric Co., Ltd. was founded in 1972 and is headquartered in Ansan, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Ansan",
        "zipcode": null,
        "website": "http://www.seondo.co.kr",
        "market_cap": "Small Cap"
    },
    "007660.KS": {
        "short_name": "ISUPETASYS",
        "long_name": "ISU Petasys Co., Ltd.",
        "summary": "ISU Petasys Co., Ltd. manufactures and sells printed circuit boards (PCBs) worldwide. The company offers ultra-multilayer PCBs for server/storage equipment and super computers, as well as network equipment, such as switches and routers. It also offers aerospace PCBs; IC tester PCBs, such as probe cards, load boards, and burn-in boards; advanced driver assistance system (ADAS) radio frequency (RF) PCBs; and RF PCBs. The company was formerly known as Petasys Co., Ltd. and changed its name to ISU Petasys Co., Ltd. in March 2002. ISU Petasys Co., Ltd. was founded in 1972 and is headquartered in Daegu, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Daegu",
        "zipcode": "42981",
        "website": "http://www.petasys.com",
        "market_cap": "Small Cap"
    },
    "008060.KS": {
        "short_name": "DAEDUCK",
        "long_name": "Daeduck Co.,Ltd.",
        "summary": "Daeduck Co.,Ltd. provides various printed circuit boards (PCB) in South Korea and internationally. It offers thin PCBs for semiconductor packaging; and PCBs for smartphones, as well as solutions to support 5G communication and autonomous vehicles market segments. The company was founded in 1972 and is based in Ansan-si, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Ansan-Si",
        "zipcode": null,
        "website": "http://www.daeduck.com",
        "market_cap": "Small Cap"
    },
    "00806K.KS": {
        "short_name": "DAEDUCK(1P)",
        "long_name": "Daeduck Co.,Ltd.",
        "summary": "Daeduck Co.,Ltd. provides various printed circuit boards (PCB) in South Korea and internationally. It offers thin PCBs for semiconductor packaging; and PCBs for smartphones, as well as solutions to support 5G communication and autonomous vehicles market segments. The company was founded in 1972 and is based in Ansan-si, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Ansan-Si",
        "zipcode": null,
        "website": "http://www.daeduck.com",
        "market_cap": "Small Cap"
    },
    "008700.KS": {
        "short_name": "AnamElec",
        "long_name": "Anam Electronics Co.,Ltd.",
        "summary": "Anam Electronics Co.,Ltd., a multimedia company, manufactures and sells audio products in South Korea and internationally. The company offers ODM/OEM products, such as AV receivers, Hi-Fidelity products, wireless speakers, AI speakers, and sound bars. It also engages in the brand licensing of TVs, ear plugs, dryers, cables, clock towers, and clocks. The company was founded in 1973 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.aname.co.kr",
        "market_cap": "Small Cap"
    },
    "009140.KS": {
        "short_name": "KyunginElec",
        "long_name": "Kyungin Electronics Co., Ltd",
        "summary": "Kyungin Electronics Co., Ltd manufactures and sells electronic components in South Korea. It offers micro, tact, radial tapping, and SMD switches, as well as remote controllers, thermostats, potentiometers, and other products. The company also exports its products. Kyungin Electronics Co., Ltd was founded in 1973 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "08 501",
        "website": "http://www.kie.co.kr",
        "market_cap": "Small Cap"
    },
    "009310.KS": {
        "short_name": "Charm Engineering",
        "long_name": "Charm Engineering Co.,Ltd.",
        "summary": "Charm Engineering Co.,Ltd. manufactures and sells FPD and semiconductor equipment in South Korea. It offers FPD equipment, including LCD, OLED, TSP, and LGP equipment; PCB equipment, such as short cut repair, PCB metal ink open repair, and review systems; and solar cell equipment comprising solar cell scribers and solar cell edge isolation systems. The company also provides Auto Repair software that detects, repairs, and judges the defects; Active Remote Operating System, a device and software, which converts equipment to the operation interface; and Real Time Monitoring System to check equipment through network real time. In addition, it offers semiconductor equipment comprising dry backside etches. The company was formerly known as Charm & Ci Co., Ltd and changed its name to Charm Engineering Co.,Ltd. in June 2010. Charm Engineering Co.,Ltd. was founded in 1973 and is headquartered in Yongin, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Yongin-Si",
        "zipcode": "449-884",
        "website": "http://www.charmnci.com",
        "market_cap": "Small Cap"
    },
    "009470.KS": {
        "short_name": "SamwhaElec",
        "long_name": "Samwha Electric Co.,Ltd.",
        "summary": "Samwha Electric Co.,Ltd. operates in the electrolytic capacitor industry in South Korea and internationally. It offers single cell and module green-cap electric double layer capacitors. The company also provides hybrid, miniature, large, surface mount, conducting polymer, radial lead type, and screw type aluminum electrolytic capacitors. Its products are used in communication equipment, household appliances, medical devices, and military and aerospace devices, as well as automotive, transportation, LED, smartphone and camera, desktop and notebook, industrial inverter, uninterruptible power supply, and new and renewable energy applications. The company was formerly known as Samwha Nichicon and changed its name to Samwha Electric Co.,Ltd. in November 1974. Samwha Electric Co.,Ltd. was founded in 1973 and is headquartered in Cheongju, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Cheongju",
        "zipcode": "28589",
        "website": "http://www.samwha.com/electric",
        "market_cap": "Small Cap"
    },
    "011070.KS": {
        "short_name": "LG Innotek",
        "long_name": "LG Innotek Co., Ltd.",
        "summary": "LG Innotek Co., Ltd. manufactures and sells electronic materials and components for mobile, automotive, display, semiconductor, LED, and Internet of Things (IoT) businesses in South Korea and internationally. The company offers 2 metal COF; automotive radars; BLE system in package (SiP); COB; COF; CSP; electric oil pumps; electric vehicle communication controllers; flip chip CSP; motor for braking; motor for dual clutch transmission; motor for eletro hydraulic brakes and electric power steering; photo masks; SiP; and smart cameras for IoT. It also provides 3D sensing modules; battery management systems; Bluetooth/Bluetooth + Wi-Fi combo modules; camera modules for automotive and mobile; cellular modules; DC-DC converters for automotive; digital key modules; digital tuners; door and glass break sensors; LED driver modules for automotive; LED modules for automotive; motion sensors; PoE to WiFi bridge; switch mode power supply; steering sensor; v2x communication module; water leakage sensor; and Wi-Fi modules. The company was formerly known as LG Electro-Components Co., Ltd. and changed its name to LG Innotek Co., Ltd. in May 2000. LG Innotek Co., Ltd. was founded in 1970 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "07796",
        "website": "http://www.lginnotek.com",
        "market_cap": "Mid Cap"
    },
    "011230.KS": {
        "short_name": "SamwhaElec",
        "long_name": "Samwha Electronics Co.,Ltd.",
        "summary": "Samwha Electronics Co.,Ltd. manufactures and sells soft ferrite core products worldwide. It offers E cores; PQ/RM cores; POT cores; low profile cores; EP cores; planer cores; SQ, SQE, and UU cores; toroid cores; rod, bar, and screw cores; drum/SMD cores; LF antenna cores; ferrite sheets for wireless charging; ferrite absorbers; and EMC cores. The company also provides magnetic powder cores, chip components, and ferrite plate products. In addition, it offers chip ferrite beads and arrays; chip ferrite and chip power inductors; and chip LC/chip common mode filters. The company was founded in 1976 and is headquartered in Yongin, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Yongin",
        "zipcode": "17118",
        "website": "http://www.samwha.com/electronics",
        "market_cap": "Small Cap"
    },
    "011930.KS": {
        "short_name": "SHINSUNG E&G",
        "long_name": "Shinsung E&G Co., Ltd.",
        "summary": "Shinsung E&G Co., Ltd. provides solar cells, solar modules, and solar systems in Korea and internationally. The company also offers fan filter units, equipment fan filter units, volatile material removal systems, outdoor air control units, air showers, water showering systems, access floor chemical filter fan units, airflow direction indicators, dehumidifiers, blind panel edge lighting, integrated lighting modules, dry room systems, fine particle visualization systems, and water humidification systems, as well as NMP recovery systems. The company was formerly known as Shinsung Solar Energy Co., Ltd. and changed its name to Shinsung E&G Co., Ltd. in March 2017. Shinsung E&G Co., Ltd. was founded in 1977 and is headquartered in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seongnam-si",
        "zipcode": "13543",
        "website": "http://www.shinsung.co.kr",
        "market_cap": "Small Cap"
    },
    "012510.KS": {
        "short_name": "DOUZONE BIZON",
        "long_name": "Douzone Bizon Co., Ltd.",
        "summary": "Douzone Bizon Co., Ltd. provides ICT solutions and services in South Korea. Its products and services include accounting programs; ERP; cloud; groupware; information security; electronic tax invoices; electronic banking; mobile solutions; electronic fax; and education services. The company was founded in 1991 and is based in Chuncheon, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Chuncheon-si",
        "zipcode": null,
        "website": "http://www.duzon.co.kr",
        "market_cap": "Mid Cap"
    },
    "014910.KS": {
        "short_name": "SungmoonElec",
        "long_name": "Sungmoon Electronics Co., Ltd.",
        "summary": "Sungmoon Electronics Co., Ltd. provides metallized film for film capacitors worldwide. It offers aluminum and zinc metallized polyester and polypropylene films. The company also manufactures and sells electric components. Sungmoon Electronics Co., Ltd. was founded in 1980 and is headquartered in Pyeongtaek, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Pyeongtaek",
        "zipcode": "450-818",
        "website": "http://www.smec-korea.co.kr",
        "market_cap": "Small Cap"
    },
    "014915.KS": {
        "short_name": "SungmoonElec(1P)",
        "long_name": "Sungmoon Electronics Co., Ltd.",
        "summary": "Sungmoon Electronics Co., Ltd. provides metallized film for film capacitors worldwide. It offers aluminum and zinc metallized polyester and polypropylene films. The company also manufactures and sells electric components. Sungmoon Electronics Co., Ltd. was founded in 1980 and is headquartered in Pyeongtaek, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Pyeongtaek",
        "zipcode": "450-818",
        "website": "http://www.smec-korea.co.kr",
        "market_cap": "Small Cap"
    },
    "017900.KS": {
        "short_name": "AUK",
        "long_name": "AUK Corp.",
        "summary": "AUK Corp. manufactures and sells electronic parts in South Korea and internationally. The company's products comprise opto sensors, such as emitters, detectors, LED's, IR receiver modules, infrared transceiver modules, photo interrupters, optical encoders, paper and UV sensors, and distance sensors; power semiconductor devices, including MOSFET, bipolar transistors, diodes, power management IC, analog IC, IGBTs, SiC power devices, and package information products; and LED and silicon photo chips. Its products are used for various applications comprising monitors, audio devices, set top boxes/DVD's, cameras, mobile phones and notebooks, refrigerators, air-conditioners, washing machines, robot cleaners, air and water purifiers, printers and copiers, ATM's and vending machines, medical equipment, LED lighting, and conveyors, as well as in automotive, induction heating, and industrial and drone applications. The company was founded in 1984 and is based in Iksan, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Iksan-si",
        "zipcode": null,
        "website": "http://www.auk.co.kr",
        "market_cap": "Small Cap"
    },
    "020760.KS": {
        "short_name": "ILJINDISPLAY",
        "long_name": "Iljin Display Co., Ltd.",
        "summary": "Iljin Display Co., Ltd. manufactures and sells IT components and materials in South Korea and internationally. The company offers touch screen, force touch, bio-metrics, and flexible touch panels, as well as sapphire wafers. Its touch screen panels are used in mobiles, tablet PCs, automotive electronics, home appliances, laptop PCs, and industrial applications; and sapphire wafers are used in mobile devices, LED TVs, and lighting devices, as well as in cover glasses, wearable glasses, and micro LEDs in mobile products. The company was founded in 1994 and is based in Pyeongtaek, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Pyeongtaek",
        "zipcode": "17792",
        "website": "http://www.iljindisplay.com",
        "market_cap": "Small Cap"
    },
    "023590.KS": {
        "short_name": "DaouTech",
        "long_name": "Daou Technology Inc.",
        "summary": "Daou Technology Inc. provides IT and finance services in Japan, China, Indonesia, Vietnam, and France. The company specializes in banking and securities, as well as manages KIWOOM's trading system. It offers marketing communication services, such as texting, Internet fax, business text message, mobile coupon, delivery application, brochure advertisement, bulk mail, and virtual number; online commerce solutions, including P2P commerce, SNS commerce, and online order management; biz infra provides self-developed services comprising business platform, cloud, IDC, and domain services; and financial IT professional services. The company was founded in 1986 and is headquartered in Yongin, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Yongin-Si",
        "zipcode": null,
        "website": "http://www.daou.com",
        "market_cap": "Small Cap"
    },
    "025560.KS": {
        "short_name": "Mirae",
        "long_name": "Mirae Corporation",
        "summary": "Mirae Corporation manufactures and sells semiconductor equipment primarily in South Korea, China, and rest of Asia, Europe, Africa, north America, and south America. It offers hybrid placement and insertion systems; reel tape feeders; and SMT software consisting of standard machine software, feeder barcode systems, LED rank control systems, offline editor software, offline feeder setup software, and line manager systems. The company also provides accessories, such as reel exchangers, feeder stackers, trolleys, stick feeders, internal reel exchangers, bar code systems, off-line trolley setup kits, LSM2 supplies, manual trays, feeder precision adjustion stations, and reel tape cutters. In addition, it offers memory and module test handlers, and burn in sorters; and linear motor technology products, as well as MRM series. Mirae Corporation was founded in 1983 and is headquartered in Cheonan, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Cheonan-si",
        "zipcode": "31093",
        "website": "http://www.mirae.co.kr",
        "market_cap": "Small Cap"
    },
    "030790.KS": {
        "short_name": "BK TOPS",
        "long_name": "BK TOPS Co., Ltd.",
        "summary": "BK TOPS Co., Ltd. operates as an IT service company in South Korea. It offers system integration services in the areas of finance, public affairs, production, etc.; and IT outsourcing services, including integrated management, application operation, and infrastructure/computerized equipment management, as well as financial, big data, HR, and mobile and cloud solutions. The company also distributes raw materials, such as oils, aggregates, and bituminous coal; and auxiliary materials, as well as provides integrated purchase proxy services on consumable materials and consumer goods. The company was formerly known as T tops Co., Ltd. BK TOPS Co., Ltd. was founded in 1991 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "138-861",
        "website": "http://www.tynetworks.co.kr",
        "market_cap": "Small Cap"
    },
    "031820.KS": {
        "short_name": "Comtec",
        "long_name": "Comtec Systems Co.,Ltd.",
        "summary": "Comtec Systems Co.,Ltd. provides various information technology (IT) consulting services in Korea and internationally. The company offers business and SI consulting, network and security consulting, IT outsourcing, solutions and industry consulting, and information security services. It also provides network integration, deployment SI, IT infrastructure, financial, IT, collaboration, security, digital imaging, green IT, unified communications, virtualization, and mobile solutions. The company was founded in 1983 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "07378",
        "website": "http://www.comtec.co.kr",
        "market_cap": "Small Cap"
    },
    "033240.KS": {
        "short_name": "JahwaElec",
        "long_name": "Jahwa Electronics. Co., Ltd",
        "summary": "Jahwa Electronics. Co., Ltd manufactures and sells precision electronic components in South Korea and internationally. The company offers BLDC and geared motors, PTC heaters, and rare earth motors for automobiles; and camera modules, integrated OIS and shutter actuators, auto focus actuators, and vibration motors for mobiles. It also provides charge and supply rollers, magroller assemblies, and developer rollers for laser printers and copiers; PTC thermistors and plastic magnets for home appliances; and thermal spread sheets for displays, as well as Nd-Fe-B magnet. The company was founded in 1981 and is headquartered in Cheongju, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Cheongju",
        "zipcode": "363-922",
        "website": "http://www.jahwa.co.kr",
        "market_cap": "Small Cap"
    },
    "034220.KS": {
        "short_name": "LG Display",
        "long_name": "LG Display Co., Ltd.",
        "summary": "LG Display Co., Ltd. engages in the design, manufacture, and sale of thin-film transistor liquid crystal display (TFT-LCD) and organic light emitting diode (OLED) technology-based display panels. Its TFT-LCD and OLED technology-based display panels are primarily used in televisions, notebook computers, desktop monitors, tablet computers, mobile devices, and automotive displays. The company also provides display panels for industrial and other applications, including entertainment systems, portable navigation devices, and medical diagnostic equipment. It operates in South Korea, China, rest of Asia, the United States, Poland, and other European countries. The company was formerly known as LG.Philips LCD Co., Ltd. and changed its name to LG Display Co., Ltd. in March 2008. LG Display Co., Ltd. was incorporated in 1985 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "07336",
        "website": "http://www.lgdisplay.com",
        "market_cap": "Mid Cap"
    },
    "035510.KS": {
        "short_name": "SHINSEGAE I&C",
        "long_name": "SHINSEGAE Information & Communication Co., LTD",
        "summary": "SHINSEGAE Information & Communication Co., LTD. offers information technology (IT) services in South Korea. It offers operation and maintenance of IT system; IDC services, such as IDC deployment and IT outsourcing, IT infrastructure construction and supply, diagnosing and optimizing online content services; system integration; and network integration services. It also provides SSG LBS platform for browsing locations; SSGPAY, a mobile integrated payment services; information services, such as eCvan which includes additional services to assist in the settlement and closing of deliveries; goodMD, an integrated online sales management solution; messaging services; and eCtax, a service that electronically issues, transmits, receives, and archives tax invoices. In addition, the company provides online and offline education services, as well as development, maintenance, and comprehensive system operation services. Further, it engages in the supply and maintenance of mobile Web and PC Web standard UI/UX development platform, Web reporting/electronic document, middleware and APM, and information security solutions; and hardware equipment and smart electronic IT devices, as well as provides games through e-mart game store and ssg.com. The company was founded in 1997 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.shinsegae-inc.com",
        "market_cap": "Small Cap"
    },
    "039570.KS": {
        "short_name": "HDC I-CONTROLS",
        "long_name": "HDC I-Controls Co., Ltd.",
        "summary": "HDC I-Controls Co., Ltd. provides construction IT solutions in South Korea, Southeast Asia, and the Middle East. The company provides green IoT solutions, such as connected lighting and integrated management center solutions, as well as iBEMS, a building energy management solution; and smart home solutions, including home control, smart LED lighting, smart DC power distribution, smart parking, and unit ventilation systems. It also offers smart building solutions comprising FRONNIX and Smartstruxure building management systems; security and room management systems; and iCos, a central monitoring device for air conditioning systems, power, lighting, access control, IS, and CCTV integration. In addition, the company offers firefighting electrical solutions, including BESTIN Fire Guard, an intelligent firefighting system; R-type system comprising receivers, repeaters, and power supply devices; photoelectric, fixed temperature, and rate of rise detectors; and guide lights. Further, it offers smart infrastructure solutions that include Smart Road for vehicle to vehicle and vehicle to road communication; signal, communications, and electrical and mechanical systems for railway operations; and Smart Port, a solution for automated port operations. The company was formerly known as I Controls Inc. and changed its name to HDC I-Controls Co., Ltd. in April 2018. HDC I-Controls Co., Ltd. was founded in 1999 and is based in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seongnam-si",
        "zipcode": "13556",
        "website": "http://www.icontrols.co.kr",
        "market_cap": "Small Cap"
    },
    "042700.KS": {
        "short_name": "HANMISemi",
        "long_name": "HANMI Semiconductor Co., Ltd.",
        "summary": "HANMI Semiconductor Co., Ltd. manufactures and sells semiconductor equipment in South Korea and internationally. The company offers vision placement equipment; flip chip, TSV dual stacking, TC, flip chip, jumbo panel flip chip, and die flip chip bonders; and EMI shield vision attach and detach, EMI shield vision placement, EMI shield tape mounter, EMI shield tape laser cutting, EMI shield tape demounter, vision inspection, and converlay attach equipment. It also provides power ECU auto, test handler, vision placement, trim, and form/singulation devices, as well as 3D vision inspection equipment; auto mold, compression auto mold, mechanical mold press, and hydraulic mold press equipment; laser marking, laser wafer marking, laser ablation, laser cutting, and laser cutting/deflash equipment. In addition, the company offers cam press trim and form, micro cam press, CSP singulation, pick and place, die soater, strip mounter, and test equipment. HANMI Semiconductor Co., Ltd. was founded in 1980 and is based in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Incheon",
        "zipcode": null,
        "website": "http://www.hanmisemi.com",
        "market_cap": "Small Cap"
    },
    "044380.KS": {
        "short_name": "JOOYONTECH",
        "long_name": "JOOYONTECH CO., Ltd",
        "summary": "JOOYONTECH CO., Ltd manufactures, distributes, sells, and services PCs in South Korea. It offers general and gaming desktops; laptops/ tablets, such as slim notebooks, tablets, and mobile devices; gaming laptops and monitors; portable touch monitors; CCTVs; and TVs. The company was founded in 1988 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.jooyon.co.kr",
        "market_cap": "Small Cap"
    },
    "077500.KS": {
        "short_name": "Uniquest",
        "long_name": "Uniquest Corporation",
        "summary": "Uniquest Corporation distributes electronic components in South Korea and internationally. The company offers 3D multimedia, sensor, and wireless solutions; power products, and communication ICs and PLDs for networking system and communications; and semiconductor solutions for digital consumers, such as media center, smart TV, and smart home. It also provides design, logistics, and technical support services, as well as consulting and training services. The company was formerly known as Uniquest Korea, Co. Ltd. and changed its name to Uniquest Corporation in 2003. The company was founded in 1993 and is headquartered in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seongnam-si",
        "zipcode": "13591",
        "website": "http://www.uniquest.co.kr",
        "market_cap": "Small Cap"
    },
    "094280.KS": {
        "short_name": "HYOSUNG ITX",
        "long_name": "Hyosung ITX Co. Ltd.",
        "summary": "Hyosung ITX Co. Ltd. provides business solutions in South Korea. The company offers IT services, such as content delivery services, including media delivery, file download, cache, and global services; data center services comprising co-location, managed hosting, and security control services; media player, media security, combined transcoding, and contents synchronization services; and cloud hosting and storage, and private cloud services for customers in various fields comprising education, finance, shopping, games, music, movies, and public institutions. It is also involved in the display solution business that offer visual equipment, such as projectors to schools, businesses, and others. In addition, the company offers contact center solutions that provide consulting channels, including phone, fax, email, SNS, etc. for public institution, finance, telecommunication, retail, and manufacturing sectors. Hyosung ITX Co. Ltd. was founded in 1997 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.hyosungitx.com",
        "market_cap": "Small Cap"
    },
    "105840.KS": {
        "short_name": "WOOJIN",
        "long_name": "Woojin Inc.",
        "summary": "Woojin Inc. manufactures and sells sensing and measurement related instruments in South Korea. It offers various instruments ranging from the ICI that measures the amount of neutrons, digital indicators, T/C, fast RTDs, and electromagnetic flow meters and recorders for nuclear power plants. The company also provides automation equipment, such as the slag layer measurement device or the FIMT temperature measuring device; condition monitoring systems to predict and prevent unexpected equipment accidents that could occur in industrial areas; and temperature sensors to temperature related fields, including nuclear power, semiconductor, petrochemical, airline, ship construction, geo technology, and genetic engineering. In addition, it develops various materials comprising vibration damping alloys and high silicon cast iron for applications in civil engineering, steel production, and airline and road construction industries. Further, the company offers Vortex, positive displacement, and electromagnetic flow meters to hydroelectric, gas, petrochemical, and other industries. Woojin Inc. is based in Hwaseong, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Hwaseong-si",
        "zipcode": null,
        "website": "http://www.woojininc.com",
        "market_cap": "Small Cap"
    },
    "192400.KS": {
        "short_name": "CUCKOO",
        "long_name": "Cuckoo Holdings Co., Ltd.",
        "summary": "Cuckoo Holdings Co., Ltd., together with its subsidiaries, manufactures and sells kitchen appliances. The company offers rice cookers; kitchen appliances, such as microwave, mixer, blender, multi cooker, electric griller, air fryer, dish washer and dryer, electric insulation pot and kettle, and pressure bath products; rental products, including water purifier, air cleaner, dehumidifier, massage chair, cleanser, and pet products; and home appliances comprising air cleaner and purifying dehumidifier, bidet, cleanser, clothes dryer, vacuum cleaner, fan, steam iron, electrolytic sterilizing machine, and ice maker. It also provides pots, frying pans/woks, tumblers, and kitchen scales; bedding and furniture products comprising mattress and frame; pet dry room and stroller, harness, water dispenser, and feeder; air purifier, dehumidifier, water purifier, cleanser, per dry room, double sided multi grill, and pet drinker filters; and other products. The company sells its products under the Cuckoo brand. Cuckoo Holdings Co., Ltd. was founded in 1978 and is based in Yangsan, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Yangsan-si",
        "zipcode": null,
        "website": "http://www.cuckoo.co.kr",
        "market_cap": "Small Cap"
    },
    "192650.KS": {
        "short_name": "DREAMTECH",
        "long_name": "DREAMTECH Co., Ltd.",
        "summary": "DREAMTECH Co., Ltd. designs, develops, produces, and sells modules for smartphone, automotive LED, home appliance, fingerprint, sensor, IT convergence, and medical/ healthcare applications in South Korea and internationally. The company was founded in 1998 and is based in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seongnam",
        "zipcode": null,
        "website": "http://www.idreamtech.co.kr",
        "market_cap": "Small Cap"
    },
    "195870.KS": {
        "short_name": "HAESUNG DS",
        "long_name": "HAESUNG DS Co., Ltd.",
        "summary": "HAESUNG DS Co., Ltd. manufactures and sells semiconductor components in South Korea and internationally. The company offers lead frames for use in automotive, mobile device, personal computer, and consumer electronics applications; package substrates for use in flash memory, mobile DRAM, and graphic DRAM applications; and graphene for application in the energy, sensor, bio, military, ink, and display industries. It is also involved in developing bio healthcare sensors, which enables in checking physical activity and status of health, as well as applying sensors to wearable and IT devices. The company was founded in 1984 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "06178",
        "website": "http://www.haesungds.co.kr",
        "market_cap": "Small Cap"
    },
    "248070.KS": {
        "short_name": "SOLUM",
        "long_name": "Solum Co., Ltd.",
        "summary": "Solum Co., Ltd. manufactures and markets power modules, digital tuners, and electronic shelf labels to customers in South Korea and internationally. It also offers TV and monitor displays, adapters, servers, LED power modules, travel chargers for mobile devices, and data system and LED power supply units. The company was founded in 2015 and is based in Yongin-si, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Yongin-si",
        "zipcode": null,
        "website": "http://www.solu-m.com",
        "market_cap": "Small Cap"
    },
    "267850.KS": {
        "short_name": "AsianaIDT",
        "long_name": "Asiana IDT, Inc.",
        "summary": "Asiana IDT, Inc. provides ICT services in South Korea. The company provides consulting, system development, and IT outsourcing services, as well as operation and maintenance services. It serves airline, construction, airport, finance, transportation, and manufacturing sectors. The company was founded in 1991 and is headquartered in Seoul, South Korea. Asiana IDT, Inc. is a subsidiary of Asiana Airlines, Inc.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "03161",
        "website": "http://www.asianaidt.com",
        "market_cap": "Small Cap"
    },
    "281820.KS": {
        "short_name": "KCTECH",
        "long_name": "KCTech Co., Ltd.",
        "summary": "KCTech Co., Ltd. engages in the manufacture and distribution of semiconductor systems, display systems, and electronic materials in South Korea. The company offers semiconductor equipment, including chemical mechanical polishing systems and wet cleaning systems; display equipment, such as wet stations, atmospheric pressure plasma cleaners, CO2 clearers, and coater and tract systems; and electronic materials comprising dielectric slurry and additive, and metal slurry products. KCTech Co., Ltd. was founded in 1987 and is headquartered in Anseong, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Anseong",
        "zipcode": null,
        "website": "http://www.kctech.com",
        "market_cap": "Small Cap"
    },
    "284740.KS": {
        "short_name": "CUCKOO HOMESYS",
        "long_name": "CUCKOO Homesys Co., Ltd",
        "summary": "Cuckoo Homesys Co., Ltd. engages in the manufacture, sale, and rental of household appliances. It sells and rents water purifiers, bidets, air purifiers, and water softeners. The company was founded in 2017 and is headquartered in Siheung, South Korea. Cuckoo Homesys Co., Ltd. operates independently of Cuckoo Holdings Co., Ltd. as of January 12, 2018.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Siheung-Si",
        "zipcode": null,
        "website": "http://www.cuckoorental.co.kr",
        "market_cap": "Small Cap"
    },
    "307950.KS": {
        "short_name": "HyundaiAutoever",
        "long_name": "Hyundai Autoever Corporation",
        "summary": "Hyundai Autoever Corporation provides information and communication technology services. The company offers IT services for automotive industry, such as cloud, digital marketing, mobility, dealer management system, vehicle security, V2X communication/security, driving info collection/analysis, and artificial intelligence; and smart factory solutions, including production management, quality control, logistics management, energy and facility management, and IoT platform. It also provides smart SOC products comprising smart building, which controls home appliances from mobile devices or automobile; smart traffic, an application that offers real time information to prevent traffic accidents; and smart grid, which offers microgrid, a standardized energy platform, cloud based integrated energy management systems, and business value analysis of new renewable energy sources. In addition, the company offers fintech platforms, such as big data analysis and open API; and smart security solutions, which includes biometric authentication, security control solutions, and white hat hacking. Hyundai Autoever Corporation was formerly known as Autoever Systems Co., Ltd. and changed its name to Hyundai Autoever Corporation in January 2011. The company was founded in 2000 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "06179",
        "website": "http://www.hyundai-autoever.com",
        "market_cap": "Mid Cap"
    },
    "336370.KS": {
        "short_name": "Solus Advanced Materials",
        "long_name": "Solus Advanced Materials Co. Ltd.",
        "summary": "Solus Advanced Materials Co. Ltd. provides materials and solutions in South Korea and Europe. It offers battery copper foil for use in electric car battery; copper foil for use in various electronic equipment; electro materials for use in organic light emitting diode display devices, such as mobile, TV, and vehicle/tablet/PCs; and natural bio materials for use in pharmaceutical, cosmeceutical, and nutraceutical ingredients, as well as provides customized development manufacturing services. The company was formerly known as Doosan Solus Co., Ltd. The company was founded in 2019 and is based in Seoul, South Korea. Solus Advanced Materials Co. Ltd. is a subsidiary of Skylake Equity Partners Limited.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "03129",
        "website": "http://www.solusadvancedmaterials.com",
        "market_cap": "Small Cap"
    },
    "353200.KS": {
        "short_name": "DaeduckElectronics",
        "long_name": "DAEDUCK ELECTRONICS Co.,Ltd.",
        "summary": "Daeduck Electronics Co., Ltd. provides various printed circuit boards (PCB) in South Korea and internationally. It offers thin PCBs for semiconductor packaging; and PCBs for smartphones market, as well as solutions to support 5G communication and autonomous vehicles market segments. The company is headquartered in Ansan-si, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Ansan-Si",
        "zipcode": null,
        "website": "http://www.daeduck.com",
        "market_cap": "Small Cap"
    },
    "35320K.KS": {
        "short_name": "DaeduckElectro(1P)",
        "long_name": "DAEDUCK ELECTRONICS Co.,Ltd.",
        "summary": "Daeduck Electronics Co., Ltd. provides various printed circuit boards (PCB) in South Korea and internationally. It offers thin PCBs for semiconductor packaging; and PCBs for smartphones market, as well as solutions to support 5G communication and autonomous vehicles market segments. The company is headquartered in Ansan-si, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Ansan-Si",
        "zipcode": null,
        "website": "http://www.daeduck.com",
        "market_cap": "Small Cap"
    },
    "AXCP": {
        "short_name": "ALLIXON INTERNATIONAL CORPORATI",
        "long_name": "Allixon International Corp.",
        "summary": "Allixon International Corp. provides radio frequency identification software. The company was formerly known as Allixon Co. Ltd. and changed its name in July 2005. The company was founded in 2003 and is based in Seoul, South Korea.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "137-874",
        "website": null,
        "market_cap": null
    },
    "EMRN": {
        "short_name": "EMARINE GLOBAL INC",
        "long_name": "eMARINE Global Inc.",
        "summary": "eMARINE Global Inc. provides maritime information and communications technology solutions. The company offers electronic chart display and information systems (ECDIS), a computer-based navigation system; and electronic navigation charts (ENC), which integrates position information from the global positioning system and other navigational sensors, such as radar, fathometer, and automatic identification systems. It also provides smart ship solutions, such as intra-ship integrated gateway (ISIG), an intra-ship network; collision avoidance and optimal voyage systems; and remote maintenance and engine monitoring systems. The company engages in the distribution of overseas solutions, such as CARIS, a maritime GIS software; digital charts; and Hatteland, a maritime-specialized hardware, as well as provides services related to a maritime-training simulator. It also provides Aids to Navigation (AtoN) management systems consisting of maritime weather signals total management system that collects weather information, which is transmitted to ports and maritime offices for public and civic use; and e-A2N device, which detects technical malfunctions and sends real-time data, such as battery status and weather conditions. The company was formerly known as Pollex, Inc. and changed its name to eMarine Global Inc. in August 2017. The company was founded in 2001 and is based in Busan, South Korea.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Korea",
        "state": null,
        "city": "Busan",
        "zipcode": "46257",
        "website": "http://emarine-global.com",
        "market_cap": "Small Cap"
    },
    "HY9H.F": {
        "short_name": "SK HYNIX GDR 144A/REGS 1",
        "long_name": "SK hynix Inc.",
        "summary": "SK hynix Inc., together with its subsidiaries, engages in the manufacture, distribution, and sale of semiconductor products worldwide. The company offers memory semiconductor products, including DRAM, NAND flash, multi-chip package, etc.; system semiconductors, such as CMOS image sensors, etc.; and enterprise and client solid state drives. It also provides computing, mobile, and graphics memory products. The company was formerly known as Hynix Semiconductor Inc. and changed its name to SK hynix, Inc. in March 2012. SK hynix, Inc. was founded in 1949 and is headquartered in Icheon-si, South Korea.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Korea",
        "state": null,
        "city": "Icheon-Si",
        "zipcode": null,
        "website": "http://www.skhynix.com",
        "market_cap": "Large Cap"
    },
    "IONI": {
        "short_name": "I-ON DIGITAL CORP",
        "long_name": "I-ON Digital Corp.",
        "summary": "I-ON Digital Corp. engages in the development and supply of unstructured data management and digital marketing software and solutions in South Korea and Japan. It offers enterprise content management system and digital experience solutions, such as I-ON Content Server, I-ON Content Application Framework Engine, I-ON Deploy Server, I-ON Content Ecosystem, I-ON Digital Asset Management System, and I-ON Web Analytics Server; and sports and IT convergence service and solutions, including Ticket Advanced Marketing Management, a mobile business to business to consumer platform that integrates and manages the professional sports events, as well as VoiceBall, an amateur league umpire and data service. The company also provides software as a service solutions comprising GAIA, a distributed repository service; iDrive, an e-document management system; e.Form, a mobile contract platform; and Assist9, a mobile enterprise resource planning dashboard. In addition, it offers energy management solutions consisting of Load Aggregator's Management System, a demand response management solution designed to manage and reduce electricity consumption. The company was formerly known as I-ON Communications Corp. I-ON Digital Corp. was founded in 1999 and is headquartered in Seoul, South Korea.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "06234",
        "website": "http://www.i-on.net",
        "market_cap": "Small Cap"
    },
    "LGA.F": {
        "short_name": "LG DISPLAY CO.ADR SW 5000",
        "long_name": "LG Display Co., Ltd.",
        "summary": "LG Display Co., Ltd. engages in the design, manufacture, and sale of thin-film transistor liquid crystal display (TFT-LCD) and organic light emitting diode (OLED) technology-based display panels. Its TFT-LCD and OLED technology-based display panels are primarily used in televisions, notebook computers, desktop monitors, tablet computers, mobile devices, and automotive displays. The company also provides display panels for industrial and other applications, including entertainment systems, portable navigation devices, and medical diagnostic equipment. It operates in South Korea, China, rest of Asia, the United States, Poland, and other European countries. The company was formerly known as LG.Philips LCD Co., Ltd. and changed its name to LG Display Co., Ltd. in March 2008. LG Display Co., Ltd. was incorporated in 1985 and is headquartered in Seoul, South Korea.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "07336",
        "website": "http://www.lgdisplay.com",
        "market_cap": "Mid Cap"
    },
    "LGA.VI": {
        "short_name": "LG DISPLAY CO LTD-ADR",
        "long_name": "LG Display Co., Ltd.",
        "summary": "LG Display Co., Ltd. engages in the design, manufacture, and sale of thin-film transistor liquid crystal display (TFT-LCD) and organic light emitting diode (OLED) technology-based display panels. Its TFT-LCD and OLED technology-based display panels are primarily used in televisions, notebook computers, desktop monitors, tablet computers, mobile devices, and automotive displays. The company also provides display panels for industrial and other applications, including entertainment systems, portable navigation devices, and medical diagnostic equipment. It operates in South Korea, China, rest of Asia, the United States, Poland, and other European countries. The company was formerly known as LG.Philips LCD Co., Ltd. and changed its name to LG Display Co., Ltd. in March 2008. LG Display Co., Ltd. was incorporated in 1985 and is headquartered in Seoul, South Korea.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "VIE",
        "market": "at_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "07336",
        "website": "http://www.lgdisplay.com",
        "market_cap": "Mid Cap"
    },
    "LGLG.F": {
        "short_name": "LG ELECT.(NEW)GDR144A 1/2",
        "long_name": "LG Electronics Inc.",
        "summary": "LG Electronics Inc. manufactures and sells consumer electronics, mobile communications, and home appliances worldwide. It operates through Home Appliance & Air Solution, Home Entertainment, Mobile Communications, Vehicle Components Solutions, and Business Solutions segments. The company offers refrigerators, washing machines, vacuum cleaners, air conditioners, air purifiers, and mobile communication products. It also provides digital, OLED, and LED signages, and commercial TV's for corporate, retail, QSR, transportation, hospitality, healthcare, and education sectors; commercial, residential, and utility ESS for PV self-consumption and frequency regulation applications; solar panels; commercial laundry products, including washer and dryer; compressor and motors; and LG Smart Solution, a cloud service that connects businesses and machines to business owners, as well as content management systems and softwares. In addition, the company offers monitors and PC's, laptops, medical displays, cloud devices, and projectors; and VRF, single and multi splits, single packaged, heating solutions, chiller, and control solutions for residence, retail, office, hotel, shopping mall, and hospital, as well as maintenance and related services. It sells its products under the LG brand name. The company was formerly known as GoldStar and changed its name to LG Electronics Inc. in 1995. LG Electronics Inc. was founded in 1958 and is based in Seoul, South Korea.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "07336",
        "website": "http://www.lg.com",
        "market_cap": "Large Cap"
    },
    "LPL": {
        "short_name": "LG Display Co, Ltd AMERICAN DEP",
        "long_name": "LG Display Co., Ltd.",
        "summary": "LG Display Co., Ltd. manufactures and sells thin-film transistor liquid crystal display (TFT-LCD) and organic light emitting diode (OLED) technology-based display panels in South Korea, China, rest of Asia, Poland, other European countries, and the United States. The company's TFT-LCD and OLED technology-based display panels are primarily used in televisions, notebook computers, desktop monitors, tablet computers, and mobile devices. It also provides display panels for industrial and other applications, including entertainment systems, automotive displays, portable navigation devices, and medical diagnostic equipment. The company was formerly known as LG.Philips LCD Co., Ltd. and changed its name to LG Display Co., Ltd. in March 2008. LG Display Co., Ltd. was founded in 1985 and is headquartered in Seoul, South Korea.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "07336",
        "website": "http://www.lgdisplay.com",
        "market_cap": "Mid Cap"
    },
    "SMSNN.MX": {
        "short_name": "SAMSUNG ELECTRONICS CO",
        "long_name": "Samsung Electronics Co., Ltd.",
        "summary": "Samsung Electronics Co., Ltd. engages in the consumer electronics, information technology and mobile communications, and device solutions businesses worldwide. It offers digital TVs, monitors, air conditioners, refrigerators, mobile phones, communication systems, and computers; semiconductor products, such as memory, foundry, and system LSI; and display products comprising LCD and OLED panels, as well as connected car systems, audio and visual products, enterprise automation solutions, and connected services. The company is also involved in the technology and venture capital investment businesses; manufacture of semiconductor equipment and components; and provision of repair services for electronic devices. In addition, it provides medical equipment; software development and supply; toll processing of semiconductors and display panels; general logistics agency, financing, marketing, consulting, and AI technology and cloud services; enterprise automation solutions and connected services; and digital advertising platforms. Further, the company offers mobile payment services; and designs and develops software products. It serves retail, hospitality, finance, transportation, education, government, and healthcare industries. Samsung Electronics Co., Ltd. was founded in 1938 and is based in Suwon, South Korea.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "South Korea",
        "state": null,
        "city": "Suwon-si",
        "zipcode": "443-742",
        "website": "http://www.samsung.com",
        "market_cap": "Large Cap"
    },
    "SSU.F": {
        "short_name": "SAMS.EL.0,5SP.GDRS144A/95",
        "long_name": "Samsung Electronics Co., Ltd.",
        "summary": "Samsung Electronics Co., Ltd. engages in the consumer electronics, information technology and mobile communications, and device solutions businesses worldwide. It offers mobile phones, tablets, wearables, virtual reality, and audio products; TVs, and home theaters; OLED and LCD panels; laptops, computers, chrome books, HDM, memory and system LSI products, monitors, and printers; and home appliances, such as refrigerators, air conditioners, ovens, air purifiers, cooktops and hoods, microwaves, dishwashers, washers, dryers, vacuum cleaners, and heating products, as well as TV and home theater accessories. It also provides security and monitoring, trackers, Wi-Fi routers, hubs, sensors, outlets, and buttons. In addition, the company is involved in the technology and venture capital investment businesses; manufacture of semiconductor equipment and components; and provision of repair services for electronic devices. Further, it provides medical equipment; software development and supply; toll processing of semiconductors and display panels; connected car systems, general logistics agency, financing, marketing, consulting, AI technology research, and cloud services; enterprise automation solutions and connected services; and digital advertising platforms. Additionally, it offers image sensing devices and mobile payment services; and designs and develops software products. The company serves finance, government, healthcare, education, hospitality, transportation, retail, legal, public safety, and manufacturing industries. Samsung Electronics Co., Ltd. was founded in 1938 and is based in Suwon, South Korea.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Korea",
        "state": null,
        "city": "Suwon-si",
        "zipcode": "443-742",
        "website": "http://www.samsung.com",
        "market_cap": "Large Cap"
    },
    "SSU.VI": {
        "short_name": "SAMSUNG ELECTR-GDR",
        "long_name": "Samsung Electronics Co., Ltd.",
        "summary": "Samsung Electronics Co., Ltd. engages in the consumer electronics, information technology and mobile communications, and device solutions businesses worldwide. It offers mobile phones, tablets, wearables, virtual reality, and audio products; TVs, and home theaters; OLED and LCD panels; laptops, computers, chrome books, HDM, memory and system LSI products, monitors, and printers; and home appliances, such as refrigerators, air conditioners, ovens, air purifiers, cooktops and hoods, microwaves, dishwashers, washers, dryers, vacuum cleaners, and heating products, as well as TV and home theater accessories. It also provides security and monitoring, trackers, Wi-Fi routers, hubs, sensors, outlets, and buttons. In addition, the company is involved in the technology and venture capital investment businesses; manufacture of semiconductor equipment and components; and provision of repair services for electronic devices. Further, it provides medical equipment; software development and supply; toll processing of semiconductors and display panels; connected car systems, general logistics agency, financing, marketing, consulting, AI technology research, and cloud services; enterprise automation solutions and connected services; and digital advertising platforms. Additionally, it offers image sensing devices and mobile payment services; and designs and develops software products. The company serves finance, government, healthcare, education, hospitality, transportation, retail, legal, public safety, and manufacturing industries. Samsung Electronics Co., Ltd. was founded in 1938 and is based in Suwon, South Korea.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "VIE",
        "market": "at_market",
        "country": "South Korea",
        "state": null,
        "city": "Suwon-si",
        "zipcode": "443-742",
        "website": "http://www.samsung.com",
        "market_cap": "Large Cap"
    },
    "SSUN.F": {
        "short_name": "SAMSUNG EL./25 GDRS NV PF",
        "long_name": "Samsung Electronics Co., Ltd.",
        "summary": "Samsung Electronics Co., Ltd. engages in the consumer electronics, information technology and mobile communications, and device solutions businesses worldwide. It offers digital TVs, monitors, air conditioners, refrigerators, mobile phones, communication systems, and computers; semiconductor products, such as memory, foundry, and system LSI; and display products comprising LCD and OLED panels, as well as connected car systems, audio and visual products, enterprise automation solutions, and connected services. The company is also involved in the technology and venture capital investment businesses; manufacture of semiconductor equipment and components; and provision of repair services for electronic devices. In addition, it provides medical equipment; software development and supply; toll processing of semiconductors and display panels; general logistics agency, financing, marketing, consulting, and AI technology and cloud services; enterprise automation solutions and connected services; and digital advertising platforms. Further, the company offers mobile payment services; and designs and develops software products. It serves retail, hospitality, finance, transportation, education, government, and healthcare industries. Samsung Electronics Co., Ltd. was founded in 1938 and is based in Suwon, South Korea.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Korea",
        "state": null,
        "city": "Suwon-si",
        "zipcode": "443-742",
        "website": "http://www.samsung.com",
        "market_cap": "Large Cap"
    },
    "SSUN.VI": {
        "short_name": "SAMSUNG ELECTRO-REGS GDR PFD",
        "long_name": "Samsung Electronics Co., Ltd.",
        "summary": "Samsung Electronics Co., Ltd. engages in the consumer electronics, information technology and mobile communications, and device solutions businesses worldwide. It offers mobile phones, tablets, wearables, virtual reality, and audio products; TVs, and home theaters; OLED and LCD panels; laptops, computers, chrome books, HDM, memory and system LSI products, monitors, and printers; and home appliances, such as refrigerators, air conditioners, ovens, air purifiers, cooktops and hoods, microwaves, dishwashers, washers, dryers, vacuum cleaners, and heating products, as well as TV and home theater accessories. It also provides security and monitoring, trackers, Wi-Fi routers, hubs, sensors, outlets, and buttons. In addition, the company is involved in the technology and venture capital investment businesses; manufacture of semiconductor equipment and components; and provision of repair services for electronic devices. Further, it provides medical equipment; software development and supply; toll processing of semiconductors and display panels; connected car systems, general logistics agency, financing, marketing, consulting, AI technology research, and cloud services; enterprise automation solutions and connected services; and digital advertising platforms. Additionally, it offers image sensing devices and mobile payment services; and designs and develops software products. The company serves finance, government, healthcare, education, hospitality, transportation, retail, legal, public safety, and manufacturing industries. Samsung Electronics Co., Ltd. was founded in 1938 and is based in Suwon, South Korea.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "VIE",
        "market": "at_market",
        "country": "South Korea",
        "state": null,
        "city": "Suwon-si",
        "zipcode": "443-742",
        "website": "http://www.samsung.com",
        "market_cap": "Large Cap"
    },
    "XSDG.F": {
        "short_name": "SAMSUNG SDI GDR(144A)/4",
        "long_name": "Samsung SDI Co., Ltd.",
        "summary": "Samsung SDI Co., Ltd. manufactures and sells batteries worldwide. The company operates through three segments: Chemicals, Electronic Materials, and Energy and Other. It offers small-sized lithium ion batteries used in laptops, tablets, mobile phones, wearable devices, power banks, power tools, garden tools, vacuum cleaners, e-bikes, e-scooters, and ignition products; energy storage systems that are used in base transceiver stations, as well as in residential, utility, commercial, and UPS applications; and automotive batteries. The company also offers electronic materials, including semiconductor products, such as spin-on hardmasks, spin-on dielectrics, and epoxy molding compounds; LCD products, such as polarizing films and color photo resist products; OLED products comprising evaporation materials and thin film encapsulation products; and photovoltaic paste products. In addition, it is involved in the manufacture and sale of rechargeable battery raw materials; and invests in new technology venture business. The company was founded in 1970 and is headquartered in Yongin, South Korea.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Korea",
        "state": null,
        "city": "Yongin",
        "zipcode": null,
        "website": "http://www.samsungsdi.com",
        "market_cap": "Large Cap"
    }
}