{
    "105840.KS": {
        "short_name": "WOOJIN",
        "long_name": "Woojin Inc.",
        "summary": "Woojin Inc. manufactures and sells sensing and measurement related instruments in South Korea. It offers various instruments ranging from the ICI that measures the amount of neutrons, digital indicators, T/C, fast RTDs, and electromagnetic flow meters and recorders for nuclear power plants. The company also provides automation equipment, such as the slag layer measurement device or the FIMT temperature measuring device; condition monitoring systems to predict and prevent unexpected equipment accidents that could occur in industrial areas; and temperature sensors to temperature related fields, including nuclear power, semiconductor, petrochemical, airline, ship construction, geo technology, and genetic engineering. In addition, it develops various materials comprising vibration damping alloys and high silicon cast iron for applications in civil engineering, steel production, and airline and road construction industries. Further, the company offers Vortex, positive displacement, and electromagnetic flow meters to hydroelectric, gas, petrochemical, and other industries. Woojin Inc. is based in Hwaseong, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Hwaseong-si",
        "zipcode": null,
        "website": "http://www.woojininc.com",
        "full_time_employees": null
    },
    "EMRN": {
        "short_name": "EMARINE GLOBAL INC",
        "long_name": "eMARINE Global Inc.",
        "summary": "eMARINE Global Inc. provides maritime information and communications technology solutions. The company offers electronic chart display and information systems (ECDIS), a computer-based navigation system; and electronic navigation charts (ENC), which integrates position information from the global positioning system and other navigational sensors, such as radar, fathometer, and automatic identification systems. It also provides smart ship solutions, such as intra-ship integrated gateway (ISIG), an intra-ship network; collision avoidance and optimal voyage systems; and remote maintenance and engine monitoring systems. The company engages in the distribution of overseas solutions, such as CARIS, a maritime GIS software; digital charts; and Hatteland, a maritime-specialized hardware, as well as provides services related to a maritime-training simulator. It also provides Aids to Navigation (AtoN) management systems consisting of maritime weather signals total management system that collects weather information, which is transmitted to ports and maritime offices for public and civic use; and e-A2N device, which detects technical malfunctions and sends real-time data, such as battery status and weather conditions. The company was formerly known as Pollex, Inc. and changed its name to eMarine Global Inc. in August 2017. The company was founded in 2001 and is based in Busan, South Korea.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Korea",
        "state": null,
        "city": "Busan",
        "zipcode": "46257",
        "website": "http://emarine-global.com",
        "full_time_employees": null
    }
}