{
    "003160.KS": {
        "short_name": "DI",
        "long_name": "D.I Corporation",
        "summary": "D.I Corporation manufactures and supplies semiconductor testing equipment in South Korea. The company offers burn-in systems and testers, burn-in boards, and multi flexible testers for various devices. It also exports its products. The company was founded in 1955 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.di.co.kr",
        "full_time_employees": null
    },
    "004380.KS": {
        "short_name": "SAMICKTHK",
        "long_name": "Samick THK Co., Ltd.",
        "summary": "Samick THK Co., Ltd. manufactures and sells industrial automation equipment in South Korea. The company's products include linear motion systems; mechanized and robot systems; linear motors; harmonic drives; and files and rasps comprising bee, saw, diamond, rasps, and iron wire lines. It also manufactures automobile parts, such as brake discs and drums; and slide rails and other parts. The company was formerly known as SAMICK LMS Co., Ltd. and changed its name to Samick THK Co., Ltd. in April 2006. Samick THK Co., Ltd. was founded in 1960 and is based in Daegu, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Daegu",
        "zipcode": "42721",
        "website": "http://www.samickthk.co.kr",
        "full_time_employees": 488
    },
    "025560.KS": {
        "short_name": "Mirae",
        "long_name": "Mirae Corporation",
        "summary": "Mirae Corporation manufactures and sells semiconductor equipment primarily in South Korea, China, and rest of Asia, Europe, Africa, north America, and south America. It offers hybrid placement and insertion systems; reel tape feeders; and SMT software consisting of standard machine software, feeder barcode systems, LED rank control systems, offline editor software, offline feeder setup software, and line manager systems. The company also provides accessories, such as reel exchangers, feeder stackers, trolleys, stick feeders, internal reel exchangers, bar code systems, off-line trolley setup kits, LSM2 supplies, manual trays, feeder precision adjustion stations, and reel tape cutters. In addition, it offers memory and module test handlers, and burn in sorters; and linear motor technology products, as well as MRM series. Mirae Corporation was founded in 1983 and is headquartered in Cheonan, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Cheonan-si",
        "zipcode": "31093",
        "website": "http://www.mirae.co.kr",
        "full_time_employees": null
    },
    "042700.KS": {
        "short_name": "HANMISemi",
        "long_name": "HANMI Semiconductor Co., Ltd.",
        "summary": "HANMI Semiconductor Co., Ltd. manufactures and sells semiconductor equipment in South Korea and internationally. The company offers vision placement equipment; flip chip, TSV dual stacking, TC, flip chip, jumbo panel flip chip, and die flip chip bonders; and EMI shield vision attach and detach, EMI shield vision placement, EMI shield tape mounter, EMI shield tape laser cutting, EMI shield tape demounter, vision inspection, and converlay attach equipment. It also provides power ECU auto, test handler, vision placement, trim, and form/singulation devices, as well as 3D vision inspection equipment; auto mold, compression auto mold, mechanical mold press, and hydraulic mold press equipment; laser marking, laser wafer marking, laser ablation, laser cutting, and laser cutting/deflash equipment. In addition, the company offers cam press trim and form, micro cam press, CSP singulation, pick and place, die soater, strip mounter, and test equipment. HANMI Semiconductor Co., Ltd. was founded in 1980 and is based in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Incheon",
        "zipcode": null,
        "website": "http://www.hanmisemi.com",
        "full_time_employees": null
    },
    "195870.KS": {
        "short_name": "HAESUNG DS",
        "long_name": "HAESUNG DS Co., Ltd.",
        "summary": "HAESUNG DS Co., Ltd. manufactures and sells semiconductor components in South Korea and internationally. The company offers lead frames for use in automotive, mobile device, personal computer, and consumer electronics applications; package substrates for use in flash memory, mobile DRAM, and graphic DRAM applications; and graphene for application in the energy, sensor, bio, military, ink, and display industries. It is also involved in developing bio healthcare sensors, which enables in checking physical activity and status of health, as well as applying sensors to wearable and IT devices. The company was founded in 1984 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "06178",
        "website": "http://www.haesungds.co.kr",
        "full_time_employees": null
    },
    "281820.KS": {
        "short_name": "KCTECH",
        "long_name": "KCTech Co., Ltd.",
        "summary": "KCTech Co., Ltd. engages in the manufacture and distribution of semiconductor systems, display systems, and electronic materials in South Korea. The company offers semiconductor equipment, including chemical mechanical polishing systems and wet cleaning systems; display equipment, such as wet stations, atmospheric pressure plasma cleaners, CO2 clearers, and coater and tract systems; and electronic materials comprising dielectric slurry and additive, and metal slurry products. KCTech Co., Ltd. was founded in 1987 and is headquartered in Anseong, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Anseong",
        "zipcode": null,
        "website": "http://www.kctech.com",
        "full_time_employees": null
    }
}