{"012510.KS": {"short_name": "DOUZONE BIZON", "long_name": "Douzone Bizon Co., Ltd.", "summary": "Douzone Bizon Co., Ltd. provides ICT solutions and services in South Korea. Its products and services include accounting programs; ERP; cloud; groupware; information security; electronic tax invoices; electronic banking; mobile solutions; electronic fax; and education services. The company was founded in 1991 and is based in Chuncheon, South Korea.", "currency": "KRW", "sector": "Technology", "industry": "Software—Application", "exchange": "KSC", "market": "kr_market", "country": "South Korea", "city": "Chuncheon-si"}, "IONI": {"short_name": "I-ON DIGITAL CORP", "long_name": "I-ON Digital Corp.", "summary": "I-ON Digital Corp. engages in the development and supply of unstructured data management and digital marketing software and solutions in South Korea and Japan. It offers enterprise content management system and digital experience solutions, such as I-ON Content Server, I-ON Content Application Framework Engine, I-ON Deploy Server, I-ON Content Ecosystem, I-ON Digital Asset Management System, and I-ON Web Analytics Server; and sports and IT convergence service and solutions, which include Ticket Advanced Marketing Management, a mobile business to business to consumer platform that integrates and manages the professional sports events, as well as VoiceBall, an amateur league umpire and data service. The company also provides software as a service solutions, which include GAIA, a distributed repository service; iDrive, an e-document management system; e.Form, a mobile contract platform; and Assist9, a mobile enterprise resource planning dashboard. In addition, it offers energy management solutions comprising Load Aggregator's Management System, a demand response management solution designed to manage and reduce electricity consumption. The company was formerly known as I-ON Communications Corp. I-ON Digital Corp. was founded in 1999 and is headquartered in Seoul, South Korea.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "South Korea", "city": "Seoul"}}