{
  "GISSAA.MX": {
    "city": "Saltillo",
    "country": "Mexico",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Auto Parts",
    "long_name": "Grupo Industrial Saltillo, S.A.B. de C.V.",
    "market": "mx_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GRUPO INDUSTRIAL SALTILLO SAB D",
    "state": "CU",
    "summary": "Grupo Industrial Saltillo, S.A.B. de C.V. designs, manufactures, and markets various products for auto parts, construction, and housewares sectors primarily in North America, Europe, and Asia. The company manufactures and markets aluminum castings and machining parts, as well as gray and ductile iron auto parts for brakes, chassis systems, powertrain, engines, and transmission and suspension systems for the automotive and commercial vehicle industries. It offers auto parts under the Draxton, Evercast, GISederlan brands. The company also produces and markets ceramic and porcelain tiles and wall coverings under the Vitromex, Arko, and Construpiso brands. In addition, it manufactures and markets kitchenware and tableware products, as well as trades a range of countertop kitchen appliances, such as blenders and cookers primarily under the Cinsa and Santa Anita brand names. Grupo Industrial Saltillo, S.A.B. de C.V. was founded in 1928 and is based in Saltillo, Mexico.",
    "website": "http://www.gis.com.mx",
    "zipcode": "25000"
  },
  "NEMAKA.MX": {
    "city": "García",
    "country": "Mexico",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Auto Parts",
    "long_name": "Nemak, S. A. B. de C. V.",
    "market": "mx_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NEMAK SAB DE CV",
    "state": "NL",
    "summary": "Nemak, S. A. B. de C. V., together with its subsidiaries, develops, manufactures, and sells aluminum components for powertrain, e-mobility, and structural applications to the automotive industry in North America, Europe, and internationally. It offers powertrain components, such as cylinder heads, engine blocks, and transmission cases; vehicle structures, including longitudinal members, shock towers, and subframes; and e-mobility components comprising e-motor and battery housings. The company was formerly known as Tenedora Nemak, S. A. de C. V. and changed its name to Nemak, S. A. B. de C. V. in June 2015. Nemak, S. A. B. de C. V. was incorporated in 1979 and is headquartered in Garcia, Mexico. As of October 05, 2020, Nemak, S. A. B. de C. V. as a subsidiary of Controladora Nemak, S. A. B. de C. V.",
    "website": "http://www.nemak.com",
    "zipcode": "66000"
  }
}
