{
    "CVSG.L": {
        "short_name": "CVS GROUP PLC ORD 0.2P",
        "long_name": "CVS Group plc",
        "summary": "CVS Group plc engages in veterinary, pet crematoria, online pharmacy, and retail businesses. The company operates through four segments: Veterinary Practices, Laboratories, Crematoria, and Animed Direct. It operates animal veterinary practices and complementary veterinary diagnostic businesses. The company also provides pet cremation and clinical waste services for veterinary practices and directly for pet owners. In addition, it operates Animed Direct, an online pharmacy and retail business that sells prescription and non-prescription medicines, premium pet foods, and other animal-related products; and an online dispensary. Further, the company provides burial grounds; and veterinary instrumentation supply and referral services. It owns 480 veterinary practices, 3 laboratories, 7 crematoria, and 1 online pharmacy. CVS Group plc was founded in 1999 and is based in Diss, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Diss"
    },
    "DN8E.F": {
        "short_name": "DIG. PLC LS 0,12335664335",
        "long_name": "Dignity plc",
        "summary": "Dignity plc, together with its subsidiaries, provides funeral services in the United Kingdom. It operates through three segments: Funeral Services, Crematoria, and PreÂ\u0096arranged Funeral Plans. The Funeral Services segment provides funerals and ancillary items, such as memorials and floral tributes. The Crematoria segment offers cremation services, as well as sells memorials and burial plots at the company operated crematoria and cemeteries. The PreÂ\u0096arranged Funeral Plans segment sells funerals in advance to customers wishing to make their own funeral arrangements. As of December 25, 2020, it owned 795 funeral locations and operated 46 crematoria in the United Kingdom. Dignity plc was founded in 1812 and is headquartered in Sutton Coldfield, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Sutton Coldfield"
    },
    "DSEY": {
        "short_name": "Diversey Holdings, Ltd.",
        "long_name": "Diversey Holdings, Ltd.",
        "summary": "Diversey Holdings, Ltd., through its subsidiaries, provides infection prevention and cleaning solutions in Europe, North America, Latin America, the Asia Pacific, and the Middle East and Africa. It operates through two segments, Institutional; and Food and Beverage. The company manufactures, markets, and sells infection prevention and personal care products; floor and building care chemicals; kitchen and mechanical ware wash chemicals, and machines; dosing and dispensing equipment; and floor care machines to healthcare, education, food service, retail and grocery, hospitality, and building service contractors industries. It also provides a range of engineering, consulting, and training services related to productivity management, water and energy management, and risk management. In addition, the company offers chemical products; engineering and equipment solutions; training; and knowledge-based services, as well as water treatment services to brewing, beverage, dairy, processed foods, pharmaceutical, and agriculture industries. Diversey Holdings, Ltd. was founded in 1923 and is headquartered in Northampton, United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Northampton"
    },
    "DTY.L": {
        "short_name": "DIGNITY PLC ORD 12 48/143P",
        "long_name": "Dignity plc",
        "summary": "Dignity plc, together with its subsidiaries, provides funeral services in the United Kingdom. It operates through three segments: Funeral Services, Crematoria, and PreÂ\u0096arranged Funeral Plans. The Funeral Services segment provides funerals and ancillary items, such as memorials and floral tributes. The Crematoria segment offers cremation services, as well as sells memorials and burial plots at the company operated crematoria and cemeteries. The PreÂ\u0096arranged Funeral Plans segment sells funerals in advance to customers wishing to make their own funeral arrangements. As of December 25, 2020, it owned 795 funeral locations and operated 46 crematoria in the United Kingdom. Dignity plc was founded in 1812 and is headquartered in Sutton Coldfield, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Sutton Coldfield"
    },
    "KEYS.L": {
        "short_name": "KEYSTONE LAW GROUP PLC ORD 0.2P",
        "long_name": "Keystone Law Group plc",
        "summary": "Keystone Law Group plc provides legal services in the United Kingdom. The company offers its legal services in the areas of banking and finance, commercial, commercial property, construction and projects, corporate, data protection, dispute resolution, employment, EU and competition law, family and matrimonial, fraud and financial crime, immigration, insurance, intellectual property, investment funds and management, licensing and gambling, mediation and ADR, pensions and incentives, planning and environment, probate and estate planning, residential property, restructuring and insolvency, tax, and technology. It serves various sectors, such as aviation, charities and not for profit, energy and natural resources, education, financial service, food and beverage, high-net worth family office, hotel, hospitality and leisure, in-house counsel, life sciences and healthcare, and marine and shipping, media, music, property development, retail, sport, and technology and telecom, as well as private individuals, professional practices. The company was founded in 2002 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "XPS.L": {
        "short_name": "XPS PENSIONS GROUP PLC ORD GBP0",
        "long_name": "XPS Pensions Group plc",
        "summary": "XPS Pensions Group plc, together with its subsidiaries, provides employee benefit consultancy and related business services in the United Kingdom. It offers advisory services to trustees and corporate sponsors for pension scheme management, which include actuarial, long-term financial planning, and scheme benefit design advice. The company also provides administer services, such as pensions administration, payroll services, pension scheme accounting, scam identification, de-risking projects, and technical consultancy to various trust-based company pension schemes, including defined benefit, defined contribution, career average revalued earnings, and hybrid schemes. In addition, it offers independent trustee and SSAS and self-invested personal pension services. The company was formerly known as Xafinity Plc and changed its name to XPS Pensions Group Plc in May 2018. XPS Pensions Group plc was incorporated in 2012 and is based in Reading, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Reading"
    }
}