{
    "AMOR.JK": {
        "short_name": "Ashmore Asset Management Indone",
        "long_name": "PT Ashmore Asset Management Indonesia Tbk",
        "summary": "PT Ashmore Asset Management Indonesia Tbk s an investment management company. The firm was founded in 2010 and is headquartered in Jakarta Utara, Jakarta Raya, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://www.ashmoregroup.com",
        "full_time_employees": 24
    },
    "BPII.JK": {
        "short_name": "Batavia Prosperindo Internasion",
        "long_name": "PT Batavia Prosperindo Internasional Tbk",
        "summary": "PT Batavia Prosperindo Internasional Tbk engages in the investment management, securities brokerage, and underwriting businesses in Indonesia. The company was founded in 1998 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12920",
        "website": "http://www.bpinternasional.com",
        "full_time_employees": 1180
    },
    "MTFN.JK": {
        "short_name": "Capitalinc Investment Tbk.",
        "long_name": "PT Capitalinc Investment Tbk",
        "summary": "PT Capitalinc Investment Tbk operates in the oil and gas sector in Indonesia. The company engages in the exploration, development, and production of oil and natural gas with an area of 5,448.48 square kilometers in the East Kangean; and participates in the exploration, development, and exploitation of petroleum resources covering Seinangka-Senipah Block in East Kalimantan covering an area of 60.61 kilometers square kilometers. It also has an agreement for the exploration and production of crude oil and gas based on production sharing contract in the Air Komering Block, South Sumatera. PT Capitalinc Investment Tbk was founded in 1983 and is based in South Jakarta, Indonesia. PT Capitalinc Investment Tbk opeartes as a subsidiary of BFC SPV Ltd",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12710",
        "website": "http://www.capitalinc-investment.com",
        "full_time_employees": 10
    },
    "PADI.JK": {
        "short_name": "Minna Padi Investama Sekuritas ",
        "long_name": "PT Minna Padi Investama Sekuritas Tbk",
        "summary": "PT Minna Padi Investama Sekuritas Tbk engages in the securities brokerage and underwriting activities in Indonesia. It offers trading and brokerage services for equity or debt securities in the secondary market; underwriting services for initial public offerings and rights issues, bonds, and other convertible bonds, as well as acts as an arranger in private placements; and corporate finance services, such as financial advisory, restructuring, and merger and acquisition services. The company was formerly known as PT Minna Padi Investama Tbk and changed its name to PT Minna Padi Investama Sekuritas Tbk in March 2017. PT Minna Padi Investama Sekuritas Tbk was founded in 1998 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://www.minnapadi.com",
        "full_time_employees": 52
    },
    "SFAN.JK": {
        "short_name": "Surya Fajar Capital Tbk.",
        "long_name": "PT Surya Fajar Capital Tbk",
        "summary": "PT Surya Fajar Capital Tbk provides financial advisory services. The company offers advisory services in the areas of pre-IPO restructuring, group restructuring, debt restructuring, mergers and acquisitions, and IPO and back door listing, as well as on right issues, venture capital, private placements, tailor made financing, medium term notes, and bank loans. PT Surya Fajar Capital Tbk was founded in 2015 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12950",
        "website": "http://www.sfcapital.co.id",
        "full_time_employees": 77
    },
    "SRTG.JK": {
        "short_name": "Saratoga Investama Sedaya Tbk.",
        "long_name": "PT Saratoga Investama Sedaya Tbk",
        "summary": "PT Saratoga Investama Sedaya Tbk is a private equity and venture capital firm specializing in early stage, growth stage and special situations investments. It primarily invests in natural resources, energy, infrastructure, telecommunication, shipping, pharmaceutical, retail, food and beverage, and consumer goods sectors. The firm seeks to make investments in Indonesia. It focuses on acquisitions that are six to eight times EBITDA. The firm seeks to hold its investments for a period of three to five years. Saratoga Capital Investment was founded in 1997 and is based in Jakarta, Indonesia with an additional office in Singapore, Singapore.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12950",
        "website": "http://www.saratoga-investama.com",
        "full_time_employees": 59
    },
    "VICO.JK": {
        "short_name": "Victoria Investama Tbk.",
        "long_name": "PT Victoria Investama Tbk",
        "summary": "PT Victoria Investama Tbk, through its subsidiaries, provides financial services in Indonesia. It offers commercial banking products and services, which includes saving and current accounts, deposits, and investment products; and loan products, which include consumer and production credit. The company also operates as a security broker and underwriter for individual client, and local and foreign business entities; and manages securities and securities products, such as stocks, bonds, and other assets, including property. In addition, it offers general insurance products, such as assurance of property, motorized vehicles, personal accidents, transportation, engineering, money, liability, and boat frame to multi finance companies, banks, local government, state-owned enterprises, private companies, and individuals. Further, the company provides corporate finance and advisory management services, as well as act as a fund arranger. The company was formerly known as PT Victoria Sekuritas and changed its name to PT Victoria Investama Tbk in 2012. The company was founded in 1989 and is based in Jakarta, Indonesia. PT Victoria Investama Tbk is a subsidiary of PT Gratamulia Pratama.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12930",
        "website": "http://www.victoriainvestama.co.id",
        "full_time_employees": 979
    }
}