{
    "ADMF.JK": {
        "short_name": "Adira Dinamika Multi Finance Tb",
        "long_name": "PT Adira Dinamika Multi Finance Tbk",
        "summary": "PT Adira Dinamika Multi Finance Tbk provides consumer financing, murabahah financing, and finance leasing services in Indonesia. The company offers financing for new and used cars and motorcycles, as well as durable goods and other products. The company was founded in 1990 and is based in South Jakarta, Indonesia. PT Adira Dinamika Multi Finance Tbk is a subsidiary of PT Bank Danamon Indonesia Tbk.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12920",
        "website": "http://adira.co.id",
        "market_cap": "Large Cap"
    },
    "BBLD.JK": {
        "short_name": "Buana Finance Tbk.",
        "long_name": "PT Buana Finance Tbk",
        "summary": "PT Buana Finance Tbk. provides investment, working capital, and multipurpose financing services in Indonesia. The company operates through Lease Financing Receivables and Consumer Financing Receivables segments. It offers financing services for various products, including heavy equipment, such as excavators, wheel loaders, tractors, and heavy trucks; generator and forklifts; printing and industrial machineries; consumer cars and commercial vehicles (trucks); vessels; Hajj/Umrah; education; tour traveling/ vacation; and others. The company also provides working capital financing, which include sale and leaseback, and factoring; multipurpose financing comprising finance lease and installment finance; and investment financing that cover financing facilities for procurement of capital goods, as well as services to individuals, business entities, or legal entities for the modernization and expansion of businesses/investment. It serves customers through its network of 33 branches in Jabodetabek, Java, Sumatra, Bali, Kalimantan, Sulawesi, and Papua. The company was founded in 1982 and is headquartered in Jakarta, Indonesia. PT Buana Finance Tbk. is a subsidiary of PT Sari Dasa Karsa.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12950",
        "website": "http://www.buanafinance.co.id",
        "market_cap": "Large Cap"
    },
    "BFIN.JK": {
        "short_name": "BFI Finance  Indonesia Tbk.",
        "long_name": "PT BFI Finance Indonesia Tbk",
        "summary": "PT BFI Finance Indonesia Tbk engages in the finance leasing and consumer financing activities. The company operates through Cars, Motorcycles, and Others segments. It provides new and used car financing products through dealers and sales representatives; used motorcycles financing products; and new and used heavy equipment, machinery, truck and public transportation, and other equipment financing services for construction, mining, industrial, forestry, and manufacturing sectors. The company also offers property backed financing, which includes shop and shophouse financing products; working capital and funding facility; project and infrastructure financing products; sharia and investment financing products; IT-based borrowing and lending services; and factoring services. As of December 31, 2020, it operated 228 branches comprise 45 Sharia representative branches and 118 kiosks in Indonesia. The company was formerly known as PT Bunas Finance Indonesia Tbk and changed its name to PT BFI Finance Indonesia Tbk in June 2001. PT BFI Finance Indonesia Tbk was founded in 1982 and is based in Tangerang Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang Selatan",
        "zipcode": "15322",
        "website": "http://www.bfi.co.id",
        "market_cap": "Large Cap"
    },
    "BPFI.JK": {
        "short_name": "Batavia Prosperindo Finance Tbk",
        "long_name": "PT Batavia Prosperindo Finance Tbk",
        "summary": "PT Batavia Prosperindo Finance Tbk provides finance leasing, consumer financing, and factoring services in Indonesia. As of September 30, 2020, it had 75 branch offices. The company was formerly known as PT Bira Multi Finance and changed its name to PT Batavia Prosperindo Finance Tbk in March 2007. PT Batavia Prosperindo Finance Tbk was founded in 1994 and is headquartered in Jakarta, Indonesia. PT Batavia Prosperindo Finance Tbk is a subsidiary of PT Batavia Prosperindo International Tbk.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12920",
        "website": "http://bpfi.co.id",
        "market_cap": "Large Cap"
    },
    "CFIN.JK": {
        "short_name": "Clipan Finance Indonesia Tbk.",
        "long_name": "PT. Clipan Finance Indonesia Tbk",
        "summary": "PT. Clipan Finance Indonesia Tbk provides financial leasing, consumer financing, and factoring services. The company's products include used car financing; new or used house, shophouse, home office, and condominium/apartment financing; heavy equipment financing; and financing for marriage, home renovation, travel, religious travel, education, and other purposes. It serves customers through 45 branch offices and 75 marketing offices in Indonesia. The company was founded in 1982 and is headquartered in Jakarta, Indonesia. PT. Clipan Finance Indonesia Tbk is a subsidiary of PT Bank Pan Indonesia Tbk.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11480",
        "website": "http://www.clipan.co.id",
        "market_cap": "Large Cap"
    },
    "DEFI.JK": {
        "short_name": "Danasupra Erapacific Tbk.",
        "long_name": "PT Danasupra Erapacific Tbk",
        "summary": "PT Danasupra Erapacific Tbk engages in leasing, factoring, and consumer financing activities in Indonesia. It offers financing for the purchase of used cars and new cars, pickups, trucks, and buses; housing facilities, home stores, home offices, condominiums/apartments, and small offices; and capital goods, such as heavy equipment for mining, plantation, forestry, barge, tugboat, and production machinery, as well as for various purposes, such as marriage, home renovation, travel, worship, education, and other consumption purposes. The company was founded in 1994 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://www.danasupra.com",
        "market_cap": "Large Cap"
    },
    "FUJI.JK": {
        "short_name": "Fuji Finance Indonesia Tbk.",
        "long_name": "PT Fuji Finance Indonesia Tbk",
        "summary": "PT Fuji Finance Indonesia Tbk operates as a finance company in Indonesia. It offers investment finance for various industrial machineries and equipment; working capital finance; multipurpose finance for procurement of goods or services; invoice factoring services; bridging finance; and finance for green energy projects, such as solar power system. The company was founded in 1982 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://www.fujifinance.com",
        "market_cap": "Large Cap"
    },
    "HDFA.JK": {
        "short_name": "Radana Bhaskara Finance Tbk.",
        "long_name": "PT Radana Bhaskara Finance Tbk",
        "summary": "PT Radana Bhaskara Finance Tbk primarily engages in consumer financing activities in Indonesia. The company provides financing services for new and second-hand motor vehicles. As of December 31, 2019, it operated 41 branch offices located in Jakarta, Bogor, Depok, Tangerang and Bekasi, West Java, Central Java, East Java, North Sumatera, Riau, and South Sumatera. The company was formerly known as PT HD Finance Tbk and changed its name to PT Radana Bhaskara Finance Tbk in June 2014. The company was founded in 1972 and is headquartered in Jakarta, Indonesia. As of November 25, 2019, PT Radana Bhaskara Finance Tbk operates as a prior subsidiary of PT Tiara Marga Trakindo.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12560",
        "website": "http://www.radanafinance.co.id",
        "market_cap": "Large Cap"
    },
    "IBFN.JK": {
        "short_name": "Intan Baruprana Finance Tbk.",
        "long_name": "PT Intan Baruprana Finance Tbk",
        "summary": "PT Intan Baruprana Finance Tbk operates as a finance company in Indonesia. The company provides finance leasing, consumer financing, and factoring services. It offers financing for new and second-hand capital goods, including heavy equipment, transport equipment and commercial vehicles, shipping equipment, industrial machines, medical equipment, and other supporting facilities. The company also engages in the sale and leaseback financing activities. It provides financing to plantation, infrastructure, mining, transportation, gas and oil, forestry, aquaculture, health, hospitality, and other sectors. The company was founded in 1991 and is headquartered in Jakarta, Indonesia. PT Intan Baruprana Finance Tbk is a subsidiary of PT Intraco Penta Tbk.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "14130",
        "website": "http://www.ibf.co.id",
        "market_cap": "Large Cap"
    },
    "MFIN.JK": {
        "short_name": "Mandala Multifinance Tbk.",
        "long_name": "Pt Mandala Multifinance Tbk",
        "summary": "PT Mandala Multifinance Tbk engages in consumer financing activities in Java, Sumatera, Sulawesi, and Kalimantan in Indonesia. It offers motorcycle financing services based on conventional and sharia financing, as well as electronic and furniture, and car financing services. The company was formerly known as PT Gracia Dinamika Multifinance and changed its name to PT Mandala Multifinance Tbk in March 1997. The company was founded in 1983 and is based in Jakarta Pusat, Indonesia. PT Mandala Multifinance Tbk is a subsidiary of PT Jayamandiri Gemasejati.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10340",
        "website": "http://mandalafinance.com",
        "market_cap": "Large Cap"
    },
    "POLA.JK": {
        "short_name": "Pool Advista Finance Tbk.",
        "long_name": "PT Pool Advista Finance Tbk",
        "summary": "PT Pool Advista Finance Tbk operates as a financing company in Indonesia. It offers investment, working capital, multipurpose, and sharia financing. The company was formerly known as PT Indojasa Pratama Finance and changed its name to PT Pool Advista Finance Tbk in November 2017. The company was founded in 2001 and is headquartered in Jakarta Selatan, Indonesia. PT Pool Advista Finance Tbk is a subsidiary of PT Pool Advista Indonesia Tbk.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12210",
        "website": "http://paf.co.id",
        "market_cap": "Large Cap"
    },
    "QF8.F": {
        "short_name": "MANDALA MULTIFIN.  RP100",
        "long_name": "Pt Mandala Multifinance Tbk",
        "summary": "PT Mandala Multifinance Tbk engages in consumer financing activities in Java, Sumatera, Sulawesi, and Kalimantan in Indonesia. It offers motorcycle financing services based on conventional and sharia financing, as well as electronic and furniture, and car financing services. The company was formerly known as PT Gracia Dinamika Multifinance and changed its name to PT Mandala Multifinance Tbk in March 1997. The company was founded in 1983 and is based in Jakarta Pusat, Indonesia. PT Mandala Multifinance Tbk is a subsidiary of PT Jayamandiri Gemasejati.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10340",
        "website": "http://mandalafinance.com",
        "market_cap": "Small Cap"
    },
    "TIFA.JK": {
        "short_name": "KDB Tifa Finance Tbk.",
        "long_name": "PT KDB Tifa Finance Tbk",
        "summary": "PT KDB Tifa Finance Tbk engages in the investment financing, working capital financing, and multipurpose financing businesses in Indonesia. It operates in four segments: Finance Lease, Multipurpose Financing, Factoring, and Operating Lease. It also offers sharia financing. The company was formerly known as PT Tifa Finance Tbk and changed its name to PT KDB Tifa Finance Tbk in September 2020. PT KDB Tifa Finance Tbk was founded in 1989 and is headquartered in Jakarta Selatan, Indonesia. As of September 8, 2020, PT KDB Tifa Finance Tbk operates as a subsidiary of Korea Development Bank.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12710",
        "website": "http://www.kdbtifa.co.id",
        "market_cap": "Large Cap"
    },
    "TRUS.JK": {
        "short_name": "Trust Finance Indonesia Tbk",
        "long_name": "PT. Trust Finance Indonesia Tbk",
        "summary": "PT. Trust Finance Indonesia Tbk provides financing services in Indonesia. The company offers investment financing services comprising financing of heavy equipment, trucks, digital printing and printing machines, industrial machineries, and medical devices. The company also provides working capital financing solutions, including sale and lease back, factoring, and business capital facilities. In addition, it offers financing for houses and apartments, cars, motorcycles, education, and tour/travel expenses, as well as for the purchase of household appliances and other consumptive products. The company was formerly known as PT KIA Asia Finance and changed its name to PT. Trust Finance Indonesia Tbk in February 2002. The company was founded in 1990 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": null,
        "website": "http://www.trustfinanceindonesia.com",
        "market_cap": "Large Cap"
    },
    "VRNA.JK": {
        "short_name": "Verena Multi Finance Tbk.",
        "long_name": "PT. Verena Multi Finance Tbk",
        "summary": "PT. Verena Multi Finance Tbk provides consumer finance and leasing services to individuals and financial institutions in Indonesia. The company offers financing for new and used cars; and investment and working capital financing services, as well as financial leasing for heavy equipment and production machines. It operates through 21 branches in Bandung, Bogor, Cikarang, Jakarta, Makassar, Depok, Malang, Medan, Palembang, Pekanbaru, Samarinda, Semarang, Serang, Surabaya, and Tangerang cities. The company was formerly known as PT. Verena Oto Finance Tbk and changed its name to PT. Verena Multi Finance Tbk in January 2011. PT. Verena Multi Finance Tbk was founded in 1993 and is headquartered in Central Jakarta, Indonesia. PT. Verena Multi Finance Tbk is a subsidiary of Mizuho Leasing Company, Limited",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10120",
        "website": "http://www.verena.co.id",
        "market_cap": "Large Cap"
    },
    "WOMF.JK": {
        "short_name": "Wahana Ottomitra Multiartha Tbk",
        "long_name": "PT Wahana Ottomitra Multiartha Tbk",
        "summary": "PT Wahana Ottomitra Multiartha Tbk, together with its subsidiaries, engages in consumer financing activities in Indonesia. The company offers investment financing and working capital financing services, such as finance lease, sale and leaseback, factoring, project financing, and infrastructure financing, as well as purchase payment by installments and other financing services. It also provides financing services for new and used two-wheeled and four-wheeled motor vehicles. The company was formerly known as PT Wahana Ometraco Multi Artha and changed its name to PT Wahana Ottomitra Multiartha Tbk in March 2000. The company was incorporated in 1982 and is headquartered in Jakarta Utara, Indonesia. PT Wahana Ottomitra Multiartha Tbk is a subsidiary of PT Bank Maybank Indonesia Tbk.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Utara",
        "zipcode": "14350",
        "website": "http://www.wom.co.id",
        "market_cap": "Large Cap"
    }
}