{
    "ABDA.JK": {
        "short_name": "Asuransi Bina Dana Arta Tbk.",
        "long_name": "PT Asuransi Bina Dana Arta Tbk",
        "summary": "PT Asuransi Bina Dana Arta Tbk operates as a general insurance company in Indonesia. The company offers motor vehicle, fire, personal accident and health, engineering, marine cargo, and surety and bond insurance products. It also engages in the motor vehicle workshop and repair business. The company was founded in 1982 and is headquartered in Jakarta, Indonesia. PT Asuransi Bina Dana Arta Tbk is a subsidiary of Mapfre Internacional SA.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "AHAP.JK": {
        "short_name": "Asuransi Harta Aman Pratama Tbk",
        "long_name": "PT Asuransi Harta Aman Pratama Tbk",
        "summary": "PT Asuransi Harta Aman Pratama Tbk engages in the general insurance business in Indonesia. It offers property all risk/industrial all risk, fire, earthquake, motor vehicle, marine cargo, and health insurance products, as well as other insurances, such as travel, personal accident, burglary, cash in safe and transit, billboard/neon sign, and electronic equipment insurance products. The company was founded in 1982 and is headquartered in Jakarta, Indonesia. PT Asuransi Harta Aman Pratama Tbk operates as a subsidiary of PT. Asuransi Central Asia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Central Jakarta"
    },
    "ASDM.JK": {
        "short_name": "Asuransi Dayin Mitra Tbk.",
        "long_name": "PT Asuransi Dayin Mitra Tbk",
        "summary": "PT Asuransi Dayin Mitra Tbk provides general insurance products and services. It operates through Fire, Marine Hull, Motor Vehicle, Marine Cargo, and Others segments. The company offers fire, motor vehicle, marine cargo, marine hull, heavy and movable equipment, aviation, money, personal accident, micro, travel, freight forwarder liability, and health insurance products, as well as Dayin Usaha, Dayin Rumah, Aman Liburan, and Dayin Travelmate insurance products. It also provides engineering insurance, including contractor's all risks, erection all risks, machinery breakdown, electronic equipment, civil engineering completed risk, deterioration of stock, and boiler and pressure vessel insurance; and liability insurance, such as public liability, employer's liability, workmen compensation, comprehensive general, automobile liability, product liability, and directors and officers liability insurance. The company has 10 branches and 5 marketing offices, which are located in various cities in Indonesia. The company was founded in 1982 and is headquartered in Jakarta, Indonesia. PT Asuransi Dayin Mitra Tbk is a subsidiary of PT Equity Development Investment Tbk.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "ASJT.JK": {
        "short_name": "Asuransi Jasa Tania Tbk.",
        "long_name": "PT Asuransi Jasa Tania Tbk",
        "summary": "PT Asuransi Jasa Tania Tbk provides general insurance products and services in Indonesia. It offers property, motor vehicle, marine cargo and hull, aviation hull, engineering, liability, personal and general accident, bond, and miscellaneous insurance products. The company was founded in 1979 and is headquartered in South Jakarta, Indonesia. PT Asuransi Jasa Tania Tbk is a subsidiary of Dana Pensiun Perkebunan.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "South Jakarta"
    },
    "ASRM.JK": {
        "short_name": "Asuransi Ramayana Tbk.",
        "long_name": "PT Asuransi Ramayana Tbk",
        "summary": "PT Asuransi Ramayana Tbk, together with its subsidiaries, operates as a general insurance company in Indonesia. The company operates through two segments, General Insurance and Rental of Office Buildings. It offers fire, marine cargo, motor vehicle, marine hull, aviation, engineering, bond, and miscellaneous insurance products. The company also engages in building and vehicle rental activities. PT Asuransi Ramayana Tbk was founded in 1956 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PTAYF": {
        "short_name": "ASURANSI RAMAYANA",
        "long_name": "PT Asuransi Ramayana Tbk",
        "summary": "PT Asuransi Ramayana Tbk, together with its subsidiaries, operates as a general insurance company in Indonesia. The company operates through two segments, General Insurance and Rental of Office Buildings. It offers fire, marine cargo, motor vehicle, marine hull, aviation, engineering, bond, and miscellaneous insurance products. The company also engages in building and vehicle rental activities. PT Asuransi Ramayana Tbk was founded in 1956 and is headquartered in Jakarta, Indonesia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "VINS.JK": {
        "short_name": "Victoria Insurance Tbk.",
        "long_name": "PT Victoria Insurance Tbk",
        "summary": "PT Victoria Insurance Tbk provides general insurance products and services in Indonesia. The company offers fire, motor vehicle, marine transportation, engineering, surety bond, personal accident, health, hull, liability, property, and freight insurance products. It serves finance, banking, state-owned enterprise, and private and individual customers. The company was founded in 1978 and is headquartered in Jakarta Selatan, Indonesia. PT Victoria Insurance Tbk is a subsidiary of PT Victoria Investama Tbk.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Insurance - Property & Casualty",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Selatan"
    }
}