{
    "AMAG.JK": {
        "short_name": "Asuransi Multi Artha Guna Tbk.",
        "long_name": "P.T. Asuransi Multi Artha Guna Tbk",
        "summary": "P.T. Asuransi Multi Artha Guna Tbk provides a range of general insurance and reinsurance products in Indonesia. The company offers fire, earthquake, property / industrial all risk, heavy equipment, cargo/transportation, burglary, money, personal accident, health, travel, and suretyship insurance products. It also offers machinery, car loan, garage keeper liability, retail credit, oil and gas, business protection plus, fidelity guarantee, moveable all-risks, hole-in-one, neon sign, magna micro business, market consortium, magna credit, liability, micro standard, terrorism and sabotage, and marine hull insurance products, as well as insurance for cash in ATM and cash in management. It operates through a network of 20 branches and 16 representative offices. The company was founded in 1980 and is headquartered in Central Jakarta, Indonesia. P.T. Asuransi Multi Artha Guna Tbk is a subsidiary of Fairfax Asia Limited.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10220",
        "website": "http://www.mag.co.id",
        "market_cap": 1630505271296
    },
    "ASBI.JK": {
        "short_name": "Asuransi Bintang Tbk.",
        "long_name": "PT Asuransi Bintang Tbk",
        "summary": "PT Asuransi Bintang Tbk engages in the general insurance business in Indonesia. The company offers fire, property, earthquake, and motor vehicle, as well as contractor, erection, and moveable all risk insurance products. It also provides machinery breakdown, electronic equipment, marine cargo, personal accident, burglary, health, money, credit card holder personal accident, travel, cyber save, e-commerce card protection, fraudulent charges, and fidelity guarantee, as well as engineering, terrorism and sabotage, and other insurance products. The company was founded in 1955 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12430",
        "website": "http://www.asuransibintang.com",
        "market_cap": 110786740224
    },
    "ASMI.JK": {
        "short_name": "Asuransi Maximus Graha Persada ",
        "long_name": "PT Asuransi Kresna Mitra Tbk",
        "summary": "PT Asuransi Kresna Mitra Tbk engages in general insurance and reinsurance business in Indonesia. The company offers property, motor vehicle, marine cargo and hull, liability, health, personal accident, burglary, moveable assets, money, hole-in-one, billboard, and sharia insurance, as well as engineering insurance, including erection all risks, contractor all risks, and machinery breakdown, and surety bonds. It also provides other insurance products, such as earthquake, workmen's compensation, comprehensive general, product and public liability, professional indemnity, and employer's liability. The company was founded in 1956 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "14350",
        "website": "http://www.kresnainsurance.com",
        "market_cap": 5867739021312
    },
    "GSMF.JK": {
        "short_name": "Equity Development Investment T",
        "long_name": "PT Equity Development Investment Tbk",
        "summary": "PT Equity Development Investment Tbk, together with its subsidiaries, provides insurance products and services in Indonesia. The company operates through four segments: Insurance; Financing; Securities and Stock Administration; and Equity Participation, Travel Services, and Venture Capital. It offers general insurance products, such as fire, motor vehicles, accident, marine hull, engineering, and marine cargo; and life insurance products, including whole life, term insurance, health assurance, unitized pensions, unit link, pure endowment pensions, mortgage reduction term allowance, and combined endowments, as well as provides reinsurance services. The company also provides financial lease, consumer financing, and factoring services, as well as health insurance and pension fund; operates as an underwriter, broker, investment manager, and advisor; and offers venture capital services. In addition, it offers travel services; insurance brokerage services; share registrar services; mutual funds; and administration and health services. The company was formerly known as PT Gajah Surya Arta Leasing. The company was founded in 1982 and is based in Jakarta, Indonesia. PT Equity Development Investment Tbk is a subsidiary of Equity Global International Limited.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10120",
        "website": "http://www.theequityone.com",
        "market_cap": 1066024960000
    },
    "LPGI.JK": {
        "short_name": "Lippo General Insurance Tbk.",
        "long_name": "PT Lippo General Insurance Tbk",
        "summary": "PT Lippo General Insurance Tbk offers various insurance products in Indonesia. The company offers fire, motor vehicle, marine cargo, health, life and death, and other insurance products. It operates through branches and marketing offices located in Karawaci, Medan, Surabaya, Palembang, Bandung, Semarang, Solo, Pekanbaru, Cikarang, Makassar, Jakarta Kota, Balikpapan, and Bali. The company was formerly known as PT Asuransi Marga Pusaka and changed its name to PT Lippo General Insurance Tbk in July 1991. PT Lippo General Insurance Tbk was founded in 1963 and is headquartered in Jakarta Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12940",
        "website": "http://www.lippoinsurance.com",
        "market_cap": 583499972608
    },
    "MTWI.JK": {
        "short_name": "Malacca Trust Wuwungan Insuranc",
        "long_name": "PT Malacca Trust Wuwungan Insurance Tbk",
        "summary": "PT Malacca Trust Wuwungan Insurance Tbk provides general insurance products in Indonesia. The company operates in two divisions, General Insurance and Rental Property. It offers health, fire, motor vehicles, cargo, marine hull, and personal accident insurance products, as well as other insurance products, such as liability, engineering, and miscellaneous insurance products. The company was formerly known as Pt Asuransi Wuwungan and changed its name to PT Malacca Trust Wuwungan Insurance Tbk in 2011. The company was founded in 1952 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12920",
        "website": "http://www.mtwi.co.id",
        "market_cap": 196830789632
    },
    "TUGU.JK": {
        "short_name": "Asuransi Tugu Pratama Indonesia",
        "long_name": "PT Asuransi Tugu Pratama Indonesia Tbk",
        "summary": "PT Asuransi Tugu Pratama Indonesia Tbk engages in general insurance, reinsurance, and sharia businesses in Indonesia. It operates through four segments: General Insurance, Reinsurance, Rental and Related Businesses, and Others. The company offers onshore and offshore energy, fire and property, marine, satellite and aviation, engineering, and health insurance products; and product, aviation products, grounding, aviation premies, hangar keepers', charterer's, automobile, freight forwarder, professional indemnity, air navigation service provider, ship repairers', port and terminal, and satellite de-orbit third party liability insurances. It also provides credit and suretyship insurance products; bank guarantees, such as bid, performance, advance payment, and maintenance bond insurance; miscellaneous insurance products comprising workmen's compensation, money, burglary/theft, hole in one, fidelity guarantee, kidnap and ransom, neon sign, billboard, and videotron insurances; and Sharia insurance products comprising business interruption, burglary, money insurance, marine cargo, liability suit, engineering, heavy equipment insurance, personal accident insurance, and motor vehicles insurances. In addition, the company invests in stocks and mutual funds; develops, rents, trades in, and services real estate properties; and offers brokerage and reinsurance consultancy services, as well as risk management, survey, and valuation services. The company was formerly known as PT Tugu Pratama Indonesia. The company was founded in 1981 and is headquartered in Jakarta, Indonesia. PT Asuransi Tugu Pratama Indonesia Tbk is a subsidiary of PT Pertamina (Persero) Tbk.",
        "currency": "IDR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12920",
        "website": "http://www.tugu.com",
        "market_cap": 2720003260416
    }
}