{
    "000004.SZ": {
        "short_name": "SHENZHEN GUOHUA NE",
        "long_name": "Shenzhen GuoHua Network Security Technology Co., Ltd.",
        "summary": "Shenzhen GuoHua Network Security Technology Co., Ltd., together with its subsidiaries, researches, develops, manufactures, and sells bio-pharmaceutical products in China. It offers products in the areas of cardiovascular, anti-infective, tumor immunity, nerve/analgesic, API, and gastrointestinal/reproductive. The company also provides clindamycin phosphate, adenosine triphosphate magnesium chloride, diisopropylamine dichloroacetate, cyclophosphamide, cytidine triphosphate disodium, urokinase, and other injection products. In addition, it engages in the development and sale of real estate properties, as well as housing property management activities. The company was formerly known as Shenzhen Cau Technology Co., Ltd and changed its name to Shenzhen GuoHua Network Security Technology Co., Ltd. in November 2020. Shenzhen GuoHua Network Security Technology Co., Ltd., was founded in 1990 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518034",
        "website": "http://www.sz000004.cn",
        "market_cap": 3598155008
    },
    "000504.SZ": {
        "short_name": "NANHUA BIO-MEDICIN",
        "long_name": "NanHua Bio-medicine Co., Ltd",
        "summary": "NanHua Bio-medicine Co., Ltd. provides stem and immune cell storage, noninvasive genetic testing, and biological research and technical services. The company is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": null,
        "website": "http://www.nhbiogroup.com",
        "market_cap": 6421540864
    },
    "000518.SZ": {
        "short_name": "JIANGSU SIHUAN BIO",
        "long_name": "Jiangsu Sihuan Bioengineering Co., Ltd",
        "summary": "Jiangsu Sihuan Bioengineering Co., Ltd. engages in the pharmaceutical business in China. It offers Drewson, an anti-tumor biotherapeutic drug for the treatment of renal cancer, malignant melanoma, and cancerous thoracic and peritoneal effusion; and Xinde Lusheng for the treatment of kidney cancer, melanoma, lung cancer, gastric cancer, malignant lymphoma, breast cancer, ovarian tumor, bowel cancer, bladder cancer, head and neck tumor, leukemia and cancerous pleural effusion, etc. The company also provides Xin grain health, a recombinant human granulocyte colony stimulating factor injection; and Tourbo, a recombinant human erythropoietin injection for the treatment of anemia caused by renal insufficiency, including dialysis and non-dialysis patients. Jiangsu Sihuan Bioengineering Co., Ltd. was founded in 1992 and is headquartered in Jiangyin, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiangyin",
        "zipcode": "214400",
        "website": "http://www.000518shsw.com/shsw",
        "market_cap": 3963805952
    },
    "000710.SZ": {
        "short_name": "BERRY GENOMICS CO",
        "long_name": "Berry Genomics Co.,Ltd",
        "summary": "Berry Genomics Co.,Ltd, a genomics company, develops and commercializes technologies for life sciences and clinical applications in China. The company offers sequencing-based genetic tests for genetic disease and cancer from preconception to adulthood. Its products include fetal chromosome aneuploidy detection kits; pre-implantation chromosome copy number anomaly detection kits; chromosome copy number variation detection kits; CSMART tumor gene mutation detection kit 1; BRCA 1/2, PTEN, and TP53 gene mutation detection kits; BRCA1/2 whole exon gene mutation detection sampling boxes; motor neuron survival gene 1 exon deletion detection kits; FMR1 gene regulatory region CGG repeat number detection kits; DNA preparation systems; and NextSeq CN500 sequencing supplies. The company also provides fetal chromosome aneuploidy data analysis and Keyongan data analysis software; and sells reagent equipment. It serves approximately 2,000 hospitals throughout Mainland China, Hong Kong, Macao, and Taiwan. Berry Genomics Co.,Ltd has a partnership with Personalis, Inc. The company was founded in 2010 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.berrygenomics.com",
        "market_cap": 11049523200
    },
    "000990.SZ": {
        "short_name": "CHENGZHI CO. LTD.",
        "long_name": "Chengzhi Shareholding Co., Ltd.",
        "summary": "Chengzhi Shareholding Co., Ltd. engages in the clean energy, functional materials, medical healthcare, and life science and technology related businesses in China. The company offers functional materials, such as liquid crystal material and other display chemical materials, display glass processing materials, daily chemicals, construction chemicals, and recycled wet chemicals. It also provides medical and health services. The company was founded in 1998 and is based in Nanchang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330013",
        "website": "http://www.chengzhi.com.cn",
        "market_cap": 16514672640
    },
    "002007.SZ": {
        "short_name": "HUALAN BIOLOGICAL",
        "long_name": "Hualan Biological Engineering Inc.",
        "summary": "Hualan Biological Engineering Inc., a biopharmaceutical company, researches, develops, produces, and commercializes plasma products, viral vaccines, bacterial vaccines, and recombinant proteins and other biologics in the People's Republic of China. Its plasma products comprise surgical lyophilized fibrin sealant, human coagulation factor VIII, human albumin, human fibrinogen, human hepatitis B immunoglobulin, human tetanus immunoglobulin, human prothrombin complex, human immunoglobulin, human thrombin lyophilized for external use, human rabies immunoglobulin, and human immunoglobulin (PH4) for intravenous injection. The company's vaccines consist of meningococcal polysaccharide vaccine, inactivated influenza vaccine, recombinant hepatitis B vaccine, influenza A vaccine, and H7N9 inactivated influenza vaccine. It also offers gene products. Hualan Biological Engineering Inc. has strategic alliance with the Chinese Academy of Sciences. The company was founded in 1992 and is based in Xinxiang, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xinxiang",
        "zipcode": "453003",
        "website": "http://www.hualanbio.com",
        "market_cap": 67501690880
    },
    "002022.SZ": {
        "short_name": "SHANGHAI KEHUA BIO",
        "long_name": "Shanghai Kehua Bio-Engineering Co.,Ltd",
        "summary": "Shanghai Kehua Bio-Engineering Co.,Ltd researches and develops, produces, and sells in vitro diagnostic products in China. The company offers HBV, hepatitis B, HCV antibody, alpha fetoprotein quantitative, and fecal occult blood test kits; carcino-embryonic antigen quantitative determination kits; test kits for antibody to treponema pallidum and human immunodeficiency virus, and the five serological markers of hepatitis B; and diagnostic kit for syphilis rapid plasma regain. It also provides automatic biochemical analysis systems for clinical laboratories and medical institutions; nucleic acid blood screening systems; automatic chemiluminescence measuring systems; microplate readers and plate washers; general and dedicated reagent packaging systems; and electrolyte analyzers. In addition, the company researches and develops diagnostic products in the field of renal disease that provides screening diagnosis and therapeutic effect monitoring solutions for patients with various types of kidney disease. Further, it offers single-part and multi-part nucleic acid detection, and enzyme immunoassay analysis systems; reagents for blood collection agencies and clinical diagnosis; and laboratory diagnostic instruments. Additionally, the company distributes automatic chemiluminescence, microbial, and blood and urine analysis systems, as well as their supporting supplies; and automatic biochemical analyzers and other products. It also establishes third-party medical laboratory centers; provides planning and designing, management consulting, equipment and reagent supplying, and supply chain optimization services for medical laboratories, as well as medical testing services. In addition, the company is involved in the social medical undertakings. It also exports its Kehua-branded products to 38 countries and regions. The company was founded in 1981 and is based in Shanghai, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200233",
        "website": "http://www.skhb.com",
        "market_cap": 8989292544
    },
    "002252.SZ": {
        "short_name": "S/H RAAS BLOOD PRO",
        "long_name": "Shanghai RAAS Blood Products Co., Ltd.",
        "summary": "Shanghai RAAS Blood Products Co., Ltd. manufactures and distributes blood products in China and internationally. It offers human albumin, human immunoglobulin, coagulation factor, and other products. The company was founded in 1988 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201401",
        "website": "http://www.raas-corp.com",
        "market_cap": 50758148096
    },
    "002275.SZ": {
        "short_name": "GUILIN SANJIN PHAR",
        "long_name": "Guilin Sanjin Pharmaceutical Co., Ltd.",
        "summary": "Guilin Sanjin Pharmaceutical Co., Ltd. researches, produces, and sells traditional Chinese and natural medicines in China. The company primarily offers Guilin watermelon frost and lozenge, and Sanjin tablets under the Chinese TCM brand, as well as Naomaitai capsules. It also produces contemporary TCM preparations. The company was founded in 1967 and is based in Guilin, China. Guilin Sanjin Pharmaceutical Co., Ltd. is a subsidiary of Guilin SanJin Group Co.,Ltd.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guilin",
        "zipcode": null,
        "website": "http://www.sanjin.com.cn",
        "market_cap": 7867365888
    },
    "002286.SZ": {
        "short_name": "BAOLINGBAO BIOLOGY",
        "long_name": "Baolingbao Biology Co.,Ltd.",
        "summary": "Baolingbao Biology Co.,Ltd. manufactures corn-based health and food ingredients in China and internationally. The company offers isomalto-oligosaccharide, galacto-oligosaccharides, fructose-oligosaccharides, and erythritol products; high fructose corn syrups, crystalline fructose products, sugar alcohols, and resistant dextrin-soluble corn fiber and polydextrose products; starch sugars, such as trehalose, maltodextrin, and glucose syrup products; terminal products; and corn steep liquors, corn husk sprayed products, and corn gluten meal products. It also provides agglomerated powder and organic products. The company's products are used in various food items, such as beverages, dairy, bakery, candy, meat, honey, seafood, canned food, condiment, health food, infant nutrition, fermentation, and animal nutrition, as well as in various fields, including daily chemicals, pharmaceuticals, cosmetics, etc. Baolingbao Biology Co.,Ltd. was founded in 1997 and is based in Yucheng, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yucheng",
        "zipcode": "251200",
        "website": "http://www.blb-cn.com",
        "market_cap": 4061816064
    },
    "002287.SZ": {
        "short_name": "TIBET CHEEZHENG TI",
        "long_name": "Tibet Cheezheng Tibetan Medicine Co., Ltd.",
        "summary": "Tibet Cheezheng Tibetan Medicine Co., Ltd. together with its subsidiaries, engages in the research, development, production, and sale of Tibetan medicine in China. It provides drug products in the areas of cardiovascular, respiratory, digestive, urinary and reproductive system, nervous system, musculoskeletal system, and gynecological disorders. The company was founded in 1995 and is based in Nyingchi, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nyingchi",
        "zipcode": "860000",
        "website": "http://www.cheezheng.com.cn",
        "market_cap": 14080712704
    },
    "002566.SZ": {
        "short_name": "JILIN JIAN YISHENG",
        "long_name": "Jilin Jian Yisheng Pharmaceutical Co., Ltd.",
        "summary": "Jilin Jian Yisheng Pharmaceutical Co., Ltd. manufactures and sells medicine, Chinese herbal medicine, cosmetics, and food and health products in China. It offers capsules, injections, tablets, granules, and other products; and Ginseng medicinal and bee products. The company was founded in 1997 and is based in Ji'an, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ji'an",
        "zipcode": "134200",
        "website": "http://www.yisheng-pharm.com",
        "market_cap": 2535092224
    },
    "002603.SZ": {
        "short_name": "SHIJIAZHUANG YILIN",
        "long_name": "Shijiazhuang Yiling Pharmaceutical Co., Ltd.",
        "summary": "Shijiazhuang Yiling Pharmaceutical Co., Ltd. engages in the research and development, manufacture, and sale of pharmaceuticals primarily in China. It operates through three segments: Modern Chinese Medicine, Chemical Pharmaceutical, and Health Industry. The company offers drugs for cardiac and cerebral blood disease, influenza and respiratory disease, tumor, and diabetes mellitus. It sells its products through physical display, online product distribution, and join distribution parallels. Shijiazhuang Yiling Pharmaceutical Co., Ltd. was founded in 1992 and is based in Shijiazhuang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": null,
        "website": "http://www.yiling.cn",
        "market_cap": 34727321600
    },
    "002653.SZ": {
        "short_name": "HAISCO PHARMACEUTI",
        "long_name": "Haisco Pharmaceutical Group Co., Ltd.",
        "summary": "Haisco Pharmaceutical Group Co., Ltd., together with its subsidiaries, develops, produces, and sells drugs in China. The company offers capsules, tablets, granules, and bulk drugs in the fields of cardiovascular, anti-infection, digestive system, nervous and mental system, hepatopathy, diabetes mellitus, etc., as well as liver disease, parenteral nutrition, first-aid, antibiotics, anesthesia, and tumor adjuvant. It is also developing nalmefene hydrochloride injection, dolasetron mesylate injection, cefodizime sodium for injection, hydroxyethyl starch and sodium chloride injection, medium and long chain fat emulsion injection, and compound amino acids injection. The company was formerly known as Xizang Haisco Pharmaceutical Group Co., Ltd. and changed its name to Haisco Pharmaceutical Group Co., Ltd. in March 2016. Haisco Pharmaceutical Group Co., Ltd. was founded in 2000 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": null,
        "website": "http://www.haisco.com",
        "market_cap": 23649304576
    },
    "002821.SZ": {
        "short_name": "ASYMCHEM LABORATOR",
        "long_name": "Asymchem Laboratories (Tianjin) Co., Ltd.",
        "summary": "Asymchem Laboratories (Tianjin) Co., Ltd. researches, develops, and manufactures peptide API and drug products. It also provides analytical services. The company was founded in 1998 and is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300457",
        "website": "http://www.asymchem.com.cn/en/faci.aspx?CID=44",
        "market_cap": 95595044864
    },
    "002868.SZ": {
        "short_name": "LIFECOME BIOCHEMIS",
        "long_name": "Lifecome Biochemistry Co., Ltd.",
        "summary": "Lifecome Biochemistry Co., Ltd. operates as a biopharmaceutical company in China. The company primarily offers bacitracin zinc products, colistin sulfate products, probiotics products, bacitracin methylene disalicylate products, biological preservatives, natamycin products, etc. Lifecome Biochemistry Co., Ltd. was founded in 2003 and is based in Pucheng, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Pucheng",
        "zipcode": null,
        "website": "http://www.lifecomepc.com",
        "market_cap": 1720455040
    },
    "002872.SZ": {
        "short_name": "TIANSHENG PHARMACE",
        "long_name": "Tiansheng Pharmaceutical Group Co., Ltd.",
        "summary": "Tiansheng Pharmaceutical Group Co., Ltd. engages in the pharmaceutical manufacturing and circulation activities. It offers products in various categories, including respiratory, digestive, cardiovascular and cerebrovascular, pediatric, gynecological, orthopedic, tumor, hepatobiliary, blood, surgery, diabetes, and other systems, as well as antipyretic, and analgesic and non-steroidal anti-inflammatory drugs. The company also provides antimicrobials, and vitamins and minerals. Tiansheng Pharmaceutical Group Co., Ltd. was founded in 2001 and is based in Chongqing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "401120",
        "website": "http://www.tszy.com.cn",
        "market_cap": 1653600000
    },
    "002873.SZ": {
        "short_name": "GUIYANG XINTIAN PH",
        "long_name": "Guiyang Xintian Pharmaceutical Co.,Ltd.",
        "summary": "Guiyang Xintian Pharmaceutical Co.,Ltd. engages in the research and development, production, and sale of Chinese medicines for various diseases in China. The company offers formulation products, which include hard capsules, gels, mixtures, granules, and tablets. Its products are used for the treatment of antitumor, gynecological, urinary, breast thyroid, blood, heat, oral, anti-cold, and cardiovascular diseases. The company was founded in 1995 and is based in Guiyang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guiyang",
        "zipcode": null,
        "website": "http://www.gyxtyy.com",
        "market_cap": 2115837312
    },
    "002898.SZ": {
        "short_name": "ZHUHAI SAILONG PHA",
        "long_name": "Zhuhai Sailong Pharmaceutical Co.,Ltd.",
        "summary": "Zhuhai Sailong Pharmaceutical Co.,Ltd. principally engages in the fields of neuroprotective agents and treatment of diseases of the aged. The company is based in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": "5190015",
        "website": "http://www.sailong.cn",
        "market_cap": 1881439872
    },
    "003020.SZ": {
        "short_name": "HEFEI LIFEON PHARM",
        "long_name": "Hefei Lifeon Pharmaceutical Co., Ltd.",
        "summary": "Hefei Lifeon Pharmaceutical Co., Ltd. engages research, development, production, and sales of pharmaceutical preparations and an active ingredient (APIs). It offers APIs, such as succimer, urea, paeonol, felodipine, doxazosin mesylate, zofenopril calcium, troxerutin, and sodium 2,3-dimercapto-1-propanesulfonate; medicinal preparations comprising felodipine sustained release tablets, doxazosin mesylate extended-release tablets, melbinum glipizide tablet, yiqihewei capsule, kunning granule, armillariella oral solution, paeonol ointment, urea and vitamin e cream, Kecuo Yintong gel, and Compound Golden Larch bark gel; and plant extracts, including clove oil, evening primrose oil, herba clinopodii P.E, quercetin, and dihydroquercetin. The company also operates retail chain of pharmaceuticals. Hefei Lifeon Pharmaceutical Co., Ltd. was founded in 2002 and is headquartered in Hefei, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230088",
        "website": "http://www.lifeonapi.com",
        "market_cap": 5290670592
    },
    "0UC.F": {
        "short_name": "ANPAC BIO-MED SP.ADS/1  A",
        "long_name": "AnPac Bio-Medical Science Co., Ltd.",
        "summary": "Anpac Bio-Medical Science Co., Ltd., a development-stage biotechnology company, researches, develops, markets, and sells multi-cancer screening and detection tests to corporations and life insurance companies in the People's Republic of China and the United States. It also manufactures cancer differentiation analysis devices; and offers physical checkup package services. The company was founded in 2010 and is headquartered in Lishui, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Lishui",
        "zipcode": "323006",
        "website": "http://www.anpacbio.com",
        "market_cap": 54172852
    },
    "1061.HK": {
        "short_name": "ESSEX BIO-TECH",
        "long_name": "Essex Bio-Technology Limited",
        "summary": "Essex Bio-Technology Limited, an investment holding company, develops, manufactures, distributes, and sells biopharmaceutical products in the People's Republic of China and internationally. The company operates through Ophthalmic Products and Surgical Products segments. It researches and develops basic fibroblast growth factor products for the treatment of cellular proliferation, differentiation, and migration. The company offers Beifushu series, such as Beifushu eye drops, Beifushu eye gel, and Beifushu unit-dose eye drops; Tobramycin eye drops, Levofloxacin eye drops, Sodium Hyaluronate eye drops, Xalatan eye drops, and Xalacom eye drops, as well as Iodized Lecithin Capsules. It also provides Beifuji sprays and lyophilized powder, and Beifuxin gels for use in burn and scald wounds, acute wounds, surgical incisions, chronic wounds, skin grafting, and other applications. In addition, it offers ophthalmic and surgical products from third parties; and eye health care products, including Beifu shuhui capsules to treat fundus ocular diseases, asthenopia, and visual impairments. Further, the company offers T-Bactum, an anti-microbial oral care product; Carisolv dental caries removal gel; and Yi Xue An Granules. Essex Bio-Technology Limited has license agreements with Mitotech S.A. and Mitotech LLC. Essex Bio-Technology Limited was founded in 1990 and is headquartered in Zhuhai, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": null,
        "website": "http://www.essexbio.com",
        "market_cap": 3787480320
    },
    "1167.HK": {
        "short_name": "JACOBIO-B",
        "long_name": "Jacobio Pharmaceuticals Group Co., Ltd.",
        "summary": "Jacobio Pharmaceuticals Co., Ltd., a clinical-stage pharmaceutical company, focusing on the in-house discovery and development of oncology therapies. Its lead drug development programs include two clinical-stage allosteric SHP2 inhibitors, including JAB-3068, a SHP2 inhibitor for the treatment of patients with solid tumor; and JAB-3312, an oral small molecule anti-tumor agent. The company was founded in 2015 and is based in Beijing, China. Jacobio Pharmaceuticals Co., Ltd. is a subsidiary of Jacobio (HK) Pharmaceuticals Co., Limited.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101111",
        "website": "http://www.jacobiopharma.com",
        "market_cap": 16972164096
    },
    "1477.HK": {
        "short_name": "OCUMENSION-B",
        "long_name": "Ocumension Therapeutics",
        "summary": "Ocumension Therapeutics operates as an ophthalmic pharmaceutical platform company in the People's Republic of China. The company researches and develops, manufactures, and commercializes ophthalmic drugs. It offers drugs for the treatment of blepharitis, infective conjunctivitis, allergic conjunctivitis, dry eye, cataract, glaucoma, uveitis, age-related macular degeneration, and myopia. The company was founded in 2017 and is headquartered in Suzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": null,
        "website": "http://www.ocumension.com",
        "market_cap": 18698027008
    },
    "1548.HK": {
        "short_name": "GENSCRIPT BIO",
        "long_name": "Genscript Biotech Corporation",
        "summary": "Genscript Biotech Corporation, an investment holding company, engages in the manufacture and sale of life science research products and services in North America, Europe, China, Japan, the other Asia Pacific regions, and internationally. It operates through four segments: Life Science Services and Products, Biologics Development Services, Industrial Synthetic Biology Products, and Cell Therapy. The Life Science Services and Products segment provides research services in various categories, including gene synthesis and molecular cloning, oligonucleotide synthesis, protein engineering, peptide synthesis, antibody development, molecular diagnostics tools, and genome editing materials for use in basic biology studies, pharmaceutical and drug discovery, disease diagnostics and vaccine, agriculture, environmental studies, and food industry. The Biologics Development Services segment offers various services, such as antibody drug discovery, antibody drug pre-clinical and clinical development, plasmid and virus pre-clinical development, and plasmid and virus clinical development for therapeutic antibodies and gene/cell therapy products. The Industrial Synthetic Biology Products segment constructs non-pathogenic microbial strains; and develops and produces industrial enzymes. The Cell Therapy segment discovers and develops chimeric antigen receptor T-cell therapies for the treatment of liquid and solid tumors. The company was founded in 2002 and is headquartered in Nanjing, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "211122",
        "website": "http://www.genscript.com",
        "market_cap": 63676923904
    },
    "1672.HK": {
        "short_name": "ASCLETIS-B",
        "long_name": "Ascletis Pharma Inc.",
        "summary": "Ascletis Pharma Inc., a biotechnology company, engages in the research and development, manufacture, marketing, and sale of pharmaceutical products in Mainland China and internationally. It offers Ganovo, a direct-acting anti-viral agent for the treatment of hepatitis C virus (HCV); Pegasys, a pegylated interferon for Hepatitis B and C virus; and Ravidasvir, a pan-genotypic NS5A inhibitor for the treatment of HCV. Its products pipeline includes ASC22, a PD-L1 single domain antibody fragment crystallizable fusion, which is in Phase II trial for the treatment of chronic Hepatitis B infection; ASC40, a Phase II-ready fatty acid synthase inhibitor for the treatment of non-alcoholic steatohepatitis (NASH); and ASC41, an oral THR-Ã\u009f agonist for the treatment of NASH. The company's products also comprise ASC09, a protease inhibitor that has completed Phase IIA clinical trial to treat human immunodeficiency virus type-1 infections; ASC06, which has completed Phase I clinical trial for treating liver cancer; and ASC21, a HCV NS5B polymerase inhibitor. In addition, it is developing therapies that are in pre-clinical trials for the treatment of hepatitis B virus and NASH. The company was incorporated in 2014 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.ascletis.com",
        "market_cap": 4142400768
    },
    "1801.HK": {
        "short_name": "INNOVENT BIO",
        "long_name": "Innovent Biologics, Inc.",
        "summary": "Innovent Biologics, Inc. operates as a biopharmaceutical company in China. The company operates a platform for the discovery, development, manufacture, and commercialization of antibody drug candidates in the fields of oncology, ophthalmology, immunology, and metabolic diseases. Its principal drug candidate is Tyvyt (sintilimab), an anti-PD-1 monoclonal antibody for the treatment of cancer, Hodgkin's lymphoma, and esophageal carcinoma. The company also engages in the development of IBI-301, a rituximab biosimilar for the treatment of non-Hodgkin's lymphoma; IBI-302, a bispecific antibody fusion protein for treatment of ocular fundus disease; IBI-303, an adalimumab biosimilar for the treatment of autoimmune diseases; and IBI-305, a bevacizumab biosimilar for the treatment of metastatic colorectal cancer and non-small cell lung cancer. In addition, it is involved in the development of IBI-306, a human monoclonal antibody to treat hypercholesterolemia; IBI-308, a human monoclonal antibody for lung cancer, esophageal cancer, gastric cancer, and Hodgkin's lymphoma; and IBI-310, a recombinant human anti CTLA-4 monoclonal antibody for liver cancer and renal cell carcinoma. Further, the company develops IBI-101, an anti-OX40 agonistic antibody for the treatment of advanced solid tumors; and IBI-188, an anti-CD47 monoclonal antibody for advanced hematological tumor and solid tumor. Additionally, it distributes pharmaceutical products; and provides consultation, and research and development services. The company has a strategic collaboration with The University of Texas MD Anderson Cancer Center to co-develop TYVYT, a sintilimab injection; Roche Group for the discovery and development of bispecific antibodies and multiple cell therapies; and a strategic alliance with Eli Lilly and Company for TYVYT sintilimab injection. Innovent Biologics, Inc. was incorporated in 2011 and is headquartered in Suzhou, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215123",
        "website": "http://www.innoventbio.com",
        "market_cap": 130931212288
    },
    "1877.HK": {
        "short_name": "JUNSHI BIO",
        "long_name": "Shanghai Junshi Biosciences Co., Ltd.",
        "summary": "Shanghai Junshi Biosciences Co., Ltd., a biopharmaceutical company, engages in the discovery, development, and commercialization of various drugs in the therapeutic areas of oncology, metabolic, auto-immunity, neurologic, and infectious diseases in the People's Republic of China. The company offers JS001, a recombinant humanized anti-PD-1 monoclonal antibody under the trade name of TUOYIR for the indication of melanoma, mucosal melanoma, soft tissue sarcoma, nasopharyngeal carcinoma, urothelial carcinoma, non-small cell lung carcinoma, triple negative breast carcinoma, esophageal squamous cell carcinoma, and hepatocellular carcinoma. It is also developing UBP1211, a biosimilar of Humira for the treatment of rheumatoid arthritis, ankylosing spondylitis, and psoriasis arthritis; JS002, a recombinant humanized anti-PCSK9 monoclonal antibody for treating hyperlipidemia; UBP1213, a recombinant humanized anti-BLyS monoclonal antibody for injection. In addition, the company is developing JS501, a biosimilar of Avastin; and JS003, a recombinant humanized anti-PD-L1 monoclonal antibody for injection; JS101, a pan-CDK inhibitor; TAB004/JS004, a recombinant humanized anti-BTLA monoclonal antibody for injection; and JS005, a recombinant humanized anti-IL-17A monoclonal antibody for injection. It has an agreement with Eli Lilly and Company to co-develop therapeutic antibodies for the potential prevention and treatment of COVID-19, the disease caused by the SARS-CoV-2 novel coronavirus; collaboration with Merck & Co., Inc. to explore new combination treatment for head and neck cancer patients, as well as Coherus Biosciences, Inc. for the development and commercialization of toripalimab, Junshi Biosciences' anti-PD-1 antibody; and a research collaboration and license agreement with Revitope Oncology Inc to explore immunotherapies with precision-targeted T-cell engaging antibodies. The company was founded in 2012 and is headquartered in Shanghai, People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.junshipharma.com",
        "market_cap": 83975315456
    },
    "1952.HK": {
        "short_name": "EVEREST MED-B",
        "long_name": "Everest Medicines Limited",
        "summary": "Everest Medicines Limited, a clinical-stage biopharmaceutical company, focuses on licensing, developing, and commercializing therapies for addressing critical unmet medical needs in Greater China and other Asia Pacific markets. It has a portfolio of eight clinical-stage drug candidates for the treatment of oncology, immunology, cardio-renal disease, and infectious diseases. The company was founded in 2017 and is headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200040",
        "website": "http://www.everestmedicines.com",
        "market_cap": 21155969024
    },
    "1ZL.F": {
        "short_name": "ZAI LAB LTD  ADR/1",
        "long_name": "Zai Lab Limited",
        "summary": "Zai Lab Limited, a biopharmaceutical company, discovers, licenses, develops, and commercializes therapeutics to treat oncology, autoimmune, and infectious diseases in China. The company offers ZEJULA for the treatment of breast cancer and non-small cell lung cancer (NSCLC); and Optune, a cancer therapy to treat glioblastoma multiforme. It also develops QINLOCK for the treatment of gastrointestinal stromal tumors; Odronextamab to treat follicular lymphoma, diffuse large B-cell lymphoma, and other lymphomas; Repotrectinib, a tyrosine kinase inhibitor (TKI) to target ROS1 and TRK A/B/C in TKI-naÃ¯ve- or -pretreated cancer patients; Margetuximab for the treatment of breast and gastroesophageal cancers; Bemarituzumab for the treatment of gastric and gastroesophageal junction cancer; and Omadacycline to treat acute bacterial skin and skin structure, and community-acquired bacterial pneumonia infections. In addition, the company develops CLN-081 for the treatment of patients with EGFR exon 20 insertion NSCLC; Efgartigimod to reduce disease-causing immunoglobulin G (IgG) antibodies; Retifanlimab to treat microsatellite instability high endometrial cancer; ZL-2309 for the treatment of metastatic pancreatic cancer, metastatic colorectal cancer, and other advanced solid tumors; ZL-1201 to treat solid tumors and hematological malignancies; ZL-1102 for the treatment of psoriasis; and Sulbactam/durlobactam for the treatment of serious infections caused by Acinetobacter. Zai Lab Limited has license and collaboration agreements with the GlaxoSmithKline; Paratek Bermuda, Ltd.; Five Prime Therapeutics, Inc.; Entasis Therapeutics Holdings, Inc.; Crescendo Biologics Ltd.; Novocure Limited; MacroGenics Inc.; Deciphera Pharmaceuticals, LLC; Incyte Corporation; Regeneron Ireland Designated Activity Company; Turning Point Therapeutics Inc; Cullinan Pearl Corp.; Takeda Pharmaceutical Company Limited; and argenx BV. The company was incorporated in 2013 and is headquartered in Shanghai, China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201210",
        "website": "http://www.zailaboratory.com",
        "market_cap": 13985496064
    },
    "2096.HK": {
        "short_name": "SIMCERE PHARMA",
        "long_name": "Simcere Pharmaceutical Group Limited",
        "summary": "Simcere Pharmaceutical Group Limited engages in the research, development, manufacture, and distribution of pharmaceutical and vaccine products for pharmaceutical distributors and government in China. Its principal branded generic pharmaceuticals include Bicun, a prescription edaravone injection pharmaceutical for the treatment of strokes; Zailin, a line of generic prescription amoxicillin antibiotics; Yingtaiqing, an anti-inflammatory pain reliever and analgesic drug used to treat rheumatoid arthritis and osteoarthritis; Enlength, an oncology injection; and Sinofuan for the treatment of cancer. The company also offers generic anti-diarrhea pharmaceutical products under the Biqi brand; amoxicillin and clavulanate potassium tablets, granules, and injection for the treatment of infections under the Anqi brand name; cefaclor in dry suspension antibiotics for the treatment of infections under the Zaike brand; herbal medicines for the treatment of coughs under the Kechuanning name; Jiebaishu, which is primarily used for the treatment of head and neck cancers, small cell lung carcinoma, non-small-cell lung carcinoma, esophageal cancer, and other solid tumors; and biapenem for the treatment of severe infections under the Anxin brand. In addition, it offers cardiovascular products; autoimmune products; anti-infective drugs; and other pharmaceutical products, such as Biqi-branded diosmectite powder and anti-diarrhea products. Simcere Pharmaceutical Group Limited was founded in 1995 and is headquartered in Nanjing, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210042",
        "website": "http://www.simcere.com",
        "market_cap": 32608000000
    },
    "2126.HK": {
        "short_name": "JW THERAP-B",
        "long_name": "JW (Cayman) Therapeutics Co. Ltd",
        "summary": "JW (Cayman) Therapeutics Co. Ltd, a clinical stage cell therapy company, focuses on developing, manufacturing, and commercializing cell-based immunotherapies for hematological cancers and solid tumors. The company offers cell-based immunotherapies, including CAR-T treatments, which is a treatment method that uses human immune cells to fight cancer. Its lead product candidate is relmacabtagene autoleucel, an anti-CD19 CAR-T therapy for relapsed or refractory B-cell lymphoma. JW (Cayman) Therapeutics Co. Ltd was founded in 2016 and is headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.jwtherapeutics.com",
        "market_cap": 11183547392
    },
    "2181.HK": {
        "short_name": "MABPHARM-B",
        "long_name": "Mabpharm Limited",
        "summary": "Mabpharm Limited, a biopharmaceutical company, focuses on the research, development, and production of drugs and biosimilar drugs for cancers and autoimmune diseases in China. Its products under the Phase III clinical trial include CMAB007, a recombinant humanized anti-IgE monoclonal antibody for treatment of asthma patients; CMAB009, a recombinant anti-EGFR chimeric monoclonal antibody for the first-line treatment of metastatic colorectal cancer; and CMAB008, a recombinant anti-TNF-alpha chimeric monoclonal antibody for moderate to severe active rheumatoid arthritis. The company is also developing CMAB819 that is in Phase I clinical trial for the treatment of metastatic non-small cell lung cancer, hepatocellular carcinoma, and head and neck squamous cell carcinomas; and CMAB809 that is in Phase I clinical trial for the treatment of HER2 overexpressing breast cancer and metastatic gastric cancer. In addition, its products under the pre-clinical stage include CMAB810 for the treatment of breast cancer; CMAB813 for the treatment of severe lower respiratory tract disease in pediatric patients; CMAB816 for the treatment of periodic fever syndrome and systemic juvenile idiopathic arthritis; CMAB017 for the treatment of KRAS wild-type colorectal cancer; CMAB015, a biosimilar candidate for secukinumab to treat plaque psoriasis, psoriatic arthritis, and ankylosing spondylitis; CMAB018, a biosimilar candidate for mepolizumab, for the treatment of asthma and eosinophilic granulomatous polyangiitis, as well as CMAB020, a recombinant bispecific fusion protein, which is in under development stage. The company was founded in 2018 and is headquartered in Taizhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Taizhou",
        "zipcode": "225300",
        "website": "http://www.mabpharm.cn",
        "market_cap": 4948896256
    },
    "2269.HK": {
        "short_name": "WUXI BIO",
        "long_name": "WuXi Biologics (Cayman) Inc.",
        "summary": "WuXi Biologics (Cayman) Inc., an open-access biologics technology platform company, provides solutions to organizations to discover, develop, and manufacture biologics from concept to commercial manufacturing in the People's Republic of China, North America, Europe, and internationally. The company also engages in the provision of consultation services in relation to the biopharmaceutical technology, international sales contracting services, testing and development of testing technologies, sales and marketing services, and biologics clinical and manufacturing services; production and sales of medicals; vaccine CDMO and related business; and material supplier activities. It has strategic partnerships with Almirall, S.A.; Vir Biotechnology, Inc.; Aravive, Inc.; Tubulis GmbH; Arcus Biosciences, Inc.; AC Immune SA; and AB2 Bio Ltd. The company was incorporated in 2014 and is headquartered in Wuxi, China. WuXi Biologics (Cayman) Inc. is a subsidiary of WuXi Biologics Holdings Limited.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214092",
        "website": "http://www.wuxibiologics.com",
        "market_cap": 522058596352
    },
    "2616.HK": {
        "short_name": "CSTONE PHARMA-B",
        "long_name": "CStone Pharmaceuticals",
        "summary": "CStone Pharmaceuticals, a clinical-stage biotechnology company, focuses on developing and commercializing immuno-oncology and molecularly targeted drugs to address unmet medical needs in cancer treatment worldwide. The company's late-stage clinical products include CS1001, a monoclonal antibody against programmed death ligand 1; CS1003, a monoclonal antibody against programmed death receptor; ivosidenib, a potent inhibitor of the mutated isocitrate dehydrogenase-1 enzyme for the treatment of cancer; avapritinib, an inhibitor for the treatment of gastrointestinal stromal tumors and systematic mastocytosis; and Pralsetinib for the treatment of medullary thyroid cancer and other advanced solid tumors. Its products also comprise CS1002, CS3002, CS3003, CS3005, and CS3006 for solid tumors; Fisogatinib that is used for the treatment of hepatocellular carcinoma; and CS3004, CS1009, and CS2004 for other indications. CStone Pharmaceuticals has a licensing agreement with Numab Therapeutics AG for the development and commercialization of NM21-1480, a potential monovalent tri-specific antibody-based molecule targeting PD-L1, 4-1BB, and human serum albumin; a clinical collaboration with Bayer HealthCare LLC to evaluate CS1001 in combination with Bayer's oral multi-kinase inhibitor Stivarga, as a treatment for various types of cancer, including gastric cancer; and a strategic partnership with Burning Rock Biotech Limited to co-develop and commercialize companion diagnostics for pralsetinib, an investigational treatment for the detection of RET alterations in cancer patients. The company was founded in 2015 in Cayman Islands, and is headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.cstonepharma.com",
        "market_cap": 16882982912
    },
    "2696.HK": {
        "short_name": "HENLIUS",
        "long_name": "Shanghai Henlius Biotech, Inc.",
        "summary": "Shanghai Henlius Biotech, Inc., a biopharmaceutical company, engages in the research and development of biologic medicines with a focus on oncology, autoimmune diseases, and ophthalmic diseases worldwide. The company offers HLX01, a rituximab injection for treating non- hodgkin lymphoma and chronic lymphocytic leukemia; Hanquyou, a trastuzumab injection for breast and metastatic gastric cancer; and Han Dayuan, an adalimumab injection for rheumatoid arthritis, ankylosing spondylitis, and psopiasis and uveitis. It is developing HLX01 for the treatment of rheumatoid arthritis; HLX04 for colorectal and non-squamous non-small cell lung cancer; HLX04-O, a bevacizumab injection for wet age-related macular degeneration; HLX10 for solid tumors and hepatitis B virus; HLX10+Chemotherapy for metastatic esophageal squamous-cell carcinomas, squamous non-small cell lung cancer, small cell lung cancer, neo-/adjuvant treatment of gastric cancer, and cervical cancer; and HLX10+HLX04 for hepatocellular carcinoma, non-squamous, non-small cell lung cancer, and metastatic colorectal cancer. The company is also developing HLX10+HLX07 for squamous cell carcinoma of the head and neck; HLX07, HLX06, HLX56, and HLX20 for solid tumors; HLX05, a cetuximab injection for squamous cell carcinoma of the head and neck and metastatic colorectal cancer; HLX12 for gastric cancer, metastatic non-small cell lung cancer, and metastatic colorectal cancer; HLX22 for breast and metastatic gastric cancer; HLX55 for metastatic or recurrent solid tumors; HLX11 for breast cancer; HLX14 for osteoporosis; HLX13 for unresectable or metastatic melanoma, adjuvant treatment of melanoma, advanced renal cell carcinoma, and metastatic colorectal cancer; HLX15 for multiple myeloma; HLX26 for solid tumor and lymphoma; and HLX70 and HLX71 for COVID-19. The company was founded in 2010 and is headquartered in Shanghai, China. Shanghai Henlius Biotech, Inc. is a subsidiary of Shanghai Fosun Pharmaceutical (Group) Co., Ltd.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200233",
        "website": "http://www.henlius.com",
        "market_cap": 21322512384
    },
    "2VJ.F": {
        "short_name": "ASCLETIS PHARMA  DL-,0001",
        "long_name": "Ascletis Pharma Inc.",
        "summary": "Ascletis Pharma Inc., a biotechnology company, engages in the research and development, manufacture, marketing, and sale of pharmaceutical products in Mainland China and internationally. It offers Ganovo, a direct-acting anti-viral agent for the treatment of hepatitis C virus (HCV); Pegasys, a pegylated interferon for Hepatitis B and C virus; and Ravidasvir, a pan-genotypic NS5A inhibitor for the treatment of HCV. Its products pipeline includes ASC22, a PD-L1 single domain antibody fragment crystallizable fusion, which is in Phase II trial for the treatment of chronic Hepatitis B infection; ASC40, a Phase II-ready fatty acid synthase inhibitor for the treatment of non-alcoholic steatohepatitis (NASH); and ASC41, an oral THR-Ã\u009f agonist for the treatment of NASH. The company's products also comprise ASC09, a protease inhibitor that has completed Phase IIA clinical trial to treat human immunodeficiency virus type-1 infections; ASC06, which has completed Phase I clinical trial for treating liver cancer; and ASC21, a HCV NS5B polymerase inhibitor. In addition, it is developing therapies that are in pre-clinical trials for the treatment of hepatitis B virus and NASH. The company was incorporated in 2014 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.ascletis.com",
        "market_cap": 454719712
    },
    "300009.SZ": {
        "short_name": "ANHUI ANKE BIOTECH",
        "long_name": "Anhui Anke Biotechnology (Group) Co., Ltd.",
        "summary": "Anhui Anke Biotechnology (Group) Co., Ltd. develops, produces, and markets pharmaceutical products in China and internationally. The company offers recombinant human growth hormone for injection under the Ansomone name; and recombinant human interferon alpha 2b lyophilized powder, liquid, and prefilled syringe for injection, as well as recombinant human interferon alpha 2b cream, eye drop, and suppository under the Anterferon name. It also provides anti-sperm antibody, semen leukocyte peroxidase staining, one-time semen processing, sperm hypo-osmotic staining, sperm life detection, sperm staining detection, sperm acrosin detection, sperm DNA fragmentation staining, and leptin and immunohistochemical diagnostic kits. In addition, the company offers adhesive plasters, oral solutions, topical preparations, and ointments; peptide APIs; beauty care and anti-aging products; and synthetic drugs in the form of oral powders, dripping pills, and tablets and capsules. Further, it provides autosomal, sex chromosome, autosomal and sex chromosome combination, and other kits, as well as paternity testing set packages; tumor biological immunotherapy products; and DNA testing professional services. The company was founded in 2000 and is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230088",
        "website": "http://www.ankebio.com",
        "market_cap": 21013352448
    },
    "300049.SZ": {
        "short_name": "INNER MONGOLIA FUR",
        "long_name": "Inner Mongolia Furui Medical Science Co., Ltd.",
        "summary": "Inner Mongolia Furui Medical Science Co., Ltd. operates as a professional medical service platform company worldwide. The company provides disease diagnosis, drug treatment, and chronic disease management products in the liver disease field. It also offers health management center and medical care services. The company was formerly known as Inner Mongolia FuRui Pharmaceutical Limited Liability Company. Inner Mongolia Furui Medical Science Co., Ltd. was founded in 1998 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100027",
        "website": "http://www.fu-rui.com",
        "market_cap": 3038262016
    },
    "300122.SZ": {
        "short_name": "CHONGQING ZHIFEI B",
        "long_name": "Chongqing Zhifei Biological Products Co., Ltd.",
        "summary": "Chongqing Zhifei Biological Products Co., Ltd. engages in the research, development, manufacture, and marketing of vaccines in China. It offers Meningococcal Group A&C Conjugate Vaccine and Meningococcal Polysaccharide Vaccine for the prevention of infectious and invasive meningococcal disease, including meningitis and pneumonia caused by Neisseria meningitidis serogroups A, C; Mycobacterium Vaccae for Injection, a bidirectional immune-modulator for disease like tuberculosis; Haemophilus Influenzae Type b Conjugate Vaccine for the prevention of invasive disease caused by Haemophilus influenzae type b, such as meningitis, pneumonia, sepsis, etc.; and Meningococcal Groups A and C and Haemophilus b Conjugate Vaccine for the prevention of invasive disease caused by meningococcal groups A,C, as well as Haemophilus influenza type b comprising cerebrospinal meningitis, pneumonia, septicemia, epiglottitis, etc. The company also acts as agent for Hepatitis A vaccine; Pneumococcal vaccine; Human Papillomavirus Quadrivalent vaccine and Human Papillomavirus 9-valent vaccine for the prevention of cervical cancer, grade 1/2/3 cervical intraepithelial neoplasia, and cervical adenocarcinoma in situ caused by human papillomavirus; and Pentavalent Rotavirus vaccine for the prevention of rotavirus gastroenteritis in infants caused by the serotypes. In addition, it offers biologics for the prevention and treatment of TB and viral vaccines for the prevention of rabies, influenza, etc.; and sells generic drugs. Further, the company is involved in the marketing, import, export, and sale of biotechnologies; and provision of foreign investment and financing activities. Chongqing Zhifei Biological Products Co., Ltd. was founded in 2001 and is based in Chongqing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": null,
        "website": "http://www.zhifeishengwu.com",
        "market_cap": 309280014336
    },
    "300147.SZ": {
        "short_name": "XIANGXUE PHARMACEU",
        "long_name": "Xiangxue Pharmaceutical Co.,Ltd.",
        "summary": "Xiangxue Pharmaceutical Co., Ltd. engages in the research and development, procurement, manufacture, delivery, and distribution of pharmaceutical products in China. It offers antivirotic oral liquids under the Xiangxue brand name; and healthcare supplements, as well as health solutions, such as food and beverage. Xiangxue Pharmaceutical Co., Ltd. has strategic partnership agreement with 111, Inc. to develop the Internet + Medicine model for China's traditional Chinese medicine industry. The company was founded in 1997 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510663",
        "website": "http://www.xphcn.com",
        "market_cap": 5132161536
    },
    "300149.SZ": {
        "short_name": "CHEMPARTNER PHARMA",
        "long_name": "Chempartner Pharmatech Co., Ltd.",
        "summary": "Chempartner Pharmatech Co., Ltd. engages in the microecological nutrition and healthcare businesses worldwide. The company provides medical contract research organization, and contract development and manufacturing organization services for pre-clinical stages. It is also involved in the research, production, and sales of prebiotic fibers as a microecological fortification ingredient, ODM product, and food for special medical purposes product. The company was formerly known as Quantum Hi-Tech (China) Biological Co., Ltd. and changed its name to Quantum Hi-Tech (China) Biological Co., Ltd. in September 2020. Quantum Hi-Tech (China) Biological Co., Ltd. was founded in 2000 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.quantumbio.net.cn",
        "market_cap": 8266311680
    },
    "300181.SZ": {
        "short_name": "ZHEJIANG JOLLY PHA",
        "long_name": "Zhejiang Jolly Pharmaceutical Co.,LTD",
        "summary": "Zhejiang Jolly Pharmaceutical Co., Ltd. engages in the research, production, and marketing of Chinese medicinal products in China and internationally. The company offers Wuling capsule that is used to treat insomnia, amnesia, heart palpitations, lack of energy, lassitude in loin and legs, and giddy tinnitus, as well as deficiency of energy and weak pulse caused by the disharmony of heart and kidney, or neurasthenia. It also provides Lingze tablet, which is used to treat frequent urination, dysuria, weak steam of urine, endless urine, and soreness and weakness of waist and knees caused by benign prostatic hyperplasia, kidney deficiency, and blood stasis; and Bailing tablet that is used as the adjuvant therapy to treat cough, asthma, back pain, and chronic bronchitis, which are caused by the deficiency of lungs and kidney. In addition, the company offers Linglianhua particles for the treatment of symptoms, including sweating, insomnia, dysphoria, heart palpitations, dreaminess, giddy tinnitus, lassitude in loin and legs, dry stool, and abnormal furred tongue, as well as weak pulse caused by perimenopausal syndrome, or disharmony of heart and kidney. Further, it provides azithromycin, clindamycin phosphate, doxapram, pefloxacin mesylate, adenosine cyclophosphate, and sodium nitroprusside injections. Additionally, the company offers materials, such as cordyceps cephalosporin, fermented cordyceps, and Wuling powders. It also invests and participates in the medical services of Deqing No.3 People's Hospital. The company was formerly known as Zhejiang Jolly Pharmaceutical Health Products Co., LTD. and changed its name to Zhejiang Jolly Pharmaceutical Co., Ltd. in 1998. Zhejiang Jolly Pharmaceutical Co., Ltd. was founded in 2000 and is based in Huzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huzhou",
        "zipcode": "313200",
        "website": "http://www.zuoli.com",
        "market_cap": 4856827904
    },
    "300204.SZ": {
        "short_name": "STAIDSON (BEIJING)",
        "long_name": "Staidson (Beijing) BioPharmaceuticals Co., Ltd.",
        "summary": "Staidson (Beijing) BioPharmaceuticals Co., Ltd. primarily engages in the research and development, production, and marketing of therapeutic drugs in China. The company offers protein drugs, including therapeutic monoclonal antibody drugs; gene therapy/cell therapy drugs; and chemical drugs. It principally offers its products under the fields of nervous system related, infectious, gastrointestinal, urinary system, and autoimmune diseases. The company has a strategic collaboration with Pivotal S.L. to assess BDB-001, a monoclonal anti-C5a antibody, in a clinical trial in Europe in progressive severe COVID-19 patients caused by SARS-CoV-2. Staidson (Beijing) BioPharmaceuticals Co., Ltd. was founded in 2002 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100176",
        "website": "http://www.staidson.com",
        "market_cap": 5093574656
    },
    "300238.SZ": {
        "short_name": "GUANHAO BIOTECH CO",
        "long_name": "Guanhao Biotech Co.,Ltd.",
        "summary": "Guanhao Biotech Co.,Ltd. develops, manufactures, and markets regenerative medicine in China. It offers NormalGEN, a type of biological dura repair patch manufactured from animal tissue; GrandNeuro, an artificial dura patch for dura repairing; ThormalGEN, a biological surgical patch manufactured from animal tissue for surgical repairs; DermalGEN, a wound dressing product manufactured from animal tissue for use on burns, scalds, and wounds due to skin loss or trauma; and IREAL breast patch. The company was founded in 1999 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510530",
        "website": "http://www.guanhaobio.com",
        "market_cap": 5586836992
    },
    "300255.SZ": {
        "short_name": "HEBEI CHANGSHAN BI",
        "long_name": "Hebei Changshan Biochemical Pharmaceutical Co., Ltd.",
        "summary": "Hebei Changshan Biochemical Pharmaceutical Co., Ltd. engages in the research, development, production, and sale of heparin and related products in China. Its API products include heparin sodium injections, heparin calcium and lithium injections, heparinoid, LMW heparins, and sodium hyaluronate. The company also provides dalteparin and enoxaparin sodium injections, and nadroparin calcium injections, as well as sildenafil citrate tablets. It markets and sells its products to approximately 30 countries worldwide. Hebei Changshan Biochemical Pharmaceutical Co., Ltd. was founded in 2000 and is based in Shijiazhuang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": null,
        "website": "http://www.heparin.cn",
        "market_cap": 6217530368
    },
    "300294.SZ": {
        "short_name": "BOYA BIO-PHARMACEU",
        "long_name": "Boya Bio-pharmaceutical Group Co.,Ltd",
        "summary": "Boya Bio-pharmaceutical Group Co., Ltd. develops, produces, and sells blood products and other related health products in China. Its products include human fibrinogen, intravenous human immunoglobulin, rabies patient immunoglobulin, and human albumin. The company also provides orthopedic medications, obstetrics and gynecology, gastrointestinal medication, enhanced immunological preparations, hepatic medication, cardiovascular and cerebral medicine, diabetes medication, anticoagulation hemostatic, API, and others products. In addition, it offers chemical raw materials, such as calcium hydroxybenzenesulfonate, glimepiride, azinamide, simvastatin, and repaglinide; biochemical drugs and chemical medicines; and other products in various categories, such as orthopedics, diabetes, hepatitis, gynecology, and gut and immunomodulatory agents. Further, the company focuses on the development of release preparations and compound preparations; and offers anti-diabetic products, such as metformin hydrochloride enteric-coated tablets, pioglitazone hydrochloride dispersible tablets, glimepiride tablets, and glipizide tablets, as well as provides tablets and capsules for the treatment of diabetic retinopathy and glomerular lesions. The company was formerly known as Jiangxi Boya Bio-Pharmaceutical Co.,Ltd and changed its name to Boya Bio-pharmaceutical Group Co., Ltd. in August 2017. Boya Bio-pharmaceutical Group Co., Ltd. was founded in 1993 and is headquartered in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": null,
        "website": "http://www.china-boya.com",
        "market_cap": 16414351360
    },
    "300363.SZ": {
        "short_name": "PORTON PHARMA SOLU",
        "long_name": "Porton Pharma Solutions Ltd.",
        "summary": "Porton Pharma Solutions Ltd. manufactures and supplies drug intermediates and active pharmaceutical ingredients to the pharmaceutical companies. It also provides process development, as well as pilot and commercial scale manufacturing services. The company was formerly known as Porton Fine Chemicals Ltd. and changed its name to Porton Pharma Solutions Ltd. in January 2018. Porton Pharma Solutions Ltd. has a strategic collaboration with XtalPi Inc. to offer prediction-guided crystallization and drug solid-state research services; and a strategic cooperation agreement with Jilin Huisheng Biopharmaceutical Co. Ltd. for the development and supply of active pharmaceutical ingredients and related preparations in the therapeutic areas of diabetes and related complications. The company was founded in 2005 and is headquartered in Chongqing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": null,
        "website": "http://www.porton.cn",
        "market_cap": 41206898688
    },
    "300404.SZ": {
        "short_name": "GUANGZHOU BOJI MED",
        "long_name": "Guangzhou Boji Medical & Biotechnological Co., Ltd.",
        "summary": "Guangzhou Boji Medical & Biotechnological Co., Ltd. provides professional services in various medical study phases in China. It offers services on regulatory affairs, pre-clinical research, clinical trial phases, post marketing study, clinical trial for medical devices, data management and biostatistics, and SMO. Guangzhou Boji Medical & Biotechnological Co., Ltd. was founded in 1998 is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.bojicro.com",
        "market_cap": 2837270016
    },
    "300497.SZ": {
        "short_name": "JIANGXI FUSHINE PH",
        "long_name": "Jiangxi Fushine Pharmaceutical Co., Ltd.",
        "summary": "Jiangxi Fushine Pharmaceutical Co., Ltd. engages in the research, development, manufacture, and sale of APIs and pharmaceutical intermediates in China and internationally. The company offers penicillin, carbapenem, and other products. It also provides contract research, development, and manufacturing services. The company was formerly known as Jingdezhen Fuxiang Pharmaceutical Co., Ltd and changed its name to Jiangxi Fushine Pharmaceutical Co., Ltd. in August 2012. The company was founded in 2002 and is based in Jingdezhen, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jingdezhen",
        "zipcode": "333000",
        "website": "http://www.fushine.cn",
        "market_cap": 7177565184
    },
    "300583.SZ": {
        "short_name": "SHANDONG SITO BIO",
        "long_name": "Shandong Sito Bio-technology Co., Ltd.",
        "summary": "Shandong Sito Bio-technology Co., Ltd. researches and develops new steroid hormones, intermediates, and derivatives. Its products include cortisone acetate, ethylene deltenone, norandrostenedione, lactone, anecortave acetate, tetraene acetate, hydroxyprogesterone, and androstenedione. The company was founded in 2002 and is based in Heze, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Heze",
        "zipcode": null,
        "website": "http://www.sitobiotech.com",
        "market_cap": 2342405632
    },
    "300653.SZ": {
        "short_name": "YANTAI ZHENGHAI BI",
        "long_name": "Yantai Zhenghai Biotechnology Co., Ltd.",
        "summary": "Yantai Zhenghai Biotechnology Co., Ltd. engages in the research and development, production, and marketing of regenerative medical materials in China. It offers bone repair material, a partially deproteinised bone prepared from cancellous bones of calves after a series of treatment, such as decellularization and degreasing; oral cavity repair membrane line of products, which are used to treat defects of shallow oral cavity's soft tissue; and bio-membrane line of products that are used in neurosurgery to repair cerebral dura mater defect under the Heal-All brand name. The company also provides skin repair membrane line of products to repair wounds in dermal layer under the Heal-Full brand name. Yantai Zhenghai Biotechnology Co., Ltd. was founded in 2003 and is based in Yantai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yantai",
        "zipcode": "264006",
        "website": "http://www.zhbio.com",
        "market_cap": 7791600128
    },
    "300705.SZ": {
        "short_name": "HUNAN JIUDIAN PHAR",
        "long_name": "Hunan Jiudian Pharmaceutical Co., Ltd.",
        "summary": "Hunan Jiudian Pharmaceutical Co., Ltd. engages in the research and development, production, and sale of pharmaceutical products in China. The company offers antiallergic, anti-infective, and anti-inflammatory drugs; analgosies and gynecological medication products; digestive system products; chemical and Chinese patent medicines; medical instruments; APIs; and other products. It also provides outsourcing services for tablets, capsules, granules, oral solutions, syrups, etc. Hunan Jiudian Pharmaceutical Co., Ltd. is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": "410329",
        "website": "http://www.hnjiudian.com",
        "market_cap": 7737399808
    },
    "300759.SZ": {
        "short_name": "PHARMARON BEIJING",
        "long_name": "Pharmaron Beijing Co., Ltd.",
        "summary": "Pharmaron Beijing Co., Ltd., together with its subsidiaries, provides pharmaceutical research and development services to the life sciences industry in North America, Europe, Mainland China, rest of Asia, and internationally. The company operates through four segments: Laboratory Services; Chemistry, Manufacturing and Controls (CMC) Services; Clinical Development Services; and Others. It offers laboratory chemistry, drug metabolism and pharmacokinetics/absorption, distribution, metabolism and excretion, and in vitro biology and in vivo pharmacology services, as well as safety assessment and discovery biologics services; process development and manufacturing, material science/pre-formulation, formulation development and manufacturing, and analytical development services; and clinical research, site management, regulatory bioanalysis, and radiolabelled science services. The company also provides business development; and contract research, development, and manufacturing services for pharmaceutical products. Pharmaron Beijing Co., Ltd. was incorporated in 2004 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100176",
        "website": "http://www.pharmaron.com",
        "market_cap": 153022005248
    },
    "300841.SZ": {
        "short_name": "CHENGDU KANGHUA BI",
        "long_name": "Chengdu Kanghua Biological Products Co., Ltd.",
        "summary": "Chengdu Kanghua Biological Products Co., Ltd. engages in the research, development, production, sale, and technical service of biological products in China. It offers group ACYW135 meningococcal polysaccharide vaccines; and freeze-dried human diploid cell rabies vaccines. The company also develops seasonal influenza vaccines without preservatives, which completed phase III clinical trials; and human H5N1 influenza vaccine that completed pre-clinical studies. In addition, it exports its products. The company was founded in 2004 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610100",
        "website": "http://www.kangh.com",
        "market_cap": 18291599360
    },
    "300858.SZ": {
        "short_name": "BEIJING SCITOP BIO",
        "long_name": "Beijing Scitop Bio-tech Co., Ltd.",
        "summary": "Beijing Scitop Bio-tech Co., Ltd. develops, produces, and sells doctors' lactic acid bacteria and related products. Its products have applications in the food industry, health care, animal husbandry, and agricultural planting. The company was founded in 2003 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101407",
        "website": "http://www.scitop.cn",
        "market_cap": 5825748992
    },
    "300871.SZ": {
        "short_name": "HVSEN BIOTECHNOLOG",
        "long_name": "Hvsen Biotechnology Co., Ltd.",
        "summary": "Hvsen Biotechnology Co., Ltd. engages in the research and development, and manufacture of macrolides APIs and preparations in China and internationally. Its products include tylvalosin raw materials, various tylvalosin preparations, florfenicol preparations, and other macrolides products. The company produces various veterinary drug products of raw materials and preparations, as well as traditional Chinese medicines extractives. Hvsen Biotechnology Co., Ltd. is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430042",
        "website": "http://www.whhsyy.com",
        "market_cap": 5232506368
    },
    "300878.SZ": {
        "short_name": "ZHEJIANG WECOME PH",
        "long_name": "Zhejiang Wecome Pharmaceutical Company Limited",
        "summary": "Zhejiang Wecome Pharmaceutical Company Limited engages in the research and development, production, and sale of pharmaceutical products. The company also offers healthcare products, OTC products, and Chinese medicines. It offers products in various forms, including hard capsules, tablets, granules, soft capsules, pills, and other dosage forms. The company was formerly known as Zhejiang Weikang Pharmaceutical Co., Ltd. Zhejiang Wecome Pharmaceutical Company Limited was founded in 2000 and is based in Lishui, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lishui",
        "zipcode": "323000",
        "website": "http://www.zjwk.com",
        "market_cap": 3707438336
    },
    "300942.SZ": {
        "short_name": "SHENZHEN BIOEASY B",
        "long_name": "Shenzhen Bioeasy Biotechnology Co., Ltd.",
        "summary": "Shenzhen Bioeasy Biotechnology Co., Ltd. develops and sells rapid testing instruments and reagents in China. The company offers detection equipment for use in the fields of food, agricultural, dairy, meat, aquatic, honey, drug, and public safety, as well as clinical diagnosis. The company was founded in 2007 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518101",
        "website": "http://www.bioeasy.com",
        "market_cap": 12021791744
    },
    "300957.SZ": {
        "short_name": "YUNNAN BOTANEE BIO",
        "long_name": "Yunnan Botanee Bio-Technology Group Co.LTD",
        "summary": "Yunnan Botanee Bio-Technology Group Co.LTD manufactures and sells skincare products in China. Its products type cover cleansers and makeup removers, face masks, toners, serums, moisturizers and creams, eye cream, sprays, sun care, foundations, and body cares. The company was founded in 2010 and is based in Kunming, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": "650106",
        "website": "http://www.botanee.com.cn",
        "market_cap": 98741166080
    },
    "36X.F": {
        "short_name": "ASCENTAGE PHARM. DL-,0001",
        "long_name": "Ascentage Pharma Group International",
        "summary": "Ascentage Pharma Group International, a clinical-stage biotechnology company, engages in developing therapies for cancers, hepatitis B virus (HBV), and age-related diseases in the United States and Mainland China. Its primary product under development include HQP1351, a BCR-ABL/KIT inhibitor targeting BCR-ABL mutants, including those with the T315I mutation, as well as for the treatment of patients with tyrosine kinase inhibitors resistant/refractory GIST. The company also engages in developing APG-2575, an orally administered Bcl-2 selective inhibitor for the treatment of hematologic malignancies with Bcl-2 overexpression, including leukemia, lymphoma, and multiple myeloma; APG-1252, a small molecule drug to restore apoptosis through selective inhibition of the Bcl-2 and Bcl-xL proteins for the treatment of SCLC, lymphoma, and other solid tumors; and APG-115, an oral small molecule inhibitor of the MDM2-p53 protein-protein interaction for the treatment of solid tumors or lymphoma. In addition, it is involved in the development of APG-1387, a small molecule inhibitor of apoptosis proteins for the treatment of advanced solid tumors and chronic HBV infection; AT-101 for the treatment of chronic lymphocytic leukemia; APG-2449 for non-small-cell lung carcinoma; and HQP8361 for the treatment of cancer. Ascentage Pharma Group International has a clinical collaboration with Acerta Pharma to evaluate the combination of Bcl-2 and BTK inhibitors in patients with relapsed/refractory chronic lymphocytic leukemia and small lymphocytic lymphoma; and MSD to evaluate APG-115. The company was founded in 2009 and is headquartered in Suzhou, China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215000",
        "website": "http://www.ascentagepharma.com",
        "market_cap": 1137405952
    },
    "3759.HK": {
        "short_name": "PHARMARON",
        "long_name": "Pharmaron Beijing Co., Ltd.",
        "summary": "Pharmaron Beijing Co., Ltd., together with its subsidiaries, provides pharmaceutical research and development services to the life sciences industry in North America, Europe, Mainland China, rest of Asia, and internationally. The company operates through four segments: Laboratory Services; Chemistry, Manufacturing and Controls (CMC) Services; Clinical Development Services; and Others. It offers laboratory chemistry, drug metabolism and pharmacokinetics/absorption, distribution, metabolism and excretion, and in vitro biology and in vivo pharmacology services, as well as safety assessment and discovery biologics services; process development and manufacturing, material science/pre-formulation, formulation development and manufacturing, and analytical development services; and clinical research, site management, regulatory bioanalysis, and radiolabelled science services. The company also provides business development; and contract research, development, and manufacturing services for pharmaceutical products. Pharmaron Beijing Co., Ltd. was incorporated in 2004 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100176",
        "website": "http://www.pharmaron.com",
        "market_cap": 154048299008
    },
    "49B.F": {
        "short_name": "BEIGENE LTD",
        "long_name": "BeiGene, Ltd.",
        "summary": "BeiGene, Ltd., a commercial-stage biotechnology company, engages in discovering, developing, manufacturing, and commercializing medicines for cancer therapeutics in the People's Republic of China and the United States. Its commercial products include BRUKINSA to treat relapsed/refractory (R/R) mantle cell lymphoma; Tislelizumab to treat R/R classical Hodgkin's lymphoma; ABRAXANE to treat breast cancer; REVLIMID to treat multiple myeloma; VIDAZA to treat myelodysplastic syndromes, chronic myelomonocyte leukemia, and acute myeloid leukemia; XGEVA to treat giant cell tumor of bone; BLINCYTO to treat acute lymphoblastic leukemia; KYPROLIS to treat R/R multiple myeloma; SYLVANT to treat idiopathic multicentric castleman disease; QARZIBA to treat neuroblastoma; Pamiparib for the treatment of various solid tumors; and BAT1706 to treat metastatic colorectal cancer, liver cancer, and non-small cell lung cancer (NSCLC). The company's clinical stage drug candidates comprise Zanubrutinib, a BTK inhibitor to treat various lymphomas; Tislelizumab, an anti-PD-1 antibody to treat various solid and hematological cancers; Lifirafenib and BGB-3245 to treat various malignancies, such as melanoma, NSCLC, and endometrial cancer; and Sitravatinib, a multi-kinase inhibitor to treat NSCLC, melanoma, and other solid tumors. Its clinical stage drug candidates also include BGB-A333, a PD-L1 inhibitor to treat various solid tumors; Ociperlimab, a TIGIT inhibitor to treat various solid tumors; BGB-11417, a small molecule Bcl-2 inhibitor to treat mature B-cell malignancies; BGB-A445, an OX40 agonist antibody to treat solid tumors; Zanidatamab, a bispecific HER2 inhibitor to treat breast and gastric cancer; BGB-A425, a T-cell immunoglobulin and mucin-domain containing-3 inhibitor to treat various solid tumors; and BGB-15025, a small molecule inhibitor of HPK1. The company was incorporated in 2010 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102206",
        "website": "http://www.beigene.com",
        "market_cap": 24456751104
    },
    "49BA.F": {
        "short_name": "BEIGENE LTD SP.ADR",
        "long_name": "BeiGene, Ltd.",
        "summary": "BeiGene, Ltd., a commercial-stage biotechnology company, engages in discovering, developing, manufacturing, and commercializing medicines for cancer therapeutics in the People's Republic of China and the United States. Its commercial products include BRUKINSA to treat relapsed/refractory (R/R) mantle cell lymphoma; Tislelizumab to treat R/R classical Hodgkin's lymphoma; ABRAXANE to treat breast cancer; REVLIMID to treat multiple myeloma; VIDAZA to treat myelodysplastic syndromes, chronic myelomonocyte leukemia, and acute myeloid leukemia; XGEVA to treat giant cell tumor of bone; BLINCYTO to treat acute lymphoblastic leukemia; KYPROLIS to treat R/R multiple myeloma; SYLVANT to treat idiopathic multicentric castleman disease; QARZIBA to treat neuroblastoma; Pamiparib for the treatment of various solid tumors; and BAT1706 to treat metastatic colorectal cancer, liver cancer, and non-small cell lung cancer (NSCLC). The company's clinical stage drug candidates comprise Zanubrutinib, a BTK inhibitor to treat various lymphomas; Tislelizumab, an anti-PD-1 antibody to treat various solid and hematological cancers; Lifirafenib and BGB-3245 to treat various malignancies, such as melanoma, NSCLC, and endometrial cancer; and Sitravatinib, a multi-kinase inhibitor to treat NSCLC, melanoma, and other solid tumors. Its clinical stage drug candidates also include BGB-A333, a PD-L1 inhibitor to treat various solid tumors; Ociperlimab, a TIGIT inhibitor to treat various solid tumors; BGB-11417, a small molecule Bcl-2 inhibitor to treat mature B-cell malignancies; BGB-A445, an OX40 agonist antibody to treat solid tumors; Zanidatamab, a bispecific HER2 inhibitor to treat breast and gastric cancer; BGB-A425, a T-cell immunoglobulin and mucin-domain containing-3 inhibitor to treat various solid tumors; and BGB-15025, a small molecule inhibitor of HPK1. The company was incorporated in 2010 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102206",
        "website": "http://www.beigene.com",
        "market_cap": 27815559168
    },
    "4RY.F": {
        "short_name": "AKESO INC.  O.N.",
        "long_name": "Akeso, Inc.",
        "summary": "Akeso, Inc., a clinical-stage biopharmaceutical company, engages in discovery, development and commercialization of therapies. The company develops AK104, a PD-1/CTLA-4 bi-specific antibody for tumor infiltrating lymphocytes, which is in Phase Ia/Ib trial in Australia, and five Phase Ib/II and Phase II trials in China; Penpulimab AK105, a monoclonal antibody that is in Phase III clinical trials for squamous and non-squamous NSCLC, as well as Phase II clinical trial for relapsed/refractory classical hodgkin's lymphoma; and AK112, a PD-1/VEGF bi-specific antibody that is in a Phase I clinical study for the treatment of solid tumors. It is also developing AK101, a monoclonal antibody, which is in Phase IIb clinical trial to treat severe psoriasis patients; AK111, a monoclonal antibody for autoimmune disease target IL-17; and Ebronucimab (AK102) for the treatment of cardiovascular diseases. The company has collaboration agreements with Merck; Sino Biopharm; Dawnrays Pharma; and Zhongshan Health Technology Industrial Base Development Co., Ltd. and Torch Development Zone Linhai Industry Park Development Co., Ltd. Akeso, Inc. was founded in 2012 and is headquartered in Zhongshan, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Zhongshan",
        "zipcode": "528437",
        "website": "http://www.akesobio.com",
        "market_cap": 5603302400
    },
    "5DG.F": {
        "short_name": "OCUMENSION THER.DL-,00001",
        "long_name": "Ocumension Therapeutics",
        "summary": "Ocumension Therapeutics operates as an ophthalmic pharmaceutical platform company in the People's Republic of China. The company researches and develops, manufactures, and commercializes ophthalmic drugs. It offers drugs for the treatment of blepharitis, infective conjunctivitis, allergic conjunctivitis, dry eye, cataract, glaucoma, uveitis, age-related macular degeneration, and myopia. The company was founded in 2017 and is headquartered in Suzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": null,
        "website": "http://www.ocumension.com",
        "market_cap": 2049182464
    },
    "5HB.F": {
        "short_name": "SHAGHAI HAOH.BI.TE.H YC 1",
        "long_name": "Shanghai Haohai Biological Technology Co., Ltd.",
        "summary": "Shanghai Haohai Biological Technology Co., Ltd. engages in the research, development, manufacture, and sale of biomedical materials in Mainland China, the United States, the United Kingdom, and internationally. The company offers ophthalmology, medical aesthetics and wound care, orthopedics, anti-adhesion, and homostasis products. It also provides medical sodium hyaluronate, medical chitosan, medical collagen sponge, and recombinant human epidermal growth factor (rhEGF), as well as biological reagents and materials. In addition, the company engages in the manufacture and sale of contact lens and intraocular lens materials, machines, and accessories; and investment and trading businesses. Further, it is involved in research and development of biological engineering and pharmaceutical products, as well as in the provision of related technology transfer, and consultation services. The company was formerly known as Haohai Limited and changed its name to Shanghai Haohai Biological Technology Co., Ltd. in 2010. Shanghai Haohai Biological Technology Co., Ltd. was founded in 2007 and is headquartered in Shanghai, China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.3healthcare.com",
        "market_cap": 3043216128
    },
    "600161.SS": {
        "short_name": "BEIJING TIANTAN BIOLOGICAL PROD",
        "long_name": "Beijing Tiantan Biological Products Co., Ltd.",
        "summary": "Beijing Tiantan Biological Products Co., Ltd. engages in the research and development, manufacture, and sale and consulting of blood products in China. Its products include blood intravenous injection immunoglobulin; blood human albumin; blood injection immunoglobulin; hepatitis B, freeze-dried hepatitis B, and tetanus human immunoglobulin; and human immunoglobulin. The company was founded in 1998 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100024",
        "website": "http://www.tiantanbio.com",
        "market_cap": 44216078336
    },
    "600200.SS": {
        "short_name": "JIANGSU WUZHONG PHARMACEUTICAL ",
        "long_name": "JiangSu WuZhong Pharmaceutical Development Co., Ltd.",
        "summary": "JiangSu WuZhong Pharmaceutical Development Co., Ltd., together with its subsidiaries, engages in pharmaceutical, real estate, and chemical businesses in China. It develops, produces, and sells anti-infective, digestive system, cardiovascular, cerebrovascular, antiviral, vitamin, and hemostatic drugs; and immunomodulations, including biopharmaceuticals, chemical drugs, and modern Chinese medicines. The company offers its products in various forms, such as infusion solutions, water and powder injections, capsules, granules, tablets, emulsions, and oral liquids. It also engages in the research, development, production, and sale of dyes and dye intermediates; and the fields of commercial housing and affordable housing development. The company was founded in 1994 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215128",
        "website": "http://www.600200.com",
        "market_cap": 5399908352
    },
    "600201.SS": {
        "short_name": "JINYU BIO-TECHNOLOGY CO LTD",
        "long_name": "Jinyu Bio-technology Co., Ltd.",
        "summary": "Jinyu Bio-technology Co., Ltd. engages in the development, production, and sale of veterinary vaccines in China. The company was formerly known as Inner Mongolia Jinyu Group Co., Ltd. and changed its name to Jinyu Bio-technology Co., Ltd. in December 2015. Jinyu Bio-technology Co., Ltd. was founded in 1992 and is based in Hohhot, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hohhot",
        "zipcode": "010030",
        "website": "http://www.jinyu.com.cn",
        "market_cap": 20508829696
    },
    "600645.SS": {
        "short_name": "ZHONGYUAN UNION CELL & GENE ENG",
        "long_name": "Vcanbio Cell & Gene Engineering Corp., Ltd",
        "summary": "Vcanbio Cell & Gene Engineering Corp., Ltd, together with its subsidiaries, primarily engages in the detection and storage of stem cell sources in the People's Republic of China. The company is involved in the storage of newborns and adults cells; and preparation and storage of cord blood hematopoietic stem cells, umbilical cord mesenchymal stem cells, placental pluripotent stem cells, and adipose-derived stem cells and immune cells. It also provides genetic testing services related to children's genes, non-invasive prenatal genes, oncology and cardiovascular genes, and adult susceptibility genes. In addition, the company produces and sells biochemical diagnostic reagents; and beauty and make-up products. Vcanbio Cell & Gene Engineering Corp., Ltd is based in Tianjin, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300384",
        "website": "http://www.vcanbio.com",
        "market_cap": 11230775296
    },
    "600866.SS": {
        "short_name": "STAR LAKE BIOSCIENCE CO INC Z",
        "long_name": "Star Lake Bioscience Co., Inc.Zhaoqing Guangdong",
        "summary": "Star Lake Bioscience Co., Inc. manufactures and sells pharmaceutical raw materials, and food and feed additives in China and internationally. The company offers guanosine that is used as an intermediate for food and pharmaceutical raw material; L-proline for use as an intermediate for synthesizing captopril and enalapril, and raw material for amino acid transfusion; adefovir dipivoxil tablets used to reduce the activity of HBV DNA polymerase and anti-virus by destroying Hepatitis B virus DNA; and L-threonine that is used in premixtures, and pig and poultry feed. It also provides disodium 5'-ribonucleotide to cure chronic hepatitis, muscular atrophy, and eye diseases; disodium 5-inosinate to cure leukopenia, thrombocytopenia, and chronic and acute hepatitis; and inosine, which is used for the treatment of chronic hepatitis, heart disease, leukopenia or thrombocytopenia, central choroidoretinitis, etc. In addition, the company offers disodium 5'-guanylate for canned meat, ham, salted meat, etc. Further, it provides ribavirin, adenosine, adenine, memantine hydrochloride, arginine, D-ribose, fructose syrup, L-valine, L-threonine, L-lysine, etc. The company offers its products under the Star Lake and Yue Bao brands. Star Lake Bioscience Co., Inc. was founded in 1964 and is based in Zhaoqing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhaoqing",
        "zipcode": "526040",
        "website": "http://www.starlake.com.cn",
        "market_cap": 2963466496
    },
    "603229.SS": {
        "short_name": "ZHEJIANG AUSUN PHARMACEUTICAL C",
        "long_name": "Zhejiang Ausun Pharmaceutical Co., Ltd.",
        "summary": "Zhejiang Ausun Pharmaceutical Co., Ltd. develops, produces, and sells specialty drug substances and pharmaceutical intermediates. The company offers prostaglandins and its intermediates; APIs; fluorine and antibacterial products; and intermediates. It also provides products for liver disease, respiratory system, and cardiovascular and cerebrovascular, as well as entecavir for the treatment of hepatitis B. In addition, the company is involved in the customized processing, and research and development business. Zhejiang Ausun Pharmaceutical Co., Ltd. was founded in 2010 is headquartered in Linhai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Linhai",
        "zipcode": "317016",
        "website": "http://www.ausunpharm.com",
        "market_cap": 8539654144
    },
    "603233.SS": {
        "short_name": "DASHENLIN PHARMACEUTICAL GROUP ",
        "long_name": "DaShenLin Pharmaceutical Group Co., Ltd.",
        "summary": "DaShenLin Pharmaceutical Group Co., Ltd. manufactures, wholesales, and retails pharmaceutical products in China. The company was founded in 1999 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.dslyy.com",
        "market_cap": 35282325504
    },
    "603392.SS": {
        "short_name": "BEIJING WANTAI BIOLOGICAL PHARM",
        "long_name": "Beijing Wantai Biological Pharmacy Enterprise Co., Ltd.",
        "summary": "Beijing Wantai Biological Pharmacy Enterprise Co., Ltd. researches, develops, produces, distributes, and sells infectious disease diagnostic reagents and vaccines in China and internationally. The company provides COVID 19, HIV and HTLV, Hepatitis, EV-71, and Tuberculosis diagnostics test kits; Hepatitis C and Syphilis detection reagents; automated immunoassays; ELISA kits and rapid tests for infectious disease diagnostics; chemiluminescence and clinical chemistry reagents; immunodiagnostic reagents; and Hepatitis E and human papillomavirus vaccines. It serves blood banks, hospitals and clinics, reference laboratories, border inspection centers, blood-processing companies, and research institutes. The company was founded in 1991 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102206",
        "website": "http://www.ystwt.com",
        "market_cap": 105147998208
    },
    "603439.SS": {
        "short_name": "GUIZHOU SANLI PHARMACEUTICAL CO",
        "long_name": "GuiZhou SanLi Pharmaceutical Co., Ltd.",
        "summary": "GuiZhou SanLi Pharmaceutical Co.,LTD. engages in the research and development, production, and marketing of pharmaceutical products. It offers pediatric medication, respiratory system medication, cardiovascular and cerebrovascular drugs, digestive medicine, trauma injury medication, rehabilitation medicine, and ophthalmic medicine. The company was founded in 1995 and is based in Guiyang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guiyang",
        "zipcode": "561100",
        "website": "http://www.gz-sanli.com",
        "market_cap": 5906168832
    },
    "603566.SS": {
        "short_name": "PULIKE BIOLOGICAL",
        "long_name": "Pulike Biological Engineering, Inc.",
        "summary": "Pulike Biological Engineering, Inc. engages in the research and development, production, and operation of veterinary biological products and drugs. It offers vaccines and antibodies for poultry; and poultry and pig medicines, as well as other medicines. The company is headquartered in Luoyang City, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Luoyang City",
        "zipcode": "471000",
        "website": "http://en.pulike.com.cn",
        "market_cap": 8159568384
    },
    "603590.SS": {
        "short_name": "BEIJING KONRUNS PHARMACEUTICAL ",
        "long_name": "Beijing Konruns Pharmaceutical Co.,Ltd.",
        "summary": "Beijing Konruns Pharmaceutical Co.,Ltd. engages in the research, production, and sale of various drugs. The company offers Haemocoagulase Agkistrodon used in auxiliary stopping of capillary hemorrhage on superficial wound in surgical operation; GuShuKang Keli and GuShuKang Jiaonang products for osteoporosis; Fangshen Zhiyang Keli for acute hives of wind-heat syndrome; Siyu Yangxue Yishen to alleviate waist/knee soreness, listlessness, palpitation, and dyspnea in climacteric women; Qingxuan Zhitan Wan for symptoms caused by liver-yang hyperactivity and liver-fire flaming; Xiaoaiping Pian for esophagus, stomach, and lung cancer; and Guchi Xiaotong Jiaonang for hyperosteogeny rheumarthritis, and rheumatalgia. It also provides Liganlong Keli for acute/chronic, persistent, and chronic active hepatitis; Naoluotong Jiaonang for various cerebrovascular diseases and symptoms caused by qi deficiency and blood stasis; Compound Bismuth Aluminate Tablet for chronic gastritis, and the symptoms caused by hyperacidity; Shenshi Tong Keli for stones in kidney, renal pelvis, urinary bladder, and ureter; Naoxueshuan Pian to prevent and treat the stroke; and Kanggan Jiedu Keli for wind-heat cold. In addition, the company offers calcium carbonate capsules; Fosfomycin Calcium Capsule to lower urinary tract infection and intestinal infection; Yansheqing Keli for respiratory tract inflammation, bronchitis, pneumonia, acute tonsillitis, urinary system infection, and biliary tract infection; Sanqi Zhixue Pian to disperse blood stasis, stop bleeding, subside swelling, and relieve pain; Da Feng Wan for waist/leg soreness, limb numbness, and tendon/bone soreness; Yankening Pian to clear away heat, purge intense fire, diminish inflammation and relieve dysentery; Kudancao Jiaonang to eliminate dampness, and purge fire in liver and gallbladder; and Tongmai Pian to invigorate blood circulation and dredge channels. The company was founded in 1999 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100085",
        "website": "http://www.konruns.cn",
        "market_cap": 6024000000
    },
    "603718.SS": {
        "short_name": "SHANGHAI HILE BIO-",
        "long_name": "Shanghai Hile Bio-Technology Co., Ltd.",
        "summary": "Shanghai Hile Bio-Technology Co., Ltd. researches, develops, produces, and sells veterinary biological products for livestock and poultry in China. The company offers porcine parvovirus oil emulsion inactivated vaccines, Pseudorabies live vaccines, Streptococcus suis disease inactivated vaccines, Trivalent live vaccines, swine blast vaccines, porcine reproductive and respiratory syndrome vaccines, Piglet Escherichia coli K88/K99 Bivalent gene engineering inactivated vaccines, swine atrophic rhinitis inactivated vaccines, pig infectious gastroenteritis and porcine epidemic diarrhea inactivated vaccines, porcine circovirus type 2 inactivated vaccines, and porcine encephalitis live vaccines. It also provides newcastle disease low virulent live vaccines; newcastle disease, infectious bronchitis, and Avian Influenza triple inactivated vaccines; newcastle disease, infectious bronchitis, and egg drop syndrome triple inactivated oil emulsion vaccines; avian infectious bronchitis live vaccines; newcastle disease and avian infectious bronchitis combined living vaccines; newcastle disease inactivated vaccines; newcastle disease low virulent live vaccines; chicken Marek's disease turkey herpes virus live vaccines; chicken pox live vaccines; duck plague live vaccines; chicken newcastle disease, infectious bronchitis, egg drop syndrome, and avian influenza quadruple inactivated vaccines; newcastle disease and Avian Influenza inactivated vaccines; chicken infectious rhinitis inactivated vaccines; chicken infectious bursal disease live vaccines; and chicken infectious rhinitis and newcastle disease inactivated vaccines, as well as various other live and inactivated vaccines. The company was founded in 1981 and is based in Shanghai, China. Shanghai Hile Bio-Technology Co., Ltd. is a subsidiary of Shanghai Haoyuan Science And Technology Development Co., Ltd.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201403",
        "website": "http://www.hile-bio.com",
        "market_cap": 9885400064
    },
    "603739.SS": {
        "short_name": "QINGDAO VLAND BIOTECH CO LTD",
        "long_name": "Qingdao Vland Biotech INC.",
        "summary": "Qingdao Vland Biotech INC. engages in the research and development of enzymes, probiotics, and animal vaccines and health products. It offers animal feed, industrial, and food enzymes; and probiotics, including aquaculture premixes, health products, and animal and plant probiotics. The company also offers animal vaccines and biological products, such as live and inactivated poultry, and swine vaccines, as well as antibodies; poultry drugs comprising anti-parastic, antiviral, and nutritional drugs, as well as disinfectants; and traditional Chinese veterinary medicines for scale and avian breeding, livestock, and laying hens. It serves agriculture, animal husbandry, textile, paper making, household cleaning and detergents, food, biofuel, environmental protection, and other industries. The company was founded in 2005 and is headquartered in Qingdao, China. Qingdao Vland Biotech INC. is a subsidiary of Qingdao Kangdien Industrial Co., Ltd.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": "266061",
        "website": "http://www.vlandgroup.com",
        "market_cap": 4406092288
    },
    "603896.SS": {
        "short_name": "ZHEJIANG SHOUXIANGU PHARMACEUTI",
        "long_name": "Zhejiang Shouxiangu Pharmaceutical Co., Ltd.",
        "summary": "Zhejiang Shouxiangu Pharmaceutical Co., Ltd. researches, develops, and sells Chinese medicine products. It offers ganoderma lucidum spore powder, dendrobium officinale, crocus sativus, and other health products. The company was founded in 1997 and is based in Jinhua, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinhua",
        "zipcode": null,
        "website": "http://www.sxg1909.com",
        "market_cap": 5574708736
    },
    "605116.SS": {
        "short_name": "AURISCO PHARMACEUTICAL CO LTD",
        "long_name": "Aurisco Pharmaceutical Co.,Ltd.",
        "summary": "Aurisco Pharmaceutical Co.,Ltd. engages in research, manufacturing, and marketing of intermediates, specialty active pharmaceutical ingredients (API's), and formulations catering to the pharmaceutical market worldwide. The company offers steroids, oncology, antiretroviral, and other APIs and intermediates. It also provides contract manufacturing services and related development works for chemicals, intermediates, and API's. Aurisco Pharmaceutical Co.,Ltd. was founded in 1998 and is headquartered in Tiantai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tiantai",
        "zipcode": "317200",
        "website": "http://www.aurisco.com",
        "market_cap": 5786429952
    },
    "605199.SS": {
        "short_name": "HAINAN HULUWA PHARMACEUTICAL GR",
        "long_name": "Hainan Huluwa Pharmaceutical Group Co., Ltd.",
        "summary": "Hainan Huluwa Pharmaceutical Group Co., Ltd. engages in the research and development, production, and sale of drugs in the areas of Children's respiratory and digestive systems in China. Its primary products include 4 grams of pediatric lung heat cough granules and capsules. The company was founded in 2005 and is based in Haikou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Haikou",
        "zipcode": "570300",
        "website": "http://www.huluwayaoye.com",
        "market_cap": 11783209984
    },
    "6160.HK": {
        "short_name": "BEIGENE",
        "long_name": "BeiGene, Ltd.",
        "summary": "BeiGene, Ltd., a commercial-stage biotechnology company, engages in discovering, developing, manufacturing, and commercializing medicines for cancer therapeutics in the People's Republic of China and the United States. Its commercial products include BRUKINSA to treat relapsed/refractory (R/R) mantle cell lymphoma; Tislelizumab to treat R/R classical Hodgkin's lymphoma; ABRAXANE to treat breast cancer; REVLIMID to treat multiple myeloma; VIDAZA to treat myelodysplastic syndromes, chronic myelomonocyte leukemia, and acute myeloid leukemia; XGEVA to treat giant cell tumor of bone; BLINCYTO to treat acute lymphoblastic leukemia; KYPROLIS to treat R/R multiple myeloma; SYLVANT to treat idiopathic multicentric castleman disease; QARZIBA to treat neuroblastoma; Pamiparib for the treatment of various solid tumors; and BAT1706 to treat metastatic colorectal cancer, liver cancer, and non-small cell lung cancer (NSCLC). The company's clinical stage drug candidates comprise Zanubrutinib, a BTK inhibitor to treat various lymphomas; Tislelizumab, an anti-PD-1 antibody to treat various solid and hematological cancers; Lifirafenib and BGB-3245 to treat various malignancies, such as melanoma, NSCLC, and endometrial cancer; and Sitravatinib, a multi-kinase inhibitor to treat NSCLC, melanoma, and other solid tumors. Its clinical stage drug candidates also include BGB-A333, a PD-L1 inhibitor to treat various solid tumors; Ociperlimab, a TIGIT inhibitor to treat various solid tumors; BGB-11417, a small molecule Bcl-2 inhibitor to treat mature B-cell malignancies; BGB-A445, an OX40 agonist antibody to treat solid tumors; Zanidatamab, a bispecific HER2 inhibitor to treat breast and gastric cancer; BGB-A425, a T-cell immunoglobulin and mucin-domain containing-3 inhibitor to treat various solid tumors; and BGB-15025, a small molecule inhibitor of HPK1. The company was incorporated in 2010 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102206",
        "website": "http://www.beigene.com",
        "market_cap": 256472580096
    },
    "6600.HK": {
        "short_name": "SCICLONE PHARMA",
        "long_name": "SciClone Pharmaceuticals (Holdings) Limited",
        "summary": "SciClone Pharmaceuticals (Holdings) Limited, a biopharmaceutical company, engages in the development and commercialization pharmaceutical products in the therapeutic areas of oncology and severe infection in Mainland China and internationally. The company's proprietary product is Zadaxin, a thymalfasin for Injection. Its in-licensed products include Angiomax, an anticoagulant for use in patients undergoing percutaneous coronary intervention comprising patients with heparin-induced thrombocytopenia and thrombosis syndrome; and Zometa for the treatment of patients with multiple myeloma and patients with documented bone metastases from solid tumors, and hypercalcemia of malignancy. The company also sells promotion products on behalf of its business partners. SciClone Pharmaceuticals (Holdings) Limited was founded in 1990 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.sciclone.com",
        "market_cap": 9856287744
    },
    "6622.HK": {
        "short_name": "ZHAOKE OPHTH-B",
        "long_name": "Zhaoke Ophthalmology Limited",
        "summary": "Zhaoke Ophthalmology Limited, an ophthalmic pharmaceutical company, engages in the research, development, and commercialization of therapies that address unmet medical needs in the People's Republic of China. It is developing various drugs that cover ophthalmic indications affecting the anterior and posterior segments, including dry eye diseases, wet age-related macular degeneration, diabetic macular edema, myopia, and glaucoma. The company was formerly known as China Ophthalmology Focus Limited. Zhaoke Ophthalmology Limited was incorporated in 2017 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.zkoph.com",
        "market_cap": 6721547264
    },
    "67N.F": {
        "short_name": "JHBP (CY) HLDGS DL-,00002",
        "long_name": "JHBP (CY) Holdings Limited",
        "summary": "JHBP (CY) Holdings Limited, a biopharmaceutical company, focuses on developing and commercializing oncology and autoimmune drugs in China and internationally. The company's principal drug candidates include GB491 (lerociclib), an oral CDK4/6 inhibitor for treating hormone receptor-positive (HR+)/HER2- breast cancer; GB221, a herceptin (trastuzumab)-mimic HER2 monoclonal antibody (mAb) drug candidate; geptanolimab (GB226), a novel PD-1 mAb drug candidate; GB492, a stimulator of interferon genes (STING) agonist expected to exert synergistic effects in combination with GB226 for solid tumors; GB242, an infliximab (Remicade) biosimilar; and GB223, a receptor activator of nuclear factor-B Ligand (RANKL) mAb drug candidate. JHBP (CY) Holdings Limited was founded in 2007 and is headquartered in Shanghai, China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.genorbio.com",
        "market_cap": null
    },
    "6826.HK": {
        "short_name": "HAOHAI BIOTEC",
        "long_name": "Shanghai Haohai Biological Technology Co., Ltd.",
        "summary": "Shanghai Haohai Biological Technology Co., Ltd. engages in the research, development, manufacture, and sale of biomedical materials in Mainland China, the United States, the United Kingdom, and internationally. The company offers ophthalmology, medical aesthetics and wound care, orthopedics, anti-adhesion, and homostasis products. It also provides medical sodium hyaluronate, medical chitosan, medical collagen sponge, and recombinant human epidermal growth factor (rhEGF), as well as biological reagents and materials. In addition, the company engages in the manufacture and sale of contact lens and intraocular lens materials, machines, and accessories; and investment and trading businesses. Further, it is involved in research and development of biological engineering and pharmaceutical products, as well as in the provision of related technology transfer, and consultation services. The company was formerly known as Haohai Limited and changed its name to Shanghai Haohai Biological Technology Co., Ltd. in 2010. Shanghai Haohai Biological Technology Co., Ltd. was founded in 2007 and is headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.3healthcare.com",
        "market_cap": 30046056448
    },
    "6855.HK": {
        "short_name": "ASCENTAGE-B",
        "long_name": "Ascentage Pharma Group International",
        "summary": "Ascentage Pharma Group International, a clinical-stage biotechnology company, engages in developing therapies for cancers, hepatitis B virus (HBV), and age-related diseases in the United States and Mainland China. Its primary product under development include HQP1351, a BCR-ABL/KIT inhibitor targeting BCR-ABL mutants, including those with the T315I mutation, as well as for the treatment of patients with tyrosine kinase inhibitors resistant/refractory GIST. The company also engages in developing APG-2575, an orally administered Bcl-2 selective inhibitor for the treatment of hematologic malignancies with Bcl-2 overexpression, including leukemia, lymphoma, and multiple myeloma; APG-1252, a small molecule drug to restore apoptosis through selective inhibition of the Bcl-2 and Bcl-xL proteins for the treatment of SCLC, lymphoma, and other solid tumors; and APG-115, an oral small molecule inhibitor of the MDM2-p53 protein-protein interaction for the treatment of solid tumors or lymphoma. In addition, it is involved in the development of APG-1387, a small molecule inhibitor of apoptosis proteins for the treatment of advanced solid tumors and chronic HBV infection; AT-101 for the treatment of chronic lymphocytic leukemia; APG-2449 for non-small-cell lung carcinoma; and HQP8361 for the treatment of cancer. Ascentage Pharma Group International has a clinical collaboration with Acerta Pharma to evaluate the combination of Bcl-2 and BTK inhibitors in patients with relapsed/refractory chronic lymphocytic leukemia and small lymphocytic lymphoma; and MSD to evaluate APG-115. The company was founded in 2009 and is headquartered in Suzhou, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215000",
        "website": "http://www.ascentagepharma.com",
        "market_cap": 11208529920
    },
    "688068.SS": {
        "short_name": "BEIJING HOTGEN BIOTECH CO LTD",
        "long_name": "Beijing Hotgen Biotech Co., Ltd.",
        "summary": "Beijing Hotgen Biotech Co., Ltd. develops, manufactures, and sells in-vitro diagnostic (IVD), point-of-care-testing (POCT) and biodefense products worldwide. Its IVD products include instruments and kits for aiding diagnosis in cardiovascular diseases, chronic liver diseases, tumor screening and risk stratification, kidney injury, rheumatoid arthritis, infection, infectious diseases, and risk assessment of preterm labor. The company's biodefense and food safety product line covers various bioterrorist agents, including Yersinia pestis, Anthrax, Brucella, Ricin, Abrin, etc.; and various food borne pathogenic bacteria, such as cholera, E. coli, salmonella, etc. Its biodefense products are used for military anti-bioterrorism campaign, customs inspection and quarantine, on-site inspection in centers for disease control, mobile bio-emergency inspection, on-site detection of food-borne pathogenic microorganisms, etc. Beijing Hotgen Biotech Co., Ltd. was founded in 2005 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102600",
        "website": "http://www.hotgen.com.cn",
        "market_cap": 9925285888
    },
    "688166.SS": {
        "short_name": "BRIGHTGENE BIO-MEDICAL TECHNOLO",
        "long_name": "BrightGene Bio-Medical Technology Co., Ltd.",
        "summary": "BrightGene Bio-Medical Technology Co., Ltd., a biopharmaceutical company, engages in the research and development, manufacture, and commercialization of medicines, and generic APIs and FDFs in China. Its product pipeline includes immuno-oncological therapeutic agents, orally available GLP-1RA peptides for type 2 diabetes, antibody drug conjugates for solid tumor, and novel non-antibody dependent tumor targeting conjugates for brain cancer and solid tumor brain-metastasis. The company also develops Eribulin, Trabectedin, Fondaparinux, Caspofungin, and non-biological molecules; macromolecules, such as Ferumoxytol and Ferric pyrophosphate citrate; and ADC cytotoxic payloads comprising Maytansinoids, Auristatins, and Calicheamicin. It offers cardiovascular, antibacterial, ADC, oncology, antifungal, iron supplement, anti-HBV, veterinary, and immuno products. The company was founded in 2001 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215123",
        "website": "http://www.bright-gene.com",
        "market_cap": 18429499392
    },
    "688180.SS": {
        "short_name": "SHANGHAI JUNSHI BIOSCIENCES CO ",
        "long_name": "Shanghai Junshi Biosciences Co., Ltd.",
        "summary": "Shanghai Junshi Biosciences Co., Ltd., a biopharmaceutical company, engages in the discovery, development, and commercialization of various drugs in the therapeutic areas of oncology, metabolic, auto-immunity, neurologic, and infectious diseases in the People's Republic of China. The company offers JS001, a recombinant humanized anti-PD-1 monoclonal antibody under the trade name of TUOYIR for the indication of melanoma, mucosal melanoma, soft tissue sarcoma, nasopharyngeal carcinoma, urothelial carcinoma, non-small cell lung carcinoma, triple negative breast carcinoma, esophageal squamous cell carcinoma, and hepatocellular carcinoma. It is also developing UBP1211, a biosimilar of Humira for the treatment of rheumatoid arthritis, ankylosing spondylitis, and psoriasis arthritis; JS002, a recombinant humanized anti-PCSK9 monoclonal antibody for treating hyperlipidemia; UBP1213, a recombinant humanized anti-BLyS monoclonal antibody for injection. In addition, the company is developing JS501, a biosimilar of Avastin; and JS003, a recombinant humanized anti-PD-L1 monoclonal antibody for injection; JS101, a pan-CDK inhibitor; TAB004/JS004, a recombinant humanized anti-BTLA monoclonal antibody for injection; and JS005, a recombinant humanized anti-IL-17A monoclonal antibody for injection. It has an agreement with Eli Lilly and Company to co-develop therapeutic antibodies for the potential prevention and treatment of COVID-19, the disease caused by the SARS-CoV-2 novel coronavirus; collaboration with Merck & Co., Inc. to explore new combination treatment for head and neck cancer patients, as well as Coherus Biosciences, Inc. for the development and commercialization of toripalimab, Junshi Biosciences' anti-PD-1 antibody; and a research collaboration and license agreement with Revitope Oncology Inc to explore immunotherapies with precision-targeted T-cell engaging antibodies. The company was founded in 2012 and is headquartered in Shanghai, People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.junshipharma.com",
        "market_cap": 72109056000
    },
    "688202.SS": {
        "short_name": "SHANGHAI MEDICILON INC",
        "long_name": "Shanghai Medicilon Inc.",
        "summary": "Shanghai Medicilon Inc., a drug discovery contract research organization, provides drug discovery and development services to pharmaceutical and biotechnology companies in China and internationally. It offers chemistry services, including medicinal, synthesis, and analytical chemistry services, as well as process development services; and drug formulation services, such as pre-formulation and analytical development services, as well as research on quality control and clinical trial material services. The company also provides biology services comprising recombinant protein, crystallization and structural, discovery biology, computational biology and molecular modeling, and kinase services, as well as prepackaged M9 selenomethionine growth media kits and packages for growing cell culture in IPTG-inducible bacterial expression systems. In addition, it offers pharmacology services, including cancer xenograft, metabolic disease, inflammation and immunological, neurological disorders, and other disease models; services in the areas of in vitro ADME and in vivo pharmacokinetics; and bioanalytical services, such as large and small molecule services. Further, the company provides preclinical services comprising preclinical pharmacokinetic and safety evaluation. Shanghai Medicilon Inc. was founded in 2004 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201299",
        "website": "http://www.medicilon.com.cn",
        "market_cap": 30888400896
    },
    "688222.SS": {
        "short_name": "HITGEN INC",
        "long_name": "HitGen Inc.",
        "summary": "HitGen Inc. operates a platform for early-stage drug discovery research focusing on DNA encoded chemical libraries (DELs). Its DELs include encoded syntheses for diverse, drug-likesmall molecule, and macrocycle compounds. The company has internal projects in research, with Phase I, PCC generation, and in lead generation stages that focus on oncology, CVD, inflammation/respiratory, metabolism, and ophthalmology therapeutic areas. HitGen Inc. has a drug discovery research collaboration with Gilead Sciences, Galapagos NV, Kymera Therapeutics, Inc., and Morphic Therapeutic to identify potential small molecule leads; a strategic partnership with Oncodesign SociÃ©tÃ© Anonyme for the identification and progression of new chemical entities; and an agreement with Lipigon Pharmaceuticals AB to include a second novel target. The company was founded in 2012 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610200",
        "website": "http://www.hitgen.com",
        "market_cap": 11371297792
    },
    "688266.SS": {
        "short_name": "SUZHOU ZELGEN BIOPHARMACEUTICAL",
        "long_name": "Suzhou Zelgen Biopharmaceuticals Co., Ltd.",
        "summary": "Suzhou Zelgen Biopharmaceuticals Co., Ltd. researches and develops, manufactures, and sells medicines in the People's Republic of China. It offers small molecule and recombinant protein drugs for the treatment of liver cancer, non-small cell lung cancer, colorectal cancer, thyroid cancer, nasopharyngeal carcinomas, myelofibrosis, hemorrhage, and hepatobiliary diseases. The company was founded in 2009 and is based in Kunshan, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunshan",
        "zipcode": "215300",
        "website": "http://www.zelgen.com",
        "market_cap": 17899200512
    },
    "688278.SS": {
        "short_name": "XIAMEN AMOYTOP BIOTECH CO LTD",
        "long_name": "Xiamen Amoytop Biotech Co., Ltd.",
        "summary": "Xiamen Amoytop Biotech Co., Ltd. engages in the manufacture, marketing, and sale of recombinant protein drugs using genetic engineering technology in China. It offers formulations, reagents, and APIs, as well as custom-manufacturing services. The company was founded in 1996 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361022",
        "website": "http://www.amoytop.com",
        "market_cap": 14095621120
    },
    "688298.SS": {
        "short_name": "ZHEJIANG ORIENT GENE BIOTECH CO",
        "long_name": "Zhejiang Orient Gene Biotech Co., Ltd.",
        "summary": "Zhejiang Orient Gene Biotech Co., Ltd. researches and develops, produces, and sells colloidal gold tests, urinalysis strips, raw materials, instruments, and molecular diagnosis products primarily in China. Its products include genetic diagnosis products; colloidal gold rapid diagnostic tests for drugs of abuse, infectious diseases, fertility, cardiac and tumor markers, and autoimmunity; dry chemical strips; bio-liquid diagnostic kits; clinical test instruments; POCT time-resolved fluor immunoassay test kits; raw materials; etc. The company also exports its products to North and South America, Europe, South Asia, Southeast Asia, the Middle East, Africa, Russia, and Australia. Zhejiang Orient Gene Biotech Co., Ltd. was founded in 2005 and is based in Huzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huzhou",
        "zipcode": "313300",
        "website": "http://www.orientgene.com",
        "market_cap": 22553999360
    },
    "688366.SS": {
        "short_name": "SHANGHAI HAOHAI BIOLOGICAL TECH",
        "long_name": "Shanghai Haohai Biological Technology Co., Ltd.",
        "summary": "Shanghai Haohai Biological Technology Co., Ltd. engages in the research, development, manufacture, and sale of biomedical materials in Mainland China, the United States, the United Kingdom, and internationally. The company offers ophthalmology, medical aesthetics and wound care, orthopedics, anti-adhesion, and homostasis products. It also provides medical sodium hyaluronate, medical chitosan, medical collagen sponge, and recombinant human epidermal growth factor (rhEGF), as well as biological reagents and materials. In addition, the company engages in the manufacture and sale of contact lens and intraocular lens materials, machines, and accessories; and investment and trading businesses. Further, it is involved in research and development of biological engineering and pharmaceutical products, as well as in the provision of related technology transfer, and consultation services. The company was formerly known as Haohai Limited and changed its name to Shanghai Haohai Biological Technology Co., Ltd. in 2010. Shanghai Haohai Biological Technology Co., Ltd. was founded in 2007 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.3healthcare.com",
        "market_cap": 24741326848
    },
    "688488.SS": {
        "short_name": "JIANGSU AIDEA PHARMACEUTICAL CO",
        "long_name": "Jiangsu Aidea Pharmaceutical Co., Ltd.",
        "summary": "Jiangsu Aidea Pharmaceutical Co., Ltd. develops, produces, and sells pharmaceutical products. It offers folium sennae granules, powdered bacillus tablets, clindamycin hydrochloride capsules, sodium bicarbonate tablets, nitrendipine tablets, metronidazole tablets, compound gentamycin sulfate and procaine hydrochloride sulfate granules, and cefradine capsules, as well as raw materials. The company was founded in 2009 and is based in Yangzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yangzhou",
        "zipcode": null,
        "website": "http://www.aidea.com.cn",
        "market_cap": 8723400704
    },
    "688513.SS": {
        "short_name": "CHENGDU EASTON BIO PHARMACEUTIC",
        "long_name": "Chengdu Easton Biopharmaceuticals Co., Ltd.",
        "summary": "Chengdu Easton Biopharmaceuticals Co., Ltd. engages in the research, development, manufacture, and commercialization of pharmaceutical products. The company provides finished dosage forms in anesthetic/analgesics, cardiovascular, oncology, pediatrics, and other therapeutic fields. It also offers active pharmaceutical ingredients in oncology, cardiovascular, anesthetic/analgesics, anti-inflammatory, gastrointestinal, antiemetic, neurology/psychiatry , and urinary system therapeutic categories. The company was founded in 2009 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "611731",
        "website": "http://www.eastonpharma.cn",
        "market_cap": 5485711360
    },
    "688520.SS": {
        "short_name": "SINOCELLTECH GROUP LTD",
        "long_name": "Sinocelltech Group Limited",
        "summary": "Sinocelltech Group Limited, a biotech company, focuses on the development of technologies for the development and manufacturing of recombinant proteins, monoclonal antibodies, and vaccines in China. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100176",
        "website": "http://www.sinocelltech.com",
        "market_cap": 20112523264
    },
    "688526.SS": {
        "short_name": "WUHAN KEQIAN BIOLOGY CO LTD",
        "long_name": "Wuhan Keqian Biology Co.,Ltd",
        "summary": "Wuhan Keqian Biology Co.,Ltd focuses on the research and development, production, sales, and animal epidemic prevention technical services of veterinary biological products in China. It offers vaccines for swine, poultry, and pets, as well as diagnostic reagents. The company was founded in 2001 and is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430073",
        "website": "http://www.kqbio.com",
        "market_cap": 19948500992
    },
    "6978.HK": {
        "short_name": "IMMUNOTECH-B",
        "long_name": "Immunotech Biopharm Ltd",
        "summary": "Immunotech Biopharm Ltd, a cellular immunotherapy biopharmaceutical company, focuses on the research, development, and commercialization of T cell immunotherapy products for the treatment of cancers in the People's Republic of China. Its core product is EAL, a multi-target cellular immunotherapy product that is in Phase II clinical trials for the prevention of postsurgical recurrence of liver cancer. The company is also conducting pre-clinical and clinical trial studies for EAL to treat lung cancer, glioma, gastric cancer, and colorectal cancer. Its products also include CAR-T cell series products for the treatment of hematologic cancer; and TCR-T cell series products for solid tumour treatment. The company was founded in 2006 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.eaal.net",
        "market_cap": 9046386688
    },
    "6996.HK": {
        "short_name": "ANTENGENE-B",
        "long_name": "Antengene Corporation Limited",
        "summary": "Antengene Corporation Limited, a biopharmaceutical company, engages in the development of oncology therapies in China. It offers ATG-010 (selinexor), a SINE compound targeting XPO1, a key nuclear export protein for the treatment of hematologic malignancies, such as multiple myeloma and DLBCL. The company's products in pipeline include ATG-008 (onatasertib), an orally available mTOR kinase inhibitor for the treatment of various advanced solid tumors and hematological malignancies; ATG-016 (eltanexor), a SINE compound; ATG-527 (verdinexor), which is in Phase I clinical trial primarily for oncology; ATG-019, an oral dual PAK4/NAMPT inhibitor for the treatment of NHL and advanced solid tumors; and ATG-017, an oral selective ERK1/2 inhibitor for the treatment of various solid tumors and hematological malignancies. Its products in pre-clinical stage include ATG-101, a PD-L1/CD137 (4-1BB) bi-specific antibody for the treatment of hematological malignancies and solid tumors; ATG-018, a small molecule inhibitor targeting ataxia telangiectasia and Rad3 related (ATR) kinase for the treatment of hematological malignancies and solid tumors; ATG-022, a humanized IgG1 monoclonal antibody against human Claudin 18.2 (CLDN18.2) antigen for the treatment of solid tumors; and ATG-012, a KRAS G12C inhibitor against KRAS oncoprotein for the treatment of solid tumors. The company was founded in 2016 and is headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.antengene.com",
        "market_cap": 11342958592
    },
    "6998.HK": {
        "short_name": "JHBP-B",
        "long_name": "JHBP (CY) Holdings Limited",
        "summary": "JHBP (CY) Holdings Limited, a biopharmaceutical company, focuses on developing and commercializing oncology and autoimmune drugs in China and internationally. The company's principal drug candidates include GB491 (lerociclib), an oral CDK4/6 inhibitor for treating hormone receptor-positive (HR+)/HER2- breast cancer; GB221, a herceptin (trastuzumab)-mimic HER2 monoclonal antibody (mAb) drug candidate; geptanolimab (GB226), a novel PD-1 mAb drug candidate; GB492, a stimulator of interferon genes (STING) agonist expected to exert synergistic effects in combination with GB226 for solid tumors; GB242, an infliximab (Remicade) biosimilar; and GB223, a receptor activator of nuclear factor-B Ligand (RANKL) mAb drug candidate. JHBP (CY) Holdings Limited was founded in 2007 and is headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.genorbio.com",
        "market_cap": 7856480256
    },
    "6IB.F": {
        "short_name": "INNOVENT BIOLOGICS INC.",
        "long_name": "Innovent Biologics, Inc.",
        "summary": "Innovent Biologics, Inc. operates as a biopharmaceutical company in China. The company operates a platform for the discovery, development, manufacture, and commercialization of antibody drug candidates in the fields of oncology, ophthalmology, immunology, and metabolic diseases. Its principal drug candidate is Tyvyt (sintilimab), an anti-PD-1 monoclonal antibody for the treatment of cancer, Hodgkin's lymphoma, and esophageal carcinoma. The company also engages in the development of IBI-301, a rituximab biosimilar for the treatment of non-Hodgkin's lymphoma; IBI-302, a bispecific antibody fusion protein for treatment of ocular fundus disease; IBI-303, an adalimumab biosimilar for the treatment of autoimmune diseases; and IBI-305, a bevacizumab biosimilar for the treatment of metastatic colorectal cancer and non-small cell lung cancer. In addition, it is involved in the development of IBI-306, a human monoclonal antibody to treat hypercholesterolemia; IBI-308, a human monoclonal antibody for lung cancer, esophageal cancer, gastric cancer, and Hodgkin's lymphoma; and IBI-310, a recombinant human anti CTLA-4 monoclonal antibody for liver cancer and renal cell carcinoma. Further, the company develops IBI-101, an anti-OX40 agonistic antibody for the treatment of advanced solid tumors; and IBI-188, an anti-CD47 monoclonal antibody for advanced hematological tumor and solid tumor. Additionally, it distributes pharmaceutical products; and provides consultation, and research and development services. The company has a strategic collaboration with The University of Texas MD Anderson Cancer Center to co-develop TYVYT, a sintilimab injection; Roche Group for the discovery and development of bispecific antibodies and multiple cell therapies; and a strategic alliance with Eli Lilly and Company for TYVYT sintilimab injection. Innovent Biologics, Inc. was incorporated in 2011 and is headquartered in Suzhou, China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215123",
        "website": "http://www.innoventbio.com",
        "market_cap": 13317762048
    },
    "978.F": {
        "short_name": "ADAGENE INC. SP.ADR",
        "long_name": "Adagene Inc.",
        "summary": "Adagene Inc., a clinical stage biopharmaceutical company, engages in the research, development, and production of monoclonal antibody drugs for cancers. Its lead product candidates include ADG106, a human ligand-blocking agonistic anti-CD137 monoclonal antibodies (mAbs) that is in Phase Ib clinical trials for the treatment advanced solid tumors and non-Hodgkin's lymphoma; ADG126, a fully-human anti-CTLA-4 mAb for cancer treatment; and ADG116, a human ligand-blocking anti-CTLA-4 mAb, which is in Phase I clinical trial for the treatment of various tumors. The company was founded in 2011 and is headquartered in Suzhou, China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "25125",
        "website": "http://www.adagene.com",
        "market_cap": 494160224
    },
    "9926.HK": {
        "short_name": "AKESO-B",
        "long_name": "Akeso, Inc.",
        "summary": "Akeso, Inc., a clinical-stage biopharmaceutical company, engages in discovery, development and commercialization of therapies. The company develops AK104, a PD-1/CTLA-4 bi-specific antibody for tumor infiltrating lymphocytes, which is in Phase Ia/Ib trial in Australia, and five Phase Ib/II and Phase II trials in China; Penpulimab AK105, a monoclonal antibody that is in Phase III clinical trials for squamous and non-squamous NSCLC, as well as Phase II clinical trial for relapsed/refractory classical hodgkin's lymphoma; and AK112, a PD-1/VEGF bi-specific antibody that is in a Phase I clinical study for the treatment of solid tumors. It is also developing AK101, a monoclonal antibody, which is in Phase IIb clinical trial to treat severe psoriasis patients; AK111, a monoclonal antibody for autoimmune disease target IL-17; and Ebronucimab (AK102) for the treatment of cardiovascular diseases. The company has collaboration agreements with Merck; Sino Biopharm; Dawnrays Pharma; and Zhongshan Health Technology Industrial Base Development Co., Ltd. and Torch Development Zone Linhai Industry Park Development Co., Ltd. Akeso, Inc. was founded in 2012 and is headquartered in Zhongshan, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zhongshan",
        "zipcode": "528437",
        "website": "http://www.akesobio.com",
        "market_cap": 53231267840
    },
    "9939.HK": {
        "short_name": "KINTOR PHARMA-B",
        "long_name": "Kintor Pharmaceutical Limited",
        "summary": "Kintor Pharmaceutical Limited, a biopharmaceutical company, engages in the research and development of drugs for the treatment of various cancers and other androgen receptor (AR) - related diseases in China, the United States, and Taiwan. The company's lead drug candidates include Proxalutamide, a small molecule second generation AR antagonist that is in various clinical trials for metastatic castration-resistant prostate cancer and breast cancer, as well as for the treatment of COVID-19; and Pyrilutamide, which is in various clinical trials for androgenetic alopecia and acne vulgaris. It also develops ALK-1 for the treatment of metastatic hepatocellular carcinoma and liver cancer; Detorsertib, a second-generation mTOR inhibitor for the treatment of metastatic solid tumours; GT1708F for the treatment of leukaemia and basal-cell carcinoma; and GT20029 for the treatment of androgenetic alopecia and acne vulgaris. The company was founded in 2009 and is headquartered in Suzhou, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215123",
        "website": "http://www.kintor.com.cn",
        "market_cap": 21664724992
    },
    "9966.HK": {
        "short_name": "ALPHAMAB-B",
        "long_name": "Alphamab Oncology",
        "summary": "Alphamab Oncology, a clinical-stage biopharmaceutical company, engages in the research and development, manufacture, and commercialization of oncology biologics. Its product pipeline includes KN046, a bispecific monoclonal antibody (BsAb) immune checkpoint inhibitor, which is in pivotal Phase III clinical trials that targets clinically-validated immune checkpoints, including programmed death ligand 1 (PD-L1) and cytotoxic T-lymphocyte-associated protein 4 (CTLA-4); and KN026, a next generation anti-human epidermal growth factor receptor 2 (HER2) BsAb that is in Phase II clinical trials for treating HER2-positive breast cancers and I/II clinical trial treatment of heavily pre-treated breast cancers, as well as Phase II clinical trial for HER2-positive solid tumors. The company's product pipeline also comprises KN019, a CTLA-4-based immunosuppressant fusion protein, which is in Phase II clinical trial with potential broad applications in both auto-immune diseases and oncology treatment-induced immune disorders; and KN035, an injectable PD-L1 inhibitor that has completed phase II pivotal clinical trials for deficient mismatch repair/microsatellite instability-high solid tumors, and is in Phase III pivotal trials for biliary tract cancer. The company was founded in 2008 and is headquartered in Suzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215024",
        "website": "http://www.alphamabonc.com",
        "market_cap": 21176369152
    },
    "9969.HK": {
        "short_name": "INNOCARE-B",
        "long_name": "InnoCare Pharma Limited",
        "summary": "InnoCare Pharma Limited, a clinical stage biopharmaceutical company, focuses on discovering, developing, and commercializing drugs for the treatment of cancer and autoimmune diseases. It offers Orelabrutinib (ICP-022), a Bruton's tyrosine kinase for the treatment of chronic lymphocytic leukemia or small lymphocytic lymphoma, and relapsed and refractory mantle cell lymphoma. ICP-022 is in Phase II studies for patients with relapsed and refractory marginal zone lymphoma, relapsed and refractory central nervous system lymphoma, and relapsed and refractory Waldenstrom's macroglobulinemia; and in a Phase I clinical trial for follicular lymphoma patients, as well as Phase I basket trial for B-cell malignancies. The company is developing Gunagratinib( ICP-192), a pan-inhibitor of fibroblast growth factor receptor (FGFR) that is in Phase I/IIa clinical trial to define its maximum tolerated dose and/or optimal biological dose, and pharmacokinetics/ pharmacodynamics in patients with solid tumors; and ICP-105, a FGFR4 inhibitor, which is in Phase I dose escalation trial for the treatment of advanced hepatocellular carcinoma. It is also developing ICP-723, a pan-inhibitor of tropomyosin-related kinase family that is in Phase I clinical trial to treat patients with neurotrophic tyrosine receptor kinase fusion-positive cancers; and ICP-332, a small-molecule inhibitor of tyrosine kinase 2 for the treatment of various T-cell mediated autoimmune disorders, such as psoriasis, inflammatory bowel disease, and systemic lupus erythematosus. The company was incorporated in 2015 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102206",
        "website": "http://www.innocarepharma.com",
        "market_cap": 38091616256
    },
    "9995.HK": {
        "short_name": "REMEGEN-B",
        "long_name": "RemeGen Co., Ltd.",
        "summary": "RemeGen Co., Ltd., a biopharmaceutical company, engages in the discovery, development, and commercialization of biologics for the treatment of autoimmune, oncology, and ophthalmic diseases with unmet medical needs in the People's Republic of China and internationally. The company's products in various stages of development include Telitacicept (RC18) for use in the treatment of autoimmune diseases, such as systemic lupus erythematosus, neuromyelitis optica spectrum disorder, rheumatoid arthritis, IgA nephritis, SjÃ¶gren's syndrome, multiple sclerosis, and myasthenia gravis; and Disitamab Vedotin (RC48) and RC98 for use in the treatment of various cancers. It is also developing RC28, which has completed Phase 1 clinical trials for use in the treatment of wet age-related macular degeneration, diabetic macular edema, and diabetic retinopathy; and RC88, which is in Phase 1 clinical trials for use in the treatment of diabetic macular edema, as well as pre-clinical products, such as RC108, RC118, RC138, RC148, and RC158 to treat various solid tumors. The company was founded in 2008 and is headquartered in Yantai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Yantai",
        "zipcode": null,
        "website": "http://www.remegen.com",
        "market_cap": 60249948160
    },
    "ADAG": {
        "short_name": "Adagene Inc.",
        "long_name": "Adagene Inc.",
        "summary": "Adagene Inc., a clinical stage biopharmaceutical company, engages in the research, development, and production of monoclonal antibody drugs for cancers. Its lead product candidates include ADG106, a human ligand-blocking agonistic anti-CD137 monoclonal antibodies (mAbs) that is in Phase Ib clinical trials for the treatment advanced solid tumors and non-Hodgkin's lymphoma; ADG126, a fully-human anti-CTLA-4 mAb for cancer treatment; and ADG116, a human ligand-blocking anti-CTLA-4 mAb, which is in Phase I clinical trial for the treatment of various tumors. The company was founded in 2011 and is headquartered in Suzhou, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "25125",
        "website": "http://www.adagene.com",
        "market_cap": 597500736
    },
    "ANPC": {
        "short_name": "AnPac Bio-Medical Science Co., ",
        "long_name": "AnPac Bio-Medical Science Co., Ltd.",
        "summary": "Anpac Bio-Medical Science Co., Ltd., a development-stage biotechnology company, researches, develops, markets, and sells multi-cancer screening and detection tests to corporations and life insurance companies in the People's Republic of China and the United States. It also manufactures cancer differentiation analysis devices; and offers physical checkup package services. The company was founded in 2010 and is headquartered in Lishui, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Lishui",
        "zipcode": "323006",
        "website": "http://www.anpacbio.com",
        "market_cap": 64408048
    },
    "AOBI": {
        "short_name": "AMERICAN ORIENTAL BIOENGINEERIN",
        "long_name": "American Oriental Bioengineering, Inc.",
        "summary": "American Oriental Bioengineering, Inc. engages in the development, manufacture, and commercialization of various pharmaceutical and healthcare products. The company primarily provides prescription pharmaceutical products, including Shuanghuanglian Lyophilized Injection Powder under the SHL brand for the treatment of flu symptoms, such as high fever, cough, and sore throat, as well as upper respiratory infections, mild pneumonia, bronchitis, and tonsillitis; and Cease Enuresis Soft Gel under the CE Gel brand to alleviate bedwetting. It also offers over-the-counter pharmaceutical products comprising Cease Enuresis Patch for the treatment of bedwetting and incontinence; Jinji Capsule for the treatment of endometritis, annexitis, and pelvic inflammations; Jinji Yimucao for the treatment of premenstrual syndrome (PMS) and other PMS and menopause-related symptoms; and Boke Nasal Spray for the treatment of sinus congestion from common cold, stuffy nose, chronic rhinitis, allergic rhinitis, and nasosinusitis. In addition, the company provides various nutraceutical products, such as soybean peptide based drinks, tablets, powder, and instant coffee. Further, it is involved in the wholesale and retail of pharmaceutical and nutraceutical products. The company sells its products directly and through distributors to hospitals, clinics, pharmacies, supermarkets, fitness centers, specialty nutraceutical stores, and other retail outlets in the People's Republic of China. American Oriental Bioengineering, Inc. is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100176",
        "website": null,
        "market_cap": 145410
    },
    "ASCLF": {
        "short_name": "ASCLETIS PHARMA INC",
        "long_name": "Ascletis Pharma Inc.",
        "summary": "Ascletis Pharma Inc., a biotechnology company, engages in the research and development, manufacture, marketing, and sale of pharmaceutical products in Mainland China and internationally. It offers Ganovo, a direct-acting anti-viral agent for the treatment of hepatitis C virus (HCV); Pegasys, a pegylated interferon for Hepatitis B and C virus; and Ravidasvir, a pan-genotypic NS5A inhibitor for the treatment of HCV. Its products pipeline includes ASC22, a PD-L1 single domain antibody fragment crystallizable fusion, which is in Phase II trial for the treatment of chronic Hepatitis B infection; ASC40, a Phase II-ready fatty acid synthase inhibitor for the treatment of non-alcoholic steatohepatitis (NASH); and ASC41, an oral THR-Ã\u009f agonist for the treatment of NASH. The company's products also comprise ASC09, a protease inhibitor that has completed Phase IIA clinical trial to treat human immunodeficiency virus type-1 infections; ASC06, which has completed Phase I clinical trial for treating liver cancer; and ASC21, a HCV NS5B polymerase inhibitor. In addition, it is developing therapies that are in pre-clinical trials for the treatment of hepatitis B virus and NASH. The company was incorporated in 2014 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.ascletis.com",
        "market_cap": 66149500
    },
    "BGNE": {
        "short_name": "BeiGene, Ltd.",
        "long_name": "BeiGene, Ltd.",
        "summary": "BeiGene, Ltd., a commercial-stage biotechnology company, engages in discovering, developing, manufacturing, and commercializing medicines for cancer therapeutics in the People's Republic of China and the United States. Its commercial products include BRUKINSA to treat relapsed/refractory (R/R) mantle cell lymphoma; Tislelizumab to treat R/R classical Hodgkin's lymphoma; ABRAXANE to treat breast cancer; REVLIMID to treat multiple myeloma; VIDAZA to treat myelodysplastic syndromes, chronic myelomonocyte leukemia, and acute myeloid leukemia; XGEVA to treat giant cell tumor of bone; BLINCYTO to treat acute lymphoblastic leukemia; KYPROLIS to treat R/R multiple myeloma; SYLVANT to treat idiopathic multicentric castleman disease; QARZIBA to treat neuroblastoma; Pamiparib for the treatment of various solid tumors; and BAT1706 to treat metastatic colorectal cancer, liver cancer, and non-small cell lung cancer (NSCLC). The company's clinical stage drug candidates comprise Zanubrutinib, a BTK inhibitor to treat various lymphomas; Tislelizumab, an anti-PD-1 antibody to treat various solid and hematological cancers; Lifirafenib and BGB-3245 to treat various malignancies, such as melanoma, NSCLC, and endometrial cancer; and Sitravatinib, a multi-kinase inhibitor to treat NSCLC, melanoma, and other solid tumors. Its clinical stage drug candidates also include BGB-A333, a PD-L1 inhibitor to treat various solid tumors; Ociperlimab, a TIGIT inhibitor to treat various solid tumors; BGB-11417, a small molecule Bcl-2 inhibitor to treat mature B-cell malignancies; BGB-A445, an OX40 agonist antibody to treat solid tumors; Zanidatamab, a bispecific HER2 inhibitor to treat breast and gastric cancer; BGB-A425, a T-cell immunoglobulin and mucin-domain containing-3 inhibitor to treat various solid tumors; and BGB-15025, a small molecule inhibitor of HPK1. The company was incorporated in 2010 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102206",
        "website": "http://www.beigene.com",
        "market_cap": 29424246784
    },
    "CBPI": {
        "short_name": "CHINA BOTANIC PHARMACEUTICAL",
        "long_name": "China Botanic Pharmaceutical Inc.",
        "summary": "China Botanic Pharmaceutical Inc. researches, develops, manufactures, and distributes of botanical products, bio-pharmaceutical products, and traditional Chinese medicines in the People's Republic of China. It offers botanical anti-depression and nerve-regulation products, including Acanthopanax, a Siberian ginseng that regulates the nervous system, delays aging process, strengthens the body, and treats neurasthenia, insomnia, cerebrovascular and cardiovascular diseases, and fatigue; Tianma tablets and compound Yangjiao tablets, which are botanic drugs for treating headaches and regulate nerves; and compound Schisandra tablets, a botanic drug used to regulate central nervous system, generate body fluids and alleviate thirst, nourish the kidneys, and cure insomnia and palpitations, as well as to cure neurasthenia. The company's biopharmaceutical products consist of Ginseng and Venison Extract, which comprises nutrients that nourish the blood and kidneys, and restore body's energy; and Badger oil expels that treats water and fire burns, scalds, and skin pain. Its botanical antibiotics and traditional over the counter Chinese medicines include Banlangen antiviral and broad-spectrum antibiotic granules; compound Honeysuckle antiviral, antibacterial, and anti-inflammatory granules; Shengmai granules, which regulate blood flow, strengthen heart beat, and improve the immune system and blood quality; and Qing Re Jie Du Oral Liquid that treats flu, upper respiratory infections, and sore throats. The company distributes its products through a network of approximately 3,000 distributors and approximately 70 sales centers. The company was formerly known as Renhuang Pharmaceuticals, Inc. and changed its name to China Botanic Pharmaceutical Inc. in November 2010. China Botanic Pharmaceutical Inc. was founded in 1996 and is headquartered in Harbin, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": "150090",
        "website": null,
        "market_cap": 207647
    },
    "CNTB": {
        "short_name": "Connect Biopharma Holdings Limi",
        "long_name": "Connect Biopharma Holdings Limited",
        "summary": "Connect Biopharma Holdings Limited, a clinical-stage biopharmaceutical company, focuses on the discovery and development of immune modulators for the treatment of serious autoimmune diseases and inflammation. The company's lead product candidate is CBP-201, an anti-interleukin-4 receptor alpha antibody, which is in Phase IIb clinical trial for the treatment of inflammatory allergic diseases, such as atopic dermatitis, asthma, and chronic rhinosinusitis with nasal polyps. Its products also comprise CBP-307, a small molecule modulator of sphingosine 1-phosphate receptor 1, a regulator of T cell mobilization out of lymph nodes into the periphery that is in Phase II for the treatment of autoimmune-related inflammation diseases; CBP-174, a small molecule histamine receptor 3 antagonist for oral administration, which is in a preclinical stage to treat chronic itch associated with skin inflammation; and CBP-233, a preclinical stage humanized antibody against interleukin-33, a cytokine involved in T helper 2 inflammation. The company was founded in 2012 and is headquartered in Taicang, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NGM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Taicang",
        "zipcode": "215400",
        "website": "http://www.connectbiopharm.com",
        "market_cap": 1035075584
    },
    "CSPHF": {
        "short_name": "CSTONE PHARMACEUTICALS",
        "long_name": "CStone Pharmaceuticals",
        "summary": "CStone Pharmaceuticals, a clinical-stage biotechnology company, focuses on developing and commercializing immuno-oncology and molecularly targeted drugs to address unmet medical needs in cancer treatment worldwide. The company's late-stage clinical products include CS1001, a monoclonal antibody against programmed death ligand 1; CS1003, a monoclonal antibody against programmed death receptor; ivosidenib, a potent inhibitor of the mutated isocitrate dehydrogenase-1 enzyme for the treatment of cancer; avapritinib, an inhibitor for the treatment of gastrointestinal stromal tumors and systematic mastocytosis; and Pralsetinib for the treatment of medullary thyroid cancer and other advanced solid tumors. Its products also comprise CS1002, CS3002, CS3003, CS3005, and CS3006 for solid tumors; Fisogatinib that is used for the treatment of hepatocellular carcinoma; and CS3004, CS1009, and CS2004 for other indications. CStone Pharmaceuticals has a licensing agreement with Numab Therapeutics AG for the development and commercialization of NM21-1480, a potential monovalent tri-specific antibody-based molecule targeting PD-L1, 4-1BB, and human serum albumin; a clinical collaboration with Bayer HealthCare LLC to evaluate CS1001 in combination with Bayer's oral multi-kinase inhibitor Stivarga, as a treatment for various types of cancer, including gastric cancer; and a strategic partnership with Burning Rock Biotech Limited to co-develop and commercialize companion diagnostics for pralsetinib, an investigational treatment for the detection of RET alterations in cancer patients. The company was founded in 2015 in Cayman Islands, and is headquartered in Shanghai, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.cstonepharma.com",
        "market_cap": 2567897600
    },
    "EB52.SG": {
        "short_name": "Essex Bio-Technology Ltd. Regis",
        "long_name": "Essex Bio-Technology Limited",
        "summary": "Essex Bio-Technology Limited, an investment holding company, develops, manufactures, distributes, and sells biopharmaceutical products in the People's Republic of China and internationally. The company operates through Ophthalmic Products and Surgical Products segments. It researches and develops basic fibroblast growth factor products for the treatment of cellular proliferation, differentiation, and migration. The company offers Beifushu series, such as Beifushu eye drops, Beifushu eye gel, and Beifushu unit-dose eye drops; Tobramycin eye drops, Levofloxacin eye drops, Sodium Hyaluronate eye drops, Xalatan eye drops, and Xalacom eye drops, as well as Iodized Lecithin Capsules. It also provides Beifuji sprays and lyophilized powder, and Beifuxin gels for use in burn and scald wounds, acute wounds, surgical incisions, chronic wounds, skin grafting, and other applications. In addition, it offers ophthalmic and surgical products from third parties; and eye health care products, including Beifu shuhui capsules to treat fundus ocular diseases, asthenopia, and visual impairments. Further, the company offers T-Bactum, an anti-microbial oral care product; Carisolv dental caries removal gel; and Yi Xue An Granules. Essex Bio-Technology Limited has license agreements with Mitotech S.A. and Mitotech LLC. Essex Bio-Technology Limited was founded in 1990 and is headquartered in Zhuhai, China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": null,
        "website": "http://www.essexbio.com",
        "market_cap": 431941728
    },
    "G51.F": {
        "short_name": "GENSCRIPT BIOT. DL-,001",
        "long_name": "Genscript Biotech Corporation",
        "summary": "Genscript Biotech Corporation, an investment holding company, engages in the manufacture and sale of life science research products and services in North America, Europe, China, Japan, the other Asia Pacific regions, and internationally. It operates through four segments: Life Science Services and Products, Biologics Development Services, Industrial Synthetic Biology Products, and Cell Therapy. The Life Science Services and Products segment provides research services in various categories, including gene synthesis and molecular cloning, oligonucleotide synthesis, protein engineering, peptide synthesis, antibody development, molecular diagnostics tools, and genome editing materials for use in basic biology studies, pharmaceutical and drug discovery, disease diagnostics and vaccine, agriculture, environmental studies, and food industry. The Biologics Development Services segment offers various services, such as antibody drug discovery, antibody drug pre-clinical and clinical development, plasmid and virus pre-clinical development, and plasmid and virus clinical development for therapeutic antibodies and gene/cell therapy products. The Industrial Synthetic Biology Products segment constructs non-pathogenic microbial strains; and develops and produces industrial enzymes. The Cell Therapy segment discovers and develops chimeric antigen receptor T-cell therapies for the treatment of liquid and solid tumors. The company was founded in 2002 and is headquartered in Nanjing, China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "211122",
        "website": "http://www.genscript.com",
        "market_cap": 6830189056
    },
    "GRCL": {
        "short_name": "Gracell Biotechnologies Inc.",
        "long_name": "Gracell Biotechnologies Inc.",
        "summary": "Gracell Biotechnologies Inc., a clinical-stage biopharmaceutical company, primarily discovers and develops cell therapies for the treatment of cancer in the People's Republic of China. Its lead product candidates include GC012F, a FasTCAR-enabled dual BCMA- and CD19-directed autologous CAR-T product candidate that is in Phase I trial for the treatment of multiple myeloma; GC019F, a FasTCAR-enabled CD19-directed autologous CAR-T product candidate, which is in Phase I clinical trial for the treatment of adult B cell acute lymphoblastic leukemia (B-ALL), as well as in preclinical stage for the treatment of relapsed or refractory (r/r) B cell non-Hodgkin's lymphoma (B-NHL); and GC027, a TruUCAR-enabled CD7-directed allogeneic CAR-T product candidate, which is in Phase I clinical trial for the treatment of adult T cell acute lymphoblastic leukemia. The company's product candidates also comprise; and GC007g, a donor-derived CD19-directed allogeneic CAR-T cell therapy that is in Phase I clinical trial for the treatment of r/r B-ALL. In addition, it has a portfolio of earlier stage product candidates targeting various cancer indications, such as ovarian cancer, breast cancer, peripheral T cell lymphoma, a subtype of NHL, and T cell lymphoblastic leukemia. The company was founded in 2017 and is headquartered in Suzhou, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215123",
        "website": "http://www.gracellbio.com",
        "market_cap": 772951808
    },
    "HTDS": {
        "short_name": "HARD TO TREAT DISEASES INC",
        "long_name": "Hard to Treat Diseases Inc.",
        "summary": "Hard to Treat Diseases Inc. manufactures, supplies, and exports biopharmaceuticals and vaccines in China and internationally. The company offers biologicals, including reteplase (rPA), mycobacterium vaccae, acutobin urinary kallidinogenase, ulinastatin, and cerebroprotein hydrolysate for injection; chemicals, such as cobratide injection, entecavir capsule, HES, dasatinib tablets, thymosin a1 for injection, imipenem and cilastatin sodium for injection, and meropenem for injection; and vaccines, which include rabies vaccine, ACYW135 meningococcal vaccine, influenza vaccine, Hepatitis A, and varicella vaccine. It markets its products through a sales network that focuses on South Asia, South-east Asia, Central and South America, and the Middle East. Hard to Treat Diseases Inc. was founded in 2009 and is based in Shenzhen, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518040",
        "website": "http://www.mellowhope.com",
        "market_cap": 5482
    },
    "IMAB": {
        "short_name": "I-MAB",
        "long_name": "I-Mab",
        "summary": "I-Mab, a clinical stage biopharmaceutical company, discovers, develops, and commercializes biologics to treat cancer and autoimmune disorders. It is developing Felzartamab, a CD38 antibody that is in Phase III clinical trials to treat multiple myeloma and autoimmune diseases; Eftansomatropin alfa, a long-acting human growth hormone, which has completed Phase 3 clinical trials to treat pediatric growth hormone deficiency; Lemzoparlimab, a CD47 monoclonal antibody that has completed Phase 1a clinical trials with RBC-sparing differentiation; and Olamkicept, an IL-6 blocker that has completed Phase 2 clinical trials for the treatment of ulcerative colitis and autoimmune. Its product candidates also includes Enoblituzumab, a humanized B7-H3 antibody that is in Phase 2 to treat head and neck cancer, and other oncology diseases; Efineptakin, a long-acting recombinant human IL-7, which is in Phase 2 clinical trials to treat glioblastoma multiforme patients with lymphopenia; TJ210, a monoclonal antibody against human C5aR1 that is in Phase 1 for the treatment of cancers and autoimmune; Plonmarlimab, a GM-CSF monoclonal antibody that is in Phase 2 clinical trials for rheumatoid arthritis and CAR-T-related therapies; Uliledlimab, a CD73 antibody, which is in Phase I/2 clinical trials for treating solid tumors and oncology; TJ-L14B, a PD-L1-based tumor-dependent T-cell engager for solid cancers; and TJ-CD4B, a tumor-dependent T cell engager for gastric and other cancers. Its product candidates in pre-clinical development stage comprises TJX7, a novel CXCL13 antibody for autoimmune diseases; and TJ-C4GM antibodies for treating oncology diseases. I-Mab has strategic collaboration agreement with AbbVie Ireland Unlimited Company; and PT Kalbe Genexine Biologics. The company was founded in 2014 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NGM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201210",
        "website": "http://www.i-mabbiopharma.com",
        "market_cap": 4201679360
    },
    "KNTPF": {
        "short_name": "KINTOR PHARMACEUTICAL LTD",
        "long_name": "Kintor Pharmaceutical Limited",
        "summary": "Kintor Pharmaceutical Limited, a biopharmaceutical company, engages in the research and development of drugs for the treatment of various cancers and other androgen receptor (AR) - related diseases in China, the United States, and Taiwan. The company's lead drug candidates include Proxalutamide, a small molecule second generation AR antagonist that is in various clinical trials for metastatic castration-resistant prostate cancer and breast cancer; and Pyrilutamide, which is in various clinical trials for androgenetic alopecia and acne vulgaris. It also develops ALK-1 for the treatment of metastatic hepatocellular carcinoma and liver cancer; Detorsertib, a second-generation mTOR inhibitor for the treatment of metastatic solid tumours; and GT1708F, for the treatment of leukaemia and basal-cell carcinoma. The company was founded in 2009 and is headquartered in Suzhou, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215123",
        "website": "http://www.kintor.com.cn",
        "market_cap": 8097236992
    },
    "PH4.F": {
        "short_name": "CSTONE PHARMAC.  DL-,0001",
        "long_name": "CStone Pharmaceuticals",
        "summary": "CStone Pharmaceuticals, a clinical-stage biotechnology company, focuses on developing and commercializing immuno-oncology and molecularly targeted drugs to address unmet medical needs in cancer treatment worldwide. The company's late-stage clinical products include CS1001, a monoclonal antibody against programmed death ligand 1; CS1003, a monoclonal antibody against programmed death receptor; ivosidenib, a potent inhibitor of the mutated isocitrate dehydrogenase-1 enzyme for the treatment of cancer; avapritinib, an inhibitor for the treatment of gastrointestinal stromal tumors and systematic mastocytosis; and Pralsetinib for the treatment of medullary thyroid cancer and other advanced solid tumors. Its products also comprise CS1002, CS3002, CS3003, CS3005, and CS3006 for solid tumors; Fisogatinib that is used for the treatment of hepatocellular carcinoma; and CS3004, CS1009, and CS2004 for other indications. CStone Pharmaceuticals has a licensing agreement with Numab Therapeutics AG for the development and commercialization of NM21-1480, a potential monovalent tri-specific antibody-based molecule targeting PD-L1, 4-1BB, and human serum albumin; a clinical collaboration with Bayer HealthCare LLC to evaluate CS1001 in combination with Bayer's oral multi-kinase inhibitor Stivarga, as a treatment for various types of cancer, including gastric cancer; and a strategic partnership with Burning Rock Biotech Limited to co-develop and commercialize companion diagnostics for pralsetinib, an investigational treatment for the detection of RET alterations in cancer patients. The company was founded in 2015 in Cayman Islands, and is headquartered in Shanghai, China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.cstonepharma.com",
        "market_cap": 1910894080
    },
    "UPC": {
        "short_name": "Universe Pharmaceuticals Inc",
        "long_name": "Universe Pharmaceuticals INC",
        "summary": "Universe Pharmaceuticals INC, a pharmaceutical company, engages in the manufacture, marketing, distribution, and sale of traditional Chinese medicine derivative products in China. It offers products for the treatment and relief for common chronic health conditions in the elderly for the physical wellness and longevity; and cold and flu medications. The company also distributes and sells third-party producers, including biomedical drugs, medical instruments, traditional Chinese medicine pieces products, and dietary supplements. Its customers include pharmaceutical companies, hospitals, clinics, and drugstore chains. The company was incorporated in 2019 and is based in Ji'an, China. Universe Pharmaceuticals INC operates as a subsidiary of Sununion Holding Group Limited.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NGM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Ji'an",
        "zipcode": null,
        "website": "http://www.dzrzy.com",
        "market_cap": 62370000
    },
    "VB0.F": {
        "short_name": "VIVA BIOTECH HOLD",
        "long_name": "Viva Biotech Holdings",
        "summary": "Viva Biotech Holdings provides structure-based drug discovery services to biotechnology and pharmaceutical customers worldwide. The company develops structure based drug discovery, fragment based drug discovery, affinity selection mass spectrometry screening, and membrane protein targeted drug discovery platforms. The company's products include cell lines, crystal structures, GPCR proteins, antibodies, and proteins. It also offers EFS, gene-to-protein and gene-to-structure, viva engine for lead discovery, medicinal chemistry, in vitro pharmacology, and antibody discovery services. Viva Biotech Holdings was founded in 2008 and is headquartered in Shanghai, China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.vivabiotech.com.cn",
        "market_cap": 2008706048
    },
    "VBIZF": {
        "short_name": "VIVA BIOTECH HOLDINGS",
        "long_name": "Viva Biotech Holdings",
        "summary": "Viva Biotech Holdings provides structure-based drug discovery services to biotechnology and pharmaceutical customers worldwide. The company develops structure based drug discovery, fragment based drug discovery, affinity selection mass spectrometry screening, and membrane protein targeted drug discovery platforms. The company's products include cell lines, crystal structures, GPCR proteins, antibodies, and proteins. It also offers EFS, gene-to-protein and gene-to-structure, viva engine for lead discovery, medicinal chemistry, in vitro pharmacology, and antibody discovery services. Viva Biotech Holdings was founded in 2008 and is headquartered in Shanghai, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.vivabiotech.com.cn",
        "market_cap": 1758290048
    },
    "WXIBF": {
        "short_name": "WUXI BIOLOGICS (CAYMAN) INC",
        "long_name": "WuXi Biologics (Cayman) Inc.",
        "summary": "WuXi Biologics (Cayman) Inc., an open-access biologics technology platform company, provides solutions to organizations to discover, develop, and manufacture biologics from concept to commercial manufacturing in the People's Republic of China, North America, Europe, and internationally. The company also engages in the provision of consultation services in relation to the biopharmaceutical technology, international sales contracting services, testing and development of testing technologies, sales and marketing services, and biologics clinical and manufacturing services; production and sales of medicals; vaccine CDMO and related business; and material supplier activities. It has strategic partnerships with Almirall, S.A.; Vir Biotechnology, Inc.; Aravive, Inc.; Tubulis GmbH; Arcus Biosciences, Inc.; AC Immune SA; and AB2 Bio Ltd. The company was incorporated in 2014 and is headquartered in Wuxi, China. WuXi Biologics (Cayman) Inc. is a subsidiary of WuXi Biologics Holdings Limited.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214092",
        "website": "http://www.wuxibiologics.com",
        "market_cap": 69245280256
    },
    "WXXWY": {
        "short_name": "WUXI BIOLOGICS (CAYMAN) INC",
        "long_name": "WuXi Biologics (Cayman) Inc.",
        "summary": "WuXi Biologics (Cayman) Inc., an open-access biologics technology platform company, provides solutions to organizations to discover, develop, and manufacture biologics from concept to commercial manufacturing in the People's Republic of China, North America, Europe, and internationally. The company also engages in the provision of consultation services in relation to the biopharmaceutical technology, international sales contracting services, testing and development of testing technologies, sales and marketing services, and biologics clinical and manufacturing services; production and sales of medicals; vaccine CDMO and related business; and material supplier activities. It has strategic partnerships with Almirall, S.A.; Vir Biotechnology, Inc.; Aravive, Inc.; Tubulis GmbH; Arcus Biosciences, Inc.; AC Immune SA; and AB2 Bio Ltd. The company was incorporated in 2014 and is headquartered in Wuxi, China. WuXi Biologics (Cayman) Inc. is a subsidiary of WuXi Biologics Holdings Limited.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214092",
        "website": "http://www.wuxibiologics.com",
        "market_cap": 57161441280
    },
    "XYNO": {
        "short_name": "XYNOMIC PHARMACEUTICALS HLDGS I",
        "long_name": "Xynomic Pharmaceuticals Holdings, Inc.",
        "summary": "Xynomic Pharmaceuticals Holdings, Inc., a clinical stage biopharmaceutical company, discovers and develops small molecule drug candidates for the treatment of cancer in the People's Republic of China and the United states. Its lead drug candidate is Abexinostat, an orally dosed hydroxamic acid-based small molecule histone deacetylase inhibitor. The company develops pazopanib a molecular therapy for treating renal cell carcinoma; XYN-603 that is in Phase 1/2 clinical trial to treat patients with relapsed or refractory (R/R) mantle cell lymphoma or R/R diffuse large b-cell lymphoma (DLBCL); and XYN-604, which is in phase 1b trial for treatment of multiple solid tumors. It also develops single agent monotherapy products that is in phase II clinical trial, including XYN-601 for treatment of R/R follicular lymphoma (FL); XYN-606 to treat R/R DLBCL; and XYN-605 for treatment of R/R FL. In addition, the company develops drug candidate XP-105, a mTORC1/2 inhibitor, which has completed Phase I clinical trial for treatment of breast cancer. Further, its pre-clinical oncology drug candidate include XP-102 (BI 882370), a pan-RAF inhibitor. The company was founded in 2016 and is headquartered in Shanghai, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200031",
        "website": "http://xynomicpharma.com",
        "market_cap": 102727840
    },
    "ZLAB": {
        "short_name": "Zai Lab Limited",
        "long_name": "Zai Lab Limited",
        "summary": "Zai Lab Limited, a biopharmaceutical company, discovers, licenses, develops, and commercializes therapeutics to treat oncology, autoimmune, and infectious diseases in China. The company offers ZEJULA for the treatment of breast cancer and non-small cell lung cancer (NSCLC); and Optune, a cancer therapy to treat glioblastoma multiforme. It also develops QINLOCK for the treatment of gastrointestinal stromal tumors; Odronextamab to treat follicular lymphoma, diffuse large B-cell lymphoma, and other lymphomas; Repotrectinib, a tyrosine kinase inhibitor (TKI) to target ROS1 and TRK A/B/C in TKI-naÃ¯ve- or -pretreated cancer patients; Margetuximab for the treatment of breast and gastroesophageal cancers; Bemarituzumab for the treatment of gastric and gastroesophageal junction cancer; and Omadacycline to treat acute bacterial skin and skin structure, and community-acquired bacterial pneumonia infections. In addition, the company develops CLN-081 for the treatment of patients with EGFR exon 20 insertion NSCLC; Efgartigimod to reduce disease-causing immunoglobulin G (IgG) antibodies; Retifanlimab to treat microsatellite instability high endometrial cancer; ZL-2309 for the treatment of metastatic pancreatic cancer, metastatic colorectal cancer, and other advanced solid tumors; ZL-1201 to treat solid tumors and hematological malignancies; ZL-1102 for the treatment of psoriasis; and Sulbactam/durlobactam for the treatment of serious infections caused by Acinetobacter. Zai Lab Limited has license and collaboration agreements with the GlaxoSmithKline; Paratek Bermuda, Ltd.; Five Prime Therapeutics, Inc.; Entasis Therapeutics Holdings, Inc.; Crescendo Biologics Ltd.; Novocure Limited; MacroGenics Inc.; Deciphera Pharmaceuticals, LLC; Incyte Corporation; Regeneron Ireland Designated Activity Company; Turning Point Therapeutics Inc; Cullinan Pearl Corp.; Takeda Pharmaceutical Company Limited; and argenx BV. The company was incorporated in 2013 and is headquartered in Shanghai, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201210",
        "website": "http://www.zailaboratory.com",
        "market_cap": 13570381824
    }
}