{
    "1763.HK": {
        "short_name": "CIRC",
        "long_name": "China Isotope & Radiation Corporation",
        "summary": "China Isotope & Radiation Corporation engages in the research and development, manufacture, and sale of diagnostic and therapeutic radiopharmaceuticals and radioactive source products for medical and industrial applications in China. It operates through four segments: Pharmaceuticals, Radioactive Source Products, Irradiation, and Independent Clinical Laboratory Services and Other Businesses. The company's Pharmaceuticals segment engages in the research, development, manufacture, and sale of imaging diagnostic and therapeutic radiopharmaceuticals; UBT kits and analyzers; and in vitro immunoassay diagnostic reagents and kits. Its Radioactive Source Products segment provides medical and industrial radioactive sources products and related technical services. The company's Irradiation segment offers irradiation service to manufacturers of medical devices, food, traditional Chinese medicine, and cosmetics for sterilization; and EPC services for the design, manufacturing, and installation of gamma ray irradiation facilities to irradiation service providers. Its Independent Clinical Laboratory Services and Other Businesses segment provides independent clinical laboratory services with respect to hepatitis, endocrine, bone metabolism, cardiovascular disease, diabetes, and other diseases to hospitals and other medical institutions. As of December 31, 2019, the company's sales network included 11,000 hospitals and other medical institutions, such as 1,800 tertiary hospitals, 5,000 secondary hospitals, and 4,400 primary hospitals in China. The company was founded in 1983 and is headquartered in Beijing, China. China Isotope & Radiation Corporation is a subsidiary of China National Nuclear Corporation.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100089",
        "website": "http://www.circ.com.cn",
        "market_cap": 9852149760
    },
    "2359.HK": {
        "short_name": "WUXI APPTEC",
        "long_name": "WuXi AppTec Co., Ltd.",
        "summary": "WuXi AppTec Co., Ltd., an investment holding company, provides research, development, and manufacturing services to discover, develop, and manufacture small molecule drugs, and cell and gene therapies in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. The company operates through China-Based Laboratory Services, U.S.-Based Laboratory Services, Clinical Research and Other CRO Services, CDMO Services, and Others segments. It offers laboratory services, such as synthetic chemistry, biology, medicinal chemistry, analytical chemistry, testing, drug metabolism and pharmacokinetics, toxicology, bioanalytical, and medical devices safety testing services, as well as manufacturing and testing for cell and gene therapies, and absorption, distribution, metabolism, and excretion services. The company also provides clinical research services, including clinical development and site management organization services; clinical development services comprising project planning, clinical operation, and monitoring and management of phase I-IV clinical trials, outcomes research, and medical device trials; embedded outsourcing; and clinical informatics services. In addition, it offers CDMO services; and administrative services, as well as sells raw and scrap materials. Further, the company engages in the laboratory-used biological assets cultivation business. WuXi AppTec Co., Ltd. was founded in 2000 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200131",
        "website": "http://www.wuxiapptec.com",
        "market_cap": 439852924928
    },
    "300347.SZ": {
        "short_name": "HANGZHOU TIGERMED",
        "long_name": "Hangzhou Tigermed Consulting Co., Ltd",
        "summary": "Hangzhou Tigermed Consulting Co., Ltd. provides contract research organization services in China and internationally. It operates through Clinical Trial Solutions; and Clinical-Related and Laboratory Services. The company offers regulatory submission and approval, medical translation, and good manufacturing practice (GMP) consulting; clinical services in the areas of medical science, early clinical and late phase development, medical monitoring, project management, patient recruitment, and quality management system; and biometrics services covering data management, biostatistics, and statistical programming. It also provides integrated technology services, such as site management, pharmacovigilance, third party audit and training, medical imaging, clinical trial system solution, central laboratory, pre-clinical, and research hospital; medical device/ in vitro diagnostics (IVD) services comprising medical device testing, regulatory submission, clinical evaluation and trials, GMP certificate, EU MDR and IVDR preparation, and value added services; and post-marketing study, real world evidence, and vaccine clinical trial services. The company was incorporated in 2004 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310051",
        "website": "http://www.tigermed.net",
        "market_cap": 156298985472
    },
    "300396.SZ": {
        "short_name": "DIRUI INDUSTRIAL C",
        "long_name": "Dirui Industrial Co.,Ltd.",
        "summary": "Dirui Industrial Co.,Ltd. engages in the research and development, production, and sale of medical inspection products in the People's Republic of China. The company provides medical instruments, diagnostic reagents, test strips, etc. It offers biochemical blood cell, urine, coagulation, chemiluminescence immunoassay, and gynecological secretion analyzers. The company was founded in 1992 and is headquartered in Changchun, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": "130103",
        "website": "http://www.dirui.com.cn",
        "market_cap": 6312806912
    },
    "300439.SZ": {
        "short_name": "MEDICALSYSTEM BIOT",
        "long_name": "Medicalsystem Biotechnology Co.,Ltd",
        "summary": "Medicalsystem Biotechnology Co., Ltd. engages in the research, development, production, sale, and service of medical diagnostic products in China. The company offers vitro diagnostic, biochemical, blood cell related reagents; in vitro diagnosis; quality control calibration; POCT products; and blood line series, as well as chronic disease management solutions. The company was formerly known as Ningbo Medicalsystem Biotechnology Co., Ltd. and changed its name to Medicalsystem Biotechnology Co., Ltd. in January 2017. Medicalsystem Biotechnology Co., Ltd. was founded in 2003 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": null,
        "website": "http://www.nb-medicalsystem.com",
        "market_cap": 7924270080
    },
    "300463.SZ": {
        "short_name": "MACCURA BIOTECHNOL",
        "long_name": "Maccura Biotechnology Co.Ltd",
        "summary": "Maccura Biotechnology Co.Ltd engages in the research, development, manufacture, and sale of IVD products and related services in China and internationally. The company offers immunoassay products, such as chemiluminescence analyzers and reagents; clinical chemistry reagents for hepatic function, glycometabolism, iron and other, renal function, coagulation, special protein, cardiac, and lipids; and clinical laboratory products, such as automatic hematology, and automatic and semi-automatic coagulation analyzers. It also provides POCT products, such as fluorescence immunoassay analyzers, as well as colloidal gold kits; molecular diagnosis products, such as PCR and NGS; and pathology products. The company was founded in 1994 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": null,
        "website": "http://www.maccura.com",
        "market_cap": 23487047680
    },
    "300482.SZ": {
        "short_name": "GUANGZHOU WONDFO B",
        "long_name": "Guangzhou Wondfo Biotech Co.,Ltd",
        "summary": "Guangzhou Wondfo Biotech Co.,Ltd, a biological company, engages in the research and development, manufacture, and sale of rapid diagnostic reagents and related equipment in China and internationally. The company offers rapid test kits for fertility, DOA, tumor, and sexually transmitted diseases, as well as immunofluorescence system for use in diagnose conditions, such as infection, inflammation, diabetes, cardiovascular diseases, renal injury and cancers, etc. It also provides blood gas, optical coagulation, and dry chemistry analyzer test strips for healthcare professionals. The company was founded in 1992 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.wondfo.com.cn",
        "market_cap": 31831697408
    },
    "300685.SZ": {
        "short_name": "AMOY DIAGNOSTICS C",
        "long_name": "Amoy Diagnostics Co., Ltd.",
        "summary": "Amoy Diagnostics Co., Ltd., a biotech company, develops and commercializes cancer diagnostics in China and internationally. The company offers molecular diagnostic kits, including EGFR, RAS, ALK, BRAF, PIK3CA, and ROS1 testing kits for oncology precision medicine; and NGS, real-time PCR, FISH, and extraction assays. The company has a strategic partnership agreement with Loxo Oncology, Inc. Amoy Diagnostics Co., Ltd. Was founded in 2008 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361027",
        "website": "http://www.amoydx.com",
        "market_cap": 19598954496
    },
    "3347.HK": {
        "short_name": "TIGERMED",
        "long_name": "Hangzhou Tigermed Consulting Co., Ltd",
        "summary": "Hangzhou Tigermed Consulting Co., Ltd. provides contract research organization services in China and internationally. It operates through Clinical Trial Solutions; and Clinical-Related and Laboratory Services. The company offers regulatory submission and approval, medical translation, and good manufacturing practice (GMP) consulting; clinical services in the areas of medical science, early clinical and late phase development, medical monitoring, project management, patient recruitment, and quality management system; and biometrics services covering data management, biostatistics, and statistical programming. It also provides integrated technology services, such as site management, pharmacovigilance, third party audit and training, medical imaging, clinical trial system solution, central laboratory, pre-clinical, and research hospital; medical device/ in vitro diagnostics (IVD) services comprising medical device testing, regulatory submission, clinical evaluation and trials, GMP certificate, EU MDR and IVDR preparation, and value added services; and post-marketing study, real world evidence, and vaccine clinical trial services. The company was incorporated in 2004 and is headquartered in Hangzhou, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310051",
        "website": "http://www.tigermed.net",
        "market_cap": 172027346944
    },
    "603108.SS": {
        "short_name": "SHANGHAI RUNDA MEDICAL TECHNOLO",
        "long_name": "Shanghai Runda Medical Technology Co., Ltd.",
        "summary": "Shanghai Runda Medical Technology Co., Ltd. provides integrated medical laboratory services in China. It offers platform supply, laboratory design/renovation, laboratory standardization, and information management system services; medical solutions to help healthcare professionals in the areas of biochemistry, diabetes, POCT, immunoassay analyzer, and molecular biology diagnosis; professional technical services; and logistic services. The company was founded in 1999 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200085",
        "website": "http://www.rundamedical.com",
        "market_cap": 6467633152
    },
    "603127.SS": {
        "short_name": "JOINN LABORATORIES (CHINA) CO L",
        "long_name": "Joinn Laboratories (China) Co.,Ltd.",
        "summary": "Joinn Laboratories (China) Co., Ltd. provides preclinical and non-clinical services. It evaluates various drugs, including biologics, pharmaceutical chemicals, and plant medicines for indications, such as renal, metabolic, cardiology, hematology, COPD, ophthalmic, oncology, and immune-related diseases. The company's services include screening services, such as efficiency screening, bioavailability, ADME screening, and non-GLP toxicology studies; pre-clinical safety assessment comprising general toxicology, safety pharmacology, developmental and reproductive toxicology, genetic and ocular toxicology, clinical pathology, analytical and bioanalytical analysis, immunology, and biomarker assays; pharmacodynamics services; and services to evaluate and optimize the absorption, distribution, metabolism, and elimination (ADME), as well as pharmacokinetic properties of potential drugs from early discovery projects. Its services also comprise clinical trials; a range of safety assessment services for medical devices, chemicals, and agrochemicals; regulatory consulting services in the areas of pharmaceuticals, biologics, Chinese medicine, medical devices, veterinary medicines, and agrochemicals; and food animal evaluation services comprising candidate selection, efficacy, safety evaluation studies on animals' health products, animal remedies, and fodders. In addition, the company offers traditional animals, such as outbred rats, inbred strain mice, outbred mice, and immunodeficient mice. It serves pharmaceutical, medical device, chemical, biotechnology, and agricultural development companies, as well as regulatory and other government agencies. It serves pharmaceutical, medical device, chemical, biotechnology, and agricultural development companies. The company operates in China, Europe, North America, Southeast Asia, and Australia. The company was founded in 1995 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100176",
        "website": "http://www.joinn-lab.com",
        "market_cap": 46776520704
    },
    "603259.SS": {
        "short_name": "WUXI APPTEC CO LTD",
        "long_name": "WuXi AppTec Co., Ltd.",
        "summary": "WuXi AppTec Co., Ltd., an investment holding company, provides research, development, and manufacturing services to discover, develop, and manufacture small molecule drugs, and cell and gene therapies in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. The company operates through China-Based Laboratory Services, U.S.-Based Laboratory Services, Clinical Research and Other CRO Services, CDMO Services, and Others segments. It offers laboratory services, such as synthetic chemistry, biology, medicinal chemistry, analytical chemistry, testing, drug metabolism and pharmacokinetics, toxicology, bioanalytical, and medical devices safety testing services, as well as manufacturing and testing for cell and gene therapies, and absorption, distribution, metabolism, and excretion services. The company also provides clinical research services, including clinical development and site management organization services; clinical development services comprising project planning, clinical operation, and monitoring and management of phase I-IV clinical trials, outcomes research, and medical device trials; embedded outsourcing; and clinical informatics services. In addition, it offers CDMO services; and administrative services, as well as sells raw and scrap materials. Further, the company engages in the laboratory-used biological assets cultivation business. WuXi AppTec Co., Ltd. was founded in 2000 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200131",
        "website": "http://www.wuxiapptec.com",
        "market_cap": 356218732544
    },
    "603658.SS": {
        "short_name": "AUTOBIO DIAGNOSTICS CO LTD",
        "long_name": "Autobio Diagnostics Co., Ltd.",
        "summary": "Autobio Diagnostics Co., Ltd. engages in the research and development, production, and distribution of clinical diagnostic products in China and internationally. It develops immunoassay, biochemistry, microbiology, and IVD reagents; and instruments, such as automation and semi-automation systems, as well as medical laboratory solutions. The company's immunoassay products AutoLumo A2000 Plus, an automatic Chemiluminescence immunoassay analyzer; automatic microplate chemiluminescent enzyme immunoassay; and LUmo luminometers, PHOmo microplate readers, and iWO microplate washers. Its microbiology products comprise automated mass spectrometry microbial identification systems, automated blood culture systems; and blood culture bottles, AUTOMIC strips, and mycoplasma IES. The company was formerly known as Lifeclone Diagnostics Co., Ltd. and changed its name to Autobio Diagnostics Co., Ltd. in 2003. Autobio Diagnostics Co., Ltd. was founded in 1998 and is based in Zhengzhou, China. Autobio Diagnostics Co., Ltd. is a subsidiary of Zhengzhou Auto Industrial Co., Ltd.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": "450016",
        "website": "http://www.autobio.com.cn",
        "market_cap": 35131265024
    },
    "603716.SS": {
        "short_name": "THALYS MEDICAL TECHNOLOGY GROUP",
        "long_name": "Thalys Medical Technology Group Inc.",
        "summary": "Thalys Medical Technology Group Inc. engages in the medical intensive business and operation services in China. The company was formerly known as Thalys Medical Technology Inc. and changed its name to Thalys Medical Technology Group Inc. in September 2020. Thalys Medical Technology Group Inc. was founded in 2004 and is headquartered in Wuhan, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430040",
        "website": "http://www.thalys.net.cn",
        "market_cap": 2956503808
    },
    "603882.SS": {
        "short_name": "GUANGZHOU KINGMED DIAGNOSTICS G",
        "long_name": "Guangzhou Kingmed Diagnostics Group Co., Ltd.",
        "summary": "Guangzhou Kingmed Diagnostics Group Co., Ltd. operates as a third-party medical laboratory company in China. The company offers medical examination, clinical trial, food and hygiene testing, and scientific research services. As of January 3, 2019, it operated 37 testing laboratories with approximately 2,400 testing items to serve approximately 21,000 medical institutions. The company has a strategic partnership with Personal Genome Diagnostics Inc. to serve the clinical trial screening needs of pharmaceutical partners in the Asian market. The company was founded in 1994 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510030",
        "website": "http://www.kingmed.com.cn",
        "market_cap": 66740891648
    },
    "6127.HK": {
        "short_name": "JOINN",
        "long_name": "Joinn Laboratories (China) Co.,Ltd.",
        "summary": "Joinn Laboratories (China) Co., Ltd. provides preclinical and non-clinical services. It evaluates various drugs, including biologics, pharmaceutical chemicals, and plant medicines for indications, such as renal, metabolic, cardiology, hematology, COPD, ophthalmic, oncology, and immune-related diseases. The company's services include screening services, such as efficiency screening, bioavailability, ADME screening, and non-GLP toxicology studies; pre-clinical safety assessment comprising general toxicology, safety pharmacology, developmental and reproductive toxicology, genetic and ocular toxicology, clinical pathology, analytical and bioanalytical analysis, immunology, and biomarker assays; pharmacodynamics services; and services to evaluate and optimize the absorption, distribution, metabolism, and elimination (ADME), as well as pharmacokinetic properties of potential drugs from early discovery projects. Its services also comprise clinical trials; a range of safety assessment services for medical devices, chemicals, and agrochemicals; regulatory consulting services in the areas of pharmaceuticals, biologics, Chinese medicine, medical devices, veterinary medicines, and agrochemicals; and food animal evaluation services comprising candidate selection, efficacy, safety evaluation studies on animals' health products, animal remedies, and fodders. In addition, the company offers traditional animals, such as outbred rats, inbred strain mice, outbred mice, and immunodeficient mice. It serves pharmaceutical, medical device, chemical, biotechnology, and agricultural development companies, as well as regulatory and other government agencies. It serves pharmaceutical, medical device, chemical, biotechnology, and agricultural development companies. The company operates in China, Europe, North America, Southeast Asia, and Australia. The company was founded in 1995 and is based in Beijing, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100176",
        "website": "http://www.joinn-lab.com",
        "market_cap": 54709121024
    },
    "6606.HK": {
        "short_name": "NH HEALTH-B",
        "long_name": "New Horizon Health Limited",
        "summary": "New Horizon Health Limited, an investment holding company, engages in the research and development of screening products for colorectal, cervical, and other types of cancer in the People's Republic of China. The company is also involved in the research and development of medical diagnostic technology; provision of technical transfers and consultation, technical, and medical services, as well as financing services; manufacturing and sales of medical and laboratory equipment, and fecal occult blood test kits; and technological import and export activities. The company was founded in 2013 and is headquartered in Hangzhou, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310052",
        "website": "http://ir.newhorizonbio.com",
        "market_cap": 36717203456
    },
    "8247.HK": {
        "short_name": "BIOSINO BIO-TEC",
        "long_name": "Biosino Bio-Technology and Science Incorporation",
        "summary": "Biosino Bio-Technology and Science Incorporation, together with its subsidiaries, manufactures, sells, and distributes in-vitro diagnostic reagent products primarily in Mainland China. It offers clinical chemistry reagents, including single and double reagents, calibrators, quality control products, and washing solution detergents; flow cytometers and bio chemical analyzers; time-resolved fluoroimmunoassay analyzers; Elisa kits; and rapid tests. The company also provides medical and medical inspection services; produces medical instruments; and distributes immunodiagnostic products, biological reagents, and instruments. Biosino Bio-Technology and Science Incorporation was founded in 1988 and is based in Beijing, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102200",
        "website": "http://www.sinobio.com.cn",
        "market_cap": 191013264
    },
    "BNR": {
        "short_name": "Burning Rock Biotech Limited",
        "long_name": "Burning Rock Biotech Limited",
        "summary": "Burning Rock Biotech Limited primarily develops and provides cancer therapy selection tests in the People's Republic of China. The company primarily offers 12 next-generation sequencing-based cancer therapy selection tests applicable to a range of cancer types, including lung cancer, gastrointestinal cancer, prostate cancer, breast cancer, lymphomas, thyroid cancer, colorectal cancer, ovarian cancer, pancreatic cancer, and bladder cancer using tissue and liquid biopsy samples. Its principal products include OncoScreen IO, a pan-cancer test for tissue samples; OncoCompass IO, the corresponding test for liquid biopsy samples; OncoCompass Target, a ctDNA liquid biopsy-based test for NSCLC; ColonCore for assessing microsatellite loci related to MSI status and detecting mutations in genes associated with gastrointestinal cancers; and OncoScreen ParpMatch and OncoCompass ParpMatch to target critical genes associated with homologous recombination deficiency. The company also offers LungCore for lung cancer, ProstrateCore for prostrate cancer, BreastCore for breast cancer, LymphPlasma for lymphomas, and ThyroCare for thyroid cancer. In addition, it has development and commercialization agreement with Myriad Genetics, Inc. to in-license Myriad myChoice tumor testing in China; and licensing agreement with Oncocyte Corporation to in-license DetermaRx, a risk stratification test for early stage lung cancer patients in China. Burning Rock Biotech Limited has collaborations on clinical trials and research studies with AstraZeneca, Bayer, Johnson & Johnson, Sino Biopharm, CStone and BeiGene. The company was founded in 2014 and is headquartered in Guangzhou, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "NGM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510005",
        "website": "http://www.brbiotech.com",
        "market_cap": 2839523584
    },
    "GTH": {
        "short_name": "Genetron Holdings Limited",
        "long_name": "Genetron Holdings Limited",
        "summary": "Genetron Holdings Limited, a precision oncology company, engages in the cancer molecular profiling, and harnessing technologies in molecular biology and data science for cancer treatment. The company offers diagnosis and monitoring services, and early liver cancer screening services through laboratory developed tests services, such as HCCscreen, a proprietary assay for the early screening of liver cancer. It also provides in-vitro diagnostics products, including 8-gene Lung Cancer Assay, an IVD assay product based on semiconductor sequencing to detect lung cancer; Genetron 3D biochip reading instrument; IDH1/TERT gene assays for glioma; GENETRON S5, a semiconductor sequencer used in the field of gene detection; and Genetron S2000 that enables gene panel sequencing. In addition, the company develops ctDNA Lung Cancer assay for mutations in the epidermal growth factor receptor gene. It also offers development services in the areas of genomics research and clinical development in collaboration with biopharmaceutical companies, hospitals, and research institutions worldwide. The company has a partnership agreement with dMed Biopharmaceutical for new drug research and development in the field of oncology. The company was founded in 2015 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "NGM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102206",
        "website": "http://www.genetronhealth.com",
        "market_cap": 1804095360
    },
    "WUXAY": {
        "short_name": "WUXI APPTEC CO LTD UNSPON ADS E",
        "long_name": "WuXi AppTec Co., Ltd.",
        "summary": "WuXi AppTec Co., Ltd., an investment holding company, provides research, development, and manufacturing services to discover, develop, and manufacture small molecule drugs, and cell and gene therapies in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. The company operates through China-Based Laboratory Services, U.S.-Based Laboratory Services, Clinical Research and Other CRO Services, CDMO Services, and Others segments. It offers laboratory services, such as synthetic chemistry, biology, medicinal chemistry, analytical chemistry, testing, drug metabolism and pharmacokinetics, toxicology, bioanalytical, and medical devices safety testing services, as well as manufacturing and testing for cell and gene therapies, and absorption, distribution, metabolism, and excretion services. The company also provides clinical research services, including clinical development and site management organization services; clinical development services comprising project planning, clinical operation, and monitoring and management of phase I-IV clinical trials, outcomes research, and medical device trials; embedded outsourcing; and clinical informatics services. In addition, it offers CDMO services; and administrative services, as well as sells raw and scrap materials. Further, the company engages in the laboratory-used biological assets cultivation business. WuXi AppTec Co., Ltd. was founded in 2000 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200131",
        "website": "http://www.wuxiapptec.com",
        "market_cap": 59802599424
    },
    "WUXIF": {
        "short_name": "WUXI APPTEC CO LTD",
        "long_name": "WuXi AppTec Co., Ltd.",
        "summary": "WuXi AppTec Co., Ltd., an investment holding company, provides research, development, and manufacturing services to discover, develop, and manufacture small molecule drugs, and cell and gene therapies in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. The company operates through China-Based Laboratory Services, U.S.-Based Laboratory Services, Clinical Research and Other CRO Services, CDMO Services, and Others segments. It offers laboratory services, such as synthetic chemistry, biology, medicinal chemistry, analytical chemistry, testing, drug metabolism and pharmacokinetics, toxicology, bioanalytical, and medical devices safety testing services, as well as manufacturing and testing for cell and gene therapies, and absorption, distribution, metabolism, and excretion services. The company also provides clinical research services, including clinical development and site management organization services; clinical development services comprising project planning, clinical operation, and monitoring and management of phase I-IV clinical trials, outcomes research, and medical device trials; embedded outsourcing; and clinical informatics services. In addition, it offers CDMO services; and administrative services, as well as sells raw and scrap materials. Further, the company engages in the laboratory-used biological assets cultivation business. WuXi AppTec Co., Ltd. was founded in 2000 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200131",
        "website": "http://www.wuxiapptec.com",
        "market_cap": 59653115904
    },
    "WX8.F": {
        "short_name": "WUXI APPTEC H 02359 YC1",
        "long_name": "WuXi AppTec Co., Ltd.",
        "summary": "WuXi AppTec Co., Ltd., an investment holding company, provides research, development, and manufacturing services to discover, develop, and manufacture small molecule drugs, and cell and gene therapies in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. The company operates through China-Based Laboratory Services, U.S.-Based Laboratory Services, Clinical Research and Other CRO Services, CDMO Services, and Others segments. It offers laboratory services, such as synthetic chemistry, biology, medicinal chemistry, analytical chemistry, testing, drug metabolism and pharmacokinetics, toxicology, bioanalytical, and medical devices safety testing services, as well as manufacturing and testing for cell and gene therapies, and absorption, distribution, metabolism, and excretion services. The company also provides clinical research services, including clinical development and site management organization services; clinical development services comprising project planning, clinical operation, and monitoring and management of phase I-IV clinical trials, outcomes research, and medical device trials; embedded outsourcing; and clinical informatics services. In addition, it offers CDMO services; and administrative services, as well as sells raw and scrap materials. Further, the company engages in the laboratory-used biological assets cultivation business. WuXi AppTec Co., Ltd. was founded in 2000 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200131",
        "website": "http://www.wuxiapptec.com",
        "market_cap": 375746035712
    }
}