{
    "000638.SZ": {
        "short_name": "VANFUND URBAN INVE",
        "long_name": "Vanfund Urban Investment and Development Co., Ltd.",
        "summary": "Vanfund Urban Investment and Development Co., Ltd. engages in land consolidation and development activities. It is also involved in mining activities, as well as timber import business. The company was formerly known as Vanfund Real Estate Co., Ltd. and changed its name to Vanfund Urban Investment and Development Co., Ltd. in April 2013. Vanfund Urban Investment and Development Co., Ltd. is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100028",
        "website": "http://www.vanfund.cn",
        "market_cap": "Small Cap"
    },
    "2158.HK": {
        "short_name": "YIDU TECH",
        "long_name": "Yidu Tech Inc.",
        "summary": "Yidu Tech Inc. provides healthcare solutions built on big data and artificial intelligence technologies in China. The company operates through three segments: Big Data Platform and Solutions, Life Sciences Solutions, and Health Management Platform and Solutions. The Big Data Platform and Solutions segment offers the data processing and application platform (DPAP) and its upgraded version Eywa, as well as other solutions to hospitals, regulators, and policy makers. Its DPAP/Eywa platforms aggregate the raw data that reside in the systems and process them into structured and standardized data. These data platforms further empower various applications and solutions for hospitals, such as medical research, clinical diagnosis and treatment, and hospital operations management. The Life Sciences Solutions segment provides analytics-driven clinical development, real-world evidence (RWE)-based research, and digital commercialization solutions to pharmaceutical, biotech and medical device companies. It also offers software and technology platforms to pharmaceutical, biotech and medical device companies, and contract research organizations (CROs) to enhance their clinical trial process. The segment's life sciences solutions serve customers in their drug and medical device development, and commercialization process. The Health Management Platform and Solutions segment offers CausaHealth, a personal health management platform that helps doctors to conduct research and manage their patients. This segment also offers insurance technology and disease management solutions under the CausaCloud brand to insurance companies, and agencies. The company was founded in 2014 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.yidutechgroup.com",
        "market_cap": "Large Cap"
    },
    "2159.HK": {
        "short_name": "MEDIWELCOME",
        "long_name": "Mediwelcome Healthcare Management & Technology Inc.",
        "summary": "Mediwelcome Healthcare Management & Technology Inc. provides integrated healthcare marketing solutions in cardio-cerebral-vascular diseases in China. It offers medical conference, patient education and screening, and marketing strategy and consulting services; and patients' recruitment and clinical data collection services. The company also operates WeChat public account and a mobile app to provide internet hospital services, including online follow up consultation to the physicians' existing patients and e-prescription services. It serves physicians, patients, pharmaceutical companies, medical non-governmental organizations, and hospitals. The company was founded in 2000 and is headquartered in Beijing, the Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.mediwelcome.com",
        "market_cap": "Small Cap"
    },
    "300253.SZ": {
        "short_name": "WINNING HEALTH TEC",
        "long_name": "Winning Health Technology Group Co., Ltd.",
        "summary": "Winning Health Technology Group Co., Ltd. provides IT solutions for hospitals and medical service organizations in China. The company offers IT solution designing, planning and consulting, development, system building, maintenance, and operation services. Its solutions are used in building smart hospitals, regional healthcare regulation platforms, community healthcare regulation platforms, public health-care regulation platforms, medical insurance, and other health services. The company was formerly known as Shanghai Kingstar Winning Software Co., Ltd. and changed its name to Winning Health Technology Group Co., Ltd. in January 2016. The company was founded in 1994 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.winning.com.cn",
        "market_cap": "Large Cap"
    },
    "300288.SZ": {
        "short_name": "GUIYANG LONGMASTER",
        "long_name": "Longmaster Information & Technology Co., Ltd.",
        "summary": "Longmaster Information & Technology Co., Ltd. operates as an Internet medical company in China. The company offers telemedicine, medical information, video consultation, physical hospital, smart hardware, and medical e-commerce services. It also provides telephony voice community phone services; health equipment; online consultancy services, such as medication instructions, referral, free consultation, and other services; and drug search services. In addition, the company maintains health records that enable doctors to monitor the background, early warning, prompting of diseases, and eliminate health risks; provides health care, diet, exercise guidance, health knowledge, and early prevention of health risk services. Longmaster Information & Technology Co., Ltd. was founded in 1998 and is based in Guiyang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guiyang",
        "zipcode": null,
        "website": "http://www.longmaster.com.cn",
        "market_cap": "Mid Cap"
    },
    "300550.SZ": {
        "short_name": "HEREN HEALTH CO LT",
        "long_name": "Heren Health Co., Ltd.",
        "summary": "Heren Health Co., Ltd. provides solutions and services for medical information, hospital scenario applications, and regional health information to hospitals, governments, and individuals in China. The company was founded in 2010 and is headquartered in Hangzhou, China. Heren Health Co., Ltd. operates as a subsidiary of Hangzhou Panyuan Investment Co., Ltd.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310051",
        "website": "http://www.herenit.com",
        "market_cap": "Mid Cap"
    },
    "600767.SS": {
        "short_name": "WINSAN(CHENGDU)MEDICAL SCIE & T",
        "long_name": "Winsan (Chengdu) Medical Science and Technology Co., Ltd.",
        "summary": "Winsan (Chengdu) Medical Science and Technology Co., Ltd. engages in the medical informatization, telemedicine, Internet health management, medical equipment, and medical services in China. It offers health information system that provides regional population health, Chinese medicine, and hospital performance management informationization, as well as home pension, chronic disease management, remote diagnosis and treatment, medical insurance, and pharmacy services. The company also operates Jingde County Chinese Medicine Hospital, a non-profit second-class Chinese medicine hospital. It provides medical testing reagents, instruments, consumables, and other products to medical institutions and clinical medical examination services. The company was formerly known as Winsan (Shanghai) Medical Science and Technology Co., Ltd. and changed its name to Winsan (Chengdu) Medical Science and Technology Co., Ltd. in April 2020. The company was founded in 1993 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.winsan.cn",
        "market_cap": "Small Cap"
    },
    "603990.SS": {
        "short_name": "SUZHOU MEDICALSYSTEM TECHNOLOGY",
        "long_name": "Suzhou MedicalSystem Technology Co., Ltd.",
        "summary": "Suzhou MedicalSystem Technology Co., Ltd. provides solutions in clinical informatics and digital hospital field in China. It offers DoCare anesthesia clinical information system that focuses on serving the perioperative clinical work; and provides streamlined, informational, automatic, and intelligent integrated management platform for clinical business. The company also provides DoCare intensive auxiliary diagnosis clinical information system that mines and scientifically analyzes for ICU patients' treatment data with medical information, such as patients' treatment information, inspection information, nursing information, and doctor's advice data. In addition, it offers DoCare operative medical behavior management system that establishes the intelligent management system for the operation resources and personnel behavior; and DoCare emergency clinical information system for management of emergency clinical, including pre-hospital first aid, pre-examination and triage, emergency rescue, emergency under observation, emergency operating room, emergency ICU, and patient outcome. Further, the company provides DoCare pre-hospital first aid clinical information system that provides a unified service platform, which has digital information for emergency command center, emergency doctors, emergency nurses, visiting medical personnel, and patients. Additionally, it offers smart OT, ICU, and emergency solutions; and smart specialty solutions, such as laminar airflow room, clinical pathway, and mobile nursing information systems, as well as central sterile supply department management systems. The company was founded in 2005 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215000",
        "website": "http://www.medicalsystem.com.cn",
        "market_cap": "Mid Cap"
    },
    "688555.SS": {
        "short_name": "ESSENCE INFORMATION TECHNOLOGY ",
        "long_name": "Essence Information Technology Co., Ltd.",
        "summary": "Essence Information Technology Co., Ltd. operates as an information technology medical and health industry chain solution provider. The company provides its services in the areas of smart medicine, healthcare, manufacturing, and health, as well as big data and solutions. It offers drug safety supervision, food safety regulatory, medical device safety supervision, special equipment safety supervision, food and drug traceability, market supervision integrated business management, and government public service platforms. Essence Information Technology Co., Ltd. was founded in 2013 and is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300457",
        "website": "http://www.sino-essence.com",
        "market_cap": "Mid Cap"
    },
    "MDCE": {
        "short_name": "MEDICAL CARE TECHNOLOGIES INC",
        "long_name": "Medical Care Technologies Inc.",
        "summary": "Medical Care Technologies Inc., a development stage company, engages in opening and operating children's integrated health and wellness centers in China. The company sells and distributes pharmaceutical and nutraceutical products, and other merchandise, including over-the-counter medicines, herbal products, personal care products, and family care products. It serves retail pharmacies, pharmaceutical companies, hospitals, physicians' office practices, and consumers; and industrial and food microbiology laboratories. The company offers its products through its pediatric health and wellness centers, Website, and retail pharmacies, as well as through sales and distribution channels, and directly to end-users through independent sales representatives. Medical Care Technologies Inc. was founded in 2007 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "10009",
        "website": "http://www.medicaretechinc.com",
        "market_cap": "Small Cap"
    },
    "PANHF": {
        "short_name": "PING AN HEALTHCARE & TECHNO CO ",
        "long_name": "Ping An Healthcare and Technology Company Limited",
        "summary": "Ping An Healthcare and Technology Company Limited, together with its subsidiaries, operates an online healthcare services platform in the People's Republic of China. It offers online medical services, such as online consultation, hospital referral and appointment, inpatient arrangement, and second opinion services; and consumer healthcare services, including various standardized service packages that integrate services at healthcare institutions. The company also provides healthcare products comprising medicines, health supplements, and medical devices; wellness products comprising fitness equipment and accessories, and personal care products; and other products. In addition, it offers health management and wellness interaction services, such as wellness programs, tools and activities, and personalized content. Further, the company provides medicine marketing services; technology services; application development and operation services; and hospital and clinic services, as well as operates an insurance agency. Ping An Healthcare and Technology Company Limited was incorporated in 2014 and is headquartered in Shanghai, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.pagd.net",
        "market_cap": "Large Cap"
    },
    "QDMI": {
        "short_name": "QDM INTL INC",
        "long_name": "QDM International Inc.",
        "summary": "QDM International Inc. operates as an insurance brokerage company primarily in Hong Kong. It sells a range of insurance products consisting of life and medical insurance, such as individual life insurance; and general insurance, such as automobile insurance, commercial property insurance, liability insurance, and homeowner insurance. The company was incorporated in 2020 and is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200051",
        "website": null,
        "market_cap": "Small Cap"
    },
    "SY": {
        "short_name": "So-Young International Inc. - A",
        "long_name": "So-Young International Inc.",
        "summary": "So-Young International Inc. operates an online platform for medical aesthetics and consumption healthcare services focusing on discretionary medical treatments. Its platform enables users to discover content and share their own experience on medical aesthetics procedures and leads users to reserve treatment services from medical aesthetic service providers for offline treatment in the People's Republic of China and internationally. The company facilitates research on medical aesthetic treatment trends; ratings and reviews on treatment experiences; and blogs under the name Beauty Diaries. It also provides reservation services in the areas of dermatology, dentistry and orthodontics, ophthalmology, physical examinations, gynecology, human papilloma virus vaccines, and postnatal care; Software as a Service; and guiding and consulting services through training programs for medical service providers. In addition, the company offers internet information and technology advisory, management consulting, and Internet culture services, as well as sells medical equipment. As of December 31, 2020, it had approximately 6,900 medical aesthetic service providers and 4,200 other consumption healthcare service providers on its platform. The company was founded in 2013 and is headquartered in Beijing, China.So-Young International Inc. operates an online platform for medical aesthetics and consumption healthcare services focusing on discretionary medical treatments. Its platform enables users to discover content and share their own experience on medical aesthetics procedures and leads users to reserve treatment services from medical aesthetic service providers for offline treatment in the People's Republic of China and internationally. The company facilitates research on medical aesthetic treatment trends; ratings and reviews on treatment experiences; and blogs under the name Beauty Diaries. It also provides reservation services in the areas of dermatology, dentistry and orthodontics, ophthalmology, physical examinations, gynecology, human papilloma virus vaccines, and postnatal care; Software as a Service; and guiding and consulting services through training programs for medical service providers. In addition, the company offers internet information and technology advisory, management consulting, and Internet culture services, as well as sells medical equipment. As of December 31, 2020, it had approximately 6,900 medical aesthetic service providers and 4,200 other consumption healthcare service providers on its platform. The company was founded in 2013 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NGM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.soyoung.com",
        "market_cap": "Small Cap"
    },
    "ZCMD": {
        "short_name": "Zhongchao Inc.",
        "long_name": "Zhongchao Inc.",
        "summary": "Zhongchao Inc. provides healthcare information, education, and training services in China. It offers online and onsite health information services, healthcare education programs, and healthcare training products, including clinical practice training, open classes of popular medical topics, interactive case studies, academic conference and workshops, continuing education courses, and articles and short videos with educational healthcare content. The company operates through its mdmooc.org online platform, as well as Sunshine Health Forums, a Wechat subscription account and mobile app. It serves enterprises, non-for-profit organizations, and medical journals, as well as healthcare professionals, nurses, doctors, and other healthcare workers. The company was founded in 2012 and is headquartered in Shanghai, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200040",
        "website": "http://www.izcmd.com",
        "market_cap": "Small Cap"
    }
}