{
  "002932.SZ": {
    "city": "Wuhan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Medical Devices",
    "long_name": "Wuhan Easy Diagnosis Biomedicine Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "WUHAN EASY DIAGNOS",
    "state": null,
    "summary": "Wuhan EasyDiagnosis Biomedicine Co.,Ltd. engages in the development, production, and sale of in vitro and POCT rapid diagnostic reagents and related equipment in China and internationally. It offers products in the areas of cardiovascular, kidney, infectious, diabetes, endocrine and metabolic, obstetrics and gynecology, and eugenics diseases, as well as health inspection and other products; and chemiluminescence detection kit and analyzers, blood gas analyzers, mobile electrocardiography, and molecular diagnosis products. The company is based in Wuhan, China.",
    "website": "http://www.mdeasydiagnosis.com",
    "zipcode": "430074"
  },
  "0853.HK": {
    "city": "Shanghai",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Devices",
    "long_name": "MicroPort Scientific Corporation",
    "market": "hk_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "MICROPORT",
    "state": null,
    "summary": "MicroPort Scientific Corporation, an investment holding company, manufactures, and markets, and distributes medical devices in the People's Republic of China, North America, Europe, other Asian countries, South America, and internationally. The company's Cardiovascular Devices segment provides coronary stents and related delivery systems; and balloon catheters and accessories. Its Orthopedics Devices segment offers reconstructive joints, spine and trauma, and other professional implants and equipment. The company's Cardiac Rhythm Management Business segment develops, manufactures, and markets defibrillators, cardiac resynchronization therapy devices, and pacemakers for the diagnosis, treatment, and management of heart rhythm disorders and heart failure. Its Endovascular and Peripheral Vascular Devices segment provides products and services for the interventional treatment of thoracic and abdominal aortic aneurysm, peripheral vascular diseases, aortic dissection, and other endovascular related diseases. The company's Neurovascular Devices segment provides products and services for neurovascular diseases, such as cerebral aneurysms, intracranial atherosclerotic diseases, carotid artery diseases, and other neurovasculature related diseases. Its Surgical Devices segment researches and develops, manufactures, and sells surgical devices. The company's Heart Valve Business segment engages in the research and development, manufacture, and sale of VitaFlow Transcatheter aortic valve and delivery system for the treatment of valvular heart diseases. Its Surgical Robot Business segment provides research and technology integration in the fields of robot, intelligent control, and information to provide medical products. MicroPort Scientific Corporation was founded in 1998 and is headquartered in Shanghai, the People's Republic of China.",
    "website": "http://www.microport.com",
    "zipcode": "201203"
  },
  "1302.HK": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Devices",
    "long_name": "LifeTech Scientific Corporation",
    "market": "hk_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "LIFETECH SCI",
    "state": null,
    "summary": "LifeTech Scientific Corporation, an investment holding company, develops, manufactures, and trades in interventional medical devices for cardiovascular and peripheral vascular diseases and disorders. The company operates through Structural Heart Diseases Business, Peripheral Vascular Diseases Business, and Cardiac Pacing and Electrophysiology Business segments. Its products include LAmbre left atrial appendage closure systems, as well as CeraFlex, Cera, Heart, and Konara-MF VSD occluders; Ankura thoracic aortic aneurysm and abdominal aortic aneurysm stent graft systems; delivery systems, such as Fustar steerable and SteerEase introducers; Aegisy vena cava filters; Cera vascular plug systems; AcuMark sizing balloons; LawMax dilators; and SeQure snare systems, as well as pacemakers. The company is also involved in the biomedical research and development; import and export business; development, manufacture, and sale of medical polymer materials and products; manufacturing and trading of materials for hemp; investment in medical projects; staff training and internal personnel management business; information consulting for investors; and import and export, sale, and distribution of medical and paramedical devices, including software and accessories and related services, as well as technical consultation, technology transfer, technical, consulting, and technology services. It has operations in the People's Republic of China, India, rest of Asia, Europe, South America, Africa, and internationally. LifeTech Scientific Corporation was founded in 1999 and is headquartered in Shenzhen, the People's Republic of China.",
    "website": "http://www.lifetechmed.com",
    "zipcode": "518057"
  },
  "1858.HK": {
    "city": "Beijing",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Devices",
    "long_name": "Beijing Chunlizhengda Medical Instruments Co., Ltd.",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "CHUNLI MEDICAL",
    "state": null,
    "summary": "Beijing Chunlizhengda Medical Instruments Co., Ltd., an orthopedic medical device company, engages in the research and development, production, and sale of surgical implants, instruments, and related products in the People's Republic of China. The company offers implantable orthopedic medical devices, which consist of joint prosthesis products and spinal products. It primarily sells its products through distributors, or on ODM and OEM bases under the Chunli brand, as well as to hospitals directly. The company also exports its products to 38 countries and regions in Asia, South America, Africa, Oceania, and Europe. Beijing Chunlizhengda Medical Instruments Co., Ltd. was incorporated in 1998 and is headquartered in Beijing, China.",
    "website": "http://www.clzd.com/tc/index.php",
    "zipcode": null
  },
  "2160.HK": {
    "city": "Shanghai",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Devices",
    "long_name": "MicroPort CardioFlow Medtech Corporation",
    "market": "hk_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "CARDIOFLOW-B",
    "state": null,
    "summary": "MicroPort CardioFlow Medtech Corporation, a medical device company, focuses on the research, development, and commercialization of transcatheter and surgical solutions for valvular heart diseases in the People's Republic of China. Its products include Vitaflow Aortic Valve System, Alwide Balloon Catheter, and Alpass Introducer Set, which targets aortic, mitral, tricuspid, and surgical valves, as well as procedural accessories. The company was founded in 2010 and is headquartered in Shanghai, China. MicroPort CardioFlow Medtech Corporation is a subsidiary of Shanghai MicroPort Limited.",
    "website": "http://www.cardioflowmedtech.com",
    "zipcode": "201203"
  },
  "2393.HK": {
    "city": "Shanghai",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Devices",
    "long_name": "Yestar Healthcare Holdings Company Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "YESTAR HEALTH",
    "state": null,
    "summary": "Yestar Healthcare Holdings Company Limited, an investment holding company, engages in the manufacture, distribution, and sale of medical imaging products in Mainland China. It operates through two segments, Imaging Printing Products, and Medical Products and Equipment. The Imaging Printing Products segment manufactures and sells Fujifilm color photographic paper, industrial NDT X-ray films, and PWB films; and trades in imaging equipment. Its products are used in professional and minilabs; and industrial imaging applications. This segment provides NDT X-ray films under the Yes!Star brand. The Medical Products and Equipment segment manufactures and sells medical dry and wet films, and dental films; and sells medical equipment and diagnostic reagents. The company also distributes in vitro diagnostic products. In addition, it engages in the biotechnology development activities; management of supply chain; and freight transportation services. The company was formerly known as Yestar International Holdings Company Limited and changed its name to Yestar Healthcare Holdings Company Limited in January 2017. Yestar Healthcare Holdings Company Limited was founded in 1971 and is headquartered in Shanghai, the People's Republic of China.",
    "website": "http://www.yestarcorp.com",
    "zipcode": "201199"
  },
  "2500.HK": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Devices",
    "long_name": "Venus Medtech (Hangzhou) Inc.",
    "market": "hk_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "VENUS MEDTECH-B",
    "state": null,
    "summary": "Venus Medtech (Hangzhou) Inc. develops and sells transcatheter heart valve medical devices in Mainland China and internationally. The company's products include VenusA-Valve, a transcatheter aortic heart valve replacement (TAVR) product to treat severe aortic stenosis; VenusP-Valve is a transcatheter pulmonary valve system to treat the dysfunction of right ventricular outflow tract; V8/TAV8 balloon aortic valvuloplasty catheter systems; and TriGUARD3, a cerebral embolic protection device for minimizing the risk of cerebral damage during TAVR and other structural heart procedures. It also develops VenusA-Plus and VenusA-Pilot, which are TAVR product candidates; and transcatheter mitral and tricuspid valve replacement products. The company was founded in 2009 and is headquartered in Hangzhou, the People's Republic of China.",
    "website": "http://www.venusmedtech.com",
    "zipcode": null
  },
  "300003.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Medical Devices",
    "long_name": "Lepu Medical Technology (Beijing) Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "LEPU MEDICAL TECHN",
    "state": null,
    "summary": "Lepu Medical Technology (Beijing) Co., Ltd. develops, produces, and sells medical devices and equipment. The company offers cardiovascular interventional products, such as coronary stents and balloons, catheters, guide wires, introducer sheaths, tourniquets, inflation devices, and PCI accessories; structural heart diseases products, including occluders, vascular plugs, delivery systems, and mechanical heart valves; cardiac rhythm management products, which include pacemakers, equipment, leads, and electrophysiology; off-pump coronary artery bypass grafting surgical cardiology products; and PTA balloons and guide wires peripheral interventional products. It also provides critical care products, such as vascular access products, needle free connectors, blood samplers, and pressure transducers; floor and suspended type digital subtraction angiography systems; in vitro diagnostic equipment and biomarkers; hemodialysis catheters and hollow fiber dialyzers; and general surgery products, including surgical staplers and endo surgery accessories. In addition, the company offers cardiovascular system drugs, such as antithrombotic, hypolipidemic, antihypertensive, antianginal, and heart failure treatment; ß-lactamase antibiotics and antifungal antimicrobial drugs; central nervous system drugs comprises painkillers and antidepressants; gastric/duodenal ulcer and chronic liver disease treatment drugs; respiratory system drugs; hypoproteinemia drugs; and activating blood circulation drugs. Further, it provides precision medicine, ECG telemonitoring, and cardiovascular disease consulting and management center services; medical S&T incubation and equity investment, and medical financial services; consultation, online pharmacy, and household medical equipment services; smart devices; and specialized hospital services for cardiovascular diseases, as well as involved in the co-construction of Cath lab. The company was founded in 1999 and is headquartered in Beijing, China.",
    "website": "http://en.lepumedical.com",
    "zipcode": "102200"
  },
  "300206.SZ": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Medical Devices",
    "long_name": "Edan Instruments, Inc.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "EDAN INSTRUMENTS I",
    "state": null,
    "summary": "Edan Instruments, Inc. engages in the research, development, manufacture, and sale of medical equipment worldwide. The company offers diagnostic electrocardiograph (ECG) products, including resting ECG, stress test, holter, wireless solution, and ECG workstation products; patient monitoring systems, such as vital signs, transport, and central monitoring systems, as well as high acuity cares, acute and sub-acute cares, telemetry, and pulse oximetry products; and obstetrics and gynecology products comprising fetal and maternal monitoring systems, fetal telemetry systems, ultrasonic doppler systems, and video colposcopes. It also provides ultrasound imaging systems that include color doppler ultrasound and B/W digital ultrasound systems; and in-vitro diagnostics, which comprise hematology analyzers. In addition, the company offers point-of-care testing systems, including blood gas and chemistry, magnetic immunoassay, and colloidal gold-labeled immunoassay analyzers; and veterinary ultrasound, ECG, ABG, and monitoring products. Edan Instruments, Inc. is headquartered in Shenzhen, the People's Republic of China.",
    "website": "http://www.edan.com.cn",
    "zipcode": "518122"
  },
  "300246.SZ": {
    "city": "Zhuhai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Medical Devices",
    "long_name": "Guangdong Biolight Meditech Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "GUANGDONG BIOLIGHT",
    "state": null,
    "summary": "Guangdong Biolight Meditech Co., Ltd. engages in the research and development, marketing, sale, and service of medical devices, medical consumables, and healthcare solutions. It offers patient monitors, ECG machines, fetal monitors, hemodialysis products, homecare medical products, medical pumps, veterinary monitors, and accessories. The company operates in Asia, Africa, Europe, North America, and Latin America. Guangdong Biolight Meditech Co., Ltd. was founded in 1993 and is headquartered in Zhuhai, China.",
    "website": "http://www.blt.com.cn",
    "zipcode": null
  },
  "300273.SZ": {
    "city": "Zhuhai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Medical Devices",
    "long_name": "Zhuhai Hokai Medical Instruments Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "ZHUHAI HOKAI MEDIC",
    "state": null,
    "summary": "Zhuhai Hokai Medical Instruments Co., Ltd. provides medical equipment in China. The company offers minimally invasive tumor, medical imaging, and rehabilitation and conventional equipment; tumor and interventional discipline, and rehabilitation discipline construction services; artificial intelligence system solutions; and medical gas, clean, and auxiliary engineering services. It also provides in-hospital and regional medical information, and telemedicine services, as well as hospital construction; medical supply chain and logistics management; and financial leasing services. Zhuhai Hokai Medical Instruments Co., Ltd. was founded in 1996 and is headquartered in Zhuhai, China.",
    "website": "http://www.hokai.com",
    "zipcode": "519030"
  },
  "300289.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Medical Devices",
    "long_name": "Beijing Leadman Biochemistry Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "BEIJING LEADMAN BI",
    "state": null,
    "summary": "Beijing Leadman Biochemistry Co.,Ltd. engages in the research and development, manufacture, and sale of in vitro diagnostic products in the People's Republic of China. The company offers biochemical raw materials, such as enzymes, coenzymes, antibodies, buffers, enzyme substrates, culture media, stain reagents, amino acids, and other products primarily for biotechnology, clinical diagnosis, drug development, chemical production, and other related applications. It also provides biochemistry diagnostic and companion reagents. In addition, the company offers medical instruments, such as EnigmaML, an automated molecular test platform for use in clinical laboratory and at the point-of-care, including clinics, doctor's surgeries, and pharmacies; DiaSys InnovaStar, an automatic compact POCT analyzer to deliver result quality comparable to measurements on laboratory analyzers; DiaSys Respons, a random access bench top analyzer; CI1000 automatic chemiluminescence immunoassay analyzers; and IDS-isys, an instrument to enhance performance and productivity. The company was founded in 1997 and is headquartered in Beijing, the People's Republic of China.",
    "website": "http://www.leadmanbio.com",
    "zipcode": "100176"
  },
  "300298.SZ": {
    "city": "Changsha",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Medical Devices",
    "long_name": "Sinocare Inc.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "SINOCARE INC",
    "state": null,
    "summary": "Sinocare Inc. engages in the development, manufacture, and marketing of diagnosis rapid testing products primarily in the People's Republic of China. It offers Safe-Accu blood glucose monitoring systems; Safe-AQ blood glucose monitoring systems; Gold-Accu blood glucose monitoring systems; Safe-Accu UG blood, glucose, and uric acid monitoring systems; Safe-Accu KG blood, glucose, and ketone monitoring systems; and D Nurse mobile glucose meters. The company provides its products for the patients with chronic diseases and diabetes, as well as for healthcare professionals. It also exports its products to 135 countries. Sinocare Inc. was founded in 2002 and is based in Changsha, the People's Republic of China.",
    "website": "http://www.sinocare.com",
    "zipcode": "410205"
  },
  "300314.SZ": {
    "city": "Ningbo",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Medical Devices",
    "long_name": "Ningbo David Medical Device Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "NINGBO DAVID MEDIC",
    "state": null,
    "summary": "Ningbo David Medical Device Co., Ltd. engages in the research and development, production, and distribution of medical equipment in China and internationally. The company primarily provides infant incubators, transport incubators, infant radiant warmers, neonate bilirubin phototherapy equipment, infant resuscitators, etc. It also offers other products, such as infusion pumps, ultrasonic doppler fetal heartbeat detectors, transcutaneous jaundice detectors, infant t-piece resuscitators, air/oxygen blenders, low pressure aspirators, breath resuscitation bags, infant oxygen hoods, far infrared heaters, mother-infant beds, and infant head fixing units. The company offers its products under David brand name. Ningbo David Medical Device Co., Ltd. was founded in 1992 and is headquartered in Ningbo, China.",
    "website": "http://www.nbdavid.com",
    "zipcode": "315712"
  },
  "300318.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Medical Devices",
    "long_name": "Beijing Bohui Innovation Biotechnology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "BEIJING BOHUI INNO",
    "state": null,
    "summary": "Beijing Bohui Innovation Biotechnology Co., Ltd. engages in the research and development, production, sale, and after-sale service of diagnostic products in China. It offers GenPlex, a microfluidic automated nucleic acid detection system, fluorescence immunochromatography analyzer, and human body element detection system; and chemical analysis products, such as atomic fluorescence spectrometer, mass spectrometers, chip ion sources, microfluidic flow chemical analysis systems, life sciences related consumables, and ICP spectrum. The company was formerly known as Beijing Bohui Innovation Technology Co., Ltd. and changed its name to Beijing Bohui Innovation Biotechnology Co., Ltd. in July 2018. Beijing Bohui Innovation Biotechnology Co., Ltd. was founded in 2001 and is headquartered in Beijing, China.",
    "website": "http://www.bohui-tech.com",
    "zipcode": null
  },
  "300529.SZ": {
    "city": "Zhuhai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Medical Devices",
    "long_name": "Jafron Biomedical Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "JAFRON BIOMEDICAL",
    "state": null,
    "summary": "Jafron Biomedical Co.,Ltd. engages in the research, development, production, and marketing of biomaterials and medical devices in China. It offers solutions for kidney, liver, critical, and rheumatoid immune diseases, as well as poisoning; adsorption products and blood purification machines; and other products, such as disinfectants, online hemodialysis B powder bags/buckets, hemodialysis concentrates, PGA absorbable sutures with needles, and resin bandages. The company offers its products in Germany, Austria, Greece, Turkey, Vietnam, India, Thailand, Iran, Malaysia, Bangladesh, Bulgaria, the Philippines, Sweden, Uganda, Ethiopia, and internationally. Jafron Biomedical Co.,Ltd. was founded in 1989 and is based in Zhuhai, China.",
    "website": "http://www.jafron.com",
    "zipcode": "519085"
  },
  "300562.SZ": {
    "city": "Zhongshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Medical Devices",
    "long_name": "Guangdong Transtek Medical Electronics Co., Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "GUANGDONG TRANSTEK",
    "state": null,
    "summary": "Guangdong Transtek Medical Electronics Co., Ltd designs, manufactures, and sells medically approved products, connected healthcare devices, and smart wearables in China. The company offers wearable devices, such as mambo 2, ziva, bonbon, mambo HR, and mambo watches; blood pressure monitors; and electronic scales. Guangdong Transtek Medical Electronics Co., Ltd was founded in 2002 and is based in Zhongshan, China.",
    "website": "http://www.transtek.cn",
    "zipcode": null
  },
  "300633.SZ": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Medical Devices",
    "long_name": "SonoScape Medical Corp.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "SONOSCAPE MEDICAL",
    "state": null,
    "summary": "SonoScape Medical Corp. develops and manufactures medical equipment in China and internationally. The company offers ultrasound diagnostic systems, such as trolley color Doppler, portable color Doppler, B/W ultrasound, and veterinary ultrasound equipment; and endoscopy equipment, such as image processors, light sources, and gastroenterology products. It also provides technical and spare parts support, training, upgradation, and field services. SonoScape Medical Corp. was founded in 2002 and is based in Shenzhen, China.",
    "website": "http://www.sonoscape.com",
    "zipcode": null
  },
  "300642.SZ": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Medical Devices",
    "long_name": "Tellgen Corporation",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "TELLGEN CORPORATIO",
    "state": null,
    "summary": "Tellgen Corporation researches and develops, manufactures, and distributes IVDs in China and internationally. It offers tumor markers, human papilloma virus test kits, ToRCH products, Y chromosome microdeletions test kits, and multiplex immunoassay systems. The company was founded in 2003 and is based in Shanghai, China.",
    "website": "http://www.tellgen.com",
    "zipcode": "201203"
  },
  "300760.SZ": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Medical Devices",
    "long_name": "Shenzhen Mindray Bio-Medical Electronics Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "SHENZHEN MINDRAY B",
    "state": null,
    "summary": "Shenzhen Mindray Bio-Medical Electronics Co., Ltd. provides medical devices and solutions in the People's Republic of China. The company offers patient monitoring and life support products, such as patient monitoring systems, electrocardiographs, defibrillators, anesthesia machines, ventilators, infusion pumps, surgical lights, operating tables, medical supply units, endoscopes, and accessories, as well as emergency care, peri-operative care, critical care, and IT solutions. It also provides in-vitro diagnostics products, including hematology and chemistry analyzers and reagents, chemiluminescence immunoassay products, hemoglobin systems, flow cytometry products, and micro plate readers and washers; medical imaging systems comprising ultrasound and radiology products; and veterinary products. The company was founded in 1991 and is headquartered in Shenzhen, the People's Republic of China. Shenzhen Mindray Bio-Medical Electronics Co., Ltd. is a subsidiary of Mindray Medical International Limited.",
    "website": "http://www.mindray.com",
    "zipcode": "518057"
  },
  "300813.SZ": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Medical Devices",
    "long_name": "Zhejiang Tailin BioEngineering Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "ZHEJIANG TAILIN BI",
    "state": null,
    "summary": "Zhejiang Tailin BioEngineering Co.,Ltd manufactures microbial test and control equipment, mainly for pharmaceutical and medical sector. The company offers sterility testing equipment, microbiological testing equipment, TOC analyzers, sterile isolation systems, hydrogen peroxide sterilization systems, sterile delivery system, and filters, as well as technical services. Its products are primarily used in bio-pharmaceutical, medical, disease control, food, environmental protection, electronics, and other fields, as well as in bio-security equipment manufacturing industries. The company was formerly known as Hangzhou Tailin Biotechnology Equipment Co., Ltd. and changed its name to Zhejiang Tailin BioEngineering Co.,Ltd in April 2015. Zhejiang Tailin BioEngineering Co.,Ltd was founded in 1993 and is based in Hangzhou, China.",
    "website": "http://www.tailingood.com",
    "zipcode": "310052"
  },
  "300869.SZ": {
    "city": "Qinhuangdao",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Medical Devices",
    "long_name": "Contec Medical Systems Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "CONTEC MEDICAL SYS",
    "state": null,
    "summary": "Contec Medical Systems Co.,Ltd engages in the research, manufacture, and distribution of medical instruments. The company's products include electronic sphygmomanometers, ambulatory blood pressure monitors, pulse oximeters, monitors, stethoscopes, simulators, analyzers, nebulizers, ultrasound equipment, oxygen concentrators, predictive thermometers, syringe and infusion pumps, and EMG/EP systems; ECG monitors and workstations; and EEG, pulmonary function, home, telemedicine, veterinary, electronic colposcopy, and Capnography related products. It sells its products through distributors in China and internationally. The company was founded in 1992 and is based in Qinhuangdao, China.",
    "website": "http://www.contecmed.com",
    "zipcode": "066004"
  },
  "4745.TWO": {
    "city": "Shanghai",
    "country": "China",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Medical Devices",
    "long_name": "Cowealth Medical Holding Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "COWEALTH MEDICAL HOLDING CO LTD",
    "state": null,
    "summary": "Cowealth Medical Holding Co., Ltd. operates as a medical distribution company primarily in the diagnostic clinical laboratory field in Greater China market. It also specializes in reagent, cross-strait hospital department cooperation, and radiotherapy fields. In addition, the company undertakes the Summit project, which consolidates outside procurement of diagnostic reagents at prices as before; and provides related with related logistics management services. The company was founded in 1997 and is based in Shanghai, China.",
    "website": "http://www.cowealthholding.com",
    "zipcode": "200233"
  },
  "4WO.F": {
    "city": "Suzhou",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Medical Devices",
    "long_name": "Peijia Medical Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "PEIJIA MEDICAL  HD -,01",
    "state": null,
    "summary": "Peijia Medical Limited engages in the research, development, production, and sales of interventional procedural medical devices for the treatment of structural heart and neurovascular diseases. Its product candidates include transcatheter aortic valve replacement (TAVR) products, such as TaurusOne, a transcatheter aortic valve replacement system, including prosthetic aortic valve, delivery catheter system, and LS; TaurusElite, a second-generation TAVR device; and TaurusNXT, a third-generation TAVR device. The company is also developing transcatheter mitral valve replacement devices for the treatment of mitral regurgitation; and transcatheter tricuspid valve replacement devices for the treatment of tricuspid regurgitation. In addition, it is developing lithotripsy and balloon aortic valvuloplasty catheters, introducer sheaths, guidewires, and mitral repair devices. Further, the company is developing neurointerventional procedural products, such as stent retrievers; balloon guide and dilatation, distal access, intermediate, and aspiration catheters; and balloon microcatheter, heat-fusion detachable coils, intracranial stents, and detachable coils. Peijia Medical Limited was founded in 2012 and is headquartered in Suzhou, the People's Republic of China.",
    "website": "http://www.peijiamedical.com",
    "zipcode": "215028"
  },
  "600055.SS": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Medical Devices",
    "long_name": "Beijing Wandong Medical Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "BEIJING WANDONG MEDICAL TECHNOL",
    "state": null,
    "summary": "Beijing Wandong Medical Technology Co., Ltd. engages in the research and development, manufacturing, and sale of medical diagnostic equipment. The company offers MRI solutions; radiological imaging solutions, including CT system, CGO series, DR system, DRF system, digital mammography, general and mobile X-ray, and C-arm equipment; and veterinary imaging solutions. It operates in approximately 70 countries worldwide. The company was formerly known as China Resources Wandong Medical Equipment Co., Ltd. The company was founded in 1955 and is headquartered in Beijing, China.",
    "website": "http://www.wandong.com.cn",
    "zipcode": "100015"
  },
  "600587.SS": {
    "city": "Zibo",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Medical Devices",
    "long_name": "Shinva Medical Instrument Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "SHINVA MEDICAL INSTRUMENT CO LT",
    "state": null,
    "summary": "Shinva Medical Instrument Co., Ltd. provides medical instruments and equipment in the People's Republic of China. It offers dental devices, diagnostic equipment, environmental protection equipment, laboratory instruments, OR equipment, and air disinfectors; and radiation oncology products, such as linear accelerators, simulators, brachytherapy systems, Cobalt 60 therapy units, 3D treatment planning systems, radiotherapy networking information systems, and radiotherapy accessories. The company also provides infection control equipment and consumables; pharmaceutical equipment, including washing, sterilization, IV solution, packing, lyophilization, solid, extraction, package material, automatic ampoule impurity detecting, vials sterile filling, biological reaction tank equipment, as well as process information system; and integrated solutions and medical medicine services. Shinva Medical Instrument Co., Ltd. was founded in 1943 and is based in Zibo, the People's Republic of China.",
    "website": "http://www.shinva.com",
    "zipcode": "255086"
  },
  "603387.SS": {
    "city": "Nanjing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Medical Devices",
    "long_name": "Getein Biotech, Inc",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "GETEIN BIOTECH INC",
    "state": null,
    "summary": "Getein Biotech, Inc researches, develops, produces, and sells in vitro diagnostic products in China and internationally. The company provides diagnostic reagents and analyzers; calibrators; reagent raw materials, such as monoclonal and polyclonal antibodies, antigen, antiserum, and microsphere; and cardiac marker, inflammation, renal function, coagulation, thyroid function, fertility, diabetes care, and thrombus products. It also offers products in the area of cardiovascular, inflammatory, diabetes, fertility, renal, liver, and others. The company was founded in 2002 and is headquartered in Nanjing, China.",
    "website": "http://www.bio-gp.com.cn",
    "zipcode": "211505"
  },
  "6118.HK": {
    "city": "Beijing",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Devices",
    "long_name": "Austar Lifesciences Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "AUSTAR",
    "state": null,
    "summary": "Austar Lifesciences Limited, an investment holding company, provides integrated engineering solutions to pharmaceutical manufacturers and research institutes in Mainland China and internationally. It operates through six segments: Liquid and Bioprocess System; Clean Room and Automation Control and Monitoring System; Powder and Solid System; GMP Compliance Service; Life Science Consumables; and Distribution and Agency of Pharmaceutical Equipment. The company offers liquid and bioprocess systems, including pharmaceutical water, and liquid preparation and bioprocess systems; powder and solid systems; clean utility equipment and systems; clean room, automation control, and monitor systems; and freeze-dryer, sterile filling, and visual inspection equipment. It also provides pharmaceutical process contamination control products; packaging and aseptic containment products; biosafety and lab animal equipment and consumables; laboratory one-stop solutions; and single-use bioprocess equipment and consumables. In addition, the company offers design, quality risk control, consulting, research and development support, process engineering, digitalization construction, after-sale, in-site, upgrading, relocation, and asset management services. Further, it is involved in the agency and distribution of pharmaceutical equipment, as well as provides assembly and pre-assembly services. The company was founded in 1991 and is headquartered in Beijing, China.",
    "website": "http://www.austar.com.hk",
    "zipcode": null
  },
  "688016.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Medical Devices",
    "long_name": "Shanghai MicroPort Endovascular MedTech Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "SHANGHAI MICROPORT ENDOVASCULAR",
    "state": null,
    "summary": "Shanghai MicroPort Endovascular MedTech Co., Ltd. develops, manufactures, and sells technologies and products in the healthcare business. The company primarily offers solutions for aortic and peripheral diseases. Its products include TAA and AAA stent graft systems, balloon inflation catheters, and PTA balloon dilatation catheters. The company was founded in 2012 and is based in Shanghai, the People's Republic of China. Shanghai MicroPort Endovascular MedTech Co., Ltd. is a subsidiary of Shanghai MicroPort Medical (Group) Co., Ltd.",
    "website": "http://www.endovastec.com",
    "zipcode": "201318"
  },
  "688085.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Medical Devices",
    "long_name": "Shanghai Sanyou Medical Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "SHANGHAI SANYOU MEDICAL CO LTD",
    "state": null,
    "summary": "Shanghai Sanyou Medical Co., Ltd. researches, develops, manufactures, and sells orthopedics implants in China. The company offers spinal and trauma implants under Tytus and Sanyou brand. Its spinal products comprise anterior cervical plate, anterior thoracolumbar, posterior cervical, posterior thoracolumbar, and z-minimally invasive products; and trauma implants, including shoulder and elbow system, hip and pelvis system, knee system, knee system, and palm and wrist systems. Shanghai Sanyou Medical Co., Ltd. is based in Shanghai, China.",
    "website": "http://www.sanyoumed.com",
    "zipcode": null
  },
  "688139.SS": {
    "city": "Qingdao",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Medical Devices",
    "long_name": "Qingdao Haier Biomedical Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "QINGDAO HAIER BIOMEDICAL CO LTD",
    "state": null,
    "summary": "Qingdao Haier Biomedical Co., Ltd. engages in the design, manufacture, marketing, and sale of low temperature storage equipment for biomedical samples worldwide. The company offers preservation equipment, biological safety cabinets, liquid nitrogen containers, cryogenic supplies, and CO2 incubators, as well as WHO/PQS certificated equipment. It provides storage solutions for biological sample banks and medical supplies, as well as blood, vaccine, and reagent safety. The company was founded in 2005 and is based in Qingdao, China.",
    "website": "http://www.haierbiomedical.com",
    "zipcode": "266101"
  },
  "688338.SS": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Medical Devices",
    "long_name": "Beijing Succeeder Technology Inc.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "BEIJING SUCCEEDER TECHNOLOGY IN",
    "state": null,
    "summary": "Beijing Succeeder Technology Inc. engages in the research and development, manufacture, and sale of in-vitro diagnostic products in China and internationally. Its products include coagulation analyzers and reagents, blood rheology analyzers, ESR analyzers, and platelet aggregation analyzers. The company was founded in 2003 and is headquartered in Beijing, China.",
    "website": "http://www.succeeder.com.cn",
    "zipcode": "102200"
  },
  "688580.SS": {
    "city": "Nanjing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Medical Devices",
    "long_name": "Nanjing Vishee Medical Technology Co., Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "NANJING VISHEE MEDICAL TECHNOLO",
    "state": null,
    "summary": "Nanjing Vishee Medical Technology Co., Ltd. develops and manufactures medical rehabilitation devices in China. It offers pelvic floor and postpartum, neurological, and mental rehabilitation solutions; and bio-stimulation feedback devices, magnetic stimulators, etc. The company's solutions cover markets, such as electrical and magnetic stimulation, electrophysiology, and other technical directions. It offers its products through dealers, sales network, and distributors to hospitals, and terminal medical and professional institutions. The company was founded in 2001 and is based in Nanjing, China.",
    "website": "http://www.vishee.com",
    "zipcode": "210012"
  },
  "688607.SS": {
    "city": "Suzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Medical Devices",
    "long_name": "CareRay Digital Medical Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "CARERAY DIGITAL MEDICAL TECHNOL",
    "state": null,
    "summary": "CareRay Digital Medical Technology Co., Ltd. develops and produces digital X-ray flat panel detectors. The company offers wireless, wired, dynamic and breast flat panel, and industrial flat panel detectors, as well as accessories and tablet cases. Its products are used in medical, pet, security, and industrial imaging diagnostic products. The company was founded in 2007 and is headquartered in Suzhou, China.",
    "website": "http://www.careray.cn",
    "zipcode": "215123"
  },
  "688656.SS": {
    "city": "Suzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Medical Devices",
    "long_name": "HOB Biotech Group Corp.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "HOB BIOTECH GROUP CORP LTD",
    "state": null,
    "summary": "HOB Biotech Group Corp.,Ltd. operates as a in vitro diagnostic company in China and internationally. It provides diagnostic tools, such as line immune, enzyme-linked immunosorbent, and chemiluminescent paramagnetic microparticle immuno assays to laboratories and hospitals for the improvement of allergy and autoimmune disease patient care. The company was founded in 2009 and is based in Suzhou, China.",
    "website": "http://www.hobiotech.com",
    "zipcode": "215123"
  },
  "72X.F": {
    "city": "Shanghai",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Medical Devices",
    "long_name": "MicroPort CardioFlow Medtech Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "MICROPORT CARDIO.MEDTECH.",
    "state": null,
    "summary": "MicroPort CardioFlow Medtech Corporation, a medical device company, focuses on the research, development, and commercialization of transcatheter and surgical solutions for valvular heart diseases in the People's Republic of China. Its products include Vitaflow Aortic Valve System, Alwide Balloon Catheter, and Alpass Introducer Set, which targets aortic, mitral, tricuspid, and surgical valves, as well as procedural accessories. The company was founded in 2010 and is headquartered in Shanghai, China. MicroPort CardioFlow Medtech Corporation is a subsidiary of Shanghai MicroPort Limited.",
    "website": "http://www.cardioflowmedtech.com",
    "zipcode": "201203"
  },
  "9996.HK": {
    "city": "Suzhou",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Medical Devices",
    "long_name": "Peijia Medical Limited",
    "market": "hk_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "PEIJIA-B",
    "state": null,
    "summary": "Peijia Medical Limited engages in the research, development, production, and sales of interventional procedural medical devices for the treatment of structural heart and neurovascular diseases. Its product candidates include transcatheter aortic valve replacement (TAVR) products, such as TaurusOne, a transcatheter aortic valve replacement system, including prosthetic aortic valve, delivery catheter system, and LS; TaurusElite, a second-generation TAVR device; and TaurusNXT, a third-generation TAVR device. The company is also developing transcatheter mitral valve replacement devices for the treatment of mitral regurgitation; and transcatheter tricuspid valve replacement devices for the treatment of tricuspid regurgitation. In addition, it is developing lithotripsy and balloon aortic valvuloplasty catheters, introducer sheaths, guidewires, and mitral repair devices. Further, the company is developing neurointerventional procedural products, such as stent retrievers; balloon guide and dilatation, distal access, intermediate, and aspiration catheters; and balloon microcatheter, heat-fusion detachable coils, intracranial stents, and detachable coils. Peijia Medical Limited was founded in 2012 and is headquartered in Suzhou, the People's Republic of China.",
    "website": "http://www.peijiamedical.com",
    "zipcode": "215028"
  },
  "HYBT": {
    "city": "Xiamen",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Medical Devices",
    "long_name": "Heyu Biological Technology Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "HEYU BIOLOGICAL TECHNOLOGY CORP",
    "state": null,
    "summary": "Heyu Biological Technology Corporation does not have significant operations. Previously, the company was engaged in the provision of application services; and development of business software technologies and services for business merchants and organizations. The company was formerly known as Pacific WebWorks, Inc. and changed its name to Heyu Biological Technology Corporation in June 2018. Heyu Biological Technology Corporation was incorporated in 1987 and is based in Xiamen, the People's Republic of China.",
    "website": "http://heyubt.com",
    "zipcode": "361022"
  },
  "LLIT": {
    "city": "Beijing",
    "country": "China",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Medical Devices",
    "long_name": "Lianluo Smart Limited",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Lianluo Smart Limited",
    "state": null,
    "summary": "Lianluo Smart Limited, together with its subsidiaries, designs, develops, markets, and distributes medical products primarily in China and internationally. The company offers medical devices, including wearable sleep respiratory solutions, general hospital products, medical compressors, and related supporting products. It also provides technical services in relation to the detection and analysis of obstructive sleep apnea syndrome to hospitals and medical centers through medical wearable devices. In addition, the company distributes medical products, such as sleep apnea machines. Lianluo Smart Limited sells its products primarily through distributors; and directly to hospitals, physical examination centers, and sleep centers, as well as to individual consumers. The company was formerly known as Dehaier Medical Systems Limited and changed its name to Lianluo Smart Limited in November 2016. Lianluo Smart Limited was incorporated in 2003 and is headquartered in Beijing, China.",
    "website": "http://www.lianluosmart.com",
    "zipcode": "102200"
  },
  "MCRPF": {
    "city": "Shanghai",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Medical Devices",
    "long_name": "MicroPort Scientific Corporation",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "MICROPORT SCIENTIFIC CORPORATIO",
    "state": null,
    "summary": "MicroPort Scientific Corporation, an investment holding company, manufactures, and markets, and distributes medical devices in the People's Republic of China, North America, Europe, other Asian countries, South America, and internationally. The company's Cardiovascular Devices segment provides coronary stents and related delivery systems; and balloon catheters and accessories. Its Orthopedics Devices segment offers reconstructive joints, spine and trauma, and other professional implants and equipment. The company's Cardiac Rhythm Management Business segment develops, manufactures, and markets defibrillators, cardiac resynchronization therapy devices, and pacemakers for the diagnosis, treatment, and management of heart rhythm disorders and heart failure. Its Endovascular and Peripheral Vascular Devices segment provides products and services for the interventional treatment of thoracic and abdominal aortic aneurysm, peripheral vascular diseases, aortic dissection, and other endovascular related diseases. The company's Neurovascular Devices segment provides products and services for neurovascular diseases, such as cerebral aneurysms, intracranial atherosclerotic diseases, carotid artery diseases, and other neurovasculature related diseases. Its Surgical Devices segment researches and develops, manufactures, and sells surgical devices. The company's Heart Valve Business segment engages in the research and development, manufacture, and sale of VitaFlow Transcatheter aortic valve and delivery system for the treatment of valvular heart diseases. Its Surgical Robot Business segment provides research and technology integration in the fields of robot, intelligent control, and information to provide medical products. MicroPort Scientific Corporation was founded in 1998 and is headquartered in Shanghai, the People's Republic of China.",
    "website": "http://www.microport.com",
    "zipcode": "201203"
  },
  "MSK.F": {
    "city": "Shanghai",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Medical Devices",
    "long_name": "MicroPort Scientific Corporation",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "MICRP.SCIEN.REGS HD-00001",
    "state": null,
    "summary": "MicroPort Scientific Corporation, an investment holding company, manufactures, and markets, and distributes medical devices in the People's Republic of China, North America, Europe, other Asian countries, South America, and internationally. The company's Cardiovascular Devices segment provides coronary stents and related delivery systems; and balloon catheters and accessories. Its Orthopedics Devices segment offers reconstructive joints, spine and trauma, and other professional implants and equipment. The company's Cardiac Rhythm Management Business segment develops, manufactures, and markets defibrillators, cardiac resynchronization therapy devices, and pacemakers for the diagnosis, treatment, and management of heart rhythm disorders and heart failure. Its Endovascular and Peripheral Vascular Devices segment provides products and services for the interventional treatment of thoracic and abdominal aortic aneurysm, peripheral vascular diseases, aortic dissection, and other endovascular related diseases. The company's Neurovascular Devices segment provides products and services for neurovascular diseases, such as cerebral aneurysms, intracranial atherosclerotic diseases, carotid artery diseases, and other neurovasculature related diseases. Its Surgical Devices segment researches and develops, manufactures, and sells surgical devices. The company's Heart Valve Business segment engages in the research and development, manufacture, and sale of VitaFlow Transcatheter aortic valve and delivery system for the treatment of valvular heart diseases. Its Surgical Robot Business segment provides research and technology integration in the fields of robot, intelligent control, and information to provide medical products. MicroPort Scientific Corporation was founded in 1998 and is headquartered in Shanghai, the People's Republic of China.",
    "website": "http://www.microport.com",
    "zipcode": "201203"
  },
  "VMTHF": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Medical Devices",
    "long_name": "Venus Medtech (Hangzhou) Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "VENUS MEDTECH (HANGZHOU) INC",
    "state": null,
    "summary": "Venus Medtech (Hangzhou) Inc. develops and sells transcatheter heart valve medical devices in Mainland China and internationally. The company's products include VenusA-Valve, a transcatheter aortic heart valve replacement (TAVR) product to treat severe aortic stenosis; VenusP-Valve is a transcatheter pulmonary valve system to treat the dysfunction of right ventricular outflow tract; V8/TAV8 balloon aortic valvuloplasty catheter systems; and TriGUARD3, a cerebral embolic protection device for minimizing the risk of cerebral damage during TAVR and other structural heart procedures. It also develops VenusA-Plus and VenusA-Pilot, which are TAVR product candidates; and transcatheter mitral and tricuspid valve replacement products. The company was founded in 2009 and is headquartered in Hangzhou, the People's Republic of China.",
    "website": "http://www.venusmedtech.com",
    "zipcode": null
  }
}
