{
    "000150.SZ": {
        "short_name": "YIHUA HEALTHCARE C",
        "long_name": "Yihua Healthcare Co., Ltd.",
        "summary": "Yihua Healthcare Co., Ltd. provides medical and elderly care services in China. The company offers integrated medical and logistic services, including medical facilities maintenance, environmental management, safety management, and medical auxiliary services. It also provides medical professional engineering, hospital management, and online medical services. In addition, the company operates as a membership aging communities; and provides old-age management services. The company was founded in 1993 and is based in Shantou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shantou",
        "zipcode": null,
        "website": "http://www.yihuahealth.com",
        "market_cap": 4046187776
    },
    "000950.SZ": {
        "short_name": "C.Q. PHARMACEUTICA",
        "long_name": "C.Q. Pharmaceutical Holding Co., Ltd.",
        "summary": "C.Q. Pharmaceutical Holding Co., Ltd. distributes pharmaceutical products. Chongqing Medicines Co., Ltd. was formerly known as Southwest Branch of China Medicine Company. The company was founded in 1950 and is based in Chongqing, China. C.Q. Pharmaceutical Holding Co., Ltd. develops, manufactures, and distributes pharmaceuticals. The company is based in Chongqing, China. C.Q. Pharmaceutical Holding Co., Ltd. operates as a subsidiary of Chongqing Chemical & Pharmaceutical Holding Group Company",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "400010",
        "website": "http://www.cqphar.com/cqp/",
        "market_cap": 9072945152
    },
    "002044.SZ": {
        "short_name": "MEINIAN ONEHEALTH",
        "long_name": "Meinian Onehealth Healthcare Holdings Co., Ltd.",
        "summary": "Meinian Onehealth Healthcare Holdings Co., Ltd. offers health checkup and medical treatment services. It operates approximately 300 medical treatment and health checkup centers in approximately 200 cities in China. The company was founded in 2001 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.health-100.cn",
        "market_cap": 41295339520
    },
    "0708.HK": {
        "short_name": "EVERG VEHICLE",
        "long_name": "China Evergrande New Energy Vehicle Group Limited",
        "summary": "China Evergrande New Energy Vehicle Group Limited, an investment holding company, operates as a health management company in the People's Republic of China, Europe, and internationally. The company operates through two segments, Health Management and New Energy Vehicle. It develops and sells health and living properties; and provides community health management, medical cosmetology, and anti-aging services, as well as elderly care and rehabilitation. The company is involved in the wholesale of home care and healthcare products, as well as provision of healthcare services and software services. In addition, it engages in the research and development of pharmaceuticals; production of medical equipment; and manufacture and sale of smart mobility and lithium-ion battery. Further, the company is involved in the research, development, production, and sales of new energy vehicles and vehicle living project. The company was formerly known as Evergrande Health Industry Group Limited and changed its name to China Evergrande New Energy Vehicle Group Limited in August 2020. China Evergrande New Energy Vehicle Group Limited was founded in 1999 and is headquartered in Guangzhou, China. China Evergrande New Energy Vehicle Group Limited is a subsidiary of China Evergrande Group.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510620",
        "website": "http://health.evergrande.com",
        "market_cap": 315537391616
    },
    "1951.HK": {
        "short_name": "JXR",
        "long_name": "Jinxin Fertility Group Limited",
        "summary": "Jinxin Fertility Group Limited, an investment holding company, provides assisted reproductive services (ARS) in China and the United States. The company primarily offers two treatment solutions, including artificial insemination that is performed with either husband's sperm or a donor sperm; and IVF technology, whereby fertilization is achieved through conventional in vitro fertilization and embryo transfer or IVF with intracytoplasmic sperm injection. It also provides related services, such as nutrition guidance, Chinese medicine treatment, and psychological counseling to support the ARS. In addition, the company offers management services; medical services in the areas of gynecology, urology, and internal medicine; ambulatory surgery center facilities services; and ancillary medical services. Further, it offers pre-implantation genetic screening testing services; and property holding and management services. Jinxin Fertility Group Limited was founded in 2003 and is headquartered in Chengdu, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": null,
        "website": "http://www.jxr-fertility.com",
        "market_cap": 46289924096
    },
    "2120.HK": {
        "short_name": "KN HOSPITAL",
        "long_name": "Wenzhou Kangning Hospital Co., Ltd.",
        "summary": "Wenzhou Kangning Hospital Co., Ltd. operates and manages a network of healthcare facilities in the People's Republic of China. It primarily focuses on providing psychiatric specialty care. The company also provides property leasing and sale services; and software and information technology services, as well as hospital management, forensic authentication, and medical services. It is also engaged in pharmaceutical retail. The company was formerly known as Wenzhou City Kangning Psychiatric Rehabilitation Hospital and changed its name to Wenzhou Kangning Hospital Co., Ltd. in October 2014. Wenzhou Kangning Hospital Co., Ltd. was founded in 1996 and is headquartered in Wenzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Wenzhou",
        "zipcode": null,
        "website": "http://www.knhosp.cn",
        "market_cap": 2275300096
    },
    "2135.HK": {
        "short_name": "RAILY AESMED",
        "long_name": "Raily Aesthetic Medicine International Holdings Limited",
        "summary": "Raily Aesthetic Medicine International Holdings Limited, an investment holding company, provides aesthetic medical services in the People's Republic of China. The company's services include aesthetic surgery services, including aesthetic surgical procedures performed on various parts of the face or body; minimally-invasive aesthetic services, primarily comprising aesthetic injection procedures; and aesthetic dermatology services, such as various aesthetic energy-based procedures. Raily Aesthetic Medicine International Holdings Limited was founded in 2008 and is headquartered in Hangzhou City, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.ruilizx.com",
        "market_cap": 1356300160
    },
    "2170.HK": {
        "short_name": "BASECARE-B",
        "long_name": "Suzhou Basecare Medical Corporation Limited",
        "summary": "Suzhou Basecare Medical Corporation Limited, an investment holding company, engages in the research, development, manufacture, and provision of genetic testing solutions for assisted reproduction and sale of genetic testing devices and instruments in the People's Republic of China. The company offers genetic test kit products, which include pre-implantation genetic test kits, such as PGT-A, PGT-M, and PGT-SR kits; and prenatal test kit products comprising CNV kits; and postnatal test kit products consist of WES kits. It also distributes noninvasive prenatal testing and DA8600 kits, as well as metagenomic genetic detection kits, such as respiratory virus nucleic acid, respiratory pathogens nucleic acid, and novel coronavirus (2019-nCoV) nucleic acid detection kits. In addition, the company offers marketing and testing services. Its customers primarily include domestic reproductive clinics; women and children hospitals; and hospitals with assisted reproduction capabilities. Suzhou Basecare Medical Corporation Limited was founded in 2010 and is headquartered in Suzhou, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215000",
        "website": "http://www.basecare.cn",
        "market_cap": 7508289536
    },
    "300015.SZ": {
        "short_name": "AIER EYE HOSPITAL",
        "long_name": "Aier Eye Hospital Group Co., Ltd.",
        "summary": "Aier Eye Hospital Group Co., Ltd. operates eye care hospitals and institutions. The company offers medical services in the areas of fundus diseases, optometry, refractive correction, glaucoma, corneal diseases, and cataract. It also provides training course for cataract prevention and treatment. It operates approximately 200 ophthalmic hospitals in mainland China, 76 ophthalmic hospitals in Europe, 1 ophthalmic hospital in the United States, and 7 ophthalmic hospitals in Hong Kong. The company was founded in 2007 and is headquartered in Changsha, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": "410015",
        "website": "http://www.aierchina.com",
        "market_cap": 353873723392
    },
    "3689.HK": {
        "short_name": "KANGHUA HEALTH",
        "long_name": "Guangdong Kanghua Healthcare Co., Ltd.",
        "summary": "Guangdong Kanghua Healthcare Co., Ltd., an investment holding company, primarily operates private hospitals in the People's Republic of China. The company operates through Hospital Services, Rehabilitation and Other Healthcare Services, Hospital Management Services, Sale of Pharmaceutical Products, and Others segments. It offers inpatient and outpatient healthcare, and physical examination services. The company provides a range of preventive care, diagnostic, minimally invasive treatment, interventional therapy, open heart surgery, pacemaker implantation, and transplant services for infants, children, and adults, as well as cardiac rehabilitation services. It also offers VIP obstetrics, gynecology, and outpatient services; assisted reproductive services for couples with infertility disorders; surgical and non-surgical cosmetic treatment options for various areas of the face and body; and laser treatment and skin care services, including acne, acne scarring, stretch marks, and pigmentation treatment, as well as laser hair removal services. In addition, the company provides hospital management services; sells pharmaceutical products and medical consumables; and offers rehabilitation services and other healthcare services, as well as elderly care services to patients. It operates Kanghua Hospital, Renkang Hospital, and Kangxin Hospital. The company was formerly known as Dongguan Kanghua Enterprise Co., Ltd. and changed its name to Guangdong Kanghua Healthcare Co., Ltd. in December 2015. The company was incorporated in 2002 and is headquartered in Dongguan, the People's Republic of China. Guangdong Kanghua Healthcare Co., Ltd. is a subsidiary of Dongguan Kanghua Investment Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": null,
        "website": "http://www.kanghuagp.com/tc/index.php",
        "market_cap": 1120219776
    },
    "3FMA.F": {
        "short_name": "AEST.MED.INT.HLD.SP.ADR/3",
        "long_name": "Aesthetic Medical International Holdings Group Limited",
        "summary": "Aesthetic Medical International Holdings Group Limited provides aesthetic medical services. It offers surgical aesthetic treatments, such as eye surgery, rhinoplasty, breast augmentation, and liposuction; and non-surgical aesthetic treatments comprising minimally invasive and energy-based treatments, including laser, ultrasound, and ultraviolet light treatments. The company also provides general healthcare and other aesthetic medical services, such as internal medicine, urology, gynecology, and obstetrics treatment services, as well as dentistry, dermatology, and hair loss treatment services. It operates 25 treatment centers in China, Hong Kong, and Singapore. The company was founded in 1997 and is headquartered in Shenzhen, China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518052",
        "website": "http://ir.aihgroup.net",
        "market_cap": 141220816
    },
    "3NX.F": {
        "short_name": "JINXIN FERT.GRP HD-,00001",
        "long_name": "Jinxin Fertility Group Limited",
        "summary": "Jinxin Fertility Group Limited, an investment holding company, provides assisted reproductive services (ARS) in China and the United States. The company primarily offers two treatment solutions, including artificial insemination that is performed with either husband's sperm or a donor sperm; and IVF technology, whereby fertilization is achieved through conventional in vitro fertilization and embryo transfer or IVF with intracytoplasmic sperm injection. It also provides related services, such as nutrition guidance, Chinese medicine treatment, and psychological counseling to support the ARS. In addition, the company offers management services; medical services in the areas of gynecology, urology, and internal medicine; ambulatory surgery center facilities services; and ancillary medical services. Further, it offers pre-implantation genetic screening testing services; and property holding and management services. Jinxin Fertility Group Limited was founded in 2003 and is headquartered in Chengdu, China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": null,
        "website": "http://www.jxr-fertility.com",
        "market_cap": 4882574336
    },
    "4NM1.F": {
        "short_name": "CHINA EVERGR.NEW EN.VEH.G",
        "long_name": "China Evergrande New Energy Vehicle Group Limited",
        "summary": "China Evergrande New Energy Vehicle Group Limited, an investment holding company, operates as a health management company in the People's Republic of China, Europe, and internationally. The company operates through two segments, Health Management and New Energy Vehicle. It develops and sells health and living properties; and provides community health management, medical cosmetology, and anti-aging services, as well as elderly care and rehabilitation. The company is involved in the wholesale of home care and healthcare products, as well as provision of healthcare services and software services. In addition, it engages in the research and development of pharmaceuticals; production of medical equipment; and manufacture and sale of smart mobility and lithium-ion battery. Further, the company is involved in the research, development, production, and sales of new energy vehicles and vehicle living project. The company was formerly known as Evergrande Health Industry Group Limited and changed its name to China Evergrande New Energy Vehicle Group Limited in August 2020. China Evergrande New Energy Vehicle Group Limited was founded in 1999 and is headquartered in Guangzhou, China. China Evergrande New Energy Vehicle Group Limited is a subsidiary of China Evergrande Group.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510620",
        "website": "http://health.evergrande.com",
        "market_cap": 33701502976
    },
    "4WK.F": {
        "short_name": "WENZHOU KANG.HOSP.H YC 1",
        "long_name": "Wenzhou Kangning Hospital Co., Ltd.",
        "summary": "Wenzhou Kangning Hospital Co., Ltd. operates and manages a network of healthcare facilities in the People's Republic of China. It primarily focuses on providing psychiatric specialty care. The company also provides property leasing and sale services; and software and information technology services, as well as hospital management, forensic authentication, and medical services. It is also engaged in pharmaceutical retail. The company was formerly known as Wenzhou City Kangning Psychiatric Rehabilitation Hospital and changed its name to Wenzhou Kangning Hospital Co., Ltd. in October 2014. Wenzhou Kangning Hospital Co., Ltd. was founded in 1996 and is headquartered in Wenzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Wenzhou",
        "zipcode": null,
        "website": "http://www.knhosp.cn",
        "market_cap": 242886992
    },
    "600763.SS": {
        "short_name": "TOPCHOICE MEDICAL CORPORATION",
        "long_name": "Topchoice Medical Corporation",
        "summary": "Topchoice Medical Corporation provides medical services in China. It provides various specialty medical services in oral, reproductive, and ophthalmology areas; and operates dental medical institutions and assisted reproductive medical institutions. It operates approximately 32 dental hospitals; and Tongze Dental College, a non-profit educational training organization. The company was formerly known as Topchoice Medical Investment Co., Inc. and changed its name to Topchoice Medical Corporation in November 2019. Topchoice Medical Corporation was founded in 1995 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310023",
        "website": "http://www.tcmedical.com.cn",
        "market_cap": 122708934656
    },
    "600896.SS": {
        "short_name": "LANHAI MEDICAL INVESTMENT CO LT",
        "long_name": "Lanhai Medical Investment Co., Ltd.",
        "summary": "Lanhai Medical Investment Co., Ltd. provides medical and health services. The company operates rehabilitation hospitals. It also offers financial insurance services; and industrial investment services. The company was formerly known as China Shipping Haisheng Co., Ltd. and changed its name to Lanhai Medical Investment Co., Ltd. in November 2016. Lanhai Medical Investment Co., Ltd. was founded in 1989 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200120",
        "website": "http://www.lanhaimedical.com",
        "market_cap": 4273457664
    },
    "6078.HK": {
        "short_name": "HYGEIA HEALTH",
        "long_name": "Hygeia Healthcare Holdings Co., Limited",
        "summary": "Hygeia Healthcare Holdings Co., Limited operates as an oncology healthcare company in the People's Republic of China. The company owns and operates private for-profit hospitals, which offer a range of oncology healthcare and other healthcare services. It also provides radiotherapy center consulting services; and licenses its SRT equipment, as well as offers maintenance and technical support services for its SRT equipment. In addition, the company provides hospital management and supply chain services. As of December 31, 2020, it operated or managed a network of 10 oncology-focused hospitals in 7 cities in 6 Provinces in the People's Republic of China. Hygeia Healthcare Holdings Co., Limited was founded in 2009 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.hygeia-group.com.cn",
        "market_cap": 55310999552
    },
    "9906.HK": {
        "short_name": "HONLIV HEALTH",
        "long_name": "Honliv Healthcare Management Group Company Limited",
        "summary": "Honliv Healthcare Management Group Company Limited operates private general hospitals in China. Its facilities include general healthcare services, such as obstetrics and gynecology, cardiovascular, orthopedics, nephrology and rheumatology, pediatrics, neurology, neonatal, gastroenterology, oncology, neurosurgery, endocrinology, gastrointestinal and hepatobiliary surgery, respiratory, emergency treatment, thyroid and breast surgery, ICU, thoracic surgery, otorhinolaryngology, cardiac surgery, hematology, infectious disease, urology, dermatology, rehabilitation, ophthalmology, pain treatment, proctology, stomatology, traditional Chinese medicine treatment, and plastic surgery services; anesthesiology, clinical laboratory and medical imaging services; and pharmaceuticals sales at hospital. The company also offers medical examination, disease screening, and other services to governmental and corporate customers in Changyuan County; and hospital management services. As of June 15, 2020, it owned one private general hospital and managed one private general hospital with 1,500 beds in operation located in Henan Province. The company was founded in 2004 and is headquartered in Changyuan, China. Honliv Healthcare Management Group Company Limited is a subsidiary of Sunny Rock Capital Limited.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Changyuan",
        "zipcode": null,
        "website": "http://www.honlivhp.com",
        "market_cap": 1188000000
    },
    "AIH": {
        "short_name": "Aesthetic Medical International",
        "long_name": "Aesthetic Medical International Holdings Group Limited",
        "summary": "Aesthetic Medical International Holdings Group Limited provides aesthetic medical services. It offers surgical aesthetic treatments, such as eye surgery, rhinoplasty, breast augmentation, and liposuction; and non-surgical aesthetic treatments comprising minimally invasive and energy-based treatments, including laser, ultrasound, and ultraviolet light treatments. The company also provides general healthcare and other aesthetic medical services, such as internal medicine, urology, gynecology, and obstetrics treatment services, as well as dentistry, dermatology, and hair loss treatment services. It operates 25 treatment centers in China, Hong Kong, and Singapore. The company was founded in 1997 and is headquartered in Shenzhen, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518052",
        "website": "http://ir.aihgroup.net",
        "market_cap": 148194816
    },
    "C2CA.F": {
        "short_name": "CONCORD MED.ADR/3DL-,0001",
        "long_name": "Concord Medical Services Holdings Limited",
        "summary": "Concord Medical Services Holdings Limited, through its subsidiaries, operates a network of radiotherapy and diagnostic imaging centers in the People's Republic of China. The company operates in Network and Hospital segments. The company's services comprise linear accelerators external beam radiotherapy, gamma knife radiosurgery, head gamma knife systems, body gamma knife systems, and diagnostic imaging services. It also offers other treatments and diagnostic services comprising electroencephalography for the diagnosis of epilepsy; thermotherapy for pain relief after radiotherapy and chemotherapy; ultrasound therapy for the treatment of cancer; stereotactic radiofrequency ablation for the treatment of Parkinson's disease; and refraction and tonometry for the diagnosis of ophthalmic conditions. In addition, the company provides clinical support services, including developing treatment protocols for doctors; and organizing joint diagnosis between doctors in its network and clinical research. Further, it offers radiotherapy and diagnostic equipment leasing and management services to hospitals, as well as tele-consulting services; and sells medical equipment. Additionally, the company establishes the Beijing Proton Medical Center that provides radiotherapy treatment options to cancer patients; and other specialty cancer hospitals, which offer radiotherapy services, diagnostic imaging services, chemotherapy, and surgery. As of June 30, 2019, it operated a network of 30 centers based in 20 hospitals in 20 cities across 13 provinces and administrative regions in China. Concord Medical Services Holdings Limited was incorporated in 2007 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100013",
        "website": "http://www.concordmedical.com",
        "market_cap": 119986304
    },
    "CCM": {
        "short_name": "Concord Medical Services Holdin",
        "long_name": "Concord Medical Services Holdings Limited",
        "summary": "Concord Medical Services Holdings Limited, through its subsidiaries, operates a network of radiotherapy and diagnostic imaging centers in the People's Republic of China. The company operates in Network and Hospital segments. The company's services comprise linear accelerators external beam radiotherapy, gamma knife radiosurgery, head gamma knife systems, body gamma knife systems, and diagnostic imaging services. It also offers other treatments and diagnostic services comprising electroencephalography for the diagnosis of epilepsy; thermotherapy for pain relief after radiotherapy and chemotherapy; ultrasound therapy for the treatment of cancer; stereotactic radiofrequency ablation for the treatment of Parkinson's disease; and refraction and tonometry for the diagnosis of ophthalmic conditions. In addition, the company provides clinical support services, including developing treatment protocols for doctors; and organizing joint diagnosis between doctors in its network and clinical research. Further, it offers radiotherapy and diagnostic equipment leasing and management services to hospitals, as well as tele-consulting services; and sells medical equipment. Additionally, the company establishes the Beijing Proton Medical Center that provides radiotherapy treatment options to cancer patients; and other specialty cancer hospitals, which offer radiotherapy services, diagnostic imaging services, chemotherapy, and surgery. As of June 30, 2019, it operated a network of 30 centers based in 20 hospitals in 20 cities across 13 provinces and administrative regions in China. Concord Medical Services Holdings Limited was incorporated in 2007 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100013",
        "website": "http://www.concordmedical.com",
        "market_cap": 147234240
    },
    "CHYL": {
        "short_name": "CHINA SR LIVING IND INTL HLDG C",
        "long_name": "China Senior Living Industry International Holding Corporation",
        "summary": "China Senior Living Industry International Holding Corporation operates senior living facilities in Xianyang, the People's Republic of China. It provides healthcare, medical staff, meal preparation, and general care services for the elderly. The company was formerly known as China Forestry, Inc. and changed its name to China Senior Living Industry International Holding Corporation in September 2015. China Senior Living Industry International Holding Corporation was incorporated in 1986 and is based in Xianyang, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Xianyang",
        "zipcode": "712000",
        "website": null,
        "market_cap": 1411209
    },
    "EVGRF": {
        "short_name": "CHINA EVERGRANDE NEW ENERGY VEH",
        "long_name": "China Evergrande New Energy Vehicle Group Limited",
        "summary": "China Evergrande New Energy Vehicle Group Limited, an investment holding company, operates as a health management company in the People's Republic of China, Europe, and internationally. The company operates through two segments, Health Management and New Energy Vehicle. It develops and sells health and living properties; and provides community health management, medical cosmetology, and anti-aging services, as well as elderly care and rehabilitation. The company is involved in the wholesale of home care and healthcare products, as well as provision of healthcare services and software services. In addition, it engages in the research and development of pharmaceuticals; production of medical equipment; and manufacture and sale of smart mobility and lithium-ion battery. Further, the company is involved in the research, development, production, and sales of new energy vehicles and vehicle living project. The company was formerly known as Evergrande Health Industry Group Limited and changed its name to China Evergrande New Energy Vehicle Group Limited in August 2020. China Evergrande New Energy Vehicle Group Limited was founded in 1999 and is headquartered in Guangzhou, China. China Evergrande New Energy Vehicle Group Limited is a subsidiary of China Evergrande Group.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510620",
        "website": "http://health.evergrande.com",
        "market_cap": 48278999040
    },
    "JDHIF": {
        "short_name": "JD HEALTH INTERNATIONAL INC",
        "long_name": "JD Health International Inc.",
        "summary": "JD Health International Inc., an investment holding company, operates an online healthcare platform in the People's Republic of China. It offers pharmaceutical and healthcare products, including OTC drugs, prescription drugs, and medical devices and supplies, as well as health and wellness products through direct selling and online retail pharmacy network. The company also provides online healthcare services, such as online consultation, prescription renewal, chronic disease management, family doctor, and consumer healthcare services; health management and intelligent healthcare solutions, as well as technical and advertising services. In addition, its platform allows users to book appointments and pay for services, such as general physical exams, aesthetic medicines, vaccination appointments, dental care services, and nucleic acid testing tests. The company was incorporated in 2018 and is headquartered in Beijing, the People's Republic of China. JD Health International Inc. is a subsidiary of JD Jiankang Limited.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101111",
        "website": "http://ir.jdhealth.com",
        "market_cap": 49323900928
    },
    "JRSS": {
        "short_name": "JRSIS HEALTH CARE CORP",
        "long_name": "JRSIS Health Care Corporation",
        "summary": "JRSIS Health Care Corporation provides a range of medical services in Harbin in the Heilongjiang Province of the People's Republic of China. The company offers services in the areas of pediatrics, dermatology, ears, nose, throat, traditional Chinese medicine, ophthalmology, internal medicine dentistry, general surgery, rehabilitation science, gynecology, general medical services, etc. It provides its services through Jiarun Hospital, which consists of 950 beds. The company was formerly known as China Runteng Medical Group Co., Ltd and changed its name to JRSIS Health Care Corporation in November 2013. JRSIS Health Care Corporation was founded in 2006 and is based in Harbin, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": "150025",
        "website": "http://www.jhcc.cn",
        "market_cap": 6568668
    },
    "KJFI": {
        "short_name": "COMJOYFUL INTERNATIONAL CO",
        "long_name": "Comjoyful International Company",
        "summary": "Comjoyful International Company operates and manages healthcare clubs in China. Its clubs provide traditional physiotherapy services and other relaxing treatments, such as foot massage, body massage, spa, moxibustion, and other relaxing treatments that are based on the Chinese traditional reflexology system. The company also provides beverages, including beer, tea, and juice, as well as fruits, nuts, and dumplings. It operates three healthcare clubs, which are located in Wuxi, Nanjing, and Jintan. The company was formerly known as Camelot Corporation and changed its name to Comjoyful International Company in January 2013. Comjoyful International Company was incorporated in 1975 and is based in Beijing, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100600",
        "website": null,
        "market_cap": 58616
    },
    "NFH": {
        "short_name": "New Frontier Health Corporation",
        "long_name": "New Frontier Health Corporation",
        "summary": "New Frontier Health Corporation provides healthcare services. It operates a network of hospital inpatient departments and integrated outpatient clinics, including satellite feeder clinics. The company's facilities include 24/7 emergency rooms, intensive care units, neonatal intensive care units, operating rooms, clinical laboratories, radiology, and blood banking services. It operates five hospitals and eight clinics in northern China; two hospitals and four clinics in eastern China; and two hospitals and two clinics in southern China. The company is based in Beijing, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100015",
        "website": "http://www.nfh.com.cn",
        "market_cap": 1455436032
    },
    "VNL1.F": {
        "short_name": "CHINA HEALTH GRP  HD-,10",
        "long_name": "China Health Group Inc.",
        "summary": "China Health Group Inc., an investment holding company, provides clinical research services to pharmaceutical and biotechnology companies in the People's Republic of China. The company offers contracted clinical research services; contracted pharmaceutical development services; post launch market research, medical, and medical market services; medical science liaisons; and other medical services. It also provides hospital management, medical tourism, and specialized hospital services, as well as Venturepharma cloud; and sells drugs technologies. The company was formerly known as Venturepharm Laboratories Limited and changed its name to China Health Group Inc. in January 2015. China Health Group Inc. was founded in 1998 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102200",
        "website": "http://www.chgi.net",
        "market_cap": 43612800
    },
    "WFHG": {
        "short_name": "WORLD FINANCIAL HOLDING GROUP",
        "long_name": "World Financial Holding Group",
        "summary": "World Financial Holding Group operates as a professional listing coaching company in the China. It offers services in the areas of strategic investment, international merger, asset reorganization, private financing, capital operation, overseas stock issue and listing, initial public listing and reverse acquisition, management consulting, and other investment banking advisory services. The company also provides guidance process for listing of a company; coaching services for listing of companies in the United States; and backdoor listing services. World Financial Holding Group is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.worldfh.com",
        "market_cap": null
    }
}