{
    "002462.SZ": {
        "short_name": "CACHET PHARMACEUTI",
        "long_name": "Cachet Pharmaceutical Co., Ltd.",
        "summary": "Cachet Pharmaceutical Co., Ltd. engages in the wholesale and retail sale of pharmaceutical products in China. It is involved in the supply of medicines to hospitals; wholesale of biological products, medical instruments, and traditional Chinese medicines; pharmaceutical logistic operations; and manufacture of medicines. The company owns 150 chain stores in Beijing that sell medicines, health care foods, medical instruments, cosmetics, daily necessities, and traditional Chinese medicines. Cachet Pharmaceutical Co., Ltd. was founded in 1998 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100195",
        "website": "http://www.cachet.com.cn",
        "market_cap": "Small Cap"
    },
    "002727.SZ": {
        "short_name": "YUNNAN HONGXIANG Y",
        "long_name": "Yixintang Pharmaceutical Group Co., Ltd.",
        "summary": "Yixintang Pharmaceutical Group Co., Ltd., together with its subsidiary, operates a chain of drugstores in China. It processes and sells medicinal materials; and engages in the wholesale of Chinese and western medicines. As of January 31, 2019, owned 5,872 direct chain stores in Yunnan, Guizhou, Guangxi, Sichuan, Shanxi, Chongqing, Tianjin, Shanghai, Hainan, and Henan provinces. It also sells products online. The company was formerly known as Yunnan Hongxiang Yixintang Pharmaceutical Co., Ltd. and changed its name to Yixintang Pharmaceutical Group Co., Ltd. in June 2019. Yixintang Pharmaceutical Group Co., Ltd. was founded in 2000 and is based in Kunming, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": null,
        "website": "http://www.hx8886.com",
        "market_cap": "Mid Cap"
    },
    "002758.SZ": {
        "short_name": "ZJAMP GROUP CO LTD",
        "long_name": "ZJAMP Group Co., Ltd.",
        "summary": "Zjamp Group Co., Ltd. engages in the production of pesticides and fertilizers. The company was founded in 1999 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310000",
        "website": null,
        "market_cap": "Small Cap"
    },
    "002788.SZ": {
        "short_name": "LUYAN PHARMA CO LT",
        "long_name": "Luyan Pharma Co.,Ltd.",
        "summary": "Luyan Pharma Co.,Ltd. engages in the research and development, production, and sale of human health products in China. It also operates pharmaceutical distribution and retail direct stores. The company was formerly known as Luyan (Fujian) Pharma Co. Ltd. and changed its name to Luyan Pharma Co.,Ltd. in June 2016. Luyan Pharma Co.,Ltd. was founded in 1992 and is headquartered in Xiamen, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361015",
        "website": "http://www.luyan.com.cn",
        "market_cap": "Small Cap"
    },
    "04CN.F": {
        "short_name": "CHINA JO-JO D.NEW DL-,001",
        "long_name": "China Jo-Jo Drugstores, Inc.",
        "summary": "China Jo-Jo Drugstores, Inc., together with its subsidiaries, operates as a retailer and distributor of pharmaceutical and other healthcare products in the People's Republic of China. The company operates through four segments: Retail Drugstores, Online Pharmacy, Drug Wholesale, and Herb Farming. Its stores provide various pharmaceutical products, including prescription and over-the-counter drugs, nutritional supplements, traditional Chinese medicines (TCM), personal and family care products, and medical devices, as well as convenience products, such as consumable, seasonal, and promotional items. The company also operates licensed doctors of Western medicine and TCM on site for consultation, examination, and treatment of common ailments at scheduled hours. In addition, it operates dada360.com, an online drugstore that retails OTC drugs and nutritional supplements, as well as sells products through third-party platforms, such as Tmall, JD.com, and Amazon.com. Further, the company distributes third-party pharmaceutical products primarily to trading companies, as well as cultivates and wholesales herbs used for TCM. As of March 31, 2020, it had 118 retail pharmacies under the Jiuzhou Grand Pharmacy name, as well as 10 drugstores. The company was founded in 2003 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310008",
        "website": "http://www.jiuzhou-drugstore.com",
        "market_cap": "Small Cap"
    },
    "1110.HK": {
        "short_name": "KINGWORLD",
        "long_name": "Kingworld Medicines Group Limited",
        "summary": "Kingworld Medicines Group Limited, an investment holding company, distributes branded imported pharmaceutical and healthcare products in the People's Republic of China, Hong Kong, the United States, the United Kingdom, Germany, Italy, and internationally. The company also supplies general foodstuffs and medical products. It offers products for various functional categories, such as cough and phlegm relieving, gastrointestinal, vitamin, orthopedics, cardiovascular, influenza, and other categories under the Nin Jiom Chuan Bei Pei Pa Koa, Taiko Seirogan, Kawai Product Range, Flying Eagle Wood Lok Medicated Oil, Kyushin Pill, and Mentholatum Product Range brands. The company also manufactures and sells electrotherapeutic and physiotherapeutic devices, and general medical examination devices. In addition, it is involved in the property investment business. The company was founded in 1996 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518016",
        "website": "http://www.kingworld.com.cn",
        "market_cap": "Small Cap"
    },
    "300108.SZ": {
        "short_name": "JI YAO HOLDING GRO",
        "long_name": "Ji Yao Holding Group Co., Ltd.",
        "summary": "Ji Yao Holding Group Co., Ltd., together with its subsidiaries, engages in the research and development, production, and wholesale of pharmaceutical products. It offers Chinese and western medicines in the areas of pediatrics, phlegm and cough, gynecology, cardiovascular and cerebrovascular, antiviral, urinary, anti-inflammatory, gastrointestinal, tonic class, and rheumatoid immunity. The company also engages in the marketing of pharmaceutical products; investment and management of hospital projects; housing leasing activities; development and sale of computer software systems and auxiliary equipment; provision of business management and investment consulting; and design, production, agency, and release of various domestic and international advertising. Ji Yao Holding Group Co., Ltd. is headquartered in Meihekou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Meihekou",
        "zipcode": null,
        "website": "http://www.jiyaogroup.com",
        "market_cap": "Small Cap"
    },
    "300937.SZ": {
        "short_name": "SICHUAN HEZONG MED",
        "long_name": "Sichuan Hezong Medicine Easy-to-buy Pharmaceutical Co., Ltd.",
        "summary": "Sichuan Hezong Medicine Easy-to-buy Pharmaceutical Co., Ltd. distributes generic drugs and Chinese medicines in China. The company offers medications in the areas of respiratory, anti-inflammatory, five senses, skin and external, digestive, hepatobiliary system, rehabilitation and tranquility, women, pediatrics, cardiovascular and neurological, endocrine system, rheumatoid bone injury, and others. It also provides special compound preparations, biological products, Chinese herbal medicines, and non-medicine products. The company was founded in 2007 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610081",
        "website": "http://www.hezongyy.com",
        "market_cap": "Small Cap"
    },
    "600833.SS": {
        "short_name": "SHANGHAI NO.1 PHARMACY CO",
        "long_name": "Shanghai No.1 Pharmacy Co., Ltd.",
        "summary": "Shanghai No.1 Pharmacy Co., Ltd. engages in the retail and wholesale of pharmaceutical products. The company offers products in the categories of Chinese and Western medicines, nutrition and health products, medical equipment, Chinese herbal medicines, etc. In addition, it provides consulting and guidance on safe medication, rational medication, and chronic disease medication. Shanghai No. 1 Pharmacy Co., Ltd. is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.shdyyy.com.cn",
        "market_cap": "Small Cap"
    },
    "600998.SS": {
        "short_name": "JOINTOWN PHARMACEUTICAL GROUP C",
        "long_name": "Jointown Pharmaceutical Group Co., Ltd.",
        "summary": "Jointown Pharmaceutical Group Co., Ltd. engages in the wholesale, logistics, and pharmaceutical e-commerce activities specializing in Chinese herbal medicines, Chinese patent medicines, chemical raw materials, chemical preparations, antibiotics, biochemicals, biological products, and second class psychoactive drugs. It serves drug manufacturers, drug distributors, retailers, medical institutions, and government procurement groups. Jointown Pharmaceutical Group Co., Ltd. was founded in 1999 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.jzteyao.com",
        "market_cap": "Mid Cap"
    },
    "603883.SS": {
        "short_name": "LAOBAIXING PHARMACY CHAIN JO ST",
        "long_name": "LBX Pharmacy Chain Joint Stock Company",
        "summary": "LBX Pharmacy Chain Joint Stock Company operates pharmacy store chain in China. The company operates stores in 21 provincial markets, including Hunan, Jiangsu, Gansu, Shaanxi, Guangxi, Anhui, Zhejiang, Inner Mongolia, Hubei, Tianjin, Henan, Shanghai, Shandong, Guangdong, Hebei, Beijing, Jiangxi, Ningxia, Sichuan, Fujian, and Guizhou. The company was formerly known as Laobaixing Pharmacy Chain Joint Stock Company. LBX Pharmacy Chain Joint Stock Company was founded in 2001 and is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": null,
        "website": "http://www.lbxdrugs.com",
        "market_cap": "Mid Cap"
    },
    "603939.SS": {
        "short_name": "YIFENG PHARMACY CHAIN CO LTD",
        "long_name": "Yifeng Pharmacy Chain Co., Ltd.",
        "summary": "Yifeng Pharmacy Chain Co., Ltd. retails pharmaceutical products in China. The company primarily offers ENT, dermatology, gastroenterology, rheumatology, andrology, gynecology, pediatric, body slimming, and nutrition products. It operates approximately 680 pharmaceutical chain stores in Hunan, Hubei, Shanghai, Jiangsu, Zhejiang, Jiangxi, and other six provinces and cities. The company is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": null,
        "website": "http://www.yfdyf.com",
        "market_cap": "Mid Cap"
    },
    "BIMI": {
        "short_name": "BOQI International Medical Inc.",
        "long_name": "BOQI International Medical, Inc.",
        "summary": "BOQI International Medical Inc., together with its subsidiaries, engages in the retail and wholesale distribution of medical devices, and pharmaceutical and other healthcare products in the People's Republic of China. It offers prescription and over-the-counter drugs, nutritional supplements, health foods, and sundry products, as well as traditional Chinese medicines, personal and family care products, and miscellaneous items under the Lijiantang Pharmacy brand name. The company also provides IT research and development services. It sells its medicine and other healthcare products to customers through its directly owned stores. The company was formerly known as NF Energy Saving Corporation and changed its name to BOQI International Medical Inc. in December 2019. BOQI International Medical Inc. was incorporated in 2000 and is based in Dalian, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "110015",
        "website": "http://www.usbimi.com",
        "market_cap": "Small Cap"
    },
    "CJJD": {
        "short_name": "China Jo-Jo Drugstores, Inc.",
        "long_name": "China Jo-Jo Drugstores, Inc.",
        "summary": "China Jo-Jo Drugstores, Inc., together with its subsidiaries, operates as a retailer and distributor of pharmaceutical and other healthcare products in the People's Republic of China. The company operates through four segments: Retail Drugstores, Online Pharmacy, Drug Wholesale, and Herb Farming. Its stores provide various pharmaceutical products, including prescription and over-the-counter drugs, nutritional supplements, traditional Chinese medicines (TCM), personal and family care products, and medical devices, as well as convenience products, such as consumable, seasonal, and promotional items. The company also operates licensed doctors of Western medicine and TCM on site for consultation, examination, and treatment of common ailments at scheduled hours. In addition, it operates dada360.com, an online drugstore that retails OTC drugs and nutritional supplements, as well as sells products through third-party platforms, such as Tmall, JD.com, and Amazon.com. Further, the company distributes third-party pharmaceutical products primarily to trading companies, as well as cultivates and wholesales herbs used for TCM. As of March 31, 2020, it had 118 retail pharmacies under the Jiuzhou Grand Pharmacy name, as well as 10 drugstores. The company was founded in 2003 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310008",
        "website": "http://www.jiuzhou-drugstore.com",
        "market_cap": "Small Cap"
    },
    "CNBI": {
        "short_name": "CHINA BCT PHARMACY GROUP INC",
        "long_name": "China BCT Pharmacy Group, Inc.",
        "summary": "China BCT Pharmacy Group, Inc., through its subsidiaries, operates as an integrated pharmaceutical company in the People's Republic of China. It operates through three segments: Pharmaceutical Distribution, Retail Pharmacy, and Manufacturing Pharmacy. The Pharmaceutical Distribution segment purchases pharmaceutical products from suppliers and distributes them to hospitals, retail drug stores, other pharmaceutical wholesalers, clinics, medical centers, and individuals. It offers approximately 8,000 pharmaceutical and healthcare products, including branded and generic prescription medicines, over-the counter medicines, and Western and Chinese medicines, as well as personal care products and medical supplies, Chinese herbs, and medical instruments. The Retail Pharmacy segment operates a retail pharmacy network of 196 directly owned stores, primarily in Guangxi province under the Baicaotang name. The retail stores provide professional pharmaceutical services, and supply various medicines, such as prescription medicines, over-the-counter medicines, Chinese herbal medicine, roughly processed Chinese herbal medicine, family planning products, and other pharmaceutical and healthcare products. The Manufacturing Pharmacy segment manufactures and sells generic and clinic drugs, such as traditional anti-inflammatory and antibacterial drugs, cancer treatment drugs, cardio-vascular disease drugs, and hepatitis drugs under the Asio name. Its products comprise Levodopa, Tabellae Sarcandrae, Rotandine Sulfate, Corydalis Saxicola Bunting, and Ethacridine Lactate injection. The company was formerly known as China Baicaotang Medicine Limited and changed its name to China BCT Pharmacy Group, Inc. in March 2010. China BCT Pharmacy Group, Inc. is headquartered in Liuzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Liuzhou",
        "zipcode": "545007",
        "website": null,
        "market_cap": "Small Cap"
    },
    "JFIL": {
        "short_name": "JUBILANT FLAME INTERNATIONAL LT",
        "long_name": "Jubilant Flame International, Ltd.",
        "summary": "Jubilant Flame International, Ltd. provides technical support services for the development of nutrition food products in the United States. Its nutritional oriented food includes sea-buckthourn and organic spouting powder. The company was formerly known as Jiu Feng Investment Hong Kong Ltd. and changed its name to Jubilant Flame International, Ltd. in May 2015. Jubilant Flame International, Ltd. was founded in 2009 and is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201103",
        "website": "http://www.acropass-shop.com",
        "market_cap": "Small Cap"
    },
    "JP00.F": {
        "short_name": "UNIVERN HEALTH INTL",
        "long_name": "Universal Health International Group Holding Limited",
        "summary": "Universal Health International Group Holding Limited, an investment holding company, engages in the distribution and retail of drugs, healthcare products, and other pharmaceutical products in the northeastern region of the People's Republic of China. The company also provides storage services. It serves pharmaceutical retailers, hospitals, clinics, and distributors. The company was formerly known as Jintian Pharmaceutical Group Limited and changed its name to Universal Health International Group Holding Limited in July 2015. Universal Health International Group Holding Limited was founded in 1998 and is headquartered in Shenyang, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenyang",
        "zipcode": null,
        "website": "http://www.uhighl.com",
        "market_cap": "Small Cap"
    },
    "YI": {
        "short_name": "111, Inc.",
        "long_name": "111, Inc.",
        "summary": "111, Inc. operates an integrated online and offline platform in the healthcare market in the People's Republic of China. It operates through two segments, B2B and B2C. The company sells medical and wellness products through online retail, and wholesale and retail pharmacies, as well as provides value-added services, such as online consultation services and e-prescription services to consumers. Its product portfolio comprises prescription and over-the counter drugs, such as western and traditional Chinese medicinal drugs; nutritional supplements, such as vitamins and dietary products; contact lenses; medical supplies and devices, including bandages and thermometers; and personal care products, such as skin care, birth control, and sexual wellness products; and baby products. The company also operates an online marketplace where third-party sellers can directly sell to pharmacies; provides online loan application services to the clients of 1 Drug Mall, including pharmacies and wholesalers; and digital contract sales organization and data services. As of December 31, 2019, it operated 12 offline retail pharmacies under the Yi Hao Pharmacy brand name in Guangzhou, Shanghai, Tianjin, and Kunshan. In addition, the company offers warehousing, logistics, procurement, research and development, and consulting services; and software development and information technology support services. It serves pharmacies, pharmaceutical companies and distributors, medical professionals, and insurance companies. 111, Inc. has strategic partnerships with Bayer Healthcare Co. Ltd.; BeiGene, Ltd.; and Jianming Pharmaceutical Group. The company was formerly known as New Peak Group and changed its name to 111, Inc. in April 2018. 111, Inc. was founded in 2010 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "NGM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.111.com.cn",
        "market_cap": "Small Cap"
    }
}