{
    "0QZ.F": {
        "short_name": "ALITHYA GROUP INC.",
        "long_name": "Alithya Group Inc.",
        "summary": "Alithya Group Inc. provides strategy and digital technology services in Canada, the United States, and Europe. The company's business strategy services include strategic consulting, digital transformation, organizational performance, and enterprise architecture services. It also provides application services, such as digital applications development, legacy systems modernization, control and software engineering, cloud infrastructure, quality assurance, and automated testing; enterprise solutions comprising enterprise resource planning, corporate performance management, customer relationship management, and human capital management; and data and analytics solutions, including business intelligence, data management, artificial intelligence, and machine learning, as well as internet of things. In addition, the company provides AI-FI, an integrated artificial intelligence and fidelity solution; Askida CT, a solution that allows clients to test the functionality of applications on various platforms; Capsure RF, a cloud based platform for healthcare providers to maximize material management processes; CASSI analytics for online weekly maintenance, outage management, petrochem turnarounds, and maintenance and reliability; and SIDER, a secure solution that facilitates distribution of medical results to healthcare facilities and to centralized electronic health records. It serves financial services, energy, manufacturing, telecommunications, transportation and logistics, professional services, healthcare, and government sectors. Alithya Group Inc. was founded in 1992 and is headquartered in Montreal, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3B 3A5",
        "website": "http://www.alithya.com",
        "market_cap": 182220400
    },
    "0ZB.F": {
        "short_name": "CONVERGE TECHNOLOGY SOL.",
        "long_name": "Converge Technology Solutions Corp.",
        "summary": "Converge Technology Solutions Corp., through its subsidiaries, distributes storage devices and systems, computer products, software, and peripherals. The company also provides installation and maintenance; analytics, hybrid cloud, infrastructure, and cybersecurity services; cloud delivery, compute efficiency, network optimization, and IT spend optimization solutions; and IT professional services, such as data center infrastructure integration and solutioning, and cloud optimization. In addition, it offers business continuity, managed, cognitive, and cybersecurity solutions; IT portfolio management, and consulting services; and multi-site IT deployments, and ISV/OEM solutions. It serves corporate and government institutions. The company has operations in the United States and Canada. Converge Technology Solutions Corp. was incorporated in 2016 and is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2S1",
        "website": "http://www.convergetp.com",
        "market_cap": 815395072
    },
    "1K8.F": {
        "short_name": "KONTROL TECHNOLOGIES CORP",
        "long_name": "Kontrol Technologies Corp.",
        "summary": "Kontrol Technologies Corp. provides energy efficiency solutions and technologies to commercial energy consumers in Canada and the United States. It offers SmartSite, a software as a service platform; SmartSuite, connect into existing building automation systems and to also communicate with utilities; cogeneration or combined heat and power, and other mechanical equipment installation; smart energy management systems installation; energy retrofits; energy auditing, monitoring and verification, energy project assessment, and mechanical, electrical, and renewable design services; and GHG measurement and verification services, such as stack and continuous emission testing, power generation, compliance, consulting, and other engineering services. The company also provides engineering and mechanical services to industrial, municipal, and commercial building owners; and engineering consulting services, including greenhouse gas reporting, air quality testing, emission testing, and renewable energy/power consulting. It serves manufacturing, utilities, cannabis, and education sectors, as well as commercial and multi-residential buildings. The company was formerly known as Kontrol Energy Corp. and changed its name to Kontrol Technologies Corp. in February 2021. Kontrol Technologies Corp. is headquartered in Vaughan, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Vaughan",
        "zipcode": "L4K 1X8",
        "website": "http://www.kontrolcorp.com",
        "market_cap": 25411546
    },
    "1LQ.F": {
        "short_name": "SMART EMPLOYEE BENINC",
        "long_name": "Smart Employee Benefits Inc.",
        "summary": "Smart Employee Benefits Inc., a technology company, provides business process automation and software solutions, and professional services in Canada and internationally. The company operates through Benefits and Technology segments. The Benefits segment offers software solutions, services, and products focuses on managing group benefit and wellness plans. The Technology segment provides solutions in the areas of supply chain management, integration, and energy, as well as resource provisioning; and technical infrastructure support services. The company offers its services in the area of managing group benefit solutions and healthcare claims processing for corporate and government clients. Smart Employee Benefits Inc. is headquartered in Mississauga, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Mississauga",
        "zipcode": "L4W 5C7",
        "website": "http://www.seb-inc.com",
        "market_cap": 32798550
    },
    "1VS1.F": {
        "short_name": "VISIONSTATE CORP.",
        "long_name": "Visionstate Corp.",
        "summary": "Visionstate Corp., through its subsidiary, Visionstate Inc., operates as a software development company in North America. It specializes in applications for the Internet of Things (IoT) and analytics. Its principal product is Washroom Notification and Digital Aid (WANDA), a touch-screen solution that collects information on cleaning activities, monitors supply inventories, optimizes workforces, enhances employee accountability, and provides detailed analytics. The company also offers interactive electronic business solutions in the form of touchscreen and mobile way finding and applications, as well as consulting, graphic, and web design and related services and support. The company installs its products in locations, including hospitals, airports, shopping centers, office buildings, and other public facilities. Visionstate Corp. is headquartered in Edmonton, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "AB",
        "city": "Edmonton",
        "zipcode": "T6E 5G2",
        "website": "http://www.visionstate.com",
        "market_cap": 6281000
    },
    "3NS.F": {
        "short_name": "NERDS ON SITE (SUB.VTG.)",
        "long_name": "Nerds on Site Inc.",
        "summary": "Nerds on Site Inc. provides information technology (IT), hardware, software, and related support services to small to medium-sized enterprises in Canada and the United States. The company offers printers and system network tech-support, managed security service platform, VOiP phone systems, remote and on-site support, physical and cloud platforms back-up systems, mobile app development, cyber security threat protection, and cyber crime incident response services. It also provides virtual real estate and e-commerce creative, development, management, and support services; full office, and plant/store premises security and mobile online productivity package services; and full Google cloud and Microsoft online products and support services, as well as NerdCare contracts. In addition, the company is involved in the sale of hardware and software products; hardware as a service; and development and sale of software as a service. Further, it offers proactive monitoring, disaster recovery and business continuity, managed IT, network security, onsite SMB IT support, Web hosting, and wireless networking services; IT assessment and consulting, help desk, and outsourcing services; Web, application, and database development services; computer, laptop, and PC repair services; and mobility, hosted email, hybrid IP phone solutions. Nerds on Site Inc. was founded in 1995 and is headquartered in London, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "London",
        "zipcode": "N6L 1C7",
        "website": "http://www.nerdsonsite.com",
        "market_cap": 9723646
    },
    "7XT.F": {
        "short_name": "XTM INC.",
        "long_name": "XTM Inc.",
        "summary": "XTM Inc., a financial technology company, specializes in designing, building, and maintaining payment and ecommerce solutions customized for business and consumers in Canada. The company provides mobile cloud-based banking and card issuing solutions for loyalty, reward, and corporate payouts, including tips and wages. It offers solutions for hospitality, payroll, government payouts, digitizing push payments, and cashless payment sectors. The company was formerly known as Extreme Corp Makeover Inc. and changed its name to XTM Inc. in October 2006. XTM Inc. was incorporated in 2005 and is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M6K 3E3",
        "website": "http://xtminc.com",
        "market_cap": 25759968
    },
    "AC00.F": {
        "short_name": "BANXA HOLDINGS INC.",
        "long_name": "Banxa Holdings Inc.",
        "summary": "Banxa Holdings Inc. operates as a payments service provider for the digital asset space. The company's flagship product is a Plug-and-Play Fiat Onramp that allows seamless access to digital currencies through various payment methods. Its product line is diversified by a B2B offering or B2C websites. The company was founded in 2014 and is based in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T5",
        "website": "http://www.banxa.com",
        "market_cap": 123854368
    },
    "ALYA": {
        "short_name": "Alithya Group inc.",
        "long_name": "Alithya Group Inc.",
        "summary": "Alithya Group Inc. provides strategy and digital technology services in Canada, the United States, and Europe. The company's business strategy services include strategic consulting, digital transformation, organizational performance, and enterprise architecture services. It also provides application services, such as digital applications development, legacy systems modernization, control and software engineering, cloud infrastructure, quality assurance, and automated testing; enterprise solutions comprising enterprise resource planning, corporate performance management, customer relationship management, and human capital management; and data and analytics solutions, including business intelligence, data management, artificial intelligence, and machine learning, as well as internet of things. In addition, the company provides AI-FI, an integrated artificial intelligence and fidelity solution; Askida CT, a solution that allows clients to test the functionality of applications on various platforms; Capsure RF, a cloud based platform for healthcare providers to maximize material management processes; CASSI analytics for online weekly maintenance, outage management, petrochem turnarounds, and maintenance and reliability; and SIDER, a secure solution that facilitates distribution of medical results to healthcare facilities and to centralized electronic health records. It serves financial services, energy, manufacturing, telecommunications, transportation and logistics, professional services, healthcare, and government sectors. Alithya Group Inc. was founded in 1992 and is headquartered in Montreal, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3B 3A5",
        "website": "http://www.alithya.com",
        "market_cap": 230961920
    },
    "ALYA.TO": {
        "short_name": "ALITHYA GROUP INC",
        "long_name": "Alithya Group Inc.",
        "summary": "Alithya Group Inc. provides strategy and digital technology services in Canada, the United States, and Europe. The company's business strategy services include strategic consulting, digital transformation, organizational performance, and enterprise architecture services. It also provides application services, such as digital applications development, legacy systems modernization, control and software engineering, cloud infrastructure, quality assurance, and automated testing; enterprise solutions comprising enterprise resource planning, corporate performance management, customer relationship management, and human capital management; and data and analytics solutions, including business intelligence, data management, artificial intelligence, and machine learning, as well as internet of things. In addition, the company provides AI-FI, an integrated artificial intelligence and fidelity solution; Askida CT, a solution that allows clients to test the functionality of applications on various platforms; Capsure RF, a cloud based platform for healthcare providers to maximize material management processes; CASSI analytics for online weekly maintenance, outage management, petrochem turnarounds, and maintenance and reliability; and SIDER, a secure solution that facilitates distribution of medical results to healthcare facilities and to centralized electronic health records. It serves financial services, energy, manufacturing, telecommunications, transportation and logistics, professional services, healthcare, and government sectors. Alithya Group Inc. was founded in 1992 and is headquartered in Montreal, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3B 3A5",
        "website": "http://www.alithya.com",
        "market_cap": 272800704
    },
    "BCFN.CN": {
        "short_name": "BlockchainFound",
        "long_name": "Blockchain Foundry Inc.",
        "summary": "Blockchain Foundry Inc. develops and commercializes blockchain-based business solutions in the Americas and the Caribbean. Its solutions include Syscoin Spark Wallet that allows clients to have their custom wallet based on their syscoin platform token; Syscoin Price Peg Server, which allow non-coders to create and configure its own price peg server; and Blockmarket suite, a marketplace platform. The company also provides consulting services to corporate clients seeking to incorporate blockchain technology into their business. It has a partnership with BIGG Digital Assets Inc. to develop an integrated forensic and risk scoring product for syscoin-based tokens. Blockchain Foundry Inc. was founded in 2016 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M4P 1E4",
        "website": "http://blockchainfoundry.com",
        "market_cap": 25792040
    },
    "BLFDF": {
        "short_name": "BLOCKCHAIN FOUNDRY INC",
        "long_name": "Blockchain Foundry Inc.",
        "summary": "Blockchain Foundry Inc. develops and commercializes blockchain-based business solutions in the Americas, the Caribbean, and Europe. Its solutions include Syscoin Spark Wallet that allows clients to have their custom wallet based on their syscoin platform token; Syscoin Price Peg Server, which allow non-coders to create and configure its own price peg server; and Blockmarket suite, a marketplace platform. The company also provides consulting services to corporate clients seeking to incorporate blockchain technology into their business. Blockchain Foundry Inc. was founded in 2016 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M4P 1E4",
        "website": "http://www.blockchainfoundry.co",
        "market_cap": 24890304
    },
    "BNXA.V": {
        "short_name": "BANXA HOLDINGS INC",
        "long_name": "Banxa Holdings Inc.",
        "summary": "Banxa Holdings Inc. operates as a payments service provider for the digital asset space. The company's flagship product is a Plug-and-Play Fiat Onramp that allows seamless access to digital currencies through various payment methods. Its product line is diversified by a B2B offering or B2C websites. The company was founded in 2014 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T5",
        "website": "http://www.banxa.com",
        "market_cap": 185521600
    },
    "BNXAF": {
        "short_name": "BANXA HOLDINGS INC",
        "long_name": "Banxa Holdings Inc.",
        "summary": "Banxa Holdings Inc. operates as a payments service provider for the digital asset space. The company's flagship product is a Plug-and-Play Fiat Onramp that allows seamless access to digital currencies through various payment methods. Its product line is diversified by a B2B offering or B2C websites. The company was founded in 2014 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T5",
        "website": "http://www.banxa.com",
        "market_cap": 244965280
    },
    "CMPY": {
        "short_name": "COMEPAY INC",
        "long_name": "Comepay, Inc.",
        "summary": "Comepay, Inc. provides Internet acquiring and support services. It is also involved in facilitating instant payments and internet based payment transactions through kiosks, mobile interfaces, and Web-based applications. In addition, the company leases and sells cash registers and point of sale (POS) systems, including its recently developed proprietary multifunctional smart POS fiscal cash register system. It processes approximately 10 million customer payments per month and has approximately 22,000 kiosks across Russia. The company is based in Vaughan, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Vaughan",
        "zipcode": "L4J 0A6",
        "website": "http://www.comepaygroup.com",
        "market_cap": 384868
    },
    "CTS.TO": {
        "short_name": "CONVERGE TECHNOLOGY SOLUTIONS C",
        "long_name": "Converge Technology Solutions Corp.",
        "summary": "Converge Technology Solutions Corp., through its subsidiaries, distributes storage devices and systems, computer products, software, and peripherals. The company also provides installation and maintenance; analytics, hybrid cloud, infrastructure, and cybersecurity services; cloud delivery, compute efficiency, network optimization, and IT spend optimization solutions; and IT professional services, such as data center infrastructure integration and solutioning, and cloud optimization. In addition, it offers business continuity, managed, cognitive, and cybersecurity solutions; IT portfolio management, and consulting services; and multi-site IT deployments, and ISV/OEM solutions. It serves corporate and government institutions. The company has operations in the United States and Canada. Converge Technology Solutions Corp. was incorporated in 2016 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2S1",
        "website": "http://www.convergetp.com",
        "market_cap": 1367748352
    },
    "CTSDF": {
        "short_name": "CONVERGE TECHNOLOGY SOLUTIONS C",
        "long_name": "Converge Technology Solutions Corp.",
        "summary": "Converge Technology Solutions Corp., through its subsidiaries, distributes storage devices and systems, computer products, software, and peripherals. The company also provides installation and maintenance; analytics, hybrid cloud, infrastructure, and cybersecurity services; cloud delivery, compute efficiency, network optimization, and IT spend optimization solutions; and IT professional services, such as data center infrastructure integration and solutioning, and cloud optimization. In addition, it offers business continuity, managed, cognitive, and cybersecurity solutions; IT portfolio management, and consulting services; and multi-site IT deployments, and ISV/OEM solutions. It serves corporate and government institutions. The company has operations in the United States and Canada. Converge Technology Solutions Corp. was incorporated in 2016 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2S1",
        "website": "http://www.convergetp.com",
        "market_cap": 1073947264
    },
    "D4G.F": {
        "short_name": "DATAMETREX AI LIMITED",
        "long_name": "Datametrex AI Limited",
        "summary": "Datametrex AI Limited, together with its subsidiaries, provides big data and artificial intelligence services in Canada and Korea. Its product is NexaIntelligence, a social-media discovery and monitoring platform to extract actionable insights out of discussions to inform decision-making. The company is involved in collecting, analyzing, and presenting structured and unstructured data using machine learning and artificial intelligence. It also engages in the development of blockchain technology for the collection, storage, transfer, analysis, and presentation of big data. Datametrex AI Limited is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M2N 6K8",
        "website": "http://www.datametrex.com",
        "market_cap": 40390652
    },
    "DIGAF": {
        "short_name": "DIGATRADE FINANCIAL CORP",
        "long_name": "Digatrade Financial Corp.",
        "summary": "Digatrade Financial Corp. operates as a financial technology services company. Its proprietary platform provides security and convenience services in various modalities, including online credit card payment system in South America. The company offers blockchain development services. The company was formerly known as Bit-X Financial Corporation and changed its name to Digatrade Financial Corp. in October 2015. Digatrade Financial Corp. was incorporated in 2000 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2Z6",
        "website": "http://www.digatradefinancial.com",
        "market_cap": 5871610
    },
    "DM.V": {
        "short_name": "DATAMETREX AI LIMITED",
        "long_name": "Datametrex AI Limited",
        "summary": "Datametrex AI Limited, together with its subsidiaries, provides big data and artificial intelligence services in Canada and Korea. Its product is NexaIntelligence, a social-media discovery and monitoring platform to extract actionable insights out of discussions to inform decision-making. The company is involved in collecting, analyzing, and presenting structured and unstructured data using machine learning and artificial intelligence. It also engages in the development of blockchain technology for the collection, storage, transfer, analysis, and presentation of big data. Datametrex AI Limited is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M2N 6K8",
        "website": "http://www.datametrex.com",
        "market_cap": 65922372
    },
    "DTMXF": {
        "short_name": "DATAMETREX AI LIMITED",
        "long_name": "Datametrex AI Limited",
        "summary": "Datametrex AI Limited, together with its subsidiaries, provides big data and artificial intelligence services in Canada and Korea. Its product is NexaIntelligence, a social-media discovery and monitoring platform to extract actionable insights out of discussions to inform decision-making. The company is involved in collecting, analyzing, and presenting structured and unstructured data using machine learning and artificial intelligence. It also engages in the development of blockchain technology for the collection, storage, transfer, analysis, and presentation of big data. Datametrex AI Limited is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M2N 6K8",
        "website": "http://www.datametrex.com",
        "market_cap": 54330636
    },
    "F4C.F": {
        "short_name": "MOBI724 GLOBAL SOL.",
        "long_name": "Mobi724 Global Solutions Inc.",
        "summary": "Mobi724 Global Solutions Inc., a fintech company, offers a suite of integrated data-driven business intelligence and artificial intelligence powered card-linked offers and reward solutions in North America and Latin America. Its processing platform enables card issuing banks, payment networks, merchants, and loyalty program operators to manage, deliver, track, and measure incentive campaigns in real time. The company was formerly known as Hybrid Paytech World Inc. and changed its name to Mobi724 Global Solutions Inc. in February 2015. Mobi724 Global Solutions Inc. was incorporated in 2005 and is headquartered in Montreal, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3B 0G4",
        "website": "http://www.mobi724.com",
        "market_cap": 6466902
    },
    "GCIT.CN": {
        "short_name": "GloriousCreatn",
        "long_name": "Glorious Creation Limited",
        "summary": "Glorious Creation Limited does not have significant operations. Previously, it was engaged in the IT related consulting and Internet marketing, trade agency, and consulting businesses. Glorious Creation Limited is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 4T1",
        "website": "http://www.gloriouscreationgroup.com",
        "market_cap": 11960538
    },
    "GIB": {
        "short_name": "CGI Inc.",
        "long_name": "CGI Inc.",
        "summary": "CGI Inc., together with its subsidiaries, provides information technology (IT) and business process services in Canada; Western, Southern, Central, and Eastern Europe; Australia; Scandinavia; Finland, Poland, and Baltics; the United States; the United Kingdom; and the Asia Pacific. Its services include the management of IT and business outsourcing, systems integration and consulting, and software solutions selling activities. The company also offers application development and integration and maintenance, testing, portfolio management, and modernization services; business consulting; and a suite of business process services designed to address the needs of specific industries, as well as IT infrastructure services. It serves clients operating in government, financial services, health, utility, communication, oil and gas, manufacturing, insurance, retail and consumer service, transportation, and post and logistics sectors. The company was formerly known as CGI Group Inc. and changed its name to CGI Inc. in January 2019. CGI Inc. was founded in 1976 and is headquartered in Montreal, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3G 1T4",
        "website": "http://www.cgi.com",
        "market_cap": 22182780928
    },
    "KNR.CN": {
        "short_name": "Kontrol Techno",
        "long_name": "Kontrol Technologies Corp.",
        "summary": "Kontrol Technologies Corp. provides energy efficiency solutions and technologies to commercial energy consumers in Canada and the United States. It offers SmartSite, a software as a service platform; SmartSuite, connect into existing building automation systems and to also communicate with utilities; cogeneration or combined heat and power, and other mechanical equipment installation; smart energy management systems installation; energy retrofits; energy auditing, monitoring and verification, energy project assessment, and mechanical, electrical, and renewable design services; and GHG measurement and verification services, such as stack and continuous emission testing, power generation, compliance, consulting, and other engineering services. The company also provides engineering and mechanical services to industrial, municipal, and commercial building owners; and engineering consulting services, including greenhouse gas reporting, air quality testing, emission testing, and renewable energy/power consulting. It serves manufacturing, utilities, cannabis, and education sectors, as well as commercial and multi-residential buildings. The company was formerly known as Kontrol Energy Corp. and changed its name to Kontrol Technologies Corp. in February 2021. Kontrol Technologies Corp. is headquartered in Vaughan, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Vaughan",
        "zipcode": "L4K 1X8",
        "website": "http://www.kontrolcorp.com",
        "market_cap": 86572000
    },
    "KNRLF": {
        "short_name": "KONTROL TECHNOLOGIES CORP",
        "long_name": "Kontrol Technologies Corp.",
        "summary": "Kontrol Technologies Corp. provides energy efficiency solutions and technologies to commercial energy consumers in Canada and the United States. It offers SmartSite, a software as a service platform; SmartSuite, connect into existing building automation systems and to also communicate with utilities; cogeneration or combined heat and power, and other mechanical equipment installation; smart energy management systems installation; energy retrofits; energy auditing, monitoring and verification, energy project assessment, and mechanical, electrical, and renewable design services; and GHG measurement and verification services, such as stack and continuous emission testing, power generation, compliance, consulting, and other engineering services. The company also provides engineering and mechanical services to industrial, municipal, and commercial building owners; and engineering consulting services, including greenhouse gas reporting, air quality testing, emission testing, and renewable energy/power consulting. It serves manufacturing, utilities, cannabis, and education sectors, as well as commercial and multi-residential buildings. The company was formerly known as Kontrol Energy Corp. and changed its name to Kontrol Technologies Corp. in February 2021. Kontrol Technologies Corp. is headquartered in Vaughan, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Vaughan",
        "zipcode": "L4K 1X8",
        "website": "http://www.kontrolcorp.com",
        "market_cap": 29922204
    },
    "MOBIF": {
        "short_name": "MOBI724 GLOBAL SOLUTIONS INC",
        "long_name": "Mobi724 Global Solutions Inc.",
        "summary": "Mobi724 Global Solutions Inc., a fintech company, offers a suite of integrated data-driven business intelligence and artificial intelligence powered card-linked offers and reward solutions in North America and Latin America. Its processing platform enables card issuing banks, payment networks, merchants, and loyalty program operators to manage, deliver, track, and measure incentive campaigns in real time. The company was formerly known as Hybrid Paytech World Inc. and changed its name to Mobi724 Global Solutions Inc. in February 2015. Mobi724 Global Solutions Inc. was incorporated in 2005 and is headquartered in Montreal, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3B 0G4",
        "website": "http://www.mobi724.com",
        "market_cap": 8770826
    },
    "MOOIF": {
        "short_name": "SENSOR TECHNOLOGIES CORP",
        "long_name": "Sensor Technologies Corp.",
        "summary": "Sensor Technologies Corp. is involved in the oil and gas exploration activities. Sensor Technologies Corp. is headquartered in Mississauga, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Mississauga",
        "zipcode": "L5A 3P1",
        "website": "http://www.sensetekinc.com",
        "market_cap": 1442523
    },
    "MOS.V": {
        "short_name": "MOBI724 GLOBAL SOLUTIONS INC",
        "long_name": "Mobi724 Global Solutions Inc.",
        "summary": "Mobi724 Global Solutions Inc., a fintech company, offers a suite of integrated data-driven business intelligence and artificial intelligence powered card-linked offers and reward solutions in North America and Latin America. Its processing platform enables card issuing banks, payment networks, merchants, and loyalty program operators to manage, deliver, track, and measure incentive campaigns in real time. The company was formerly known as Hybrid Paytech World Inc. and changed its name to Mobi724 Global Solutions Inc. in February 2015. Mobi724 Global Solutions Inc. was incorporated in 2005 and is headquartered in Montreal, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3B 0G4",
        "website": "http://www.mobi724.com",
        "market_cap": 8651580
    },
    "N0C.F": {
        "short_name": "QUISITIVE TECH. SOL.",
        "long_name": "Quisitive Technology Solutions, Inc.",
        "summary": "Quisitive Technology Solutions, Inc., through its subsidiaries, provides Microsoft solutions primarily in North America. The company offers Microsoft cloud solutions, including Microsoft Azure, Microsoft Dynamics business applications, and Microsoft O365; CRG emPerform, an employee performance management software for small and medium sized business; and LedgerPay, Microsoft cloud-based payment processing and data insights product platform, as well as business solutions from other technology partners that are related to the Microsoft platform. It also provides Microsoft cloud assessment, migration and implementation, and activation services; cloud solutions services; and managed services, such as system administration and operations, and monitoring, as well as application maintenance, configurations, and upgrading. In addition, the company offers artificial intelligence, big data, block chain development, and Internet of Things solutions. Additionally, the company offers cloud solutions for healthcare, oil and gas, and supply chain and manufacturing industries. Quisitive Technology Solutions, Inc. has a collaboration with Inform Diagnostics. The company was formerly known as Nebo capital corp. and changed its name to Quisitive Technology Solutions, Inc. in August 2018. Quisitive Technology Solutions, Inc. is based in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2S1",
        "website": "http://www.quisitive.com",
        "market_cap": 229536544
    },
    "NERD.CN": {
        "short_name": "NerdsOnSite",
        "long_name": "Nerds on Site Inc.",
        "summary": "Nerds on Site Inc. provides information technology (IT), hardware, software, and related support services to small to medium-sized enterprises in Canada and the United States. The company offers printers and system network tech-support, managed security service platform, VOiP phone systems, remote and on-site support, physical and cloud platforms back-up systems, mobile app development, cyber security threat protection, and cyber crime incident response services. It also provides virtual real estate and e-commerce creative, development, management, and support services; full office, and plant/store premises security and mobile online productivity package services; and full Google cloud and Microsoft online products and support services, as well as NerdCare contracts. In addition, the company is involved in the sale of hardware and software products; hardware as a service; and development and sale of software as a service. Further, it offers proactive monitoring, disaster recovery and business continuity, managed IT, network security, onsite SMB IT support, Web hosting, and wireless networking services; IT assessment and consulting, help desk, and outsourcing services; Web, application, and database development services; computer, laptop, and PC repair services; and mobility, hosted email, hybrid IP phone solutions. Nerds on Site Inc. was founded in 1995 and is headquartered in London, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "London",
        "zipcode": "N6L 1C7",
        "website": "http://www.nerdsonsite.com",
        "market_cap": 11638755
    },
    "NOSUF": {
        "short_name": "NERDS ON SITE INC",
        "long_name": "Nerds on Site Inc.",
        "summary": "Nerds on Site Inc. provides information technology (IT), hardware, software, and related support services to small to medium-sized enterprises in Canada and the United States. The company offers printers and system network tech-support, managed security service platform, VOiP phone systems, remote and on-site support, physical and cloud platforms back-up systems, mobile app development, cyber security threat protection, and cyber crime incident response services. It also provides virtual real estate and e-commerce creative, development, management, and support services; full office, and plant/store premises security and mobile online productivity package services; and full Google cloud and Microsoft online products and support services, as well as NerdCare contracts. In addition, the company is involved in the sale of hardware and software products; hardware as a service; and development and sale of software as a service. Further, it offers proactive monitoring, disaster recovery and business continuity, managed IT, network security, onsite SMB IT support, Web hosting, and wireless networking services; IT assessment and consulting, help desk, and outsourcing services; Web, application, and database development services; computer, laptop, and PC repair services; and mobility, hosted email, hybrid IP phone solutions. Nerds on Site Inc. was founded in 1995 and is headquartered in London, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "London",
        "zipcode": "N6L 1C7",
        "website": "http://www.nerdsonsite.com",
        "market_cap": 12460631
    },
    "NUVCF": {
        "short_name": "NUVEI CORPORATION",
        "long_name": "Nuvei Corporation",
        "summary": "Nuvei Corporation provides payment technology solutions to merchants and partners in North America, Europe, the Asia Pacific, and Latin America. It provides Native Commerce Platform, a unified platform that delivers payments and technology solutions for accepting payments across mobile or in-app, online, unattended, and in-store channels. The company sells and distributes its solutions through direct sales, independent sales organizations, value-added resellers, and online marketplaces. Nuvei Corporation was founded in 2003 and is headquartered in Montreal, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3B 4N4",
        "website": "http://www.nuvei.com",
        "market_cap": 9665969152
    },
    "NVEI.TO": {
        "short_name": "NUVEI CORPORATION",
        "long_name": "Nuvei Corporation",
        "summary": "Nuvei Corporation provides payment technology solutions to merchants and partners in North America, Europe, the Asia Pacific, and Latin America. It provides Native Commerce Platform, a unified platform that delivers payments and technology solutions for accepting payments across mobile or in-app, online, unattended, and in-store channels. The company sells and distributes its solutions through direct sales, independent sales organizations, value-added resellers, and online marketplaces. Nuvei Corporation was founded in 2003 and is headquartered in Montreal, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3B 4N4",
        "website": "http://www.nuvei.com",
        "market_cap": 11836233728
    },
    "PAID.CN": {
        "short_name": "XTMInc.",
        "long_name": "XTM Inc.",
        "summary": "XTM Inc., a financial technology company, specializes in designing, building, and maintaining payment and ecommerce solutions customized for business and consumers in Canada. The company provides mobile cloud-based banking and card issuing solutions for loyalty, reward, and corporate payouts, including tips and wages. It offers solutions for hospitality, payroll, government payouts, digitizing push payments, and cashless payment sectors. The company was formerly known as Extreme Corp Makeover Inc. and changed its name to XTM Inc. in October 2006. XTM Inc. was incorporated in 2005 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M6K 3E3",
        "website": "http://xtminc.com",
        "market_cap": 34907836
    },
    "PAY.TO": {
        "short_name": "PAYFARE INC",
        "long_name": "Payfare Inc.",
        "summary": "Payfare Inc., a financial technology company, provides instant payment and mobile banking solutions to gig economy workers. The company offers PayFare, a platform solution for worker pay. It serves investors and financial institutions in North America, Latin America, Europe, and the Asia-Pacific. The company was incorporated in 2012 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2B5",
        "website": "http://www.payfare.com",
        "market_cap": 309274688
    },
    "PGV.V": {
        "short_name": "PRODIGY VENTURES INC",
        "long_name": "Prodigy Ventures Inc.",
        "summary": "Prodigy Ventures Inc. provides technology services to financial institutions and other large enterprises in Canada and the United States. It offers consulting services for strategy, design, project management, application development, cloud migration, and testing. The company also develops mobile enterprise and payments applications for banks and other enterprise customers; and offers digital transformation services, such as strategy, architecture, design, project management, agile development, quality engineering, and staff augmentation. In addition, it provides IDVerifact, a SaaS platform that enables the consumption of digital identity assets into critical business processes for enterprise clients. The company is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2S1",
        "website": "http://www.prodigy.ventures",
        "market_cap": 12834690
    },
    "PKK.CN": {
        "short_name": "PeakFintech",
        "long_name": "Peak Fintech Group Inc.",
        "summary": "Peak Fintech Group Inc., through its subsidiaries, operates as an IT portfolio management company in China. It operates through two segments, Fintech Platform and Financial Services. The Fintech Platform segment provides logistic, procurement, and distribution of products within supply chains or facilitating transactions in the commercial lending industry through technology platforms. The Financial Services segment offers commercial loans to entrepreneurs and small and medium-sized businesses, as well as turn-key credit outsourcing services to banks and other lending institutions. The company was formerly known as Peak Positioning Technologies Inc. and changed its name to Peak Fintech Group Inc. in November 2020. Peak Fintech Group Inc. was incorporated in 2008 and is based in MontrÃ©al, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3A 1B9",
        "website": "http://peakfintechgroup.com",
        "market_cap": 218238752
    },
    "PKKFF": {
        "short_name": "PEAK FINTECH GROUP INC",
        "long_name": "Peak Fintech Group Inc.",
        "summary": "Peak Fintech Group Inc., through its subsidiaries, operates in the commercial lending industry in China. It operates through two segments, Fintech Platform and Financial Services. The Fintech Platform segment provides procurement and distribution of products within supply chains or facilitating transactions in the commercial lending industry through technology platforms. The Financial Services segment offers commercial loans to entrepreneurs, and small and medium-sized businesses, as well as turn-key credit outsourcing services to banks and other lending institutions. The company was formerly known as Peak Positioning Technologies Inc. and changed its name to Peak Fintech Group Inc. in November 2020. Peak Fintech Group Inc. was incorporated in 2008 and is based in Montreal, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3A 1B9",
        "website": "http://peakfintechgroup.com",
        "market_cap": 237253040
    },
    "PVT.V": {
        "short_name": "PIVOTREE INC",
        "long_name": "Pivotree Inc.",
        "summary": "Pivotree Inc. provides services focused on the design, implementation, management, and maintenance of complex e-commerce solutions for large enterprises Canada, the United States, and internationally. The company operates through two segments, Professional and Managed Services. It deploys, manages, and optimizes digital platforms in commerce, master data management, and product information management for retail and branded manufacturers. The company offers a combination of application support and managed hosting with digital strategy and software implementation services. Pivotree Inc. provides its services to B2B, B2C, distribution, finance, healthcare, hospitality, insurance, manufacturing, retail, technology, and telecommunication industries. The company was formerly known as Reliant Web Hosting Inc. and changed its name to Pivotree Inc. in September 2020. Pivotree Inc. was incorporated in 1998 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5B 2L7",
        "website": "http://pivotree.com",
        "market_cap": 168763152
    },
    "QUIS.V": {
        "short_name": "QUISITIVE TECHNOLOGY SOLUTIONS ",
        "long_name": "Quisitive Technology Solutions, Inc.",
        "summary": "Quisitive Technology Solutions, Inc., through its subsidiaries, provides Microsoft solutions primarily in North America. The company offers Microsoft cloud solutions, including Microsoft Azure, Microsoft Dynamics business applications, and Microsoft O365; CRG emPerform, an employee performance management software for small and medium sized business; and LedgerPay, Microsoft cloud-based payment processing and data insights product platform, as well as business solutions from other technology partners that are related to the Microsoft platform. It also provides Microsoft cloud assessment, migration and implementation, and activation services; cloud solutions services; and managed services, such as system administration and operations, and monitoring, as well as application maintenance, configurations, and upgrading. In addition, the company offers artificial intelligence, big data, block chain development, and Internet of Things solutions. Additionally, the company offers cloud solutions for healthcare, oil and gas, and supply chain and manufacturing industries. Quisitive Technology Solutions, Inc. has a collaboration with Inform Diagnostics. The company was formerly known as Nebo capital corp. and changed its name to Quisitive Technology Solutions, Inc. in August 2018. Quisitive Technology Solutions, Inc. is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2S1",
        "website": "http://www.quisitive.com",
        "market_cap": 407935712
    },
    "QUISF": {
        "short_name": "QUISITIVE TECHNOLOGY SOLUTIONS ",
        "long_name": "Quisitive Technology Solutions, Inc.",
        "summary": "Quisitive Technology Solutions, Inc., through its subsidiaries, provides Microsoft solutions primarily in North America. The company offers Microsoft cloud solutions, including Microsoft Azure, Microsoft Dynamics business applications, and Microsoft O365; CRG emPerform, an employee performance management software for small and medium sized business; and LedgerPay, Microsoft cloud-based payment processing and data insights product platform, as well as business solutions from other technology partners that are related to the Microsoft platform. It also provides Microsoft cloud assessment, migration and implementation, and activation services; cloud solutions services; and managed services, such as system administration and operations, and monitoring, as well as application maintenance, configurations, and upgrading. In addition, the company offers artificial intelligence, big data, block chain development, and Internet of Things solutions. Additionally, the company offers cloud solutions for healthcare, oil and gas, and supply chain and manufacturing industries. Quisitive Technology Solutions, Inc. has a collaboration with Inform Diagnostics. The company was formerly known as Nebo capital corp. and changed its name to Quisitive Technology Solutions, Inc. in August 2018. Quisitive Technology Solutions, Inc. is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2S1",
        "website": "http://www.quisitive.com",
        "market_cap": 257229616
    },
    "RGGI": {
        "short_name": "RESGREEN GROUP INTERNATIONAL IN",
        "long_name": "Resgreen Group International Inc.",
        "summary": "Resgreen Group International Inc. primarily engages in the acquisition, exploration, and development of uranium mining properties in Africa. The company holds an option to acquire up to a 100% undivided right, title, and interest in and to the Gambaro Resources property located in Njombe and Songea districts in the Republic of Tanzania. It also has option to acquire up to a 75% undivided right, title, and interest in and to the Nkoko and Kagadi uranium properties, which contain approximately 820 square kilometers located in Kiballe District, Uganda; and option to earn a 75% interest in the Karoo project that consists of approximately 8,600 square kilometers of Karoo-based uranium exploration lands located in the Southern regions of Tanzania. The company was formerly known as Uranium Hunter Corporation and changed its name to Resgreen Group International Inc. in February 2007. Resgreen Group International Inc. was founded in 2003 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5X 1K7",
        "website": "http://www.resgreenint.com",
        "market_cap": 252619
    },
    "SEB.V": {
        "short_name": "SMART EMPLOYEE BENEFITS INC",
        "long_name": "Smart Employee Benefits Inc.",
        "summary": "Smart Employee Benefits Inc., a technology company, provides business process automation and software solutions, and professional services in Canada and internationally. The company operates through Benefits and Technology segments. The Benefits segment offers software solutions, services, and products focuses on managing group benefit and wellness plans. The Technology segment provides solutions in the areas of supply chain management, integration, and energy, as well as resource provisioning; and technical infrastructure support services. The company offers its services in the area of managing group benefit solutions and healthcare claims processing for corporate and government clients. Smart Employee Benefits Inc. is headquartered in Mississauga, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Mississauga",
        "zipcode": "L4W 5C7",
        "website": "http://www.seb-inc.com",
        "market_cap": 31194516
    },
    "SENS.CN": {
        "short_name": "SensorTechCorp",
        "long_name": "Sensor Technologies Corp.",
        "summary": "Sensor Technologies Corp. is involved in the oil and gas exploration activities. Sensor Technologies Corp. is headquartered in Mississauga, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Mississauga",
        "zipcode": "L5A 3P1",
        "website": "http://www.sensetekinc.com",
        "market_cap": 2277765
    },
    "SPOFF": {
        "short_name": "GOLDSPOT DISCOVERIES CORP",
        "long_name": "GoldSpot Discoveries Corp.",
        "summary": "GoldSpot Discoveries Corp., a technology company, leverages machine learning to reduce capital risk in resource exploration and investment. It combines proprietary technology with traditional domain expertise to offer a front-to-back service solution to its partners. The company's solutions target big data problems through the use of historically unutilized data to comprehend resource property potential. It also develops a monetization strategy into various verticals of the mining and investment industry, including service offerings, investing, and royalty acquisition, as well as engages in the development of Resource Quantamental, an artificial-intelligence driven trading platform. GoldSpot Discoveries Corp. was founded in 2016 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5E 1K3",
        "website": "http://goldspot.ca",
        "market_cap": 78239600
    },
    "SPOT.V": {
        "short_name": "GOLDSPOT DISCOVERIES CORP",
        "long_name": "GoldSpot Discoveries Corp.",
        "summary": "GoldSpot Discoveries Corp., a technology company, leverages machine learning to reduce capital risk in resource exploration and investment. It combines proprietary technology with traditional domain expertise to offer a front-to-back service solution to its partners. The company's solutions target big data problems through the use of historically unutilized data to comprehend resource property potential. It also develops a monetization strategy into various verticals of the mining and investment industry, including service offerings, investing, and royalty acquisition, as well as engages in the development of Resource Quantamental, an artificial-intelligence driven trading platform. GoldSpot Discoveries Corp. was founded in 2016 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5E 1K3",
        "website": "http://goldspot.ca",
        "market_cap": 90935896
    },
    "VIS.V": {
        "short_name": "VISIONSTATE CORP",
        "long_name": "Visionstate Corp.",
        "summary": "Visionstate Corp., through its subsidiary, Visionstate Inc., operates as a software development company in North America. It specializes in applications for the Internet of Things (IoT) and analytics. Its principal product is Washroom Notification and Digital Aid (WANDA), a touch-screen solution that collects information on cleaning activities, monitors supply inventories, optimizes workforces, enhances employee accountability, and provides detailed analytics. The company also offers interactive electronic business solutions in the form of touchscreen and mobile way finding and applications, as well as consulting, graphic, and web design and related services and support. The company installs its products in locations, including hospitals, airports, shopping centers, office buildings, and other public facilities. Visionstate Corp. is headquartered in Edmonton, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Edmonton",
        "zipcode": "T6E 5G2",
        "website": "http://www.visionstate.com",
        "market_cap": 8756960
    },
    "VSSSF": {
        "short_name": "VISIONSTATE CORP",
        "long_name": "Visionstate Corp.",
        "summary": "Visionstate Corp., through its subsidiary, Visionstate Inc., operates as a software development company in North America. It specializes in applications for the Internet of Things (IoT) and analytics. Its principal product is Washroom Notification and Digital Aid (WANDA), a touch-screen solution that collects information on cleaning activities, monitors supply inventories, optimizes workforces, enhances employee accountability, and provides detailed analytics. The company also offers interactive electronic business solutions in the form of touchscreen and mobile way finding and applications, as well as consulting, graphic, and web design and related services and support. The company installs its products in locations, including hospitals, airports, shopping centers, office buildings, and other public facilities. Visionstate Corp. is headquartered in Edmonton, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Edmonton",
        "zipcode": "T6E 5G2",
        "website": "http://www.visionstate.com",
        "market_cap": 8332745
    },
    "XTMIF": {
        "short_name": "XTM INC",
        "long_name": "XTM Inc.",
        "summary": "XTM Inc., a financial technology company, specializes in designing, building, and maintaining payment and ecommerce solutions customized for business and consumers in Canada. The company provides mobile cloud-based banking and card issuing solutions for loyalty, reward, and corporate payouts, including tips and wages. It offers solutions for hospitality, payroll, government payouts, digitizing push payments, and cashless payment sectors. The company was formerly known as Extreme Corp Makeover Inc. and changed its name to XTM Inc. in October 2006. XTM Inc. was incorporated in 2005 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M6K 3E3",
        "website": "http://xtminc.com",
        "market_cap": 28381816
    },
    "YDX.V": {
        "short_name": "YDX INNOVATION CORP",
        "long_name": "YDx Innovation Corp.",
        "summary": "YDx Innovation Corp., a technology company that develops augmented and virtual reality, esports events, and interactive exhibitions technologies in Canada and Brazil. Its Arkave VR Arena division operates a gaming platform for virtual reality experience to location based venues. The company's YDreams Global division develops interactive experiences for conceptual spaces and exhibitions. Its offers Game On Festival, a format of esports events that combines digital storytelling and competitive gaming. The company was formerly known as YDreams Global Interactive Technologies Inc. and changed its name to YDx Innovation Corp. in January 2019. YDx Innovation Corp. was founded in 2007 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1S4",
        "website": "http://ydxinnovation.com",
        "market_cap": 4663197
    }
}