{
    "0C5.F": {
        "short_name": "EXACTEARTH LTD",
        "long_name": "exactEarth Ltd.",
        "summary": "exactEarth Ltd. provides maritime vessel data for ship tracking and maritime situational awareness solutions worldwide. It offers exactAIS, a data service that provides access to the automatic identification system (AIS) messages captured by the exactView satellite constellation; exactAIS Archive, which gives customers access to the satellite AIS historical data; and exactEarth ShipView, a Web-based viewing tool that allows users to see all the ship positions. The company also provides exactAIS Geospatial Web Services that allows access to its exactAIS data; exactAIS Density Maps, which deliver vessel pattern analysis by transforming AIS messages into individual geospatial data points; exactTrax service that racks fishing boats and small commercial vessels; exactView RT, real-time global satellite-AIS service; and exactAIS Insight, which combines a robust analytics engine with the comprehensive vessel movement dataset. Its products are used in the defense and security, search and rescue, fleet management, financial services, oil and gas, logistics and supply chain, illegal fishing, global vessel monitoring, and environmental protection applications. The company was formerly known as COM DEV Space Systems Ltd. and changed its name to exactEarth Ltd. in June 2009. exactEarth Ltd. was founded in 2009 and is headquartered in Cambridge, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Cambridge"
    },
    "1N1.F": {
        "short_name": "NANALYSIS SCIENTI",
        "long_name": "Nanalysis Scientific Corp.",
        "summary": "Nanalysis Scientific Corp., develops, manufactures, and sells compact nuclear magnetic resonance spectrometers for the pharmaceutical, biotech, chemical, security, food, materials, and education industries. The company sells its instruments in approximately 40 countries. Nanalysis Scientific Corp. was founded in 2009 and is based in Calgary, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "2KQ.F": {
        "short_name": "KRAKEN ROBOTICS INC.",
        "long_name": "Kraken Robotics Inc.",
        "summary": "Kraken Robotics Inc., a marine technology company, designs, manufactures, and sells software-centric sensors, batteries, and underwater robotic systems for unmanned underwater vehicles used in military and commercial applications. The company offers AquaPix interferometric synthetic aperture sonar (InSAS) for use in onboard autonomous underwater vehicles, remotely operated tow vehicles, remotely operated vehicles, and tow bodies; AquaPix miniature InSAS, an off the shelf configurable InSAS; and SeaVision, a subsea 3D laser imaging system. It also provides KATFISH, an intelligent towed SAS system; ThunderFish, a hovering autonomous underwater vehicle; ALARS, an autonomous launch and recovery system that enablea an unmanned vehicle and its payloads to be brought aboard to a host ship; and DataPod, a removable data storage module for marine applications. In addition, the company offers pressure tolerant encapsulated components, such as batteries, thrusters, actuators, and electronics; and robotics as a service, as well as implements digital signal processing and user interface software for anti-submarine warfare sonar applications. It has operations in Canada, the United States, France, Italy, Israel, the United Kingdom, Germany, and internationally. The company was formerly known as Kraken Sonar Inc. and changed its name to Kraken Robotics Inc. in September 2017. Kraken Robotics Inc. was incorporated in 2008 and is headquartered in Mt. Pearl, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Mount Pearl"
    },
    "CLIRF": {
        "short_name": "CLEARFORD WTR SYS INC",
        "long_name": "Clearford Water Systems Inc.",
        "summary": "Clearford Water Systems Inc., a water management company, provides unified water infrastructure solutions in Canada, the United States, India, and internationally. It operates in three segments: Waterworks, Water & Wastewater Infrastructure Delivery, and UV disinfection. The company offers Clearford One, a wastewater solution for the collection, conveyance and treatment of sewag; ClearDigest, an underground tanks that receive raw sewage from each connected source; ClearConvey, a network of small bore sewer pipes that carries liquids without any infiltration to an optimized facility for final treatment; and ClearRecover, a treatment facility. It also provides Clearford M-brane, a lifecycle solution for managed and decentralized water treatment; Clearford UV, which offers potable, wastewater, reuse, and rainwater disinfection systems; and Clearford Pay-for-Performance project financing program solutions. In addition, the company designs, manufactures, and sells ultraviolet purification systems using its patented Crossfire technology into the potable water, wastewater, reuse, and rainwater harvesting markets. Further, it provides water supply and wastewater treatment systems for small communities, as well as manufactures and supplies packaged treatment solutions, including containerized membrane plants for advanced water treatment. The company was formerly known as Clearford Industries Inc. and changed its name to Clearford Water Systems Inc. in June 2014. Clearford Water Systems Inc. is headquartered in Ottawa, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Ottawa"
    },
    "DSGT": {
        "short_name": "DSG GLOBAL INC",
        "long_name": "DSG Global Inc.",
        "summary": "DSG Global Inc., a technology development company, engages in the design, manufacture, and marketing of fleet management solutions worldwide. It provides patented electronic tracking systems and fleet management solutions to golf courses and other avenues that allow for remote management of the course's fleet of golf carts, turf equipment, and utility vehicles. The company sells and rents global positioning system (GPS) tracking devices and interfaces for golf vehicles, as well as offers related support services. Its products include TAG Control unit, a GPS enabled unit that communicates with the TAG software using cellular GSM networks; TEXT Display, which is paired with the TAG Control unit as its display system for operators who desire to provide basic hole distance information and messaging to the golf customers; and INFINITY system that displays banner, panel, full page, pro tip, and Green view ads. The company's products also comprise DSG advertising platform that delivers advance revenue optimization intelligence utilizing various streams of advertising delivery, such as automated, direct, and self-serve; and TAG Turf that offer back end management solutions to course operators for their turf equipment and utility vehicles. It serves the golf, fleet, agriculture, and military and government industries. DSG Global Inc. was incorporated in 2007 and is headquartered in Surrey, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Surrey"
    },
    "DVRNF": {
        "short_name": "DEVERON CORP",
        "long_name": "Deveron Corp.",
        "summary": "Deveron Corp., an agriculture technology company, provides drone data services to the farming sector in North America. It offers data acquisition services and data analytics based on digital recommendations and data interpretations. The company provides data acquisition services, including on-demand data collection for soil sampling and drone data; and data insights, such as soil, script, and image analytics, as well as profit mapping services. It also offers remote sensing and precision agriculture data aggregation and analytic services; and recurring data consulting and precision agriculture services to large enterprises and large-scale farmers. The company was formerly known as Deveron UAS Corp. and changed its name to Deveron Corp. in September 2020. Deveron Corp. was incorporated in 2011 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "FARM.V": {
        "short_name": "DEVERON CORP",
        "long_name": "Deveron Corp.",
        "summary": "Deveron Corp., an agriculture technology company, provides drone data services to the farming sector in North America. It offers data acquisition services and data analytics based on digital recommendations and data interpretations. The company provides data acquisition services, including on-demand data collection for soil sampling and drone data; and data insights, such as soil, script, and image analytics, as well as profit mapping services. It also offers remote sensing and precision agriculture data aggregation and analytic services; and recurring data consulting and precision agriculture services to large enterprises and large-scale farmers. The company was formerly known as Deveron UAS Corp. and changed its name to Deveron Corp. in September 2020. Deveron Corp. was incorporated in 2011 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "JTC.V": {
        "short_name": "JEMTEC INC",
        "long_name": "JEMTEC Inc.",
        "summary": "JEMTEC Inc. provides integrated technology systems for community-based corrections in Canada. The company offers services and technologies for offender monitoring in Canadian federal and provincial correctional departments. It offers various levels of technology that allows corrections, courts, and police to select from various options ensuring the correct level of offender control. The company's offender location detection/verification technologies include offender reporting through telephone contact, offender reporting kiosks with integrated database, global positioning system active and passive tracking, voice verification, electronic monitoring house arrest systems, remote alcohol in-home monitoring, and private monitoring services. JEMTEC Inc. was incorporated in 1981 and is headquartered in North Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "North Vancouver"
    },
    "KRKNF": {
        "short_name": "KRAKEN ROBOTICS INC",
        "long_name": "Kraken Robotics Inc.",
        "summary": "Kraken Robotics Inc., a marine technology company, designs, manufactures, and sells software-centric sensors, batteries, and underwater robotic systems for unmanned underwater vehicles used in military and commercial applications. The company offers AquaPix interferometric synthetic aperture sonar (InSAS) for use in onboard autonomous underwater vehicles, remotely operated tow vehicles, remotely operated vehicles, and tow bodies; AquaPix miniature InSAS, an off the shelf configurable InSAS; and SeaVision, a subsea 3D laser imaging system. It also provides KATFISH, an intelligent towed SAS system; ThunderFish, a hovering autonomous underwater vehicle; ALARS, an autonomous launch and recovery system that enablea an unmanned vehicle and its payloads to be brought aboard to a host ship; and DataPod, a removable data storage module for marine applications. In addition, the company offers pressure tolerant encapsulated components, such as batteries, thrusters, actuators, and electronics; and robotics as a service, as well as implements digital signal processing and user interface software for anti-submarine warfare sonar applications. It has operations in Canada, the United States, France, Italy, Israel, the United Kingdom, Germany, and internationally. The company was formerly known as Kraken Sonar Inc. and changed its name to Kraken Robotics Inc. in September 2017. Kraken Robotics Inc. was incorporated in 2008 and is headquartered in Mt. Pearl, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Mount Pearl"
    },
    "MJLB": {
        "short_name": "ULTRACK SYSTEMS INC",
        "long_name": "Ultrack Systems, Inc.",
        "summary": "Ultrack Systems, Inc., a development stage biotechnology company, focuses on providing testing services in the United States. It intends to test, sample, and analyze organic products to test for the presence of pesticides, chemical pollutants, and other non-soil contaminants in such organic products using various gas chromatography based methodologies. The company is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "NSCI.V": {
        "short_name": "NANALYSIS SCIENTIFIC CORP",
        "long_name": "Nanalysis Scientific Corp.",
        "summary": "Nanalysis Scientific Corp., develops, manufactures, and sells compact nuclear magnetic resonance spectrometers for the pharmaceutical, biotech, chemical, security, food, materials, and education industries. The company sells its instruments in approximately 40 countries. Nanalysis Scientific Corp. was founded in 2009 and is based in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "NSCIF": {
        "short_name": "NANALYSIS SCIENTIFIC CORP",
        "long_name": "Nanalysis Scientific Corp.",
        "summary": "Nanalysis Scientific Corp., develops, manufactures, and sells compact nuclear magnetic resonance spectrometers for the pharmaceutical, biotech, chemical, security, food, materials, and education industries. The company sells its instruments in approximately 40 countries. Nanalysis Scientific Corp. was founded in 2009 and is based in Calgary, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "NTSFF": {
        "short_name": "NANOTECH SECURITY CORPORATION",
        "long_name": "Nanotech Security Corp.",
        "summary": "Nanotech Security Corp. researches, creates, and produces nano-optic structures and color shifting materials for authentication and brand enhancement applications in Canada and internationally. The company offers currency authentication products, such as security foils and stripes under the KolourDepth and M2 names; and colour-shifting foils and threads under the LumaChrome name for banknotes and government IDs. It also provides security foils, pressure sensitive adhesive labels, and online brand protection solutions under the LiveLogo, LivePortrait, and LumaChrome names for brand protection. The company was formerly known as Wireless2 Technologies, Inc. and changed its name to Nanotech Security Corp. in April 2010. Nanotech Security Corp. was founded in 1984 and is headquartered in Burnaby, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Burnaby"
    },
    "PHO.TO": {
        "short_name": "PHOTON CONTROL INC",
        "long_name": "Photon Control Inc.",
        "summary": "Photon Control Inc. designs, manufactures, and distributes a range of optical sensors and systems to measure temperature and position. The company offers fiber optic temperature probes that measure temperature in harsh environments. It also provides single channel and multi-channel temperature sensing products. In addition, the company custom designs, develops, and manufactures optical position and displacement sensors. Further, it offers custom design, installation, training, and support services. Photon Control Inc. serves wafer fabrication equipment manufacturers and end users in the semiconductor and related industries in the United States and Asia. The company was formerly known as Coldswitch Technologies Inc. and changed its name to Photon Control Inc. in 2002. Photon Control Inc. was founded in 1988 and is headquartered in Richmond, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Richmond"
    },
    "PNG.V": {
        "short_name": "KRAKEN ROBOTICS INC",
        "long_name": "Kraken Robotics Inc.",
        "summary": "Kraken Robotics Inc., a marine technology company, designs, manufactures, and sells software-centric sensors, batteries, and underwater robotic systems for unmanned underwater vehicles used in military and commercial applications. The company offers AquaPix interferometric synthetic aperture sonar (InSAS) for use in onboard autonomous underwater vehicles, remotely operated tow vehicles, remotely operated vehicles, and tow bodies; AquaPix miniature InSAS, an off the shelf configurable InSAS; and SeaVision, a subsea 3D laser imaging system. It also provides KATFISH, an intelligent towed SAS system; ThunderFish, a hovering autonomous underwater vehicle; ALARS, an autonomous launch and recovery system that enablea an unmanned vehicle and its payloads to be brought aboard to a host ship; and DataPod, a removable data storage module for marine applications. In addition, the company offers pressure tolerant encapsulated components, such as batteries, thrusters, actuators, and electronics; and robotics as a service, as well as implements digital signal processing and user interface software for anti-submarine warfare sonar applications. It has operations in Canada, the United States, France, Italy, Israel, the United Kingdom, Germany, and internationally. The company was formerly known as Kraken Sonar Inc. and changed its name to Kraken Robotics Inc. in September 2017. Kraken Robotics Inc. was incorporated in 2008 and is headquartered in Mt. Pearl, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Mount Pearl"
    },
    "XCT.TO": {
        "short_name": "EXACTEARTH LTD",
        "long_name": "exactEarth Ltd.",
        "summary": "exactEarth Ltd. provides maritime vessel data for ship tracking and maritime situational awareness solutions worldwide. It offers exactAIS, a data service that provides access to the automatic identification system (AIS) messages captured by the exactView satellite constellation; exactAIS Archive, which gives customers access to the satellite AIS historical data; and exactEarth ShipView, a Web-based viewing tool that allows users to see all the ship positions. The company also provides exactAIS Geospatial Web Services that allows access to its exactAIS data; exactAIS Density Maps, which deliver vessel pattern analysis by transforming AIS messages into individual geospatial data points; exactTrax service that racks fishing boats and small commercial vessels; exactView RT, real-time global satellite-AIS service; and exactAIS Insight, which combines a robust analytics engine with the comprehensive vessel movement dataset. Its products are used in the defense and security, search and rescue, fleet management, financial services, oil and gas, logistics and supply chain, illegal fishing, global vessel monitoring, and environmental protection applications. The company was formerly known as COM DEV Space Systems Ltd. and changed its name to exactEarth Ltd. in June 2009. exactEarth Ltd. was founded in 2009 and is headquartered in Cambridge, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Cambridge"
    }
}