{"0PV2.F": {"short_name": "MOOVLY MEDIA INC.", "long_name": "Moovly Media Inc.", "summary": "Moovly Media Inc. develops cloud-based digital media and content creation platform in Canada and Belgium. The company offers Moovly Studio, a video creation editor; Video Automator that allows companies, organizations, and brands produce template-based customized videos and distribute these to their target audiences through email, social media, and third-party applications; and WORDPRESS that helps personalize and automate video content. It serves consumers, students, educational institutions, start-ups, small and medium enterprises, brands, and large blue-chip multinational corporations. The company was incorporated in 2006 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "0RS.F": {"short_name": "RESAAS SERVICES INC.", "long_name": "RESAAS Services Inc.", "summary": "RESAAS Services Inc. develops a cloud-based technology platform for the real estate industry. The company offers a suite of tools, which integrate with the platform, including a global referral network, lead generation engine, listing management, client engagement modules, customer relationship management tools, analytics, file sharing, payment system, and advertising engine. It serves multiple listing services (MLSs), franchises, and real estate brokerage and real estate agents in the real estate industry. RESAAS Services Inc. was incorporated in 2009 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "1DF.F": {"short_name": "EXEBLOCK TECHNOLOGY CORP.", "long_name": "eXeBlock Technology Corporation", "summary": "eXeBlock Technology Corporation develops and markets decentralized applications. The company is based in Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "1M6.F": {"short_name": "MEMEX INC.", "long_name": "Memex Inc.", "summary": "Memex Inc. develops, commercializes, and manufactures a suite of products for its customers in the discrete manufacturing and aerospace sectors worldwide. The company primarily offers MERLIN Tempus, a software-driven industrial Internet of Things communications platform that provides manufacturing productivity metrics, including overall equipment effectiveness in real time. Its MERLIN Tempus measures and analyzes manufacturing and production performance, and provides its users with real-time insights on operational efficiency. The company also provides MERLIN Tempus Enterprise Edition for enhancing the value of time with enterprise resource planning connectivity and job scheduling; MERLIN financial Overall Equipment Effectiveness (FOEE), which enables factory organizations to link their shop floor performance to actual profit dollars; MERLIN Continuous Improvement (CI) Fast-track services, a nine-step implementation process; and MERLIN Operator Portal, a Windows based human machine interface (HMI) that provides operators with a live window into what information is being collected from the machines in real-time. In addition, the company provides MERLIN Enterprise Resource Planning connector, a bi-synchronous interface; MERLIN OPTime to assess, measure, identify, and optimize data-driven manufacturing; and SCANGun, a bar code scanner. Further, it offers IIoT hardware solutions, including MERLIN MTC-One that incorporate sensor-based process-driven data; MTConnect hardware adapter, which enables machine tool to communicate critical operational information using the MTConnect standard protocol; software adapters; and DNC memory upgrade products. The company was formerly known as Astrix Networks Inc. and changed its name to Memex Inc. in July 2015. Memex Inc. was founded in 1992 and is headquartered in Burlington, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Burlington"}, "1NQ1.F": {"short_name": "DIGIHOST TECHN. INC. O.N.", "long_name": "Digihost Technology Inc.", "summary": "Digihost Technology Inc. operates as a blockchain technology company. It has operations in cryptocurrency mining for its own account, as well as providing hosting services to cryptocurrency mining customers. The company was formerly known as HashChain Technology Inc. and changed its name to Digihost Technology Inc. in February 2020. Digihost Technology Inc. was incorporated in 2017 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "1WL.SG": {"short_name": "Sylogist Ltd. Registered Shares", "long_name": "Sylogist Ltd.", "summary": "Sylogist Ltd., a software company, provides enterprise resource planning (ERP) solutions to local governments, non-profit and non-governmental organizations, education boards, and Districts and Defense and safety contractors in Canada, the United States, the United Kingdom, and internationally. It offers Serenic Navigator solutions that comprises accounting and financial management, award and budget management, payroll and human resources, analytics and decision support, reporting, deposits and loans, and field connect products. The company also provides NaviPayroll, an integrated payroll management and human resources solution; NaviTrak, a manufacturing and distribution solution; and NaviView terminal, a touch-screen terminal that runs various application. In addition, it offers NaviNet that captures data from various shop floor systems and data collection devices, and distributes processed data to a multitude of systems, including ERP and enterprise systems; and NaviBridge, a suite of integration and administration tool to setup, integrate, monitor, and manage data transfers between ERP and legacy systems, distributed mobile systems, and Web-based applications. The company also offers InfoStrat public sector solutions, including enterprise level case management, grantor money management, justice solutions, and professional services. Sylogist Ltd. was incorporated in 1993 and is headquartered in Calgary, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "STU", "market": "dr_market", "country": "Canada", "city": "Calgary"}, "307.F": {"short_name": "SHOPIFY A SUB.VTG", "long_name": "Shopify Inc.", "summary": "Shopify Inc., a commerce company, provides a cloud-based multi-channel commerce platform for small and medium-sized businesses in Canada, the United States, the United Kingdom, Australia, and internationally. Its platform provides merchants with a single view of business and customers in various sales channels, including Web and mobile storefronts, physical retail locations, social media storefronts, and marketplaces; and enables to manage products and inventory, process orders and payments, fulfill and ship orders, build customer relationships, source products, leverage analytics and reporting, and access financing. The company was formerly known as Jaded Pixel Technologies Inc. and changed its name to Shopify Inc. in November 2011. Shopify Inc. was founded in 2004 and is headquartered in Ottawa, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Ottawa"}, "36N0.F": {"short_name": "ABAXX TECHNOLOGIES INC.", "long_name": "Abaxx Technologies Inc.", "summary": "Abaxx Technologies, Inc., a development stage financial technology company, develops software tools for commodity traders and finance professionals to communicate, trade, and transact. It provides trading and clearing software, financial messaging and data services, and digital identity and access management software. The company is based in Toronto, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "3CKN.F": {"short_name": "ACKROO INC.", "long_name": "Ackroo Inc.", "summary": "Ackroo Inc. develops and sells an online loyalty and rewards platform that enables businesses to design and execute customer transaction, engagement, and retention strategies primarily in North America. It enables small to medium sized businesses to automate the processing and management of gift card and loyalty transactions to increase profitability and build long-term customer relationships. The company's platform provides merchants an in-store and online solution to process gift card and loyalty transactions at the point of sale; a program to help them view data for reconciliation, reporting, and marketing; and customer interfaces. It also provides marketing services, including email and direct mail marketing, and design service; data services that include access to company's business intelligence tool; and payment services comprising credit and debit card processing services. It serves automotive, petroleum, hospitality, and retail markets. Ackroo Inc. was founded in 2012 and is headquartered in Hamilton, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Hamilton"}, "3E4.F": {"short_name": "ENGHOUSE SYSTEMS LTD.", "long_name": "Enghouse Systems Limited", "summary": "Enghouse Systems Limited develops enterprise software solutions worldwide. It operates through two segments, Interactive Management Group and Asset Management Group. The Interactive Management Group segment provides customer interaction software and services. Its technologies include contact center, attendant console, interactive voice response, dialers, video collaboration, agent performance optimization, and analytics that support various telephony environment. This segment serves insurance companies, telecoms, banks, as well as technology, health care, and hospitality companies using deployment models, such as cloud, on-premise, hosted, and hybrid. The Asset Management Group segment offers a portfolio of products to cable operators, network telecommunication providers, media, transit, defense, and public safety companies. Its products include network infrastructure, operations support systems, and business support systems, as well as video and cloud tv solutions. This segment also provides fleet routing, dispatch, scheduling, transit e-ticketing and automated fare collection, communications, and emergency control center solutions for the transportation, government, first responders, distribution, and security sectors. Further, it offers public transport agencies and operators with e-ticketing solutions; and integrated software platform for wholesale billing and partner settlements; client, server and cloud software products as well as system integration services; and also offers customer engagement software. The company was founded in 1984 and is headquartered in Markham, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Markham"}, "3KZ.F": {"short_name": "LOOPSHARE LTD", "long_name": "LOOPShare Ltd.", "summary": "LOOPShare Ltd., an electric transportation company, develops and deploys connected end-to-end telematics-based solutions for inner-city transportation vehicles worldwide. It offers SVD400, a ruggedized touchscreen dashboard with telematics functionality for factory installation. The company is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "3NEN.F": {"short_name": "NAMESILO TECHS", "long_name": "NameSilo Technologies Corp.", "summary": "NameSilo Technologies Corp., through its subsidiaries, provides domain name registration and management services in Canada. It also offers marketplace services for buying and selling domain names; and hosting, website builder, SSL, premium DNS, and email services. The company was formerly known as Brisio Innovations Inc. and changed its name to NameSilo Technologies Corp. in December 2018. NameSilo Technologies Corp. is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "4T51.F": {"short_name": "KABN SYSTEMS NA HOLDINGS", "long_name": "KABN Systems NA Holdings Corp.", "summary": "KABN Systems NA Holdings Corp., through its subsidiary, KABN Systems North America Inc, focuses on the verification, management, and monetization of digital identity. The company develops and operates KABN ID, a blockchain and biometric based patent-pending digital identity validation and verification platform allowing users to prove their identity to the online community; Liquid Avatar that allows users to create digital icons representing their online personas; KABN Card, a Visa approved prepaid card program allowing users to manage digital and fiat currencies and earn cashback and other loyalty incentives ; and KABN KASH, a cashback, loyalty, and engagement program. The company is based in Markham, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Markham"}, "4WR.F": {"short_name": "FACEDRIVEINC.", "long_name": "Facedrive Inc.", "summary": "Facedrive Inc. operates as a ride-sharing company in Canada. It offers Facedrive, a ridesharing platform; and TraceSCAN, a COVID-19 contact tracing app. The company was incorporated in 2016 and is headquartered in Richmond Hill, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Richmond Hill"}, "5RW.F": {"short_name": "RIWI CORP.", "long_name": "RIWI Corp.", "summary": "RIWI Corp. operates as a trend-tracking and prediction technology firm in the United States, Canada, Europe, and internationally. Its patented cloud-based and machine-learning software solution provides global digital intelligence platform to clients seeking real-time citizen sentiment data. The company offers real-time applied analytics, forecasts, advance warnings, digital surveys, ad tests, trend-monitoring, predictive analytics, risk monitoring, and message testing services. RIWI Corporation was incorporated in 2009 and is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "5S5.F": {"short_name": "ONESOFT SOLUTIONS", "long_name": "OneSoft Solutions Inc.", "summary": "OneSoft Solutions Inc., through its subsidiaries, provides software solutions to the oil and gas pipeline industry in Canada and the United States. It offers Cognitive Integrity Management, a software-as-a-service application that uses the Microsoft Azure Cloud Platform and services, which includes machine learning, predictive analytics, business intelligence reporting, and other data science components to assist pipeline companies to prevent pipeline failures. The company was formerly known as Serenic Corporation and changed its name to OneSoft Solutions Inc. in July 2014. OneSoft Solutions Inc. is headquartered in Edmonton, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Edmonton"}, "5SO.F": {"short_name": "SPONSORSONE INC.", "long_name": "SponsorsOne Inc.", "summary": "SponsorsOne Inc., an early stage technology company, develops and operates a cloud based social sponsorship platform in the United States and Canada. The company develops SponsorsCloud, a platform for connecting and facilitating one-to one engagement between corporations to users in social networks. It also operates SponsorCoin, a platform that integrates with social networks and enables the delivery of the smart, social media marketing campaigns, and facilates transactions through its e-commerce platform, which supports the exchange of goods and services between brands and users using its digital currency SponsorCoin; and SponsorCoin and cash, a currency used to compensate the users for interacting, engaging, and creating social media content around a brands campaign. In addition, the company provides sales and marketing on behalf of the brand to its network of national wholesalers and retailers and offers purchase order financing to assist the brand in fulfilling every order; and brand building/management services, as well as manages the influencer communities for each brand. The company is headquartered in Uxbridge, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Uxbridge"}, "5VS.F": {"short_name": "VSBLTY GROUPE TECH.", "long_name": "VSBLTY Groupe Technologies Corp.", "summary": "Vsblty Groupe Technologies Corp. operates as a security and retail software technology company. Its software modules include VisionCaptor, a digital signage content management system; DataCaptor, which provides real-time analytics and audience measurement system; and VSBLTY Vector, a software module that interfaces with a local or remote database to detect persons or objects of interest within a camera's field of view. The company also provides retail hardware solutions that can be integrated with the digital screen. It has collaboration agreements with Photon-X, LLC; UST Global Inc.; Digitalware Inc.; and Prevenitas Inc. Vsblty Groupe Technologies Corp. is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "6AX.F": {"short_name": "DMG BLOCKCHAIN SOL. NEW", "long_name": "DMG Blockchain Solutions Inc.", "summary": "DMG Blockchain Solutions Inc. operates as a blockchain and cryptocurrency company. The company manages, operates, and develops digital solutions to monetize the blockchain ecosystem. It is also involved in developing enterprise blockchains, crypto-forensics, and big data analytics, as well as in the research and development of technology solutions related to transaction verification services business. The company is headquartered in Grand Forks, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Grand Forks"}, "713.F": {"short_name": "PUSHFOR INV. INC.", "long_name": "Pushfor Investments Inc.", "summary": "Pushfor Investments Inc. engages in the investment and software development activities in Canada, the United Kingdom, and the United States. The company's Investment segment invests in public and private companies operating in the technology, natural resource, and various other sectors. Its Software Development segment operates a content-sharing platform that allows clients to communicate and share information to various devices for business use. The company was formerly known as JG Wealth Inc. and changed its name to Pushfor Investments Inc. in October 2018. Pushfor Investments Inc. was incorporated in 2007 and is headquartered in Delta, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Delta"}, "771.SG": {"short_name": "Prontoforms Corp. Registered Sh", "long_name": "ProntoForms Corporation", "summary": "ProntoForms Corporation researches, develops, and markets mobile business solutions to automate field sales, field service, and other field data collection business processes. Its ProntoForms mobile platform enables remote workers to collect data on a mobile device; access company data in the field; and automatically share the results with back-office systems, cloud services, and people, as well as companies to track, analyze, and enhance processes. The company also provides solutions for inspection and audit, and installation and maintenance, as well as for field service, safety, fleet, and enterprise asset management. It operates in the United States, Canada, Latin America, Europe, and internationally. The company was formerly known as TrueContext Mobile Solutions Corporation and changed its name to ProntoForms Corporation in June 2013. ProntoForms Corporation was founded in 2001 and is based in Kanata, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "STU", "market": "dr_market", "country": "Canada", "city": "Kanata"}, "8JR.F": {"short_name": "WISHPOND TECHNOLOGIES", "long_name": "Wishpond Technologies Ltd.", "summary": "Wishpond Technologies Ltd. engages in the provision of technological digital marketing solutions for businesses in the United States, Canada, and internationally. It offers marketing, promotion, lead generation, and sales conversion services. The company provides proprietary cloud-based software for lead generation, marketing automation, and analytics, including landing pages, social promotions, website pop-ups, online forms, lead activity tracking, and email marketing; and a range of integrated marketing services, such as campaign design and management, online advertising, search engine optimization, landing page design, and others. It serves small-to-medium sized businesses in various industries, such as e-commerce, marketing agencies, beauty, fitness, and design; and blue-chip companies. The company is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "8S3B.F": {"short_name": "SPHERE 3D CORP.", "long_name": "Sphere 3D Corp.", "summary": "Sphere 3D Corp. provides data management, and desktop and application virtualization solutions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It enables organizations to deploy a combination of public, private, or hybrid cloud strategies through containerized applications, virtual desktops, virtual storage, and physical hyper-converged platforms. The company offers HVE converged and hyper-converged Infrastructure solutions, such as HVE-STACK high density server solution; HVE-VELOCITY high availability dual enclosure storage area network solution; and HVE 3DGFX, a virtualized desktop infrastructure solution. It also provides G-Series appliance to simplify Windows application migration and to enable access from various devices; and G-Series Cloud solution to provide a virtual appliance, as well as offers Glassware solution, which is compatible with the open virtual appliance and open virtual format. In addition, the company provides SnapServer network attached storage solutions, including SnapServer XSR40, a 1U server that can be configured with up to four SATA III and SSD drives; SnapServer XSR120, a 2U server, which can be configured with up to 12 SATA III, SAS, and SSD drives; GuardianOS, a storage software solution; and Snap Enterprise Data Replicator that provides multi-directional WAN-optimized replication. Sphere 3D Corp. markets its products under the SnapCLOUD, SnapServer, V3, SnapSync, and HVE brand names. The company sells its products through its distributor and reseller network to small and medium businesses, and distributed enterprises. Sphere 3D Corp. was incorporated in 2007 and is based in Toronto, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "9HBA.F": {"short_name": "FASTTASK TECHNOLOGIES I.", "long_name": "Fasttask Technologies Inc.", "summary": "Fasttask Technologies Inc. provides a peer-to-peer marketplace that connects customers to home maintenance workers for home-maintenance needs through its application in Canada. The company was formerly known as HeyBryan Media Inc. and changed its name to Fasttask Technologies Inc. in December 2020. Fasttask Technologies Inc. was founded in 2010 and is based in West Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "West Vancouver"}, "9KX.F": {"short_name": "KINAXIS INC.", "long_name": "Kinaxis Inc.", "summary": "Kinaxis Inc. provides cloud-based subscription software for supply chain operations in the United States, Europe, Asia, and Canada. The company offers RapidResponse, which provide supply chain planning and analytics capabilities for managing various supply chain management processes, including demand planning, supply planning, inventory management, order fulfillment, capacity planning, and machine learning, as well as sales and operations planning process. It also provides professional services, such as implementation, configuration, technical, and training services, as well as maintenance and support services to its software products. The company serves various industries, including aerospace and defense, automotive, consumer products, high tech and electronics, industrial, life sciences, and pharmaceuticals. The company was formerly known as webPLAN Inc. and changed its name to Kinaxis Inc. in May 2005. Kinaxis Inc. was founded in 1984 and is headquartered in Ottawa, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Ottawa"}, "9T1.F": {"short_name": "TECSYS INC.", "long_name": "Tecsys Inc.", "summary": "Tecsys Inc. engages in the development, marketing, and sale of supply chain management software in Canada, the United States, Europe, and internationally. The company offers warehouse management, distribution and transportation management, supply management at point-of-use, and retail order management, as well as financial management and analytics solutions. It also provides demand planning; and implementation, system enhancement, cloud, advisory, consulting, education, and support services, as well as OneSprint, a preconfigured cloud-based warehouse management systems package. The company primarily serves the healthcare systems, services parts, third-party logistics, retail, and general wholesale distribution industries. Tecsys Inc. was founded in 1983 and is headquartered in Montreal, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Montreal"}, "ABST": {"short_name": "Absolute Software Corporation", "long_name": "Absolute Software Corporation", "summary": "Absolute Software Corporation develops, markets, and provides cloud-based endpoint visibility and control platform for the management and security of computing devices, applications, and data for enterprise and public sector organizations. The company offers the Absolute platform to provide the connectivity, visibility, and control of data and devices of the operating system; to recover automatically to a secure operational state without user intervention; to support various other security controls and productivity tools from decay and vulnerabilities; and to enable measurement of the health, compliance, and state of decay of endpoint security controls and productivity tools, as well as for reporting and analytics, geotechnology, and endpoint investigation and recovery applications. It also provides professional, technical support, and investigation services. The company markets its solutions through device original equipment manufacturers, distributors, and value added resellers, as well as directly to corporations, government entities, educational institutions, financial services, healthcare sectors, and consumers. It operates in North America, Europe, and Africa, as well as the Asia-Pacific and Latin American regions. Absolute Software Corporation was founded in 1993 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "NMS", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "ABST.TO": {"short_name": "ABSOLUTE SOFTWARE CORPORATION", "long_name": "Absolute Software Corporation", "summary": "Absolute Software Corporation develops, markets, and provides cloud-based endpoint visibility and control platform for the management and security of computing devices, applications, and data for enterprise and public sector organizations. The company offers the Absolute platform to provide the connectivity, visibility, and control of data and devices of the operating system; to recover automatically to a secure operational state without user intervention; to support various other security controls and productivity tools from decay and vulnerabilities; and to enable measurement of the health, compliance, and state of decay of endpoint security controls and productivity tools, as well as for reporting and analytics, geotechnology, and endpoint investigation and recovery applications. It also provides professional, technical support, and investigation services. The company markets its solutions through device original equipment manufacturers, distributors, and value added resellers, as well as directly to corporations, government entities, educational institutions, financial services, healthcare sectors, and consumers. It operates in North America, Europe, and Africa, as well as the Asia-Pacific and Latin American regions. Absolute Software Corporation was founded in 1993 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "ABXX.NE": {"short_name": "ABAXX TECHNOLOGIES INC.", "long_name": "Abaxx Technologies Inc.", "summary": "Abaxx Technologies, Inc., a development stage financial technology company, develops software tools for commodity traders and finance professionals to communicate, trade, and transact. It provides trading and clearing software, financial messaging and data services, and digital identity and access management software. The company is based in Toronto, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "NEO", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "ABXXF": {"short_name": "ABAXX TECHNOLOGIES INC", "long_name": "Abaxx Technologies Inc.", "summary": "Abaxx Technologies, Inc., a development stage financial technology company, develops software tools for commodity traders and finance professionals to communicate, trade, and transact. It provides trading and clearing software, financial messaging and data services, and digital identity and access management software. The company is based in Toronto, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "ACDC.CN": {"short_name": "ExtrVehicleBat", "long_name": "Extreme Vehicle Battery Technologies Corp.", "summary": "Extreme Vehicle Battery Technologies Corp. provides blockchain solutions. It focuses on providing services for application programming interface in regards to operator look-up, customer look-up, IP information, and customer friendly user experience; and developing and implementing blockchain, distributed ledger, closed loop, and cryptocurrency services for government and commercial partners. The company was formerly known as Global Elsimate Capital Corp. and changed its name to Extreme Vehicle Battery Technologies Corp. in September 2020. Extreme Vehicle Battery Technologies Corp. is based in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "ACWRF": {"short_name": "ACCELEWARE LTD", "long_name": "Acceleware Ltd.", "summary": "Acceleware Ltd. operates as an oil and gas technology company in Canada and the United States. It operates through two segments, High-Performance Computing and RF Heating. The company develops an enhanced heavy oil and oil sands production technology based on radio frequency (RF) heating; and computational software products for the oil and gas, and other markets. Its solutions include AxFDTD, an electromagnetic modeling software to measure RF energy absorption; AxHeat RF heating simulation software; AxRTM, a graphics processing unit accelerated Kirchhoff time migration solution; AxWAVE, a solution that allows customers to model seismic acquisition and perform data characterization; AxFWI, a revolutionary modular full waveform inversion application for providing subsurface velocity models. The company also offers software related consulting services and training programs primarily to the oil and gas industry. Acceleware Ltd. was founded in 2004 and is headquartered in Calgary, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "AGPL": {"short_name": "APPLE GREEN HOLDING INC", "long_name": "Apple Green Holding, Inc.", "summary": "Apple Green Holding, Inc. focuses on acquiring and operating residential real estate properties. It provides rental, leasing, and property management services. The company was formerly known as Blue Sun Media, Inc. and changed its name to Apple Green Holding, Inc. in March 2014. Apple Green Holding, Inc. was incorporated in 2010 and is based in Richmond, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Richmond"}, "AKR.V": {"short_name": "ACKROO INC", "long_name": "Ackroo Inc.", "summary": "Ackroo Inc. develops and sells an online loyalty and rewards platform that enables businesses to design and execute customer transaction, engagement, and retention strategies primarily in North America. It enables small to medium sized businesses to automate the processing and management of gift card and loyalty transactions to increase profitability and build long-term customer relationships. The company's platform provides merchants an in-store and online solution to process gift card and loyalty transactions at the point of sale; a program to help them view data for reconciliation, reporting, and marketing; and customer interfaces. It also provides marketing services, including email and direct mail marketing, and design service; data services that include access to company's business intelligence tool; and payment services comprising credit and debit card processing services. It serves automotive, petroleum, hospitality, and retail markets. Ackroo Inc. was founded in 2012 and is headquartered in Hamilton, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Hamilton"}, "AKRFF": {"short_name": "ACKROO INC", "long_name": "Ackroo Inc.", "summary": "Ackroo Inc. develops and sells an online loyalty and rewards platform that enables businesses to design and execute customer transaction, engagement, and retention strategies primarily in North America. It enables small to medium sized businesses to automate the processing and management of gift card and loyalty transactions to increase profitability and build long-term customer relationships. The company's platform provides merchants an in-store and online solution to process gift card and loyalty transactions at the point of sale; a program to help them view data for reconciliation, reporting, and marketing; and customer interfaces. It also provides marketing services, including email and direct mail marketing, and design service; data services that include access to company's business intelligence tool; and payment services comprising credit and debit card processing services. It serves automotive, petroleum, hospitality, and retail markets. Ackroo Inc. was founded in 2012 and is headquartered in Hamilton, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Hamilton"}, "ALY.V": {"short_name": "ANALYTIXINSIGHT INC", "long_name": "AnalytixInsight Inc.", "summary": "AnalytixInsight Inc., through its subsidiaries, provides financial research and content for investors, information providers, finance portals, and media in Canada, the United States, and the European Union. The company operates capitalcube, an online portal that offers company analysis, such as fundamental research, portfolio evaluation, and screening tools on approximately 50,000 global equities and North American ETFs. The company also provides MarketWall, a mobile application offering stock-trading and research solutions; and system integration services for the workforce management industry. It offers its financial research and content through online portal www.capitalcube.com and through its institutional partner connect platform. The company was formerly known as OMT Inc. and changed its name to AnalytixInsight Inc. in July 2013. AnalytixInsight Inc. was incorporated in 1999 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "ANY": {"short_name": "Sphere 3D Corp.", "long_name": "Sphere 3D Corp.", "summary": "Sphere 3D Corp. provides data management, and desktop and application virtualization solutions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It enables organizations to deploy a combination of public, private, or hybrid cloud strategies through containerized applications, virtual desktops, virtual storage, and physical hyper-converged platforms. The company offers HVE converged and hyper-converged Infrastructure solutions, such as HVE-STACK high density server solution; HVE-VELOCITY high availability dual enclosure storage area network solution; and HVE 3DGFX, a virtualized desktop infrastructure solution. It also provides G-Series appliance to simplify Windows application migration and to enable access from various devices; and G-Series Cloud solution to provide a virtual appliance, as well as offers Glassware solution, which is compatible with the open virtual appliance and open virtual format. In addition, the company provides SnapServer network attached storage solutions, including SnapServer XSR40, a 1U server that can be configured with up to four SATA III and SSD drives; SnapServer XSR120, a 2U server, which can be configured with up to 12 SATA III, SAS, and SSD drives; GuardianOS, a storage software solution; and Snap Enterprise Data Replicator that provides multi-directional WAN-optimized replication. Sphere 3D Corp. markets its products under the SnapCLOUD, SnapServer, V3, SnapSync, and HVE brand names. The company sells its products through its distributor and reseller network to small and medium businesses, and distributed enterprises. Sphere 3D Corp. was incorporated in 2007 and is based in Toronto, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "NMS", "market": "us_market", "country": "Canada", "city": "Toronto"}, "ARHTF": {"short_name": "ARHT MEDIA INC", "long_name": "ARHT Media Inc.", "summary": "ARHT Media Inc., together with its subsidiaries, engages in the development, production, and distribution of digital human holograms and content worldwide. The company's patented technology allows for the capture, transmission, and display of the digital human holograms delivered to either an in-person or online audience, which are beamed onto virtually any stage in the world and displayed live for two-way interaction with an audience. Its products include technology rented and used for various one-off events, such as a product launch, client meetings, sales conferences, doctor training, 5G showcases, press events, and others; Capture Studio System, an end to end solution used to capture a subject for the purpose of presenting them holographically or digitally; HoloPresence Display, which is used for events, meetings, conferences, and other temporary installations; HoloPod Display, a permanent HoloPresence display system for offices, meeting rooms, and lecture halls; and ARHT Engine hardware and software, and proprietary display components, including the frame and mesh system. The company also offers transmission and maintenance fees, and subscription bundles services; and other services to customers, including equipment setup, training in the use of software and equipment, and content creation for events. ARHT Media Inc. was founded in 2012 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "ART.V": {"short_name": "ARHT MEDIA INC", "long_name": "ARHT Media Inc.", "summary": "ARHT Media Inc., together with its subsidiaries, engages in the development, production, and distribution of digital human holograms and content worldwide. The company's patented technology allows for the capture, transmission, and display of the digital human holograms delivered to either an in-person or online audience, which are beamed onto virtually any stage in the world and displayed live for two-way interaction with an audience. Its products include technology rented and used for various one-off events, such as a product launch, client meetings, sales conferences, doctor training, 5G showcases, press events, and others; Capture Studio System, an end to end solution used to capture a subject for the purpose of presenting them holographically or digitally; HoloPresence Display, which is used for events, meetings, conferences, and other temporary installations; HoloPod Display, a permanent HoloPresence display system for offices, meeting rooms, and lecture halls; and ARHT Engine hardware and software, and proprietary display components, including the frame and mesh system. The company also offers transmission and maintenance fees, and subscription bundles services; and other services to customers, including equipment setup, training in the use of software and equipment, and content creation for events. ARHT Media Inc. was founded in 2012 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "ATIXF": {"short_name": "ANALYTIXINSIGHT INC", "long_name": "AnalytixInsight Inc.", "summary": "AnalytixInsight Inc., through its subsidiaries, provides financial research and content for investors, information providers, finance portals, and media in Canada, the United States, and the European Union. The company operates capitalcube, an online portal that offers company analysis, such as fundamental research, portfolio evaluation, and screening tools on approximately 50,000 global equities and North American ETFs. The company also provides MarketWall, a mobile application offering stock-trading and research solutions; and system integration services for the workforce management industry. It offers its financial research and content through online portal www.capitalcube.com and through its institutional partner connect platform. The company was formerly known as OMT Inc. and changed its name to AnalytixInsight Inc. in July 2013. AnalytixInsight Inc. was incorporated in 1999 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "AXE.V": {"short_name": "ACCELEWARE LTD", "long_name": "Acceleware Ltd.", "summary": "Acceleware Ltd. operates as an oil and gas technology company in Canada and the United States. It operates through two segments, High-Performance Computing and RF Heating. The company develops an enhanced heavy oil and oil sands production technology based on radio frequency (RF) heating; and computational software products for the oil and gas, and other markets. Its solutions include AxFDTD, an electromagnetic modeling software to measure RF energy absorption; AxHeat RF heating simulation software; AxRTM, a graphics processing unit accelerated Kirchhoff time migration solution; AxWAVE, a solution that allows customers to model seismic acquisition and perform data characterization; AxFWI, a revolutionary modular full waveform inversion application for providing subsurface velocity models. The company also offers software related consulting services and training programs primarily to the oil and gas industry. Acceleware Ltd. was founded in 2004 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "BTEC-H.V": {"short_name": "BALSAM TECHNOLOGIES CORP", "long_name": "Balsam Technologies Corp.", "summary": "Balsam Technologies Corp. does not have significant operations. It intends to focus on various business opportunities. Previously, it was engaged in the provision of Software as a Service marketing technology through its Spark System product that allows its clients to operate marketing programs that acquire, engage, optimize, and retain customers and sales channels. The company was formerly known as RewardStream Solutions Inc. and changed its name to Balsam Technologies Corp. in October 2020. Balsam Technologies Corp. was founded in 1999 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "BTV.V": {"short_name": "BLUERUSH INC", "long_name": "BlueRush Inc.", "summary": "BlueRush Inc., through its subsidiary BlueRush Digital Media Corp., provides software as a service based marketing and sales enablement platform that enables organizations to engage with their customers. The company offers IndiVideo, an interactive personalized video platform; and financial tools and calculators. It serves financial institutions, customer communications management organizations, public companies, insurance services, and pension funds in Canada, the United States, and internationally. The company was formerly known as BlueRush Media Group Corp. and changed its name to BlueRush Inc. in April 2018. BlueRush Inc. was incorporated in 2004 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "BXV.CN": {"short_name": "BexarVentInc", "long_name": "Bexar Ventures Inc.", "summary": "Bexar Ventures Inc. operates as a technology company that specializes in selling software-as-a-service business services to corporate customers. It specializes in online testing platforms for training and high-stakes applications. The company designs, develops, and manages an online testing platform for higher education clients with multiple campus locations and complex requirements. Bexar Ventures Inc.'s testing platform supports a range of question content types incorporating multimedia elements for reading, writing, speaking, and listening assessments; and delivers practice tests, high-stakes assessments, and professional training to higher education clients. The company was incorporated in 2017 and is based in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "CDTAF": {"short_name": "CARL DATA SOLUTIONS INC", "long_name": "Carl Data Solutions Inc.", "summary": "Carl Data Solutions Inc., together with its subsidiaries, develops big-data-as-a-service based solutions in Canada and the United States. It operates through three segments: Data Services, Data Hosting, and Digital Currency Verification. The company offers data collection, storage, and analytic solutions for data-centric companies. It also provides solutions that are deployed at municipal reservoirs and water treatment facilities for work camps and temporary communities. In addition, the company offers analytics tools, which are used to predict weather events that cause combined sewer overflow; and solutions that integrate with SCADA systems and historical data to predict flooding and other possible risks to infrastructure. Further, it provides industrial solid waste monitoring solution for the construction sector; industrially robust sensors and industrial IoT gateways; and wireless networking that offers real-time monitoring of bins. Additionally, the company offers sensor networking for pipeline strain, wireless mesh networks, slope stability monitoring for stream and river crossings, and sensors that measure water saturation and slope stability. The company was formerly known as Carl Capital Corp. and changed its name to Carl Data Solutions Inc. in October 2015. Carl Data Solutions Inc. was incorporated in 2014 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "CK.CN": {"short_name": "CascadiaBloc", "long_name": "Cascadia Blockchain Group Corp.", "summary": "Cascadia Blockchain Group Corp. operates as an early stage fintech and blockchain technology company. The company operates in two divisions, Blockchain Lab and Fintech Business. The Fintech Business division engages in the development and commercialization of trading platform technology for blockchain based digital assets, utility tokens, and cryptocurrencies. The Blockchain Lab division plans to focus on the development of blockchain technology enterprise solutions and to provide related services for various industry sectors, which can be customized to the needs of the clients or designed as turnkey solutions. It also provides custodian services under the brand Eurasia International Blockchain eXchang. The company was formerly known as Cascadia Consumer Electronics Corp. and changed its name to Cascadia Blockchain Group Corp. in September 2018. The company was incorporated in 2011 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "CLGUF": {"short_name": "CLOUD NINE EDUCATION GROUP LTD", "long_name": "Cloud Nine Education Group Ltd.", "summary": "Cloud Nine Education Group Ltd. develops, markets, licenses, and sells its proprietary digitally based English as a second language (ESL) curriculum in Canada and internationally. It offers Cloud Nine ESL Program for technical schools, universities, high schools, and ESL providers. The company was formerly known as Anterior Education Holdings Ltd. and changed its name to Cloud Nine Education Group Ltd. in March 2016. Cloud Nine Education Group Ltd. was incorporated in 2015 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "CNSWF": {"short_name": "CONSTELLATION SOFTWARE INC", "long_name": "Constellation Software Inc.", "summary": "Constellation Software Inc., together with its subsidiaries, engages in the development, installation, and customization of software in the United States, Canada, the United Kingdom, Europe, and internationally. It operates through two segments, Public Sector and Private Sector. The Public Sector segment develops and distributes software solutions primarily to government and government-related customers. The Private Sector segment develops and distributes software solutions, principally to commercial customers. The company also provides related professional and support services, including installation, implementation, training, and customization of software. Constellation Software Inc. was founded in 1995 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "CPAH": {"short_name": "CounterPath Corporation", "long_name": "CounterPath Corporation", "summary": "CounterPath Corporation designs, develops, and sells software and services that enable enterprises and telecommunication service providers to deliver unified communications services over Internet protocol based networks in North America and internationally. Its products include Bria softphone suite that enables consumers and business users to make VoIP audio and video calls, send instant messages, manage their presence, share their screen, and collaborate with other users using desktop computers and laptops, smartphones, and tablets; and Bria Solo, which offers individual users to deploy their own softphones for use against SIP-based call sever. The company also offers software development kits that deliver voice, video, and messaging capabilities for desktop computers and mobile devices; Stretto Platform, a carrier-grade software platform for enterprises and service providers; Bria Teams, which delivers centralized provisioning, messaging, presence, screen sharing, video conferencing, and collaboration; and Bria Enterprise, an application for enterprises, service providers, and telecommunication channel partners to leverage the Stretto Platform to procure, distribute, provide, and manage Bria Enterprise clients from the cloud; and hosted messaging and collaboration solutions. In addition, it provides subscription, support, and maintenance services; and professional and other services, such as product configuration and customization, implementation, engineering, and training. The company sells its products and services through its own and third-party online stores; directly using its in-house sales team; and its channel partners. It serves small, medium, and large enterprises; telecommunications service providers and Internet telephony service providers; original equipment manufacturers, value added distributors, and value added resellers serving the telecommunication market; and end users. The company was founded in 2002 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "NMS", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "CRBTF": {"short_name": "INTELLABRIDGE TECHNOLOGY CORP", "long_name": "Intellabridge Technology Corp.", "summary": "Intellabridge Technology Corporation, a technology company, develops blockchain and artificial intelligence solutions for various sectors including self-sovereign identity, voting, supply-chain management, healthcare, gaming, and advertising. The company was formerly known as Cryptanite Blockchain Technologies Corp. and changed its name to Intellabridge Technology Corporation in October 2019. Intellabridge Technology Corporation is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "CRL.CN": {"short_name": "CarlData Solutn", "long_name": "Carl Data Solutions Inc.", "summary": "Carl Data Solutions Inc., together with its subsidiaries, develops big-data-as-a-service based solutions in Canada and the United States. It operates through three segments: Data Services, Data Hosting, and Digital Currency Verification. The company offers data collection, storage, and analytic solutions for data-centric companies. It also provides solutions that are deployed at municipal reservoirs and water treatment facilities for work camps and temporary communities. In addition, the company offers analytics tools, which are used to predict weather events that cause combined sewer overflow; and solutions that integrate with SCADA systems and historical data to predict flooding and other possible risks to infrastructure. Further, it provides industrial solid waste monitoring solution for the construction sector; industrially robust sensors and industrial IoT gateways; and wireless networking that offers real-time monitoring of bins. Additionally, the company offers sensor networking for pipeline strain, wireless mesh networks, slope stability monitoring for stream and river crossings, and sensors that measure water saturation and slope stability. The company was formerly known as Carl Capital Corp. and changed its name to Carl Data Solutions Inc. in October 2015. Carl Data Solutions Inc. was incorporated in 2014 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "CRYBF": {"short_name": "EXTREME VEHICLE BATTERY TECH CO", "long_name": "Extreme Vehicle Battery Technologies Corp.", "summary": "Extreme Vehicle Battery Technologies Corp. provides blockchain solutions. It focuses on providing services for application programming interface in regards to operator look-up, customer look-up, IP information, and customer friendly user experience; and developing and implementing blockchain, distributed ledger, closed loop, and cryptocurrency services for government and commercial partners. The company was formerly known as Global Elsimate Capital Corp. and changed its name to Extreme Vehicle Battery Technologies Corp. in September 2020. Extreme Vehicle Battery Technologies Corp. is based in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "CTZ.V": {"short_name": "NAMSYS INC", "long_name": "NamSys Inc.", "summary": "NamSys Inc. provides software solutions for currency management and processing for the banking and merchant industries principally in North America. The company offers Cirreon software-as-a-service platform, which helps banks and armored carriers for smart safe and daily credit offerings; cash-in-transit logistics that provides barcode track-and-trace, routing, and real-time fleet services using the Cirreon SaaS platform; and Currency Controller, a cash vault management and logistics system that manages various aspects of cash processing for banks and cash-in-transit providers. It serves financial institutions, armored carriers, retailers, and public transit authorities. The company was formerly known as Cencotech Inc. and changed its name to NamSys Inc. in November 2016. NamSys Inc. was founded in 1997 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "CYBXF": {"short_name": "GALLAGHER SECURITY CORP", "long_name": "Gallagher Security Corp.", "summary": "Gallagher Security Corp. does not have significant operations. Previously, it was engaged in the development of cyber security and cryptocurrency software. The company was formerly known as Hilltop Cybersecurity Inc. and changed its name to Gallagher Security Corp. in June 2019. Gallagher Security Corp. was incorporated in 2005 and is headquartered in Kelowna, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Kelowna"}, "DAC.V": {"short_name": "DATABLE TECHNOLOGY CORPORATION", "long_name": "Datable Technology Corporation", "summary": "Datable Technology Corporation, a technology company, provides consumer digital and social media engagement, data mining, and loyalty solutions primarily in Canada and the United States. The company offers PlatformÂ³, a software as a service consumer marketing platform that enables consumer packaged goods companies and consumer brands to build and launch promotions and special offers on the mobile phone. It serves Internet advertising sector consumers. The company was formerly known as 3Tl Technologies Corp. and changed its name to Datable Technology Corporation in May 2018. Datable Technology Corporation was founded in 2008 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "DC2.F": {"short_name": "DESCARTES SYS GRP INC.", "long_name": "The Descartes Systems Group Inc", "summary": "The Descartes Systems Group Inc. provides cloud, device, and data content-based solutions that focus on enhancing the productivity, performance, and security of logistics-intensive businesses worldwide. Its Logistics Technology platform combines a network, applications, content, and a community. The company provides a suite of solutions that include routing, mobile and telematics; transportation management and e-commerce fulfillment; customs and regulatory compliance; global trade data and services; global logistics network services; and broker and forwarder enterprise systems. The company offers its customers to use its modular, cloud-based and data content solutions to route, schedule, track, and measure delivery resources; plan, allocate, and execute shipments; rate, audit, and pay transportation invoices; access and analyze global trade data; research and perform trade tariff and duty calculations; file customs and security documents for imports and exports; comply with trade regulations, and various other logistics processes. It also act as a reseller of hardware devices in connection with transportation and logistics operations. The company primarily focuses on serving transportation providers, logistics service providers, manufacturers, retailers, distributors, and business service providers. The company was founded in 1981 and is headquartered in Waterloo, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Waterloo"}, "DCBO": {"short_name": "Docebo Inc.", "long_name": "Docebo Inc.", "summary": "Docebo Inc. provides a cloud-based SaaS learning platform to train external workforces, partners, and customers in North America, Europe, and the Asia-Pacific region. Its platform helps customers to centralize learning materials from peer enterprises and learners into one learning management system to expedite and enrich the learning process, increase productivity, and grow teams uniformly. The company's learning platform includes Docebo Learn, a foundational module that enables learning administrators to centralize, organize, and distribute learning content, track certifications, and measure results with customer analytics; Docebo Discover, Coach & Share that provides personalized curated content and access to social learning by sharing of knowledge; and Docebo Extended Enterprise that allows businesses to manage various portals for audiences. It also provides Docebo for Salesforce, a native integration that leverages Salesforce's application programming interface and technology architecture to produce a learning experience; and Docebo Embed (OEM), which eliminates disjointed learner experiences, long development cycles, and ineffective partner models by allowing original equipment manufacturers to embed and re-sell Docebo as a part of their software. In addition, the company offers Docebo Mobile App Publisher product that allows companies to create and publish own branded version of Docebo Go.Learn mobile learning applications; Docebo Virtual Coach, an AI-powered assistant; Docebo Mobile Pages that enable administrators to develop mobile learning environments; and Docebo Discover that curate personalized learning content based on the skills that learners want to develop for customers. It serves customers in the technology, media and entertainment, manufacturing, consumer products, financial services, and retail industries. The company was formerly known as Docebo Canada, Inc. Docebo Inc. founded in 2005 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "NMS", "market": "us_market", "country": "Canada", "city": "Toronto"}, "DCBO.TO": {"short_name": "DOCEBO INC", "long_name": "Docebo Inc.", "summary": "Docebo Inc. provides a cloud-based SaaS learning platform to train external workforces, partners, and customers in North America, Europe, and the Asia-Pacific region. Its platform helps customers to centralize learning materials from peer enterprises and learners into one learning management system to expedite and enrich the learning process, increase productivity, and grow teams uniformly. The company's learning platform includes Docebo Learn, a foundational module that enables learning administrators to centralize, organize, and distribute learning content, track certifications, and measure results with customer analytics; Docebo Discover, Coach & Share that provides personalized curated content and access to social learning by sharing of knowledge; and Docebo Extended Enterprise that allows businesses to manage various portals for audiences. It also provides Docebo for Salesforce, a native integration that leverages Salesforce's application programming interface and technology architecture to produce a learning experience; and Docebo Embed (OEM), which eliminates disjointed learner experiences, long development cycles, and ineffective partner models by allowing original equipment manufacturers to embed and re-sell Docebo as a part of their software. In addition, the company offers Docebo Mobile App Publisher product that allows companies to create and publish own branded version of Docebo Go.Learn mobile learning applications; Docebo Virtual Coach, an AI-powered assistant; Docebo Mobile Pages that enable administrators to develop mobile learning environments; and Docebo Discover that curate personalized learning content based on the skills that learners want to develop for customers. It serves customers in the technology, media and entertainment, manufacturing, consumer products, financial services, and retail industries. The company was formerly known as Docebo Canada, Inc. Docebo Inc. founded in 2005 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "DCBOF": {"short_name": "DOCEBO INC", "long_name": "Docebo Inc.", "summary": "Docebo Inc. provides a cloud-based SaaS learning platform to train external workforces, partners, and customers in North America, Europe, and the Asia-Pacific region. Its platform helps customers to centralize learning materials from peer enterprises and learners into one learning management system to expedite and enrich the learning process, increase productivity, and grow teams uniformly. The company's learning platform includes Docebo Learn, a foundational module that enables learning administrators to centralize, organize, and distribute learning content, track certifications, and measure results with customer analytics; Docebo Discover, Coach & Share that provides personalized curated content and access to social learning by sharing of knowledge; and Docebo Extended Enterprise that allows businesses to manage various portals for audiences. It also provides Docebo for Salesforce, a native integration that leverages Salesforce's application programming interface and technology architecture to produce a learning experience; and Docebo Embed (OEM), which eliminates disjointed learner experiences, long development cycles, and ineffective partner models by allowing original equipment manufacturers to embed and re-sell Docebo as a part of their software. In addition, the company offers Docebo Mobile App Publisher product that allows companies to create and publish own branded version of Docebo Go.Learn mobile learning applications; Docebo Virtual Coach, an AI-powered assistant; Docebo Mobile Pages that enable administrators to develop mobile learning environments; and Docebo Discover that curate personalized learning content based on the skills that learners want to develop for customers. It serves customers in the technology, media and entertainment, manufacturing, consumer products, financial services, and retail industries. The company was formerly known as Docebo Canada, Inc. Docebo Inc. founded in 2005 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "DFK.F": {"short_name": "01 COMMUNIQUE LAB. INC.", "long_name": "01 Communique Laboratory Inc.", "summary": "01 Communique Laboratory Inc. provides cyber security and remote access solutions in the United States, Japan, and Canada. It offers I'm InTouch is a remote desktop connection software that allows users to control distant computer through the Internet; I'm OnCall, a secure online help desk software which allows organizations to offer remote support over the Internet to their customers; and I'm InTouch Meeting, a secure web-based collaboration system allowing users to host online meetings and web conferencing by sharing the computer screen of the moderator among all the attendees. The company also provides IronCAP X, a digital signature email system; and IronCAZ API to build post-quantum systems for blockchain, 5G/IoT, data storage, remote access/VPN, encryption, digital signing etc. using the standard PKCS#11 and OpenPGP formats. 01 Communique Laboratory Inc. was founded in 1992 and is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "DGHI.V": {"short_name": "DIGIHOST TECHNOLOGY INC", "long_name": "Digihost Technology Inc.", "summary": "Digihost Technology Inc. operates as a blockchain technology company. It has operations in cryptocurrency mining for its own account, as well as providing hosting services to cryptocurrency mining customers. The company was formerly known as HashChain Technology Inc. and changed its name to Digihost Technology Inc. in February 2020. Digihost Technology Inc. was incorporated in 2017 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "DME1.F": {"short_name": "DESTINY MEDIA  DL-,001", "long_name": "Destiny Media Technologies Inc.", "summary": "Destiny Media Technologies Inc., through its subsidiary, Destiny Software Productions Inc., develops technologies that enable the distribution of digital media files in a streaming or digital download format over the internet. It offers Play MPE, a two-sided B2B marketplace that enables music labels and artists to create and distribute promotional content and musical assets, as well as music broadcasting professionals, music curators, and music reviewers to discover, download, broadcast, and review the music. The company also provides Clipstream, an online video platform for encoding, hosting, and reporting on video playback that can be embedded in third party websites or emails; and playback through its JavaScript codec engine. It markets and sells its products in the United States, Canada, Europe, Asia, South America, Africa, and Australia. Destiny Media Technologies Inc. was founded in 1991 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "DMGGF": {"short_name": "DMG BLOCKCHAIN SOLUTIONS INC", "long_name": "DMG Blockchain Solutions Inc.", "summary": "DMG Blockchain Solutions Inc. operates as a blockchain and cryptocurrency company. The company manages, operates, and develops digital solutions to monetize the blockchain ecosystem. It is also involved in developing enterprise blockchains, crypto-forensics, and big data analytics, as well as in the research and development of technology solutions related to transaction verification services business. The company is headquartered in Grand Forks, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Grand Forks"}, "DMGI.V": {"short_name": "DMG BLOCKCHAIN SOLUTIONS INC", "long_name": "DMG Blockchain Solutions Inc.", "summary": "DMG Blockchain Solutions Inc. operates as a blockchain and cryptocurrency company. The company manages, operates, and develops digital solutions to monetize the blockchain ecosystem. It is also involved in developing enterprise blockchains, crypto-forensics, and big data analytics, as well as in the research and development of technology solutions related to transaction verification services business. The company is headquartered in Grand Forks, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Grand Forks"}, "DSG.TO": {"short_name": "DESCARTES SYS", "long_name": "The Descartes Systems Group Inc", "summary": "The Descartes Systems Group Inc. provides cloud, device, and data content-based solutions that focus on enhancing the productivity, performance, and security of logistics-intensive businesses worldwide. Its Logistics Technology platform combines a network, applications, content, and a community. The company provides a suite of solutions that include routing, mobile and telematics; transportation management and e-commerce fulfillment; customs and regulatory compliance; global trade data and services; global logistics network services; and broker and forwarder enterprise systems. The company offers its customers to use its modular, cloud-based and data content solutions to route, schedule, track, and measure delivery resources; plan, allocate, and execute shipments; rate, audit, and pay transportation invoices; access and analyze global trade data; research and perform trade tariff and duty calculations; file customs and security documents for imports and exports; comply with trade regulations, and various other logistics processes. It also act as a reseller of hardware devices in connection with transportation and logistics operations. The company primarily focuses on serving transportation providers, logistics service providers, manufacturers, retailers, distributors, and business service providers. The company was founded in 1981 and is headquartered in Waterloo, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Waterloo"}, "DSGX": {"short_name": "The Descartes Systems Group Inc", "long_name": "The Descartes Systems Group Inc", "summary": "The Descartes Systems Group Inc. provides cloud, device, and data content-based solutions that focus on enhancing the productivity, performance, and security of logistics-intensive businesses worldwide. Its Logistics Technology platform combines a network, applications, content, and a community. The company provides a suite of solutions that include routing, mobile and telematics; transportation management and e-commerce fulfillment; customs and regulatory compliance; global trade data and services; global logistics network services; and broker and forwarder enterprise systems. The company offers its customers to use its modular, cloud-based and data content solutions to route, schedule, track, and measure delivery resources; plan, allocate, and execute shipments; rate, audit, and pay transportation invoices; access and analyze global trade data; research and perform trade tariff and duty calculations; file customs and security documents for imports and exports; comply with trade regulations, and various other logistics processes. It also act as a reseller of hardware devices in connection with transportation and logistics operations. The company primarily focuses on serving transportation providers, logistics service providers, manufacturers, retailers, distributors, and business service providers. The company was founded in 1981 and is headquartered in Waterloo, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "NMS", "market": "us_market", "country": "Canada", "city": "Waterloo"}, "DSNY": {"short_name": "DESTINY MEDIA TECHNOLOGIES INC", "long_name": "Destiny Media Technologies Inc.", "summary": "Destiny Media Technologies Inc., through its subsidiary, Destiny Software Productions Inc., develops technologies that enable the distribution of digital media files in a streaming or digital download format over the internet. It offers Play MPE, a two-sided B2B marketplace that enables music labels and artists to create and distribute promotional content and musical assets, as well as music broadcasting professionals, music curators, and music reviewers to discover, download, broadcast, and review the music. The company also provides Clipstream, an online video platform for encoding, hosting, and reporting on video playback that can be embedded in third party websites or emails; and playback through its JavaScript codec engine. It markets and sells its products in the United States, Canada, Europe, Asia, South America, Africa, and Australia. Destiny Media Technologies Inc. was founded in 1991 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "DSY.V": {"short_name": "DESTINY MEDIA TECHNOLOGIES INC.", "long_name": "Destiny Media Technologies Inc.", "summary": "Destiny Media Technologies Inc., through its subsidiary, Destiny Software Productions Inc., develops technologies that enable the distribution of digital media files in a streaming or digital download format over the internet. It offers Play MPE, a two-sided B2B marketplace that enables music labels and artists to create and distribute promotional content and musical assets, as well as music broadcasting professionals, music curators, and music reviewers to discover, download, broadcast, and review the music. The company also provides Clipstream, an online video platform for encoding, hosting, and reporting on video playback that can be embedded in third party websites or emails; and playback through its JavaScript codec engine. It markets and sells its products in the United States, Canada, Europe, Asia, South America, Africa, and Australia. Destiny Media Technologies Inc. was founded in 1991 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "DUSYF": {"short_name": "DUESENBERG TECHNOLOGIES INC", "long_name": "Duesenberg Technologies Inc.", "summary": "Duesenberg Technologies Inc. develops mobile applications for merchant and consumer use primarily in Asia. The company offers Vgrab Application, a free mobile voucher application for smartphones using the Android and Apple iOS operating systems that allows users to redeem vouchers on their smartphones at various retailers and merchants; and Vgrab Merchant, a mobile application for merchants to advertise their products and services. It also provides Vmore Platform and SMART Systems, as well as sells online goods, online video service portal, and marketing services, such as advertising through its website and newsletters. In addition, the company through its subsidiary, engages in the development of electric vehicles under the Duesenberg brand. The company was formerly known as VGrab Communications Inc. and changed its name to Duesenberg Technologies Inc. in December 2020. The company is headquartered in Vancouver, Canada. Duesenberg Technologies Inc. is a subsidiary of Hampshire Capital Limited.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "DVN.CN": {"short_name": "DanavationTech", "long_name": "Danavation Technologies Inc.", "summary": "Danavation Technologies Inc. manufactures digital e-paper labels and displays. The company was incorporated in 2018 and is based in Toronto, Canada. Danavation Technologies Inc. was incorporated in 2018 and is based in Toronto, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "DXX.V": {"short_name": "DXSTORM.COM INC.", "long_name": "DXStorm.com Inc.", "summary": "DXStorm.com Inc. provides services related to medical application software development, e-commerce, and Internet based solutions in Canada and the United States. The company offers e-commerce services comprising DXshop, a turnkey e-store solution for small to medium businesses; DXcart, an e-commerce enabler for Websites on various platforms; DXweb, a Website development and hosting solution for companies; and DXGreenGate online payment solution. It also provides medical image analysis; Web hosting and mail services; retail payment solutions, such as DXCard; software development and custom programming services; and management services, as well as resells hardware. The company is headquartered in Oakville, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Oakville"}, "EGHSF": {"short_name": "ENGHOUSE SYSTEMS", "long_name": "Enghouse Systems Limited", "summary": "Enghouse Systems Limited develops enterprise software solutions worldwide. It operates through two segments, Interactive Management Group and Asset Management Group. The Interactive Management Group segment provides customer interaction software and services. Its technologies include contact center, attendant console, interactive voice response, dialers, video collaboration, agent performance optimization, and analytics that support various telephony environment. This segment serves insurance companies, telecoms, banks, as well as technology, health care, and hospitality companies using deployment models, such as cloud, on-premise, hosted, and hybrid. The Asset Management Group segment offers a portfolio of products to cable operators, network telecommunication providers, media, transit, defense, and public safety companies. Its products include network infrastructure, operations support systems, and business support systems, as well as video and cloud tv solutions. This segment also provides fleet routing, dispatch, scheduling, transit e-ticketing and automated fare collection, communications, and emergency control center solutions for the transportation, government, first responders, distribution, and security sectors. Further, it offers public transport agencies and operators with e-ticketing solutions; and integrated software platform for wholesale billing and partner settlements; client, server and cloud software products as well as system integration services; and also offers customer engagement software. The company was founded in 1984 and is headquartered in Markham, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Markham"}, "EL.V": {"short_name": "ENGAGEMENT LABS INC", "long_name": "Engagement Labs Inc.", "summary": "Engagement Labs Inc. provides intelligent data, analytics, and insights for marketers and organizations to track, measure, and benchmark the conversations happening around a brand or industry. The company offers TotalSocial, a platform that focuses on the entire social ecosystem by combining online (social media) and offline (word of mouth) data with predictive analytics. It has operations in Canada, the United States, and the United Kingdom. The company was formerly known as Parta Dialogue Inc. and changed its name to Engagement Labs Inc. in December 2013. Engagement Labs Inc. was incorporated in 2007 and is headquartered in MontrÃ©al, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Montreal"}, "ELBSF": {"short_name": "ENGAGEMENT LABS INC", "long_name": "Engagement Labs Inc.", "summary": "Engagement Labs Inc. provides intelligent data, analytics, and insights for marketers and organizations to track, measure, and benchmark the conversations happening around a brand or industry. The company offers TotalSocial, a platform that focuses on the entire social ecosystem by combining online (social media) and offline (word of mouth) data with predictive analytics. It has operations in Canada, the United States, and the United Kingdom. The company was formerly known as Parta Dialogue Inc. and changed its name to Engagement Labs Inc. in December 2013. Engagement Labs Inc. was incorporated in 2007 and is headquartered in MontrÃ©al, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Montreal"}, "ENGH.TO": {"short_name": "ENGHOUSE SYSTEMS LIMITED", "long_name": "Enghouse Systems Limited", "summary": "Enghouse Systems Limited develops enterprise software solutions worldwide. It operates through two segments, Interactive Management Group and Asset Management Group. The Interactive Management Group segment provides customer interaction software and services. Its technologies include contact center, attendant console, interactive voice response, dialers, video collaboration, agent performance optimization, and analytics that support various telephony environment. This segment serves insurance companies, telecoms, banks, as well as technology, health care, and hospitality companies using deployment models, such as cloud, on-premise, hosted, and hybrid. The Asset Management Group segment offers a portfolio of products to cable operators, network telecommunication providers, media, transit, defense, and public safety companies. Its products include network infrastructure, operations support systems, and business support systems, as well as video and cloud tv solutions. This segment also provides fleet routing, dispatch, scheduling, transit e-ticketing and automated fare collection, communications, and emergency control center solutions for the transportation, government, first responders, distribution, and security sectors. Further, it offers public transport agencies and operators with e-ticketing solutions; and integrated software platform for wholesale billing and partner settlements; client, server and cloud software products as well as system integration services; and also offers customer engagement software. The company was founded in 1984 and is headquartered in Markham, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Markham"}, "FD.V": {"short_name": "FACEDRIVE INC", "long_name": "Facedrive Inc.", "summary": "Facedrive Inc. operates as a ride-sharing company in Canada. It offers Facedrive, a ridesharing platform; and TraceSCAN, a COVID-19 contact tracing app. The company was incorporated in 2016 and is headquartered in Richmond Hill, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Richmond Hill"}, "FDM.CN": {"short_name": "FandomSports", "long_name": "Fandom Sports Media Corp.", "summary": "Fandom Sports Media Corp., a live sports and esports entertainment company, aggregates, curates, and produces fan-focused content. The company's principal product is FANDOM SPORTS App, a mobile application for unfiltered raw sports talk. Its application allows sports fans to unleash their primal sports passions, pick fights, and earn rewards. The company also develops FANDOM SPORTS entertainment platform, a micro-services platform for esports with Blaze blockchain technology. It operates in Canada and Finland. The company was formerly known as Hatch Interactive Technologies Corp. and changed its name to Fandom Sports Media Corp. in August 2016. Fandom Sports Media Corp. is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "FDMSF": {"short_name": "FANDOM SPORTS MEDIA CORP", "long_name": "Fandom Sports Media Corp.", "summary": "Fandom Sports Media Corp., a live sports and esports entertainment company, aggregates, curates, and produces fan-focused content. The company's principal product is FANDOM SPORTS App, a mobile application for unfiltered raw sports talk. Its application allows sports fans to unleash their primal sports passions, pick fights, and earn rewards. The company also develops FANDOM SPORTS entertainment platform, a micro-services platform for esports with Blaze blockchain technology. It operates in Canada and Finland. The company was formerly known as Hatch Interactive Technologies Corp. and changed its name to Fandom Sports Media Corp. in August 2016. Fandom Sports Media Corp. is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "FDVRF": {"short_name": "FACEDRIVE INC", "long_name": "Facedrive Inc.", "summary": "Facedrive Inc. operates as a ride-sharing company in Canada. It offers Facedrive, a ridesharing platform; and TraceSCAN, a COVID-19 contact tracing app. The company was incorporated in 2016 and is headquartered in Richmond Hill, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Richmond Hill"}, "FNNGD": {"short_name": "HEALTH LOGIC INTERACTIVE INC", "long_name": "Health Logic Interactive Inc.", "summary": "Fanlogic Interactive Inc. does not have significant operations. Previously, it was engaged in the operation of a brand referral platform. The company intends to develop consumer-focused healthcare technologies. Fanlogic Interactive Inc. is based in Calgary, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "FOG-X.CN": {"short_name": "FogChainCo", "long_name": "FogChain Corp.", "summary": "FogChain Corp. provides an end-to-end software development life cycle and quality assurance solutions in Canada. It offers RadJav, a software development platform and decentralized datacenter; Test Case Manager, a patented automated testing product that allows organizations to accomplish substantial cost savings and improved time to market by automating their test cases; AppMark, a synthetic monitoring service that allows organizations to monitor performance of their applications; and Trident, a cross-platform application that provides developers with a suite of tools to build, test, and monitor applications. The company is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "FUND.V": {"short_name": "KATIPULT TECHNOLOGY CORP", "long_name": "Katipult Technology Corp.", "summary": "Katipult Technology Corp. operates as a financial technology company. The company offers a cloud-based software infrastructure that allows firms to design, set up, and operate an investment platform, which enables firms to offer debt and real-estate financing; and securities on a prospectus-exempt basis to various types of investors. The company's platform automates various components of investor and investment management, including components of financial transactions, investment marketing, and dividend payouts, as well as manages regulatory requirements in various geographic jurisdictions. It serves customers in North America, Europe, Asia, Africa, Oceania, and South America. Katipult Technology Corp.'s platform includes modules for various user types, including investors, issuers, administrators and auditors, and others. The company was formerly known as Deha Capital Corp. and changed its name to Katipult Technology Corp. in August 11 2017. Katipult Technology Corp. was founded in 2008 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "GARLF": {"short_name": "NETCOINS HOLDINGS INC", "long_name": "Netcoins Holdings Inc.", "summary": "Netcoins Holdings Inc. does not have significant operations. Previously, it was engaged in the development and marketing of a software to make consumers purchase and sale of cryptocurrency through brokerage services. The company is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "GDT.F": {"short_name": "GLOBEX DATA LTD.", "long_name": "Globex Data Ltd.", "summary": "Globex Data Ltd. operates as a distributor and license holder of a suite of secure cloud-based storage, document management, encrypted emails, and secure communication tools. It offers DigitalSafe, an encrypted password manager, secure data backup, secure file-share, and secure email; PrivaTalk, a private and secure communications application offering secure chat with self destruct timer, secure voice and video calling and conferencing, secure email, and encrypted file transfer through any mobile device, tablet, or desktop; Sekur, a product for key personnel in large organizations and high net worth individuals geared for users sensitive to privacy and security; and Custodia. The company primarily sells its products through resellers and other distribution channels, such as managed service providers, Internet service providers, and telecommunication companies. It serves consumers, businesses, and governments worldwide. GlobeX Data Ltd. was founded in 2017 and is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "GLL.CN": {"short_name": "GallagherSec", "long_name": "Gallagher Security Corp.", "summary": "Gallagher Security Corp. does not have significant operations. Previously, it was engaged in the development of cyber security and cryptocurrency software. The company was formerly known as Hilltop Cybersecurity Inc. and changed its name to Gallagher Security Corp. in June 2019. Gallagher Security Corp. was incorporated in 2005 and is headquartered in Kelowna, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Kelowna"}, "GUESF": {"short_name": "GUESTLOGIX INC", "long_name": "GuestLogix Inc.", "summary": "GuestLogix Inc. provides retail and payment technology solutions to the passenger travel industry. The company offers point-of-sale (POS) hardware solutions comprising mobile, POS device, and inflight entertainment systems; retail platform solutions; and payment processing technology, as well as OnTouch destination merchandising solutions. It also provides ancillary insights services, such as out-of-the-box reporting suites, enterprise reporting toolsets, and advanced analytics; and travel retail performance management services consisting of operational process development, outsourced retail management, and retail model development services. In addition, the company offers GuestPass Ticketing, a ticketing solution that enables travel operators to facilitate ticketing services across multiple access points; and t-Retail Platform, which provides destination-based content for travel operators to use in the booking path. It primarily serves customers in North America, Europe, South America, Africa, and Asia. The company is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "HELX.V": {"short_name": "HELIX APPLICATIONS INC", "long_name": "Helix Applications Inc.", "summary": "Helix Applications Inc. develops blockchain-based software technologies and applications. The company was formerly known as Belvedere Resources Ltd. and changed its name to Helix Applications Inc. in October 2018. Helix Applications Inc. was incorporated in 2018 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "HEYBF": {"short_name": "FASTTASK TECHNOLOGIES INC", "long_name": "Fasttask Technologies Inc.", "summary": "Fasttask Technologies Inc. provides a peer-to-peer marketplace that connects customers to home maintenance workers for home-maintenance needs through its application in Canada. The company was formerly known as HeyBryan Media Inc. and changed its name to Fasttask Technologies Inc. in December 2020. Fasttask Technologies Inc. was founded in 2010 and is based in West Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "West Vancouver"}, "HLLPF": {"short_name": "HELLO PAL INTERNATIONAL INC", "long_name": "Hello Pal International Inc.", "summary": "Hello Pal International Inc. develops, markets, and operates an international social networking platform. It offers HPI Platform, which enables users to find and interact with users from all over the world through chat messaging, livestreaming, and audio/video calling. The company's platform also offers a digital wallet that allows users to store and transfer digital assets and tokens, including Bitcoin and Ether based on blockchain technology. The company was formerly known as Neoteck Solutions Inc. and changed its name to Hello Pal International Inc. in May 2016. The company was incorporated in 1986 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "HOC.V": {"short_name": "HUNTER TECHNOLOGY CORP", "long_name": "Hunter Technology Corp.", "summary": "Hunter Oil Corp. acquires and develops crude oil and natural gas properties. The company was formerly known as Enhanced Oil Resources Inc. and changed its name to Hunter Oil Corp. in August 2016. Hunter Oil Corp. was incorporated in 1980 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "HOILF": {"short_name": "HUNTER TECHNOLOGY CORP", "long_name": "Hunter Technology Corp.", "summary": "Hunter Oil Corp. acquires and develops crude oil and natural gas properties. The company was formerly known as Enhanced Oil Resources Inc. and changed its name to Hunter Oil Corp. in August 2016. Hunter Oil Corp. was incorporated in 1980 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "HP.CN": {"short_name": "HelloPal Intl", "long_name": "Hello Pal International Inc.", "summary": "Hello Pal International Inc. develops, markets, and operates an international social networking platform. It offers HPI Platform, which enables users to find and interact with users from all over the world through chat messaging, livestreaming, and audio/video calling. The company's platform also offers a digital wallet that allows users to store and transfer digital assets and tokens, including Bitcoin and Ether based on blockchain technology. The company was formerly known as Neoteck Solutions Inc. and changed its name to Hello Pal International Inc. in May 2016. The company was incorporated in 1986 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "HSSHF": {"short_name": "DIGIHOST TECHNOLOGY INC", "long_name": "Digihost Technology Inc.", "summary": "Digihost Technology Inc. operates as a blockchain technology company. It has operations in cryptocurrency mining for its own account, as well as providing hosting services to cryptocurrency mining customers. The company was formerly known as HashChain Technology Inc. and changed its name to Digihost Technology Inc. in February 2020. Digihost Technology Inc. was incorporated in 2017 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "ID.V": {"short_name": "IDENTILLECT TECHNOLOGIES CORP", "long_name": "Identillect Technologies Corp.", "summary": "Identillect Technologies Corp. develops an email encryption software solution. The company offers Delivery Trust, an email encryption technology. It serves the accounting, education professional, financial, legal, medical, real estate, and resource industries. The company was founded in 2010 and is based in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "IJA2.F": {"short_name": "REVOLUGROUP CANADA INC", "long_name": "RevoluGROUP Canada Inc.", "summary": "RevoluGROUP Canada Inc., through its subsidiaries, provides technology solutions. Its solutions include RevoluPAY, the company's flagship Apple and Android multinational leisure payments and remittance app; RevoluVIP, a members only travel club; RevoluCHARGE, a pay-as-you go mobile phone top-up solution; RevolUTILITY, a utility bills payment solution; RevoluREALTY, solution for the payment of real estate related transactions, forex settlement, and closing fees to multiple beneficiaries; RevoluMED, a solution for healthcare appointment scheduling, RX payment, pharmacy payments, medical insurance, insurance copay, and other financial aspects related to the healthcare industry; RevoluFIN, which offers bridge loans and factoring to corporations; RevoluEGAME for online video gaming, and selection and payment of mobile/console-based games and in-game play; and RevoluESPORTS for eSports sector. The company also engages in the online travel agency and digital media marketing businesses that cover travel marketing, electronic reservations, and online booking solutions for international travelers. It deploys technology solutions in the online travel, vacation forex, money remittance, mobile payment apps, mobile phone top-up, utility bill payments, healthcare payments, e-gaming, e-sports, online credits and gifts cards, real estate payments, Blockchain security, invoice factoring, and personal and corporate leisure sectors. The company was formerly known as CUV Ventures Corp. and changed its name to RevoluGROUP Canada Inc. in November 2019. RevoluGROUP Canada Inc. is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "ILA.V": {"short_name": "ILOOKABOUT CORP", "long_name": "iLOOKABOUT Corp.", "summary": "iLOOKABOUT Corp., together with its subsidiaries, provides software and data licenses and technology managed services to the real estate industry in Canada and the United States. The company offers GeoViewPort, a web-based platform that enables assessment professionals to simultaneously generate customized portals to view multiple elements related to a property, including street level imagery, aerial imagery, advanced mapping tools, property valuation details, comparable property analysis, and structural characteristics. It also provides FusionOMSm, a web-based platform that enables real property valuation solutions to enterprises through US nationwide repository of public record and multiple listing service data; and Real Property Tax Analytics, a web-based platform that analyzes property assessments. In addition, the company offers data commercialization products and services through the delivery of reports and individual data requests to users through e-commerce transactions or by account, as well as customized reports through an assisted fulfillment process. Further, it provides valuation management and property tax solutions, which include assessment base management, analytics reports, tax policy planning and support, and appeals management. It primarily serves property lending and property tax sectors. iLOOKABOUT Corp. was founded in 2000 and is based in London, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "London"}, "IMS.F": {"short_name": "ISIGN MEDIA SOLUTIONS INC", "long_name": "iSIGN Media Solutions Inc.", "summary": "iSIGN Media Solutions Inc., a data-focused software-as-a-service company, provides location-based security alert messaging and proximity marketing solutions in North America. The company integrates with signage networks, kiosks, and point of sale devices to provide rich media content. It also offers Smart Antenna, a Bluetooth/Wi-Fi transceiver device that identifies mobile devices, such as phones and tablets, as well as to push messages to these devices when they are within 300ft. iSIGN Media Solutions Inc. was incorporated in 2007 and is headquartered in Richmond Hill, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Richmond Hill"}, "INX.V": {"short_name": "INTOUCH INSIGHT LTD", "long_name": "Intouch Insight Ltd.", "summary": "Intouch Insight Ltd. develops managed mobile software applications and software-as-a-service platforms, and delivers services for private businesses, governments, and regulators in Canada, the United States, and internationally. The company's software platforms include IntouchCapture, IntouchCheck, IntouchSurvey, and LiaCX that facilitate the development of data collection programs comprising event lead capture, customer satisfaction surveys, and mobile forms, checklist, and audits. It also develops customer experience management software for retailers, restaurants, and hotels; survey software; mobile forms automation software; and event marketing automation software, as well as offers data collection services, including mystery shopping, third party audit, and customer experience measurement programs.. The company was formerly known as In-Touch Survey Systems Ltd. and changed its name to Intouch Insight Ltd. in July 2016. Intouch Insight Ltd. was founded in 1992 and is based in Ottawa, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Ottawa"}, "INXSF": {"short_name": "INTOUCH INSIGHT LTD", "long_name": "Intouch Insight Ltd.", "summary": "Intouch Insight Ltd. develops managed mobile software applications and software-as-a-service platforms, and delivers services for private businesses, governments, and regulators in Canada, the United States, and internationally. The company's software platforms include IntouchCapture, IntouchCheck, IntouchSurvey, and LiaCX that facilitate the development of data collection programs comprising event lead capture, customer satisfaction surveys, and mobile forms, checklist, and audits. It also develops customer experience management software for retailers, restaurants, and hotels; survey software; mobile forms automation software; and event marketing automation software, as well as offers data collection services, including mystery shopping, third party audit, and customer experience measurement programs.. The company was formerly known as In-Touch Survey Systems Ltd. and changed its name to Intouch Insight Ltd. in July 2016. Intouch Insight Ltd. was founded in 1992 and is based in Ottawa, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Ottawa"}, "IPNFF": {"short_name": "IMAGINEAR INC", "long_name": "ImagineAR Inc.", "summary": "ImagineAR Inc. provides an augmented reality (AR) platform that enables businesses, sports teams, and organizations to create and implement their own AR campaigns with no programming or technology experience. The company's products include ImagineAR Augmented Reality Platform that allows the choice of engagement by marker, location, and Web-based activation; ImagineAR.com, an AR-as-a-service platform for desktops; ImagineAR mobile app; ImagineAR SDK/API; ImagineAR Cloud, a centralized content management system, where AR is securely stored and managed; and WebAR services. It serves the retail, sports/live events, advertising/promotion, and fundraising industries. The company was formerly known as Imagination Park Technologies Inc. and changed its name to ImagineAR Inc. in April 2020. ImagineAR Inc. was incorporated in 2011 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "IQ.V": {"short_name": "AIRIQ INC.", "long_name": "AirIQ Inc.", "summary": "AirIQ Inc. develops and operates a telematics asset management system using specialized software, digitized mapping, wireless communications, the internet, and the global positioning system in Canada. Its web-based platform provides fleet operators and vehicle owners with a suite of asset management solutions to monitor, manage, and protect their assets. The company offers its services through online or a mobile app, including instant vehicle locating, boundary notification, automated inventory reports, maintenance reminders, security alerts, and vehicle disabling and unauthorized movement alerts. AirIQ Inc. was founded in 1997 and is headquartered in Pickering, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Pickering"}, "ISD.V": {"short_name": "ISIGN MEDIA SOLUTIONS INC", "long_name": "iSIGN Media Solutions Inc.", "summary": "iSIGN Media Solutions Inc., a data-focused software-as-a-service company, provides location-based security alert messaging and proximity marketing solutions in North America. The company integrates with signage networks, kiosks, and point of sale devices to provide rich media content. It also offers Smart Antenna, a Bluetooth/Wi-Fi transceiver device that identifies mobile devices, such as phones and tablets, as well as to push messages to these devices when they are within 300ft. iSIGN Media Solutions Inc. was incorporated in 2007 and is headquartered in Richmond Hill, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Richmond Hill"}, "ISDSF": {"short_name": "ISIGN MEDIA SOLUTIONS INC", "long_name": "iSIGN Media Solutions Inc.", "summary": "iSIGN Media Solutions Inc., a data-focused software-as-a-service company, provides location-based security alert messaging and proximity marketing solutions in North America. The company integrates with signage networks, kiosks, and point of sale devices to provide rich media content. It also offers Smart Antenna, a Bluetooth/Wi-Fi transceiver device that identifies mobile devices, such as phones and tablets, as well as to push messages to these devices when they are within 300ft. iSIGN Media Solutions Inc. was incorporated in 2007 and is headquartered in Richmond Hill, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Richmond Hill"}, "IVI.V": {"short_name": "IVRNET INC.", "long_name": "Ivrnet Inc.", "summary": "Ivrnet Inc., a software and communications company, develops, hosts, sells, and supports value added business automation software solutions in North America. It offers automated interaction through phone network and the Internet. The company also provides Safepay, a payment card industry (PCI) compliant phone in credit card payments, and PCI compliant online payment solutions. In addition, the company provides IT services, Website, and software development services, as well as sells equipment; communication services, such as telephone, fax, toll, audio conference, and invoicing services; and business services comprising website, server, community management, and registration system hosting, as well as offers custom applications, such as golf booking, Safe Team, 311, merchandising, call monitoring, tracking, reporting, and outbound calling applications. Further, it also engages in the provision of software-related services, including training, installation, consulting, and maintenance. Ivrnet Inc. was incorporated in 1999 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "K10.F": {"short_name": "KATIPULT TECH.CORP.", "long_name": "Katipult Technology Corp.", "summary": "Katipult Technology Corp. operates as a financial technology company. The company offers a cloud-based software infrastructure that allows firms to design, set up, and operate an investment platform, which enables firms to offer debt and real-estate financing; and securities on a prospectus-exempt basis to various types of investors. The company's platform automates various components of investor and investment management, including components of financial transactions, investment marketing, and dividend payouts, as well as manages regulatory requirements in various geographic jurisdictions. It serves customers in North America, Europe, Asia, Africa, Oceania, and South America. Katipult Technology Corp.'s platform includes modules for various user types, including investors, issuers, administrators and auditors, and others. The company was formerly known as Deha Capital Corp. and changed its name to Katipult Technology Corp. in August 11 2017. Katipult Technology Corp. was founded in 2008 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Calgary"}, "KABN.CN": {"short_name": "KABNSysNA", "long_name": "KABN Systems NA Holdings Corp.", "summary": "KABN Systems NA Holdings Corp., through its subsidiary, KABN Systems North America Inc, focuses on the verification, management, and monetization of digital identity. The company develops and operates KABN ID, a blockchain and biometric based patent-pending digital identity validation and verification platform allowing users to prove their identity to the online community; Liquid Avatar that allows users to create digital icons representing their online personas; KABN Card, a Visa approved prepaid card program allowing users to manage digital and fiat currencies and earn cashback and other loyalty incentives ; and KABN KASH, a cashback, loyalty, and engagement program. The company is based in Markham, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Markham"}, "KTPPF": {"short_name": "KATIPULT TECHNOLOGY CORP", "long_name": "Katipult Technology Corp.", "summary": "Katipult Technology Corp. operates as a financial technology company. The company offers a cloud-based software infrastructure that allows firms to design, set up, and operate an investment platform, which enables firms to offer debt and real-estate financing; and securities on a prospectus-exempt basis to various types of investors. The company's platform automates various components of investor and investment management, including components of financial transactions, investment marketing, and dividend payouts, as well as manages regulatory requirements in various geographic jurisdictions. It serves customers in North America, Europe, Asia, Africa, Oceania, and South America. Katipult Technology Corp.'s platform includes modules for various user types, including investors, issuers, administrators and auditors, and others. The company was formerly known as Deha Capital Corp. and changed its name to Katipult Technology Corp. in August 11 2017. Katipult Technology Corp. was founded in 2008 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "KXS.TO": {"short_name": "KINAXIS INC", "long_name": "Kinaxis Inc.", "summary": "Kinaxis Inc. provides cloud-based subscription software for supply chain operations in the United States, Europe, Asia, and Canada. The company offers RapidResponse, which provide supply chain planning and analytics capabilities for managing various supply chain management processes, including demand planning, supply planning, inventory management, order fulfillment, capacity planning, and machine learning, as well as sales and operations planning process. It also provides professional services, such as implementation, configuration, technical, and training services, as well as maintenance and support services to its software products. The company serves various industries, including aerospace and defense, automotive, consumer products, high tech and electronics, industrial, life sciences, and pharmaceuticals. The company was formerly known as webPLAN Inc. and changed its name to Kinaxis Inc. in May 2005. Kinaxis Inc. was founded in 1984 and is headquartered in Ottawa, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Ottawa"}, "KXSCF": {"short_name": "KINAXIS INC", "long_name": "Kinaxis Inc.", "summary": "Kinaxis Inc. provides cloud-based subscription software for supply chain operations in the United States, Europe, Asia, and Canada. The company offers RapidResponse, which provide supply chain planning and analytics capabilities for managing various supply chain management processes, including demand planning, supply planning, inventory management, order fulfillment, capacity planning, and machine learning, as well as sales and operations planning process. It also provides professional services, such as implementation, configuration, technical, and training services, as well as maintenance and support services to its software products. The company serves various industries, including aerospace and defense, automotive, consumer products, high tech and electronics, industrial, life sciences, and pharmaceuticals. The company was formerly known as webPLAN Inc. and changed its name to Kinaxis Inc. in May 2005. Kinaxis Inc. was founded in 1984 and is headquartered in Ottawa, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Ottawa"}, "LE4A.F": {"short_name": "LEONOVUS INC. O.N.", "long_name": "Leonovus Inc.", "summary": "Leonovus Inc. provides cloud solutions software that optimizes enterprise data storage and management with its multi-cloud data controller solutions. The company's products include Data Discovery Tool, a software-based solution that characterizes the stored data; Smart Filer, a cloud information lifecycle management solution that analyzes existing file storage and extends its capacity; and Vault, a multi-cloud data controller that stores data securely across hybrid and multi-cloud environments. It offers storage management solutions with technologies that enable intelligent data management in various local, network, and cloud storage. The company is based in Ottawa, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Ottawa"}, "LGLOF": {"short_name": "LINK GLOBAL TECHNOLOGIES INC", "long_name": "Link Global Technologies Inc.", "summary": "Link Global Technologies Inc. provides infrastructure for cryptocurrency mining and data center technology. The company was formerly known as Link Blockchain Technologies Inc. and changed its name to Link Global Technologies Inc. in September 2018. Link Global Technologies Inc. was incorporated in 2018 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "LNK.CN": {"short_name": "LinkGlobalTech", "long_name": "Link Global Technologies Inc.", "summary": "Link Global Technologies Inc. provides infrastructure for cryptocurrency mining and data center technology. The company was formerly known as Link Blockchain Technologies Inc. and changed its name to Link Global Technologies Inc. in September 2018. Link Global Technologies Inc. was incorporated in 2018 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "LOOP.V": {"short_name": "LOOPSHARE LTD", "long_name": "LOOPShare Ltd.", "summary": "LOOPShare Ltd., an electric transportation company, develops and deploys connected end-to-end telematics-based solutions for inner-city transportation vehicles worldwide. It offers SVD400, a ruggedized touchscreen dashboard with telematics functionality for factory installation. The company is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "LPPPF": {"short_name": "LOOPSHARE LTD", "long_name": "LOOPShare Ltd.", "summary": "LOOPShare Ltd., an electric transportation company, develops and deploys connected end-to-end telematics-based solutions for inner-city transportation vehicles worldwide. It offers SVD400, a ruggedized touchscreen dashboard with telematics functionality for factory installation. The company is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "LSPD": {"short_name": "Lightspeed POS Inc. Subordinate", "long_name": "Lightspeed POS Inc.", "summary": "Lightspeed POS Inc. provides commerce enabling Software as a Service (SaaS) platform for small and midsize businesses, retailers, restaurants, and golf course operators. Its SaaS platform enables customers to engage with consumers, manage operations, accept payments, etc. The company's solutions cover front-end customer experience that include point of sale, omni-channel engagement, home delivery, and order and loyalty management, as well as management of discounts, price rules, and gift cards; back-end operations management comprising product and menu, inventory, bookings and membership, customer, employee, accounting, floor and table, workflow, reporting and analytics, and real-time dashboard; and integrated payment gateway solutions. It also sells a suite of third-party hardware products to complement its software solutions for the retail and hospitality segments, such as customer facing displays, stands, barcode scanners, receipt printers, cash drawers, payment terminals, and an assortment of other accessories. The company was formerly known as LightSpeed Retail Inc. and changed its name to Lightspeed POS Inc. in October 2014. Lightspeed POS Inc. was founded in 2005 and is headquartered in MontrÃ©al, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "NYQ", "market": "us_market", "country": "Canada", "city": "Montreal"}, "LSPD.TO": {"short_name": "LIGHTSPEED POS INC", "long_name": "Lightspeed POS Inc.", "summary": "Lightspeed POS Inc. provides commerce enabling Software as a Service (SaaS) platform for small and midsize businesses, retailers, restaurants, and golf course operators. Its SaaS platform enables customers to engage with consumers, manage operations, accept payments, etc. The company's solutions cover front-end customer experience that include point of sale, omni-channel engagement, home delivery, and order and loyalty management, as well as management of discounts, price rules, and gift cards; back-end operations management comprising product and menu, inventory, bookings and membership, customer, employee, accounting, floor and table, workflow, reporting and analytics, and real-time dashboard; and integrated payment gateway solutions. It also sells a suite of third-party hardware products to complement its software solutions for the retail and hospitality segments, such as customer facing displays, stands, barcode scanners, receipt printers, cash drawers, payment terminals, and an assortment of other accessories. The company was formerly known as LightSpeed Retail Inc. and changed its name to Lightspeed POS Inc. in October 2014. Lightspeed POS Inc. was founded in 2005 and is headquartered in MontrÃ©al, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Montreal"}, "LTV.V": {"short_name": "LEONOVUS INC", "long_name": "Leonovus Inc.", "summary": "Leonovus Inc. provides cloud solutions software that optimizes enterprise data storage and management with its multi-cloud data controller solutions. The company's products include Data Discovery Tool, a software-based solution that characterizes the stored data; Smart Filer, a cloud information lifecycle management solution that analyzes existing file storage and extends its capacity; and Vault, a multi-cloud data controller that stores data securely across hybrid and multi-cloud environments. It offers storage management solutions with technologies that enable intelligent data management in various local, network, and cloud storage. The company is based in Ottawa, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Ottawa"}, "LUXX.CN": {"short_name": "Luxxfolio", "long_name": "Luxxfolio Holdings Inc.", "summary": "Luxxfolio Holdings Inc., a financial technology company, engages in developing a blockchain enabled authentication platform to verify, insure, and protect luxury goods in Canada. The company offers Luxxfolio, a cloud-based platform that offers access to financial products and services, such as credit cards, lines of credit, loans, insurance, and mortgage for a house. Luxxfolio Holdings Inc. was incorporated in 2017 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "MBO.V": {"short_name": "MOBIO TECHNOLOGIES INC", "long_name": "Mobio Technologies Inc.", "summary": "Mobio Technologies Inc., together with its subsidiaries, operates social media platforms in Canada. The company operates Strutta, a social promotions platform that allows brands to run contests and sweepstakes across various social web channels. It also invests in start-up technology companies. The company was formerly known as LX Ventures Inc. and changed its name to Mobio Technologies Inc. in July 2014. Mobio Technologies Inc. was incorporated in 1998 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "MCLD.V": {"short_name": "MCLOUD TECHNOLOGIES CORP", "long_name": "mCloud Technologies Corp.", "summary": "mCloud Technologies Corp. provides asset management solutions combining IoT, cloud computing, artificial intelligence (AI), and analytics worldwide. Its AI-powered AssetCare platform offers asset management solutions, such as Connected Buildings, an AI and analytics solution to automate and remotely manage commercial buildings; Connected Workers, a cloud software to assist workers in the field to stay connected to experts remotely, facilitate repairs, and provide workers with an AI-powered digital assistant; Connected Energy for the inspection of wind turbine blades using AI-powered computer vision and the deployment of analytics to maximize wind farm energy production yield and availability; Connected Industry, to process assets and control endpoint monitoring, equipment health, and asset inventory management, as well as for the management of change across distributed teams; and Connected Health, a HIPAA-compliant remote health monitoring and connectivity solution. The company was formerly known as Universal mCloud Corp. and changed its name to mCloud Technologies Corp. in October 2019. mCloud Technologies Corp. is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "MCLDF": {"short_name": "MCLOUD TECHNOLOGIES CORPORATION", "long_name": "mCloud Technologies Corp.", "summary": "mCloud Technologies Corp. provides asset management solutions combining IoT, cloud computing, artificial intelligence (AI), and analytics worldwide. Its AI-powered AssetCare platform offers asset management solutions, such as Connected Buildings, an AI and analytics solution to automate and remotely manage commercial buildings; Connected Workers, a cloud software to assist workers in the field to stay connected to experts remotely, facilitate repairs, and provide workers with an AI-powered digital assistant; Connected Energy for the inspection of wind turbine blades using AI-powered computer vision and the deployment of analytics to maximize wind farm energy production yield and availability; Connected Industry, to process assets and control endpoint monitoring, equipment health, and asset inventory management, as well as for the management of change across distributed teams; and Connected Health, a HIPAA-compliant remote health monitoring and connectivity solution. The company was formerly known as Universal mCloud Corp. and changed its name to mCloud Technologies Corp. in October 2019. mCloud Technologies Corp. is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "MOGO": {"short_name": "Mogo Inc.", "long_name": "Mogo Inc.", "summary": "Mogo Inc. operates as a financial technology company in Canada. The company provides finance app that empowers consumers with solutions to help them get in control of their financial wellness. It offers users a free MogoAccount and provides access to various products, including free credit score monitoring, identity fraud protection, digital spending account with Platinum Prepaid Visa Card, digital mortgage experience, the MogoCrypto account, a product within MogoWealth that enables the buying and selling of bitcoin, and access to smart consumer credit products through. The company's platform delivers digital experience with various products all through one account. Mogo Inc. was founded in 2003 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "NMS", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "MOGO.TO": {"short_name": "MOGO INC", "long_name": "Mogo Inc.", "summary": "Mogo Inc. operates as a financial technology company in Canada. The company provides finance app that empowers consumers with solutions to help them get in control of their financial wellness. It offers users a free MogoAccount and provides access to various products, including free credit score monitoring, identity fraud protection, digital spending account with Platinum Prepaid Visa Card, digital mortgage experience, the MogoCrypto account, a product within MogoWealth that enables the buying and selling of bitcoin, and access to smart consumer credit products through. The company's platform delivers digital experience with various products all through one account. Mogo Inc. was founded in 2003 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "MTRX.V": {"short_name": "LOOP INSIGHTS INC", "long_name": "Loop Insights Inc.", "summary": "Loop Insights Inc., a technology company, engages in the development of automated artificial intelligence marketing platform for bricks and mortar retailers. The company offers various brands and retailers with the solutions to interconnect their physical and digital ecosystems by using the Loop device that helps in plugging into various point of sale environments that are independent of hardware or IT networks. It also provides Fobi, an automated plug and play system that seamlessly integrates with existing infrastructure to personalize consumer's physical and digital journeys; and predictive analytics and insights. Loop Insights Inc. is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "MUU3.F": {"short_name": "FOGCHAIN CORP.", "long_name": "FogChain Corp.", "summary": "FogChain Corp. provides an end-to-end software development life cycle and quality assurance solutions in Canada. It offers RadJav, a software development platform and decentralized datacenter; Test Case Manager, a patented automated testing product that allows organizations to accomplish substantial cost savings and improved time to market by automating their test cases; AppMark, a synthetic monitoring service that allows organizations to monitor performance of their applications; and Trident, a cross-platform application that provides developers with a suite of tools to build, test, and monitor applications. The company is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "MV8Q.F": {"short_name": "MOBIO TECHS INC.", "long_name": "Mobio Technologies Inc.", "summary": "Mobio Technologies Inc., together with its subsidiaries, operates social media platforms in Canada. The company operates Strutta, a social promotions platform that allows brands to run contests and sweepstakes across various social web channels. It also invests in start-up technology companies. The company was formerly known as LX Ventures Inc. and changed its name to Mobio Technologies Inc. in July 2014. Mobio Technologies Inc. was incorporated in 1998 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "MVAI.V": {"short_name": "MINERVA INTELLIGENCE INC", "long_name": "Minerva Intelligence Inc.", "summary": "Minerva Intelligence Inc. engages in developing and marketing artificial intelligent (AI) software products. Its AI platform system combines human expertise with various information from public and private databases to streamline primarily mineral discovery. The company's principal products include Target that identifies mineral exploration targets in exploration data sets, which are vast and complex for humans to evaluate; and GAIA, which identifies and evaluates landslide and floods hazards. Its principal products also comprise ACE builds taxonomies in applications; and LEO, a system for management of digital knowledge, including preloaded geoscience taxonomies, customizable automatic tagging system, and front-end search function that allows users to interrogate their document repository. In addition, the company engages in developing INSPIRE mapping data for use in the environmental protection and land-use planning. Minerva Intelligence Inc. is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "MVP.V": {"short_name": "MEDIAVALET INC", "long_name": "MediaValet Inc.", "summary": "MediaValet Inc. provides enterprise cloud-based digital asset management (DAM) software worldwide. It offers Creative Spaces, a hybrid desktop application to accelerate the local production of rich media and other creative assets while keeping everything in sync with software-as-a-service based DAM. The company also designs mobile applications for iOS and Android devices; and offers content publishing and analytics services. It serves healthcare, higher education, manufacturing, non-profit organization, real estate and construction, retail and e-commerce, and technology industries, as well as various agencies and governments. The company was formerly known as VRX Worldwide Inc. and changed its name to MediaValet Inc. in October 2014. MediaValet Inc. was incorporated in 1993 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "MVVYF": {"short_name": "MOOVLY MEDIA INC", "long_name": "Moovly Media Inc.", "summary": "Moovly Media Inc. develops cloud-based digital media and content creation platform in Canada and Belgium. It serves consumers, students, educational institutions, start-ups, small and medium enterprises, brands, and large blue chip multinational corporations. The company was incorporated in 2006 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "MVY.V": {"short_name": "MOOVLY MEDIA INC", "long_name": "Moovly Media Inc.", "summary": "Moovly Media Inc. develops cloud-based digital media and content creation platform in Canada and Belgium. It serves consumers, students, educational institutions, start-ups, small and medium enterprises, brands, and large blue chip multinational corporations. The company was incorporated in 2006 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "MYID.V": {"short_name": "KILLI LTD", "long_name": "Killi Ltd.", "summary": "Killi Ltd., together with its subsidiaries, provides media measurement and identity solutions in the United States and internationally. It offers Freckle, a tool that allows advertisers and brands to measure the effectiveness of the media in driving consumers to the desired location, as well as provides audience data for targeting in platforms. The company also provides Killi, a consumer-facing mobile application, which enables consumers to control their identity by selecting which pieces of personal information they would like to share with brands in exchange for money. In addition, it offers target segment, first-party data, and footfall reporting solutions. The company was formerly known as Freckle Ltd. and changed its name to Killi Ltd. in May 2020. Killi Ltd. is based in Toronto, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "MYIDF": {"short_name": "KILLI LTD", "long_name": "Killi Ltd.", "summary": "Killi Ltd., together with its subsidiaries, provides media measurement and identity solutions in the United States and internationally. It offers Freckle, a tool that allows advertisers and brands to measure the effectiveness of the media in driving consumers to the desired location, as well as provides audience data for targeting in platforms. The company also provides Killi, a consumer-facing mobile application, which enables consumers to control their identity by selecting which pieces of personal information they would like to share with brands in exchange for money. In addition, it offers target segment, first-party data, and footfall reporting solutions. The company was formerly known as Freckle Ltd. and changed its name to Killi Ltd. in May 2020. Killi Ltd. is based in Toronto, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "NCI.V": {"short_name": "NTG Clarity Networks Inc.", "long_name": "NTG Clarity Networks Inc.", "summary": "NTG Clarity Networks Inc. provides telecommunications engineering, information technology, networking, and related software solutions in Canada and Egypt. Its products include StageEM, an enterprise solution that covers project portfolio management, demand and capacity, analytic and dashboard, and decision-making using real-time data; Workflow Management solution, which enables organizations to design, deploy, execute, monitor, and analyze their business processes; Network Inventory Management solution that covers networks, services, and resources for organizations; and Partner Relationship Management solution, which covers the value chain of partnerships and enables vendors to manage their strategic partners. The company's products also include NTS Asset Management solution that tracks life-cycle of an inventory from acquisition to delivery to retirement; NTS Trouble Ticket Management, a module that manages customer and network trouble tickets and allows users to create their own type of trouble tickets; NTS Utility Billing solution, which manages utility billing needs; Mi-World, an m-Commerce application for mobile shopping; and Telco In A Box solution, a pre-integrated CRM, order management, fulfillment, and billing solution. In addition, the company offers VoWiFi, an app that enables voice in WiFi for smartphones and androids; as well as PROXBOX, an IoT solution that automates the update of inventory, manufacturing, and asset management over 3G cellular, WiFi, and Ethernet. Further, the company provides solution development, system integration, testing as a service, outsourcing, consulting, training, and smart cities/building services, as well as digital transformation and data migration services. The company was founded in 1992 and is based in Markham, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Markham"}, "NPA.V": {"short_name": "ALPHINAT INC.", "long_name": "Alphinat Inc.", "summary": "Alphinat Inc. develops and markets software products that allow the implementation of self-service solutions and Web based workspace. The company offers smart digital government solutions; revenue-generating solutions for telcos; Bolt-on Amanda portal; dynamics customer portal; single sign-on and secure identity management; and low-code development platform. It also provides guided searches; and Lotus Notes migration applications. The company serves the public sector, as well as telecommunications, healthcare, and financial institutions in Canada, France, the United States, and internationally. Alphinat Inc. was incorporated in 2004 and is headquartered in Montreal, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Montreal"}, "NXJ.TO": {"short_name": "NEXJ SYSTEMS INC", "long_name": "NexJ Systems Inc.", "summary": "NexJ Systems Inc. develops intelligent customer management solutions for the financial services industry in the United States, Canada, the Asia Pacific, Europe, the Middle East, and Africa. The company offers artificial intelligence, relationship, process, and data management services, as well as customer support and maintenance services. Its product is NexJ Nudge-AI, a suite of digital assistants for wealth management advisors and relationship managers. The company offers its solutions for wealth management, private banking, commercial and corporate banking, and insurance industries, as well as for sales, trading, and research. NexJ Systems Inc. was incorporated in 2001 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "NYWKF": {"short_name": "NTG CLARITY NETWORKS INC", "long_name": "NTG Clarity Networks Inc.", "summary": "NTG Clarity Networks Inc. provides telecommunications engineering, information technology, networking, and related software solutions in Canada and Egypt. Its products include StageEM, an enterprise solution that covers project portfolio management, demand and capacity, analytic and dashboard, and decision-making using real-time data; Workflow Management solution, which enables organizations to design, deploy, execute, monitor, and analyze their business processes; Network Inventory Management solution that covers networks, services, and resources for organizations; and Partner Relationship Management solution, which covers the value chain of partnerships and enables vendors to manage their strategic partners. The company's products also include NTS Asset Management solution that tracks life-cycle of an inventory from acquisition to delivery to retirement; NTS Trouble Ticket Management, a module that manages customer and network trouble tickets and allows users to create their own type of trouble tickets; NTS Utility Billing solution, which manages utility billing needs; Mi-World, an m-Commerce application for mobile shopping; and Telco In A Box solution, a pre-integrated CRM, order management, fulfillment, and billing solution. In addition, the company offers VoWiFi, an app that enables voice in WiFi for smartphones and androids; as well as PROXBOX, an IoT solution that automates the update of inventory, manufacturing, and asset management over 3G cellular, WiFi, and Ethernet. Further, the company provides solution development, system integration, testing as a service, outsourcing, consulting, training, and smart cities/building services, as well as digital transformation and data migration services. The company was founded in 1992 and is based in Markham, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Markham"}, "OEE.V": {"short_name": "MEMEX INC", "long_name": "Memex Inc.", "summary": "Memex Inc. develops, commercializes, and manufactures a suite of products for its customers in the discrete manufacturing and aerospace sectors worldwide. The company primarily offers MERLIN Tempus, a software-driven industrial Internet of Things communications platform that provides manufacturing productivity metrics, including overall equipment effectiveness in real time. Its MERLIN Tempus measures and analyzes manufacturing and production performance, and provides its users with real-time insights on operational efficiency. The company also provides MERLIN Tempus Enterprise Edition for enhancing the value of time with enterprise resource planning connectivity and job scheduling; MERLIN financial Overall Equipment Effectiveness (FOEE), which enables factory organizations to link their shop floor performance to actual profit dollars; MERLIN Continuous Improvement (CI) Fast-track services, a nine-step implementation process; and MERLIN Operator Portal, a Windows based human machine interface (HMI) that provides operators with a live window into what information is being collected from the machines in real-time. In addition, the company provides MERLIN Enterprise Resource Planning connector, a bi-synchronous interface; MERLIN OPTime to assess, measure, identify, and optimize data-driven manufacturing; and SCANGun, a bar code scanner. Further, it offers IIoT hardware solutions, including MERLIN MTC-One that incorporate sensor-based process-driven data; MTConnect hardware adapter, which enables machine tool to communicate critical operational information using the MTConnect standard protocol; software adapters; and DNC memory upgrade products. The company was formerly known as Astrix Networks Inc. and changed its name to Memex Inc. in July 2015. Memex Inc. was founded in 1992 and is headquartered in Burlington, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Burlington"}, "OONEF": {"short_name": "01 COMMUNIQUE LABORATORY", "long_name": "01 Communique Laboratory Inc.", "summary": "01 Communique Laboratory Inc. provides cyber security and remote access solutions in the United States, Japan, and Canada. It offers I'm InTouch is a remote desktop connection software that allows users to control distant computer through the Internet; I'm OnCall, a secure online help desk software which allows organizations to offer remote support over the Internet to their customers; and I'm InTouch Meeting, a secure web-based collaboration system allowing users to host online meetings and web conferencing by sharing the computer screen of the moderator among all the attendees. The company also provides IronCAP X, a digital signature email system; and IronCAZ API to build post-quantum systems for blockchain, 5G/IoT, data storage, remote access/VPN, encryption, digital signing etc. using the standard PKCS#11 and OpenPGP formats. 01 Communique Laboratory Inc. was founded in 1992 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "OSS.V": {"short_name": "ONESOFT SOLUTIONS INC", "long_name": "OneSoft Solutions Inc.", "summary": "OneSoft Solutions Inc., through its subsidiaries, provides software solutions to the oil and gas pipeline industry in Canada and the United States. It offers Cognitive Integrity Management, a software-as-a-service application that uses the Microsoft Azure Cloud Platform and services, which includes machine learning, predictive analytics, business intelligence reporting, and other data science components to assist pipeline companies to prevent pipeline failures. The company was formerly known as Serenic Corporation and changed its name to OneSoft Solutions Inc. in July 2014. OneSoft Solutions Inc. is headquartered in Edmonton, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Edmonton"}, "OSSIF": {"short_name": "ONESOFT SOLUTIONS INC", "long_name": "OneSoft Solutions Inc.", "summary": "OneSoft Solutions Inc., through its subsidiaries, provides software solutions to the oil and gas pipeline industry in Canada and the United States. It offers Cognitive Integrity Management, a software-as-a-service application that uses the Microsoft Azure Cloud Platform and services, which includes machine learning, predictive analytics, business intelligence reporting, and other data science components to assist pipeline companies to prevent pipeline failures. The company was formerly known as Serenic Corporation and changed its name to OneSoft Solutions Inc. in July 2014. OneSoft Solutions Inc. is headquartered in Edmonton, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Edmonton"}, "OTEX": {"short_name": "Open Text Corporation", "long_name": "Open Text Corporation", "summary": "Open Text Corporation provides a suite of software products and services. The company offers content services; business network that manages and connects data within the organization; Cyber Resilience, a solution for defending against cyber threats and preparing for business continuity and response in the event of a breach; OpenText security solutions that addresses information security and digital investigations; AI and analytics that leverages structured or unstructured data; and OpenText Information Management software platform that provides multi-level, multi-role, and multi context security information platforms. It also offers digital process automation, which enables organizations to transform into digital data-driven businesses through automation; Customer Experience Management, a set of processes used to track customer interactions throughout the customer journey; and Discovery suite that provides forensics and unstructured data analytics for searching, collecting, and investigating enterprise data to manage legal obligations and risk. In addition, the company offers customer support programs that include access to software upgrades, a knowledge base, discussions, product information, and an online mechanism to post and review trouble tickets. Further, it provides professional services, such as consulting and learning services relating to the implementation, training, and integration of its licensed product offerings, as well as cloud services. The company serves organizations, enterprise companies, mid-market companies, and public sector agencies worldwide. It has strategic partnerships with SAP SE, Microsoft Corporation, Oracle Corporation, Salesforce.com Corporation, Google Cloud, Amazon AWS, Accenture plc, Deloitte Consulting LLP, Tata Consultancy Services, ATOS, ATOS International S.A.S., Capgemini Technology Services SAS, and Cognizant Technology Solutions U.S. Corp. The company was founded in 1991 and is headquartered in Waterloo, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "NMS", "market": "us_market", "country": "Canada", "city": "Waterloo"}, "OTEX.TO": {"short_name": "OPEN TEXT CORPORATION", "long_name": "Open Text Corporation", "summary": "Open Text Corporation provides a suite of software products and services. The company offers content services; business network that manages and connects data within the organization; Cyber Resilience, a solution for defending against cyber threats and preparing for business continuity and response in the event of a breach; OpenText security solutions that addresses information security and digital investigations; AI and analytics that leverages structured or unstructured data; and OpenText Information Management software platform that provides multi-level, multi-role, and multi context security information platforms. It also offers digital process automation, which enables organizations to transform into digital data-driven businesses through automation; Customer Experience Management, a set of processes used to track customer interactions throughout the customer journey; and Discovery suite that provides forensics and unstructured data analytics for searching, collecting, and investigating enterprise data to manage legal obligations and risk. In addition, the company offers customer support programs that include access to software upgrades, a knowledge base, discussions, product information, and an online mechanism to post and review trouble tickets. Further, it provides professional services, such as consulting and learning services relating to the implementation, training, and integration of its licensed product offerings, as well as cloud services. The company serves organizations, enterprise companies, mid-market companies, and public sector agencies worldwide. It has strategic partnerships with SAP SE, Microsoft Corporation, Oracle Corporation, Salesforce.com Corporation, Google Cloud, Amazon AWS, Accenture plc, Deloitte Consulting LLP, Tata Consultancy Services, ATOS, ATOS International S.A.S., Capgemini Technology Services SAS, and Cognizant Technology Solutions U.S. Corp. The company was founded in 1991 and is headquartered in Waterloo, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Waterloo"}, "OTX.F": {"short_name": "OPEN TEXT CORP.", "long_name": "Open Text Corporation", "summary": "Open Text Corporation provides a suite of software products and services. The company offers content services; business network that manages and connects data within the organization; Cyber Resilience, a solution for defending against cyber threats and preparing for business continuity and response in the event of a breach; OpenText security solutions that addresses information security and digital investigations; AI and analytics that leverages structured or unstructured data; and OpenText Information Management software platform that provides multi-level, multi-role, and multi context security information platforms. It also offers digital process automation, which enables organizations to transform into digital data-driven businesses through automation; Customer Experience Management, a set of processes used to track customer interactions throughout the customer journey; and Discovery suite that provides forensics and unstructured data analytics for searching, collecting, and investigating enterprise data to manage legal obligations and risk. In addition, the company offers customer support programs that include access to software upgrades, a knowledge base, discussions, product information, and an online mechanism to post and review trouble tickets. Further, it provides professional services, such as consulting and learning services relating to the implementation, training, and integration of its licensed product offerings, as well as cloud services. The company serves organizations, enterprise companies, mid-market companies, and public sector agencies worldwide. It has strategic partnerships with SAP SE, Microsoft Corporation, Oracle Corporation, Salesforce.com Corporation, Google Cloud, Amazon AWS, Accenture plc, Deloitte Consulting LLP, Tata Consultancy Services, ATOS, ATOS International S.A.S., Capgemini Technology Services SAS, and Cognizant Technology Solutions U.S. Corp. The company was founded in 1991 and is headquartered in Waterloo, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Waterloo"}, "PBX.V": {"short_name": "POWERBAND SOLUTIONS INC", "long_name": "PowerBand Solutions Inc.", "summary": "PowerBand Solutions Inc., a technology company, develops, markets, and sells online auction software and financing solutions for the automotive and other industries in Canada. The company also provides a suite of cloud-based auction and finance portal software tools, including LiveNet Auction, a portal that allows dealers to create an instant, online auction that launches a used vehicle to a network of used vehicle buyers; and Marketplace Auction, which allows dealers, dealer groups, rental, and leasing companies to load a used vehicle onto the site with a description of the vehicle, photos, condition reports, and a pre-set reserve bid. In addition, it offers Dynamic Appraisal, an electronic used vehicle appraisal system; Market Intelligence that offers automotive dealerships with retail market price valuations; PowerDesk, a desking tool that helps a dealer to prepare payment scenarios; and a finance portal. PowerBand Solutions Inc. is headquartered in Burlington, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Burlington"}, "PFM.V": {"short_name": "PRONTOFORMS CORPORATION", "long_name": "ProntoForms Corporation", "summary": "ProntoForms Corporation researches, develops, and markets mobile business solutions to automate field sales, field service, and other field data collection business processes. Its ProntoForms mobile platform enables remote workers to collect data on a mobile device; access company data in the field; and automatically share the results with back-office systems, cloud services, and people, as well as companies to track, analyze, and enhance processes. The company also provides solutions for inspection and audit, and installation and maintenance, as well as for field service, safety, fleet, and enterprise asset management. It operates in the United States, Canada, Latin America, Europe, and internationally. The company was formerly known as TrueContext Mobile Solutions Corporation and changed its name to ProntoForms Corporation in June 2013. ProntoForms Corporation was founded in 2001 and is based in Kanata, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Kanata"}, "PKG.CN": {"short_name": "ParcelPalTech", "long_name": "ParcelPal Technology Inc.", "summary": "ParcelPal Technology Inc. provides on-demand local delivery services in Canada. The Company offers ParcelPal, a streamlined mobile application for retail, restaurants, and liquor stores that enable consumers to shop at local merchants. It also provides online ecommerce integrations, an iOS application, open web portal for B2B shipments, and various API integration capabilities. The company was formerly known as Plus8 Global Ventures, Ltd. ParcelPal Technology Inc. was incorporated in 1997 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "PROS-H.V": {"short_name": "PROSMART ENTERPRISES INC", "long_name": "ProSmart Enterprises Inc.", "summary": "ProSmart Enterprises Inc. invests in the sports technology sector. The company was formerly known as Sora Capital Corp. and changed its name to ProSmart Enterprises Inc. in July 2017. The company was incorporated in 1999 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "PT0.F": {"short_name": "PARCELPAL TECHN.INC. O.N.", "long_name": "ParcelPal Technology Inc.", "summary": "ParcelPal Technology Inc. provides on-demand local delivery services in Canada. The Company offers ParcelPal, a streamlined mobile application for retail, restaurants, and liquor stores that enable consumers to shop at local merchants. It also provides online ecommerce integrations, an iOS application, open web portal for B2B shipments, and various API integration capabilities. The company was formerly known as Plus8 Global Ventures, Ltd. ParcelPal Technology Inc. was incorporated in 1997 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "PTNYF": {"short_name": "PARCELPAL TECHNOLOGY INC", "long_name": "ParcelPal Technology Inc.", "summary": "ParcelPal Technology Inc. provides on-demand local delivery services in Canada. The Company offers ParcelPal, a streamlined mobile application for retail, restaurants, and liquor stores that enable consumers to shop at local merchants. It also provides online ecommerce integrations, an iOS application, open web portal for B2B shipments, and various API integration capabilities. The company was formerly known as Plus8 Global Ventures, Ltd. ParcelPal Technology Inc. was incorporated in 1997 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "PTOTF": {"short_name": "PATRIOT ONE TECHNOLOGIES INC", "long_name": "Patriot One Technologies Inc.", "summary": "Patriot One Technologies Inc. engages in the research, development, and commercialization of threat detection solutions worldwide. It operates through Patriot Threat Detection and Xtract segments. The Patriot Threat Detection segment develops and commercializes a platform of multisensor threat detection technologies. The Xtract segment develops and commercializes artificial intelligence solutions. The company's products include PATSCAN VRS Video Recognition Software that combines digital cameras and artificial intelligence to automate the detection of visible weapon threats, fights and even health and safety issues; and PATSCAN MSG, an autonomous detection system that detects threats on individuals carrying concealed guns, knives or related threat objects into secured private or public spaces, and can be installed at schools, stadiums, concert halls, shopping centers and other entryways into private, public or secured buildings. It also develops PATSCAN CMR, a cognitive microwave radar concealed weapons detection system, which is used in trains, clubs, schools, stadiums, banks, airports, prisons, shopping malls and offices; and PATSCAN STS, a technology for the detection of explosives and other threats, such as chemical and biological agents, as well as illicit narcotics. The company was formerly known as Clear Mountain Resources Corp. and changed its name to Patriot One Technologies Inc. Patriot One Technologies Inc. was incorporated in 2010 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "PUSH.CN": {"short_name": "PushforInvInc", "long_name": "Pushfor Investments Inc.", "summary": "Pushfor Investments Inc. engages in the investment and software development activities in Canada, the United Kingdom, and the United States. The company's Investment segment invests in public and private companies operating in the technology, natural resource, and various other sectors. Its Software Development segment operates a content-sharing platform that allows clients to communicate and share information to various devices for business use. The company was formerly known as JG Wealth Inc. and changed its name to Pushfor Investments Inc. in October 2018. Pushfor Investments Inc. was incorporated in 2007 and is headquartered in Delta, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Delta"}, "PWWBF": {"short_name": "POWERBAND SOLUTIONS INC", "long_name": "PowerBand Solutions Inc.", "summary": "PowerBand Solutions Inc., a technology company, develops, markets, and sells online auction software and financing solutions for the automotive and other industries in Canada. The company also provides a suite of cloud-based auction and finance portal software tools, including LiveNet Auction, a portal that allows dealers to create an instant, online auction that launches a used vehicle to a network of used vehicle buyers; and Marketplace Auction, which allows dealers, dealer groups, rental, and leasing companies to load a used vehicle onto the site with a description of the vehicle, photos, condition reports, and a pre-set reserve bid. In addition, it offers Dynamic Appraisal, an electronic used vehicle appraisal system; Market Intelligence that offers automotive dealerships with retail market price valuations; PowerDesk, a desking tool that helps a dealer to prepare payment scenarios; and a finance portal. PowerBand Solutions Inc. is headquartered in Burlington, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Burlington"}, "PXPP": {"short_name": "PHOENIX APPS INC", "long_name": "Phoenix Apps Inc.", "summary": "Phoenix Apps Inc. develops Android and Apple mobile applications. The company was incorporated in 2015 and is based in Toronto, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "QIS.V": {"short_name": "Quorum Information Technologies", "long_name": "Quorum Information Technologies Inc.", "summary": "Quorum Information Technologies Inc., an information technology company, focuses on the automotive retail business in Canada and the United States. The company develops, markets, implements, and supports XSellerator, a dealership management system that automates, integrates, and streamlines key processes across departments in a dealership; and DealerMine CRM, a sales and service customer relationship management system, as well as a set of business development center services. It also offers Autovance, a sales desking system that enhances sales department gross margins and improves customer satisfaction for dealerships; and Advantage, a showroom system for franchised and independent dealerships and an operating system that includes accounting for the independent markets. Quorum Information Technologies Inc. was founded in 1996 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "R3E.F": {"short_name": "REAL MATTERS INC  O.N.", "long_name": "Real Matters Inc.", "summary": "Real Matters Inc. provides technology and network management solutions to mortgage lending and insurance industries in Canada and the United States. It offers residential mortgage appraisals for purchase, refinance, and home equity transactions under the Solidifi brand to the mortgage lending industry; and insurance inspection services to property and casualty insurers under the iv3 brand. The company also provides residential and commercial real estate title and closing services for refinance, purchase, commercial, short sale, and real estate owned transactions to financial institutions under solidifi brand; and offers services required to close a mortgage transaction, including title search, closing and escrow services, and title policy issuance, as well as other title and closing service offerings, such as capital markets services. In addition, it provides access to its software platforms to other title insurance agencies and mortgage lenders for a subscription fee. The company was formerly known as Solidifi Inc. and changed its name to Real Matters Inc. in July 2010. Real Matters Inc. was founded in 2004 and is headquartered in Markham, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Markham"}, "RACMF": {"short_name": "LOOP INSIGHTS INC", "long_name": "Loop Insights Inc.", "summary": "Loop Insights Inc., a technology company, engages in the development of automated artificial intelligence marketing platform for bricks and mortar retailers. The company offers various brands and retailers with the solutions to interconnect their physical and digital ecosystems by using the Loop device that helps in plugging into various point of sale environments that are independent of hardware or IT networks. It also provides Fobi, an automated plug and play system that seamlessly integrates with existing infrastructure to personalize consumer's physical and digital journeys; and predictive analytics and insights. Loop Insights Inc. is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "REAL.TO": {"short_name": "REAL MATTERS INC", "long_name": "Real Matters Inc.", "summary": "Real Matters Inc. provides technology and network management solutions to mortgage lending and insurance industries in Canada and the United States. It offers residential mortgage appraisals for purchase, refinance, and home equity transactions under the Solidifi brand to the mortgage lending industry; and insurance inspection services to property and casualty insurers under the iv3 brand. The company also provides residential and commercial real estate title and closing services for refinance, purchase, commercial, short sale, and real estate owned transactions to financial institutions under solidifi brand; and offers services required to close a mortgage transaction, including title search, closing and escrow services, and title policy issuance, as well as other title and closing service offerings, such as capital markets services. In addition, it provides access to its software platforms to other title insurance agencies and mortgage lenders for a subscription fee. The company was formerly known as Solidifi Inc. and changed its name to Real Matters Inc. in July 2010. Real Matters Inc. was founded in 2004 and is headquartered in Markham, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Markham"}, "RIWI.V": {"short_name": "RIWI CORP", "long_name": "RIWI Corp.", "summary": "RIWI Corp. operates as a trend-tracking and prediction technology firm in the United States, Canada, Europe, and internationally. Its patented cloud-based and machine-learning software solution provides global digital intelligence platform to clients seeking real-time citizen sentiment data. The company offers real-time applied analytics, forecasts, advance warnings, digital surveys, ad tests, trend-monitoring, predictive analytics, risk monitoring, and message testing services. RIWI Corporation was incorporated in 2009 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "RLLMF": {"short_name": "REAL MATTERS INC", "long_name": "Real Matters Inc.", "summary": "Real Matters Inc. provides technology and network management solutions to mortgage lending and insurance industries in Canada and the United States. It offers residential mortgage appraisals for purchase, refinance, and home equity transactions under the Solidifi brand to the mortgage lending industry; and insurance inspection services to property and casualty insurers under the iv3 brand. The company also provides residential and commercial real estate title and closing services for refinance, purchase, commercial, short sale, and real estate owned transactions to financial institutions under solidifi brand; and offers services required to close a mortgage transaction, including title search, closing and escrow services, and title policy issuance, as well as other title and closing service offerings, such as capital markets services. In addition, it provides access to its software platforms to other title insurance agencies and mortgage lenders for a subscription fee. The company was formerly known as Solidifi Inc. and changed its name to Real Matters Inc. in July 2010. Real Matters Inc. was founded in 2004 and is headquartered in Markham, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Markham"}, "ROI.V": {"short_name": "ROUTE1 INC.", "long_name": "Route1 Inc.", "summary": "Route1 Inc. provides industrial-grade data intelligence, user authentication, and ultra-secure mobile workforce solutions to the government, military, and private sectors in the United States and Canada. The company offers MobiKEY, a desktop secure remote access solution; MobiENCRYPT; DerivID, a credentials solution for PIV and CAC that validates the identity of mobile users; and MobiNET and DEFIMNET, which are universal identity management and service delivery platforms. It also provides ActionPLAN that captures and interprets the data in the form of actionable work orders to deliver real time and quantitative industrial process data and analytics to help pinpoint the exact sources of unplanned downtime; ScreenSTOP, an intelligent in-motion screen masking solution to reduce operator distraction during the operation of heavy lift vehicles; and AutoVu, an automatic license plate recognition system to locate vehicles of interest and enforce parking restrictions. In addition, the company offers rugged devices, such as laptops and notebooks, tablets, handhelds and scanners, printers, vehicle docking stations and mounts, WiFi networks, mobile wireless, computing, printing and scanning accessories, mobile antennas and wireless accessories, mobile video and video accessories, and mobile computers. It serves utilities, telecommunications, field services, insurance, healthcare, manufacturing, and logistics industries, as well as police and public safety, and state and local government. Route1 Inc. was founded in 2004 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "ROIUF": {"short_name": "ROUTE1 INC", "long_name": "Route1 Inc.", "summary": "Route1 Inc. provides industrial-grade data intelligence, user authentication, and ultra-secure mobile workforce solutions to the government, military, and private sectors in the United States and Canada. The company offers MobiKEY, a desktop secure remote access solution; MobiENCRYPT; DerivID, a credentials solution for PIV and CAC that validates the identity of mobile users; and MobiNET and DEFIMNET, which are universal identity management and service delivery platforms. It also provides ActionPLAN that captures and interprets the data in the form of actionable work orders to deliver real time and quantitative industrial process data and analytics to help pinpoint the exact sources of unplanned downtime; ScreenSTOP, an intelligent in-motion screen masking solution to reduce operator distraction during the operation of heavy lift vehicles; and AutoVu, an automatic license plate recognition system to locate vehicles of interest and enforce parking restrictions. In addition, the company offers rugged devices, such as laptops and notebooks, tablets, handhelds and scanners, printers, vehicle docking stations and mounts, WiFi networks, mobile wireless, computing, printing and scanning accessories, mobile antennas and wireless accessories, mobile video and video accessories, and mobile computers. It serves utilities, telecommunications, field services, insurance, healthcare, manufacturing, and logistics industries, as well as police and public safety, and state and local government. Route1 Inc. was founded in 2004 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "RSASF": {"short_name": "RESAAS SERVICES INC", "long_name": "RESAAS Services Inc.", "summary": "RESAAS Services Inc. develops a cloud-based technology platform for the real estate industry. The company offers a suite of tools, which integrate with the platform, including a global referral network, lead generation engine, listing management, client engagement modules, customer relationship management tools, analytics, file sharing, payment system, and advertising engine. It serves multiple listing services (MLSs), franchises, and real estate brokerage and real estate agents in the real estate industry. RESAAS Services Inc. was incorporated in 2009 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "RSS.V": {"short_name": "RESAAS SERVICES INC", "long_name": "RESAAS Services Inc.", "summary": "RESAAS Services Inc. develops a cloud-based technology platform for the real estate industry. The company offers a suite of tools, which integrate with the platform, including a global referral network, lead generation engine, listing management, client engagement modules, customer relationship management tools, analytics, file sharing, payment system, and advertising engine. It serves multiple listing services (MLSs), franchises, and real estate brokerage and real estate agents in the real estate industry. RESAAS Services Inc. was incorporated in 2009 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "RSY-H.V": {"short_name": "RSI INTERNATIONAL SYSTEMS INC", "long_name": "RSI International Systems Inc.", "summary": "RSI International Systems Inc. does not have significant operations. Previously, it provided an integrated Web-based real-time reservation and property management system for the hotel and resort industries. The company is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "RW.V": {"short_name": "RENOWORKS SOFTWARE INC.", "long_name": "RenoWorks Software Inc.", "summary": "RenoWorks Software Inc. develops and distributes digital visualization software for the renovation and new home construction sectors in the United States, Canada, and Europe. The company provides Renoworks FastTrack, a platform that helps contractors to reduce and eliminate time-consuming home visits by automatically generating accurate measurement reports, true-to-life visualizations, and 3D visuals; Web visualizer that enables customers to interact with building products and design their homes from anywhere; and Renoworks Product Configurator that allows customers to design building products, such as windows and doors with detail. It also offers Scene Builder, an interactive, engaging, and photo-realistic home visualizer solution to visualize design options and building products; product libraries, which showcases customer's product line; and mobile visualizer apps, as well as other home visualization software products. In addition, the company provides design, analytics, and integrations and application program interface services. It serves manufacturers, material suppliers, contractors and remodelers, marketing agencies, builders, and homeowners. The company is based in Calgary, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "RWCRF": {"short_name": "RIWI CORP", "long_name": "RIWI Corp.", "summary": "RIWI Corp. operates as a trend-tracking and prediction technology firm in the United States, Canada, Europe, and internationally. Its patented cloud-based and machine-learning software solution provides global digital intelligence platform to clients seeking real-time citizen sentiment data. The company offers real-time applied analytics, forecasts, advance warnings, digital surveys, ad tests, trend-monitoring, predictive analytics, risk monitoring, and message testing services. RIWI Corporation was incorporated in 2009 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "RWPM.F": {"short_name": "HUNTER TECHNOLOGY CORP.", "long_name": "Hunter Technology Corp.", "summary": "Hunter Oil Corp. acquires and develops crude oil and natural gas properties. The company was formerly known as Enhanced Oil Resources Inc. and changed its name to Hunter Oil Corp. in August 2016. Hunter Oil Corp. was incorporated in 1980 and is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "SHOP": {"short_name": "Shopify Inc.", "long_name": "Shopify Inc.", "summary": "Shopify Inc., a commerce company, provides a cloud-based multi-channel commerce platform for small and medium-sized businesses in Canada, the United States, the United Kingdom, Australia, and internationally. Its platform provides merchants with a single view of business and customers in various sales channels, including Web and mobile storefronts, physical retail locations, social media storefronts, and marketplaces; and enables to manage products and inventory, process orders and payments, fulfill and ship orders, build customer relationships, source products, leverage analytics and reporting, and access financing. The company was formerly known as Jaded Pixel Technologies Inc. and changed its name to Shopify Inc. in November 2011. Shopify Inc. was founded in 2004 and is headquartered in Ottawa, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "NYQ", "market": "us_market", "country": "Canada", "city": "Ottawa"}, "SHOP.TO": {"short_name": "SHOPIFY INC", "long_name": "Shopify Inc.", "summary": "Shopify Inc., a commerce company, provides a cloud-based multi-channel commerce platform for small and medium-sized businesses in Canada, the United States, the United Kingdom, Australia, and internationally. Its platform provides merchants with a single view of business and customers in various sales channels, including Web and mobile storefronts, physical retail locations, social media storefronts, and marketplaces; and enables to manage products and inventory, process orders and payments, fulfill and ship orders, build customer relationships, source products, leverage analytics and reporting, and access financing. The company was formerly known as Jaded Pixel Technologies Inc. and changed its name to Shopify Inc. in November 2011. Shopify Inc. was founded in 2004 and is headquartered in Ottawa, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Ottawa"}, "SPO.CN": {"short_name": "SponsorsOneInc", "long_name": "SponsorsOne Inc.", "summary": "SponsorsOne Inc., an early stage technology company, develops and operates a cloud based social sponsorship platform in the United States and Canada. The company develops SponsorsCloud, a platform for connecting and facilitating one-to one engagement between corporations to users in social networks. It also operates SponsorCoin, a platform that integrates with social networks and enables the delivery of the smart, social media marketing campaigns, and facilates transactions through its e-commerce platform, which supports the exchange of goods and services between brands and users using its digital currency SponsorCoin; and SponsorCoin and cash, a currency used to compensate the users for interacting, engaging, and creating social media content around a brands campaign. In addition, the company provides sales and marketing on behalf of the brand to its network of national wholesalers and retailers and offers purchase order financing to assist the brand in fulfilling every order; and brand building/management services, as well as manages the influencer communities for each brand. The company is headquartered in Uxbridge, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Uxbridge"}, "SPONF": {"short_name": "SPONSORSONE INC", "long_name": "SponsorsOne Inc.", "summary": "SponsorsOne Inc., an early stage technology company, develops and operates a cloud based social sponsorship platform in the United States and Canada. The company develops SponsorsCloud, a platform for connecting and facilitating one-to one engagement between corporations to users in social networks. It also operates SponsorCoin, a platform that integrates with social networks and enables the delivery of the smart, social media marketing campaigns, and facilates transactions through its e-commerce platform, which supports the exchange of goods and services between brands and users using its digital currency SponsorCoin; and SponsorCoin and cash, a currency used to compensate the users for interacting, engaging, and creating social media content around a brands campaign. In addition, the company provides sales and marketing on behalf of the brand to its network of national wholesalers and retailers and offers purchase order financing to assist the brand in fulfilling every order; and brand building/management services, as well as manages the influencer communities for each brand. The company is headquartered in Uxbridge, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Uxbridge"}, "SRBBF": {"short_name": "VPN TECHNOLOGIES INC", "long_name": "VPN Technologies Inc.", "summary": "VPN Technologies Inc. develops, acquires, operates, and manages software as a service (SaaS) business in Canada. The company offers GamerVPN.com that provides secure virtual private network (VPN) connections to various online games; and BladeVPN.com, a premium VPN, which offers unlimited VPN servers worldwide for both individuals and business customers. It also provides WebinarIgnition, a plug-in for WordPress that enables users to deploy live or prerecorded webinars, and charge viewers through the integrated payment system; and Gingerly, a cloud-based business management suite and dashboard offering a portfolio of a la carte business management applications for solopreneurs and small- and medium-sized enterprises. In addition, the company offers bContact, a cloud-based business management solution that provides integrated business management tools, including customer relationship management, accounting, banking, invoicing, billing, and quotation for small and medium sized organizations; ServerHawk.com, a SaaS Website analysis, SEO, and marketing tool for marketing professionals, business owners, and Web developers; and FileQ.com, an electronic file sharing and storage service that enable users to access content in real time. Further, it provides SiteSafe.io, an Internet security service that assists IT professionals in maintaining and managing networks, including the detection of viruses, worms, Trojans, and other malware injected on Websites; and LenderTech.com, a cloud based SaaS loan management utility solution for banks, financial institutions, mortgage lending facilitators, and micro-finance lenders. The company was formerly known as Subscribe Technologies Inc. and changed its name to VPN Technologies Inc. in February 2020. VPN Technologies Inc. was incorporated in 2010 and is based in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "SSVC": {"short_name": "SECURED SERVICES INC", "long_name": "Secured Services, Inc.", "summary": "Secured Services, Inc. (SSI) operates as an information security company, which provides secured user management software for the enterprises. Its products enable organizations to administer, control, and audit users' digital identities' and their access privileges to applications, data systems, and connectivity in wired and wireless networks. The company's products include IDENTIPRISE SECUREDUSER and IDENTIPRISE SECUREDMOBILE. The IDENTIPRISE SECUREDUSER software provides controlled access to all user applications. Its software also provides an automated way to grant, modify, or revoke user account access to applications and connectivity. The IDENTIPRISE SECUREDMOBILE software solution delivers end-to-end encrypted data communications between a user device, such as computer and handhelds, and protected information resources, across a wired or wireless network with connection mobility across such networks. SSI also provides wireless security software and information technology security services. In addition, the company provides professional services, which include project management, architecture and design, custom development services, and training to the customers; assisting clients in understanding their regulatory and security requirements; designing security and identity management policies; and developing plans and budgets to support the implementation of an enterprise-wide security solution. SSI offers its products and services to the financial services, health care, and government markets, primarily in North America. The company is based in Oakville, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Oakville"}, "STMDF": {"short_name": "STARTMONDAY TECHNOLOGY CORP", "long_name": "StartMonday Technology Corp.", "summary": "StartMonday Technology Corp. develops video-led mobile and web applications that enables employers to select candidates with their video introductions. It also develops Bizzy, a tool with an open blockchain solution for sharing career histories. The company was incorporated in 2016 and is based in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "SWISF": {"short_name": "GLOBEX DATA LTD", "long_name": "Globex Data Ltd.", "summary": "Globex Data Ltd. operates as a distributor and license holder of a suite of secure cloud-based storage, document management, encrypted emails, and secure communication tools. It offers DigitalSafe, an encrypted password manager, secure data backup, secure file-share, and secure email; PrivaTalk, a private and secure communications application offering secure chat with self destruct timer, secure voice and video calling and conferencing, secure email, and encrypted file transfer through any mobile device, tablet, or desktop; Sekur, a product for key personnel in large organizations and high net worth individuals geared for users sensitive to privacy and security; and Custodia. The company primarily sells its products through resellers and other distribution channels, such as managed service providers, Internet service providers, and telecommunication companies. It serves consumers, businesses, and governments worldwide. GlobeX Data Ltd. was founded in 2017 and is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "SYZ.V": {"short_name": "SYLOGIST LTD", "long_name": "Sylogist Ltd.", "summary": "Sylogist Ltd., a software company, provides enterprise resource planning (ERP) solutions to local governments, non-profit and non-governmental organizations, education boards, and Districts and Defense and safety contractors in Canada, the United States, the United Kingdom, and internationally. It offers Serenic Navigator solutions that comprises accounting and financial management, award and budget management, payroll and human resources, analytics and decision support, reporting, deposits and loans, and field connect products. The company also provides NaviPayroll, an integrated payroll management and human resources solution; NaviTrak, a manufacturing and distribution solution; and NaviView terminal, a touch-screen terminal that runs various application. In addition, it offers NaviNet that captures data from various shop floor systems and data collection devices, and distributes processed data to a multitude of systems, including ERP and enterprise systems; and NaviBridge, a suite of integration and administration tool to setup, integrate, monitor, and manage data transfers between ERP and legacy systems, distributed mobile systems, and Web-based applications. The company also offers InfoStrat public sector solutions, including enterprise level case management, grantor money management, justice solutions, and professional services. Sylogist Ltd. was incorporated in 1993 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "TCS.TO": {"short_name": "TECSYS INC J", "long_name": "Tecsys Inc.", "summary": "Tecsys Inc. engages in the development, marketing, and sale of supply chain management software in Canada, the United States, Europe, and internationally. The company offers warehouse management, distribution and transportation management, supply management at point-of-use, and retail order management, as well as financial management and analytics solutions. It also provides demand planning; and implementation, system enhancement, cloud, advisory, consulting, education, and support services, as well as OneSprint, a preconfigured cloud-based warehouse management systems package. The company primarily serves the healthcare systems, services parts, third-party logistics, retail, and general wholesale distribution industries. Tecsys Inc. was founded in 1983 and is headquartered in Montreal, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Montreal"}, "TCYSF": {"short_name": "TECSYS INC", "long_name": "Tecsys Inc.", "summary": "Tecsys Inc. engages in the development, marketing, and sale of supply chain management software in Canada, the United States, Europe, and internationally. The company offers warehouse management, distribution and transportation management, supply management at point-of-use, and retail order management, as well as financial management and analytics solutions. It also provides demand planning; and implementation, system enhancement, cloud, advisory, consulting, education, and support services, as well as OneSprint, a preconfigured cloud-based warehouse management systems package. The company primarily serves the healthcare systems, services parts, third-party logistics, retail, and general wholesale distribution industries. Tecsys Inc. was founded in 1983 and is headquartered in Montreal, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Montreal"}, "TQ43.F": {"short_name": "FANDOM SPORTS MEDIA", "long_name": "Fandom Sports Media Corp.", "summary": "Fandom Sports Media Corp., a live sports and esports entertainment company, aggregates, curates, and produces fan-focused content. The company's principal product is FANDOM SPORTS App, a mobile application for unfiltered raw sports talk. Its application allows sports fans to unleash their primal sports passions, pick fights, and earn rewards. The company also develops FANDOM SPORTS entertainment platform, a micro-services platform for esports with Blaze blockchain technology. It operates in Canada and Finland. The company was formerly known as Hatch Interactive Technologies Corp. and changed its name to Fandom Sports Media Corp. in August 2016. Fandom Sports Media Corp. is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "TQ43.MU": {"short_name": "FANDOM SPORTS MEDIA", "long_name": "Fandom Sports Media Corp.", "summary": "Fandom Sports Media Corp., a live sports and esports entertainment company, aggregates, curates, and produces fan-focused content. The company's principal product is FANDOM SPORTS App, a mobile application for unfiltered raw sports talk. Its application allows sports fans to unleash their primal sports passions, pick fights, and earn rewards. The company also develops FANDOM SPORTS entertainment platform, a micro-services platform for esports with Blaze blockchain technology. It operates in Canada and Finland. The company was formerly known as Hatch Interactive Technologies Corp. and changed its name to Fandom Sports Media Corp. in August 2016. Fandom Sports Media Corp. is headquartered in Vancouver, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "MUN", "market": "dr_market", "country": "Canada", "city": "Vancouver"}, "TRAD.V": {"short_name": "VOLEO TRADING SYSTEMS INC", "long_name": "Voleo Trading Systems Inc.", "summary": "Voleo Trading Systems Inc., a mobile-focused fintech company, develops mobile applications and software platforms for investors. The company offers an equity trading platform that operates on native iOS and Android devices, as well as a companion Web application. It also operates as a broker-dealer. The company is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "TTMZF": {"short_name": "DATABLE TECHNOLOGY CORPORATION", "long_name": "Datable Technology Corporation", "summary": "Datable Technology Corporation, a technology company, provides consumer digital and social media engagement, data mining, and loyalty solutions primarily in Canada and the United States. The company offers PlatformÂ³, a software as a service consumer marketing platform that enables consumer packaged goods companies and consumer brands to build and launch promotions and special offers on the mobile phone. It serves Internet advertising sector consumers. The company was formerly known as 3Tl Technologies Corp. and changed its name to Datable Technology Corporation in May 2018. Datable Technology Corporation was founded in 2008 and is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "TTT.CN": {"short_name": "TruTraceTech", "long_name": "TruTrace Technologies Inc.", "summary": "TruTrace Technologies Inc., a service technology company, provides integrated software platform in Canada. The company offers StrainSecure, a cloud-based software to register and track cannabis intellectual property from genome to sale. Its platform is also used to store, manage, share, access quality assurance, testing details, and certificates of authenticity, as well as motion and movement intelligence on inventory from batches and lots to serialized items. The company also provides TruTrace, cloud-based SaaS software for the quality assurance, product lab testing, and blockchain verification for enterprises. TruTrace Technologies Inc. is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "TTTSF": {"short_name": "TRUTRACE TECHNOLOGIES INC", "long_name": "TruTrace Technologies Inc.", "summary": "TruTrace Technologies Inc., a service technology company, provides integrated software platform in Canada. The company offers StrainSecure, a cloud-based software to register and track cannabis intellectual property from genome to sale. Its platform is also used to store, manage, share, access quality assurance, testing details, and certificates of authenticity, as well as motion and movement intelligence on inventory from batches and lots to serialized items. The company also provides TruTrace, cloud-based SaaS software for the quality assurance, product lab testing, and blockchain verification for enterprises. TruTrace Technologies Inc. is headquartered in Calgary, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Calgary"}, "TWOH": {"short_name": "TWO HANDS CORP", "long_name": "Two Hands Corporation", "summary": "Two Hands Corporation, through its subsidiary, I8 Interactive Corporation, engages in the research and development of Two Hands co-parenting application that provides communication and organization between divorced parties. It provides Two Hands Gone, an encrypted private messaging application. The company was formerly known as Innovative Product Opportunities, Inc. and changed its name to Two Hands Corporation in September 2016. Two Hands Corporation was founded in 2009 and is based in Toronto, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "UBMRF": {"short_name": "URBANIMMERSIVE INC", "long_name": "Urbanimmersive Inc.", "summary": "Urbanimmersive Inc. provides SaaS business management solutions to 3D visual content providers in Canada. The company operates in two segments, Software and Photography Equipment. The Software segment provides SaaS marketing platform to professional photographers and other immersive visual content providers. The Photography Equipment segment resells 3D photography equipment. The company's platform enables customers to enhance operational productivity and delivers visual content creations through websites builder tool, AI-backed image indexing, robust file transfer systems, and interactive visual technology solutions. It also offers 3D emulator technology, a visual content recognition post-production algorithm that delivers online and offline alternatives to traditional 3D engines for the creation of immersive digital environments. In addition, the company provides immersive 3D tours, floor plans and measurements, 3D pocket websites, single property websites, real estate video, image delivery, HDR image processing, and photographer business solutions. It serves residential, commercial, and construction real estate markets and local businesses. The company was formerly known as Urbanimmersive Technologies Inc. and changed its name to Urbanimmersive Inc. in October 2015. Urbanimmersive Inc. was founded in 2007 and is headquartered in Laval, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Laval"}, "URL.CN": {"short_name": "NameSiloTech", "long_name": "NameSilo Technologies Corp.", "summary": "NameSilo Technologies Corp., through its subsidiaries, provides domain name registration and management services in Canada. It also offers marketplace services for buying and selling domain names; and hosting, website builder, SSL, premium DNS, and email services. The company was formerly known as Brisio Innovations Inc. and changed its name to NameSilo Technologies Corp. in December 2018. NameSilo Technologies Corp. is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "URLOF": {"short_name": "NAMESILO TECHNOLOGIES CORP", "long_name": "NameSilo Technologies Corp.", "summary": "NameSilo Technologies Corp., through its subsidiaries, provides domain name registration and management services in Canada. It also offers marketplace services for buying and selling domain names; and hosting, website builder, SSL, premium DNS, and email services. The company was formerly known as Brisio Innovations Inc. and changed its name to NameSilo Technologies Corp. in December 2018. NameSilo Technologies Corp. is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "VDU1.F": {"short_name": "VIQ SOLUTIONS INC.", "long_name": "VIQ Solutions Inc.", "summary": "VIQ Solutions Inc. operates as a technology and service platform provider for digital evidence capture, retrieval, and content management in Australia, the United States, the United Kingdom, Canada, and internationally. It operates in two segments, Technology and Transcription. The Technology segment develops, distributes, and licenses computer-based digital solutions based on its technology. The Transcription segment provides recording and transcription services. The company's software captures digital content from audio/video source, and provides online collaboration, mobility, data analytics, and integration with sensors, facial recognition, speech recognition, and case management or patient record systems. It provides its recording and transcription services to various clients, including medical, courtrooms, legislative assemblies, hearing rooms, inquiries, and quasi-judicial clients; and multi-speaker documentation services to law enforcement and criminal justice organizations. The company was incorporated in 2004 and is based in Mississauga, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Mississauga"}, "VE3P.F": {"short_name": "ARHT MEDIA INC.", "long_name": "ARHT Media Inc.", "summary": "ARHT Media Inc., together with its subsidiaries, engages in the development, production, and distribution of digital human holograms and content worldwide. The company's patented technology allows for the capture, transmission, and display of the digital human holograms delivered to either an in-person or online audience, which are beamed onto virtually any stage in the world and displayed live for two-way interaction with an audience. Its products include technology rented and used for various one-off events, such as a product launch, client meetings, sales conferences, doctor training, 5G showcases, press events, and others; Capture Studio System, an end to end solution used to capture a subject for the purpose of presenting them holographically or digitally; HoloPresence Display, which is used for events, meetings, conferences, and other temporary installations; HoloPod Display, a permanent HoloPresence display system for offices, meeting rooms, and lecture halls; and ARHT Engine hardware and software, and proprietary display components, including the frame and mesh system. The company also offers transmission and maintenance fees, and subscription bundles services; and other services to customers, including equipment setup, training in the use of software and equipment, and content creation for events. ARHT Media Inc. was founded in 2012 and is headquartered in Toronto, Canada.", "currency": "EUR", "sector": "Technology", "industry": "Software—Application", "exchange": "FRA", "market": "dr_market", "country": "Canada", "city": "Toronto"}, "VGGOF": {"short_name": "CRYPTOLOGIC CORP", "long_name": "Cryptologic Corp.", "summary": "Cryptologic Corp. operates as a crypto currency miner and software development company in Canada. The company develops crypto currency mining operations. It also focuses on exploration and acquisition opportunities in sectors outside of cryptocurrency mining. The company was formerly known as Vogogo Inc. and changed its name to Cryptologic Corp. in July 2019. Cryptologic Corp. is headquartered in Toronto, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Toronto"}, "VLDI": {"short_name": "VALIDIAN CORPORATION", "long_name": "Validian Corporation", "summary": "Validian Corporation, a development stage company, provides software products to assist public and private enterprises in Canada and internationally. The company primarily offers ValidianProtect, a software only cyber security technology comprising an application and data protection platform and a data protection module, which protect the life cycle of data by providing secure access, retrieval, transfer, receipt, storage, and usage of digital information on mobile, cloud, Web, local and network applications, devices, servers, databases, and memory at rest, as well as in transit and in usage using wired, and wireless and mobile networks. Its ValidianProtect also provides secure mobile messaging and communications, cloud computing, cloud storage, distributed computing and Web application and Web portal access and usage, software defined networking, and the Internet of Things and SCADA for computers, servers, databases, intelligent sensors, and tablets and smartphones. In addition, the company offers solutions customized to the client's business process to ensure authenticity, integrity, and custody of digital assets. It offers its products through direct sales, as well as through channel partners, such as independent software vendors, application service providers, value-added resellers, independent marketing representatives, system integrators, and original equipment manufacturers. The company was formerly known as Sochrys.com Inc. and changed its name to Validian Corporation in January 2003. Validian Corporation was incorporated in 1989 and is based in Ottawa, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Ottawa"}, "VLEOF": {"short_name": "VOLEO TRADING SYSTEMS INC", "long_name": "Voleo Trading Systems Inc.", "summary": "Voleo Trading Systems Inc., a mobile-focused fintech company, develops mobile applications and software platforms for investors. The company offers an equity trading platform that operates on native iOS and Android devices, as well as a companion Web application. It also operates as a broker-dealer. The company is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "VQS.TO": {"short_name": "VIQ SOLUTIONS INC", "long_name": "VIQ Solutions Inc.", "summary": "VIQ Solutions Inc. operates as a technology and service platform provider for digital evidence capture, retrieval, and content management in Australia, the United States, the United Kingdom, Canada, and internationally. It operates in two segments, Technology and Transcription. The Technology segment develops, distributes, and licenses computer-based digital solutions based on its technology. The Transcription segment provides recording and transcription services. The company's software captures digital content from audio/video source, and provides online collaboration, mobility, data analytics, and integration with sensors, facial recognition, speech recognition, and case management or patient record systems. It provides its recording and transcription services to various clients, including medical, courtrooms, legislative assemblies, hearing rooms, inquiries, and quasi-judicial clients; and multi-speaker documentation services to law enforcement and criminal justice organizations. The company was incorporated in 2004 and is based in Mississauga, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Mississauga"}, "VQSLF": {"short_name": "VIQ SOLUTIONS INC", "long_name": "VIQ Solutions Inc.", "summary": "VIQ Solutions Inc. operates as a technology and service platform provider for digital evidence capture, retrieval, and content management in Australia, the United States, the United Kingdom, Canada, and internationally. It operates in two segments, Technology and Transcription. The Technology segment develops, distributes, and licenses computer-based digital solutions based on its technology. The Transcription segment provides recording and transcription services. The company's software captures digital content from audio/video source, and provides online collaboration, mobility, data analytics, and integration with sensors, facial recognition, speech recognition, and case management or patient record systems. It provides its recording and transcription services to various clients, including medical, courtrooms, legislative assemblies, hearing rooms, inquiries, and quasi-judicial clients; and multi-speaker documentation services to law enforcement and criminal justice organizations. The company was incorporated in 2004 and is based in Mississauga, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Mississauga"}, "VSBGF": {"short_name": "VSBLTY GROUPE TECHNOLOGIES CORP", "long_name": "VSBLTY Groupe Technologies Corp.", "summary": "Vsblty Groupe Technologies Corp. operates as a security and retail software technology company. Its software modules include VisionCaptor, a digital signage content management system; DataCaptor, which provides real-time analytics and audience measurement system; and VSBLTY Vector, a software module that interfaces with a local or remote database to detect persons or objects of interest within a camera's field of view. The company also provides retail hardware solutions that can be integrated with the digital screen. It has collaboration agreements with Photon-X, LLC; UST Global Inc.; Digitalware Inc.; and Prevenitas Inc. Vsblty Groupe Technologies Corp. is headquartered in Vancouver, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Vancouver"}, "VSBY.CN": {"short_name": "VSBLTYGrpeTech", "long_name": "VSBLTY Groupe Technologies Corp.", "summary": "Vsblty Groupe Technologies Corp. operates as a security and retail software technology company. Its software modules include VisionCaptor, a digital signage content management system; DataCaptor, which provides real-time analytics and audience measurement system; and VSBLTY Vector, a software module that interfaces with a local or remote database to detect persons or objects of interest within a camera's field of view. The company also provides retail hardware solutions that can be integrated with the digital screen. It has collaboration agreements with Photon-X, LLC; UST Global Inc.; Digitalware Inc.; and Prevenitas Inc. Vsblty Groupe Technologies Corp. is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "WIN.V": {"short_name": "WINDFALL GEOTEK INC", "long_name": "Windfall Geotek Inc.", "summary": "Windfall Geotek Inc. develops platforms for the mining sector. It offers CARDS (computer aided resource detection system), a platform to identify a statistical probability of target identification within known areas of interest to analyze digital data sets of georeferenced historical exploration data including, geological, geochemical, geophysical, and structural, and digital elevation data; and data mining services. The company also explores for, and develops mineral resource properties in QuÃ©bec. It primarily explores for base metals, precious metals, and Lithium. The company was formerly known as Albert Mining Inc. and changed its name to Windfall Geotek Inc. in October 2019. Windfall Geotek Inc. was incorporated in 1996 and is headquartered in Brossard, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Brossard"}, "WINKF": {"short_name": "WINDFALL GEOTEK INC", "long_name": "Windfall Geotek Inc.", "summary": "Windfall Geotek Inc. develops platforms for the mining sector. It offers CARDS (computer aided resource detection system), a platform to identify a statistical probability of target identification within known areas of interest to analyze digital data sets of georeferenced historical exploration data including, geological, geochemical, geophysical, and structural, and digital elevation data; and data mining services. The company also explores for, and develops mineral resource properties in QuÃ©bec. It primarily explores for base metals, precious metals, and Lithium. The company was formerly known as Albert Mining Inc. and changed its name to Windfall Geotek Inc. in October 2019. Windfall Geotek Inc. was incorporated in 1996 and is headquartered in Brossard, Canada.", "currency": "USD", "sector": "Technology", "industry": "Software—Application", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Brossard"}, "WISH.V": {"short_name": "WISHPOND TECHNOLOGIES LTD", "long_name": "Wishpond Technologies Ltd.", "summary": "Wishpond Technologies Ltd. engages in the provision of technological digital marketing solutions for businesses in the United States, Canada, and internationally. It offers marketing, promotion, lead generation, and sales conversion services. The company provides proprietary cloud-based software for lead generation, marketing automation, and analytics, including landing pages, social promotions, website pop-ups, online forms, lead activity tracking, and email marketing; and a range of integrated marketing services, such as campaign design and management, online advertising, search engine optimization, landing page design, and others. It serves small-to-medium sized businesses in various industries, such as e-commerce, marketing agencies, beauty, fitness, and design; and blue-chip companies. The company is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "WLTR.V": {"short_name": "GOLO MOBILE INC", "long_name": "GOLO Mobile Inc.", "summary": "GOLO Mobile Inc. operates a mobile and web-based order ahead platform for pick-up and delivery. It delivers food, pharmacy, grocery, dry cleaning, flowers, and other hard goods for individuals working and/or living in locations, such as airports, office towers, condo towers, hotels, hospitals, large venues, and convention centers. The company is headquartered in Montreal, Canada. GOLO Mobile Inc. is a subsidiary of Paysafe Group Limited.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Montreal"}, "XBLK.CN": {"short_name": "eXeBlock Tech", "long_name": "eXeBlock Technology Corporation", "summary": "eXeBlock Technology Corporation develops and markets decentralized applications. The company is based in Vancouver, Canada.", "currency": "CAD", "sector": "Technology", "industry": "Software—Application", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Vancouver"}}