{
    "5CR.SI": {
        "short_name": "$ Asiatic",
        "long_name": "Asiatic Group (Holdings) Limited",
        "summary": "Asiatic Group (Holdings) Limited, an investment holding company, provides engineering management services in Singapore, Cambodia, and internationally. The company operates in two segments, Fire Fighting and Protection, and Power Related. It operates as an engineering, procurement, and construction, as well as operation and maintenance contractor that provides planning and development services; and participates as an equity investor in power plant projects. The company also engages in the generation of power; and distribution of controlled power supply and equipment. In addition, it designs, supplies, installs, and maintains firefighting and protection systems, such as fire hydrants, fire extinguishers, hoses, and couplings to combat marine, offshore, industrial, and household fires for households, factories, office buildings, shopping malls, retail outlets, cruise liners, property developments, marine and offshore industries, and civil defense entities under the KILLFIRE brand. Asiatic Group (Holdings) Limited was founded in 1965 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5WE.SI": {
        "short_name": "$ Moya Asia",
        "long_name": "Moya Holdings Asia Limited",
        "summary": "Moya Holdings Asia Limited, an investment holding company offers a range of water treatment solutions to government in Indonesia. It offers commissioning, operation, and maintenance of various water treatment plants on design, build, operate, and transfer arrangements. The company also provides management, technical advisory and analysis, and management consultancy services to the clean water industry; and supplies and distributes clean water. It serves approximately 3.5 million people and is connected to approximately 560,000 customers in the Greater Jakarta region. The company was incorporated in 2013 and is based in Singapore. Moya Holdings Asia Limited is a subsidiary of Tamaris Infrastructure Pte. Ltd.",
        "currency": "SGD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "76N.SG": {
        "short_name": "Kenon Holdings Ltd. Registered ",
        "long_name": "Kenon Holdings Ltd.",
        "summary": "Kenon Holdings Ltd., through its subsidiaries, owns, develops, and operates power generation facilities in Israel and internationally. It operates through OPC, Quantum, and Other segments. The company's power generation plants operate on natural gas and diesel. It also designs, manufactures, sells, and services passenger vehicles and parts through a network of independent authorized retail dealers in China. As of December 31, 2019, the company's Qoros' dealerships included 106 point of sales facilities. In addition, Kenon Holdings Ltd., through its 32% equity interest in ZIM Integrated Shipping Services, Ltd., owned and chartered vessels with a total container capacity of 312,142TEUs. Further, it develops and owns a proprietary natural gas-to-liquid technology process. The company was incorporated in 2014 and is based in Singapore. Kenon Holdings Ltd. is a subsidiary of Ansonia Holdings Singapore B.V.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "A7RU.SI": {
        "short_name": "Kep Infra Tr",
        "long_name": "Keppel Infrastructure Trust",
        "summary": "Keppel Infrastructure Trust is a listed business trust. The firm provides investors with the opportunity to invest in a large and well-diversified portfolio of core infrastructure assets located in jurisdictions with well-developed legal frameworks that support infrastructure investment. It aims to provide long-term, regular and sustainable distributions to its Unitholders. Keppel Infrastructure Trust was incorporated in 2007 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "HYFXF": {
        "short_name": "HYFLUX",
        "long_name": "Hyflux Ltd",
        "summary": "Hyflux Ltd provides various solutions in water and energy areas worldwide. The company operates through two segments, Municipal and Industrial. The Municipal segment supplies a range of infrastructure solutions, including water, power, and waste-to-energy to municipalities and governments. The Industrial segment supplies infrastructure solutions for water to industrial customers. The company provides seawater desalination, raw water purification, wastewater cleaning, water recycling, water reclamation, and pure water production services to municipal and industrial clients, as well as to home consumers; and filtration and purification products. It also designs, constructs, owns, operates, and sells water treatment, seawater desalination, wastewater treatment, and water recycling plants under service concession arrangements; and sells oxygen-rich water and related products and services. In addition, the company designs, constructs, owns, operates, and sells power plants and waste-to-energy plants; trades in the electricity markets; and sells retail electricity contracts. Hyflux Ltd was founded in 1989 and is headquartered in Singapore.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "IOJ.F": {
        "short_name": "RENAISSANCE UNITED -LOC.-",
        "long_name": "Renaissance United Limited",
        "summary": "Renaissance United Limited operates as a developer, turnkey contractor, and investor in oil and gas, power, transportation, water and environment, and industrial infrastructure projects worldwide. Its infrastructure related activities cover areas, such as offshore platforms and support facilities, product loading and receiving terminals, import-export SPM systems, land and submarine pipelines, minimal field production systems, supply bases and terminals, gas conversion plants, fabrication facilities, and sea islands/transshipment terminals; and small to medium sized power plants, large power developments, sub-packages of IPP projects, repowering of existing plants, industrial estate and captive power plants, and transmission and distribution projects. The company's infrastructure related activities in water and environment field cover raw water collection system, treatment plants, pipelines and outfalls, storage reservoirs, distribution systems, waste treatment and recycling, air pollution and noise control, and environmental services; transportation fields cover ports, harbors, jetties, wharves, transshipment facilities, and toll roads and bridges; and industrial sector cover petrochemical, telecommunications, industrial park, and pulp and paper mill infrastructure, as well as bulk material handling, fertilizer plants, and military applications. It also engages in the distribution of gas to household, commercial, and industrial users; the development of residential real estate properties; acting as agents and distributors of semiconductor back-end equipment; the provision of consultancy services in semi-conductor industry; the investment securities trading; the warehousing business; and the manufacture, repairing, and dealership in electronic components. The company was formerly known as Ipco International Limited and changed its name to Renaissance United Limited in December 2018. Renaissance United Limited was founded in 1975 and is based in Singapore.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "KEN": {
        "short_name": "Kenon Holdings Ltd.",
        "long_name": "Kenon Holdings Ltd.",
        "summary": "Kenon Holdings Ltd., through its subsidiaries, owns, develops, and operates power generation facilities in Israel and internationally. It operates through OPC, Quantum, and Other segments. The company's power generation plants operate on natural gas and diesel. It also designs, manufactures, sells, and services passenger vehicles and parts through a network of independent authorized retail dealers in China. As of December 31, 2019, the company's Qoros' dealerships included 106 point of sales facilities. In addition, Kenon Holdings Ltd., through its 32% equity interest in ZIM Integrated Shipping Services, Ltd., owned and chartered vessels with a total container capacity of 312,142TEUs. Further, it develops and owns a proprietary natural gas-to-liquid technology process. The company was incorporated in 2014 and is based in Singapore. Kenon Holdings Ltd. is a subsidiary of Ansonia Holdings Singapore B.V.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "KEN.TA": {
        "short_name": "KENON HLDGS LTD",
        "long_name": "Kenon Holdings Ltd.",
        "summary": "Kenon Holdings Ltd., through its subsidiaries, owns, develops, and operates power generation facilities in Israel and internationally. It operates through OPC, Quantum, and Other segments. The company's power generation plants operate on natural gas and diesel. It also designs, manufactures, sells, and services passenger vehicles and parts through a network of independent authorized retail dealers in China. As of December 31, 2019, the company's Qoros' dealerships included 106 point of sales facilities. In addition, Kenon Holdings Ltd., through its 32% equity interest in ZIM Integrated Shipping Services, Ltd., owned and chartered vessels with a total container capacity of 312,142TEUs. Further, it develops and owns a proprietary natural gas-to-liquid technology process. The company was incorporated in 2014 and is based in Singapore. Kenon Holdings Ltd. is a subsidiary of Ansonia Holdings Singapore B.V.",
        "currency": "ILA",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "SGXXF": {
        "short_name": "SOUND GLOBAL LTD",
        "long_name": "Sound Global Ltd.",
        "summary": "Sound Global Ltd., an investment holding company, provides water and wastewater treatment solutions in the People's Republic of China, Singapore, and Bangladesh. It operates in three segments: Turnkey Projects and Services; Equipment Fabrications; and Operations and Maintenance of Water Supply and Wastewater Treatment Facilities. The company designs, constructs, operates, and maintains water and wastewater treatment facilities; and manufactures water and wastewater treatment equipment. It is also involved in the municipal water supply, wastewater treatment, and water recycling and reuse; research and development of water treatment technologies and provision of services of technology consultation; labor subcontracting activities; and leasing of construction machinery and equipment. In addition, the company plans, designs, constructs, and manages industrial zone water management systems, municipal wastewater projects, and water supply projects; and offers integrated solutions in various fields, such as industrial water supply, desalination, and industrial wastewater treatment and cyclical reuse, as well as centralized treatment for water supply and drainage in industrial zones. Further, it engages in the integration of water supply and drainage in villages and small towns; industrial and residential properties construction, and engineering design and construction activities; sale of building materials; leasing of properties; and computer software development activities. Additionally, the company offers equity investment management and consulting services; and property management and maintenance services. The company was formerly known as Epure International Ltd. and changed its name to Sound Global Ltd. in May 2010. Sound Global Ltd. was founded in 1993 and is based in Singapore. Sound Global Ltd. is a subsidiary of Sound Water (BVI) Limited.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "SYM.SI": {
        "short_name": "$ Memiontec",
        "long_name": "Memiontec Holdings Ltd.",
        "summary": "Memiontec Holdings Ltd., a water treatment company, provides water and wastewater management services in Singapore, Indonesia, and the People's Republic of China. The company operates through Total Solutions with Engineering, Procurement and Construction (TSEPC); Operation, Maintenance and Service (OMS); Sales and Distribution of Water System and Equipment (Trading); and Others segments. The TSEPC segment engages in the provision of a range of solutions in water treatment, wastewater treatment, water recycling treatment, and sea water treatment and desalination. This segment's customers include public sectors and industrial-related industries, including agro, food and beverage, power, petrochemical, palm oil, chemical, semiconductor, and real estate. The OMS segment offers operational, preventive, and corrective maintenance works, as well as technical support and consultation services for plant maintenance to TSEPC customers with water and wastewater infrastructure. The Trading segment sells and distributes modular and customized water treatment systems, water treatment equipment, components or spare parts, and specialty and/or blended chemicals. The Others segment sells treated water. Memiontec Holdings Ltd. was founded in 1992 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}