{
    "BDOUY": {
        "short_name": "BDO UNIBANK INC",
        "long_name": "BDO Unibank, Inc.",
        "summary": "BDO Unibank, Inc. provides various banking products and services primarily in the Philippines. Its deposit products include savings, checking, and time deposit accounts; and loan portfolio comprises personal, auto, home, small and medium-enterprise, project finance, term, and working capital loans. The company also offers life, auto, home, personal accident, travel, property/engineering/marine, liability/surety/specialty, and employee benefits insurance products; remittance services; trade facilities, such as trade settlements, trust receipts, export bill purchases, and letters of credit; and trust and investment services consisting of unit investment trust funds, portfolio management, escrow services, mortgage or collateral trust, corporate agency services, and investment advisory services. In addition, it provides investment banking services, such as loan syndications, underwriting and placing of debt and equity securities, financial advisory services, and securities brokerage; and investment and structured products to high net worth individuals and institutional accounts. Further, the company offers leasing and financing solutions, including direct leases, sale and leaseback arrangements, and real estate leases; cash management services; treasury services; asset management, realty management, and accounting services; debit and credit cards; and private, online, mobile, and phone banking services. As of December 31, 2019, it operated 1,436 branches, including two foreign branches; 2,472 on-site and 1,994 off-site automated teller machines; and 562 cash accept machines. The company was formerly known as Banco De Oro Unibank Inc. and changed its name to BDO Unibank, Inc. in January 2011. BDO Unibank, Inc. was incorporated in 1967 and is headquartered in Makati City, the Philippines.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "state": null,
        "city": "Makati City",
        "zipcode": "0726",
        "website": "http://www.bdo.com.ph",
        "market_cap": "Large Cap"
    },
    "BPHLF": {
        "short_name": "BANK OF THE PHILIPPINE ISLANDS",
        "long_name": "Bank of the Philippine Islands",
        "summary": "Bank of the Philippine Islands, together with its subsidiaries, provides various financial products and services to retail and corporate clients in the Philippines. It operates through Consumer Banking, Corporate Banking, and Investment Banking segments. The Consumer Banking segment offers deposit taking and servicing; and consumer lending, such as home mortgages, auto loans, and credit card finance, as well as remittance services to individual and retail markets. The Corporate Banking segment provides deposit taking and servicing, loan facilities, trade, and cash management to corporate and institutional customers, such as high-end corporations and various middle market clients. The Investment Banking segment offers corporate finance, securities distribution, asset management, trust, and fiduciary services, as well as proprietary trading and investment activities. The company also provides financing, securities dealer, investment management, land holding, operations management, business systems, foreign exchange, real estate, pre-need, non-life insurance, leasing, and rental services. As of December 31, 2020, it operated 1,173 branches and 2,707 automated teller machines. The company also serves its customers through alternative electronic banking channels, such as telephone, mobile phone, and the internet. Bank of the Philippine Islands was founded in 1851 and is based in Makati City, the Philippines.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "state": null,
        "city": "Makati City",
        "zipcode": "1229",
        "website": "http://www.bpi.com.ph",
        "market_cap": "Mid Cap"
    },
    "MTPOF": {
        "short_name": "METROPOLITAN BANK & TRUST CO",
        "long_name": "Metropolitan Bank & Trust Company",
        "summary": "Metropolitan Bank & Trust Company, together with its subsidiaries, provides various commercial and investment banking products and services in the Philippines, rest of Asia, the United States, and Europe. The company's Consumer Banking segment offers consumer type loans and support for the sourcing and generation of consumer business. Its Corporate Banking segment engages in handling loans and other credit facilities; and offers deposit and current accounts for corporate and institutional customers. The company's Investment Banking segment provides structured finance; services relating to privatizations, initial public offerings, and mergers and acquisitions; and advisory services to individuals and institutions. Its Treasury segment offers money market, trading, and treasury services. The company's Branch Banking segment handles branch deposits, as well as provides loans and other loan related products for middle market clients. Its Others segment offers remittances, leasing, account financing, and other support services. The company also provides trade finance, thrift banking, foreign fund transfer, foreign exchange, online and mobile banking, collateral, and trust services. It operates through a network of 706 branches and 1,774 automated teller machines. The company was incorporated in 1962 and is headquartered in Makati City, the Philippines.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "state": null,
        "city": "Makati City",
        "zipcode": "1200",
        "website": "http://www.metrobank.com.ph",
        "market_cap": "Mid Cap"
    },
    "MTPOY": {
        "short_name": "METROPOLITAN BANK & TRUST CO",
        "long_name": "Metropolitan Bank & Trust Company",
        "summary": "Metropolitan Bank & Trust Company, together with its subsidiaries, provides various commercial and investment banking products and services in the Philippines, rest of Asia, the United States, and Europe. The company's Consumer Banking segment offers consumer type loans and support for the sourcing and generation of consumer business. Its Corporate Banking segment engages in handling loans and other credit facilities; and offers deposit and current accounts for corporate and institutional customers. The company's Investment Banking segment provides structured finance; services relating to privatizations, initial public offerings, and mergers and acquisitions; and advisory services to individuals and institutions. Its Treasury segment offers money market, trading, and treasury services. The company's Branch Banking segment handles branch deposits, as well as provides loans and other loan related products for middle market clients. Its Others segment offers remittances, leasing, account financing, and other support services. The company also provides trade finance, thrift banking, foreign fund transfer, foreign exchange, online and mobile banking, collateral, and trust services. It operates through a network of 706 branches and 1,774 automated teller machines. The company was incorporated in 1962 and is headquartered in Makati City, the Philippines.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "state": null,
        "city": "Makati City",
        "zipcode": "1200",
        "website": "http://www.metrobank.com.ph",
        "market_cap": "Mid Cap"
    }
}