{
    "ALH.JO": {
        "short_name": "Alaris Holdings Ltd",
        "long_name": "Alaris Holdings Limited",
        "summary": "Alaris Holdings Limited designs, manufactures, and sells specialized broadband antennas and other related radio frequency products primarily in South Africa, the United States, Europe, and Asia. The company operates through Alaris Antennas and COJOT segments. It serves system integrators, frequency spectrum regulators, and players in the homeland security space for use in the communication, frequency spectrum monitoring, test and measurement, electronic warfare, and other specialized markets; and military and public safety markets. The company was formerly known as Poynting Holdings Limited and changed its name to Alaris Holdings Limited in May 2015. Alaris Holdings Limited was founded in 1990 and is based in Centurion, South Africa.",
        "currency": "ZAc",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Centurion",
        "zipcode": "0157",
        "website": "http://www.alarisholdings.com",
        "market_cap": "Small Cap"
    },
    "ELI.JO": {
        "short_name": "Ellies Holdings Ltd",
        "long_name": "Ellies Holdings Limited",
        "summary": "Ellies Holdings Limited, an investment holding company, engages in the manufacture, import, wholesale, and distribution of LED lighting, electrical, and electronic products and solutions to the residential and commercial sectors in South Africa, Botswana, Namibia, and Swaziland. It operates in two segments, Trading and Distribution and Manufacturing. The company provides aerial and satellite television equipment, accessories and hardware, photovoltaic solar panels, and cable and fiber distribution networks, as well as signal, sound, and audio-visual solutions in the business sector. It also develops, manufactures, and sells terrestrial antennae; and light metal products, such as wall brackets, shelving, satellite and terrestrial mounting brackets, and satellite dishes, as well as LED and plasma TV mounts. In addition, the company offers wizard remote blaster and video senders; and vacuum and plastic blister packaging products. Ellies Holdings Limited was founded in 1979 and is based in Sandton, South Africa.",
        "currency": "ZAc",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2090",
        "website": "http://elliesholdings.com",
        "market_cap": "Small Cap"
    }
}