{
    "CGN.JO": {
        "short_name": "Cognition Holdings Ltd",
        "long_name": "Cognition Holdings Limited",
        "summary": "Cognition Holdings Limited, together with its subsidiaries, provides active data exchange, and knowledge creation and management services primarily in South Africa. The company's active data exchange services include short message, interactive voice response, Vmail one-on-one marketing, mobi, fulfillment, call center, bespoke, and unstructured supplementary service data services, as well as advertising, promotion, direct marketing, and CRM services; and conference call, IM, email, airtime sales, fax2email, email2fax, corporate fax, airtime sales, and auto receptionist services. It also provides Knowledge 350Â°, a 15 step business process, which creates an integrated and logical process that assists companies to build databases and to move from segmenting customers to single customer profiles with detailed demographics and psychographics. In addition, the company offers MyPoint that enables panellists to complete surveys and rewards them with points, prizes, and benefits; Community Builds, an interactive relationship-building program; qualitative and quantitative market research services; and omnibus/syndicated studies. Further, it provides Web development services, as well as associated search engine optimization input services; SecurDox, a document exchange services; and annual quantifications, reports tracking, in-store, in-store observation, and liquor in-store pricing, as well as print ad tracking, and commissioned and consumer research services. The company was formerly known as FoneWorx Holdings Limited and changed its name to Cognition Holdings Limited in January 2015. Cognition Holdings Limited is headquartered in Randburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Randburg",
        "zipcode": "2194",
        "website": "http://www.cognitionholdings.co.za",
        "market_cap": "Small Cap"
    }
}