{
  "ADH.JO": {
    "city": "Sandton",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Education & Training Services",
    "long_name": "ADvTECH Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "ADvTECH Ltd",
    "state": null,
    "summary": "ADvTECH Limited provides education, training, and staff placement services in South Africa and other African countries. It operates through three divisions: Schools, Tertiary, and Resourcing. The Schools division provides pre-primary, primary, and secondary education services. The Tertiary division offers education in diploma, degree, and postgraduate levels through face-to-face, online, and distance learning. The Resourcing division provides placement solutions in the areas of IT, finance, and engineering. The company was founded in 1978 and is based in Sandton, South Africa.",
    "website": "http://www.advtech.co.za",
    "zipcode": "2196"
  },
  "COH.JO": {
    "city": "Durbanville",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Education & Training Services",
    "long_name": "Curro Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Curro Holdings Limited",
    "state": null,
    "summary": "Curro Holdings Limited develops, acquires, and manages independent schools in South Africa, Namibia, and Botswana. The company operates through Curroa and Meridian segments. It operates nursery, primary, and high schools offering balanced academics, sports, and culture. The company also operates Curro Academy and Meridian schools, which accommodate learners from age five to grade 12; Curro Castle nursery schools; Curro schools that accommodate learners from age three to grade 12; and Curro Select schools that accommodate learners from age of three months to grade 12. The company operates 76 campuses with approximately 62,689 learners. The company was founded in 1998 and is based in Durbanville, South Africa. Curro Holdings Limited is a subsidiary of PSG Financial Services Limited.",
    "website": "http://www.curro.co.za",
    "zipcode": "7550"
  },
  "SDO.JO": {
    "city": "Cape Town",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Education & Training Services",
    "long_name": "Stadio Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Stadio Holdings Limited",
    "state": null,
    "summary": "Stadio Holdings Limited, an investment holding company, provides higher education services in South Africa. It offers undergraduate programs, including higher certificates, diplomas, and degrees; and post-graduate programs comprising honors and masters degrees, and doctorate. The company provides teacher education for pre-school and primary school teachers; postgraduate accounting education services; higher certificates and master degrees in accounting program; and higher education qualifications for management, commerce, banking, financial planning and insurance, and public management; and higher education through distance learning focused on the leadership in management, business and commerce, and law and policing. As of December 31, 2020, it owned 6 registered higher education institutions. The company was incorporated in 2016 and is based in Cape Town, South Africa. Stadio Holdings Limited is a subsidiary of PSG Alpha Investments Proprietary Limited.",
    "website": "http://stadio.co.za",
    "zipcode": "7550"
  }
}
