{
    "A9U.SG": {
        "short_name": "ASTRAL FOODS LTD. Registered Sh",
        "long_name": "Astral Foods Limited",
        "summary": "Astral Foods Limited operates as an integrated poultry producer in South Africa and internationally. It operates through three segments: Poultry, Feed, and Other Africa. The company engages in the breeding operations; sale of day-old chicks and hatching eggs; broiler production; abattoirs; and processing, marketing, sale, and distribution of poultry products. It also produces feed products for farmed animal species; and provides laboratory analytical services to the animal feed industry. The company offers its products under the Ross 308, Meadow, National Chicks, CAL, Goldi, County Fair, Festive, Mountain Valley, SupaStar, TigerChicks, Tiger Animal Feeds, Mozpintos, and National Chicks Swaziland brands. Astral Foods Limited was founded in 2001 and is based in Centurion, South Africa.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "STU",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Centurion",
        "zipcode": "0157",
        "website": "http://www.astralfoods.com",
        "market_cap": "Small Cap"
    },
    "ARL.JO": {
        "short_name": "Astral Foods Ltd",
        "long_name": "Astral Foods Limited",
        "summary": "Astral Foods Limited operates as an integrated poultry producer in South Africa and internationally. It operates through three segments: Poultry, Feed, and Other Africa. The company engages in the breeding operations; sale of day-old chicks and hatching eggs; broiler production; abattoirs; and processing, marketing, sale, and distribution of poultry products. It also produces feed products for farmed animal species; and provides laboratory analytical services to the animal feed industry. The company offers its products under the Ross 308, Meadow, National Chicks, CAL, Goldi, County Fair, Festive, Mountain Valley, SupaStar, TigerChicks, Tiger Animal Feeds, Mozpintos, and National Chicks Swaziland brands. Astral Foods Limited was founded in 2001 and is based in Centurion, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Centurion",
        "zipcode": "0157",
        "website": "http://www.astralfoods.com",
        "market_cap": null
    },
    "CKS.JO": {
        "short_name": "Crookes Brothers Ltd",
        "long_name": "Crookes Brothers Limited",
        "summary": "Crookes Brothers Limited, together with its subsidiaries, produces agricultural products. The company offers sugar cane, bananas, deciduous fruits, and macadamias. It is also involved in the development and sale of commercial, residential, and industrial real estate properties. In addition, the company engages in the sale of grains and nursery plants, and rental of leased buildings, as well as tourism business. It has operations in the KwaZulu-Natal, Mpumalanga, and Western Cape provinces of South Africa, as well as in Swaziland, Zambia, and Mozambique. The company was founded in 1860 and is headquartered in Mount Edgecombe, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Mount Edgecombe",
        "zipcode": "4300",
        "website": "http://www.cbl.co.za",
        "market_cap": null
    },
    "KAL.JO": {
        "short_name": "Kaap Agri Limited",
        "long_name": "Kaap Agri Limited",
        "summary": "Kaap Agri Limited trades in agricultural, fuel, and related retail markets in South Africa and Namibia. It operates through Trade, Retail Fuel & Convenience, Grain Services, and Manufacturing segments. The Trade segment offers production inputs, mechanization equipment and services, and other goods to agricultural producers, as well as the general public. The Retail Fuel & Convenience segment provides a retail fuel offering to a range of customers, including convenience store and quick service restaurant outlets. The Grain Services segment sells grain products; and provides a range of services, including storage and handling of grain products. The Manufacturing segment manufactures and sells dripper pipes and other irrigation equipment; food grade plastic bulk bins for the agricultural market; and distributes other irrigation parts. It operates under the Agrimark, Liquormark, Pakmark, Kaap Agri, Wesgraan, Expressmark, the Fuel Company, and Tego brands. Kaap Agri Limited was founded in 1912 and is based in Paarl, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Paarl",
        "zipcode": "7646",
        "website": "http://www.kaapagri.co.za",
        "market_cap": null
    },
    "QFH.JO": {
        "short_name": "Quantum Foods Hldgs Ltd",
        "long_name": "Quantum Foods Holdings Ltd",
        "summary": "Quantum Foods Holdings Ltd engages in the feed and poultry business in South African and rest of African markets. The company operates through Eggs, Farming, and Animal Feeds segments. It produces and distributes eggs; and sells layer parent stock, hatching eggs, day-old pullets, and point-of-lay hens under the Bergvlei Chicks brand. The company also supplies livestock to abattoirs; produces day-old commercial broiler chicks from hatcheries; and produces and sells various feeds, including broiler, layer, dairy, sheep, cattle, ostrich, and pig feeds under the Nova Feeds brand. In addition, it sells its products under the Bellevue Chicks, Safe Eggs, Nulaid, Quantum, Mega Eggs, and Galovos brand names. The company was incorporated in 2013 and is headquartered in Wellington, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Wellington",
        "zipcode": "7655",
        "website": "http://quantumfoods.co.za",
        "market_cap": null
    },
    "SHG.JO": {
        "short_name": "Sea Harvest Group Ltd",
        "long_name": "Sea Harvest Group Limited",
        "summary": "Sea Harvest Group Limited engages in the fishing and food business serving retail and foodservice customers. The company operates through four segments: South African Fishing, Australia, Aquaculture, and Cape Harvest Foods. Its activities include the fishing of cape hake, and shark bay king and tiger prawns, as well as horse and Spanish mackerel, pilchards, anchovies, tuna, scallops, crabs, and a variety of farmed species; processing of the catch into frozen and chilled seafood; and marketing of products. The company owns and operates a fleet of 34 vessels, which include single and twin fresh fish trawlers, factory freezer trawlers, and access to in-shore trawlers that catch and process cape hake and other species, as well as by-catch species. It also has 12 prawn vessels, which catch and process prawns, scallops, crabs, and related by-catch species. The company distributes various chilled and frozen food products through its distribution network; and to local supermarket chains in South Africa, as well as supplies its products to 30 countries worldwide. It also imports and distributes frozen seafood to the catering and hospitality industry. In addition, the company engages in the aquaculture business, as wells as provides abalone, mussels, oysters, and trout farming services. Further, it is involved in the production, distribution, marketing, and sale of value-added dairy products to the South African retail, wholesale, foodservice, and food ingredients markets. The company was formerly known as Sea Harvest Holdings Proprietary Limited and changed its name to Sea Harvest Group Limited in February 2017. Sea Harvest Group Limited was founded in 1964 and is headquartered in Cape Town, South Africa. Sea Harvest Group Limited is a subsidiary of Brimco Proprietary Limited.",
        "currency": "ZAc",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7925",
        "website": "http://www.seaharvestgroup.co.za",
        "market_cap": null
    }
}