{
  "CSB.JO": {
    "city": "Johannesburg",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Home Improvement Retail",
    "long_name": "Cashbuild Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Cyclical",
    "short_name": "Cashbuild Ltd",
    "state": null,
    "summary": "Cashbuild Limited retails building materials and associated products. The company offers cement, timber, bricks, roof coverings, and decorative products. It serves contractors, homebuilders and improvers, farmers, traders, and other customers. As of June 30, 2020, the company operated 318 stores, including 256 Cashbuild stores, 61 P&L Hardware stores, and 1 DIY stores in South Africa, Botswana, Swaziland, Lesotho, Namibia, Malawi, and Zambia. Cashbuild Limited was founded in 1978 and is based in Johannesburg, South Africa.",
    "website": "http://www.cashbuild.co.za",
    "zipcode": "2001"
  },
  "ITE.JO": {
    "city": "Bryanston",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Home Improvement Retail",
    "long_name": "Italtile Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Cyclical",
    "short_name": "Italtile Ltd",
    "state": null,
    "summary": "Italtile Limited manufactures and retails tiles, bathroom ware, and related products in South Africa. It operates through five segments: Retail, Franchising, Properties, Supply and Support Services, and Manufacturing. The company is involved in franchising and retailing of tiles, brassware, laminated flooring, bathroom ware, and accessories; and distributing of tiles, shower enclosures, brassware, laminated flooring, accessories, and tiling tools. It also invests in properties; and manufactures tiles, sanitary ware, baths, adhesive, and related products. The company offers its products under the U-Light, Italtile Retail, CTM, and TopT brands. As of June 30, 2020, it operated through a network of 198 stores in Southern and East Africa. The company was founded in 1969 and is based in Bryanston, South Africa. Italtile Limited is a subsidiary of Rallen (Pty) Ltd.",
    "website": "http://www.italtile.com",
    "zipcode": "2021"
  }
}
