{
    "KDV.JO": {
        "short_name": "Kaydav Group Ltd",
        "long_name": "KayDav Group Limited",
        "summary": "KayDav Group Limited distributes wood-based panels in South Africa. The company operates through Board Distribution and Adaptation, and Packaging segments. It offers wood-based panels under the brands of Kayreed Board and Timber, and Davidson's Discount Boards for the furniture, shop-fitting, and kitchen manufacturing and installation industries, as well as to other wood-based panel distributors through its outlets in the Western Cape, Southern Cape, KwaZulu-Natal, and Gauteng. The company also provides packaging consumables and machinery through its outlets in Western Cape and Gauteng for various customers, including manufacturers, agriculture, home industries, and small businesses under the Packit Packaging Solutions trade name. KayDav Group Limited is headquartered in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Cape Town"
    },
    "YRK.JO": {
        "short_name": "York Timber Holdings Ltd",
        "long_name": "York Timber Holdings Limited",
        "summary": "York Timber Holdings Limited, an investment holding company, engages in the forestry, sawmilling, plywood, wholesale, and hospitality industry businesses. It operates through three segments: Processing Plants, Forestry and Fleet, and Wholesale. The Processing Plants segment operates four sawmills, which produces and sells a range of structural and industrial sawn timber products; and a plywood plant that offers plywood timber products. The Forestry and Fleet segment owns plantations, which grows pine and eucalyptus trees in the Mpumalanga Province; and engages in the provision of fleet solutions that owns heavy motor vehicles used to transport logs. This segment sells its products to processing segment and external customers. The Wholesale segment has eight distribution centers, which sells timber-related products from the sawmills, plywood plants, and external suppliers in Pretoria, Germiston, Polokwane, Bloemfontein, Port Elizabeth, Durban, Upington, and Cape Town. The company was formerly known as The York Timber Organisation Limited and changed its name to York Timber Holdings Limited in May 2009. York Timber Holdings Limited was founded in 1916 and is headquartered in Sabie, South Africa.",
        "currency": "ZAc",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Sabie"
    }
}