{
    "CTK.JO": {
        "short_name": "Cartrack Holdings Ltd",
        "long_name": "Cartrack Holdings Limited",
        "summary": "Cartrack Holdings Limited, an investment holding company, provides data analytic solutions for mobile asset management, asset recovery, and workforce optimization based on a Software-as-a-Service platform. The company is involved in the design, development, and installation of telematics technology, data collection and analysis, and the delivery of fleet and mobile asset management solutions, as well as the tracking and recovery of vehicles. It offers fleet management and stolen vehicle recovery solutions; Bike Track, a real-time GPS and telematics solution for commercial motorbike fleet; Mi-Fleet, an administrative and vehicle cost accounting software that manages fleet, drivers, and related operating costs; Communicator, a software application for mobile tablets and phones, which combines communication, navigation, tracking, and task management technologies; Live Vision, a four-camera vehicle video system for fleet owners to have real-time visual contact with their fleet; and Insurance Telematics, a solution for the insurer and the fleet operator to manage driver behavior. The company also provides personal vehicle security products, which include Cartrack Protector, a safety and security package; Stolen Vehicle Recovery solution; Bike Recovery, a tracking device used for stolen motorbike recovery; crash alert/ambulance services; Car Watch, a solution for the detection and reporting of unauthorized vehicle activity; and Insurance Telematics, a solution for the insurer and the insured to manage driver behavior. It serves small, medium, and large fleets, as well as businesses and consumers in 23 countries in Africa, Europe, North America, the Asia-Pacific, and the Middle East. The company was founded in 2001 and is based in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Johannesburg"
    },
    "SEB.JO": {
        "short_name": "Sebata Holdings Ltd",
        "long_name": "Sebata Holdings Limited",
        "summary": "Sebata Holdings Limited provides enterprise management, water management, and ICT solutions to municipalities, public entities, provincial government, and the private sector in South Africa. The company operates through four divisions: Water Technologies, Software Solutions, Consultancy Services, and ICT Support Services. It offers software solutions, such as PROMUN, a public-sector accounting package that incorporates general ledger, creditors, orders, cashbook, stores, payroll, HR, costing, consolidated debtors, fixed assets, and loan registers; integrated technology solutions, enterprise management systems, and multi-disciplinary professional services; and information communication technology solutions and services to municipal fresh produce providers. The company also offers consultancy services, including utility management services comprising credit control, indigent register management, data cleansing, data enrichment, geo-spatial field data management, meter reading, and meter installation and maintenance; and accounting and professional services. In addition, it provides electronic water control and prepayment devices; and plastic water meters, ball valves, and meter boxes. In addition, it offers telecommunication network services; network architecture design, managed IT, backup disaster recovery, cloud, security, and anti-virus solutions, as well as remote monitoring, and remote and telephonic support services. The company was formerly known as MICROmega Holdings Limited and changed its name to Sebata Holdings Limited in November 2018. The company is headquartered in Sandton, South Africa. Sebata Holdings Limited is a subsidiary of Laird Investments (Pty) Ltd.",
        "currency": "ZAc",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Sandton"
    }
}