{
    "SEB.JO": {
        "short_name": "Sebata Holdings Ltd",
        "long_name": "Sebata Holdings Limited",
        "summary": "Sebata Holdings Limited provides enterprise management, water management, and ICT solutions to municipalities, public entities, provincial government, and the private sector in South Africa. The company operates through four divisions: Water Technologies, Software Solutions, Consultancy Services, and ICT Support Services. It offers software solutions, such as PROMUN, a public-sector accounting package that incorporates general ledger, creditors, orders, cashbook, stores, payroll, HR, costing, consolidated debtors, fixed assets, and loan registers; integrated technology solutions, enterprise management systems, and multi-disciplinary professional services; and information communication technology solutions and services to municipal fresh produce providers. The company also offers consultancy services, including utility management services comprising credit control, indigent register management, data cleansing, data enrichment, geo-spatial field data management, meter reading, and meter installation and maintenance; and accounting and professional services. In addition, it provides electronic water control and prepayment devices; and plastic water meters, ball valves, and meter boxes. In addition, it offers telecommunication network services; network architecture design, managed IT, backup disaster recovery, cloud, security, and anti-virus solutions, as well as remote monitoring, and remote and telephonic support services. The company was formerly known as MICROmega Holdings Limited and changed its name to Sebata Holdings Limited in November 2018. The company is headquartered in Sandton, South Africa. Sebata Holdings Limited is a subsidiary of Laird Investments (Pty) Ltd.",
        "currency": "ZAc",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2196",
        "website": "http://www.micromega.co.za",
        "full_time_employees": null
    },
    "SVB.JO": {
        "short_name": "Silverbridge Holdings",
        "long_name": "SilverBridge Holdings Limited",
        "summary": "SilverBridge Holdings Limited, together with its subsidiaries, provides business solutions to the financial services industry. The company provides Exergy, an insurance software solution that administers life, group schemes, EB, and pensions on one system; and FAIS Compliance, which facilitates the remote management of FAIS fit and proper and complaints. It also offers data solutions and digital forms; and TOM, an artificial intelligence technology that digitalizes business processes to enhance customer efficiency and service. In addition, the company offers implementation and support, hosting and outsourcing, research and development, and managed services, as well as provides software rental, and other license and maintenance services. Further, it provides advisory and consulting and data analytics solutions and services. The company operates in South Africa, Namibia, Kenya, Zimbabwe, Ghana, Lesotho, Botswana, Mauritius, Nigeria, Mozambique, Zambia, Malawi, and Tanzania. SilverBridge Holdings Limited was founded in 1995 and is based in Pretoria, South Africa.",
        "currency": "ZAc",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Pretoria",
        "zipcode": "0048",
        "website": "http://www.silverbridge.co.za",
        "full_time_employees": null
    }
}