{
    "ENX.JO": {
        "short_name": "enX Group LImited",
        "long_name": "enX Group Limited",
        "summary": "enX Group Limited, together with its subsidiaries, provides industrial, petrochemical, and fleet management and logistics products and related services primarily to industrial and commercial sectors. The company operates through enX Equipment, enX Fleet, and enX Petrochemicals segments. The enX Equipment segment provides distribution, rental, and value added services for industrial and materials handling equipment; manufactures, installs, and maintains diesel generators, and distributes various industrial and marine engines, as well as provides temporary power; and distributes professional woodworking equipment, and tooling and edging products, as well as provides associated services, such as blade sharpening and equipment maintenance services. This segment also distributes forklifts, BT warehousing equipment, konecranes heavy duty forklifts, container handling equipment, terminal tractors, batteries and chargers, industrial cleaning equipment, and truck mounted cranes. The enX Petrochemicals segment produces and markets oil lubricants and greases; and distributes plastics, polymers, rubber, and specialty chemicals. The enX Fleet segment provides leasing, fleet management, outsourcing solutions, maintenance, warranty management and vehicle tracking solutions. This segment also offers fleet management solutions for commercial vehicle fleet owners and logistics solutions. It has operations in South Africa, sub-Saharan Africa, the United Kingdom, and Ireland. The company was formerly known as Austro Group Limited and changed its name to enX Group Limited in January 2015. enX Group Limited was founded in 2007 and is based in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Johannesburg"
    }
}