{
    "OLG.JO": {
        "short_name": "Onelogix Group Ltd",
        "long_name": "OneLogix Group Limited",
        "summary": "OneLogix Group Limited, together with its subsidiaries, provides logistics and related services in South Africa. It operates through three segments: Abnormal Logistics, Primary Products Logistics, and Other. The company offers project and abnormal freight logistics; local and cross-border auto-logistics; logistics services for solvents, acids, food grade products, liquid petroleum, gas, cryogenics, and dry bulk products; general freight and commodities movement services; refrigerated logistics services for agricultural products, such as fruit and vegetable market; and transport vehicles, including new commercial vehicles through a fleet of 300 trucks and trailers. It also provides import and export warehouse handling and clearing and forwarding services; distributes agricultural inputs and final products; repairs passenger vehicles, commercial vehicles, and structural chassis; and rebuilds cabs, as well as offers spray painting services. In addition, the company offers logistics related accounting software. OneLogix Group Limited was founded in 2000 and is headquartered in Kempton Park, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Kempton Park",
        "zipcode": "1619",
        "website": "http://www.onelogix.com",
        "market_cap": 503283296
    },
    "VLE.JO": {
        "short_name": "Value Group Ltd",
        "long_name": "Value Group Limited",
        "summary": "Value Group Limited, through its subsidiaries, provides supply chain solutions in South Africa. It operates through General Distribution, Truck Rental and Other, and Retail Logistics segments. The company offers distribution services, including express courier, breakbulk, retail delivery, DC delivery, front door delivery, home delivery, informal trade, forecourts, dangerous goods, over-border, cross-border, and reverse logistics services; and warehousing services, such as dedicated, multi-principal, transshipment, bonded, dangerous goods, managed solution, and value added services. It is also involved in the fleet management; materials handling and commercial vehicle rental and leasing; clearing and forwarding activities; and wholesale of various fast moving consumer goods to the convenience, formal, and informal sectors, which primarily includes independent traders, fuel forecourts, and small retailers. In addition, the company offers import and export services, such as international courier, container haulage, and intermodal services; and materials handling services that include rentals, FMLs, outright purchases, repairs and maintenance, spares accessories, and tires; transport services, which include truck rental, refrigerated fleet, film fleet, mine spec, FML, linehaul, and dedicated distribution services; and truck, trailer, and forklift repairs and maintenance services, as well as panel beating and branding services. It serves automotive, electronics, chemical, textile, packaging, mining, construction, telecommunications, and pharmaceutical industries. Value Group Limited was founded in 1981 and is headquartered in Isando, South Africa. Value Group Limited is a subsidiary of Lougot Property Investments (Pty) Ltd.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Isando",
        "zipcode": "1600",
        "website": "http://www.value.co.za",
        "market_cap": 958428032
    }
}