{"4HL.F": {"short_name": "VILMORIN+CIE.INH.EO 15,25", "long_name": "Vilmorin & Cie SA", "summary": "Vilmorin & Cie SA creates, produces, and sells vegetable and field seeds. It offers vegetable seeds, such as tomato, sweet and hot pepper, onion, watermelon, carrot, cucumber, melon, lettuce, cabbage, cauliflower, sweet corn, bean, summer squash, etc.; and field seeds for farmers, including corn, wheat, sunflower, rapeseed, barley, rice, soybean, millet, and pulses. The company also provides garden products comprising vegetable, flower, and lawn seeds, as well as related products, such as flower bulbs, potting soil, and garden equipment to gardeners. It operates in Europe, the Americas, Africa, the Middle East, Asia, and Oceania. The company was founded in 1742 and is headquartered in Paris, France. Vilmorin & Cie SA is a subsidiary of Groupe Limagrain Holding SA.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "FRA", "market": "dr_market", "country": "France", "city": "Paris"}, "5KI1.F": {"short_name": "KKO INTERNATIONAL  EO-,10", "long_name": "KKO International SA", "summary": "KKO International SA, through its subsidiary, cultivates, sells, and exports cocoa beans worldwide. The company is also involved in the cultivation of teak trees, yams, and manioc. As of December 31, 2017, it owned 2,580 hectares of land on which 800,000 cocoa trees are planted. The company was founded in 2010 and is based in Paris, France.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "FRA", "market": "dr_market", "country": "France", "city": "Paris"}, "ALAGR.PA": {"short_name": "AGROGENERATION", "long_name": "AgroGeneration SA", "summary": "AgroGeneration SA, an agricultural company, engages in grain and oil commodity crop farming primarily in Ukraine. The company's products include wheat, barley, and rapeseed. It operates approximately 58,000 hectares of farmland. The company was founded in 2007 and is based in Paris, France. AgroGeneration SA is a subsidiary of Konkur Investment Ltd.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Paris"}, "ALGEM.PA": {"short_name": "EUROGERM", "long_name": "Eurogerm SA", "summary": "Eurogerm SA engages in the research, development, manufacture, and marketing of milling correctors, breadmaking improvers, ingredients, and technological auxiliaries for the milling and bread making sectors in France. Its flour correctors comprise GERMIX correctors that help in adding quality and consistency to flour; GERMIX NOUVELLE RECOLTE correctors designed to facilitate the change-over to new wheats; nutritional correctors for enhancing the nutritional qualities of flour; and TRADIGERMIX correctors, which enhance the quality of flour used for making French bread. The company's bread improvers include ADDIGERM improvers for standard or special breads; supplementary improvers; ADDIGERM NUTRI improvers that enable the nutritional features of flour; and new technology improvers to address changes in the market and production methods. In addition, it provides specialty bread premixes; morning goods premix that is used to create ready to use flour mixes for making croissant or brioche type products; and concepts and custom premixes. Further, the company offers technological, taste color, typicity, and nutritional ingredients that are used in various foods, such as cereal bars, fruit juices, and yoghurts. Additionally, it provides various services, including analyses, diagnoses, applications, and recommendations; and advice on production and marketing, as well as certification and tracking, and customer support services. The company was founded in 1989 and is based in Saint-Apollinaire, France. Eurogerm SA is a subsidiary of Mobago SAS.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Saint-Apollinaire"}, "ALKKO.PA": {"short_name": "KKO INTERNATIONAL", "long_name": "KKO International SA", "summary": "KKO International SA, through its subsidiary, cultivates, sells, and exports cocoa beans worldwide. The company is also involved in the cultivation of teak trees, yams, and manioc. As of December 31, 2017, it owned 2,580 hectares of land on which 800,000 cocoa trees are planted. The company was founded in 2010 and is based in Paris, France.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Paris"}, "RIN.PA": {"short_name": "VILMORIN & CIE", "long_name": "Vilmorin & Cie SA", "summary": "Vilmorin & Cie SA creates, produces, and sells vegetable and field seeds. It offers vegetable seeds, such as tomato, sweet and hot pepper, onion, watermelon, carrot, cucumber, melon, lettuce, cabbage, cauliflower, sweet corn, bean, summer squash, etc.; and field seeds for farmers, including corn, wheat, sunflower, rapeseed, barley, rice, soybean, millet, and pulses. The company also provides garden products comprising vegetable, flower, and lawn seeds, as well as related products, such as flower bulbs, potting soil, and garden equipment to gardeners. It operates in Europe, the Americas, Africa, the Middle East, Asia, and Oceania. The company was founded in 1742 and is headquartered in Paris, France. Vilmorin & Cie SA is a subsidiary of Groupe Limagrain Holding SA.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "PAR", "market": "fr_market", "country": "France", "city": "Paris"}}