{"CPRIN.MX": {"short_name": "CAPRI HOLDINGS LTD", "long_name": "Capri Holdings Limited", "summary": "Capri Holdings Limited designs, markets, distributes, and retails branded women's and men's apparel, footwear, and accessories in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia. The company's Versace segment offers ready-to-wear, accessories, footwear, and home furnishings through a distribution network, including boutiques; and department and specialty stores, as well as through Versace e-commerce sites. It also licenses Versace brand name and trademarks to third parties to retail and/or wholesale its products; and has licensing agreements to the manufacture and sale of jeans, fragrances, watches, and eyewear. As of March 28, 2020, this segment operated 206 retail stores, including concessions; and 824 wholesale doors. Its Jimmy Choo segment sells luxury footwear, handbags, and small leather goods through directly operated Jimmy Choo stores; and Jimmy Choo e-commerce sites. It also licenses Jimmy Choo brand name and trademarks to third parties to retail and/or wholesale its products; and has licensing agreements to the manufacture and sale of fragrances, sunglasses, and eyewear. This segment operated 226 retail stores, including concessions; and 554 wholesale doors. The company's Michael Kors segment offers accessories, footwear, and apparel through retail stores, department stores, specialty stores, and select licensing partners, as well as through Michael Kors e-commerce sites. It also licenses Michael Kors brand name and trademarks to third parties to retail and/or wholesale its products; and has licensing agreements to the manufacture and sale of watches, jewelry, fragrances, and eyewear. This segment operated 839 retail stores, including concessions; and 2,982 wholesale doors. The company was formerly known as Michael Kors Holdings Limited and changed its name to Capri Holdings Limited in December 2018. The company was founded in 1981 and is based in London, the United Kingdom.", "currency": "MXN", "sector": "Consumer Goods", "industry": "Textile - Apparel Clothing", "exchange": "MEX", "market": "mx_market", "country": "United Kingdom", "city": "London"}, "IMBN.MX": {"short_name": "IMPERIAL BRANDS PLC", "long_name": "Imperial Brands PLC", "summary": "Imperial Brands PLC, together with its subsidiaries, manufactures, imports, markets, and sells tobacco and tobacco-related products. It offers a range of cigarettes, fine cut and smokeless tobacco, papers, and cigars; and next generation product (NGP) portfolio, such as e-vapour products, as well as oral nicotine and heated tobacco products. The company sells its products under various brands, including Davidoff, Gauloises, JPS, West, L&B, Bastos, Fine, Winston, News, Parker & Simpson, blu, Kool, Horizon, Jade, Cohiba, Montecristo, Romeo Y Julieta, Backwoods, Skruf, Golden Virginia, Rizla, and Knox in approximately 160 countries worldwide. It also provides logistics services that include the distribution of tobacco and NGP products for tobacco and NGP product manufacturers; and various non-tobacco and NGP products and services. In addition, the company is involved in the management of a golf course; marketing of papers; restaurant business; distribution of pharmaceuticals, POS software, and published materials and other products; printing and publishing activities; and provision of long haul transportation, industrial parcel and express delivery, advertising, and support management services. Further, it owns the trademarks; and retails its products. The company was formerly known as Imperial Tobacco Group PLC and changed its name to Imperial Brands PLC in February 2016. Imperial Brands PLC was founded in 1901 and is headquartered in Bristol, the United Kingdom.", "currency": "MXN", "sector": "Consumer Goods", "industry": "Tobacco Products, Other", "exchange": "MEX", "market": "mx_market", "country": "United Kingdom", "city": "Bristol"}, "RBN.MX": {"short_name": "RECKITT BENCKISER GROUP PLC", "long_name": "Reckitt Benckiser Group plc", "summary": "Reckitt Benckiser Group plc manufactures, markets, and sells health, hygiene, and home products. The company offers acne treatment creams, facial washes, and cleansing pads; disinfection, hygiene, and first aid products; condoms, sex toys, and lubricants; heartburn and indigestion solutions; and cough and chest congestion, multi-symptom, and sinus remedies for adults and children under the Clearasil, Dettol, Durex, Gaviscon, and Mucinex brands. It also provides analgesics; footcare and footwear products; sore throat medications; and women's beauty products under the Nurofen, Scholl, Strepsils, and Veet brand. In addition, the company offers fragrances and devices; water softeners; home cleaning products; dish washes; toilet bowl cleaners; disinfectants; sprays, baits, and plug-ins for pest control; stain removals; and fabric washing products under the Air Wick, Calgon, Cillit Bang, Finish, Harpic, Lysol, Mortein, Vanish, and Woolite brands, as well as infant and child nutrition products under the Enfamil and Nutramigen brands. It operates in the United States, Canada, Europe, Russia/CIS, Turkey, Israel, Australia, New Zealand, and internationally. The company was founded in 1823 and is headquartered in Slough, the United Kingdom.", "currency": "MXN", "sector": "Consumer Goods", "industry": "Personal Products", "exchange": "MEX", "market": "mx_market", "country": "United Kingdom", "city": "Slough"}}