{
    "000687.SZ": {
        "short_name": "HUAXUN FANGZHOU CO",
        "long_name": "Huaxun Fangzhou Co., Ltd.",
        "summary": "Huaxun Fangzhou Co., Ltd. provides military communication and other products. It offers multidimensional ad hoc network communication systems; multi-band, multi-caliber, and multi-purpose satellite communication antennas and BUC products; and simulation system products. In addition, the company provides information security intelligent penetration systems, information security attack and defense confrontation platforms, and firewall products; and combat management, military training management, electronic sandbox, gun and ammunition management, yingmen integrated management, equipment support management, equipment maintenance management, army vehicle integrated control, valuable and confidential item management, logistics integrated management, military food management, material management, patrol management, camp energy management, and intelligent visitor management systems, as well as military barracks and camp district intelligent security platforms. Further, it offers unmanned aerial vehicles; information security printing systems; optical waveguide products; radio monitoring systems, including wireless time difference positioning system, vehicle-mounted radio monitoring and direction finding system, portable radio monitoring equipment, PCI/PXI interface rugged computing product, and intelligent radio monitoring system; and measurement and control systems comprising laser spot detection recorder, portable testing equipment, and multi-channel data acquisition system, as well as missile, aircraft, and other test equipment. The company was formerly known as Swan Fiber Co., Ltd. and changed its name to Huaxun Fangzhou Co., Ltd. in October 2015. Huaxun Fangzhou Co., Ltd. is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "071055",
        "website": "http://www.huaxunchina.com.cn",
        "market_cap": "Small Cap"
    },
    "000738.SZ": {
        "short_name": "AECC AERO-ENGINE C",
        "long_name": "Aecc Aero-Engine Control Co.,Ltd.",
        "summary": "Aecc Aero-Engine Control Co.,Ltd. engages in the development, production, repair, and sale of aero-engine control systems and derivative products in China and internationally. The company also provides civil aviation control system precision parts for aviation companies. In addition, it offers non-aviation products, including power control systems, such as gas turbine, energy, and automotive automatic shift controls, as well as engineering and walking machinery, and other ancillary products. The company was formerly known as AVIC Aero-Engine Controls Co., Ltd. and changed its name to Aecc Aero-Engine Control Co.,Ltd. in April 2017. Aecc Aero-Engine Control Co.,Ltd. was founded in 1997 and is headquartered in Wuxi, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214063",
        "website": "http://www.aaec.com.cn",
        "market_cap": "Large Cap"
    },
    "000768.SZ": {
        "short_name": "AVIC XI'AN AIRCRA",
        "long_name": "AVIC Xi'an Aircraft Industry Group Company Ltd.",
        "summary": "AVIC Xi'an Aircraft Industry Group Company Ltd. researches, develops, manufactures, sells, maintains, and services aircraft and machine products. It offers large and medium sized military and civilian aircraft; and aircraft landing gear and wheel brake systems. The company was formerly known as AVIC AIRCRAFT Co., Ltd. and as AVIC Xi'an Aircraft Industry Group Company Ltd. The company is based in Xi'an, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710089",
        "website": "http://www.aircraft_co.avic.com",
        "market_cap": "Large Cap"
    },
    "002013.SZ": {
        "short_name": "AVIC ELECTROMECHAN",
        "long_name": "AVIC Electromechanical Systems Co.,Ltd.",
        "summary": "AVIC Electromechanical Systems Co., Ltd. manufactures and sells aviation products in the People's Republic of China. The company provides power, liquid energy, gas energy, and second power systems; equipment and personnel security subsystems; and special application task systems. It offers its products in aviation electromechanical, car carrier, refrigeration and medical device, and electric power equipment industries. The company was formerly known as Hubei Aviation Precision Machinery Technology Co., Ltd. and changed its name to AVIC Electromechanical Systems Co., Ltd. in February 2014. AVIC Electromechanical Systems Co., Ltd. was founded in 2000 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.avicem.com",
        "market_cap": "Large Cap"
    },
    "002023.SZ": {
        "short_name": "SICHUAN HAITE HIGH",
        "long_name": "Sichuan Haite High-tech Co., Ltd.",
        "summary": "Sichuan Haite High-tech Co., Ltd. provides aircraft airborne equipment maintenance services in China. It is also involved in aviation technology research and development, aviation product manufacturing, aviation training, aviation material maintenance, microelectronics, gas turbine engineering, and leasing activities. The company was founded in 1991 is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610000",
        "website": "http://www.schtgx.com",
        "market_cap": "Mid Cap"
    },
    "002977.SZ": {
        "short_name": "CHENGDU TIANJIAN T",
        "long_name": "Chengdu Tianjian Technology Co., Ltd.",
        "summary": "Chengdu Tianjian Technology Co., Ltd. researches in, develops, manufactures, and sells solid-state microwave front-end products. It offers solid-state transmitters for use in the defense military applications; phased array antennas for use in commercial satellites; radar systems, and other microwave components, such as microwave altimeter transmitter for sea surface height measurement and ocean observation through three-dimensional imaging. The company was founded in 2005 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610000",
        "website": "http://www.cdtjkj.com",
        "market_cap": "Mid Cap"
    },
    "002985.SZ": {
        "short_name": "BEIJING BEI MO GAO",
        "long_name": "Beijing Beimo High-tech Frictional Material Co.,Ltd",
        "summary": "Beijing Beimo High-tech Frictional Material Co., Ltd. engages in the research and development, production, and sale of equipment braking systems for the military industry. It offers dual channel digital anti-slip brake control system accessories; brake system attachments; digital anti-skid brake control modules; brake wheels and brakes; brake wheel assemblies; aircraft landing gears; high speed train brakes; powder metallurgy brake discs; brake discs; and carbon composite brake discs. The company's products are used in fighter aircraft, bombers, transport aircraft, trainers, military trade aircraft, helicopters, aerospace high-altitude aircraft and tanks, and armored vehicles and other military equipment. Beijing Beimo High-tech Frictional Material Co., Ltd. is based in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102206",
        "website": "http://www.bjgk.com",
        "market_cap": "Large Cap"
    },
    "003009.SZ": {
        "short_name": "SHAANXI ZHONGTIAN",
        "long_name": "Shaanxi Zhongtian Rocket Technology Co., Ltd",
        "summary": "Shaanxi Zhongtian Rocket Technology Co., Ltd researches and designs solid rockets and rocket engines in China. It offers automated launchers, 120 simulation training bombs, remote control ground flame spread systems, long March-2F simulation model, dongfeng-1 missile model, long March 3 carrier rocket model, electrical alloys, long-range single soldier forest fire-fighting systems, hygroscopic flame strips, thunder rockets, TWR01 weather radar systems, airborne flame spread systems, remote remote ground spreading systems, skyhawk IV weather rocket systems, rain-proof and anti-smashing rocket special storage cabinets, sub-mother rain-enhanced anti-smash rockets, and rain-enhanced and increasing anti-smash rockets. The company is based in Xian, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xian",
        "zipcode": "710025",
        "website": "http://www.zthj.com",
        "market_cap": "Mid Cap"
    },
    "0317.HK": {
        "short_name": "COMEC",
        "long_name": "CSSC Offshore & Marine Engineering (Group) Company Limited",
        "summary": "CSSC Offshore & Marine Engineering (Group) Company Limited operates in the shipbuilding industry. It designs, manufactures, and repairs ships, electrical and general machinery, and steel structures; manufactures equipment for railways, ships, aerospace, and other transportation facilities; repairs, debugs, and maintains shipboard equipment and systems; and produces and supplies liquefied petroleum. It also offers ship and metal structure design, engineering, and technical consulting; software, information technology, and transmission services; new energy engineering design and installation, consulting, research and development, and technology promotion services; sells new energy products and accessories; human resources development and management consulting; professional intermediary; labor dispatch; and personnel leasing, training, and recommendation services, as well as engages in the new energy investment, technology development, and application business. Further, it offers military ships, marine police equipment and public service ships, and shipbuilding and marine products, including feeder containerships, dredgers, and offshore engineering and wind power installation platforms; and energy equipment, construction machinery, environmental protection equipment, and industrial internet platforms, as well as metal and non-metallic shipbuilding; ship outfitting manufacture and installation; and ship conversion and removal services. It has operations in the People's Republic of China, other regions in Asia, Europe, Oceania, North America, Africa, and South America. The company was formerly known as Guangzhou Shipyard International Company Limited and changed its name to CSSC Offshore & Marine Engineering (Group) Company Limited in June 2015. The company was founded in 1954 and is headquartered in Guangzhou, the People's Republic of China. CSSC Offshore & Marine Engineering (Group) Company Limited is a subsidiary of China State Shipbuilding Corporation Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510250",
        "website": "http://comec.cssc.net.cn",
        "market_cap": "Large Cap"
    },
    "2357.HK": {
        "short_name": "AVICHINA",
        "long_name": "AviChina Industry & Technology Company Limited",
        "summary": "AviChina Industry & Technology Company Limited engages in the research, development, manufacture, and sale of civil aviation products and related engineering services. The company operates through three segments: Aviation Entire Aircraft Business, Aviation Ancillary System and Related Business, and Aviation Engineering Services Business. It is involved in the development, manufacture, sale, and upgradation of defense and civil aviation products, such as helicopters, trainer and general-purpose aircrafts, and regional jets; and manufacture and sale of aviation ancillary system products, including connectors, avionics products, and its accessories. The company also offers aviation, civil, and industrial construction marketing and project contracting services. In addition, the company engages in finance and investment, information consulting, and training and house rental activities. Further, it offers aviation engineering services, such as planning, design, consultation, construction, and operation, as well as develops, manufactures, remodels, and sells unmanned aerial vehicle products. The company was incorporated in 2003 and is based in Beijing, the People's Republic of China. AviChina Industry & Technology Company Limited is a subsidiary of Aviation Industry Corporation of China, Ltd.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100176",
        "website": "http://www.avichina.com",
        "market_cap": "Large Cap"
    },
    "300008.SZ": {
        "short_name": "BESTWAY MARINE & E",
        "long_name": "Bestway Marine & Energy Technology Co.,Ltd",
        "summary": "Bestway Marine & Energy Technology Co.,Ltd provides marine and offshore engineering research and design services in China. It offers marine and offshore engineering research and design services for merchants, passengers, public, and marine engineering ships, as well as marine engineering structures; marine and offshore engineering supervision and technical consultancy services; yacht design; and ship building engineering package contracting services, ship decoration, marine equipment import and export, logistics, etc. The company also manufactures and sells various ships, such as bulkers, boxships, tankers, gas carriers, RoRo ships, public use boats, steel yachts, offshore ships, platforms and platform modules, jack-up legs, jackets, and other steel constructions; offshore and petroleum-related equipment and pipeline robots; and furniture. In addition, it engages in the development of petroleum related inspection and anti-corrosion technology; design of municipal pipeline; provision of various services, such as general freight transportation, warehousing, logistics distribution, goods clearance, ship management, ship maintenance, crew training for LNG power ships, berth rental, yacht repairing and maintenance, yacht register, ship chartering, shipping consultancy, freight forwarding and shipment, seaman recruiting and management, and marine EMC services; interior decoration of yacht and luxury passenger ship, as well as other ship types; and decoration of high-end hotels and clubs. Further, the company is involved in the natural gas business; provision of optimized energy solutions and domestic shipping service; and operation of ecological farms, leisure tourism, yachts, clubs, and resort communities. The company was formerly known as Shanghai Bestway Marine Engineering Design Co., Ltd. and changed its name to Bestway Marine & Energy Technology Co.,Ltd in May 2016. The company was founded in 2001 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201612",
        "website": "http://www.bestwaysh.com",
        "market_cap": "Large Cap"
    },
    "300034.SZ": {
        "short_name": "BEIJING CISRI-GAON",
        "long_name": "Gaona Aero Material Co., Ltd.",
        "summary": "Gaona Aero Material Co., Ltd. engages in the research and development, production, and sale of high-temperature materials for use in the aerospace industry in China. The company offers cast, deformed, powder, and special alloy products, as well as high-purity high-strength special alloy products. Its products are also used in electric power, automotive, metallurgy, glass manufacturing, nuclear power, and other industrial fields. The company was formerly known as Beijing Cisri-Gaona Materials & Technology Co., Ltd. and changed its name to Gaona Aero Material Co., Ltd. in January 2020. Gaona Aero Material Co., Ltd. was founded in 2002 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100081",
        "website": "http://www.cisri-gaona.com.cn",
        "market_cap": "Large Cap"
    },
    "300053.SZ": {
        "short_name": "ZHUHAI ORBITA AERO",
        "long_name": "Zhuhai Orbita Aerospace Science & Technology Co., Ltd.",
        "summary": "Zhuhai Orbita Aerospace Science & Technology Co., Ltd. develops, produces, and sells aerospace electronic chips and electronic chip systems in China. The company's products include SOC, SIP, and EMBC chips; micro nano satellite constellation systems; satellite big data collecting and analyzing products; facial recognition and image processing products; artificial intelligence systems; avionics systems; and intelligent weapon systems. Its products are used in aerospace, aviation, industry control, territorial resources, municipal engineering, intelligent security, artificial intelligence, public consumption, and various other fields. The company was formerly known as Zhuhai Orbita Control Engineering Co., Ltd. and changed its name to Zhuhai Orbita Aerospace Science & Technology Co., Ltd. in September 2017. Zhuhai Orbita Aerospace Science & Technology Co., Ltd. was founded in 2000 and is based in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": "519080",
        "website": "http://www.myorbita.net",
        "market_cap": "Mid Cap"
    },
    "300324.SZ": {
        "short_name": "BEIJING WATERTEK I",
        "long_name": "Beijing Watertek Information Technology Co., Ltd.",
        "summary": "Beijing Watertek Information Technology Co., Ltd. operates in the software and information technology service industry in China. The company offers embedded system testing products, as well as technical support and consulting services; equipment integrated support products; communication and command systems; electronic component testing services; navigation systems; self-controlled embedded operating systems; integration systems; and radio frequency hybrid-signal chip design services. It also provides tax information products and services; smart-city intelligent equipment and information service platforms; IWhereLink, a multi-source data integration software; IWhereServer, a big data service software; IWhereVideo, a video-related big data grid management software; and IWhereGlobal, a 3D data ball software. The company was founded in 1997 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100094",
        "website": "http://www.watertek.com",
        "market_cap": "Mid Cap"
    },
    "300397.SZ": {
        "short_name": "XI'AN TIAN HE DEFE",
        "long_name": "Xi'an Tianhe Defense Technology Co., Ltd.",
        "summary": "Xi'an Tianhe Defense Technology Co., Ltd. engages in military equipment, smart security, integrated electronics, communication electronics, and smart coastal defense businesses in China and internationally. It offers short-range low-altitude three-dimensional defense equipment and digital system solutions, battlefield environment perception and big data application systems, training storage equipment, marine digital defense equipment and systems, underwater unmanned detection systems, digital oceans three-dimensional defense system, etc. The company also researches and develops reconnaissance and surveillance radars, photoelectric linkage detection equipment, terahertz security inspection equipment, intelligent sentries for border and coastal defense, and anti-UAV systems and other products. In addition, it provides digital and information solutions for three-dimensional security, such as border and coastal defense, and other areas. Further, the company offers communication electronics, such as chips for 5G applications comprising switches, LNAs, small signal amplifiers, and passive circulators, as well as integrates various sensors; and smart coastal defense products, including unmanned autonomous vehicle series products, multi-parameter detection systems, active and passive sonar, etc. Xi'an Tianhe Defense Technology Co., Ltd. was founded in 2001 and is based in Xi'an, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710119",
        "website": "http://www.thtw.com.cn",
        "market_cap": "Mid Cap"
    },
    "300424.SZ": {
        "short_name": "GUANGZHOU HANGXIN",
        "long_name": "Guangzhou Hangxin Aviation Technology Co., Ltd.",
        "summary": "Guangzhou Hangxin Aviation Technology Co., Ltd., an aviation technology oriented company, provides aircraft engineering and safety services in the People's Republic of China. It offers heavy and light maintenance, and component maintenance services; asset management services, such as aircraft project evaluation, asset disposal, aircraft teardown, design and manufacturing, engineering services, technical training, etc.; airborne equipment research and development; and aviation test equipment research and development. The company was founded in 1994 and is based in Guangzhou, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510663",
        "website": "http://www.hangxin.com",
        "market_cap": "Mid Cap"
    },
    "300581.SZ": {
        "short_name": "XI'AN CHENXI AVIAT",
        "long_name": "Xi'an ChenXi Aviation Technology Corp., Ltd.",
        "summary": "Xi'an ChenXi Aviation Technology Corp., Ltd. engages in the research and development, production, and sale of aviation mechanical and electrical products. The company offers aviation inertial navigation products, such as flexible, fiber, laser, and piezoelectric strapdown inertial integrated navigation system; navigation computer components; aero-engine electronic products: aero-engine parameter collectors; and aero-engine electronic control systems. It also provides unmanned aerial vehicles; and aviation related professional technical services. The company was founded in 2000 and is based in Xi'an, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiâ\u0080\u0099an",
        "zipcode": "710077",
        "website": null,
        "market_cap": "Mid Cap"
    },
    "300589.SZ": {
        "short_name": "JIANGLONG SHIPBUIL",
        "long_name": "Jianglong Shipbuilding Co., Ltd.",
        "summary": "Jianglong Shipbuilding Co., Ltd. designs and constructs customized commercial and defense vessels in China and internationally. The company's products include patrol boats and interceptors; passenger ferries and car ferries; sightseeing boats, such as fishing and cruise boats, and yachts; and work boats, including windfarm work boats, research and survey vessels, firefighting vessels, crew supply vessels, and pilot vessels. Jianglong Shipbuilding Co., Ltd. was founded in 2003 and is based in Zhongshan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhongshan",
        "zipcode": null,
        "website": "http://www.jianglong.cn",
        "market_cap": "Mid Cap"
    },
    "300719.SZ": {
        "short_name": "BEIJING ANDAWELL S",
        "long_name": "Beijing Andawell Science & Technology Co., Ltd.",
        "summary": "Beijing Andawell Science & Technology Co., Ltd. operates in the aviation industry in the People's Republic of China. It manufactures airborne equipment, such as pilot and passenger seats, aircraft interiors, galley and lavatory systems, and related products for helicopters and aircrafts for military and civil customers; airborne electronic equipment, including radio altimeters and automatic direction finders, multimode integrated navigation devices, aero inner communication systems, and integrated standby flight displays; and PMA products comprises of cabin and passenger reading lights, LED lights, LCD displays, and passenger control units, as well as ovens and water heaters. The company also provides airborne electronic and mechanical equipment maintenance services; testing solutions consisting of on-site testing and automatic test equipment, and vibration health monitoring systems; and aircrafts retrofits services. Beijing Andawell Science & Technology Co., Ltd. was founded in 2001 and is based in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101300",
        "website": "http://www.andawell.com",
        "market_cap": "Mid Cap"
    },
    "300722.SZ": {
        "short_name": "JIANGXI XINYU GUOK",
        "long_name": "Jiangxi Xinyu Guoke Technology Co., Ltd",
        "summary": "Jiangxi Xinyu Guoke Technology Co., Ltd manufactures and sells military products. It offers blasting and silhouette equipment, silhouette rockets, cannonball storage devices, meteorological special technical equipment, human shadow blasting equipment, Internet of Things management systems, artificial weathering operation command platforms, special machinery and equipment, special blasting equipment, and multi-function laser raindrop spectrometers. The company was founded in 2008 and is based in Xinyu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xinyu",
        "zipcode": "338018",
        "website": "http://www.jx9394.com",
        "market_cap": "Mid Cap"
    },
    "300775.SZ": {
        "short_name": "XI'AN TRIANGLE DEF",
        "long_name": "Xi'an Triangle Defense Co.,Ltd",
        "summary": "Xi'an Triangle Defense Co.,Ltd produces and sells airplane structure parts, engine discs, and large and medium-sized die forgings in China and internationally. It serves the aviation, aerospace, ships, weapons, and nuclear industries. The company is based in Xi'an, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710089",
        "website": "http://www.400mn.com",
        "market_cap": "Large Cap"
    },
    "300900.SZ": {
        "short_name": "GUANGLIAN AVIATION",
        "long_name": "Guanglian Aviation Industry Co., Ltd.",
        "summary": "Guanglian Aviation Industry Co., Ltd. engages in the design and manufacture of drones, aircraft parts, composite materials, and aviation technology equipment in China. The company offers composite molding materials and aircraft tooling assemblies, as well as aircraft components, and composite and spare parts. Its customers primarily include military units, engine manufacturers, scientific research institutes, scientific research production units, and military research institutes. The company was founded in 2011 and is based in Harbin, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": "150060",
        "website": "http://www.glavi.cn",
        "market_cap": "Mid Cap"
    },
    "300965.SZ": {
        "short_name": "BEIJING HENGYU DAT",
        "long_name": "Beijing Hengyu Datacom Aviation Equipment co., LTD",
        "summary": "Beijing Hengyu Datacom Aviation Equipment co., LTD provides airborne multi-function display equipment, airborne navigation equipment, airborne display modules, and visual navigation systems in China. The company was founded in 2002 and is based in Xi'an, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710065",
        "website": "http://www.bjhyxt.cn",
        "market_cap": "Mid Cap"
    },
    "600038.SS": {
        "short_name": "AVIC HELICOPTER CO LTD",
        "long_name": "Avicopter Plc",
        "summary": "Avicopter Plc manufactures and sells helicopters and fixed aircraft in China. The company offers Z9 helicopters, Y12 light and general aircraft, H425 helicopters, EC120/HC120 helicopters, and ultra-light and ERJ145 regional jet airplanes. It also provides delta winged aircraft with two seats and three seats. The company was formerly known as Hafei Aviation Industry Co., Ltd. and changed its name to Avicopter Plc in December 2014. Avicopter Plc is based in Harbin, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": "150066",
        "website": "http://www.hafeigroup.net",
        "market_cap": "Large Cap"
    },
    "600118.SS": {
        "short_name": "CHINA SPACESAT CO. LTD.",
        "long_name": "China Spacesat Co.,Ltd.",
        "summary": "China Spacesat Co.,Ltd. engages in the aerospace manufacturing and aerospace technology applications businesses in China and internationally. The company develops and sells small and micro satellites, such as CAST10, CAST20, CAST2000, CAST3000, CAST4000, and other small/small satellite public platforms. Its satellite products also include optical remote sensing, electromagnetic and microwave remote sensing, and science and technology testing products. In addition, the company is also involved in the integration of satellite ground application systems; and manufacture of terminal equipment and the provision of satellite operation services. Its products and services are used in the fields of communications, satellite navigation, satellite remote sensing, cloud computing and information security, and smart cities, as well as national defense and economic construction, social development, etc. The company operates under the Aerospace Dongfanghong, Aerospace Star, and Shenzhen Dongfanghong brand names. The company is based in Beijing, China. China Spacesat Co.,Ltd. is a subsidiary of China Aerospace Science and Technology Corporation.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100081",
        "website": "http://www.spacesat.com.cn",
        "market_cap": "Large Cap"
    },
    "600150.SS": {
        "short_name": "CHINA CSSC HOLDINGS LIMITED",
        "long_name": "China CSSC Holdings Limited",
        "summary": "China CSSC Holdings Limited engages in shipbuilding and repair businesses. The company also manufactures and sells marine high-power diesel engines; and provides marine engineering and other services. It operates in approximately 40 countries. The company is based in Shanghai, China. China CSSC Holdings Limited is a subsidiary of China State Shipbuilding Corporation.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200120",
        "website": "http://csscholdings.cssc.net.cn",
        "market_cap": "Large Cap"
    },
    "600316.SS": {
        "short_name": "JIANGXI HONGDU AVIATION INDUSTR",
        "long_name": "Jiangxi Hongdu Aviation Industry Co., Ltd.",
        "summary": "Jiangxi Hongdu Aviation Industry Co., Ltd. engages in the research and development, design, production, maintenance, sale, and service guarantee of trainer aircraft products in China and internationally. It also offers general aircraft, and other aviation products and parts. Jiangxi Hongdu Aviation Industry Co., Ltd. was founded in 1999 and is based in Nanchang, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330095",
        "website": "http://www.hongdu-aviation.com",
        "market_cap": "Large Cap"
    },
    "600372.SS": {
        "short_name": "CHINA AVIONICS SYSTEMS CO LTD",
        "long_name": "China Avionics Systems Co.,Ltd.",
        "summary": "China Avionics Systems Co.,Ltd. provides avionics system technology, products, and solutions for aircraft, engines, and defense systems in China. The company offers flight control, inertial navigation, flight attitude, aircraft parameter acquisition, air data, and aviation lighting systems; and control panel components and avionics related fields, such as dimming systems, flight warning systems, electric drive and control systems, flight indicating instruments, electrical controls, sensors, and sensitive components. In addition, the company offers non-aviation products, including electronic information, intelligent systems, electromechanical automation, and basic devices supporting system solutions, products and services. The company was formerly known as China AVIC Electronics Co., Ltd. and changed its name to China Avionics Systems Co.,Ltd. in April 2015. China Avionics Systems Co.,Ltd. was founded in 1999 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100028",
        "website": "http://www.aviconics.com.cn",
        "market_cap": "Large Cap"
    },
    "600391.SS": {
        "short_name": "AECC AERO SCIENCE AND TECHNOLOG",
        "long_name": "Aecc Aero Science and Technology Co.,Ltd",
        "summary": "Aecc Aero Science And Technology Co.,Ltd. engages in the research, manufacture, process, maintenance, and sale of aero engines and parts in China. The company also offers gas turbines and parts, bearings, mechanical equipment, environmental protection equipment, metal castings and forgings, metal products, burners, fuel gas appliances, textile machinery, medical and chemical machineries, and metal and non-metal surface treatment products. In addition, it provides enterprise management; conference and exhibition; stadium management; leisure and fitness; and mechanical equipment rental services, as well as designing, manufacturing, and technical consulting services of process equipment. Further, the company is involved in the project investment; wire and pipeline engineering construction; and real estate development, investment, and operation businesses. It also exports its products. The company was formerly known as Sichuan Chengfa Aero-Science & Technology Co,Ltd. and changed its name to Aecc Aero Science And Technology Co.,Ltd. in April 2017. Aecc Aero Science And Technology Co.,Ltd. was founded in 1999 and is headquartered in Chengdu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610503",
        "website": "http://ast.aecc.cn",
        "market_cap": "Mid Cap"
    },
    "600685.SS": {
        "short_name": "CSSC OFFSHORE & MARINE ENGINEER",
        "long_name": "CSSC Offshore & Marine Engineering (Group) Company Limited",
        "summary": "CSSC Offshore & Marine Engineering (Group) Company Limited operates in the shipbuilding industry. It designs, manufactures, and repairs ships, electrical and general machinery, and steel structures; manufactures equipment for railways, ships, aerospace, and other transportation facilities; repairs, debugs, and maintains shipboard equipment and systems; and produces and supplies liquefied petroleum. It also offers ship and metal structure design, engineering, and technical consulting; software, information technology, and transmission services; new energy engineering design and installation, consulting, research and development, and technology promotion services; sells new energy products and accessories; human resources development and management consulting; professional intermediary; labor dispatch; and personnel leasing, training, and recommendation services, as well as engages in the new energy investment, technology development, and application business. Further, it offers military ships, marine police equipment and public service ships, and shipbuilding and marine products, including feeder containerships, dredgers, and offshore engineering and wind power installation platforms; and energy equipment, construction machinery, environmental protection equipment, and industrial internet platforms, as well as metal and non-metallic shipbuilding; ship outfitting manufacture and installation; and ship conversion and removal services. It has operations in the People's Republic of China, other regions in Asia, Europe, Oceania, North America, Africa, and South America. The company was formerly known as Guangzhou Shipyard International Company Limited and changed its name to CSSC Offshore & Marine Engineering (Group) Company Limited in June 2015. The company was founded in 1954 and is headquartered in Guangzhou, the People's Republic of China. CSSC Offshore & Marine Engineering (Group) Company Limited is a subsidiary of China State Shipbuilding Corporation Limited.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510250",
        "website": "http://comec.cssc.net.cn",
        "market_cap": "Large Cap"
    },
    "600760.SS": {
        "short_name": "AVIC SHENYANG AIRCRAFT CO LTD",
        "long_name": "AVIC Shenyang Aircraft Company Limited",
        "summary": "AVIC Shenyang Aircraft Company Limited manufactures aviation products in China. It offers military and civil aviation products; and engineering machinery spring products, as well as provides aviation maintenance services. The company was formerly known as Zhonghangheibao Co.,Ltd. AVIC Shenyang Aircraft Company Limited is based in Shenyang, China. AVIC Shenyang Aircraft Company Limited operates as a subsidiary of Aviation Industry Corporation of China,Ltd..",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenyang",
        "zipcode": "110850",
        "website": "http://www.avic-sac.com",
        "market_cap": "Large Cap"
    },
    "600893.SS": {
        "short_name": "AECC AVIATION POWER CO LTD",
        "long_name": "Aecc Aviation Power Co.,Ltd",
        "summary": "AECC Aviation Power Co., Ltd develops, produces, and sells large and medium-sized military and civil aviation engines in the People's Republic of China. It also provides large-scale ship gas turbine power plant production and repair services. The company also offers non-aviation products, including solar power generation devices, industrial gas turbines, and energy saving and environmental protection devices. AECC Aviation Power Co., Ltd was formerly known as AVIC Aviation Engine Corporation PLC and changed its name to AECC Aviation Power Co., Ltd in March 2017. The company was founded in 1958 and is based in Xi'an, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710021",
        "website": "http://www.xaec.com",
        "market_cap": "Large Cap"
    },
    "601989.SS": {
        "short_name": "CHINA SHIPBUILDING INDUSTRY COR",
        "long_name": "China Shipbuilding Industry Company Limited",
        "summary": "China Shipbuilding Industry Company Limited engages in the shipbuilding and ship support, ship equipment, ship repair, marine engineering equipment, energy transportation equipment, and other businesses in China. It offers low-to-medium speed diesel products, propulsion and transmission devices, diesel engine components, deck and cabin machineries, and oil and sewage treatment equipment, as well as engages in marine casting and forging activities. The company is also involved in the research and development, manufacture, modification, and repair of oil tankers, container ships, bulk carriers, special vessels, and various other ships. In addition, it engages in marine engineering activities comprising drilling platforms, drilling vessels, FPSOs, offshore special vessels, various offshore modules, offshore facilities, offshore supporting equipment, and marine engineering equipment. Further, the company offers ship-borne weapons and equipment, which include diesel engine and components, ship-borne weapons launchers, and navigation devices for ships; and communication equipment, military reinforcement computers, and transmission devices for military ships. Additionally, it produces equipment in the energy transportation fields, such as wind power gear boxes, paddles, wind power yaw devices, nuclear power emergency generators, nuclear power plant water treatment systems, rail equipment, subway equipment, urban light rail equipment, railway wagons, engineering special vehicles, special trucks, and other transportation equipment. The company is based in Kunming, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": "100097",
        "website": "http://www.csicl.com.cn",
        "market_cap": "Large Cap"
    },
    "688586.SS": {
        "short_name": "HEFEI JIANGHANG AIRCRAFT EQUIPM",
        "long_name": "Hefei Jianghang Aircraft Equipment Corporation Ltd.",
        "summary": "Hefei Jianghang Aircraft Equipment Corporation Ltd. manufactures and sells aviation equipment for aerospace and defense sector in China. It offers aviation oxygen and airborne oil tank inertia protection systems, aircraft auxiliary fuel tanks, and other aviation products, as well as special refrigeration equipment. The company was founded in 2007 and is based in Hefei City, China. Hefei Jianghang Aircraft Equipment Corporation Ltd. is a subsidiary of AVIC Electromechanical Systems Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230051",
        "website": "http://www.jianghang.com",
        "market_cap": "Large Cap"
    },
    "AVT.F": {
        "short_name": "AVICHINA IND.+TECH. H YC1",
        "long_name": "AviChina Industry & Technology Company Limited",
        "summary": "AviChina Industry & Technology Company Limited engages in the research, development, manufacture, and sale of civil aviation products and related engineering services. The company operates through three segments: Aviation Entire Aircraft Business, Aviation Ancillary System and Related Business, and Aviation Engineering Services Business. It is involved in the development, manufacture, sale, and upgradation of defense and civil aviation products, such as helicopters, trainer and general-purpose aircrafts, and regional jets; and manufacture and sale of aviation ancillary system products, including connectors, avionics products, and its accessories. The company also offers aviation, civil, and industrial construction marketing and project contracting services. In addition, the company engages in finance and investment, information consulting, and training and house rental activities. Further, it offers aviation engineering services, such as planning, design, consultation, construction, and operation, as well as develops, manufactures, remodels, and sells unmanned aerial vehicle products. The company was incorporated in 2003 and is based in Beijing, the People's Republic of China. AviChina Industry & Technology Company Limited is a subsidiary of Aviation Industry Corporation of China, Ltd.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100176",
        "website": "http://www.avichina.com",
        "market_cap": "Mid Cap"
    },
    "B8O.F": {
        "short_name": "YANGZIJIANG SHIP.HLDGS",
        "long_name": "Yangzijiang Shipbuilding (Holdings) Ltd.",
        "summary": "Yangzijiang Shipbuilding (Holdings) Ltd., an investment holding company, operates in the shipbuilding activities in the People's Republic of China, Taiwan, Germany, Greece, Norway, Canada, Korea, Bahamas, other Asian and European countries, and internationally. The company operates through Shipbuilding, Investments, Trading, and Others segments. It produces a range of commercial vessels, such as containerships, dry bulk carriers, oil tankers, and liquefied natural gas (LNG) carriers. The company also engages in the production and processing of steel structures. In addition, it facilitates the sale and export of ships for the ship builder; trades in ship related equipment and shipbuilding related materials/supplies; provides microcredit to enterprises and individuals; and supplies marine equipment and materials, as well as engages in debt and other investment activities. Further, the company is involved in the supplying of gas; and ship demolition and vessel owning activities. The company was founded in 1956 and is based in Jingjiang, China.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Jingjiang",
        "zipcode": "214532",
        "website": "http://www.yzjship.com",
        "market_cap": "Mid Cap"
    },
    "BS6.SI": {
        "short_name": "YZJ Shipbldg SGD",
        "long_name": "Yangzijiang Shipbuilding (Holdings) Ltd.",
        "summary": "Yangzijiang Shipbuilding (Holdings) Ltd., an investment holding company, operates in the shipbuilding activities in the People's Republic of China, Taiwan, Germany, Greece, Norway, Canada, Korea, Bahamas, other Asian and European countries, and internationally. The company operates through Shipbuilding, Investments, Trading, and Others segments. It produces a range of commercial vessels, such as containerships, dry bulk carriers, oil tankers, and liquefied natural gas (LNG) carriers. The company also engages in the production and processing of steel structures. In addition, it facilitates the sale and export of ships for the ship builder; trades in ship related equipment and shipbuilding related materials/supplies; provides microcredit to enterprises and individuals; and supplies marine equipment and materials, as well as engages in debt and other investment activities. Further, the company is involved in the supplying of gas; and ship demolition and vessel owning activities. The company was founded in 1956 and is based in Jingjiang, China.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Jingjiang",
        "zipcode": "214532",
        "website": "http://www.yzjship.com",
        "market_cap": "Mid Cap"
    },
    "EH": {
        "short_name": "EHang Holdings Limited",
        "long_name": "EHang Holdings Limited",
        "summary": "EHang Holdings Limited operates as an autonomous aerial vehicle (AAV) technology platform company in the People's Republic of China, Europe, North America, West Asia, and internationally. It designs, develops, manufactures, sells, and operates AAVs, as well as their supporting systems and infrastructure for a range of industries and applications, including passenger transportation, logistics, smart city management, and aerial media solutions. The company was founded in 2014 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510700",
        "website": "http://www.ehang.com",
        "market_cap": "Small Cap"
    },
    "GSZ.F": {
        "short_name": "CSSC OFF.+MAR.ENG.GR.HYC1",
        "long_name": "CSSC Offshore & Marine Engineering (Group) Company Limited",
        "summary": "CSSC Offshore & Marine Engineering (Group) Company Limited operates in the shipbuilding industry. It designs, manufactures, and repairs ships, electrical and general machinery, and steel structures; manufactures equipment for railways, ships, aerospace, and other transportation facilities; repairs, debugs, and maintains shipboard equipment and systems; and produces and supplies liquefied petroleum. It also offers ship and metal structure design, engineering, and technical consulting; software, information technology, and transmission services; new energy engineering design and installation, consulting, research and development, and technology promotion services; sells new energy products and accessories; human resources development and management consulting; professional intermediary; labor dispatch; and personnel leasing, training, and recommendation services, as well as engages in the new energy investment, technology development, and application business. Further, it offers military ships, marine police equipment and public service ships, and shipbuilding and marine products, including feeder containerships, dredgers, and offshore engineering and wind power installation platforms; and energy equipment, construction machinery, environmental protection equipment, and industrial internet platforms, as well as metal and non-metallic shipbuilding; ship outfitting manufacture and installation; and ship conversion and removal services. It has operations in the People's Republic of China, other regions in Asia, Europe, Oceania, North America, Africa, and South America. The company was formerly known as Guangzhou Shipyard International Company Limited and changed its name to CSSC Offshore & Marine Engineering (Group) Company Limited in June 2015. The company was founded in 1954 and is headquartered in Guangzhou, the People's Republic of China. CSSC Offshore & Marine Engineering (Group) Company Limited is a subsidiary of China State Shipbuilding Corporation Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510250",
        "website": "http://comec.cssc.net.cn",
        "market_cap": "Mid Cap"
    },
    "YSHLF": {
        "short_name": "YANGZIJIANG SHIPBUILDING",
        "long_name": "Yangzijiang Shipbuilding (Holdings) Ltd.",
        "summary": "Yangzijiang Shipbuilding (Holdings) Ltd., an investment holding company, operates in the shipbuilding activities in the People's Republic of China, Taiwan, Germany, Greece, Norway, Canada, Korea, Bahamas, other Asian and European countries, and internationally. The company operates through Shipbuilding, Investments, Trading, and Others segments. It produces a range of commercial vessels, such as containerships, dry bulk carriers, oil tankers, and liquefied natural gas (LNG) carriers. The company also engages in the production and processing of steel structures. In addition, it facilitates the sale and export of ships for the ship builder; trades in ship related equipment and shipbuilding related materials/supplies; provides microcredit to enterprises and individuals; and supplies marine equipment and materials, as well as engages in debt and other investment activities. Further, the company is involved in the supplying of gas; and ship demolition and vessel owning activities. The company was founded in 1956 and is based in Jingjiang, China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Jingjiang",
        "zipcode": "214532",
        "website": "http://www.yzjship.com",
        "market_cap": "Mid Cap"
    }
}