{
    "000059.SZ": {
        "short_name": "NORTH HUAJIN CHEMI",
        "long_name": "North Huajin Chemical Industries Co.,Ltd",
        "summary": "North Huajin Chemical Industries Co.,Ltd provides petrochemicals, chemical fertilizers, road asphalt, and lube base oils in China. It also offers synthetic resins, organic chemical raw materials, and plastic products. The company was formerly known as Liaoning Hua Jin Tong Das Chemical Company Limited and it changed its name to North Huajin Chemical Industries Co.,Ltd in February 2014. North Huajin Chemical Industries Co.,Ltd was founded in 1996 and is headquartered in Panjin, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Panjin",
        "zipcode": "124021",
        "website": null,
        "market_cap": "Mid Cap"
    },
    "000408.SZ": {
        "short_name": "ZANGGE HOLDING CO",
        "long_name": "Zangge Holding Company Limited",
        "summary": "Zangge Holding Company Limited produces and sells potassium chloride under the Blue Sky brand in China. It also produces magnesium chloride under the Airline brand. The company was founded in 1996 and is based in Golmud City, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Golmud City",
        "zipcode": "610041",
        "website": "http://www.zanggegf.com",
        "market_cap": "Mid Cap"
    },
    "000422.SZ": {
        "short_name": "HUBEI YIHUA CHEM",
        "long_name": "Hubei Yihua Chemical Industry Co., Ltd.",
        "summary": "Hubei Yihua Chemical Industry Co., Ltd. manufactures and sells chemicals and fertilizers in China and internationally. The company offers liquid chlorine, industrial sodium hydroxide, high purity hydrochloric acid, and polyvinyl chlorides. It also manufactures, installs, and trades thermoelectric and chemical machinery products. The company was founded in 1977 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100070",
        "website": "http://www.hbyh.cn",
        "market_cap": "Small Cap"
    },
    "000553.SZ": {
        "short_name": "ADAMA LTD",
        "long_name": "ADAMA Ltd.",
        "summary": "ADAMA Ltd., together with its subsidiaries, operates as a crop protection company. The company operates through Crop Protection (Agro), and Intermediates and Ingredients segments. It develops, produces, and commercializes herbicides, insecticides, and fungicides for farmers to protect from weeds, insects, and diseases. The company also offers intermediate materials and ingredients, such as food additives, Lycopan, synthetic aromatic products, dietary supplements, food colors, texture and flavor enhancers, food fortification ingredients, and other chemicals. In addition, it provides fragrance products for perfume, cosmetics, body care, and detergents industries; industrial products; and consumer and professional solutions. Further, the company engages in the other non-material activities. It primarily operates in Europe, North America, Latin America, the Asia Pacific, India, the Middle East, and Africa. The company was formerly known as Hubei Sanonda Co., Ltd. and changed its name to ADAMA Ltd. in December 2018. The company was founded in 1945 and is headquartered in Beijing, China. ADAMA Ltd. is a subsidiary of Syngenta Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.adama.com",
        "market_cap": "Mid Cap"
    },
    "000731.SZ": {
        "short_name": "SICHUAN MEIFENG CH",
        "long_name": "Sichuan Meifeng Chemical Industry Co., Ltd.",
        "summary": "Sichuan Meifeng Chemical Industry Co., Ltd. manufactures and sells chemical fertilizers in China. It offers urea, compound fertilizer, melamine, diesel exhaust gas treatment, nitric acid, and ammonium nitrate; and plastic-woven products and heavy-duty film packaging bags, as well as woven products. The company is based in Deyang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Deyang",
        "zipcode": "618000",
        "website": "http://www.scmeif.com",
        "market_cap": "Small Cap"
    },
    "000902.SZ": {
        "short_name": "XINYANGFENG AGRICU",
        "long_name": "Xinyangfeng Agricultural Technology Co., Ltd.",
        "summary": "Xinyangfeng Agricultural Technology Co., Ltd., together with its subsidiaries, engages in the research, development, and production of fertilizers in China. Its products include ammonium acid phosphate and potassium sulfate compound fertilizers; controlled release, urea formaldehyde, water-soluble, nitro group, and organic and inorganic fertilizers; special, potassium, urine-based, tower, BB, and P series fertilizers; and superphosphate and bicarbonate fertilizers, as well as hydrochloric acid. It also exports its products. The company was formerly known as Hubei Xinyangfeng Fertilizer Co., Ltd. and changed its name to Xinyangfeng Agricultural Technology Co., Ltd. in May 2019. The company was founded in 1982 and is headquartered in Jingmen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jingmen",
        "zipcode": "448000",
        "website": "http://www.xinyf.com",
        "market_cap": "Mid Cap"
    },
    "000912.SZ": {
        "short_name": "SICHUAN LUTIANHU",
        "long_name": "Sichuan Lutianhua Company Limited",
        "summary": "Sichuan Lutianhua Company Limited produces and sells fertilizer and chemical products in China. Its fertilizer products include urea, compound fertilizer, modified ammonium nitrate for agricultural use, and urea ammonium nitrate solution. The company's chemical products comprise diesel exhaust fluid, ammonium nitrate, ammonium sulfate, industrial nitric acid, industrial methanol, dimethyl ether (DME), and dinitrogen tetroxide, as well as butanediol and fatty chemical products. It provides its products under the Gonglong and Tianhua brands, as well as Akang, Huaifeng, Jiuhe, Xiaoya, and Wangu brands. Further, the company is involved in the logistic transportation business comprising ship and truck transportation along Yangtze River; and provision of by-products of DME and methanol, such as oxygen and nitrogen. Sichuan Lutianhua Company Limited was founded in 1999 and is based in Luzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Luzhou",
        "zipcode": "646300",
        "website": "http://www.sclth.com",
        "market_cap": "Small Cap"
    },
    "000953.SZ": {
        "short_name": "GUANGXI HECHI CHEM",
        "long_name": "Guangxi Hechi Chemical Co., Ltd",
        "summary": "Guangxi Hechi Chemical Co., Ltd produces and sells fertilizers in China. Its products include urea, compound fertilizers, liquid carbon dioxide, and methanol, as well as ammonia and sulfur. The company was formerly known as Guangxi Hechi Nitrogen Fertilizer Plant. Guangxi Hechi Chemical Co., Ltd was founded in 1969 and is based in Hechi, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hechi",
        "zipcode": "547007",
        "website": "http://www.hechihuagong.com.cn",
        "market_cap": "Small Cap"
    },
    "002113.SZ": {
        "short_name": "HUNAN TIANRUN DIGI",
        "long_name": "Hunan Tianrun Digital Entertainment &Cultural Media Co.,Ltd.",
        "summary": "Hunan Tianrun Digital Entertainment &Cultural Media Co.,Ltd. manufactures and sells chemical fertilizers and chemical products in China. The company provides urea, liquid ammonia, methanol, agricultural-use ammonia bicarbonate, compound fertilizers, sulfur and crude methanol, and other products. It also manufactures and sells plastic packaging products. The company was formerly known as Hunan Tianrun Enterprises Holding Co., Ltd. and changed its name to Hunan Tianrun Digital Entertainment &Cultural Media Co.,Ltd. in July 2016. Hunan Tianrun Digital Entertainment &Cultural Media Co.,Ltd. is based in Yueyang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yueyang",
        "zipcode": "414000",
        "website": null,
        "market_cap": "Small Cap"
    },
    "002170.SZ": {
        "short_name": "SHENZHEN BATIAN EC",
        "long_name": "Shenzhen Batian Ecotypic Engineering Co., Ltd.",
        "summary": "Shenzhen Batian Ecotypic Engineering Co., Ltd. engages in the research, production, and sale of compound fertilizers in the People's Republic of China. It offers nitro phosphate fertilizers. The company was founded in 1989 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.batian.com.cn",
        "market_cap": "Small Cap"
    },
    "002215.SZ": {
        "short_name": "SHENZHEN NOPOSION",
        "long_name": "Shenzhen Noposion Agrochemicals Co.,Ltd",
        "summary": "Shenzhen Noposion Agrochemicals Co.,Ltd develops, produces and sells agricultural inputs. The company offers pesticide preparations and plant nutrition products; and professional agricultural services, including technical and personnel support, farming, financial, agricultural information, agricultural products supply chain, and other services, as well as sensors and actuators. It provides its products under the Nuopuxin, Rui Defeng, Standard, and Nuopuxin names. The company was founded in 1999 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518102",
        "website": "http://www.noposion.com",
        "market_cap": "Small Cap"
    },
    "002258.SZ": {
        "short_name": "LIER CHEMICAL CO",
        "long_name": "Lier Chemical Co.,LTD.",
        "summary": "Lier Chemical Co.,LTD. engages in the research and development, production, and sale of agrochemical products in the People's Republic of China and internationally. The company offers chloropyridine, organophosphate, sulphonylurea, and substituted urea type, as well as low-toxicity, low-residue safe pesticides. It also provides herbicides, including glufosinate-ammonium, diquat, flumioxazin, clodinafop-propargyl, clopyralid, fluroxypyr-meptyl, triclopyr, diuron, bensulfuron-methyl, linuron, pyrazosulfuron-ethyl, nicosulfuron, flufenacet, mefenacet, and quinclorac; fungicides, such as epoxiconazole, iprodione, and difenoconazole; and insecticides comprising chlorpyrifos and pyriproxyfen, as well as active pharmaceutical ingredients and preparations. In addition, the company offers chemical intermediates, including 2-chloropyridine; 2,3-dichloropyridine; 2,5-dichloropyridine; 2,6-dichloropyridine; 2,3,4-trichloropyridine; 2,3,5-trichloropyridine; 2,3,6-trichloropyridine; nitrapyrin; pentafluoropyridine; 2,3,5,6-tetrachloro-4-methylsulfonylpyridine; 6-chloropyridine-2-carbonitrile; 3,6-difluoropyridine-2-carboxylic acid; 2,2'-bipyridine; 2-chloro-4'-fluoroacetophenone; 2-chloro-2',4'-difluoroacetophenone; and 2-fluoro-3-nitrobenzoic acid. Further, its intermediates comprise (E)-4-(dimethylamino)but-2-enoic acid hydrochloride; 4,4'-dichloro-[3,3']bipyridinyl; clopyralid-methyl; methyl 3,4,6-trichloropicolinate; 2,4,5-trichloropyridine; 7-fluoro-6-nitro-4-hydroxyquinazoline; N-(3-chloro-4-fluorophenyl)-7-fluoro-6-nitroquinazolin-4-amine; 4-bromocrotonic acid; 4-N-(3-chloro-4-fluorophenyl)-7-[(3S)-oxolan-3-yl]oxyquinazoline-4,6-diamine; 2-amino-N-(2-chloro-6-methylphenyl)-1,3-thiazole-5-carboxamide; and 5-chloro-8-hydroxyquinoline. The company was founded in 1993 and is based in Mianyang, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Mianyang",
        "zipcode": null,
        "website": "http://www.lierchem.com",
        "market_cap": "Mid Cap"
    },
    "002274.SZ": {
        "short_name": "JIANGSU HUACHANG C",
        "long_name": "Jiangsu Huachang Chemical Co., Ltd.",
        "summary": "Jiangsu Huachang Chemical Co., Ltd. manufactures and sells agrochemicals, basic chemicals, fine chemicals, and biochemical products in China. Its products include compound fertilizers, carbamide, industrial sodium carbonate, ammonium chloride, liquid anhydrous ammonia, nitric acids, industrial methyl alcohol, sodium and potassium borohydride, trimethyl borate, hexamethyleneimine, 1,2-propanediol, light calcium silicate building blocks, and amino acids. The company was founded in 1970 and is headquartered in Zhangjiagang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhangjiagang",
        "zipcode": null,
        "website": "http://www.huachangchem.cn",
        "market_cap": "Small Cap"
    },
    "002391.SZ": {
        "short_name": "JIANGSU CHANGQING",
        "long_name": "Jiangsu Changqing Agrochemical Co., Ltd.",
        "summary": "Jiangsu Changqing Agrochemical Co., Ltd. manufactures and sells pesticides in China, Europe, the United States, and Southeast Asia. Its technical materials comprise fomesafen, acifluorfen, fluoroglycofen-ethyl, lactofen, clomazone, imazethapyr, bromoxynil octanoate, nicosulfuron, benazolin-ethyl, clethodim, tricyclazole, fenoxanil, imidacloprid, acetamiprid, diafenthiuron, mesotrione, s-metolachlor, clodinafop-propargyl, dicamba, indoxacarb, fipronil, thiamethoxam, indoxacarb technical concentrate, clethodim mother liquor, cyhalofop-butyl active compound, prosulfuron active compound, pretilachlor active compound, azoxystrobin active compound, glyphosate active compound, chlorpyrifos active compound, triazophos, dimethazone, and triasulfuron active compound materials; and formulations include insecticides, bactericides, and herbicides. The company is based in Yangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yangzhou",
        "zipcode": "225000",
        "website": "http://www.jscq.com",
        "market_cap": "Small Cap"
    },
    "002470.SZ": {
        "short_name": "KINGENTA ECOLOGIC",
        "long_name": "Kingenta Ecological Engineering Group Co., Ltd.",
        "summary": "Kingenta Ecological Engineering Group Co., Ltd. engages in the research, development, production, and sale of fertilizers in China and internationally. Its products include compound, slow/controlled-release, water soluble, bio, and other fertilizers; and chelated micronutrients. The company was founded in 1998 and is headquartered in Linshu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Linshu",
        "zipcode": "276700",
        "website": "http://www.kingenta.com",
        "market_cap": "Small Cap"
    },
    "002496.SZ": {
        "short_name": "JIANGSU HUIFENG BI",
        "long_name": "Jiangsu Huifeng Bio Agriculture Co., Ltd.",
        "summary": "Jiangsu Huifeng Bio Agriculture Co., Ltd. manufactures and sells pesticides in the People's Republic of China and internationally. It offers pesticide, fertilizer, seed, medicine, and fine chemicals. The company was formerly known as Jiangsu Huifeng Agrochemical Co., Ltd. and changed its name to Jiangsu Huifeng Bio Agriculture Co., Ltd. in August 2017. Jiangsu Huifeng Bio Agriculture Co., Ltd. was founded in 1989 and is based in Yancheng, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yancheng",
        "zipcode": "224100",
        "website": "http://www.hfagro.com",
        "market_cap": "Small Cap"
    },
    "002513.SZ": {
        "short_name": "JIANGSU LANFENG BI",
        "long_name": "Jiangsu Lanfeng Bio-chemical Co.,Ltd",
        "summary": "Jiangsu Lanfeng Bio-chemical Co.,Ltd researches, develops, produces, and sells pesticides, fungicides, insecticides, herbicides, and fine chemical intermediates in China and internationally. It offers thiophanate-methyl, cyclohexazone, benomyl, and carbendazim. The company is based in Xinyi, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xinyi",
        "zipcode": null,
        "website": "http://www.jslanfeng.com",
        "market_cap": "Small Cap"
    },
    "002538.SZ": {
        "short_name": "ANHUI SIERTE FERTI",
        "long_name": "Anhui Sierte Fertilizer industry LTD. ,company",
        "summary": "Anhui Sierte Fertilizer industry LTD. ,company produces and sells chemical fertilizers in China. It offers phosphate compound fertilizers, slow and controlled release fertilizers, soil testing formula fertilizers, ecological fertilizers, and inorganic fertilizers. The company is headquartered in Ningguo, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningguo",
        "zipcode": null,
        "website": "http://www.sierte.com",
        "market_cap": "Small Cap"
    },
    "002539.SZ": {
        "short_name": "CHENGDU WINTRUE HO",
        "long_name": "Chengdu Wintrue Holding Co., Ltd.",
        "summary": "Chengdu Wintrue Holding Co., Ltd., together with its subsidiaries, manufactures and supplies chemicals in China and internationally. The company offers NPK fertilizers, soda ash, ammonium chloride, anhydrous sodium sulphate, and edible and industrial salts, as well as other products, including urea. The company was formerly known as Shindoo Chemi-Industry Co.,Ltd and changed its name to Chengdu Wintrue Holding Co., Ltd. in September 2016. Chengdu Wintrue Holding Co., Ltd. was founded in 1995 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610599",
        "website": "http://www.wintrueholding.com",
        "market_cap": "Small Cap"
    },
    "002556.SZ": {
        "short_name": "ANHUI HUILONG AGRI",
        "long_name": "Anhui Huilong Agricultural Means of Production Co.,Ltd.",
        "summary": "Anhui Huilong Agricultural Means of Production Co.,Ltd. provides fertilizers, pesticides, and seeds in China and internationally. It supplies its products through a network of distribution centers and 2,800 franchise stores. The company was founded in 2004 and is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230022",
        "website": "http://www.ahamp.com",
        "market_cap": "Small Cap"
    },
    "002734.SZ": {
        "short_name": "LIMIN CHEMICAL CO",
        "long_name": "Limin Group Co., Ltd.",
        "summary": "Limin Group Co., Ltd. researches, develops, manufactures, and markets fungicides and other pesticides in China. The company offers various pesticide technical materials and preparations, such as mancozeb, cymoxanil, fosetyl-aluminum, propineb, pyrimethanil, propiconazole, difenoconazole, chlorothalonil, thiacloprid, metham sodium, Zineb, etc. It sells its products in approximately 70 countries and regions. The company was formerly known as Limin Chemical Co., Ltd. and changed its name to Limin Group Co., Ltd. in January 2020. Limin Group Co., Ltd. is headquartered in Xinyi, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xinyi",
        "zipcode": "221400",
        "website": "http://www.chinalimin.com",
        "market_cap": "Small Cap"
    },
    "002749.SZ": {
        "short_name": "SICHUAN GUOGUANG A",
        "long_name": "Sichuan Guoguang Agrochemical Co., Ltd.",
        "summary": "Sichuan Guoguang Agrochemical Co., Ltd. engages in the research and development, manufacture, marketing, and distribution of agrochemical products and materials in China. Its products include plant growth regulators, fertilizers, fungicides, insecticides, bio-pesticide, and herbicides. The company was founded in 1984 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610100",
        "website": "http://www.scggic.com",
        "market_cap": "Small Cap"
    },
    "002942.SZ": {
        "short_name": "ZHEJIANG XINNONG C",
        "long_name": "Zhejiang XinNong Chemical Co.,Ltd.",
        "summary": "Zhejiang XinNong Chemical Co.,Ltd. researches, develops, produces, and sells pesticides and pharmaceutical intermediates in China. It also exports its products to Southeast Asia, Europe, the United States, Australia, and Africa. The company was founded in 1981 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310003",
        "website": "http://www.xnchem.com",
        "market_cap": "Small Cap"
    },
    "002999.SZ": {
        "short_name": "GUANGDONG TIANHE A",
        "long_name": "Guangdong Tianhe Agricultural Means of Production Co., Ltd.",
        "summary": "Guangdong Tianhe Agricultural Means of Production Co., Ltd. provides crop solutions and agricultural products. The company sells nitrogenous and potash fertilizers, agri-chemicals, and seeds, as well as engages in warehousing and logistics activities. Its agri-chemicals include public health pesticides, seed dressing agents, preservation agents, original drugs, herbicides, fungicides, and pesticides; and fertilizers comprise foliar, specialty fertilizers, blends, NPK, potash, and urea. The company is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510080",
        "website": "http://gd-tianhe.com",
        "market_cap": "Small Cap"
    },
    "1103.HK": {
        "short_name": "DASHENG AGR FIN",
        "long_name": "Shanghai Dasheng Agriculture Finance Technology Co., Ltd.",
        "summary": "Shanghai Dasheng Agriculture Finance Technology Co., Ltd., together with its subsidiaries, researches, develops, produces, and markets pesticides and other agricultural material products in the People's Republic of China and Hong Kong. It operates through four segments: Agricultural and petrochemical products supply chain services, Financial Leasing and Commercial Factoring, Agricultural Big-Data Services, and Agrochemical Products Supply Chain Services. The company offers petrochemical and agricultural products, including chemical fertilizers, fuel oil, mixed aromatics, and white sugar, as well as food and frozen products; and financial leasing and commercial factoring services. It also provides agricultural big-data services, such as software related services; and collection and transportation, and other services comprising installation and technical support for payment platform systems. In addition, the company produces and sells pesticides and chemical products. Further, it engages in the construction of roads and bridges; provision of cold chain, logistics, trading, invest management, materials and on-site inspection services; construction, engineering, trading, and sales of building materials; and research and development of various synthetic materials. The company was formerly known as Shanghai Tonva Petrochemical Co., Ltd. and changed its name to Shanghai Dasheng Agriculture Finance Technology Co., Ltd. in January 2016. The company was founded in 1993 and is based in Shanghai, the People's Republic of China. Shanghai Dasheng Agriculture Finance Technology Co., Ltd. is a subsidiary of Shenzhen Dasheng Agricultural Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200030",
        "website": "http://www.dsgd-sh.co",
        "market_cap": "Small Cap"
    },
    "1866.HK": {
        "short_name": "CHINA XLX FERT",
        "long_name": "China XLX Fertiliser Ltd.",
        "summary": "China XLX Fertiliser Ltd., an investment holding company, engages in the development, manufacture, sale, and trade of urea primarily in Mainland China. It also offers compound fertilizers, methanol, liquid ammonia, dimethyl ether, melamine, furfuryl alcohol, furfural, humic acid, 2-methylfuran, vehicles urea solutions, and related differentiated products, as well as pharmaceutical intermediates. In addition, it mines and sells coal; and distributes and sells electricity. Further, the company is involved in the testing of equipment; manufacture and trading of gas; agricultural production activities; international business and trading activities; technological development business; manufacture and trading of intelligent equipment; and manufacture and trading of medical intermediates. China XLX Fertiliser Ltd. was founded in 1969 and is headquartered in Xinxiang, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Xinxiang",
        "zipcode": "453731",
        "website": "http://www.chinaxlx.com.hk",
        "market_cap": "Small Cap"
    },
    "200553.SZ": {
        "short_name": "ADAMA LTD",
        "long_name": "ADAMA Ltd.",
        "summary": "ADAMA Ltd., together with its subsidiaries, operates as a crop protection company. The company operates through Crop Protection (Agro), and Intermediates and Ingredients segments. It develops, produces, and commercializes herbicides, insecticides, and fungicides for farmers to protect from weeds, insects, and diseases. The company also offers intermediate materials and ingredients, such as food additives, Lycopan, synthetic aromatic products, dietary supplements, food colors, texture and flavor enhancers, food fortification ingredients, and other chemicals. In addition, it provides fragrance products for perfume, cosmetics, body care, and detergents industries; industrial products; and consumer and professional solutions. Further, the company engages in the other non-material activities. It primarily operates in Europe, North America, Latin America, the Asia Pacific, India, the Middle East, and Africa. The company was formerly known as Hubei Sanonda Co., Ltd. and changed its name to ADAMA Ltd. in December 2018. The company was founded in 1945 and is headquartered in Beijing, China. ADAMA Ltd. is a subsidiary of Syngenta Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.adama.com",
        "market_cap": "Mid Cap"
    },
    "300189.SZ": {
        "short_name": "HAINAN SHENNONG TE",
        "long_name": "Hainan Shennong Technology Co., Ltd.",
        "summary": "Hainan Shennong Technology Co., Ltd. engages in the breeding, production, and sale of hybrid rice seeds in China. It also technical services for hybrid rice seeds. The company was formerly Hainan Shennong Technology Co., Ltd. Hainan Shennong Technology Co., Ltd. was founded in 2000 and is based in Haikou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Haikou",
        "zipcode": "570125",
        "website": "http://www.sndf.com.cn",
        "market_cap": "Small Cap"
    },
    "300387.SZ": {
        "short_name": "HUBEI FORBON TECHN",
        "long_name": "Hubei Forbon Technology Co.,Ltd.",
        "summary": "Hubei Forbon Technology Co.,Ltd. researches, develops, produces, and sells fertilizer additives worldwide. The company offers fertilizer auxiliary products, including anti-caking agents, parcels, phosphate ore flotation and energy saving products, granulation improvers, sustained release materials, calcium activated loosening agents, and corrosion inhibitors, as well as slow release materials for fertilizers. It has operations in China, Malaysia, the Philippines, Indonesia, Vietnam, Taiwan, etc. The company is based in Yingcheng, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yingcheng",
        "zipcode": "432400",
        "website": "http://www.forbon.com",
        "market_cap": "Small Cap"
    },
    "300505.SZ": {
        "short_name": "KUNMING CHUAN JIN",
        "long_name": "Kunming Chuan Jin Nuo Chemical Co., Ltd.",
        "summary": "Kunming Chuan Jin Nuo Chemical Co., Ltd. produces and sells phosphate products in China. The company's products include feed grade phosphate, fertilizer grade phosphate, and industrial grade phosphoric acid and fine phosphates, as well as iron concentrate powder. Kunming Chuan Jin Nuo Chemical Co., Ltd. was founded in 2005 and is based in Kunming, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": "654100",
        "website": "http://www.cjnphos.com",
        "market_cap": "Small Cap"
    },
    "3983.HK": {
        "short_name": "CHINA BLUECHEM",
        "long_name": "China BlueChemical Ltd.",
        "summary": "China BlueChemical Ltd., together with its subsidiaries, develops, manufactures, and sells mineral fertilizers and chemical products in the People's Republic of China and internationally. The company operates through Urea, Phosphorus and Compound Fertiliser, Methanol, and Others segments. It offers urea; mono-ammonium phosphate, di-ammonium phosphate, and compound fertilizers; methanol; and bulk blending fertilizers, and polyformaldehyde and woven plastic bags. The company is also involved in the trading of fertilizers and chemicals; mining, processing, manufacturing, and selling of phosphate; port operations; and provision of preparatory work for methanol and dimethyl-ether projects. In addition, it offers transportation and overseas shipping services; and manufactures and sells acrylonitrile and methyl methacrylate. The company was formerly known as CNOOC Chemical Limited and changed its name to China BlueChemical Ltd. in April 2006. The company was founded in 2000 and is headquartered in Beijing, the People's Republic of China. China BlueChemical Ltd. is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.chinabluechem.com.cn",
        "market_cap": "Small Cap"
    },
    "39O1.SG": {
        "short_name": "Origin Agritech Ltd. Registered",
        "long_name": "Origin Agritech Limited",
        "summary": "Origin Agritech Limited, together with its subsidiaries, operates an agricultural biotechnology and an e-commerce platform in the People's Republic of China. The company engages in crop seed breeding and genetic improvement activities. It develops, produces, and distributes hybrid crop seeds, as well as develops hybrid seed technology. The company also operates an e-commerce platform, which provides range of products, including agricultural seed products that comprise corn, rice, and vegetable seeds; other agricultural inputs, such as fertilizers and agricultural chemicals; foods; household products; and other consumer products to farmers through online and mobile ordering. Origin Agritech Limited was founded in 1997 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102206",
        "website": "http://www.originseed.com.cn",
        "market_cap": "Small Cap"
    },
    "600096.SS": {
        "short_name": "YUNNAN YUNTIANHUA CO LTD",
        "long_name": "Yunnan Yuntianhua Co., Ltd.",
        "summary": "Yunnan Yuntianhua Co., Ltd. manufactures and distributes chemical fertilizers and chemical materials in China. The company provides fertilizers, such as phosphate fertilizer, nitrogen fertilizer, and copolymerized formaldehyde; and fertilizer products including monoammonium phosphate, diammonium phosphate, urea, and compound fertilizer, as well as mines phosphate. It also offers chemical products, including yellow phosphorus, thermal phosphoric acid, sodium tripolyphosphate, electronic grade phosphoric acid, and calcium hydrogen phosphate. In addition, the company produces polyoxymethylene, an engineering plastic. Further, it provides trade and logistics for chemical raw materials, agricultural products, fertilizers, and other agricultural commodities through road, rail, and waterways. Additionally, the company offers agriculture finance and loans for agricultural material. The company serves agriculture, industrial, and food sectors. Yunnan Yuntianhua Co., Ltd. was founded in 1997 and is based in Kunming, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": null,
        "website": "http://www.yyth.com.cn",
        "market_cap": "Mid Cap"
    },
    "600226.SS": {
        "short_name": "ZHEJIANG HUGE LEAF CO LTD",
        "long_name": "Zhejiang Hugeleaf Co.,Ltd.",
        "summary": "Zhejiang Hugeleaf Co.,Ltd. researches, develops, manufactures, and sells biological veterinary drugs, feed additives, biological pesticides, pharmaceutical intermediates, and food additives in China. It engages in the research and development of online games; and investment, production, distribution, and artist brokerage of derivative films, such as TV dramas, TV dramas, online dramas, etc. The company is also involved in sports and big data research activities. The company was formerly known as Zhejiang Shenghua Biok Biology Co., Ltd. and changed its name to Zhejiang Huge Leaf Co., Ltd. in May 2017. Zhejiang Huge Leaf Co., Ltd. is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200125",
        "website": "http://www.hugeleafgroup.com",
        "market_cap": "Small Cap"
    },
    "600227.SS": {
        "short_name": "GUIZHOU SALVAGE PHARMACEUTICAL ",
        "long_name": "Guizhou Salvage Pharmaceutical Co.,Ltd.",
        "summary": "Guizhou Salvage Pharmaceutical Co.,Ltd. primarily produces and sells urea in China. It offers nitrogenous fertilizer, phosphate fertilizer, compound fertilizer, synthetic ammonia, sulfur, and other chemical products and raw materials; fine chemical products; industrial hydrogen; and packing bags and plastic sheets. The company also purchases and sells methanol, dimethyl ether, hydrogen peroxide, formaldehyde, sodium hydroxide, sodium carbonate, and N-methyl-pyrrolidone. It offers urea under the Red brand. Guizhou Salvage Pharmaceutical Co.,Ltd. was founded in 1998 and is based in Guiyang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guiyang",
        "zipcode": "550008",
        "website": "http://www.chth.com.cn",
        "market_cap": "Small Cap"
    },
    "600228.SS": {
        "short_name": "JIANGXI FANLI DIGITAL TECHNOLOG",
        "long_name": "Jiangxi Fanli Digital Technology Co., Ltd",
        "summary": "Fanli Inc. operates Fanli.com, an e-commerce shopping guide in China. Its website includes various home appliance business websites, including e-commerce company's websites. The company allows users to clicks on the rebate link to go to the corresponding merchant website to place an order and the merchant will pay a rebate for the user's order for a marketing fee. Fanli Inc. was founded in 2006 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.fanli.com",
        "market_cap": "Small Cap"
    },
    "600230.SS": {
        "short_name": "CANGZHOU DAHUA CO LTD",
        "long_name": "Cangzhou Dahua Co., Ltd.",
        "summary": "Cangzhou Dahua Co., Ltd., together with its subsidiaries, produces and sells chemical fertilizers and carbimides in China. It offers synthetic ammonia, urea, hydrochloric acid, toluene-diisocyanate, and concentrated nitric acid. The company also exports its products to Southeast Asia, Japan, and South Korea. Cangzhou Dahua Co., Ltd. was founded in 1974 and is based in Cangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Cangzhou",
        "zipcode": "061000",
        "website": "http://www.czdh.chemchina.com/czdhen/cpyfw/gscp/webinfo/2012/08/1345169337774222.htm",
        "market_cap": "Small Cap"
    },
    "600389.SS": {
        "short_name": "NANTONG JIANGSHAN AGROCHEMICAL",
        "long_name": "Nantong Jiangshan Agrochemical & Chemicals Co.,Ltd.",
        "summary": "Nantong Jiangshan Agrochemical & Chemicals Co.,Ltd. engages in the production and marketing of agrochemicals, resins, chlorine-caustic sodium, and fine chemicals in China. The company offers herbicides, including glyphosate, alachlor, acetochlor, butachlor, butachlor+propanil, quizalofop-p-ethyl, and metolachlor; insecticides, such as dichlorvos, trichlorphon, diazion, nitenpyram, and imidaclothiz; and fungicides comprising prochloraz and prochloraz manganese complex products. It also provides intermediate products consisting of chloral, phosphorus acid, trimethyl and dimethyl phosphite, phosphorus trichloride, PMIDA, paraformaldehyde, and chlormethane; and microporous insulating board and nanometer aluminum oxide materials. The company also exports its products to 40 countries and regions in Asia, Europe, the United States, and Africa. Nantong Jiangshan Agrochemical & Chemicals Co.,Ltd. is based in Nantong, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nantong",
        "zipcode": null,
        "website": "http://www.jsac.com.cn",
        "market_cap": "Small Cap"
    },
    "600423.SS": {
        "short_name": "LIUZHOU CHEMICAL INDUSTRY CO",
        "long_name": "Liuzhou Chemical Industry Co., Ltd.",
        "summary": "Liuzhou Chemical Industry Co., Ltd. produces and sells chemical fertilizers in China. Its principal products include synthetic ammonia, concentrated nitric acid, ammonium nitrate, urea, methanol, hydrogen peroxide, nitro compound fertilizers, industrial formaldehyde, sodium hydrosulfite, and others. The company also exports its products to Vietnam, Indonesia, Malaysia, Europe, the United States, Japan, etc. Liuzhou Chemical Industry Co., Ltd. was founded in 1967 and is based in Liuzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Liuzhou",
        "zipcode": "545002",
        "website": "http://www.lzhg.cn",
        "market_cap": "Small Cap"
    },
    "600426.SS": {
        "short_name": "SHANDONG HUALU-HENGSHENG CHEMIC",
        "long_name": "Shandong Hualu-Hengsheng Chemical Co., Ltd.",
        "summary": "Shandong Hualu-Hengsheng Chemical Co., Ltd. manufactures and sells chemical products worldwide. The company offers ammonia alcohol, compound fertilizers, water-soluble fertilizers, mixed methylamine, acetic acid, nitric acid, adipic acid, polyol, ethylene glycol, melamine, formaldehyde, acetic anhydride, and industrial gases. Shandong Hualu-Hengsheng Chemical Co., Ltd. was founded in 2000 and is based in Dezhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dezhou",
        "zipcode": "253024",
        "website": "http://www.hl-hengsheng.com",
        "market_cap": "Mid Cap"
    },
    "600470.SS": {
        "short_name": "ANHUI LIUGUO CHEMICAL CO",
        "long_name": "Anhui Liuguo Chemical Co., Ltd.",
        "summary": "Anhui Liuguo Chemical Co., Ltd., together with its subsidiaries, produces and sells fertilizers in China and internationally. The company offers phosphorus compound fertilizers, fine phosphorus chemicals, synthetic ammonia, soil conditioner, and methanol products. It sells its products under the Shi Da Zhuang, Six Kingdoms, Huai Hai, six Swiss, Six Star, six fat baby, LANDGREEN, and other trademarks. The company is based in Tongling, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tongling",
        "zipcode": "244023",
        "website": "http://www.liuguo.com",
        "market_cap": "Small Cap"
    },
    "600486.SS": {
        "short_name": "JIANGSU YANGNONG CHEMICAL CO LT",
        "long_name": "Jiangsu Yangnong Chemical Co., Ltd.",
        "summary": "Jiangsu Yangnong Chemical Co., Ltd. produces and sells pesticides in China. It provides pyrethroids for use in health and agricultural applications. The company also exports its products. Jiangsu Yangnong Chemical Co., Ltd. was founded in 1999 and is based in Yangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yangzhou",
        "zipcode": "225009",
        "website": "http://www.yngf.com",
        "market_cap": "Mid Cap"
    },
    "600538.SS": {
        "short_name": "BEIHAI GOFAR CHUANSHAN BIOLOGIC",
        "long_name": "Beihai Gofar Chuanshan Biological Co., Ltd.",
        "summary": "Beihai Gofar Marine Biological Industry Co., Ltd. engages in the production and distribution of pharmaceutical products in China. The company offers various medicines and medical devices; and produces and sells pearl eyesight eye drops, gastrointestinal granules, pearl powder, and other proprietary Chinese medicines. It also provides molecular medical imaging and tumor radiotherapy centers, as well as tumor telemedicine technical services. Beihai Gofar Marine Biological Industry Co., Ltd. was founded in 1993 is based in Beihai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beihai",
        "zipcode": "536000",
        "website": "http://www.gofar.com.cn",
        "market_cap": "Small Cap"
    },
    "600596.SS": {
        "short_name": "ZHEJIANG XINAN CHEMICAL INDUSTR",
        "long_name": "Zhejiang Xinan Chemical Industrial Group Co.,Ltd",
        "summary": "Zhejiang Xinan Chemical Industrial Group Co.,Ltd manufactures and sells crop protection products and organosilicon materials in China and internationally. The company provides agrochemicals, such as glyphosate, glyphosate ammonium salt, glyphosate IPA salt, glyphosate potassium salt, glyphosate dimethylamine salt, glyphosate complex formulation, diuron, carbendazim, glufosinate-ammonium, quinclorac, and chlorpyrifos. It also offers silicon products, including basic polydimethylsiloxane, chlorosilane, high consistency silicone rubber, liquid silicone rubber, silane, silicone additive, silicone sealant, and siloxane intermediate. The company serves customers in agricultural production, biotechnology, aeronautics and astronautics, health care and medication, building materials, electronic and electric, and new energy industries. Zhejiang Xinan Chemical Industrial Group Co.,Ltd was founded in 1965 and is based in Jiande, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiande",
        "zipcode": "311600",
        "website": "http://www.wynca.com",
        "market_cap": "Mid Cap"
    },
    "600727.SS": {
        "short_name": "SHANDONG LUBEI CHEMICAL CO",
        "long_name": "Shandong Lubei Chemical Co., Ltd.",
        "summary": "Shandong Lubei Chemical Co., Ltd. produces and sells various fertilizers and chemicals in China. Its products include titanium dioxide for papermaking, coating, plastics, etc.; industrial chloroform; industrial dichloromethane; industrial methyl chloride; raw salt; cement; sulfuric acid; industrial bromine; and diammonium phosphate. The company was founded in 1996 and is based in Binzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Binzhou",
        "zipcode": "251909",
        "website": "http://www.lubeichem.com",
        "market_cap": "Small Cap"
    },
    "600731.SS": {
        "short_name": "HUNAN HAILI CHEMICAL INDUSTRY",
        "long_name": "Hunan Haili Chemical Industry Co., Ltd.",
        "summary": "Hunan Haili Chemical Industry Co., Ltd. develops, produces, and trades in pesticides and fine chemicals in China. The company offers insecticides, fungicides, phosgene derivatives, intermediates, amino-protecting agents, special chemicals, formulations, and seed coating agents under the Haili brand. It is also involved in the transportation of dangerous chemicals; and installation of chemical facilities. The company is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": "410007",
        "website": "http://www.hnhlc.com",
        "market_cap": "Small Cap"
    },
    "600796.SS": {
        "short_name": "ZHEJIANG QIANJIANG BIOCHEMICAL ",
        "long_name": "Zhejiang Qianjiang Biochemical Co., Ltd",
        "summary": "Zhejiang Qianjiang Biochemical Co., Ltd. manufactures and sells biological pesticides and veterinary drugs, and pharmaceutical intermediates in China. It offers biopesticide products comprising validamycin, gibberellic acid, abamectin, methylamino abamectin, and other products; biological drugs, including colistin sulfate premix and colistin sulphate; biological drugs intermediates; and feed additives. The company also provides external heating services. In addition, it exports its products to the United States, West Europe, South America, and Southeast Asia. Zhejiang Qianjiang Biochemical Co., Ltd. was founded in 1970 and is based in Haining, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Haining",
        "zipcode": null,
        "website": "http://www.qianjiangbioch.com",
        "market_cap": "Small Cap"
    },
    "603086.SS": {
        "short_name": "SHANDONG CYNDA CHEMICAL CO LTD",
        "long_name": "ShanDong Cynda Chemical Co.,Ltd",
        "summary": "ShanDong Cynda Chemical Co.,Ltd engages in the manufacture and sale of herbicides and fungicides in China and internationally. The company was founded in 2000 and is headquartered in Jinan, China. ShanDong Cynda Chemical Co.,Ltd is a subsidiary of Shandong CYNDA (Group) Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": null,
        "website": "http://www.cynda.cn",
        "market_cap": "Small Cap"
    },
    "603599.SS": {
        "short_name": "ANHUI GUANGXIN AGR",
        "long_name": "Anhui Guangxin Agrochemical Co., Ltd.",
        "summary": "Anhui Guangxin Agrochemical Co., Ltd. produces and sells pesticides, and phosgenated and intermediates in China. It offers fungicides, herbicides, insecticides, and phosgene and non-phosgene intermediates. The company also exports its products to Europe, the United States, Southeast Asia, and internationally. The company was founded in 1993 and is headquartered in Xuancheng, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xuancheng",
        "zipcode": "242235",
        "website": "http://www.chinaguangxin.com",
        "market_cap": "Mid Cap"
    },
    "603639.SS": {
        "short_name": "HAILIR PESTICIDESAND CHEMICALS ",
        "long_name": "Hailir Pesticides and Chemicals Group Co.,Ltd.",
        "summary": "Hailir Pesticides and Chemicals Group Co.,Ltd. engages in the research and development, production, and sale of pesticides and fertilizers in China. It offers fungicides, herbicides, insecticides, fertilizers, and TC and bioassay products. The company was founded in 1999 and is headquartered in Qingdao, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": "266109",
        "website": "http://www.hailir.cn",
        "market_cap": "Small Cap"
    },
    "603810.SS": {
        "short_name": "JIANGSU FENGSHAN GROUP CO LTD",
        "long_name": "Jiangsu Fengshan Group Co.,Ltd",
        "summary": "Jiangsu Fengshan Group Co.,Ltd, together with its subsidiaries, engages in the production, sale, import, and export of agricultural chemicals in China. The company offers herbicide, insecticide, bactericide, and plant growth regulator products. The company was founded in 1988 and is headquartered in Yancheng, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yancheng",
        "zipcode": "224100",
        "website": "http://www.fengshangroup.com",
        "market_cap": "Small Cap"
    },
    "8189.HK": {
        "short_name": "TEDA BIOMEDICAL",
        "long_name": "Tianjin TEDA Biomedical Engineering Company Limited",
        "summary": "Tianjin TEDA Biomedical Engineering Company Limited, together with its subsidiaries, engages in the research, development, manufacture, and sale of biological compound fertilizer products in the People's Republic of China. The company operates through two segments, Biological Compound Fertilizers Products, and Elderly Care and Health Care Services. Its biological compound fertilizer products includes active fertilizer, mixture with nitrogen, phosphorus, and potassium with various formula used for the facilitation of balanced growth of grains, fruits, and vegetables. The company is also involved in the provision of integrated elderly and health care; and elderly equipment leasing services, as well as consulting, advisory, and assessment services. In addition, it provides and licenses electroencephalography photography (EEG) diagnosis detection services; and conducts EEG detection and diagnosis technology services. Further, the company engages in the research, development, manufacturing, and application of biomedical science and technology projects; regional soil resources conditioning and remediation; and soil environmental quality standards research services. Tianjin TEDA Biomedical Engineering Company Limited was incorporated in 2000 and is headquartered in Tianjin, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300457",
        "website": "http://www.bioteda.com",
        "market_cap": "Small Cap"
    },
    "CDBT": {
        "short_name": "CHINA DASHENG BIOTECHNOLOGY COM",
        "long_name": "China Dasheng Biotechnology Company",
        "summary": "China Dasheng Biotechnology Company, together with its subsidiaries, engages in the production, marketing, and distribution of bacteria based products used as additives for livestock feed and crop cultivation in the People's Republic of China. It provides artificial microorganisms (AM) and high-efficiency microorganism (HM) based biological bacterium blends; and biological preservatives. The company offers AM/HM bacteria based additives for crops, including Bulgaria lactobacillus, beer microzyme, and dark red spirilla used to increase the beneficial microorganism colonies in soil; inhibit the reproduction of harmful fungi and putrefactive bacteria; and to improve nutrient absorption and reduce crop and livestock diseases. It also provides AM/HM bacteria based additives for livestock feed, which softens the livestock feed and restrain the growth and reproduction of pathogenic bacteria, as well as supplies beneficial nutriments, including organic acid, vitamins, enzyme, antibiotics, mycelium protein, and other growth-enhancing substances that balance the nutrients in the feed. In addition, the company offers FGW bacterial based preservatives that preserve animal specimens for scientific research; and preserve the freshness for agricultural produce. Further, it provides bacteria based fertilizer for application on plants, such as vegetable and fruit leaves. Additionally, China Dasheng Biotechnology Company engages in residential and commercial real estate investment. The company was formerly known as Max Nutrition, Inc. and changed its name to China Dasheng Biotechnology Company in March 2008. China Dasheng Biotechnology Company is based in Lanzhou, China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Lanzhou",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "CGA": {
        "short_name": "China Green Agriculture, Inc.",
        "long_name": "China Green Agriculture, Inc.",
        "summary": "China Green Agriculture, Inc., through its subsidiaries, engages in the research, development, production, and sale of various types of fertilizers and agricultural products. The company operates in three segments: Jinong, Gufeng, and Yuxing. Its fertilizer products include humic acid-based compound fertilizers, compound fertilizers, blended fertilizers, organic compound fertilizers, slow-release fertilizers, highly-concentrated water-soluble fertilizers, and mixed organic-inorganic compound fertilizers. The company markets its fertilizer products to private wholesalers and retailers of agricultural farm products. It also develops, produces, and markets fruits, vegetables, flowers, and colored seedlings. The company sells its decorative flowers to end-users, such as flower shops, luxury hotels, and government agencies; fruits and vegetables to supermarkets and upscale restaurants; and seedlings to city planning departments. As of June 30, 2019, it operated a network of 1,959 regional distributors covering 22 provinces, 4 autonomous regions, and 4 central government-controlled municipalities in China. The company also exports its products through contracted distributors to various countries, including India and Africa. China Green Agriculture, Inc. is based in Xi'an, the People's Republic of China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710065",
        "website": "http://www.cgagri.com",
        "market_cap": "Small Cap"
    },
    "CHBU": {
        "short_name": "CHINA AGRI BUSINESS INC",
        "long_name": "China Agri-Business, Inc.",
        "summary": "China Agri-Business, Inc. engages in the manufacture and sale of non-toxic fertilizer, bactericide, and fungicide products used for farming in the People's Republic of China. The company offers organic biochemical agricultural application products, including Xinsheng Luyuan, a line of fertilizer products whose primary function is to increase agricultural production; Xinsheng Lufeng, a line of organic soil amendment products that acts as a bactericide; and Xinsheng Huang-jin-gai, a line of amino acid fertilizer products designed to help crops absorb calcium and to enhance their quality. It also provides Xinsheng Jia-tian-xia, a line of humic acid fertilizer products designed to enhance the quality of crops; and Xinsheng Bai-le, a line of amino acid fertilizer products designed to provide supplementary micro-nutrients to crops, and to help crops grow with balanced nutrition. In addition, the company manufactures other agrochemical products, including diafenthiuron, prochloraz, and seed coating agents and preparations. China Agri-Business, Inc. sells its products primarily through wholesale and retail distributors. The company was founded in 2002 and is based in Xian, the People's Republic of China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Xian",
        "zipcode": "710065",
        "website": null,
        "market_cap": "Small Cap"
    },
    "GR0A.F": {
        "short_name": "CHINA GREEN AGRIC.DL-,001",
        "long_name": "China Green Agriculture, Inc.",
        "summary": "China Green Agriculture, Inc., through its subsidiaries, engages in the research, development, production, and sale of various types of fertilizers and agricultural products. The company operates in three segments: Jinong, Gufeng, and Yuxing. Its fertilizer products include humic acid-based compound fertilizers, compound fertilizers, blended fertilizers, organic compound fertilizers, slow-release fertilizers, highly-concentrated water-soluble fertilizers, and mixed organic-inorganic compound fertilizers. The company markets its fertilizer products to private wholesalers and retailers of agricultural farm products. It also develops, produces, and markets fruits, vegetables, flowers, and colored seedlings. The company sells its decorative flowers to end-users, such as flower shops, luxury hotels, and government agencies; fruits and vegetables to supermarkets and upscale restaurants; and seedlings to city planning departments. As of June 30, 2019, it operated a network of 1,959 regional distributors covering 22 provinces, 4 autonomous regions, and 4 central government-controlled municipalities in China. The company also exports its products through contracted distributors to various countries, including India and Africa. China Green Agriculture, Inc. is based in Xi'an, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710065",
        "website": "http://www.cgagri.com",
        "market_cap": "Small Cap"
    },
    "H1Q.F": {
        "short_name": "CHINA BLUECHEMICAL H YC 1",
        "long_name": "China BlueChemical Ltd.",
        "summary": "China BlueChemical Ltd., together with its subsidiaries, develops, manufactures, and sells mineral fertilizers and chemical products in the People's Republic of China and internationally. The company operates through Urea, Phosphorus and Compound Fertiliser, Methanol, and Others segments. It offers urea; mono-ammonium phosphate, di-ammonium phosphate, and compound fertilizers; methanol; and bulk blending fertilizers, and polyformaldehyde and woven plastic bags. The company is also involved in the trading of fertilizers and chemicals; mining, processing, manufacturing, and selling of phosphate; port operations; and provision of preparatory work for methanol and dimethyl-ether projects. In addition, it offers transportation and overseas shipping services; and manufactures and sells acrylonitrile and methyl methacrylate. The company was formerly known as CNOOC Chemical Limited and changed its name to China BlueChemical Ltd. in April 2006. The company was founded in 2000 and is headquartered in Beijing, the People's Republic of China. China BlueChemical Ltd. is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.chinabluechem.com.cn",
        "market_cap": "Small Cap"
    },
    "KWBT": {
        "short_name": "KIWA BIO-TECH PRODUCTS GROUP CO",
        "long_name": "Kiwa Bio-Tech Products Group Corporation",
        "summary": "Kiwa Bio-Tech Products Group Corporation, together with its subsidiaries, develops, manufactures, markets, and distributes bio-technological products for the agricultural market primarily in the People's Republic of China. It offers bacillus species and/or photosynthetic bacteria based biological organic, compound microbial, bio-water soluble, and microbial inoculum fertilizers. The company has a strategic cooperation agreements with the Beijing Zhongpin Agricultural Science and Technology Development Center; China Academy of Agricultural Science's Institute of Agricultural Resources & Regional Planning; and Institute of Agricultural Economy & Development, as well as Kiwa Bio-Tech (Yangling) Co. Ltd. Kiwa Bio-Tech Products Group Corporation was founded in 2002 and is headquartered in Yangling, China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Yangling",
        "zipcode": "712100",
        "website": "http://www.kiwabiotech.com",
        "market_cap": "Small Cap"
    },
    "NOEC": {
        "short_name": "NEW ORIENTAL ENERGY & CHEMICAL ",
        "long_name": "New Oriental Energy & Chemical Corp",
        "summary": "New Oriental Energy & Chemical Corp., together with its subsidiaries, engages in the manufacture and distribution of fertilizer and chemical products in the People's Republic of China. The company offers urea and coal-based chemicals, including ammonium bicarbonate and liquid ammonia used for nitrogenous fertilizers, and as a raw material for chemical products. It also provides methanol used in the production of medicines, pesticides, dyes, plastics, synthetic proteins, fibers, formaldehydes, and methyl ether, as well as a component of a type of new fuel. In addition, the company offers dimethyl ether used as an additive for liquefied petroleum gas (LPG) and non-industrial fuel substitute to LPG for residential and automotive uses; as a refrigerant for refrigerators and air conditioners; as a chemical feedstock for the production of acetic acid, acetate, and hydrocyanic acid; and in the production of pesticides and cosmetics, as well as everyday chemical products, such as detergent and hair gel. The company serves chemical, pharmaceutical, light, and textile industries. New Oriental Energy & Chemical Corp. sells its products primarily through regional distributors. The company was founded in 2003 and is based in Xinyang, the People's Republic of China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Xinyang",
        "zipcode": "464200",
        "website": "http://www.neworientalenergy.com",
        "market_cap": "Small Cap"
    },
    "S8P.F": {
        "short_name": "SH.DASH.AGR.F.T.H YC 0,10",
        "long_name": "Shanghai Dasheng Agriculture Finance Technology Co., Ltd.",
        "summary": "Shanghai Dasheng Agriculture Finance Technology Co., Ltd., together with its subsidiaries, researches, develops, produces, and markets pesticides and other agricultural material products in the People's Republic of China and Hong Kong. It operates through four segments: Agricultural and petrochemical products supply chain services, Financial Leasing and Commercial Factoring, Agricultural Big-Data Services, and Agrochemical Products Supply Chain Services. The company offers petrochemical and agricultural products, including chemical fertilizers, fuel oil, mixed aromatics, and white sugar, as well as food and frozen products; and financial leasing and commercial factoring services. It also provides agricultural big-data services, such as software related services; and collection and transportation, and other services comprising installation and technical support for payment platform systems. In addition, the company produces and sells pesticides and chemical products. Further, it engages in the construction of roads and bridges; provision of cold chain, logistics, trading, invest management, materials and on-site inspection services; construction, engineering, trading, and sales of building materials; and research and development of various synthetic materials. The company was formerly known as Shanghai Tonva Petrochemical Co., Ltd. and changed its name to Shanghai Dasheng Agriculture Finance Technology Co., Ltd. in January 2016. The company was founded in 1993 and is based in Shanghai, the People's Republic of China. Shanghai Dasheng Agriculture Finance Technology Co., Ltd. is a subsidiary of Shenzhen Dasheng Agricultural Group Co., Ltd.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200030",
        "website": "http://www.dsgd-sh.co",
        "market_cap": "Small Cap"
    },
    "SEED": {
        "short_name": "Origin Agritech Limited",
        "long_name": "Origin Agritech Limited",
        "summary": "Origin Agritech Limited, together with its subsidiaries, operates an agricultural biotechnology and an e-commerce platform in the People's Republic of China. The company engages in crop seed breeding and genetic improvement activities. It develops, produces, and distributes hybrid crop seeds, as well as develops hybrid seed technology. The company also operates an e-commerce platform, which provides range of products, including agricultural seed products that comprise corn, rice, and vegetable seeds; other agricultural inputs, such as fertilizers and agricultural chemicals; foods; household products; and other consumer products to farmers through online and mobile ordering. Origin Agritech Limited was founded in 1997 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102206",
        "website": "http://www.originseed.com.cn",
        "market_cap": "Small Cap"
    }
}