{
    "000416.SZ": {
        "short_name": "MINSHENG HOLDINGS",
        "long_name": "Minsheng Holdings Co.,Ltd",
        "summary": "Minsheng Holdings Co.,Ltd provides financial services in China. The company offers property, car, civil, and rights certificate pawn services, as well as consultation and evaluation services; and mergers and acquisitions, and equity investment services. It also provides risk management consulting, property and personal insurance brokerage, and reinsurance brokerage services. The company was formerly known as Minsheng Investment Management Co., Ltd. and changed its name to Minsheng Holdings Co.,Ltd in April 2014. Minsheng Holdings Co.,Ltd was founded in 1993 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100005",
        "website": "http://mskg.com.cn",
        "market_cap": "Small Cap"
    },
    "000532.SZ": {
        "short_name": "ZHUHAI HUAJIN CAPI",
        "long_name": "Zhuhai Huajin Capital Co., Ltd.",
        "summary": "Zhuhai Huajin Capital Co., Ltd. engages in the equity investment, asset management, physical, incubator, and other businesses in China and internationally. It offers investment management, private equity fund management, venture capital, venture capital consulting, and venture management services; and real estate finance and asset management services. The company also researches and develops optical and electromechanical precision mechanical equipment, including lithium ion battery production equipment, plug-in aluminum electrolytic capacitor, and chip electrolytic capacitor production equipment; and constructs, operates, manages, and consults water purification plants and environmental projects. In addition, it engages in technology incubator, technical services, property management, and park construction and operation activities; and enterprise management, product development, and investment and technology consulting activities. The company was formerly known as Leaguer Stock Co., Ltd. and changed its name to Zhuhai Huajin Capital Co., Ltd. in April 2017. Zhuhai Huajin Capital Co., Ltd. was founded in 1992 and is based in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": "519080",
        "website": "http://www.huajinct.com",
        "market_cap": "Small Cap"
    },
    "000563.SZ": {
        "short_name": "SHAANXI INTERNATIO",
        "long_name": "Shaanxi International Trust Co., Ltd.",
        "summary": "Shaanxi International Trust Co., Ltd. engages in the trust and financial businesses in China. The company provides trust loans and investment, financial leasing, credit guarantee, and financial advisory and venture capital for enterprises and projects. It also offers asset management services to high net-worth clients. The company was formerly known as Shaanxi Province Finance Joint Investment Company. Shaanxi International Trust Co., Ltd. was founded in 1984 and is based in Xi'an, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": null,
        "website": "http://www.siti.com.cn",
        "market_cap": "Mid Cap"
    },
    "1359.HK": {
        "short_name": "CHINA CINDA",
        "long_name": "China Cinda Asset Management Co., Ltd.",
        "summary": "China Cinda Asset Management Co., Ltd. acquires, manages, invests in, and disposes financial and non-financial institution distressed assets in the People's Republic of China. The company operates through Distressed Asset Management Business, and Financial Services Business segments. It is also involved in receivership; foreign investment; securities and futures dealing; financial bond issuance; inter-bank borrowing and lending; commercial financing for other financial institutions; approved asset securitization business; financial institutions custody; and closing and liquidation of business. In addition, the company engages in consulting and advisory business on finance, investment, and legal and risk management; asset and project evaluation; banking business; insurance; fund management; asset management; trust; financial leasing services; and real estate and industrial investments and other businesses. Further, it is involved in securities brokerage, life insurance, real estate development, property leasing, hotel management, and aircraft leasing activities. The company serves customers through 33 branches. China Cinda Asset Management Co., Ltd. was founded in 1999 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100031",
        "website": "http://www.cinda.com.cn",
        "market_cap": "Mid Cap"
    },
    "1835.HK": {
        "short_name": "REALWAY CAPITAL",
        "long_name": "Shanghai Realway Capital Assets Management Co., Ltd.",
        "summary": "Shanghai Realway Capital Assets Management Co., Ltd. is a principal investment firm specializing in real estate investment.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200122",
        "website": "http://www.realwaycapital.com",
        "market_cap": "Micro Cap"
    },
    "2799.HK": {
        "short_name": "CHINA HUARONG",
        "long_name": "China Huarong Asset Management Co., Ltd.",
        "summary": "China Huarong Asset Management Co., Ltd., together with its subsidiaries, provides various financial asset management services. It operates through three segments: Distressed Asset Management, Financial Services, and Asset Management and Investment. The company manages, invests in, and disposes financial and non-financial institution distressed assets, including debt-to-equity swap assets. It is also involved in bankruptcy management, and investment and securities dealing activities; provision of financial bonds issuance, inter-bank borrowing and lending, and commercial financing for other financial institutions; asset securitization, financial institutions custody, and closing and liquidation of businesses; consulting and advisory business on finance, investment, legal, and risk management activities; and assets and project evaluation businesses. In addition, the company offers lending services to corporates and individuals, as well as clearing and settlement, financial leasing, securities and futures, fund management and asset management, trust, real estate and industrial investments, and other services, as well as accepts deposits from customers. Further, it provides leasing, futures broking, wealth management, and investment banking services, as well as personal consumption loan. The company operates 31 branches in 30 provinces, autonomous regions, and municipalities in Mainland China, and Hong Kong and Macau. China Huarong Asset Management Co., Ltd. was founded in 1999 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100033",
        "website": "http://www.chamc.com.cn",
        "market_cap": "Mid Cap"
    },
    "600053.SS": {
        "short_name": "KUNWU JIUDING INVESTMENT HOLDIN",
        "long_name": "Kunwu Jiuding Investment Holdings Co., Ltd.",
        "summary": "Kunwu Jiuding Investment Holdings Co., Ltd. engages in the private equity investment management business in China. The company was formerly known as Jiangxi Zhongjiang Real Estate Co., Ltd. and changed its name to Kunwu Jiuding Investment Holdings Co., Ltd. in December 2015. The company is based in Nanchang, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330077",
        "website": "http://www.jdcapital.com",
        "market_cap": "Small Cap"
    },
    "600318.SS": {
        "short_name": "ANHUI XINLI FINANCE CO LTD",
        "long_name": "Anhui Xinli Finance Co., Ltd.",
        "summary": "Anhui Xinli Finance Co., Ltd. provides various financial products and services. It offers small loans, financing guarantees, online loans, financial leasing and pawn services, and other financial services. The company was formerly known as Anhui Chaodong Cement Co., Ltd. Anhui Xinli Finance Co., Ltd. was founded in 1999 and is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": null,
        "website": "http://www.xinlijinrong.cn",
        "market_cap": "Small Cap"
    },
    "600696.SS": {
        "short_name": "SHANGHAI GUIJIU CO LTD",
        "long_name": "Shanghai Guijiu Co.,Ltd.",
        "summary": "Shanghai Guijiu Co.,Ltd. focuses on providing integrated financial information services primarily in China. The company operates through Financial Technology, Financial Leasing, Industrial Investment, and Bulk Trade segments. The company was formerly known as Shanghai Yanshi Enterprise Development Co., Ltd. and changed its name to Shanghai Guijiu Co.,Ltd. in December 2019. Shanghai Guijiu Co.,Ltd. is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.sh600696.com",
        "market_cap": "Small Cap"
    },
    "600816.SS": {
        "short_name": "ANXIN TRUST CO LTD",
        "long_name": "Anxin Trust Co., Ltd",
        "summary": "Anxin Trust Co., Ltd operates as a trust company in China. It offers trust service for clients in agriculture, biomedicine, city renovation, Internet infrastructure, pension, logistics, and new energy industry fields. The company was formerly known as Anxin Trust & Investment Co., Ltd. and changed its name to Anxin Trust Co., Ltd in April 2014. Anxin Trust Co., Ltd was founded in 1987 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.anxintrust.com",
        "market_cap": "Mid Cap"
    },
    "601108.SS": {
        "short_name": "CAITONG SECURITIES CO. LTD",
        "long_name": "Caitong Securities Co.,Ltd.",
        "summary": "Caitong Securities Co.,Ltd., together with its subsidiaries, engages in the securities brokerage business in China. The company operates in the securities brokerage, securities investment consulting, securities self-employment, securities underwriting and sponsorship, margin financing and securities lending, securities investment fund sales agency, agency sales of financial products, and other businesses. The company was founded in 1993 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310007",
        "website": "http://www.ctsec.com",
        "market_cap": "Mid Cap"
    },
    "6NO.F": {
        "short_name": "NOAH HLDGS LTD SP.ADR/2",
        "long_name": "Noah Holdings Limited",
        "summary": "Noah Holdings Limited, through its subsidiaries, operates as a wealth and asset management service provider with the focus on investment and asset allocation services for high net worth individuals and enterprises in Mainland of China, Hong Kong, and internationally. The company operates through three segments: Wealth Management, Asset Management, and Lending and Other Services. It offers investment products, including domestic and overseas public securities products, and insurance products, as well as customized value-added financial services, such as investor education, trust, government registration, tax planning, leasing, and insurance brokerage services. The company also provides onshore and offshore private equity, real estate, public securities, credit, and multi-strategy investment products, as well as lending services. Noah Holdings Limited was founded in 2005 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200090",
        "website": "http://www.noahgroup.com",
        "market_cap": "Mid Cap"
    },
    "CAMG": {
        "short_name": "CAM GROUP INC",
        "long_name": "CAM Group, Inc.",
        "summary": "CAM Group, Inc., through its subsidiaries, sells time slots in out-of-home television advertising networks in the People's Republic of China. The company operates an advertising network by installing LCD displays in up to 16,000 retail outlets for serving product manufacturers and government agencies. Its advertising tools include LCD displays, poster boards, outdoor billboards, and brochures and leaflets. The company was incorporated in 1995 and is based in Shijiazhuang, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": "050041",
        "website": "http://www.camg-inc.com/",
        "market_cap": "Nano Cap"
    },
    "CHE.F": {
        "short_name": "CH. HUARONG ASS. M. H HD1",
        "long_name": "China Huarong Asset Management Co., Ltd.",
        "summary": "China Huarong Asset Management Co., Ltd., together with its subsidiaries, provides various financial asset management services. It operates through three segments: Distressed Asset Management, Financial Services, and Asset Management and Investment. The company manages, invests in, and disposes financial and non-financial institution distressed assets, including debt-to-equity swap assets. It is also involved in bankruptcy management, and investment and securities dealing activities; provision of financial bonds issuance, inter-bank borrowing and lending, and commercial financing for other financial institutions; asset securitization, financial institutions custody, and closing and liquidation of businesses; consulting and advisory business on finance, investment, legal, and risk management activities; and assets and project evaluation businesses. In addition, the company offers lending services to corporates and individuals, as well as clearing and settlement, financial leasing, securities and futures, fund management and asset management, trust, real estate and industrial investments, and other services, as well as accepts deposits from customers. Further, it provides leasing, futures broking, wealth management, and investment banking services, as well as personal consumption loan. The company operates 31 branches in 30 provinces, autonomous regions, and municipalities in Mainland China, and Hong Kong and Macau. China Huarong Asset Management Co., Ltd. was founded in 1999 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100033",
        "website": "http://www.chamc.com.cn",
        "market_cap": "Mid Cap"
    },
    "HYW": {
        "short_name": "Hywin Holdings Ltd.",
        "long_name": "Hywin Holdings Ltd.",
        "summary": "Hywin Holdings Ltd., through its subsidiaries, provides wealth management, insurance brokerage, and asset management service in China. It offers privately raised products, including private securities investment funds; private equity and venture capital; privately raised funds of other assets; and real estate products, including traditional real estate fixed-income products, real estate securitization products, and real estate equity investments. The company also offers publicly raised fund products, such as money market fund comprising fixed income mutual fund products that are invested in low risk, highly liquid, and short-term financial instruments, including government bonds, central bank bills, term deposits, certificates of deposits, and corporate commercial papers; bond fund; equity securities fund, which are invested in publicly traded stocks; and hybrid fund, which are invested in mixed products in the combination of publicly traded stocks, bonds, or money market fund. In addition, it provides insurance products, such as life insurance products comprising individual whole life, individual term life, universal life, and individual health insurance; and annuity insurance products and critical illness insurance products, including personal accident insurance products. Further, the company provides overseas property investment consulting; and information technology services, including transaction process management, data analysis, and system maintenance services, as well as engages in microfinance and finance leasing businesses. The company was founded in 2006 and is headquartered in Shanghai, China. Hywin Holdings Ltd. operates as a subsidiary of Grand Lead Group Limited.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200120",
        "website": "http://www.hywinwealth.com",
        "market_cap": "Micro Cap"
    },
    "JP": {
        "short_name": "Jupai Holdings Limited",
        "long_name": "Jupai Holdings Limited",
        "summary": "Jupai Holdings Limited, together with its subsidiaries, provides wealth management products and advisory services to high-net-worth individuals in China. It offers services for fixed income products, private equity and venture capital funds, and public market products, as well as other products, including overseas insurance products and foreign-currency denominated alternative investments. The company also provides asset management services, including management of real estate or related funds and other fund products. In addition, it offers fund management services, as well as advisory and administrative services. The company was formerly known as Jupai Investment Group and changed its name to Jupai Holdings Limited in December 2014. Jupai Holdings Limited was founded in 2010 and is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201100",
        "website": "http://www.jpinvestment.cn",
        "market_cap": "Micro Cap"
    },
    "JP8A.F": {
        "short_name": "JUPAI HLDGS SP.ADR 6",
        "long_name": "Jupai Holdings Limited",
        "summary": "Jupai Holdings Limited, together with its subsidiaries, provides wealth management products and advisory services to high-net-worth individuals in China. It offers services for fixed income products, private equity and venture capital funds, and public market products, as well as other products, including overseas insurance products and foreign-currency denominated alternative investments. The company also provides asset management services, including management of real estate or related funds and other fund products. In addition, it offers fund management services, as well as advisory and administrative services. The company was formerly known as Jupai Investment Group and changed its name to Jupai Holdings Limited in December 2014. Jupai Holdings Limited was founded in 2010 and is based in Shanghai, China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201100",
        "website": "http://www.jpinvestment.cn",
        "market_cap": "Micro Cap"
    },
    "NOAH": {
        "short_name": "Noah Holdings Limited",
        "long_name": "Noah Holdings Limited",
        "summary": "Noah Holdings Limited, through its subsidiaries, operates as a wealth and asset management service provider with the focus on investment and asset allocation services for high net worth individuals and enterprises in Mainland of China, Hong Kong, and internationally. The company operates through three segments: Wealth Management, Asset Management, and Lending and Other Services. It offers investment products, including domestic and overseas public securities products, and insurance products, as well as customized value-added financial services, such as investor education, trust, government registration, tax planning, leasing, and insurance brokerage services. The company also provides onshore and offshore private equity, real estate, public securities, credit, and multi-strategy investment products, as well as lending services. Noah Holdings Limited was founded in 2005 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200090",
        "website": "http://www.noahgroup.com",
        "market_cap": "Mid Cap"
    },
    "PHCF": {
        "short_name": "Puhui Wealth Investment Managem",
        "long_name": "Puhui Wealth Investment Management Co., Ltd.",
        "summary": "Puhui Wealth Investment Management Co., Ltd., through its subsidiaries, provides third-party wealth management services in the People's Republic of China. The company markets financial products, such as private equity funds, securities investment funds, and private placement bond products to high-net-worth individuals and small and medium enterprises. It also manages funds for individuals and corporate clients, as well as provides investment advisory services. The company was founded in 2013 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100006",
        "website": "http://www.puhuiwealth.com",
        "market_cap": "Micro Cap"
    },
    "PUYI": {
        "short_name": "Puyi Inc. - American Depository",
        "long_name": "Puyi Inc.",
        "summary": "Puyi Inc. provides third-party wealth management services in China. The company distributes publicly raised fund products through online; and privately raised fund products offline through its branch network. It also provides asset management services that include managing fund of funds and non-performing loan funds; factoring services; and information technology services. Puyi Inc. was incorporated in 2018 and is headquartered in Guangzhou, China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NGM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510620",
        "website": "http://www.puyiwm.com",
        "market_cap": "Small Cap"
    },
    "WINSF": {
        "short_name": "WINS FIN HLDGS INC",
        "long_name": "Wins Finance Holdings Inc.",
        "summary": "Wins Finance Holdings Inc., through its subsidiaries, provides financing solutions for small and medium enterprises in the People's Republic of China. It offers financial leasing, advisory, consultancy, and agency services in Jinzhong City, Shanxi Province, and Beijing. The company is headquartered in Beijing, the People's Republic of China. Wins Finance Holdings Inc. was formerly a subsidiary of Freeman FinTech Corporation Limited.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100024",
        "website": "http://www.winsholdings.com",
        "market_cap": "Micro Cap"
    }
}