{
    "002142.SZ": {
        "short_name": "BANK OF NINGBO CO.",
        "long_name": "Bank of Ningbo Co., Ltd.",
        "summary": "Bank of Ningbo Co., Ltd. provides various personal and business banking products and services in China. The company operates through four segments: Corporate Banking, Personal Banking, Capital Banking, and Other Banking Services. It offers deposits; short-term, medium-term, and long-term loans; bank cards; domestic settlements; discounting services; distribution and payment agent, and government bonds underwriting services; government bonds trading services; inter-bank lending/borrowing services; safe deposit box services; foreign currency deposits, loans, and remittances; bank guarantees; and payment/collection and insurance agent services, as well as other banking services. The company also provides financial bonds issuance; consignment loan of local fiscal revolving funds; international settlement; foreign currencies purchase and sale; inter-bank foreign currency lending/borrowing; foreign currency negotiable instruments acceptance and discount; foreign currency guarantees; and other business services. As of December 31, 2019, it operated 14 branches and 19 primary sub-branches in the cities of Ningbo, Zhejiang province; and Shanghai, Hangzhou, Nanjing, Shenzhen, Suzhou, Wenzhou, Beijing, Wuxi, Jinhua, Shaoxing, Taizhou, Lishui, Huzhou, and Jiaxing. The company was formerly known as Ningbo Commercial Bank Co., Ltd. and changed its name to Bank of Ningbo Co., Ltd. in February 2007. Bank of Ningbo Co., Ltd. was founded in 1997 and is headquartered in Ningbo, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315042",
        "website": "http://www.nbcb.com.cn",
        "market_cap": 242183290880
    },
    "002807.SZ": {
        "short_name": "JIANGSU JIANGYIN R",
        "long_name": "Jiangsu Jiangyin Rural Commercial Bank Co.,LTD.",
        "summary": "Jiangsu Jiangyin Rural Commercial Bank Co.,LTD. provides various personal and corporate banking products and services in China. Its personal finance products include personal deposit, financing, bank card, foreign exchange, and wealth management products, as well as agency services. The company's corporate finance products comprise unit deposits; traditional, technology, and green financing products; and others. It also provides international finance products, including settlement, letters of credit, documentary collection, financing, and hedging and value-added products. In addition, the company offers small and micro finance products; and online and mobile banking, payment, convenience, and other services. Jiangsu Jiangyin Rural Commercial Bank Co.,LTD. was founded in 2001 and is based in Jiangyin, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiangyin",
        "zipcode": "214431",
        "website": "http://www.jybank.com.cn",
        "market_cap": 8688039936
    },
    "002839.SZ": {
        "short_name": "JIANGSU ZHANGJIAGA",
        "long_name": "Jiangsu Zhangjiagang Rural Commercial Bank Co., Ltd",
        "summary": "Jiangsu Zhangjiagang Rural Commercial Bank Co., Ltd provides banking products and services in China. It offers deposit products, such as demand, time, notice, and fixed-life, agreement, and smart notification deposits; personal large deposit certificates; wealth management services, including financial management, investment funds, gold fixed investments, life insurance products, and monetary funds; and personal foreign exchange services, as well as collection and payment of water fees, electricity bills, digital TV viewing fees, telecommunication and intercom charges, mobile payment, and gas payment. The company also provides domestic factoring, domestic letter of credit, domestic letter of credit package loans and forfeiting , domestic acceptance bill guarantees, sellers financing, and domestic order financing; international settlement and trade finance; small and micro products; credit and debit cards; personal loans; online and mobile banking; and ATM's. In addition, it engages in bonds, bills, credit asset, and interbank business. Jiangsu Zhangjiagang Rural Commercial Bank Co., Ltd founded in 2001 and is based in Zhangjiagang, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhangjiagang",
        "zipcode": "215600",
        "website": "http://www.zrcbank.com",
        "market_cap": 10034179072
    },
    "002958.SZ": {
        "short_name": "QINGDAO RURAL COMM",
        "long_name": "Qingdao Rural Commercial Bank Corporation",
        "summary": "Qingdao Rural Commercial Bank Corporation provides various banking products and services in China. The company accepts various deposits, such as call deposits and settlement accounts, current and fixed deposits, corporate agreement accounts, margin deposits, non-resident accounts, and foreign exchange accounts. Its loan products include housing decoration and home appliance consumer loans; and bank acceptances, small business credit union revolving credit loans, and commercial acceptance bill discounts. The company also offers various cards; middle services comprising phone bill, finance and tax, and insurance services; and foreign exchange, international settlement, trade finance, forex, cross-border RMB trade, and domestic L/C services, as well as phone, SMS, mobile, and self-banking services. The company was founded in 1951 and is headquartered in Qingdao, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": "266061",
        "website": "http://www.qrcb.com.cn",
        "market_cap": 24444510208
    },
    "0416.HK": {
        "short_name": "BANKOFJINZHOU",
        "long_name": "Bank of Jinzhou Co., Ltd.",
        "summary": "Bank of Jinzhou Co., Ltd. provides various banking products and services in the People's Republic of China. The company operates through Corporate Banking Business, Retail Banking Business, and Treasury Business segments. Its Corporate Banking Business segment provides deposits, loans, settlement and clearing, and other products and services. The company's Retail Banking Business segment offers deposits, bank and credit cards, personal and collateral loans, and personal wealth management services. Its Treasury Business segment provides money market placements, investments and repurchasing, and foreign exchange transactions services. The company also provides advances, payment and settlement, finance leasing, and other banking services. As of December 31, 2020, it operated through a network of 15 branches, 194 sub-branches, 6 mini/community sub-branches, and 1 specialized institution located primarily in Beijing, Tianjin, Harbin, and Liaoning. The company was formerly known as Jinzhou City Commercial Bank Co., Ltd. and changed its name to Bank of Jinzhou Co., Ltd. in December 2015. Bank of Jinzhou Co., Ltd. was incorporated in 1997 and is headquartered in Jinzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Jinzhou",
        "zipcode": "121013",
        "website": "http://www.jinzhoubank.com",
        "market_cap": 26704855040
    },
    "1216.HK": {
        "short_name": "ZYBANK",
        "long_name": "Zhongyuan Bank Co., Ltd.",
        "summary": "Zhongyuan Bank Co., Ltd. provides corporate and personal deposits, loans and advances, settlement, financial market and leasing, and other financial services in the Asia Pacific, North America, and internationally. It operates through Corporate Banking, Retail Banking, Financial Markets Business, and Others segments. The Corporate Banking segment provides corporate loans and advances, trade financing and deposit taking, agency, consulting and advisory, remittance and settlement, and guarantee services to corporations, government agencies, and financial institutions. The Retail Banking segment offers a range of financial products and services, including personal loans, deposits, bank cards, personal wealth management services, and remittance services to retail customers. The Financial Markets Business segment offers inter-bank money market transactions, repurchase transactions, investments, trading in debt securities, and issuance of debts services. As of December 31, 2020, it operated 18 branches, 2 direct sub-branches, and 494 total outlets; and 297 urban branches, 126 county-level branches, and 71 township-level sub-branches, as well as 5,373 farmers-benefiting payment service outlets and financial service stations. The company was founded in 2014 and is headquartered in Zhengzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": null,
        "website": "http://www.zybank.com.cn",
        "market_cap": 21681000448
    },
    "1551.HK": {
        "short_name": "GRCB",
        "long_name": "Guangzhou Rural Commercial Bank Co., Ltd.",
        "summary": "Guangzhou Rural Commercial Bank Co., Ltd. provides banking services. It operates through Corporate Banking, Retail Banking, Financial Market Business, and Others segments. The company offers deposits products, including demand, call, time, institutional call, agreement, and fixed deposits; personal cheques; personal consumption and mortgage loans; and personal finance products. It also provides corporate financing and credit, such as house development, project, working capital, commercial property mortgage, and fixed asset project loans; and international payment and remittance, intermediary, and trade and SME financing services. In addition, the company offers investment banking services; short, medium, and long term loans; and domestic and international settlements, and bill acceptance and discounting services. Further, it provides money market placements, investments and repurchasing, and foreign exchange services; inter-bank placements; debit and credit cards; payment collection and insurance agency, safe locker, advisory and attestation, fund and insurance assets trusteeship, and cash management services; and agency services for issuing and underwriting government bonds. Additionally, the company trades in government and financial bonds; provides bill, fixed-income, wealth management, and institutional banking services, as well as Internet, telephone, SMS, mobile, and WeChat banking services. As of December 31, 2020, it had 642 outlets; 5 branches in Foshan, Qingyuan, Heyuan, Zhaoqing, and Zhuhai, Guangdong province, as well as 12 sub-branches and 1 sub-office; 1,713 ATM's; and 685 self-service inquiry terminals, 321 smart service terminals, and 187 smart banking outlets, as well as 75 self-service banking facilities. The company was formerly known as Guangzhou Rural Credit Cooperative Unions and changed its name to Guangzhou Rural Commercial Bank Co., Ltd. The company was founded in 1952 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510623",
        "website": "http://www.grcbank.com",
        "market_cap": 30601801728
    },
    "1658.HK": {
        "short_name": "PSBC",
        "long_name": "Postal Savings Bank of China Co., Ltd.",
        "summary": "Postal Savings Bank of China Co., Ltd. provides various banking products and services for retail and corporate customers in the People's Republic of China. Its Personal Banking segment offers savings products, such as demand, time, personal call, time/demand optional, and foreign currency deposits; passbooks; certificate of deposits; micro, personal pledged, and personal business loans; debit and credit cards; wealth management products and funds; and insurance agency services. This segment is also involved in distribution of fund products, electronic bonds, and precious metals; and provides payment and collection agency, various settlement, domestic remittance and exchange, cross-border remittance, personal exchange settlement and sale, and foreign currency exchange services. The company's Corporate Banking segment provides time, demand, call, and negotiated deposits; working capital, fixed asset, trade finance, stock pledge, land reserve, syndicated, real estate development, property mortgage, and consignment loans; cash management services; negotiable instruments; trade finance and international settlement services; and financial markets services. Its Treasury segment offers interbank lending transactions, repurchase and resale transactions, debt instrument investments, equity instrument investment, investment banking, bond securities, and wealth management products, etc., as well as trades in financial products comprising money market, fixed income, and foreign exchange products, as well as derivatives and precious metals. The company also provides online, mobile, and self-service banking services. As of December 31, 2020, it had 39,631 outlets, including 8,568 directly operated outlets and 31,763 agency outlets. The company was founded in 2007 and is headquartered in Beijing, the People's Republic of China. Postal Savings Bank of China Co., Ltd. is a subsidiary of China Post Group Corporation.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100808",
        "website": "http://www.psbc.com",
        "market_cap": 577160413184
    },
    "1916.HK": {
        "short_name": "JIANGXI BANK",
        "long_name": "Jiangxi Bank Co., Ltd.",
        "summary": "Jiangxi Bank Co., Ltd. provides corporate and retail banking services in the People's Republic of China. The company operates through Corporate Banking, Retail Banking and Credit card, and Financial Markets Business segments. It offers time and demand deposits; working capital and fixed asset loans, as well as short-term loans and advances, medium to long term loans, and financial leasing services; and credit and debit cards. The company also provides trade financing and deposit-taking, agency, consulting and advisory, remittance and settlement, and guarantee services; personal loans, bank cards, and personal wealth management services; inter-bank money market transactions; and transaction and investment repurchase services. In addition, it trades in debt securities and government bonds, as well as issues debts; offers money market and asset management services, as well as invests in securities and other financial assets; insurance agency and safe-box services; settles and underwrites government bonds; issues financial bonds; provides bill acceptances and discounting, inter-bank placement, inward and outward payments agency, and foreign exchange services; and offers mobile, online, telephone, and WeChat banking services. The company serves corporations, government agencies and financial institutions, retail customers, and state-owned and private enterprises. The company was formerly known as Bank of Nanchang Co., Ltd. and changed its name to Jiangxi Bank Co., Ltd. in December 2015. Jiangxi Bank Co., Ltd. was founded in 1997 and is headquartered in Nanchang, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330038",
        "website": "http://www.jx-bank.com",
        "market_cap": 19458424832
    },
    "1963.HK": {
        "short_name": "BCQ",
        "long_name": "Bank of Chongqing Co., Ltd.",
        "summary": "Bank of Chongqing Co., Ltd. provides various banking and related financial services for corporate and individual customers in the People's Republic of China. It operates through three segments: Corporate Banking, Retail Banking, and Treasury. The company offers various deposit products and loans; inter-bank lending and borrowing, bonds investment, re-purchasing, and foreign currency transactions; and telephone, mobile, and online and direct banking services, as well as settlement services, financial leasing, and other services. As of December 31, 2020, it operated 145 sub-units, including a business department, a small enterprise loan center, four primary branches, 172 self-service banking centers, and 280 intelligent teller machines covering 38 districts and counties of Chongqing, as well as three provinces in western China. The company was formerly known as Commercial Bank of Chongqing Co., Ltd. and changed its name to Bank of Chongqing Co., Ltd. in August 2007. Bank of Chongqing Co., Ltd. was incorporated in 1996 and is headquartered in Chongqing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "400024",
        "website": "http://www.cqcbank.com",
        "market_cap": 16104307712
    },
    "1983.HK": {
        "short_name": "LUZHOU BANK",
        "long_name": "Luzhou Bank Co., Ltd.",
        "summary": "Luzhou Bank Co., Ltd. provides corporate and retail banking, and financial market services. It operates through four segments: Corporate Banking, Retailing Banking, Financial Markets, and Other. The company offers corporate banking products and services, such as corporate loans, bill discounting, and corporate deposits; and retail banking products and services comprising personal loans, personal deposits, and card services, as well as wealth management, precious metal products and services, and other intermediary services. It is also involved in financial markets business that consists of money market transactions, investment management, and asset management. In addition, the company provides settlement and agency services, bank card services, guarantees and credit commitments, and investment banking services. It serves customers through 28 sub-branches in Luzhou, as well as a branch located in Chengdu. The company was formerly known as Luzhou City Commercial Bank Co., Ltd. and changed its name to Luzhou Bank Co., Ltd. in June 2019. Luzhou Bank Co., Ltd. was incorporated in 1997 and is headquartered in Luzhou, China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Luzhou",
        "zipcode": "646000",
        "website": "http://www.lzccb.cn",
        "market_cap": 7360567296
    },
    "1988.HK": {
        "short_name": "MINSHENG BANK",
        "long_name": "China Minsheng Banking Corp., Ltd.",
        "summary": "China Minsheng Banking Corp., Ltd. provides various financial products and services to individuals, small and micro-enterprises, corporate customers, government agencies, and financial institutions in the People's Republic of China. The company operates through Corporate Banking, Retail Banking, and Others segments. Its deposit products include saving accounts, deposit certificates, contracted deposits, agreement deposits, call deposits, corporate term deposits, and corporate current deposits. The company also offers personal housing mortgage, individual automobile purchase, household composite consumption, home, medium and long term, and short-term working capital loans; micro-credit products for individuals; debit and credit cards; and safe deposit boxes. In addition, it provides payment and collection, and clearing services, as well as internet, mobile, and telephone banking services. Further, the company offers gross settlement; wages distribution agency and letter of guarantee; cash management; trade finance; industrial chain finance; individual forex settlement, forex remittance, travelers promissory notes, collection, individual deposit certificate, and guarantee letter products; and comprehensive credit granting, forex settlement and sale, financial product investment, and trust financing services. Additionally, it provides convenient finance, investment banking, and asset management services, as well as non-financial services in the education, business travel, traveler, art, luxury life, health, club, and isports areas. The company has approximately 140 branch-level institutions, 1,178 business outlets, 1,106 community sub-branches, and 138 small business sub-branches. China Minsheng Banking Corp., Ltd. was founded in 1996 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100031",
        "website": "http://www.cmbc.com.cn",
        "market_cap": 231843086336
    },
    "2016.HK": {
        "short_name": "CZBANK",
        "long_name": "China Zheshang Bank Co., Ltd",
        "summary": "China Zheshang Bank Co., Ltd. provides a range of banking products and services in Mainland China. It operates through Corporate Banking, Retail Banking, and Treasury Business segments. The Corporate Banking segment offers a range of financial products and services, including corporate loans and advances, trade finance, deposit products, and other types of corporate intermediary services. The Retail Banking segment provides personal loans and advances, deposit products, bank cards business, and other types of personal intermediary services. The Treasury Business segment offers money market and repurchase transactions, debt instruments investments, financial derivatives business for proprietary trading or on behalf of customers, and financial products and services, as well as issues debt securities. The company serves individuals, corporations, government agencies, and financial institutions. As of December 31, 2020, the company had 270 branch outlets in 20 provinces and Hong Kong in China. China Zheshang Bank Co., Ltd. was incorporated in 1993 and is headquartered in Hangzhou, China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310006",
        "website": "http://www.czbank.com",
        "market_cap": 109476323328
    },
    "2066.HK": {
        "short_name": "SHENGJINGBANK",
        "long_name": "Shengjing Bank Co., Ltd.",
        "summary": "Shengjing Bank Co., Ltd., together with its subsidiaries, provides banking products and services to individual and corporate customers in Mainland China. Its Corporate Banking segment offers corporate loans and advances, trade financing and deposit taking services, agency services, and remittance and settlement services to corporations, government agencies, and financial institutions. The company's Retail Banking segment provides financial products and services to retail customers, including personal loans and deposit taking services, bank cards, personal wealth management services, remittance and settlement services, and collection and payment agency services. Its Treasury Business segment is involved in inter-bank money market transactions, repurchases transactions, and investment activities, as well as trading in debt securities. The company also provides investment in equities, and online and mobile banking services. As of December 31, 2020, it operated 208 institutional outlets, including one head office, three branch-level specialized institutions, 18 branches, five small sub-branches, and 181 sub-branches; and 1,781 self-service facilities, such as cash recycling systems, inquiry and payment machines, mobile card activating machines, VTMs, smart counters, cash recycling systems, interactive desktops, and other self-service facilities. The company was formerly known as Shenyang Commercial Bank Co., Ltd. and changed its name to Shengjing Bank Co., Ltd. in February 2007. Shengjing Bank Co., Ltd. was incorporated in 1997 and is headquartered in Shenyang, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenyang",
        "zipcode": "110013",
        "website": "http://www.shengjingbank.com.cn",
        "market_cap": 65095434240
    },
    "2139.HK": {
        "short_name": "BANK OF GANSU",
        "long_name": "Bank of Gansu Co., Ltd.",
        "summary": "Bank of Gansu Co., Ltd., together with its subsidiary, Pingliang Jingning Chengji Rural Bank Co., Ltd., provides various banking services in the People's Republic of China. It operates through three segments: Corporate Banking, Retail Banking, and Financial Market Operations. The company's Corporate Banking segment offers a range of financial products and services, including deposits, corporate loans and advances, agency services, consulting and advisory services, remittance and settlement services, and guarantee services to corporations and government agencies. Its Retail Banking segment provides deposits, personal loans, bank cards, personal wealth management services, and remittance services to retail customers. The company's Financial Market Operations segment engages in the inter-bank money market transactions, repurchases transactions, and investments; and trades in debt securities, as well as issues debts. As of December 31, 2020, the company had 1 operational department, 12 branches, 188 sub-branches, 6 micro-to-small sub-branches, and 3 community sub-branches. Bank of Gansu Co., Ltd. was incorporated in 2011 and is headquartered in Lanzhou, China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Lanzhou",
        "zipcode": null,
        "website": "http://www.gsbankchina.com",
        "market_cap": 19138646016
    },
    "2558.HK": {
        "short_name": "JINSHANG BANK",
        "long_name": "Jinshang Bank Co., Ltd.",
        "summary": "Jinshang Bank Co., Ltd. provides commercial banking services in Shanxi Province, China. The company operates through Corporate Banking, Retail Banking, and Treasury Business segments. The company offers corporate banking services, including deposits and corporate loans and advances; and trade financing, agency, wealth management, consulting and advisory, remittance and settlement, and guarantee services to corporations, government agencies, and financial institutions. It also provides retail banking products and services, such as personal loans, deposit-taking activities, personal wealth management services, and remittance services to retail customers. In addition, the company engages in treasury business operations; and inter-bank money market transactions, repurchases transactions, investments, bond investment, and trading activities, as well as debt issuance activities. Further, it is involved in investment management business, including debt securities investment; debt securities distribution activities; and underwriting debt financing instruments. Additionally, the company provides special purpose vehicle investments to invest in trust plans, asset management plans, wealth management products, and investment funds. The company was formerly known as Taiyuan City Commercial Bank Co., Ltd. and changed its name to Jinshang Bank Co., Ltd. in December 2008. Jinshang Bank Co., Ltd. was founded in 1998 and is headquartered in Taiyuan, China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": "030006",
        "website": "http://www.jshbank.com",
        "market_cap": 8991520768
    },
    "2JI.F": {
        "short_name": "BANK OF JINZHOU  H YC 1",
        "long_name": "Bank of Jinzhou Co., Ltd.",
        "summary": "Bank of Jinzhou Co., Ltd. provides various banking products and services in the People's Republic of China. The company operates through Corporate Banking Business, Retail Banking Business, and Treasury Business segments. Its Corporate Banking Business segment provides deposits, loans, settlement and clearing, and other products and services. The company's Retail Banking Business segment offers deposits, bank and credit cards, personal and collateral loans, and personal wealth management services. Its Treasury Business segment provides money market placements, investments and repurchasing, and foreign exchange transactions services. The company also provides advances, payment and settlement, finance leasing, and other banking services. As of December 31, 2020, it operated through a network of 15 branches, 194 sub-branches, 6 mini/community sub-branches, and 1 specialized institution located primarily in Beijing, Tianjin, Harbin, and Liaoning. The company was formerly known as Jinzhou City Commercial Bank Co., Ltd. and changed its name to Bank of Jinzhou Co., Ltd. in December 2015. Bank of Jinzhou Co., Ltd. was incorporated in 1997 and is headquartered in Jinzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Jinzhou",
        "zipcode": "121013",
        "website": "http://www.jinzhoubank.com",
        "market_cap": 2823801344
    },
    "2JJ.F": {
        "short_name": "JIN.JIU.RU.COM.BK C.H YC1",
        "long_name": "Jilin Jiutai Rural Commercial Bank Corporation Limited",
        "summary": "Jilin Jiutai Rural Commercial Bank Corporation Limited provides commercial banking and related financial services to personal, corporate, and small business customers in China. The company operates through three segments: Corporate Banking, Retail Banking, and Treasury Operations. It offers savings and personal notice, time, and corporate deposits, as well as current accounts and certificates of deposit. The company also provides brand class, agriculture, consumer, and other loans; corporate credit products, such as general, equipment, inventory mortgage, land reclamation, operational real estate mortgage, intellectual property pledge, and pledge loans; and loans for micro enterprises, as well as loans for water conservancy construction projects and inland order form financing services. In addition, it offers guarantee, trade finance, and notes discounted products; insurance products; private banking services; financing steward services; asset financing products; finance leasing services; foreign exchange services; agency, consulting and advisory, remittance and settlement, and bank card, personal wealth management services; and e-banking services, as well as trades in debt securities. As of December 31, 2020, the company had 355 outlets, which include 161 outlets comprising three branches in Changchun, Songyuan, and Tonghua; and 374 self-service outlets, 92 self-service areas, and 1,102 self-service facilities. Jilin Jiutai Rural Commercial Bank Corporation Limited was founded in 2008 and is based in Changchun, China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": null,
        "website": "http://www.jtnsh.com",
        "market_cap": 1224835072
    },
    "3618.HK": {
        "short_name": "CQRC BANK",
        "long_name": "Chongqing Rural Commercial Bank Co., Ltd.",
        "summary": "Chongqing Rural Commercial Bank Co., Ltd., together with its subsidiaries, provides a range of banking and related financial services in the People's Republic of China. It operates in three segments: Corporate Banking, Personal Banking, and Financial Market Operations. The Corporate Banking segment offers financial products and services, including deposit takings, corporate loans, trade financing, financial leasing, and other corporate intermediary services to corporations, government agencies, and financial institutions. The Personal Banking segment provides financial products and services, such as deposit products, personal loans, cards, personal wealth management services, and other types of personal intermediary services to individual customers. The Financial Market Operations segment conducts money market or repurchase transactions; and invests in debt instruments on behalf of customers. The company also provides mobile banking, Internet banking, and telephone banking services. As of 31 December 2020, it operated 6 branches and 35 sub-branches with a total of 1,765 operating outlets, 26 first level subbranches, 110 secondary level sub-branches, 1,313 distribution outlets, 2 community branch outlets, and 145 self-service 24-hour banking centers. The company was formerly known as Chongqing Rural Credit Union and changed its name to Chongqing Rural Commercial Bank Co., Ltd. in 2008. Chongqing Rural Commercial Bank Co., Ltd. was founded in 1951 and is headquartered in Chongqing, China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "400023",
        "website": "http://www.cqrcb.com",
        "market_cap": 52107776000
    },
    "3698.HK": {
        "short_name": "HUISHANG BANK",
        "long_name": "Huishang Bank Corporation Limited",
        "summary": "Huishang Bank Corporation Limited, together with its subsidiaries, provides various commercial banking products and services in the People's Republic of China. It operates through four segments: Corporate Banking, Retail Banking, Treasury, and Others. The company offers current accounts, deposits, overdrafts, loans, trade related products and other credit facilities, foreign currency, and wealth management products to corporate customers, government authorities, and financial institutions. It also provides savings deposits, personal loans and advances, credit and debit cards, payments and settlements, wealth management products and funds, and insurance agency services to retail customers. In addition, the company conducts securities investment, money market, and repurchase transactions; and offers online and mobile banking services. Further, it provides Renminbi and foreign currency deposits; and clearing and settlement, assets custody, and finance leasing services. As of December 31, 2020, Huishang Bank Corporation Limited had 21 branches; 481 front offices, including 5 business department branches and 476 sub-branches; 654 self-service banks; and 2,019 cash self-service equipment comprising 1,258 cash recycling machines, 731 smart self-service terminals, and 30 teller machines. The company was formerly known as Hefei Commercial Bank Co., Ltd. and changed its name to Huishang Bank Corporation Limited in November 2005. Huishang Bank Corporation Limited was incorporated in 1997 and is headquartered in Hefei, China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230001",
        "website": "http://www.hsbank.com.cn",
        "market_cap": 35557888000
    },
    "3866.HK": {
        "short_name": "BQD",
        "long_name": "Bank of Qingdao Co., Ltd.",
        "summary": "Bank of Qingdao Co., Ltd. provides various banking products and services in the People's Republic of China. It operates through three segments: Retail Banking, Corporate Banking, and Financial Market Business. The company accepts deposits; provides short, mid, and long-term loans; conducts domestic and overseas settlements, as well as acceptance, discounting, and inter-bank discounting of notes; issues financial bonds; and operates as an agent in issuing, cashing-in, and underwriting government and financial bonds. It also trades in government bonds, notes of central banks, financial and corporate bonds, mid-term notes, short-term financing coupons, and other bonds issued and circulated in the national interbank bond market; participates in interbank lending and borrowing, and interbank deposit businesses; and performs foreign exchange trading as an agent. In addition, the company provides bank cards, and letters of credit and guarantee; and receipt and payment, and insurance business agency services, as well as other agency services, including funds and sales of precious metals. Further, it engages in the bond settlement agency business and the fixed deposits business of commercial banks for cash management of central treasury; and provision of safe deposit box and wealth management services, as well as in the foreign exchange settlement and sales businesses. The company operates 105 in-bank self-service banks; and 423 self-service devices, including 52 self-service ATMs, 252 self-service cash deposit and teller machines, and 117 self-service terminals that provide various services, such as withdrawals, deposits, transfers, account enquiries, and payments. The company was formerly known as Qingdao City Commercial Bank Co., Ltd. and changed its name to Bank of Qingdao Co., Ltd. in 2008. Bank of Qingdao Co., Ltd. was founded in 1996 and is headquartered in Qingdao, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": "266061",
        "website": "http://www.qdccb.com",
        "market_cap": 23639099392
    },
    "3BZ.F": {
        "short_name": "BANK OF ZJENGZHOU H  YC 1",
        "long_name": "Bank of Zhengzhou Co., Ltd.",
        "summary": "Bank of Zhengzhou Co., Ltd., together with its subsidiaries, provides various banking products and services in the People's Republic of China. It operates through Corporate Banking, Retail Banking, and Treasury Business segments. The Corporate Banking segment provides deposit products, corporate loans and advances, trade finance products, financial leasing services, agency services, and remittance and settlement services to corporations, government agencies, and financial institutions. The Retail Banking segment offers deposit products, personal loans, bank cards, personal wealth management services, remittance and settlement services, and collection and payment agency services to retail customers. The Treasury Business segment engages in the interbank money market transactions and repurchases transactions, as well as offers investment services. The company also offers short-term, medium-term, and long-term loans; provides guarantees and safe-deposit box services; accepts and discounts bills; issues financial bonds; acts as an issuing agent, cashing agent, and the underwriter of government bonds; trades in government bonds; and acts as an insurance agent, as well as offers online, telephone, and mobile banking services. As of December 31, 2020, it had 14 branches in Nanyang, Xinxiang, Luoyang, Anyang, Xuchang, Shangqiu, Luohe, Xinyang, Puyang, Pingdingshan, Zhumadian, Kaifeng, Zhoukou, and Hebi of Henan Province; and 158 sub-branches, as well as network of 158 internal and 66 external self-service equipment outlets. The company was formerly known as Commercial Bank of Zhengzhou Co., Ltd. and changed its name to Bank of Zhengzhou Co., Ltd. in December 2009. Bank of Zhengzhou Co., Ltd. was founded in 1996 and is headquartered in Zhengzhou, China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": "450046",
        "website": "http://www.zzbank.cn",
        "market_cap": 3110073600
    },
    "4B1.MU": {
        "short_name": "CHINA BOHAI BANK CO. HD1",
        "long_name": "China Bohai Bank Co., Ltd.",
        "summary": "China Bohai Bank Co., Ltd. provides various personal and corporate banking products and services in the People's Republic of China. The company offers time deposits, personal savings and settlement accounts, and current deposit accounts of foreign currency cash and exchange. It also provides personal unsecured, mortgage, and business loans; working capital and fixed asset loans, loans for construction of low-rent houses, and operating property mortgage loans; combined guarantee credit, collective guarantee loans, business mortgage loans, and commercial installment loans; financing for micro and small-sized enterprises, as well as business loans, bank acceptances, discounting, and L/C services; and trade and supply chain finance. In addition, the company offers debit cards; life and other insurance products; cash and wealth management, foreign exchange, foreign exchange trading, inward and outward foreign currency remittance, export and import collection, export L/C advising and payment, cross-border RMB settlement, investment banking, custody, and treasury and money market services; securities investment funds; and online, mobile, and phone banking services. As of December 31, 2020, it operated 239 outlets, including 34 tier-one branches, 31 tier-two branches, 134 sub-branches, 40 community and micro sub-branches, and 1 overseas branch. China Bohai Bank Co., Ltd. was founded in 2005 and is headquartered in Tianjin, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300012",
        "website": "http://www.cbhb.com.cn",
        "market_cap": 6442558976
    },
    "600000.SS": {
        "short_name": "SHANGHAI PUDONG DEVELOPMENT BAN",
        "long_name": "Shanghai Pudong Development Bank Co., Ltd.",
        "summary": "Shanghai Pudong Development Bank Co., Ltd. provides commercial banking products and services in the People's Republic of China. The company offers various personal banking services, including savings and account management products; wealth management services comprising open-ended funds, special investments, SPDB structured deposits, security investment custody accounts, individual FX trading, collective security investments, and insurance products distribution; cards; lending services, such as deposit/treasury bond pledged loans and car mortgages; online payment and consumption services; and instant messaging services. It also provides corporate banking services consisting of corporate cash management solutions, ebanking solutions, supply chain financing solutions, asset custody solutions, occupational pension products, and trade finance services; and investment banking and offshore banking services, as well as services to small and medium enterprises, and multi-national companies. In addition, the company offers treasury and market products, including foreign exchange risk management, interest rate risk management, structural, fixed income, and commodity exchange products. As of December 31, 2020, it had 1,640 branches. Shanghai Pudong Development Bank Co., Ltd. was founded in 1992 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200002",
        "website": "http://www.spdb.com.cn",
        "market_cap": 298510843904
    },
    "600016.SS": {
        "short_name": "CHINA MINSHENG BANKING CORP",
        "long_name": "China Minsheng Banking Corp., Ltd.",
        "summary": "China Minsheng Banking Corp., Ltd. provides various financial products and services to individuals, small and micro-enterprises, corporate customers, government agencies, and financial institutions in the People's Republic of China. The company operates through Corporate Banking, Retail Banking, and Others segments. Its deposit products include saving accounts, deposit certificates, contracted deposits, agreement deposits, call deposits, corporate term deposits, and corporate current deposits. The company also offers personal housing mortgage, individual automobile purchase, household composite consumption, home, medium and long term, and short-term working capital loans; micro-credit products for individuals; debit and credit cards; and safe deposit boxes. In addition, it provides payment and collection, and clearing services, as well as internet, mobile, and telephone banking services. Further, the company offers gross settlement; wages distribution agency and letter of guarantee; cash management; trade finance; industrial chain finance; individual forex settlement, forex remittance, travelers promissory notes, collection, individual deposit certificate, and guarantee letter products; and comprehensive credit granting, forex settlement and sale, financial product investment, and trust financing services. Additionally, it provides convenient finance, investment banking, and asset management services, as well as non-financial services in the education, business travel, traveler, art, luxury life, health, club, and isports areas. The company has approximately 140 branch-level institutions, 1,178 business outlets, 1,106 community sub-branches, and 138 small business sub-branches. China Minsheng Banking Corp., Ltd. was founded in 1996 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100031",
        "website": "http://www.cmbc.com.cn",
        "market_cap": 193110573056
    },
    "600926.SS": {
        "short_name": "BANK OF HANGZHOU CO LTD",
        "long_name": "Bank of Hangzhou Co., Ltd.",
        "summary": "Bank of Hangzhou Co., Ltd. provides various banking products and services to small and medium enterprises, and urban and rural residents in China. The company operates approximately 180 branches. Bank of Hangzhou Co., Ltd. was founded in 1996 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310003",
        "website": "http://www.hzbank.com.cn",
        "market_cap": 99390152704
    },
    "601009.SS": {
        "short_name": "BANK OF NANJING CO. LTD.",
        "long_name": "Bank of Nanjing Co., Ltd.",
        "summary": "Bank of Nanjing Co., Ltd. provides various financial products and services to micro or small enterprises, medium or large corporates, and employees in China. The company offers RMB or foreign currency deposits, including demand deposits, term deposits, call deposits, and contract deposits in RMB; basic, ordinary, temporary, and special purpose RMB deposit accounts; and current and capital foreign exchange accounts. It also provides working capital loans, project loans, inventory loans, bill discounting services, project loan bill acceptance services, and trade financing services, as well as mortgage loans; LC credit limit, import LC, shipping guarantee, and trust receipt loans for importers; and financing on the order, export LC financing, package loan, discounted commercial invoice, forfeiting, and financing on export insurance services for exporters. In addition, the company offers salary card, salary payment, wealth management, credit card, consumer finance, online corporate banking, corporate card, and risk hedging services; and cash management services, including account, collection and payment, investment and financing, liquidity, and risk management. Further, it provides trade services, such as international remittance, RMB cross-border settlement, letter of credit, international collection, letter of guarantee and SBLCs, foreign exchange spot and forward, and trade specialist contact. The company operates through a network of 136 branches. Bank of Nanjing Co., Ltd. was founded in 1996 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210008",
        "website": "http://www.njcb.com.cn",
        "market_cap": 101370912768
    },
    "601128.SS": {
        "short_name": "JIANGSU CHANGSHU RURAL COMML BA",
        "long_name": "Jiangsu Changshu Rural Commercial Bank Co., Ltd.",
        "summary": "Jiangsu Changshu Rural Commercial Bank Co., Ltd. provides rural financial services in China. The company offers personal savings, debit and credit cards, payment services, financial management services, private banking services, and insurance and third party depository services, as well as microfinance products. It also provides village, agricultural construction, rural, grain, fishing, farm, and shed reform loans; corporate finance products; cash management, settlement, and agency services; and foreign exchange trading and international settlement services, as well as international trade finance products. In addition, the company offers investment banking and financial markets services, as well as online banking services. Jiangsu Changshu Rural Commercial Bank Co., Ltd. was founded in 2001 and is based in Changshu, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changshu",
        "zipcode": "215500",
        "website": "http://www.csrcbank.com",
        "market_cap": 18665254912
    },
    "601577.SS": {
        "short_name": "BANK OF CHANGSHA CO LTD",
        "long_name": "Bank of Changsha Co., Ltd.",
        "summary": "Bank of Changsha Co., Ltd. provides various commercial banking products and services to personal and business customers in China. It offers savings products; deposits; consumer, operating, working capital, fixed asset, business, patent pledge, quick, POS, rent, and M&A loans; and credit mortgages, as well as social security services, housing funds, traffic penalty, and living payment services. The company also provides investment and financial management, investment banking, trade finance, foreign exchange trading, and settlement services; credit cards; Internet finance; and mobile, online, WeChat, and telephone banking services. Bank of Changsha Co., Ltd. was founded in 1997 and is headquartered in Changsha, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": "410205",
        "website": "http://www.bankofchangsha.com",
        "market_cap": 36998258688
    },
    "601658.SS": {
        "short_name": "POSTAL SAVINGS BANK OF CHINA CO",
        "long_name": "Postal Savings Bank of China Co., Ltd.",
        "summary": "Postal Savings Bank of China Co., Ltd. provides various banking products and services for retail and corporate customers in the People's Republic of China. Its Personal Banking segment offers savings products, such as demand, time, personal call, time/demand optional, and foreign currency deposits; passbooks; certificate of deposits; micro, personal pledged, and personal business loans; debit and credit cards; wealth management products and funds; and insurance agency services. This segment is also involved in distribution of fund products, electronic bonds, and precious metals; and provides payment and collection agency, various settlement, domestic remittance and exchange, cross-border remittance, personal exchange settlement and sale, and foreign currency exchange services. The company's Corporate Banking segment provides time, demand, call, and negotiated deposits; working capital, fixed asset, trade finance, stock pledge, land reserve, syndicated, real estate development, property mortgage, and consignment loans; cash management services; negotiable instruments; trade finance and international settlement services; and financial markets services. Its Treasury segment offers interbank lending transactions, repurchase and resale transactions, debt instrument investments, equity instrument investment, investment banking, bond securities, and wealth management products, etc., as well as trades in financial products comprising money market, fixed income, and foreign exchange products, as well as derivatives and precious metals. The company also provides online, mobile, and self-service banking services. As of December 31, 2020, it had 39,631 outlets, including 8,568 directly operated outlets and 31,763 agency outlets. The company was founded in 2007 and is headquartered in Beijing, the People's Republic of China. Postal Savings Bank of China Co., Ltd. is a subsidiary of China Post Group Corporation.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100808",
        "website": "http://www.psbc.com",
        "market_cap": 468953595904
    },
    "601818.SS": {
        "short_name": "CHINA EVERBRIGHT BANK CO LTD",
        "long_name": "China Everbright Bank Company Limited",
        "summary": "China Everbright Bank Company Limited provides commercial banking products and services to corporate and retail clients in Mainland China, Hong Kong, Seoul, Sydney, and Luxembourg. It operates through Corporate Banking, Retail Banking, Financial Market Business, and Others segments. The company offers personal financial services, including personal saving deposits comprising RMB deposits, foreign currency deposits, and evidence treasury bonds; private personal loan credit products consisting of auto loans, personal project loans, personal employment enterprise loans, personal loans pledged by valuable documents, housing mortgage loans, personal commercial housing mortgage loans, personal consumer loans, and small business owner loans; personal wealth management services; payroll management, money transfer, financing abroad, and other services; and credit and debit cards. It also provides corporate financial services, which include trade financing, working capital, fixed asset, project financing, and syndicated loans, short term loans, and entrusted loan; RMB settlement and related services; international settlement services; factoring, remittance, and letters of guarantee; and inter-bank money market transactions, repurchase transactions, and inter-bank investments, as well as debt securities, derivatives, and foreign currency, as well as issuance of debts. In addition, the company engages in trust, insurance, and fund business. As of December 31, 2020, it operated 1,296 branches and outlets covering 149 economic center cities across the country. The company was founded in 1992 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100033",
        "website": "http://www.cebbank.com",
        "market_cap": 194201681920
    },
    "601916.SS": {
        "short_name": "CHINA ZHESHANG BANK CO. LTD",
        "long_name": "China Zheshang Bank Co., Ltd",
        "summary": "China Zheshang Bank Co., Ltd. provides a range of banking products and services in Mainland China. It operates through Corporate Banking, Retail Banking, and Treasury Business segments. The Corporate Banking segment offers a range of financial products and services, including corporate loans and advances, trade finance, deposit products, and other types of corporate intermediary services. The Retail Banking segment provides personal loans and advances, deposit products, bank cards business, and other types of personal intermediary services. The Treasury Business segment offers money market and repurchase transactions, debt instruments investments, financial derivatives business for proprietary trading or on behalf of customers, and financial products and services, as well as issues debt securities. The company serves individuals, corporations, government agencies, and financial institutions. As of December 31, 2020, the company had 270 branch outlets in 20 provinces and Hong Kong in China. China Zheshang Bank Co., Ltd. was incorporated in 1993 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310006",
        "website": "http://www.czbank.com",
        "market_cap": 80047202304
    },
    "601997.SS": {
        "short_name": "BANK OF GUIYANG CO. LTD",
        "long_name": "Bank of Guiyang Co.,Ltd.",
        "summary": "Bank of Guiyang Co., Ltd. provides various financial and banking products and services in China. It offers current savings products; and zero deposit, interest, notice, demand, time, notification, agreement, and treasury cash deposit products. The company also provides various loan products, such as working capital, fixed asset, business, real estate project development, inventory guarantee, mortgage, forest property pledge, consumer, structure, entrusted, trade, and home loans; credit cards; payment and account management services; and online and mobile banking services. In addition, it engages in investment banking, fund, consulting, bond underwriting, asset securitization, letter of credit and guarantee, and insurance agency businesses. The company was formerly known as Guiyang Commercial Bank and changed its name to Bank of Guiyang Co., Ltd. in 2012. Bank of Guiyang Co., Ltd. was founded in 1997 and is headquartered in Guiyang, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guiyang",
        "zipcode": "55081",
        "website": "http://www.bankgy.cn",
        "market_cap": 28298987520
    },
    "6122.HK": {
        "short_name": "JIUTAI RCB",
        "long_name": "Jilin Jiutai Rural Commercial Bank Corporation Limited",
        "summary": "Jilin Jiutai Rural Commercial Bank Corporation Limited provides commercial banking and related financial services to personal, corporate, and small business customers in China. The company operates through three segments: Corporate Banking, Retail Banking, and Treasury Operations. It offers savings and personal notice, time, and corporate deposits, as well as current accounts and certificates of deposit. The company also provides brand class, agriculture, consumer, and other loans; corporate credit products, such as general, equipment, inventory mortgage, land reclamation, operational real estate mortgage, intellectual property pledge, and pledge loans; and loans for micro enterprises, as well as loans for water conservancy construction projects and inland order form financing services. In addition, it offers guarantee, trade finance, and notes discounted products; insurance products; private banking services; financing steward services; asset financing products; finance leasing services; foreign exchange services; agency, consulting and advisory, remittance and settlement, and bank card, personal wealth management services; and e-banking services, as well as trades in debt securities. As of December 31, 2020, the company had 355 outlets, which include 161 outlets comprising three branches in Changchun, Songyuan, and Tonghua; and 374 self-service outlets, 92 self-service areas, and 1,102 self-service facilities. Jilin Jiutai Rural Commercial Bank Corporation Limited was founded in 2008 and is based in Changchun, China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": null,
        "website": "http://www.jtnsh.com",
        "market_cap": 11554222080
    },
    "6138.HK": {
        "short_name": "HARBIN BANK",
        "long_name": "Harbin Bank Co., Ltd.",
        "summary": "Harbin Bank Co., Ltd. provides various commercial banking products and services primarily in Mainland China. It operates through four segments: Corporate Financial Business, Retail Financial Business, Interbank Financial Business, and Other Business. The company offers demand and time deposit products, personal loans, collateral loans, corporate loans, and agricultural loans, as well as bank card and credit card products. In addition, it provides settlement and clearing services, as well as other products and services relating to trading business; personal wealth management services; and money market placement, investment and repurchasing, and foreign exchange transaction services. Further the company offers online, mobile, and phone banking services; and project financing, financial management and consulting, underwriting and issuing, and asset custody services. As of December 31, 2020, it operated through 311 branch outlets, including 17 branches, 292 sub-branches, 1 branch-level financial service center for small enterprises, and 1 headquarters business department. The company was formerly known as Harbin City Commercial Bank Co., Ltd. and changed its name to Harbin Bank Co., Ltd. in November 2007. Harbin Bank Co., Ltd. was incorporated in 1997 and is headquartered in Harbin, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": "150010",
        "website": "http://www.hrbb.com.cn",
        "market_cap": 10885644288
    },
    "6190.HK": {
        "short_name": "BANKOFJIUJIANG",
        "long_name": "Bank of Jiujiang Co., Ltd.",
        "summary": "Bank of Jiujiang Co., Ltd. provides various banking and financial products and services for individuals, corporate customers, and small and micro enterprises in the People's Republic of China. It operates through Corporate Banking, Retail Banking, and Financial Market Business segments. The company offers demand, time, pledged, and corporate deposit products, as well as certificates of deposit; personal loans for consumption and business purposes; residential mortgage loans; personal wealth management services; corporate loans, and green financing products; and trade financing services, as well as debit and credit cards. It also provides various services, including handling domestic and overseas settlements, as well as bill acceptance, settlement, and discounting; issuing financial bonds; acting as agent to issue, settle, and underwrite government bonds; trading of government bonds and financial bonds; inter-bank placements; offering letters of credit services and guarantees; acting as agent on inward and outward payments, and acting as insurance agent; sale of securities investment funds; and safe-box service and other businesses. In addition, the company conducts money market or repurchase transactions, and financial investments, as well as provides online, mobile, telephone, and self-service banking services. As of December 31, 2020, it operated through 13 branches and 262 sub-branches. The company was incorporated in 2000 and is headquartered in Jiujiang, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Jiujiang",
        "zipcode": "332000",
        "website": "http://www.jjccb.com",
        "market_cap": 26240331776
    },
    "6196.HK": {
        "short_name": "BANKOFZHENGZHOU",
        "long_name": "Bank of Zhengzhou Co., Ltd.",
        "summary": "Bank of Zhengzhou Co., Ltd., together with its subsidiaries, provides various banking products and services in the People's Republic of China. It operates through Corporate Banking, Retail Banking, and Treasury Business segments. The Corporate Banking segment provides deposit products, corporate loans and advances, trade finance products, financial leasing services, agency services, and remittance and settlement services to corporations, government agencies, and financial institutions. The Retail Banking segment offers deposit products, personal loans, bank cards, personal wealth management services, remittance and settlement services, and collection and payment agency services to retail customers. The Treasury Business segment engages in the interbank money market transactions and repurchases transactions, as well as offers investment services. The company also offers short-term, medium-term, and long-term loans; provides guarantees and safe-deposit box services; accepts and discounts bills; issues financial bonds; acts as an issuing agent, cashing agent, and the underwriter of government bonds; trades in government bonds; and acts as an insurance agent, as well as offers online, telephone, and mobile banking services. As of December 31, 2020, it had 14 branches in Nanyang, Xinxiang, Luoyang, Anyang, Xuchang, Shangqiu, Luohe, Xinyang, Puyang, Pingdingshan, Zhumadian, Kaifeng, Zhoukou, and Hebi of Henan Province; and 158 sub-branches, as well as network of 158 internal and 66 external self-service equipment outlets. The company was formerly known as Commercial Bank of Zhengzhou Co., Ltd. and changed its name to Bank of Zhengzhou Co., Ltd. in December 2009. Bank of Zhengzhou Co., Ltd. was founded in 1996 and is headquartered in Zhengzhou, China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": "450046",
        "website": "http://www.zzbank.cn",
        "market_cap": 29413535744
    },
    "6199.HK": {
        "short_name": "BANK OF GUIZHOU",
        "long_name": "Bank of Guizhou Co., Ltd.",
        "summary": "Bank of Guizhou Co., Ltd. provides various banking products and services in the People's Republic of China. It operates through Corporate Banking, Retail Banking, and Financial Markets segments. The company offers time and demand deposits; corporate loans and advances, such as working capital and fixed asset loans; personal loans, including residential mortgage, business, and consumption loans; corporate loans and advances; trade financing, agency, wealth management, consultancy, settlement and clearing, and acceptance and guarantee services; credit cards; remittance services; and loans to micro and small enterprises. It is also involved in the inter-bank money market transaction, transaction repurchase, and investment activities, as well as trading of debt securities. As of December 31, 2020, the company operated 8 branches. Bank of Guizhou Co., Ltd. was incorporated in 2012 and is headquartered in Guiyang, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guiyang",
        "zipcode": "550081",
        "website": "http://www.bgzchina.com",
        "market_cap": 36761759744
    },
    "6818.HK": {
        "short_name": "CEB BANK",
        "long_name": "China Everbright Bank Company Limited",
        "summary": "China Everbright Bank Company Limited provides commercial banking products and services to corporate and retail clients in Mainland China, Hong Kong, Seoul, Sydney, and Luxembourg. It operates through Corporate Banking, Retail Banking, Financial Market Business, and Others segments. The company offers personal financial services, including personal saving deposits comprising RMB deposits, foreign currency deposits, and evidence treasury bonds; private personal loan credit products consisting of auto loans, personal project loans, personal employment enterprise loans, personal loans pledged by valuable documents, housing mortgage loans, personal commercial housing mortgage loans, personal consumer loans, and small business owner loans; personal wealth management services; payroll management, money transfer, financing abroad, and other services; and credit and debit cards. It also provides corporate financial services, which include trade financing, working capital, fixed asset, project financing, and syndicated loans, short term loans, and entrusted loan; RMB settlement and related services; international settlement services; factoring, remittance, and letters of guarantee; and inter-bank money market transactions, repurchase transactions, and inter-bank investments, as well as debt securities, derivatives, and foreign currency, as well as issuance of debts. In addition, the company engages in trust, insurance, and fund business. As of December 31, 2020, it operated 1,296 branches and outlets covering 149 economic center cities across the country. The company was founded in 1992 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100033",
        "website": "http://www.cebbank.com",
        "market_cap": 231696498688
    },
    "6SY.F": {
        "short_name": "SHENGJING BANK H  YC 1",
        "long_name": "Shengjing Bank Co., Ltd.",
        "summary": "Shengjing Bank Co., Ltd., together with its subsidiaries, provides banking products and services to individual and corporate customers in Mainland China. Its Corporate Banking segment offers corporate loans and advances, trade financing and deposit taking services, agency services, and remittance and settlement services to corporations, government agencies, and financial institutions. The company's Retail Banking segment provides financial products and services to retail customers, including personal loans and deposit taking services, bank cards, personal wealth management services, remittance and settlement services, and collection and payment agency services. Its Treasury Business segment is involved in inter-bank money market transactions, repurchases transactions, and investment activities, as well as trading in debt securities. The company also provides investment in equities, and online and mobile banking services. As of December 31, 2020, it operated 208 institutional outlets, including one head office, three branch-level specialized institutions, 18 branches, five small sub-branches, and 181 sub-branches; and 1,781 self-service facilities, such as cash recycling systems, inquiry and payment machines, mobile card activating machines, VTMs, smart counters, cash recycling systems, interactive desktops, and other self-service facilities. The company was formerly known as Shenyang Commercial Bank Co., Ltd. and changed its name to Shengjing Bank Co., Ltd. in February 2007. Shengjing Bank Co., Ltd. was incorporated in 1997 and is headquartered in Shenyang, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenyang",
        "zipcode": "110013",
        "website": "http://www.shengjingbank.com.cn",
        "market_cap": 6532560384
    },
    "9668.HK": {
        "short_name": "CBHB",
        "long_name": "China Bohai Bank Co., Ltd.",
        "summary": "China Bohai Bank Co., Ltd. provides various personal and corporate banking products and services in the People's Republic of China. The company offers time deposits, personal savings and settlement accounts, and current deposit accounts of foreign currency cash and exchange. It also provides personal unsecured, mortgage, and business loans; working capital and fixed asset loans, loans for construction of low-rent houses, and operating property mortgage loans; combined guarantee credit, collective guarantee loans, business mortgage loans, and commercial installment loans; financing for micro and small-sized enterprises, as well as business loans, bank acceptances, discounting, and L/C services; and trade and supply chain finance. In addition, the company offers debit cards; life and other insurance products; cash and wealth management, foreign exchange, foreign exchange trading, inward and outward foreign currency remittance, export and import collection, export L/C advising and payment, cross-border RMB settlement, investment banking, custody, and treasury and money market services; securities investment funds; and online, mobile, and phone banking services. As of December 31, 2020, it operated 239 outlets, including 34 tier-one branches, 31 tier-two branches, 134 sub-branches, 40 community and micro sub-branches, and 1 overseas branch. China Bohai Bank Co., Ltd. was founded in 2005 and is headquartered in Tianjin, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300012",
        "website": "http://www.cbhb.com.cn",
        "market_cap": 58614603776
    },
    "9677.HK": {
        "short_name": "WEIHAI BANK",
        "long_name": "Weihai City Commercial Bank Co., Ltd.",
        "summary": "Weihai City Commercial Bank Co., Ltd., together with its subsidiaries, provides banking and related financial services to corporate and retail banking, and financial market customers in China. It offers savings deposits; consumer and business loans and guarantees; safe deposit boxes; bank cards; and personal finance, payment and settlement, payroll, money transfer, remittance, and trade finance services. The company is also involved in the insurance, agency, bill, and foreign exchange businesses. In addition, it offers online, mobile, direct, telephone, and WeChat banking services, as well as ATMs, self-service deposit, and withdrawal machines. It operates approximately 120 branches. Weihai City Commercial Bank Co., Ltd. was founded in 1997 and is based in Weihai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Weihai",
        "zipcode": "264200",
        "website": "http://www.whccb.com",
        "market_cap": 20033200128
    },
    "BJ8.F": {
        "short_name": "BANK OF JIUJIANG  H  YC1",
        "long_name": "Bank of Jiujiang Co., Ltd.",
        "summary": "Bank of Jiujiang Co., Ltd. provides various banking and financial products and services for individuals, corporate customers, and small and micro enterprises in the People's Republic of China. It operates through Corporate Banking, Retail Banking, and Financial Market Business segments. The company offers demand, time, pledged, and corporate deposit products, as well as certificates of deposit; personal loans for consumption and business purposes; residential mortgage loans; personal wealth management services; corporate loans, and green financing products; and trade financing services, as well as debit and credit cards. It also provides various services, including handling domestic and overseas settlements, as well as bill acceptance, settlement, and discounting; issuing financial bonds; acting as agent to issue, settle, and underwrite government bonds; trading of government bonds and financial bonds; inter-bank placements; offering letters of credit services and guarantees; acting as agent on inward and outward payments, and acting as insurance agent; sale of securities investment funds; and safe-box service and other businesses. In addition, the company conducts money market or repurchase transactions, and financial investments, as well as provides online, mobile, telephone, and self-service banking services. As of December 31, 2020, it operated through 13 branches and 262 sub-branches. The company was incorporated in 2000 and is headquartered in Jiujiang, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Jiujiang",
        "zipcode": "332000",
        "website": "http://www.jjccb.com",
        "market_cap": 2752142336
    },
    "C0V.F": {
        "short_name": "CHINA EVERB.BANK CO.H YC1",
        "long_name": "China Everbright Bank Company Limited",
        "summary": "China Everbright Bank Company Limited provides commercial banking products and services to corporate and retail clients in Mainland China, Hong Kong, Seoul, Sydney, and Luxembourg. It operates through Corporate Banking, Retail Banking, Financial Market Business, and Others segments. The company offers personal financial services, including personal saving deposits comprising RMB deposits, foreign currency deposits, and evidence treasury bonds; private personal loan credit products consisting of auto loans, personal project loans, personal employment enterprise loans, personal loans pledged by valuable documents, housing mortgage loans, personal commercial housing mortgage loans, personal consumer loans, and small business owner loans; personal wealth management services; payroll management, money transfer, financing abroad, and other services; and credit and debit cards. It also provides corporate financial services, which include trade financing, working capital, fixed asset, project financing, and syndicated loans, short term loans, and entrusted loan; RMB settlement and related services; international settlement services; factoring, remittance, and letters of guarantee; and inter-bank money market transactions, repurchase transactions, and inter-bank investments, as well as debt securities, derivatives, and foreign currency, as well as issuance of debts. In addition, the company engages in trust, insurance, and fund business. As of December 31, 2020, it operated 1,296 branches and outlets covering 149 economic center cities across the country. The company was founded in 1992 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100033",
        "website": "http://www.cebbank.com",
        "market_cap": 24612124672
    },
    "C3B.F": {
        "short_name": "CHONGQING RURAL COMM. H",
        "long_name": "Chongqing Rural Commercial Bank Co., Ltd.",
        "summary": "Chongqing Rural Commercial Bank Co., Ltd., together with its subsidiaries, provides a range of banking and related financial services in the People's Republic of China. It operates in three segments: Corporate Banking, Personal Banking, and Financial Market Operations. The Corporate Banking segment offers financial products and services, including deposit takings, corporate loans, trade financing, financial leasing, and other corporate intermediary services to corporations, government agencies, and financial institutions. The Personal Banking segment provides financial products and services, such as deposit products, personal loans, cards, personal wealth management services, and other types of personal intermediary services to individual customers. The Financial Market Operations segment conducts money market or repurchase transactions; and invests in debt instruments on behalf of customers. The company also provides mobile banking, Internet banking, and telephone banking services. As of 31 December 2020, it operated 6 branches and 35 sub-branches with a total of 1,765 operating outlets, 26 first level subbranches, 110 secondary level sub-branches, 1,313 distribution outlets, 2 community branch outlets, and 145 self-service 24-hour banking centers. The company was formerly known as Chongqing Rural Credit Union and changed its name to Chongqing Rural Commercial Bank Co., Ltd. in 2008. Chongqing Rural Commercial Bank Co., Ltd. was founded in 1951 and is headquartered in Chongqing, China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "400023",
        "website": "http://www.cqrcb.com",
        "market_cap": 5483578368
    },
    "CGMBF": {
        "short_name": "CHINA MINSHENG BANKING CORP",
        "long_name": "China Minsheng Banking Corp., Ltd.",
        "summary": "China Minsheng Banking Corp., Ltd. provides various financial products and services to individuals, small and micro-enterprises, corporate customers, government agencies, and financial institutions in the People's Republic of China. The company operates through Corporate Banking, Retail Banking, and Others segments. Its deposit products include saving accounts, deposit certificates, contracted deposits, agreement deposits, call deposits, corporate term deposits, and corporate current deposits. The company also offers personal housing mortgage, individual automobile purchase, household composite consumption, home, medium and long term, and short-term working capital loans; micro-credit products for individuals; debit and credit cards; and safe deposit boxes. In addition, it provides payment and collection, and clearing services, as well as internet, mobile, and telephone banking services. Further, the company offers gross settlement; wages distribution agency and letter of guarantee; cash management; trade finance; industrial chain finance; individual forex settlement, forex remittance, travelers promissory notes, collection, individual deposit certificate, and guarantee letter products; and comprehensive credit granting, forex settlement and sale, financial product investment, and trust financing services. Additionally, it provides convenient finance, investment banking, and asset management services, as well as non-financial services in the education, business travel, traveler, art, luxury life, health, club, and isports areas. The company has approximately 140 branch-level institutions, 1,178 business outlets, 1,106 community sub-branches, and 138 small business sub-branches. China Minsheng Banking Corp., Ltd. was founded in 1996 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100031",
        "website": "http://www.cmbc.com.cn",
        "market_cap": 31779428352
    },
    "CHBJF": {
        "short_name": "CHINA CITIC BANK CORPORATION LT",
        "long_name": "China CITIC Bank Corporation Limited",
        "summary": "China CITIC Bank Corporation Limited provides various banking products and services in the People's Republic of China and internationally. The company operates through Corporate Banking, Personal Banking, and Treasury Operations segments. It accepts deposits; offers corporate and personal loans; and provides securities agency, remittance and settlement, and guarantee services, as well as investment banking and international services. The company also engages in the capital markets operations and inter-bank operations, including inter-bank money market transactions, repurchase transactions, investments, and trading in debt instruments; and derivatives and forex trading. In addition, it offers asset management, finance leasing, and other non-banking financial services. The company serves corporations, government agencies, and non-financial institutions; and individual customers and small enterprises. As of December 31, 2020, it operated 1,405 outlets, including 37 tier-one branches, 126 tier-two branches, and 1,242 sub-branches; 1,633 self-service banks; and 5,687 self-service terminals, as well as 6,703 smart teller machines. The company was founded in 1987 and is headquartered in Beijing, the People's Republic of China. China CITIC Bank Corporation Limited is a subsidiary of CITIC Corporation Limited.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100020",
        "website": "http://www.citicbank.com",
        "market_cap": 34329421824
    },
    "CHCJY": {
        "short_name": "CHINA CITIC BANK CORPORATION LT",
        "long_name": "China CITIC Bank Corporation Limited",
        "summary": "China CITIC Bank Corporation Limited provides various banking products and services in the People's Republic of China and internationally. The company operates through Corporate Banking, Personal Banking, and Treasury Operations segments. It accepts deposits; offers corporate and personal loans; and provides securities agency, remittance and settlement, and guarantee services, as well as investment banking and international services. The company also engages in the capital markets operations and inter-bank operations, including inter-bank money market transactions, repurchase transactions, investments, and trading in debt instruments; and derivatives and forex trading. In addition, it offers asset management, finance leasing, and other non-banking financial services. The company serves corporations, government agencies, and non-financial institutions; and individual customers and small enterprises. As of December 31, 2020, it operated 1,405 outlets, including 37 tier-one branches, 126 tier-two branches, and 1,242 sub-branches; 1,633 self-service banks; and 5,687 self-service terminals, as well as 6,703 smart teller machines. The company was founded in 1987 and is headquartered in Beijing, the People's Republic of China. China CITIC Bank Corporation Limited is a subsidiary of CITIC Corporation Limited.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100020",
        "website": "http://www.citicbank.com",
        "market_cap": 36623749120
    },
    "CIHHF": {
        "short_name": "CHINA MERCHANTS BANK CO LTD",
        "long_name": "China Merchants Bank Co., Ltd.",
        "summary": "China Merchants Bank Co., Ltd. provides various banking products and services. It operates through Wholesale Finance Business, Retail Finance Business, and Other Business segments. The company accepts demand, time, call, savings, checking, notice, and renminbi accounts. Its loan products include personal commercial real estate, consumption, housing, and car loans; loans to finance for studying abroad; micro-business loans; mortgage loans for equipment; bank acceptance, discount, liquid capital, and fixed asset loans; and loans for vessels. The company also offers credit cards; insurance products; open-ended funds; discount and guarantee for commercial bills, redemption of commercial bills, and guaranteed discount for commercial acceptance bills; and financial consultation, debt financing underwriting, merger and acquisition financing, and equity financing and enterprise listing services. In addition, it provides forfeiting and risk participation, escrow, cross border RMB clearing, and interbank services; and risk and financial management, cross border RMB and oversea financing, international factoring and settlement, and trade finance services. Further, the company offers financial leasing and guarantee, third-party payment, cash management, investment and wealth management, forex option and gold trading, forex express trading, settlement, trade chain financing, international, offshore and private banking, custody, pension, and electronic banking services. As of December 31, 2020, it operated 142 branches; 1,724 sub-branches; one branch-level operation center; one representative office; 16,559 visual counters in Mainland China. The company also operated a branch in Hong Kong; a branch and representative office in New York, the United States; a branch in London, the United Kingdom; a branch in Singapore; a branch in Luxembourg; a representative office in Taipei; and a branch in Sydney, Australia. The company was founded in 1987 and is headquartered in Shenzhen, China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518040",
        "website": "http://www.cmbchina.com",
        "market_cap": 231723089920
    },
    "CIHKY": {
        "short_name": "CHINA MERCHANTS BANK CO LTD",
        "long_name": "China Merchants Bank Co., Ltd.",
        "summary": "China Merchants Bank Co., Ltd. provides various banking products and services. It operates through Wholesale Finance Business, Retail Finance Business, and Other Business segments. The company accepts demand, time, call, savings, checking, notice, and renminbi accounts. Its loan products include personal commercial real estate, consumption, housing, and car loans; loans to finance for studying abroad; micro-business loans; mortgage loans for equipment; bank acceptance, discount, liquid capital, and fixed asset loans; and loans for vessels. The company also offers credit cards; insurance products; open-ended funds; discount and guarantee for commercial bills, redemption of commercial bills, and guaranteed discount for commercial acceptance bills; and financial consultation, debt financing underwriting, merger and acquisition financing, and equity financing and enterprise listing services. In addition, it provides forfeiting and risk participation, escrow, cross border RMB clearing, and interbank services; and risk and financial management, cross border RMB and oversea financing, international factoring and settlement, and trade finance services. Further, the company offers financial leasing and guarantee, third-party payment, cash management, investment and wealth management, forex option and gold trading, forex express trading, settlement, trade chain financing, international, offshore and private banking, custody, pension, and electronic banking services. As of December 31, 2020, it operated 142 branches; 1,724 sub-branches; one branch-level operation center; one representative office; 16,559 visual counters in Mainland China. The company also operated a branch in Hong Kong; a branch and representative office in New York, the United States; a branch in London, the United Kingdom; a branch in Singapore; a branch in Luxembourg; a representative office in Taipei; and a branch in Sydney, Australia. The company was founded in 1987 and is headquartered in Shenzhen, China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518040",
        "website": "http://www.cmbchina.com",
        "market_cap": 226705637376
    },
    "CMAKY": {
        "short_name": "CHINA MINSHENG BANKING CORP",
        "long_name": "China Minsheng Banking Corp., Ltd.",
        "summary": "China Minsheng Banking Corp., Ltd. provides various financial products and services to individuals, small and micro-enterprises, corporate customers, government agencies, and financial institutions in the People's Republic of China. The company operates through Corporate Banking, Retail Banking, and Others segments. Its deposit products include saving accounts, deposit certificates, contracted deposits, agreement deposits, call deposits, corporate term deposits, and corporate current deposits. The company also offers personal housing mortgage, individual automobile purchase, household composite consumption, home, medium and long term, and short-term working capital loans; micro-credit products for individuals; debit and credit cards; and safe deposit boxes. In addition, it provides payment and collection, and clearing services, as well as internet, mobile, and telephone banking services. Further, the company offers gross settlement; wages distribution agency and letter of guarantee; cash management; trade finance; industrial chain finance; individual forex settlement, forex remittance, travelers promissory notes, collection, individual deposit certificate, and guarantee letter products; and comprehensive credit granting, forex settlement and sale, financial product investment, and trust financing services. Additionally, it provides convenient finance, investment banking, and asset management services, as well as non-financial services in the education, business travel, traveler, art, luxury life, health, club, and isports areas. The company has approximately 140 branch-level institutions, 1,178 business outlets, 1,106 community sub-branches, and 138 small business sub-branches. China Minsheng Banking Corp., Ltd. was founded in 1996 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100031",
        "website": "http://www.cmbc.com.cn",
        "market_cap": 30372157440
    },
    "CQN.F": {
        "short_name": "BANK OF CHONGQING  H YC1",
        "long_name": "Bank of Chongqing Co., Ltd.",
        "summary": "Bank of Chongqing Co., Ltd. provides various banking and related financial services for corporate and individual customers in the People's Republic of China. It operates through three segments: Corporate Banking, Retail Banking, and Treasury. The company offers various deposit products and loans; inter-bank lending and borrowing, bonds investment, re-purchasing, and foreign currency transactions; and telephone, mobile, and online and direct banking services, as well as settlement services, financial leasing, and other services. As of December 31, 2020, it operated 145 sub-units, including a business department, a small enterprise loan center, four primary branches, 172 self-service banking centers, and 280 intelligent teller machines covering 38 districts and counties of Chongqing, as well as three provinces in western China. The company was formerly known as Commercial Bank of Chongqing Co., Ltd. and changed its name to Bank of Chongqing Co., Ltd. in August 2007. Bank of Chongqing Co., Ltd. was incorporated in 1996 and is headquartered in Chongqing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "400024",
        "website": "http://www.cqcbank.com",
        "market_cap": 1713620864
    },
    "D7C.F": {
        "short_name": "CHINA CITIC BANK H  YC 1",
        "long_name": "China CITIC Bank Corporation Limited",
        "summary": "China CITIC Bank Corporation Limited provides various banking products and services in the People's Republic of China and internationally. The company operates through Corporate Banking, Personal Banking, and Treasury Operations segments. It accepts deposits; offers corporate and personal loans; and provides securities agency, remittance and settlement, and guarantee services, as well as investment banking and international services. The company also engages in the capital markets operations and inter-bank operations, including inter-bank money market transactions, repurchase transactions, investments, and trading in debt instruments; and derivatives and forex trading. In addition, it offers asset management, finance leasing, and other non-banking financial services. The company serves corporations, government agencies, and non-financial institutions; and individual customers and small enterprises. As of December 31, 2020, it operated 1,405 outlets, including 37 tier-one branches, 126 tier-two branches, and 1,242 sub-branches; 1,633 self-service banks; and 5,687 self-service terminals, as well as 6,703 smart teller machines. The company was founded in 1987 and is headquartered in Beijing, the People's Republic of China. China CITIC Bank Corporation Limited is a subsidiary of CITIC Corporation Limited.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100020",
        "website": "http://www.citicbank.com",
        "market_cap": 30528741376
    },
    "GHFH.F": {
        "short_name": "CHINA MINSHENG BK. H YC 1",
        "long_name": "China Minsheng Banking Corp., Ltd.",
        "summary": "China Minsheng Banking Corp., Ltd. provides various financial products and services to individuals, small and micro-enterprises, corporate customers, government agencies, and financial institutions in the People's Republic of China. The company operates through Corporate Banking, Retail Banking, and Others segments. Its deposit products include saving accounts, deposit certificates, contracted deposits, agreement deposits, call deposits, corporate term deposits, and corporate current deposits. The company also offers personal housing mortgage, individual automobile purchase, household composite consumption, home, medium and long term, and short-term working capital loans; micro-credit products for individuals; debit and credit cards; and safe deposit boxes. In addition, it provides payment and collection, and clearing services, as well as internet, mobile, and telephone banking services. Further, the company offers gross settlement; wages distribution agency and letter of guarantee; cash management; trade finance; industrial chain finance; individual forex settlement, forex remittance, travelers promissory notes, collection, individual deposit certificate, and guarantee letter products; and comprehensive credit granting, forex settlement and sale, financial product investment, and trust financing services. Additionally, it provides convenient finance, investment banking, and asset management services, as well as non-financial services in the education, business travel, traveler, art, luxury life, health, club, and isports areas. The company has approximately 140 branch-level institutions, 1,178 business outlets, 1,106 community sub-branches, and 138 small business sub-branches. China Minsheng Banking Corp., Ltd. was founded in 1996 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100031",
        "website": "http://www.cmbc.com.cn",
        "market_cap": 24766877696
    },
    "HB8.F": {
        "short_name": "HUISHANG BK CORP. H  YC1",
        "long_name": "Huishang Bank Corporation Limited",
        "summary": "Huishang Bank Corporation Limited, together with its subsidiaries, provides various commercial banking products and services in the People's Republic of China. It operates through four segments: Corporate Banking, Retail Banking, Treasury, and Others. The company offers current accounts, deposits, overdrafts, loans, trade related products and other credit facilities, foreign currency, and wealth management products to corporate customers, government authorities, and financial institutions. It also provides savings deposits, personal loans and advances, credit and debit cards, payments and settlements, wealth management products and funds, and insurance agency services to retail customers. In addition, the company conducts securities investment, money market, and repurchase transactions; and offers online and mobile banking services. Further, it provides Renminbi and foreign currency deposits; and clearing and settlement, assets custody, and finance leasing services. As of December 31, 2020, Huishang Bank Corporation Limited had 21 branches; 481 front offices, including 5 business department branches and 476 sub-branches; 654 self-service banks; and 2,019 cash self-service equipment comprising 1,258 cash recycling machines, 731 smart self-service terminals, and 30 teller machines. The company was formerly known as Hefei Commercial Bank Co., Ltd. and changed its name to Huishang Bank Corporation Limited in November 2005. Huishang Bank Corporation Limited was incorporated in 1997 and is headquartered in Hefei, China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230001",
        "website": "http://www.hsbank.com.cn",
        "market_cap": 3768765184
    },
    "M4B.F": {
        "short_name": "CHINA MERCHANTS BK H YC 1",
        "long_name": "China Merchants Bank Co., Ltd.",
        "summary": "China Merchants Bank Co., Ltd. provides various banking products and services. It operates through Wholesale Finance Business, Retail Finance Business, and Other Business segments. The company accepts demand, time, call, savings, checking, notice, and renminbi accounts. Its loan products include personal commercial real estate, consumption, housing, and car loans; loans to finance for studying abroad; micro-business loans; mortgage loans for equipment; bank acceptance, discount, liquid capital, and fixed asset loans; and loans for vessels. The company also offers credit cards; insurance products; open-ended funds; discount and guarantee for commercial bills, redemption of commercial bills, and guaranteed discount for commercial acceptance bills; and financial consultation, debt financing underwriting, merger and acquisition financing, and equity financing and enterprise listing services. In addition, it provides forfeiting and risk participation, escrow, cross border RMB clearing, and interbank services; and risk and financial management, cross border RMB and oversea financing, international factoring and settlement, and trade finance services. Further, the company offers financial leasing and guarantee, third-party payment, cash management, investment and wealth management, forex option and gold trading, forex express trading, settlement, trade chain financing, international, offshore and private banking, custody, pension, and electronic banking services. As of December 31, 2020, it operated 142 branches; 1,724 sub-branches; one branch-level operation center; one representative office; 16,559 visual counters in Mainland China. The company also operated a branch in Hong Kong; a branch and representative office in New York, the United States; a branch in London, the United Kingdom; a branch in Singapore; a branch in Luxembourg; a representative office in Taipei; and a branch in Sydney, Australia. The company was founded in 1987 and is headquartered in Shenzhen, China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518040",
        "website": "http://www.cmbchina.com",
        "market_cap": 183835443200
    },
    "PSBKF": {
        "short_name": "POSTAL SAVINGS BANK OF CHINA CO",
        "long_name": "Postal Savings Bank of China Co., Ltd.",
        "summary": "Postal Savings Bank of China Co., Ltd. provides various banking products and services for retail and corporate customers in the People's Republic of China. Its Personal Banking segment offers savings products, such as demand, time, personal call, time/demand optional, and foreign currency deposits; passbooks; certificate of deposits; micro, personal pledged, and personal business loans; debit and credit cards; wealth management products and funds; and insurance agency services. This segment is also involved in distribution of fund products, electronic bonds, and precious metals; and provides payment and collection agency, various settlement, domestic remittance and exchange, cross-border remittance, personal exchange settlement and sale, and foreign currency exchange services. The company's Corporate Banking segment provides time, demand, call, and negotiated deposits; working capital, fixed asset, trade finance, stock pledge, land reserve, syndicated, real estate development, property mortgage, and consignment loans; cash management services; negotiable instruments; trade finance and international settlement services; and financial markets services. Its Treasury segment offers interbank lending transactions, repurchase and resale transactions, debt instrument investments, equity instrument investment, investment banking, bond securities, and wealth management products, etc., as well as trades in financial products comprising money market, fixed income, and foreign exchange products, as well as derivatives and precious metals. The company also provides online, mobile, and self-service banking services. As of December 31, 2020, it had 39,631 outlets, including 8,568 directly operated outlets and 31,763 agency outlets. The company was founded in 2007 and is headquartered in Beijing, the People's Republic of China. Postal Savings Bank of China Co., Ltd. is a subsidiary of China Post Group Corporation.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100808",
        "website": "http://www.psbc.com",
        "market_cap": 70054633472
    },
    "PSTVY": {
        "short_name": "POSTAL SAVINGS BANK OF CHINA CO",
        "long_name": "Postal Savings Bank of China Co., Ltd.",
        "summary": "Postal Savings Bank of China Co., Ltd. provides various banking products and services for retail and corporate customers in the People's Republic of China. Its Personal Banking segment offers savings products, such as demand, time, personal call, time/demand optional, and foreign currency deposits; passbooks; certificate of deposits; micro, personal pledged, and personal business loans; debit and credit cards; wealth management products and funds; and insurance agency services. This segment is also involved in distribution of fund products, electronic bonds, and precious metals; and provides payment and collection agency, various settlement, domestic remittance and exchange, cross-border remittance, personal exchange settlement and sale, and foreign currency exchange services. The company's Corporate Banking segment provides time, demand, call, and negotiated deposits; working capital, fixed asset, trade finance, stock pledge, land reserve, syndicated, real estate development, property mortgage, and consignment loans; cash management services; negotiable instruments; trade finance and international settlement services; and financial markets services. Its Treasury segment offers interbank lending transactions, repurchase and resale transactions, debt instrument investments, equity instrument investment, investment banking, bond securities, and wealth management products, etc., as well as trades in financial products comprising money market, fixed income, and foreign exchange products, as well as derivatives and precious metals. The company also provides online, mobile, and self-service banking services. As of December 31, 2020, it had 39,631 outlets, including 8,568 directly operated outlets and 31,763 agency outlets. The company was founded in 2007 and is headquartered in Beijing, the People's Republic of China. Postal Savings Bank of China Co., Ltd. is a subsidiary of China Post Group Corporation.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100808",
        "website": "http://www.psbc.com",
        "market_cap": 74982039552
    }
}