{
    "000401.SZ": {
        "short_name": "TANGSHAN JIDONG CE",
        "long_name": "Tangshan Jidong Cement Co.,Ltd.",
        "summary": "Tangshan Jidong Cement Co.,Ltd. produces and sells cement, ready-mixed concrete, and clinker in China. The company was founded in 1994 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.jdsn.com.cn",
        "market_cap": "Large Cap"
    },
    "000672.SZ": {
        "short_name": "GANSU SHANGFENG CE",
        "long_name": "Gansu Shangfeng Cement Co.,Ltd",
        "summary": "Gansu Shangfeng Cement Co.,Ltd manufactures and sells cement and cement clinker in China. It also provides aggregates, concrete, and other building materials, as well as engages in the real estate business. The company was formerly known as Baiyin Copper Commercial Building (Group) Co., Ltd. and changed its name to Gansu Shangfeng Cement Co.,Ltd in April 2013. Gansu Shangfeng Cement Co.,Ltd was founded in 1978 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310000",
        "website": "http://www.sfsn.cn",
        "market_cap": "Large Cap"
    },
    "000789.SZ": {
        "short_name": "JIANGXI WANNIANQIN",
        "long_name": "Jiangxi Wannianqing Cement Co., Ltd.",
        "summary": "Jiangxi Wannianqing Cement Co., Ltd. produces and sells cement in China. Its products include ordinary Portland cement and composite Portland cement; commercial concrete of different grades for urban construction, high-rise buildings, railways, subways, bridges, etc.; prestressed concrete water pipes; and other building materials. The company was founded in 1958 and is based in Nanchang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330096",
        "website": "http://www.wnq.com.cn",
        "market_cap": "Mid Cap"
    },
    "000877.SZ": {
        "short_name": "XINJIANG T/SHAN CE",
        "long_name": "Xinjiang Tianshan Cement Co., Ltd.",
        "summary": "Xinjiang Tianshan Cement Co., Ltd. produces and sells cement, clinker, and commercial concrete in China and internationally. It offers anti-sulfate cement, meso thermal Portland cement, low thermal slag Portland cement, road Portland cement, oil well cement, white cement, and colored cement for industrial, agricultural, water conservancy, transportation, military, civil, and other construction projects; cement products; and various prestressed and self-reinforced concrete components. The company also provides high-strength concrete, various grades of high performance concrete, steel fiber concrete, pervious concrete, impervious concrete, antifreeze concrete, fireproof concrete, and other special concrete products for ordinary and high-rise construction, roads, tunnels, viaducts, subway, and other projects. It is also involved in the waste heat power generation business. The company was founded in 1998 and is based in Urumqi, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Urumqi",
        "zipcode": null,
        "website": "http://www.sinoma-tianshan.cn",
        "market_cap": "Large Cap"
    },
    "000935.SZ": {
        "short_name": "SICHUAN SHUANGMA C",
        "long_name": "SICHUAN SHUANGMA CEMENT CO., Ltd",
        "summary": "SICHUAN SHUANGMA CEMENT CO., Ltd manufactures and sells cement in China. It also engages in private equity investment management and football training activities. The company was founded in 1998 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610000",
        "website": "http://www.sc-shuangma.com",
        "market_cap": "Mid Cap"
    },
    "002066.SZ": {
        "short_name": "RUITAI MATERIALS T",
        "long_name": "Ruitai Materials Technology Co., Ltd.",
        "summary": "Ruitai Materials Technology Co., Ltd. researches, produces, sells, and services refractories in the People's Republic of China. The company provides fused cast, basic, alumina-silica, silica, and unshaped refractories, as well as polybasic alloyed casting balls and bars, and low chromium alloyed castings bars and capsules balls. It serves glass, cement, steel and iron, nonferrous, electrical, petrochemical, and other industries. The company also exports its products. Ruitai Materials Technology Co., Ltd. was founded in 2001 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100024",
        "website": "http://www.bjruitai.com",
        "market_cap": "Mid Cap"
    },
    "002233.SZ": {
        "short_name": "GUANGDONG TAPAI GR",
        "long_name": "Guangdong Tapai Group Co., Ltd.",
        "summary": "Guangdong Tapai Group Co., Ltd. offers cement and concrete products in China. Its products are used in the industrial and civil buildings, concrete and underground engineering, high-rise buildings, roads and bridges, airport runways, and port terminals. The company is based in Meizhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Meizhou",
        "zipcode": "514100",
        "website": "http://www.tapai.com",
        "market_cap": "Large Cap"
    },
    "002377.SZ": {
        "short_name": "HUBEI GUOCHUANG HI",
        "long_name": "Hubei Guochuang Hi-tech Material Co.,Ltd",
        "summary": "Hubei Guochuang Hi-tech Material Co., Ltd engages in the real estate intermediary service business and the research, development, production, and sale of modified and emulsified asphalt in China. The company offers SBS modified, high viscosity modified, rubber, colored, and retardant asphalt; and high modulus asphalt mixture additives, emulsified asphalt and modified emulsified asphalt, cement asphalt mortars, asphalt pavement regeneration reductants, asphalt pavement waterproof and oilrepellent agents, bridge preventive curing coating materials, and epoxy asphalt steel bridge maintenance materials. It is also undertakes road maintenance projects. In addition, the company provides road engineering maintenance equipment includes micro-surfacing, sand fog sealing layer, ultra-thin wear layer, synchronous gravel sealing, reclaimed asphalt pavement, warm asphalt pavement, cold repair, and snow melting anti-icing equipment. Hubei Guochuang Hi-tech Material Co.,Ltd is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430074",
        "website": "http://www.guochuang.com.cn",
        "market_cap": "Mid Cap"
    },
    "002398.SZ": {
        "short_name": "LETS HOLDINGS GROU",
        "long_name": "Lets Holdings Group Co., Ltd.",
        "summary": "Lets Holdings Group Co., Ltd. engages in the research and development, production, and sale of construction materials in China and internationally. It provides concrete manufacturing and construction services for the nuclear power, high-speed rail, subway, water conservancy, and other projects, as well as for ports, bridges, tunnels, and highways. The company also offers technical construction services, such as surveying, designing, testing, evaluation, consulting, and training for the life cycle of engineering feasibility study, construction, and operation and maintenance. In addition, it provides information and intelligent services for the Chinese construction industry; Internet-based industry supply chain big data services; and BIM- based building information and industrialization of intelligent system services. The company was formerly known as Xiamen Academy Of Building Research Group Co., Ltd. and changed its name to Lets Holdings Group Co., Ltd. in October 2019. Lets Holdings Group Co., Ltd. was founded in 1980 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361004",
        "website": "http://www.xmabr.com",
        "market_cap": "Mid Cap"
    },
    "002596.SZ": {
        "short_name": "HAINAN RUIZE NEW B",
        "long_name": "Hainan RuiZe New Building Material Co.,Ltd",
        "summary": "Hainan RuiZe New Building Material Co.,Ltd. produces and sells ready-mixed concrete and cement in China. It provides high performance concrete, dry-process cement, environmental-protection building materials, and landscape design and construction and sanitation services. The company was formerly known as Three Ya Ruize Concrete Distribution Company Limited and changed its name to Hainan RuiZe New Building Material Co.,Ltd. in August 2008. Hainan RuiZe New Building Material Co.,Ltd. was founded in 2002 and is based in Sanya, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Sanya",
        "zipcode": "572011",
        "website": "http://www.hnruize.com",
        "market_cap": "Mid Cap"
    },
    "002742.SZ": {
        "short_name": "CHONGQING SANSHEN",
        "long_name": "Chongqing Sansheng Industrial Co.,Ltd.",
        "summary": "Chongqing Sansheng Industrial Co.,Ltd. engages in the research and development, production, and sale of building materials and chemicals in China. The company offers commercial concrete, water reducing agents, and expansion agents for industrial and civil buildings, highways, railways, bridges, tunnels, airports, water conservancy and hydropower, etc.; and sulfuric acid for the production of chemical fertilizers, chemical, light industry, textile, steel, water reducer, and other non-fertilizer acid enterprises. It also provides pharmaceutical products comprising intermediates, such as procaine hydrochloride, cefoxitin intermediate, chloramphenicol intermediate, aztreonam intermediate, orlistat intermediate, etc., which are used in antibiotic drugs, anti-hepatitis C drugs, diabetes medicines, benzathine penicillin and cefoxitin, procaine penicillin, and cosmetics; API products, including acetaminophen, cloperidine hydrochloride, levofloxacin mesylate, benoate, procaine hydrochloride, diphenhydramine hydrochloride, etc.; and preparation products, such as compound paracetamol diphenhydramine, cloperidine hydrochloride, clarithromycin sustained-release, diclofenac sodium enteric-coated, acetaminophen, famotidine tablets, etc., which are used in antipyretic and analgesic, antiviral, antibacterial, cough, allergy, local anesthesia, etc., as well as famotidine, diclofenac sodium, nifedipine, acetaminophen, furosemide, and norfloxacin drugs for clinical needs. The company was formerly known as Chongqing Sansheng Special Building Materials Co., Ltd. and changed its name to Chongqing Sansheng Industrial Co.,Ltd. in October 2016. The company was founded in 2002 and is based in Chongqing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": null,
        "website": "http://www.cqssgf.com",
        "market_cap": "Mid Cap"
    },
    "003037.SZ": {
        "short_name": "GUANGDONG SANHE PI",
        "long_name": "Guangdong Sanhe Pile Co.,Ltd.",
        "summary": "Guangdong Sanhe Pile Co., Ltd engages in the development, production, and sale of prestressed concrete pipe pile products. The company was founded in 2003 and is based in Zhongshan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhongshan",
        "zipcode": "528414",
        "website": "http://www.sanhepile.com",
        "market_cap": "Mid Cap"
    },
    "0691.HK": {
        "short_name": "SHANSHUI CEMENT",
        "long_name": "China Shanshui Cement Group Limited",
        "summary": "China Shanshui Cement Group Limited, an investment holding company, manufactures and sells cement, clinker, and concrete products in the People's Republic of China. It operates through four segments: Shandong Province, Northeastern China, Shanxi Province, and Xinjiang Region. The company is also involved in the mining, production, and sale of limestone; production and sale of concrete aggregates and building materials; installation of equipment and spare parts of cement machines; sale of coal; and development and maintenance of special railway-lines, as well as wash and repair of steam locomotive and provision of logistics services. In addition, it imports and exports cement, clinker, and related products; and provides mineral water and finance leasing services, as well as provides investment and management services, and consulting services. China Shanshui Cement Group Limited was incorporated in 2006 and is headquartered in Jinan, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": "250307",
        "website": "http://www.shanshuicement.com",
        "market_cap": "Mid Cap"
    },
    "0914.HK": {
        "short_name": "CONCH CEMENT",
        "long_name": "Anhui Conch Cement Company Limited",
        "summary": "Anhui Conch Cement Company Limited, together with its subsidiaries, manufactures, sells, and trades in clinker and cement products in the People's Republic of China and internationally. It primarily provides Portland cement, ordinary Portland cement, slag Portland cement, composite Portland cement under the Conch brand. The company also offers sulfate resistance cement, moderate Portland cement, low heat slag Portland cement, highway Portland cement, oil well Portland cement, non-maglev Portland cement, nuclear station Portland cement, white cement, etc. In addition, it provides construction and installation services for industrial purposes; logistic services; and mining and related services. Further, the company manufactures and sells cement packaging products, concrete products, and refractory materials; and develops and sells profile and related products, as well as exports clinker and cement products. Additionally, it engages in investment and trading; and selling aggregates. Anhui Conch Cement Company Limited was incorporated in 1997 and is based in Wuhu, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Wuhu",
        "zipcode": "241000",
        "website": "http://www.conch.cn",
        "market_cap": "Large Cap"
    },
    "1252.HK": {
        "short_name": "CHINA TIANRUI",
        "long_name": "China Tianrui Group Cement Company Limited",
        "summary": "China Tianrui Group Cement Company Limited, an investment holding company, manufactures, distributes, and sells clinker and cement in the People's Republic of China. The company engages in the excavation of limestone, as well as produces, sells, and distributes cement clinker and cement products. It also exports its products. The company sells its cement products under Tianrui brand. It serves real estate developers, concrete manufacturers, etc. The company was founded in 2000 and is headquartered in Ruzhou, the People's Republic of China. China Tianrui Group Cement Company Limited is a subsidiary of Yu Kuo Company Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Ruzhou",
        "zipcode": "467500",
        "website": "http://www.trcement.com",
        "market_cap": "Large Cap"
    },
    "1847.HK": {
        "short_name": "GHPC",
        "long_name": "YCIH Green High-Performance Concrete Company Limited",
        "summary": "YCIH Green High-Performance Concrete Company Limited engages in the research, development, production, and sale of ready-mixed concrete and related products in the People's Republic of China. It offers polycarboxylic admixtures and aggregates; and concrete-related quality and technology management services. The company was founded in 1996 and is headquartered in Kunming, the People's Republic of China. YCIH Green High-Performance Concrete Company is a subsidiary of Yunnan Construction and Investment Holding Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": null,
        "website": "http://www.ynhnt.com",
        "market_cap": "Small Cap"
    },
    "2009.HK": {
        "short_name": "BBMG",
        "long_name": "BBMG Corporation",
        "summary": "BBMG Corporation provides cement and building materials in Asia, Europe, Africa, and internationally. The company's Cement and Ready-Mixed Concrete segment manufactures and sells cement and concrete. Its Modern Building Materials and Commerce and Logistics segment produces furniture and woods, decorative and fitting materials, and wall body and insulation materials; and offers commerce and logistics services. The company's Property Development segment develops and sells housing properties. Its Property Investment and Management segment invests in properties; and provides management and security services to residential and commercial properties. The company offers mortars and crushed stones, slag fine powders, coatings and construction hardware, glass made spectacle lenses, glass wool products, wood based panels, resins, building materials, limestone and cement clinkers, refractory materials and ceramics, aerated concrete products, machinery equipment and accessories, wind power equipment, doors and windows, and sanitary ceramics; wholesales coal, building and metal materials, and metal and metallic minerals; and imports and exports bulk commodities. It provides project and furniture decoration, construction contracting and project management, accommodation and conference, hotel management, finance leasing, property consultancy, property rental, technology development, goods transportation and storage, waste disposal, finance and financing advisory, exhibition, and knitting processing services; offers loading, offloading, and handling services; provides building material testing services; and operates sports projects, as well as publishes concrete world magazine, and provides advertising design and production services. The company was founded in 2005 and is incorporated in Beijing, China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100013",
        "website": "http://www.bbmg.com.cn",
        "market_cap": "Large Cap"
    },
    "2187.HK": {
        "short_name": "ZHIXIN GP HLDG",
        "long_name": "Zhixin Group Holding Limited",
        "summary": "Zhixin Group Holding Limited manufacturer and supplier of concrete-based building materials for construction companies in the People's Republic of China. Its products include ready-mixed concrete and PC components. The company was incorporated in 2018 and is based in Xiamen City, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Xiamen City",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "300135.SZ": {
        "short_name": "JIANGSU BAOLI INTE",
        "long_name": "Jiangsu Baoli International Investment Co., Ltd.",
        "summary": "Jiangsu Baoli International Investment Co., Ltd. researches, develops, produces, and markets asphalt and asphalt additives, and other road materials in China. The company offers general type modified asphalt, emulsified asphalt, modified asphalt emulsion, liquid asphalt, ordinary road asphalt, corrosion paint asphalt, warm mix asphalt, high speed rail emulsified asphalt, railway track ye bonding glue, special modified asphalt, high viscosity modified asphalt, polymer modified bitumen asphalt, paving asphalt, etc. It also imports, warehouses, and sells heavy oil asphalt and the domestic heavy traffic asphalt. In addition, the company is involved in the construction and maintenance of railway, highway, tunnel, and bridge projects; provision of financial leasing and leasing services; and purchase of leased properties. Further, it offers residual value and maintenance services for leased properties; and lease transaction advisory and guarantees services. The company also exports its products. The company was formerly known as Jiangsu Baoli Asphalt Co., Ltd. and changed its name to Jiangsu Baoli International Investment Co., Ltd. in June 2015. Jiangsu Baoli International Investment Co., Ltd. was founded in 2002 and is based in Jiangyin, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiangyin",
        "zipcode": null,
        "website": "http://en.baolijt.cn",
        "market_cap": "Mid Cap"
    },
    "300374.SZ": {
        "short_name": "CHINA RAILWAY PREF",
        "long_name": "China Railway Prefabricated Construction Co., Ltd.",
        "summary": "China Railway Prefabricated Construction Co., Ltd. researches and develops, produces, markets, and assembles recyclable construction materials in China. It offers housing construction, interior decoration, and outdoor landscape materials, as well as other construction accessories. The company's products include square hole, hollow, and solid decks; gardening materials comprising fencing products and claddings; wall materials; and molded sheets and sleepers. It also exports its products to Africa, Central Asia, and other markets worldwide. The company was formerly known as Beijing Hengtong Innovation Luxwood Technology Co.,Ltd and changed its name to China Railway Prefabricated Construction Co., Ltd. in August 2020. China Railway Prefabricated Construction Co., Ltd. was founded in 2006 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102444",
        "website": "http://www.htcxms.com",
        "market_cap": "Mid Cap"
    },
    "600291.SS": {
        "short_name": "XISHUI STRONG YEAR INNER MONGOL",
        "long_name": "Xishui Strong Year Co.,Ltd Inner Mongolia",
        "summary": "Xishui Strong Year Co.,Ltd Inner Mongolia manufactures and sells cement and clinker. The company also provides network integration and other technical services. In addition, it is involved in the hardware distribution; software development; research and development of network products; and development of energy saving environmental protection equipment and related technologies. The company has operations primarily in the Wuhai, Baotou, Inner Mongolia Autonomous Region, and Shanghai regions of China. Xishui Strong Year Co.,Ltd Inner Mongolia is based in Wuhai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhai",
        "zipcode": "016000",
        "website": null,
        "market_cap": "Mid Cap"
    },
    "600293.SS": {
        "short_name": "HUBEI SANXIA NEW BUILDING MATER",
        "long_name": "Hubei Sanxia New Building Materials Co., Ltd.",
        "summary": "Hubei Sanxia New Building Materials Co., Ltd. engages in the research, production, and sale of float glass, glass deep-processing products, and building materials in China. It offers titanium dioxide film self-cleaning, tempered, laminated, and insulating glasses, as well as reinforced glass covers. The company is based in Dangyang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dangyang",
        "zipcode": "444105",
        "website": "http://www.sxxc.com.cn",
        "market_cap": "Mid Cap"
    },
    "600425.SS": {
        "short_name": "XINJIANGQINGSONGBUILDING MATERI",
        "long_name": "Xinjiang Qingsong Building Materials and Chemicals (Group) Co.,Ltd.",
        "summary": "Xinjiang Qingsong Building Materials and Chemicals (Group) Co., Ltd. produces and sells cement products in China. It offers Portland, ordinary Portland, pozzolanic Portland, fly ash Portland, and other cement products. The company also exports its products to Central Asian countries. Xinjiang Qingsong Building Materials and Chemicals (Group) Co., Ltd. is based in Aksu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Aksu",
        "zipcode": null,
        "website": "http://www.xjqscc.com",
        "market_cap": "Mid Cap"
    },
    "600449.SS": {
        "short_name": "NINGXIA BULIDING MATERIALS GP C",
        "long_name": "Ningxia Building Materials Group Co.,Ltd",
        "summary": "Ningxia Building Materials Group Co.,Ltd manufactures and sells cement, cement clinkers, commercial concrete, and related cement products in China. The compnoffers dam and oil well cement; and ordinary, composite, slag, fly ash, road, medium-low-heat, and sulfate-resistant Portland cement under the Saima, Qingtongxia, Shuanglu, Liupanshan, Ningzhongning, and Grassland brands. The company was formerly known as Ningxia Saima Industry Co., Ltd. and changed its name to Ningxia Building Materials Group Co.,Ltd in December 2011. Ningxia Building Materials Group Co.,Ltd was founded in 1998 and is based in Yinchuan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yinchuan",
        "zipcode": "750002",
        "website": "http://www.saimasy.com",
        "market_cap": "Mid Cap"
    },
    "600539.SS": {
        "short_name": "TAIYUAN LIONHEAD CEMENT CO LTD",
        "long_name": "Taiyuan Lionhead Cement Co.,Ltd.",
        "summary": "Taiyuan Lionhead Cement Co.,Ltd. manufactures and sells cement and concrete products in China. The company is based in Taiyuan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": null,
        "website": "http://www.lionhead.com.cn",
        "market_cap": "Small Cap"
    },
    "600585.SS": {
        "short_name": "ANHUI CONCH CEMENT",
        "long_name": "Anhui Conch Cement Company Limited",
        "summary": "Anhui Conch Cement Company Limited, together with its subsidiaries, manufactures, sells, and trades in clinker and cement products in the People's Republic of China and internationally. It primarily provides Portland cement, ordinary Portland cement, slag Portland cement, composite Portland cement under the Conch brand. The company also offers sulfate resistance cement, moderate Portland cement, low heat slag Portland cement, highway Portland cement, oil well Portland cement, non-maglev Portland cement, nuclear station Portland cement, white cement, etc. In addition, it provides construction and installation services for industrial purposes; logistic services; and mining and related services. Further, the company manufactures and sells cement packaging products, concrete products, and refractory materials; and develops and sells profile and related products, as well as exports clinker and cement products. Additionally, it engages in investment and trading; and selling aggregates. Anhui Conch Cement Company Limited was incorporated in 1997 and is based in Wuhu, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhu",
        "zipcode": "241000",
        "website": "http://www.conch.cn",
        "market_cap": "Large Cap"
    },
    "600668.SS": {
        "short_name": "ZHEJIANG JIANFENG GROUP",
        "long_name": "Zhejiang Jianfeng Group Co., Ltd.",
        "summary": "Zhejiang Jianfeng Group Co., Ltd. engages in the cement business in China. The company offers composite, ordinary, and slag Portland cement. It also provides pharmaceutical products, including aspartic acid amlodipine tablets for hypertension; heart pills for high blood pressure, dizziness, headache, neck pain, coronary heart disease, angina, nervous headache, and early sudden deafness; paroxetine hydrochloride tablets for various types of anxiety related with depression; vinegar acid chloride Finn zyban products for symptoms caused by osteoarthritis, rheumatoid arthritis, and ankylosing spondylitis; spray vial products for severe herpes zoster patients; and sodium hyaluronate eye drops for dry eyes. In addition, the company offers cable products, such as BV line common insulated and household electric wires; HYA series, which are copper core, solid polyolefin insulation block, and communications cables; network lines; RVV series cable mains; and SYWV-75 series physical foaming cables, as well as telecommunication cables. Further, it provides health products comprising boiling Jade Kim tea bags, grape seed extract soft capsules, bomb sugar, Tianfu capsules, vitamin E nutritional capsules, bone Thai capsules, goodnight capsules, Sangge tea, lyophilized Tianma pieces, and broken fungus spore powder. Additionally, the company offers warehousing and logistics services. It provides products and services through its marketing and sales channels. The company was founded in 1958 and is based in Jinhua, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinhua",
        "zipcode": null,
        "website": "http://www.jianfeng.com.cn",
        "market_cap": "Mid Cap"
    },
    "600720.SS": {
        "short_name": "GANSU QILIANSHAN CEMENT GROUP C",
        "long_name": "Gansu Qilianshan Cement Group Co., Ltd.",
        "summary": "Gansu Qilianshan Cement Group Co., Ltd. manufactures and sells cement in China. The company offers Portland cement and ordinary Portland cement under the Qilianshan brand. It also provides commercial concrete and aggregates. Gansu Qilianshan Cement Group Co., Ltd. was founded in 1996 and is based in Lanzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lanzhou",
        "zipcode": "730030",
        "website": "http://www.qlssn.com",
        "market_cap": "Mid Cap"
    },
    "600801.SS": {
        "short_name": "HUAXIN CEMENT CO LTD",
        "long_name": "Huaxin Cement Co., Ltd.",
        "summary": "Huaxin Cement Co., Ltd., together with its subsidiaries, manufactures and sells cement in China and internationally. It also provides RMX products and aggregates, as well as cement technical services. In addition, the company is involved in the research, manufacture, installation, and maintenance of cement equipment; and cement import and export trade activities. Further, it engages in the cement kiln co-processing of waste materials; EPC for cement projects; equipment business; and project contracting business related to cement kiln co-processing technology, cement-based high-tech building materials, etc. The company was founded in 1907 and is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430073",
        "website": "http://www.huaxincem.com",
        "market_cap": "Large Cap"
    },
    "600819.SS": {
        "short_name": "SHANGHAI YAOHUA PILKINGTON GLAS",
        "long_name": "Shanghai Yaohua Pilkington Glass Group Co., Ltd.",
        "summary": "Shanghai Yaohua Pilkington Glass Group Co., Ltd. manufactures and sells glass products in China and internationally. It provides float, architectural, and automotive glasses. The company was founded in 1983 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.sypglass.com",
        "market_cap": "Mid Cap"
    },
    "600883.SS": {
        "short_name": "YUNNAN BOWIN TECH & INDUSTRY CO",
        "long_name": "Yunnan Bowin Technology Industry Co.,Ltd",
        "summary": "Yunnan Bowin Technology Industry Co.,Ltd manufactures and distributes cement in China. The company's cement products include ordinary Portland cement and compound Portland cement. It is also involved in the foreign equity investment business. The company is based in Kunming, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": "650041",
        "website": "http://www.ynbowin.com",
        "market_cap": "Mid Cap"
    },
    "601992.SS": {
        "short_name": "BBMG CORPORATION",
        "long_name": "BBMG Corporation",
        "summary": "BBMG Corporation provides cement and building materials in Asia, Europe, Africa, and internationally. The company's Cement and Ready-Mixed Concrete segment manufactures and sells cement and concrete. Its Modern Building Materials and Commerce and Logistics segment produces furniture and woods, decorative and fitting materials, and wall body and insulation materials; and offers commerce and logistics services. The company's Property Development segment develops and sells housing properties. Its Property Investment and Management segment invests in properties; and provides management and security services to residential and commercial properties. The company offers mortars and crushed stones, slag fine powders, coatings and construction hardware, glass made spectacle lenses, glass wool products, wood based panels, resins, building materials, limestone and cement clinkers, refractory materials and ceramics, aerated concrete products, machinery equipment and accessories, wind power equipment, doors and windows, and sanitary ceramics; wholesales coal, building and metal materials, and metal and metallic minerals; and imports and exports bulk commodities. It provides project and furniture decoration, construction contracting and project management, accommodation and conference, hotel management, finance leasing, property consultancy, property rental, technology development, goods transportation and storage, waste disposal, finance and financing advisory, exhibition, and knitting processing services; offers loading, offloading, and handling services; provides building material testing services; and operates sports projects, as well as publishes concrete world magazine, and provides advertising design and production services. The company was founded in 2005 and is incorporated in Beijing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100013",
        "website": "http://www.bbmg.com.cn",
        "market_cap": "Large Cap"
    },
    "603916.SS": {
        "short_name": "SOBUTE NEW MATERIALS CO LTD",
        "long_name": "Sobute New Materials Co., Ltd",
        "summary": "Sobute New Materials Co., Ltd engages in the research, development, production, and sale of concrete admixtures in Mainland China, Pakistan, Bangladesh, and Hong Kong. The company offers superplasticizers and superaccelerators/strength-enhancers, as well as pre-stressed, common grouting, and spray and fiber concrete materials; and durability materials, transportation engineering materials, and waterproof and repair materials. Its products are used in the construction of various projects, including bridge, nuclear and hydropower station, high speed railway, water diversion, tunnel, etc. The company is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "211103",
        "website": "http://www.sobute.com",
        "market_cap": "Mid Cap"
    },
    "900918.SS": {
        "short_name": "SHANGHAI YAOHUA PILKINGTON GLAS",
        "long_name": "Shanghai Yaohua Pilkington Glass Group Co., Ltd.",
        "summary": "Shanghai Yaohua Pilkington Glass Group Co., Ltd. manufactures and sells glass products in China and internationally. It provides float, architectural, and automotive glasses. The company was founded in 1983 and is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.sypglass.com",
        "market_cap": "Mid Cap"
    },
    "900933.SS": {
        "short_name": "HUAXIN CEMENT CO LTD",
        "long_name": "Huaxin Cement Co., Ltd.",
        "summary": "Huaxin Cement Co., Ltd., together with its subsidiaries, manufactures and sells cement in China and internationally. It also provides RMX products and aggregates, as well as cement technical services. In addition, the company is involved in the research, manufacture, installation, and maintenance of cement equipment; and cement import and export trade activities. Further, it engages in the cement kiln co-processing of waste materials; EPC for cement projects; equipment business; and project contracting business related to cement kiln co-processing technology, cement-based high-tech building materials, etc. The company was founded in 1907 and is based in Wuhan, China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430073",
        "website": "http://www.huaxincem.com",
        "market_cap": "Large Cap"
    },
    "9BM.F": {
        "short_name": "BBMG CORP. H  YC 1",
        "long_name": "BBMG Corporation",
        "summary": "BBMG Corporation provides cement and building materials in Asia, Europe, Africa, and internationally. The company's Cement and Ready-Mixed Concrete segment manufactures and sells cement and concrete. Its Modern Building Materials and Commerce and Logistics segment produces furniture and woods, decorative and fitting materials, and wall body and insulation materials; and offers commerce and logistics services. The company's Property Development segment develops and sells housing properties. Its Property Investment and Management segment invests in properties; and provides management and security services to residential and commercial properties. The company offers mortars and crushed stones, slag fine powders, coatings and construction hardware, glass made spectacle lenses, glass wool products, wood based panels, resins, building materials, limestone and cement clinkers, refractory materials and ceramics, aerated concrete products, machinery equipment and accessories, wind power equipment, doors and windows, and sanitary ceramics; wholesales coal, building and metal materials, and metal and metallic minerals; and imports and exports bulk commodities. It provides project and furniture decoration, construction contracting and project management, accommodation and conference, hotel management, finance leasing, property consultancy, property rental, technology development, goods transportation and storage, waste disposal, finance and financing advisory, exhibition, and knitting processing services; offers loading, offloading, and handling services; provides building material testing services; and operates sports projects, as well as publishes concrete world magazine, and provides advertising design and production services. The company was founded in 2005 and is incorporated in Beijing, China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100013",
        "website": "http://www.bbmg.com.cn",
        "market_cap": "Mid Cap"
    },
    "AHCHF": {
        "short_name": "ANHUI CONCH CEMENT",
        "long_name": "Anhui Conch Cement Company Limited",
        "summary": "Anhui Conch Cement Company Limited, together with its subsidiaries, manufactures, sells, and trades in clinker and cement products in the People's Republic of China and internationally. It primarily provides Portland cement, ordinary Portland cement, slag Portland cement, composite Portland cement under the Conch brand. The company also offers sulfate resistance cement, moderate Portland cement, low heat slag Portland cement, highway Portland cement, oil well Portland cement, non-maglev Portland cement, nuclear station Portland cement, white cement, etc. In addition, it provides construction and installation services for industrial purposes; logistic services; and mining and related services. Further, the company manufactures and sells cement packaging products, concrete products, and refractory materials; and develops and sells profile and related products, as well as exports clinker and cement products. Additionally, it engages in investment and trading; and selling aggregates. Anhui Conch Cement Company Limited was incorporated in 1997 and is based in Wuhu, the People's Republic of China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Wuhu",
        "zipcode": "241000",
        "website": "http://www.conch.cn",
        "market_cap": "Large Cap"
    },
    "AHCHY": {
        "short_name": "ANHUI CONCH CEMENT",
        "long_name": "Anhui Conch Cement Company Limited",
        "summary": "Anhui Conch Cement Company Limited, together with its subsidiaries, manufactures, sells, and trades in clinker and cement products in the People's Republic of China and internationally. It primarily provides Portland cement, ordinary Portland cement, slag Portland cement, composite Portland cement under the Conch brand. The company also offers sulfate resistance cement, moderate Portland cement, low heat slag Portland cement, highway Portland cement, oil well Portland cement, non-maglev Portland cement, nuclear station Portland cement, white cement, etc. In addition, it provides construction and installation services for industrial purposes; logistic services; and mining and related services. Further, the company manufactures and sells cement packaging products, concrete products, and refractory materials; and develops and sells profile and related products, as well as exports clinker and cement products. Additionally, it engages in investment and trading; and selling aggregates. Anhui Conch Cement Company Limited was incorporated in 1997 and is based in Wuhu, the People's Republic of China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Wuhu",
        "zipcode": "241000",
        "website": "http://www.conch.cn",
        "market_cap": "Large Cap"
    },
    "AQE.F": {
        "short_name": "ANHUI CONCH CEMENT  H YC1",
        "long_name": "Anhui Conch Cement Company Limited",
        "summary": "Anhui Conch Cement Company Limited, together with its subsidiaries, manufactures, sells, and trades in clinker and cement products in the People's Republic of China and internationally. It primarily provides Portland cement, ordinary Portland cement, slag Portland cement, composite Portland cement under the Conch brand. The company also offers sulfate resistance cement, moderate Portland cement, low heat slag Portland cement, highway Portland cement, oil well Portland cement, non-maglev Portland cement, nuclear station Portland cement, white cement, etc. In addition, it provides construction and installation services for industrial purposes; logistic services; and mining and related services. Further, the company manufactures and sells cement packaging products, concrete products, and refractory materials; and develops and sells profile and related products, as well as exports clinker and cement products. Additionally, it engages in investment and trading; and selling aggregates. Anhui Conch Cement Company Limited was incorporated in 1997 and is based in Wuhu, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Wuhu",
        "zipcode": "241000",
        "website": "http://www.conch.cn",
        "market_cap": "Large Cap"
    },
    "C95.F": {
        "short_name": "CHINA SHANSHUI CEM.DL-,01",
        "long_name": "China Shanshui Cement Group Limited",
        "summary": "China Shanshui Cement Group Limited, an investment holding company, manufactures and sells cement, clinker, and concrete products in the People's Republic of China. It operates through four segments: Shandong Province, Northeastern China, Shanxi Province, and Xinjiang Region. The company is also involved in the mining, production, and sale of limestone; production and sale of concrete aggregates and building materials; installation of equipment and spare parts of cement machines; sale of coal; and development and maintenance of special railway-lines, as well as wash and repair of steam locomotive and provision of logistics services. In addition, it imports and exports cement, clinker, and related products; and provides mineral water and finance leasing services, as well as provides investment and management services, and consulting services. China Shanshui Cement Group Limited was incorporated in 2006 and is headquartered in Jinan, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": "250307",
        "website": "http://www.shanshuicement.com",
        "market_cap": "Small Cap"
    },
    "CBUMY": {
        "short_name": "CHINA NATIONAL BUILDING MATERIA",
        "long_name": "China National Building Material Company Limited",
        "summary": "China National Building Material Company Limited, an investment holding company, engages in cement, new materials, and engineering services businesses. The company operates in five segments: Cement, Concrete, New materials, Engineering services, and Others. It produces and sells cement, concrete, and glass fiber, as well as composite and lightweight building materials. The company also provides engineering services to glass and cement manufacturers and equipment procurement. In addition, it is involved in the merchandise trading and other businesses. It operates in the People's Republic of China, Europe, the Middle East, Southeast Asia, Oceania, Africa, the Americas, and internationally. China National Building Material Company Limited was founded in 2005 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100036",
        "website": "http://www.cnbmltd.com",
        "market_cap": "Large Cap"
    },
    "CHGS": {
        "short_name": "CHINA GENGSHING MINERALS INC",
        "long_name": "China Gengsheng Minerals, Inc.",
        "summary": "China GengSheng Minerals, Inc., through its subsidiaries, develops, manufactures, and sells a range of mineral-based, heat-resistant industrial material products. It operates in four segments: Refractories, Industrial Ceramics, Fracture Proppants, and Fine Precision Abrasives. The Refractories segment offers castable, coating, and dry mix materials; low-cement and non-cement castables; and pre-cast roofs that are used as linings and key components in various industrial furnaces, such as steel production furnaces, ladles, vessels, and other high-temperature processing machines that operate at high temperatures. The Industrial Ceramics segment provides abrasive balls and tiles, valves, electronic ceramics, and structural ceramics that are used as components for various end products, such as fuses, vacuum interrupters, electrical components, mud slurry pumps, and high-pressure pumps used in the electric power, electronic component, industrial pump, and metallurgy industries. The Fracture Proppants segment offers ball-like pellets that are used to reach pockets of oil and natural gas deposits trapped in the fractures under the ground. The Fine Precision Abrasives segment offers abrasives, which are primarily used for the surface-polishing and slicing of precision instruments, such as solar panels, as well as in a range of areas, including machinery manufacturing, electronics, optical glass, architecture, industry development, semiconductor, silicon chip, plastic, and lens. China GengSheng Minerals, Inc. sells its products to customers in the iron, steel, oil, glass, cement, aluminum, chemical, and solar industries in China, and other parts of Asia and Europe. The company was formerly known as China Minerals Technologies, Inc. and changed its name to China GengSheng Minerals, Inc. in July 2007. China GengSheng Minerals, Inc. is based in Gongyi, the People's Republic of China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Gongyi",
        "zipcode": "451271",
        "website": "http://www.gengsheng.com",
        "market_cap": "Small Cap"
    },
    "CRJI": {
        "short_name": "CHINA RUNJI CEMENT INC",
        "long_name": "China Runji Cement Inc.",
        "summary": "China Runji Cement Inc. engages in the manufacture and sale of cement in the People's Republic of China. It primarily offers ordinary silicate cement and cement clinker products. The company was founded in 2003 and is headquartered in Chao Hu City, the People's Republic of China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Chao Hu City",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "D1Y.F": {
        "short_name": "CHINA NATL BUIL. M. H YC1",
        "long_name": "China National Building Material Company Limited",
        "summary": "China National Building Material Company Limited, an investment holding company, engages in cement, new materials, and engineering services businesses. The company operates in five segments: Cement, Concrete, New materials, Engineering services, and Others. It produces and sells cement, concrete, and glass fiber, as well as composite and lightweight building materials. The company also provides engineering services to glass and cement manufacturers and equipment procurement. In addition, it is involved in the merchandise trading and other businesses. It operates in the People's Republic of China, Europe, the Middle East, Southeast Asia, Oceania, Africa, the Americas, and internationally. China National Building Material Company Limited was founded in 2005 and is based in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100036",
        "website": "http://www.cnbmltd.com",
        "market_cap": "Mid Cap"
    },
    "RETO": {
        "short_name": "ReTo Eco-Solutions, Inc.",
        "long_name": "ReTo Eco-Solutions, Inc.",
        "summary": "ReTo Eco-Solutions, Inc. manufactures and distributes construction materials primarily in China. Its products include aggregates, bricks, pavers, and tiles. The company's construction materials are used for water absorption, flood control, and water retention; for gardens, roads, bridges, city squares, retaining walls, and slope construction; for hydraulic ecological projects, such as slope protection and river transformation; and for insulation, decoration, and building walls. It also offers construction materials manufacturing equipment, such as automated production equipment with hydraulic integration in China, South Asia, North America, the Middle East, North Africa, and Southeast Asia. In addition, it provides construction solutions, including project consulting, design, and installation. Further, the company undertakes municipal construction projects, including sponge city projects, sewage pipeline construction, public plaza construction, and landscaping. It also exports its products. ReTo Eco-Solutions, Inc. was founded in 1999 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100101",
        "website": "http://www.retoeco.com",
        "market_cap": "Small Cap"
    },
    "T18.F": {
        "short_name": "CHI.TIANRUI GR.CEM.HD-,01",
        "long_name": "China Tianrui Group Cement Company Limited",
        "summary": "China Tianrui Group Cement Company Limited, an investment holding company, manufactures, distributes, and sells clinker and cement in the People's Republic of China. The company engages in the excavation of limestone, as well as produces, sells, and distributes cement clinker and cement products. It also exports its products. The company sells its cement products under Tianrui brand. It serves real estate developers, concrete manufacturers, etc. The company was founded in 2000 and is headquartered in Ruzhou, the People's Republic of China. China Tianrui Group Cement Company Limited is a subsidiary of Yu Kuo Company Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Ruzhou",
        "zipcode": "467500",
        "website": "http://www.trcement.com",
        "market_cap": "Small Cap"
    },
    "WFG1.F": {
        "short_name": "WEST CHINA CEMENT LS-,002",
        "long_name": "West China Cement Limited",
        "summary": "West China Cement Limited, an investment holding company, produces and sells cement and cement products in the People's Republic of China. The company sells its products under the Yao Bai and Yaobaishuini names. Its cement products are used in the construction of infrastructure projects, such as highways, railways, bridges, hydroelectric power stations, and water conservancy and water transfer projects, as well as housing and social infrastructure projects. The company also engages in financial leasing and transportation business. West China Cement Limited is headquartered in Xi'an, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": null,
        "website": "http://www.westchinacement.com",
        "market_cap": "Small Cap"
    }
}