{
    "000166.SZ": {
        "short_name": "SHENWAN HONGYUAN G",
        "long_name": "Shenwan Hongyuan Group Co., Ltd.",
        "summary": "Shenwan Hongyuan Group Co., Ltd. provides various financial services to corporate, professional institutional, individuals, and non-professional institutional customers. It operates through four segments: Enterprise Finance, Personal Finance, Institutional Services and Trading, and Investment Management. The Enterprise Finance segment offers equity financing, debt financing, financial advisory, equity investment, and debt and other investment services. The Personal Finance segment provides securities and futures brokerage, stock-backed lending, margin financing, securities lending, and investment advisory services, as well as sells financial products. The Institutional Services and Trading segment offers prime brokerage, and research and consultation services for professional institutional clients; and equity, and fixed income currencies and commodities proprietary trading to institutional clients. The Investment Management segment provides asset management, mutual fund management, and private equity fund management services. The company was formerly known as Shenyin Wanguo Securities Co., Ltd and changed its name to Shenwan Hongyuan Group Co., Ltd. in January 2015. Shenwan Hongyuan Group Co., Ltd. was founded in 1988 and is based in Urumqi, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Urumqi",
        "zipcode": "830011",
        "website": "http://www.swhygh.com",
        "market_cap": "Large Cap"
    },
    "000686.SZ": {
        "short_name": "NORTHEAST SECURITI",
        "long_name": "Northeast Securities Co., Ltd.",
        "summary": "Northeast Securities Co., Ltd. engages in the securities and securities-related business primarily in China. It is involved in securities brokerage; securities investment consulting; financial consulting related to securities trading and securities investment activities; securities underwriting and sponsorship; securities self-operation; margin financing and securities lending; securities investment fund agency sales; and the agency sales of financial products businesses. The company is headquartered in Changchun, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": "130118",
        "website": "http://www.nesc.cn",
        "market_cap": "Large Cap"
    },
    "000728.SZ": {
        "short_name": "GUOYUAN SECURITIES",
        "long_name": "Guoyuan Securities Company Limited",
        "summary": "Guoyuan Securities Company Limited operates as a securities brokerage company in China. The company offers retail brokerage, investment banking and management, credit, asset management, Internet financial, research consulting, integrated private equity, futures, private equity investment, and public fund management services. Guoyuan Securities Company Limited was founded in 2001 and is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230001",
        "website": "http://www.gyzq.com.cn",
        "market_cap": "Large Cap"
    },
    "000750.SZ": {
        "short_name": "SEALAND SECURITIES",
        "long_name": "Sealand Securities Co., Ltd.",
        "summary": "Sealand Securities Co., Ltd., together with its subsidiaries, provides securities brokerage services in China. The company's services include securities investment consulting; securities trading and investment; securities underwriting and sponsorship; securities asset management; securities investment fund agency; futures intermediary; and financing and securities lending services. It also provides wealth management, corporate finance, equity and bond financing, acquisition and merger, financial debt underwriting, financial market, research, Internet finance, and credit services. The company was formerly known as Guangxi Securities Firms and changed its name to Sealand Securities Co., Ltd. in 2001. Sealand Securities Co., Ltd. was founded in 1988 and is based in Nanning, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanning",
        "zipcode": "530028",
        "website": "http://www.ghzq.com.cn",
        "market_cap": "Large Cap"
    },
    "000783.SZ": {
        "short_name": "CHANGJIANG SECURIT",
        "long_name": "Changjiang Securities Company Limited",
        "summary": "Changjiang Securities Company Limited operates as a securities company in China. The company provides securities brokerage, investment banking, and asset management services. It also engages in the fixed income, securities derivatives, fund management, futures, and direct investment businesses. The company was formerly known as Hubei Securities Company. Changjiang Securities Company Limited was founded in 1991 and is headquartered in Wuhan, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430015",
        "website": "http://www.cjsc.com",
        "market_cap": "Large Cap"
    },
    "002500.SZ": {
        "short_name": "SHANXI SECURITIES",
        "long_name": "Shanxi Securities Co., Ltd.",
        "summary": "Shanxi Securities Co., Ltd. operates as a security company in China. The company is involved in the underwriting and sponsorship of stocks and bonds, as well as commodity futures brokerage, financial futures brokerage, and futures investment consulting, and asset management businesses. It also provides institutional financing, and enterprise M&A, and trade financing services. Shanxi Securities Co., Ltd. was founded in 1988 and is based in Taiyuan, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": "030002",
        "website": "http://www.sxzq.com",
        "market_cap": "Large Cap"
    },
    "002736.SZ": {
        "short_name": "GUOSEN SECURITIES",
        "long_name": "Guosen Securities Co., Ltd.",
        "summary": "Guosen Securities Co., Ltd. provides securities brokerage services in China. It offers investment banking, fixed income, asset management, research and institutional business, margin financing, off-market, self-investment, counter market, asset custody, and Internet banking services; and operates Guoxin TradeStation, a trading platform. The company was formerly known as Shenzhen Guotou Securities Co., Ltd. Guosen Securities Co., Ltd. was founded in 1994 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518001",
        "website": "http://www.guosen.com.cn",
        "market_cap": "Large Cap"
    },
    "002945.SZ": {
        "short_name": "CHINALIN SECURITIE",
        "long_name": "ChinaLin Securities Co., Ltd.",
        "summary": "ChinaLin Securities Co., Ltd. engages in the securities business in China. It is involved in securities brokerage, investment banking, asset management, investment management, and credit business activities. The company offers accounts; trading intermediary services; financial management products and services; capital market solutions, including restricted stock management and corporate refinancing; margin financing and securities lending, equity pledge, and contracted securities trading; and hedging solutions. The company is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518048",
        "website": "http://www.chinalions.com",
        "market_cap": "Large Cap"
    },
    "002961.SZ": {
        "short_name": "RUIDA FUTURES CO L",
        "long_name": "Ruida Futures Co., Ltd.",
        "summary": "Ruida Futures Co., Ltd. operates as a futures company in China. The company offers stock index and commodity futures, options, crude oil futures, and brokerage services; and investment advisory, risk management, and asset management services. It also operates a futures college; and provides real estate development services. The company was formerly known as Futures Brokerage Co., Ltd. and changed its name to Ruida Futures Co., Ltd. in November 2012. Ruida Futures Co., Ltd. was founded in 1993 and is headquartered in Xiamen, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361000",
        "website": "http://www.rdqh.com",
        "market_cap": "Mid Cap"
    },
    "1456.HK": {
        "short_name": "GUOLIAN SEC",
        "long_name": "Guolian Securities Co., Ltd.",
        "summary": "Guolian Securities Co., Ltd., together with its subsidiaries, provides various financial products and services in the People's Republic of China. It operates through Brokerage and Wealth Management; Credit Transaction; Investment Banking; Proprietary Trading; Assets Management and Investment; and Other Businesses segments. The company offers securities trading and brokering services; financial leverage services for brokerage clients, securities-backed lending services, and securities repurchase services; and corporate finance and financial advisory services to institutional clients and market maker business. It is also involved in direct investment and funds related businesses, as well as provision of management and maintenance, investment advisory, and transaction execution services; and securities and bonds underwriting and sponsorship, investment management, proprietary investment in venture capital, industrial investment, equity investment, asset management, introducing broker for futures companies, margin financing and securities lending, and agency sale of financial broker products. The company was formerly known as Wuxi Securities Co., Ltd. and changed its name to Guolian Securities Co., Ltd. in May 2008. Guolian Securities Co., Ltd. was founded in 1992 and is headquartered in Wuxi, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214000",
        "website": "http://www.glsc.com.cn",
        "market_cap": "Large Cap"
    },
    "1461.HK": {
        "short_name": "LUZHENG FUTURES",
        "long_name": "LUZHENG FUTURES Company Limited",
        "summary": "LUZHENG FUTURES Company Limited, a futures company, provides brokerage services for commodity and financial futures in the People's Republic of China. The company's Futures Brokerage segment offers futures brokerage and financial futures brokering services. Its Commodity Trading and Risk Management segment provides physical commodity trading, futures trading, and over-the-counter derivatives trading. The company's Futures Asset Management segment offers portfolio management and maintenance; investment advisory; and transaction execution services. Its Treasury and Others segment is involved in treasury operations. LUZHENG FUTURES Company Limited also engages in the sale and wholesale of agricultural and metal products, metallurgical materials, mineral products, precious metals, chemical products, and edible oil, as well as electronic products, office automation equipment, computers, cultural office machinery, control equipment, and machine room equipment; import and export activities; and provision of technical consultation, investment consultancy, technical services of computer network products and software, and capital risk management services. In addition, it provides software development, computer information system integration, and information technology services, as well as electronic engineering design and construction services. The company has a strategic agreement with Taishan Property & Casualty Insurance Co., Ltd. The company was founded in 1995 and is headquartered in Jinan, the People's Republic of China. LUZHENG FUTURES Company Limited is a subsidiary of Zhongtai Securities Co., Ltd.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": "250001",
        "website": "http://www.luzhengqh.com",
        "market_cap": "Small Cap"
    },
    "1476.HK": {
        "short_name": "HENGTOU SEC",
        "long_name": "Hengtai Securities Co., Ltd",
        "summary": "Hengtai Securities Co., Ltd provides a range of financial products and services in China. The company's Brokerage and Wealth Management segment trades in stocks, funds, bonds, and futures on behalf of the clients; and provides investment and financing solutions to high-end, professional, and institutional clients, including the sale of financial products, margin financing, and securities lending. Its Investment Banking segment offers corporate finance services comprising financial advisory, equity underwriting, and debt underwriting services, as well as over-the-counter services to institutional clients; and services to companies entering into National Equities Exchange and Quotations board for share quotation and transfer. The company's Proprietary Trading segment engages in the trading of equities, bonds, funds, and derivatives for the group. Its Investment Management segment is involved in asset management, private equity investment, and alternative investment activities. The company is also involved in securities investment and fund distribution, and securities sponsoring businesses; and venture capital and industrial investment businesses. In addition, it provides project investment, fund raising and management, and corporate management services, as well as investment and financial consulting services; and corporate asset reorganization, merger and acquisition, and marketing planning services, as well as manages equity investment funds and equity investments. The company serves individuals, institutional investors, and financial institutions, as well as large, small, and medium enterprises. As of December 31, 2020, it operated 122 securities branches. The company was founded in 1988 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100033",
        "website": "http://www.cnht.com.cn",
        "market_cap": "Mid Cap"
    },
    "153A.F": {
        "short_name": "GUOTAI JUNAN SEC.  H  YC1",
        "long_name": "Guotai Junan Securities Co., Ltd.",
        "summary": "Guotai Junan Securities Co., Ltd. operates as a securities company in the People's Republic of China. It operates through six segments: Institutional Finance-Institutional Investor Services, Institutional Finance-Investment Banking, Personal Finance, Investment Management, International Business, and Other. The company offers brokerage, stock-pledged financing, and securities repurchase services; and market-making and proprietary trading services, as well as research services for institutional clients. It also provides listing sponsorship, equity underwriting, debt underwriting, structured debt financing, and mergers and acquisitions financial advisory services, as well as various corporate solutions to corporate and government clients; and securities and futures brokerage, margin financing, securities lending, wealth management, and financial planning services to retail clients through online and offline channels. In addition, the company offers asset management, fund management, and direct investment management services to institutions and individuals. Further, it is involved in the brokerage, corporate finance, and investment businesses; and provision of alternative investment, securities investment consultation, futures investment consultation, equity investment, venture capital, investment consultation, and other services. Additionally, the company engages in the financial advisory business related to securities trading and investment; and agency sale of securities investment funds, as well as financial products. Guotai Junan Securities Co., Ltd. was founded in 1992 and is based in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200120",
        "website": "http://www.gtja.com",
        "market_cap": "Large Cap"
    },
    "2611.HK": {
        "short_name": "GTJA",
        "long_name": "Guotai Junan Securities Co., Ltd.",
        "summary": "Guotai Junan Securities Co., Ltd. operates as a securities company in the People's Republic of China. It operates through six segments: Institutional Finance-Institutional Investor Services, Institutional Finance-Investment Banking, Personal Finance, Investment Management, International Business, and Other. The company offers brokerage, stock-pledged financing, and securities repurchase services; and market-making and proprietary trading services, as well as research services for institutional clients. It also provides listing sponsorship, equity underwriting, debt underwriting, structured debt financing, and mergers and acquisitions financial advisory services, as well as various corporate solutions to corporate and government clients; and securities and futures brokerage, margin financing, securities lending, wealth management, and financial planning services to retail clients through online and offline channels. In addition, the company offers asset management, fund management, and direct investment management services to institutions and individuals. Further, it is involved in the brokerage, corporate finance, and investment businesses; and provision of alternative investment, securities investment consultation, futures investment consultation, equity investment, venture capital, investment consultation, and other services. Additionally, the company engages in the financial advisory business related to securities trading and investment; and agency sale of securities investment funds, as well as financial products. Guotai Junan Securities Co., Ltd. was founded in 1992 and is based in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200120",
        "website": "http://www.gtja.com",
        "market_cap": "Large Cap"
    },
    "2X2A.F": {
        "short_name": "SHENWAN HONGYUAN GR.H YC1",
        "long_name": "Shenwan Hongyuan Group Co., Ltd.",
        "summary": "Shenwan Hongyuan Group Co., Ltd. provides various financial services to corporate, professional institutional, individuals, and non-professional institutional customers. It operates through four segments: Enterprise Finance, Personal Finance, Institutional Services and Trading, and Investment Management. The Enterprise Finance segment offers equity financing, debt financing, financial advisory, equity investment, and debt and other investment services. The Personal Finance segment provides securities and futures brokerage, stock-backed lending, margin financing, securities lending, and investment advisory services, as well as sells financial products. The Institutional Services and Trading segment offers prime brokerage, and research and consultation services for professional institutional clients; and equity, and fixed income currencies and commodities proprietary trading to institutional clients. The Investment Management segment provides asset management, mutual fund management, and private equity fund management services. The company was formerly known as Shenyin Wanguo Securities Co., Ltd and changed its name to Shenwan Hongyuan Group Co., Ltd. in January 2015. Shenwan Hongyuan Group Co., Ltd. was founded in 1988 and is based in Urumqi, China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Urumqi",
        "zipcode": "830011",
        "website": "http://www.swhygh.com",
        "market_cap": "Large Cap"
    },
    "34V.F": {
        "short_name": "GUOLIAN SECS CO.LTD H YC1",
        "long_name": "Guolian Securities Co., Ltd.",
        "summary": "Guolian Securities Co., Ltd., together with its subsidiaries, provides various financial products and services in the People's Republic of China. It operates through Brokerage and Wealth Management; Credit Transaction; Investment Banking; Proprietary Trading; Assets Management and Investment; and Other Businesses segments. The company offers securities trading and brokering services; financial leverage services for brokerage clients, securities-backed lending services, and securities repurchase services; and corporate finance and financial advisory services to institutional clients and market maker business. It is also involved in direct investment and funds related businesses, as well as provision of management and maintenance, investment advisory, and transaction execution services; and securities and bonds underwriting and sponsorship, investment management, proprietary investment in venture capital, industrial investment, equity investment, asset management, introducing broker for futures companies, margin financing and securities lending, and agency sale of financial broker products. The company was formerly known as Wuxi Securities Co., Ltd. and changed its name to Guolian Securities Co., Ltd. in May 2008. Guolian Securities Co., Ltd. was founded in 1992 and is headquartered in Wuxi, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214000",
        "website": "http://www.glsc.com.cn",
        "market_cap": "Mid Cap"
    },
    "3678.HK": {
        "short_name": "HOLLY FUTURES",
        "long_name": "Holly Futures Co., Ltd.",
        "summary": "Holly Futures Co., Ltd. operates as a futures company in Mainland China and Honk Kong. It primarily offers commodity and financial futures brokerage services; asset management services; investment consulting; and risk management services. The company also provides financial assets investment products, including securities, funds, and wealth management products. In addition, it offers hedging and warehouse receipt services. As of December 31, 2020, it had 39 futures branches and 6 sub-branches. The company was founded in 1995 and is headquartered in Nanjing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210001",
        "website": "http://www.ftol.com.cn",
        "market_cap": "Small Cap"
    },
    "600109.SS": {
        "short_name": "SINOLINK SECURITIES CO. LTD.",
        "long_name": "Sinolink Securities Co., Ltd.",
        "summary": "Sinolink Securities Co., Ltd. engages in investment banking and securities brokerage businesses in China. It also provides fixed income, asset management, investment advisory, asset custody, and off-market services; and engages in Derivatives business. The company was founded in 1988 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.gjzq.com.cn",
        "market_cap": "Large Cap"
    },
    "600837.SS": {
        "short_name": "HAITONG SECURITIES CO.LTD",
        "long_name": "Haitong Securities Co., Ltd.",
        "summary": "Haitong Securities Co., Ltd. operates as a securities company primarily in Mainland China, Hong Kong, and Europe. It operates through Wealth Management, Investment Banking, Asset Management, Trading and Institution, Finance Lease, and Others segments. The Wealth Management segment offers securities and futures brokering and dealing, investment consulting, and wealth management services, as well as financial services, such as margin financing, securities lending, stock pledge, etc. The Investment Banking segment provides sponsoring and underwriting services in equity and debt capital markets; financial consulting services, which include merger and assets restructuring services; and services related to the national equities exchange and quotations. The Asset Management segment offers investment management services on investment products comprising asset, fund, and private equity management to individual, corporate, and institutional clients. The Trading and Institution segment provides stock sales and trading, prime brokerage, and stock lending and research services in financial markets; market-making services for fixed income, currency and commodity products, futures and options, and derivatives on various exchanges; and investment funds and private equity projects. The Finance Lease segment offers financial solutions that include finance and operating lease, factoring, entrustment loans, and related consulting services. The Others segment provides warehouse receipts pledge, pricing, and market-making services, as well as services related to risk management. The company also offers fund trading, distribution, and management services; financial and commodity futures contracts broking and dealing services; investment advisory and management services; banking services; and real estate development, property management, and catering management services. Haitong Securities Co., Ltd. was founded in 1988 and is based in Shanghai, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200001",
        "website": "http://www.htsec.com",
        "market_cap": "Large Cap"
    },
    "600909.SS": {
        "short_name": "HUAAN SECURITIES CO LTD",
        "long_name": "Huaan Securities Co., Ltd.",
        "summary": "Huaan Securities Co., Ltd., together with its subsidiaries, provides securities brokerage, investment consulting, and other services in China. The company also offers investment banking services, including IPO, merger and acquisition, refinancing, and new board listing services; and asset management services. In addition, it provides financial services; and specializes in fixed income securities and related derivative products. The company was founded in 1991 and is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230081",
        "website": "http://www.hazq.com",
        "market_cap": "Large Cap"
    },
    "600918.SS": {
        "short_name": "ZHONGTAI SECURITIES CO. LTD.",
        "long_name": "Zhongtai Securities Co., Ltd.",
        "summary": "Zhongtai Securities Co., Ltd. operates as a securities brokerage company in China. It provides financial advisory, securities issuance and underwriting, mergers and acquisitions, asset restructuring, asset management, margin financing, securities lending, and investment consulting services, as well as acts as an agent for securities trading, financial products, and securities investment fund. The company is also involved in the credit, investment banking, wealth management, counter market, institutional sales transaction, self-operated, and research consulting businesses, as well as offers risk management; compliance management; and hosting, outsourcing, and institutional brokerage services. In addition, it operates Zhongtai Qifutong, a mobile Internet integrated service portal platform for Zhongtai securities. The company was formerly known as Qilu Securities Co., Ltd. Zhongtai Securities Co., Ltd. is based in Jinan, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": "250001",
        "website": "http://www.zts.com.cn",
        "market_cap": "Large Cap"
    },
    "601162.SS": {
        "short_name": "TIANFENG SECURITIES CO LTD",
        "long_name": "Tianfeng Securities Co., Ltd.",
        "summary": "Tianfeng Securities Co., Ltd. operates as a securities company. The company offers brokerage business, such as securities trading, diversified financial wealth management products, and professional capital intermediary; and a package of services for professional investors and high net worth clients, such as private equity funds and trusts, including fast trading systems, investment research services, performance evaluation and risk management, financing solutions, and promotion of quality asset projects. It also provides investment banking services, such as equity, debt financing, and mergers and acquisitions, as well as IPO and refinancing services; and engages in bond underwriting, asset securitization, asset management, private fund, and futures businesses. The company was founded in 2000 and is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430071",
        "website": "http://www.tfzq.com",
        "market_cap": "Large Cap"
    },
    "601211.SS": {
        "short_name": "GUOTAI JUNAN SECURITIES CO LTD",
        "long_name": "Guotai Junan Securities Co., Ltd.",
        "summary": "Guotai Junan Securities Co., Ltd. operates as a securities company in the People's Republic of China. It operates through six segments: Institutional Finance-Institutional Investor Services, Institutional Finance-Investment Banking, Personal Finance, Investment Management, International Business, and Other. The company offers brokerage, stock-pledged financing, and securities repurchase services; and market-making and proprietary trading services, as well as research services for institutional clients. It also provides listing sponsorship, equity underwriting, debt underwriting, structured debt financing, and mergers and acquisitions financial advisory services, as well as various corporate solutions to corporate and government clients; and securities and futures brokerage, margin financing, securities lending, wealth management, and financial planning services to retail clients through online and offline channels. In addition, the company offers asset management, fund management, and direct investment management services to institutions and individuals. Further, it is involved in the brokerage, corporate finance, and investment businesses; and provision of alternative investment, securities investment consultation, futures investment consultation, equity investment, venture capital, investment consultation, and other services. Additionally, the company engages in the financial advisory business related to securities trading and investment; and agency sale of securities investment funds, as well as financial products. Guotai Junan Securities Co., Ltd. was founded in 1992 and is based in Shanghai, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200120",
        "website": "http://www.gtja.com",
        "market_cap": "Large Cap"
    },
    "601236.SS": {
        "short_name": "HONGTA SECURITIES CO LTD",
        "long_name": "Hongta Securities Co., Ltd.",
        "summary": "Hongta Securities Co., Ltd. operates as a securities company in China. It offers phone, mobile, and online trading services; asset management services; credit business products; futures market information and trading facilities; and investment banking services. The company was founded in 2002 and is headquartered in Kunming, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": "650011",
        "website": "http://www.hongtastock.com",
        "market_cap": "Large Cap"
    },
    "601456.SS": {
        "short_name": "GUOLIAN SECURITIES CO LTD",
        "long_name": "Guolian Securities Co., Ltd.",
        "summary": "Guolian Securities Co., Ltd., together with its subsidiaries, provides various financial products and services in the People's Republic of China. It operates through Brokerage and Wealth Management; Credit Transaction; Investment Banking; Proprietary Trading; Assets Management and Investment; and Other Businesses segments. The company offers securities trading and brokering services; financial leverage services for brokerage clients, securities-backed lending services, and securities repurchase services; and corporate finance and financial advisory services to institutional clients and market maker business. It is also involved in direct investment and funds related businesses, as well as provision of management and maintenance, investment advisory, and transaction execution services; and securities and bonds underwriting and sponsorship, investment management, proprietary investment in venture capital, industrial investment, equity investment, asset management, introducing broker for futures companies, margin financing and securities lending, and agency sale of financial broker products. The company was formerly known as Wuxi Securities Co., Ltd. and changed its name to Guolian Securities Co., Ltd. in May 2008. Guolian Securities Co., Ltd. was founded in 1992 and is headquartered in Wuxi, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214000",
        "website": "http://www.glsc.com.cn",
        "market_cap": "Large Cap"
    },
    "601555.SS": {
        "short_name": "SOOCHOW SECURITIES CO LTD",
        "long_name": "Soochow Securities Co., Ltd.",
        "summary": "Soochow Securities Co., Ltd. provides a range of securities management services in China. The company offers investment banking services, such as stock underwriting and sponsorship, bond underwriting, NEEQ, mergers and acquisitions, financial advisory, and other integrated financial services. It also provides asset and fund management; investment in equity and fixed income securities, derivatives, and other alternative financial products; securities brokerage; and securities financing and loan services, as well as engages in Internet financial business. The company was founded in 1993 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": null,
        "website": "http://www.dwjq.com.cn",
        "market_cap": "Large Cap"
    },
    "601688.SS": {
        "short_name": "HUATAI SECURITIES CO LTD",
        "long_name": "Huatai Securities Co., Ltd.",
        "summary": "Huatai Securities Co., Ltd., a security company, provides financial services in Mainland China and internationally. It operates through Wealth Management, Institutional Services, Investment Management, and International Business segments. The company trades in stocks, funds, bonds, futures, and options on behalf of clients; promotes and sells securities products and services; and provides various financial products and asset allocation, margin financing, securities lending, securities-backed lending, and stock pledged lending services. It also offers investment banking services consisting of equity underwriting services, which include IPO and equity refinancing services; debt underwriting services, such as bond financing services; mergers-oriented financial advisory services; and over-the-counter financial products and transactions, including national equities exchange and quotations listing, and follow-on financing services. In addition, the company provides asset custody and fund services, including settlement, liquidation, reporting, and valuation for private and public funds; margin trading; research services; equity securities investments and transactions; fixed income investments and transactions; asset management; private equity and alternative investment; commodities trading and arbitrage; investment portfolio and fund management; customer relation management; and leveraged buyout, strategic M&A, pre-listing financing, business expansion, and other related services. It offers its products through mobile service and digital platforms, as well as cloud platforms. The company was founded in 1990 and is based in Nanjing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210019",
        "website": "http://www.htsc.com.cn",
        "market_cap": "Large Cap"
    },
    "601878.SS": {
        "short_name": "ZHESHANG SECURITIES CO. LTD",
        "long_name": "Zheshang Securities Co., Ltd.",
        "summary": "Zheshang Securities Co., Ltd., a securities company, provides investment and financing services in China. The company offers securities brokerage services, including wealth management, derivatives brokerage, capital intermediary, and investment advisory services; and securities asset management services, such as quantitative investment, private equity investment bank, equity investment, refining current managed, and public fund services. It also provides investment banking services comprising sponsored underwriting, fixed income, OTC market, and financial advisory services; FICC business, direct investment, self-employment equity investment, and financial derivative investment services; and futures brokerage, overseas business, wealth management, and risk management services. In addition, the company engages in the research on macro, bond, strategy, industry, corporate, and financial derivatives with research on growth stocks, Zhejiang plate research, large consumption research, and quantitative strategies; and provision of professional research and consulting services. It operates approximately 100 branches in 22 provinces. The company was founded in 2002 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310020",
        "website": "http://www.stocke.com.cn",
        "market_cap": "Large Cap"
    },
    "603093.SS": {
        "short_name": "NANHUA FUTURES CO. LTD",
        "long_name": "Nanhua Futures Co., Ltd.",
        "summary": "Nanhua Futures Co., Ltd. operates a financial derivatives service platform worldwide. The company is involved in the commodity futures brokerage, financial futures brokerage, futures investment consulting, asset management business, and securities investment fund sales agency businesses. It also offers risk management services. The company was founded in 1996 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310002",
        "website": "http://www.nanhua.net",
        "market_cap": "Mid Cap"
    },
    "6806.HK": {
        "short_name": "SWHY",
        "long_name": "Shenwan Hongyuan Group Co., Ltd.",
        "summary": "Shenwan Hongyuan Group Co., Ltd. provides various financial services to corporate, professional institutional, individuals, and non-professional institutional customers. It operates through four segments: Enterprise Finance, Personal Finance, Institutional Services and Trading, and Investment Management. The Enterprise Finance segment offers equity financing, debt financing, financial advisory, equity investment, and debt and other investment services. The Personal Finance segment provides securities and futures brokerage, stock-backed lending, margin financing, securities lending, and investment advisory services, as well as sells financial products. The Institutional Services and Trading segment offers prime brokerage, and research and consultation services for professional institutional clients; and equity, and fixed income currencies and commodities proprietary trading to institutional clients. The Investment Management segment provides asset management, mutual fund management, and private equity fund management services. The company was formerly known as Shenyin Wanguo Securities Co., Ltd and changed its name to Shenwan Hongyuan Group Co., Ltd. in January 2015. Shenwan Hongyuan Group Co., Ltd. was founded in 1988 and is based in Urumqi, China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Urumqi",
        "zipcode": "830011",
        "website": "http://www.swhygh.com",
        "market_cap": "Large Cap"
    },
    "6837.HK": {
        "short_name": "HAITONG SEC",
        "long_name": "Haitong Securities Co., Ltd.",
        "summary": "Haitong Securities Co., Ltd. operates as a securities company primarily in Mainland China, Hong Kong, and Europe. It operates through Wealth Management, Investment Banking, Asset Management, Trading and Institution, Finance Lease, and Others segments. The Wealth Management segment offers securities and futures brokering and dealing, investment consulting, and wealth management services, as well as financial services, such as margin financing, securities lending, stock pledge, etc. The Investment Banking segment provides sponsoring and underwriting services in equity and debt capital markets; financial consulting services, which include merger and assets restructuring services; and services related to the national equities exchange and quotations. The Asset Management segment offers investment management services on investment products comprising asset, fund, and private equity management to individual, corporate, and institutional clients. The Trading and Institution segment provides stock sales and trading, prime brokerage, and stock lending and research services in financial markets; market-making services for fixed income, currency and commodity products, futures and options, and derivatives on various exchanges; and investment funds and private equity projects. The Finance Lease segment offers financial solutions that include finance and operating lease, factoring, entrustment loans, and related consulting services. The Others segment provides warehouse receipts pledge, pricing, and market-making services, as well as services related to risk management. The company also offers fund trading, distribution, and management services; financial and commodity futures contracts broking and dealing services; investment advisory and management services; banking services; and real estate development, property management, and catering management services. Haitong Securities Co., Ltd. was founded in 1988 and is based in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200001",
        "website": "http://www.htsec.com",
        "market_cap": "Large Cap"
    },
    "6881.HK": {
        "short_name": "CGS",
        "long_name": "China Galaxy Securities Co., Ltd.",
        "summary": "China Galaxy Securities Co., Ltd. provides various financial services in the People's Republic of China. Its Securities Brokerage segment offers securities dealing and broking; margin financing to margin clients; and securities lending services. The Company's Futures Brokerage segment is involved in futures dealing and broking, futures information consulting, and training activities. Its Proprietary Trading and Other Securities Trading Services segment engages in the trading of equities, bonds, funds, derivatives, and other financial products. The Company's Investment Banking segment provides corporate financial services, including equity and debt securities underwriting, and financial advisory services to institutional clients. Its Asset Management segment offers portfolio management, investment advisory, and transaction execution services. The Company's Private Equity and Alternative Investment segment makes equity investments in private companies. Its Overseas Business segment provides securities brokerage, futures brokerage, securities research, investment banking, margin financing, money lending, asset management, and insurance brokerage services in Hong Kong. The company serves various individual and institutional clients comprising multinational corporations, medium and small-sized enterprises, high-net-worth clients, and retail clients. It operates through a network of 36 branch offices and 493 securities branches. The company was founded in 2007 and is headquartered in Beijing, the People's Republic of China. China Galaxy Securities Co., Ltd. is a subsidiary of China Galaxy Financial Holdings Company Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100073",
        "website": "http://www.chinastock.com.cn",
        "market_cap": "Large Cap"
    },
    "6886.HK": {
        "short_name": "HTSC",
        "long_name": "Huatai Securities Co., Ltd.",
        "summary": "Huatai Securities Co., Ltd., a security company, provides financial services in Mainland China and internationally. It operates through Wealth Management, Institutional Services, Investment Management, and International Business segments. The company trades in stocks, funds, bonds, futures, and options on behalf of clients; promotes and sells securities products and services; and provides various financial products and asset allocation, margin financing, securities lending, securities-backed lending, and stock pledged lending services. It also offers investment banking services consisting of equity underwriting services, which include IPO and equity refinancing services; debt underwriting services, such as bond financing services; mergers-oriented financial advisory services; and over-the-counter financial products and transactions, including national equities exchange and quotations listing, and follow-on financing services. In addition, the company provides asset custody and fund services, including settlement, liquidation, reporting, and valuation for private and public funds; margin trading; research services; equity securities investments and transactions; fixed income investments and transactions; asset management; private equity and alternative investment; commodities trading and arbitrage; investment portfolio and fund management; customer relation management; and leveraged buyout, strategic M&A, pre-listing financing, business expansion, and other related services. It offers its products through mobile service and digital platforms, as well as cloud platforms. The company was founded in 1990 and is based in Nanjing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210019",
        "website": "http://www.htsc.com.cn",
        "market_cap": "Large Cap"
    },
    "6HT.F": {
        "short_name": "HAITONG SECURITIES H YC 1",
        "long_name": "Haitong Securities Co., Ltd.",
        "summary": "Haitong Securities Co., Ltd. operates as a securities company primarily in Mainland China, Hong Kong, and Europe. It operates through Wealth Management, Investment Banking, Asset Management, Trading and Institution, Finance Lease, and Others segments. The Wealth Management segment offers securities and futures brokering and dealing, investment consulting, and wealth management services, as well as financial services, such as margin financing, securities lending, stock pledge, etc. The Investment Banking segment provides sponsoring and underwriting services in equity and debt capital markets; financial consulting services, which include merger and assets restructuring services; and services related to the national equities exchange and quotations. The Asset Management segment offers investment management services on investment products comprising asset, fund, and private equity management to individual, corporate, and institutional clients. The Trading and Institution segment provides stock sales and trading, prime brokerage, and stock lending and research services in financial markets; market-making services for fixed income, currency and commodity products, futures and options, and derivatives on various exchanges; and investment funds and private equity projects. The Finance Lease segment offers financial solutions that include finance and operating lease, factoring, entrustment loans, and related consulting services. The Others segment provides warehouse receipts pledge, pricing, and market-making services, as well as services related to risk management. The company also offers fund trading, distribution, and management services; financial and commodity futures contracts broking and dealing services; investment advisory and management services; banking services; and real estate development, property management, and catering management services. Haitong Securities Co., Ltd. was founded in 1988 and is based in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200001",
        "website": "http://www.htsec.com",
        "market_cap": "Large Cap"
    },
    "BTCM": {
        "short_name": "BIT Mining Limited",
        "long_name": "BIT Mining Limited",
        "summary": "BIT Mining Limited operates as a cryptocurrency mining company. It holds three hydroelectric cryptocurrency mines with combined electric power capacity of 435MW; and mining pool business, including the domain name and the cryptocurrency wallet of BTC.com, as well as purchases and deploys bitcoin mining machines. The company was formerly known as 500.com Limited and changed its name to BIT Mining Limited in April 2021. BIT Mining Limited was founded in 2001 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518115",
        "website": "http://www.500.com",
        "market_cap": "Small Cap"
    },
    "CGL.F": {
        "short_name": "CHINA GALAXY SECS  H YC 1",
        "long_name": "China Galaxy Securities Co., Ltd.",
        "summary": "China Galaxy Securities Co., Ltd. provides various financial services in the People's Republic of China. Its Securities Brokerage segment offers securities dealing and broking; margin financing to margin clients; and securities lending services. The Company's Futures Brokerage segment is involved in futures dealing and broking, futures information consulting, and training activities. Its Proprietary Trading and Other Securities Trading Services segment engages in the trading of equities, bonds, funds, derivatives, and other financial products. The Company's Investment Banking segment provides corporate financial services, including equity and debt securities underwriting, and financial advisory services to institutional clients. Its Asset Management segment offers portfolio management, investment advisory, and transaction execution services. The Company's Private Equity and Alternative Investment segment makes equity investments in private companies. Its Overseas Business segment provides securities brokerage, futures brokerage, securities research, investment banking, margin financing, money lending, asset management, and insurance brokerage services in Hong Kong. The company serves various individual and institutional clients comprising multinational corporations, medium and small-sized enterprises, high-net-worth clients, and retail clients. It operates through a network of 36 branch offices and 493 securities branches. The company was founded in 2007 and is headquartered in Beijing, the People's Republic of China. China Galaxy Securities Co., Ltd. is a subsidiary of China Galaxy Financial Holdings Company Limited.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100073",
        "website": "http://www.chinastock.com.cn",
        "market_cap": "Large Cap"
    },
    "CI9.F": {
        "short_name": "CITIC SECURITIES H YC 1",
        "long_name": "CITIC Securities Company Limited",
        "summary": "CITIC Securities Company Limited provides various financial products and services in Mainland China and internationally. It operates through Investment Banking, Brokerage, Trading, Asset Management, and Others segments. The company offers investment banking services, including equity and debt financing, and asset-backed securitization, as well as fund raising and financial advisory services to a range of enterprises and other institutional clients. It is also involved in broking of securities and futures; distribution of financial products; and trading and market-making of equity products, fixed income products and derivatives, foreign exchange, margin financing and securities lending, alternative investment, and commodities business. In addition, the company offers asset management services, such as collective asset management, specialized asset management, separately managed account, fund management, and other investment accounts management; private equity investment and other services; and custody and research services. Further, it provides institutional brokerage, investment advisory and management, investment consultancy, fiduciary management, fund, real estate, business training, and financial products and securities investment services. Additionally, the company offers finance outsourcing, bond issuance, offshore portfolio hedge and investment fund, fund distribution, leveraged foreign exchange and other transactions, investment with self-owned capital, cash transactions, property management and leasing, and other services. It also engages in the information technology development, technical consulting, and research and development of financial products, portfolio design, and consulting activities. The company was incorporated in 1995 and is based in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518048",
        "website": "http://www.cs.ecitic.com",
        "market_cap": "Large Cap"
    },
    "CIIHF": {
        "short_name": "CITIC SECURITIES CO LTD",
        "long_name": "CITIC Securities Company Limited",
        "summary": "CITIC Securities Company Limited provides various financial products and services in Mainland China and internationally. It operates through Investment Banking, Brokerage, Trading, Asset Management, and Others segments. The company offers investment banking services, including equity and debt financing, and asset-backed securitization, as well as fund raising and financial advisory services to a range of enterprises and other institutional clients. It is also involved in broking of securities and futures; distribution of financial products; and trading and market-making of equity products, fixed income products and derivatives, foreign exchange, margin financing and securities lending, alternative investment, and commodities business. In addition, the company offers asset management services, such as collective asset management, specialized asset management, separately managed account, fund management, and other investment accounts management; private equity investment and other services; and custody and research services. Further, it provides institutional brokerage, investment advisory and management, investment consultancy, fiduciary management, fund, real estate, business training, and financial products and securities investment services. Additionally, the company offers finance outsourcing, bond issuance, offshore portfolio hedge and investment fund, fund distribution, leveraged foreign exchange and other transactions, investment with self-owned capital, cash transactions, property management and leasing, and other services. It also engages in the information technology development, technical consulting, and research and development of financial products, portfolio design, and consulting activities. The company was incorporated in 1995 and is based in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518048",
        "website": "http://www.cs.ecitic.com",
        "market_cap": "Large Cap"
    },
    "CIIHY": {
        "short_name": "CITIC SECURITIES CO LTD",
        "long_name": "CITIC Securities Company Limited",
        "summary": "CITIC Securities Company Limited provides various financial products and services in Mainland China and internationally. It operates through Investment Banking, Brokerage, Trading, Asset Management, and Others segments. The company offers investment banking services, including equity and debt financing, and asset-backed securitization, as well as fund raising and financial advisory services to a range of enterprises and other institutional clients. It is also involved in broking of securities and futures; distribution of financial products; and trading and market-making of equity products, fixed income products and derivatives, foreign exchange, margin financing and securities lending, alternative investment, and commodities business. In addition, the company offers asset management services, such as collective asset management, specialized asset management, separately managed account, fund management, and other investment accounts management; private equity investment and other services; and custody and research services. Further, it provides institutional brokerage, investment advisory and management, investment consultancy, fiduciary management, fund, real estate, business training, and financial products and securities investment services. Additionally, the company offers finance outsourcing, bond issuance, offshore portfolio hedge and investment fund, fund distribution, leveraged foreign exchange and other transactions, investment with self-owned capital, cash transactions, property management and leasing, and other services. It also engages in the information technology development, technical consulting, and research and development of financial products, portfolio design, and consulting activities. The company was incorporated in 1995 and is based in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518048",
        "website": "http://www.cs.ecitic.com",
        "market_cap": "Large Cap"
    },
    "CIM.F": {
        "short_name": "CHINA INT.CAP.CORP.H YC 1",
        "long_name": "China International Capital Corporation Limited",
        "summary": "China International Capital Corporation Limited provides financial services in Mainland China and internationally. The company operates through six segments: Investment Banking; Equities; Fixed Income, Commodities, and Currencies (FICC); Asset Management; Private Equity, and Wealth Management. The Investment Banking segment provides investment banking services, including equity financing, debt, and structured financing and financial advisory services. The Equity segment offers investment research, sales, trading, and products and cross-border services, including institutional trading and capital services, such as primary brokerage, over-the-counter derivatives, capital introduction, and market-making transactions. The FICC segment provides fixed-income products, such as interest rate, credit, and structured products, as well as on overseas exchange and commodities. The Asset Management segment engages in the social security and annuity investment management, institutional entrusted investment management, overseas asset management, retail and mutual fund businesses, etc. The Private Equity segment provides corporate equity funds, fund of funds, dollar funds, real estate funds, infrastructure funds, etc. The Wealth Management segment offers wealth transactional, capital, and product configuration services. The company serves domestic and overseas investors, and corporations and institutional clients, as well as retail clients, families, and corporate clients. China International Capital Corporation Limited was incorporated in 1995 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100004",
        "website": "http://www.cicc.com",
        "market_cap": "Large Cap"
    },
    "CNICF": {
        "short_name": "CHINA INTL CAPITAL CORPORATION ",
        "long_name": "China International Capital Corporation Limited",
        "summary": "China International Capital Corporation Limited provides financial services in Mainland China and internationally. The company operates through six segments: Investment Banking; Equities; Fixed Income, Commodities, and Currencies (FICC); Asset Management; Private Equity, and Wealth Management. The Investment Banking segment provides investment banking services, including equity financing, debt, and structured financing and financial advisory services. The Equity segment offers investment research, sales, trading, and products and cross-border services, including institutional trading and capital services, such as primary brokerage, over-the-counter derivatives, capital introduction, and market-making transactions. The FICC segment provides fixed-income products, such as interest rate, credit, and structured products, as well as on overseas exchange and commodities. The Asset Management segment engages in the social security and annuity investment management, institutional entrusted investment management, overseas asset management, retail and mutual fund businesses, etc. The Private Equity segment provides corporate equity funds, fund of funds, dollar funds, real estate funds, infrastructure funds, etc. The Wealth Management segment offers wealth transactional, capital, and product configuration services. The company serves domestic and overseas investors, and corporations and institutional clients, as well as retail clients, families, and corporate clients. China International Capital Corporation Limited was incorporated in 1995 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100004",
        "website": "http://www.cicc.com",
        "market_cap": "Large Cap"
    },
    "CS0.F": {
        "short_name": "CSC FINANCIAL CO. H YC 1",
        "long_name": "CSC Financial Co., Ltd.",
        "summary": "CSC Financial Co., Ltd., together with its subsidiaries, provides investment banking services in Mainland China and internationally. The company operates through Investment Banking, Wealth Management, Trading and Institutional Client Services, and Asset Management segments. The Investment Banking segment offers financial advisory, sponsoring, and equity and debt securities underwriting services. The Wealth Management segment provides brokerage agency services for corporate and personal clients in the trading of equity stocks, funds, bonds, and futures, as well as margin financing and securities lending services. The Trading and Institutional Client Services segment trades in financial products; and offers brokerage agency services for financial institutions in the trading of equity stocks, funds, and bonds, as well as margin financing and securities lending services. This segment also provides services in relation to the sale of financial products to institutional clients, and specialized research and advisory services. The Asset Management segment develops asset management and fund management products, as well as offers private placement offerings and related services. The company was formerly known as China Securities Finance Co., Ltd. CSC Financial Co., Ltd. was founded in 2005 and is based in Beijing, China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100010",
        "website": "http://www.csc108.com",
        "market_cap": "Mid Cap"
    },
    "CSOL": {
        "short_name": "CHINA SOLAR & CLEAN ENERGY SOL ",
        "long_name": "China Solar & Clean Energy Solutions, Inc.",
        "summary": "China Solar & Clean Energy Solutions, Inc., through its subsidiaries, designs and provides integrated renewable energy solutions for industrial clients and real estate developers in China and internationally. The company offers evacuated tubular and flat plate solar water heaters; biomass stove; and spacing heating devices along with industrial waste heat recovery systems, including hot tube heat exchanger, high temperature hot air furnace, heat pipe evaporator, dust removal and desulfurization system, and constant pressure hot water boiler, as well as smokeless coal-fired boilers and bio-materials furnaces. It also provides industrial waste heat recovery systems, as well as heating products, such as heating pipes, heat exchangers, specialty heating pipes and tubes, high temperature hot blast stoves, heating filters, normal pressure water boilers, and radiators. In addition, the company offers densely covered regular tubular heaters; and sells spare parts for its products, as well as provides after-sales maintenance and repair services. China Solar & Clean Energy Solutions sells its products through a network of distributors, wholesalers, sales agents, and retailers. The company is based in Beijing, China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100071",
        "website": "http://www.delisolar.com",
        "market_cap": "Small Cap"
    },
    "FNZA.F": {
        "short_name": "CHINA FIN.ONL.ADR/50 NEW",
        "long_name": "China Finance Online Co. Limited",
        "summary": "China Finance Online Co. Limited; together with its subsidiaries, provides web-based financial services in the People's Republic of China (PRC) and Hong Kong. The company operates through three segments: Commodities Brokerage Services; Online Financial Information and Advisory Service, and Other Related Services; and Hong Kong Brokerage Services. It provides online access to securities trading services, wealth management products, and securities investment advisory services to retail investors; and financial database and analytics to institutional investors, including financial, research, academic, and regulatory institutions, as well as financial software products. The company is involved in the operation of Yinglibao, an Internet-based financial platform that integrates cash management solutions and mutual fund distribution into iTougu, which facilitates communication between securities investment advisors and their clients; JRJ mobile app for financial information, securities trading, investment advisory, and wealth management; jrj.com.cn to provide access for wealth management solutions and mutual fund distribution; and jrj.com, a financial information website. In addition, it provides securities and futures contracts brokerage and related services to its customers, who invest in stocks listed on Hong Kong Stock Exchanges; subscription to financial data and information services; and asset management and insurance brokerage services, as well as online P2P lending services. China Finance Online Co. Limited has a strategic partnership agreement with Citic Securities; China Investment Securities; YonYou Network to provide corporate cash management solutions; and Orient Securities to provide a cloud-based investor education platform. The company was incorporated in 1998 and is based in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100052",
        "website": "http://www.chinafinanceonline.com",
        "market_cap": "Small Cap"
    },
    "JRJC": {
        "short_name": "China Finance Online Co. Limite",
        "long_name": "China Finance Online Co. Limited",
        "summary": "China Finance Online Co. Limited; together with its subsidiaries, provides web-based financial services in the People's Republic of China (PRC) and Hong Kong. The company operates through three segments: Commodities Brokerage Services; Online Financial Information and Advisory Service, and Other Related Services; and Hong Kong Brokerage Services. It provides online access to securities trading services, wealth management products, and securities investment advisory services to retail investors; and financial database and analytics to institutional investors, including financial, research, academic, and regulatory institutions, as well as financial software products. The company is involved in the operation of Yinglibao, an Internet-based financial platform that integrates cash management solutions and mutual fund distribution into iTougu, which facilitates communication between securities investment advisors and their clients; JRJ mobile app for financial information, securities trading, investment advisory, and wealth management; jrj.com.cn to provide access for wealth management solutions and mutual fund distribution; and jrj.com, a financial information website. In addition, it provides securities and futures contracts brokerage and related services to its customers, who invest in stocks listed on Hong Kong Stock Exchanges; subscription to financial data and information services; and asset management and insurance brokerage services, as well as online P2P lending services. China Finance Online Co. Limited has a strategic partnership agreement with Citic Securities; China Investment Securities; YonYou Network to provide corporate cash management solutions; and Orient Securities to provide a cloud-based investor education platform. The company was incorporated in 1998 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100052",
        "website": "http://www.chinafinanceonline.com",
        "market_cap": "Small Cap"
    },
    "MFH": {
        "short_name": "Mercurity Fintech Holding Inc.",
        "long_name": "Mercurity Fintech Holding Inc.",
        "summary": "Mercurity Fintech Holding Inc. engages in the design, development, creation, testing, installation, configuration, integration, and customization of digital asset infrastructure solutions based on blockchain technologies in the British Virgin Islands and the Asia pacific region. The company provides digital asset trading infrastructure solutions based on internet and blockchain technologies for traders, communities, and liquidity providers; an asset digitalization platform, which provides blockchain-based digitalization solutions for traditional assets that include fiat currencies, bonds, and precious metals. It also offers a decentralized finance platform that solves retail traders' problems; cross-border payments services through NBpay; and supplemental services for its platforms, such as customized software development, maintenance, and compliance support services. The company was formerly known as JMU Limited and changed its name to Mercurity Fintech Holding Inc. in April 2020. Mercurity Fintech Holding Inc. was incorporated in 2011 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100086",
        "website": "http://www.mercurity.com",
        "market_cap": "Small Cap"
    },
    "OS9.F": {
        "short_name": "ORIENT SECUR.CO.LTD.H YC1",
        "long_name": "Orient Securities Company Limited",
        "summary": "Orient Securities Company Limited operates as a securities company in China. It operates through Securities Sales and Trading, Investment Management, Brokerage and Securities Financing, and Investment Banking segments. The company engages in securities and futures brokerage, margin financing and securities lending, securities investment advisory, securities proprietary trading, asset management, agency sale of financial products, securities underwriting and sponsorship, and other business activities. It also provides cross-border financial, fund management, fixed income, margin trading and short selling, stock pledging, over-the-counter-market, agency sale, stock options, equity innovation, and asset securitization services, as well as research, PB, and foreign institutional investor services; and technology development. In addition, the company offers futures investment advisory, provision of corporate finance advisory services, equity and securities investment, investment management, bond and industrial investment, management consultancy, project investment, equity trading, and credit operation services. Orient Securities Company Limited was incorporated in 1997 and is based in Shanghai, China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200010",
        "website": "http://www.dfzq.com.cn",
        "market_cap": "Mid Cap"
    },
    "TIGR": {
        "short_name": "UP Fintech Holding Limited",
        "long_name": "UP Fintech Holding Limited",
        "summary": "UP Fintech Holding Limited provides online brokerage services focusing on Chinese investors. The company has developed a brokerage platform, which allows investor to trade stocks, options, warrants, and other financial instruments that can be accessed through its APP and website. It offers brokerage and value-added services, including investor education, community discussion, and IR platform; and account management services. The company also provides margin financing and securities lending services; asset management and wealth management; ESOP management; fund license application, product design, asset custody, transaction execution, and funding allocation; fund structuring and management; and IPO underwriting services. In addition, it offers market information, community engagement, investor education, and simulated trading services. UP Fintech Holding Limited was founded in 2014 and is based in Beijing, China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100020",
        "website": "http://www.itiger.com",
        "market_cap": "Mid Cap"
    },
    "WO1C.F": {
        "short_name": "MERCURITY FINT.H. ADR 360",
        "long_name": "Mercurity Fintech Holding Inc.",
        "summary": "Mercurity Fintech Holding Inc. engages in the design, development, creation, testing, installation, configuration, integration, and customization of digital asset infrastructure solutions based on blockchain technologies in the British Virgin Islands and the Asia pacific region. The company provides digital asset trading infrastructure solutions based on internet and blockchain technologies for traders, communities, and liquidity providers; an asset digitalization platform, which provides blockchain-based digitalization solutions for traditional assets that include fiat currencies, bonds, and precious metals. It also offers a decentralized finance platform that solves retail traders' problems; cross-border payments services through NBpay; and supplemental services for its platforms, such as customized software development, maintenance, and compliance support services. The company was formerly known as JMU Limited and changed its name to Mercurity Fintech Holding Inc. in April 2020. Mercurity Fintech Holding Inc. was incorporated in 2011 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100086",
        "website": "http://www.mercurity.com",
        "market_cap": "Small Cap"
    }
}