{
    "000833.SZ": {
        "short_name": "GUANGXI YUEGUI GUA",
        "long_name": "Guangxi Yuegui Guangye Holdings Co., Ltd.",
        "summary": "Guangxi Yuegui Guangye Holdings Co., Ltd. manufactures and sells sugar and paper products in China and internationally. The company offers white sugar, mechanism and cultural paper, bagasse bleaching pulp, compound fertilizer, light calcium carbonate, edible alcohol, and caustic soda. It provides its products under the Osmanthus and Pure Point brands. The company was formerly known as Guangxi Guitang (Group) Co., Ltd. and changed its name to Guangxi Yuegui Guangye Holdings Co., Ltd. in July 2018. The company was founded in 1956 and is based in Guigang, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guigang",
        "zipcode": "537102",
        "website": "https://www.yuegui.cn/",
        "market_cap": 3241749504
    },
    "000911.SZ": {
        "short_name": "NANNING SUGAR INDU",
        "long_name": "Nanning Sugar Industry Co., Ltd.",
        "summary": "Nanning Sugar Industry Co., Ltd. produces and sells sugar and paper products in China and internationally. It offers white granulated sugar under the Mingyang, Yunou, Gufu, Damingshan, and Huantian brands; brown sugar under the Mingyang and Gufu brands; sucrose; disposable paper mold products based on bagasse pulp, such as paper lunch boxes, plates, bowls, and cups. The company was founded in 1996 and is based in Nanning, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanning",
        "zipcode": "530021",
        "website": "http://www.nnsugar.com",
        "market_cap": 3078769408
    },
    "1927.HK": {
        "short_name": "JIUJIUWANG",
        "long_name": "Jiujiuwang Food International Limited",
        "summary": "Jiujiuwang Food International Limited, an investment holding company, manufactures and sells confectionary products. It offers aerated candies, gum-based candies, hard candies, tablet candies, and chocolate-made products. The company sells its products under Coolsa, Lalabo, and Jiujiuwang brands to distributors and end-consumers through e-commerce channels; and brands owned or licensed by OEM customers. It operates in the People's Republic of China, rest if Asia, Europe, and internationally. The company was founded in 1999 and is headquartered in Jinjiang, China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Jinjiang",
        "zipcode": null,
        "website": "http://www.jiujiuwang.com",
        "market_cap": 344520000
    },
    "600191.SS": {
        "short_name": "BAOTOU HUAZI INDUSTRIAL",
        "long_name": "Baotou Huazi Industry Co., Ltd",
        "summary": "Baotou Huazi Industry Co., Ltd produces and sells sugar in China. It offers sugar products under the Prairie and Grassland brands, as well as candy products under the Prairie brand. The company is headquartered in Baotou, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Baotou",
        "zipcode": "014045",
        "website": "http://www.huazi.com",
        "market_cap": 1231727232
    }
}