{
    "1543.HK": {
        "short_name": "JOIN-SHARE",
        "long_name": "Guangdong Join-Share Financing Guarantee Investment Co., Ltd.",
        "summary": "Guangdong Join-Share Financing Guarantee Investment Co., Ltd., together with its subsidiaries, provides credit-based financing solutions to small and medium-sized enterprises (SMEs) for their financing and business needs in the People's Republic of China. It operates through two segments, Guarantees and SME Lending. The Guarantees segment offers financing guarantees, such as indirect and direct financing guarantees; non-financing guarantees, including attachment bonds, construction contract bonds, and other contract bonds; performance guarantees; and litigation guarantees. It also provides debt financing, internal control, and risk management related consulting services to the guarantee customers. This segment also offers guarantees on behalf of SMEs and individual business proprietors. The SME Lending segment provides loans and related financing consulting services to SME and micro enterprises or the owners of SME enterprises; and micro-lending to SMEs, individual business proprietors, and individuals. The company also offers investment and consulting services; microcredit, supply chain, and factoring services; and digital technology services. Guangdong Join-Share Financing Guarantee Investment Co., Ltd. was incorporated in 2003 and is headquartered in Foshan, China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Foshan"
    },
    "1601.HK": {
        "short_name": "ZGC TEC LEASING",
        "long_name": "Zhongguancun Science-Tech Leasing Co., Ltd.",
        "summary": "Zhongguancun Science-Tech Leasing Co., Ltd. provides finance leasing and related advisory services to technology and new economy companies in the People's Republic of China. The company was founded in 2012 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "1606.HK": {
        "short_name": "CDB LEASING",
        "long_name": "China Development Bank Financial Leasing Co., Ltd.",
        "summary": "China Development Bank Financial Leasing Co., Ltd., together with its subsidiaries, engages in the leasing business in the People's Republic of China. It operates through Aircraft Leasing; Infrastructure Leasing; Ship, Vehicle and Construction Machinery Leasing; and Other Leasing Business segments. The Aircraft Leasing segment engages in the acquisition, leasing, management, and sale of commercial aircraft. The Infrastructure Leasing segment is involved in the leasing of transportation, urban, and energy infrastructure. The Ship, Vehicle and Construction Machinery Leasing segment engages in the leasing of vessels, commercial vehicles, and construction machinery. The Other Leasing Business segment is involved in the leasing of commercial properties, such as plants, offices, hotels, and shops; and manufacturing equipment in various sectors, such as chemicals, papermaking, textile, coal and steel, strategic emerging industries, environmental protection industry, wind power, nuclear power, photovoltaic, and other industries. The company was formerly known as CDB Leasing Co., Ltd. and changed its name to China Development Bank Financial Leasing Co., Ltd. in September 2015. The company was founded in 1984 and is headquartered in Shenzhen, the People's Republic of China. China Development Bank Financial Leasing Co., Ltd. operates as a subsidiary of China Development Bank Corporation.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "1905.HK": {
        "short_name": "HAITONG UT",
        "long_name": "Haitong Unitrust International Financial Leasing Co., Ltd.",
        "summary": "Haitong Unitrust International Financial Leasing Co., Ltd., through its subsidiaries, operates as a financial leasing company in the People's Republic of China. It offers operating leasing services, factoring receivables, entrusted loans, and other loans, as well as advisory services; commercial and passenger vehicle leasing services; and aircraft leasing services. The company also engages in financing of aircraft related business; and government outsourcing and PPP project management businesses. It serves transportation and logistics, manufacturing, infrastructure, construction, health care, and other industries. The company was formerly known as Haitong UniTrust International Leasing Co., Ltd. and changed its name to Haitong Unitrust International Financial Leasing Co., Ltd. in August 2020. Haitong Unitrust International Financial Leasing Co., Ltd. was incorporated in 2004 and is headquartered in Shanghai, the People's Republic of China. Haitong Unitrust International Financial Leasing Co., Ltd. is a subsidiary of Haitong UT Capital Group Co., Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "1915.HK": {
        "short_name": "TAIHE M-FIN",
        "long_name": "Yangzhou Guangling District Taihe Rural Micro-finance Company Limited",
        "summary": "Yangzhou Guangling District Taihe Rural Micro-finance Company Limited, a rural micro-finance company, engages in granting loans to agriculture, rural areas, and farmers in the People's Republic of China. The company is involved in financial guarantees and other financial businesses, as well as acts as a financial institution agent. It serves small and medium-sized enterprises, microenterprises, and individual proprietors. The company was founded in 2008 and is headquartered in Yangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Yangzhou"
    },
    "19YA.F": {
        "short_name": "YIREN DIG. ADR/2 DL-,0001",
        "long_name": "Yiren Digital Ltd.",
        "summary": "Yiren Digital Ltd., through its subsidiaries, operates as an online consumer finance marketplace that connects borrowers and investors in the People's Republic of China. It provides loan facilitation services; and post-origination services, such as cash processing, collection, and SMS services. The company's loan products portfolio includes unsecured consumer loans; secured consumer loan, which include secured financial leasing, auto-secured, and property-secured loans; and small business loans. It also distributes short-term cash management, mutual fund investment, insurance, and securities and stock products. In addition, the company provides online investor education services, which include a range of investment and trading topics, and various types of training programs on wealth planning, market insights, and investment strategies; consultancy information technology support; referral; and IT, system maintenance, and customer support services. Further, it is involved in the provision of services for financing lease and insurance brokerage businesses. The company offers its products through www.yxpuhui.com, and a wealth management website and mobile application. As of December 31, 2020, it had 60 fixed income products, 810 mutual fund products, and 296 insurance products. The company was formerly known as Yirendai Ltd. and changed its name to Yiren Digital Ltd. in September 2019. Yiren Digital Ltd. was founded in 2012 and is based in Beijing, the People's Republic of China. Yiren Digital Ltd. is a subsidiary of Creditease Holdings (Cayman) Limited.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "1LFA.F": {
        "short_name": "LEXINFINTECH ADR/2 CL.A",
        "long_name": "LexinFintech Holdings Ltd.",
        "summary": "LexinFintech Holdings Ltd., through its subsidiaries, operates as an online consumption and consumer finance platform for young professionals in the People's Republic of China. The company operates Fenqile.com, a consumption and consumer finance platform that offers installment purchase loans, personal installment loans, and other loan products, as well as provides online direct sales with installment payment terms; and Le Card, a membership platform, which offers savings, benefits, and membership privileges to food and beverage, apparel, hospitality, and leisure sectors. It also matches user loans with diversified funding sources, including individual investors on its Juzi Licai online investment platform, third-party commercial banks, consumer finance companies, institutional funding partners, investors of its asset-backed securities, and other licensed financial institutions. In addition, the company offers technical support and consulting services; Software development services; and financial technology services. The company was formerly known as Staging Finance Holding Ltd. and changed its name to LexinFintech Holdings Ltd. in March 2017. LexinFintech Holdings Ltd. was incorporated in 2013 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "1QU.F": {
        "short_name": "QUDIAN INC. ADR/1",
        "long_name": "Qudian Inc.",
        "summary": "Qudian Inc. provides online small consumer credit products in the People's Republic of China. It uses big data-enabled technologies, including artificial intelligence and machine learning to transform the consumer finance experience. The company offers small credit products, such as cash credit products; and merchandise credit products to finance borrowers' direct purchase of merchandise offered on its marketplace on installment basis. In addition, it operates a platform for loan recommendations and referrals services to third-party financial service providers. Qudian Inc. was founded in 2014 and is headquartered in Xiamen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Xiamen"
    },
    "1YX.F": {
        "short_name": "YIXIN GROUP LTD  DL-,0001",
        "long_name": "Yixin Group Limited",
        "summary": "Yixin Group Limited, an investment holding company, operates as an online automobile finance transaction platform in the People's Republic of China. The company operates in two segments, Transaction Platform Business and Self-Operated Financing Business. The Transaction Platform Business segment offers auto loans to consumers by its auto finance partners; advertising and subscription services for automakers, auto dealers, auto finance partners, and insurance companies; and used automobile transaction facilitation services. The Self-Operated Financing Business segment provides consumers with auto finance solutions through financing leases. It also engages in the information technology and technology development businesses; and provision of commercial factoring services. The company was formerly known as Yixin Capital Limited. Yixin Group Limited was founded in 2013 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "2666.HK": {
        "short_name": "UNI MEDICAL",
        "long_name": "Genertec Universal Medical Group Company Limited",
        "summary": "Genertec Universal Medical Group Company Limited provides financing and advisory services in the People's Republic of China. The company operates in two segments, Finance and Advisory and Hospital Group. The Finance and Advisory segment provides direct finance leasing; sale and leaseback; factoring; operating leases; and advisory services. The Hospital Group segment engages in the provision of medical services; management of hospital and healthcare; and import and export trading, and trading of medical-related goods. It is also involved in the provision of medical technology; hospital digitalization and construction; property management; and medical consulting services. In addition, the company sells medical-related goods. It serves hospitals, other healthcare institutions, and educational and other public institutions. The company was formerly known as Universal Medical Financial & Technical Advisory Services Company Limited and changed its name to Genertec Universal Medical Group Company Limited in July 2018. Genertec Universal Medical Group Company Limited was founded in 1984 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "2858.HK": {
        "short_name": "YIXIN",
        "long_name": "Yixin Group Limited",
        "summary": "Yixin Group Limited, an investment holding company, operates as an online automobile finance transaction platform in the People's Republic of China. The company operates in two segments, Transaction Platform Business and Self-Operated Financing Business. The Transaction Platform Business segment offers auto loans to consumers by its auto finance partners; advertising and subscription services for automakers, auto dealers, auto finance partners, and insurance companies; and used automobile transaction facilitation services. The Self-Operated Financing Business segment provides consumers with auto finance solutions through financing leases. It also engages in the information technology and technology development businesses; and provision of commercial factoring services. The company was formerly known as Yixin Capital Limited. Yixin Group Limited was founded in 2013 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "3903.HK": {
        "short_name": "HANHUA FIN",
        "long_name": "Hanhua Financial Holding Co., Ltd.",
        "summary": "Hanhua Financial Holding Co., Ltd., together with its subsidiaries, provides integrated financial services in the People's Republic of China. It operates through Partnership Finance Business, SME Lending, Capital Investment and Management, and Other segments. The company provides credit guarantee and capital business, accounts receivables for factoring business, bill discount, finance lease, entrusted loans, financial assets management, capital investment, micro and small finance, platform finance, and other services to individual customers, microenterprises, and small and medium sized enterprises. It also offers investment and management consulting, technical consulting and services, financial factoring, and Internet financing services, as well as risk management and asset quality services. In addition, the company is involved in the receivables for factoring business; and offers standard finance products, including Jiaye loan and Lexiang Jin. Further, it provides non-financing guarantee products, such as guarantee of capital preservation fund, project performance guarantee, and litigation guarantee. Hanhua Financial Holding Co., Ltd. was founded in 2004 and is headquartered in Chongqing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Chongqing"
    },
    "3963.HK": {
        "short_name": "RONGZHONG FIN",
        "long_name": "China Rongzhong Financial Holdings Company Limited",
        "summary": "China Rongzhong Financial Holdings Company Limited, an investment holding company, provides financial leasing services in the People's Republic of China. The company focuses on financing the needs of SMEs in Hubei province. It provides financial leasing services in the categories of sales and leaseback, and direct financial leasing. The company also offers value-added services, such as advisory and consultancy services to its customers. It primarily serves laser processing, plastics, industrial processing, textile and garments, hotel and leisure, and other industries. The company was founded in 2008 and is headquartered in Wuhan, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Wuhan"
    },
    "5HF.F": {
        "short_name": "HANHUA FNCL HLDG CO.H YC1",
        "long_name": "Hanhua Financial Holding Co., Ltd.",
        "summary": "Hanhua Financial Holding Co., Ltd., together with its subsidiaries, provides integrated financial services in the People's Republic of China. It operates through Partnership Finance Business, SME Lending, Capital Investment and Management, and Other segments. The company provides credit guarantee and capital business, accounts receivables for factoring business, bill discount, finance lease, entrusted loans, financial assets management, capital investment, micro and small finance, platform finance, and other services to individual customers, microenterprises, and small and medium sized enterprises. It also offers investment and management consulting, technical consulting and services, financial factoring, and Internet financing services, as well as risk management and asset quality services. In addition, the company is involved in the receivables for factoring business; and offers standard finance products, including Jiaye loan and Lexiang Jin. Further, it provides non-financing guarantee products, such as guarantee of capital preservation fund, project performance guarantee, and litigation guarantee. Hanhua Financial Holding Co., Ltd. was founded in 2004 and is headquartered in Chongqing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Chongqing"
    },
    "5UM.F": {
        "short_name": "GENERTEC UNIVER.MED.GR.CO",
        "long_name": "Genertec Universal Medical Group Company Limited",
        "summary": "Genertec Universal Medical Group Company Limited provides financing and advisory services in the People's Republic of China. The company operates in two segments, Finance and Advisory and Hospital Group. The Finance and Advisory segment provides direct finance leasing; sale and leaseback; factoring; operating leases; and advisory services. The Hospital Group segment engages in the provision of medical services; management of hospital and healthcare; and import and export trading, and trading of medical-related goods. It is also involved in the provision of medical technology; hospital digitalization and construction; property management; and medical consulting services. In addition, the company sells medical-related goods. It serves hospitals, other healthcare institutions, and educational and other public institutions. The company was formerly known as Universal Medical Financial & Technical Advisory Services Company Limited and changed its name to Genertec Universal Medical Group Company Limited in July 2018. Genertec Universal Medical Group Company Limited was founded in 1984 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "6069.HK": {
        "short_name": "SHENGYE CAPITAL",
        "long_name": "Sheng Ye Capital Limited",
        "summary": "Sheng Ye Capital Limited, an investment holding company, provides factoring and guarantee services primarily for energy, infrastructure, and medical sectors in the People's Republic of China. It also offers accounts receivable financing and supply chain finance management services, as well as consulting, information technology, and non-financing guarantee service. The company was founded in 2013 and is headquartered in Shenzhen, the People's Republic of China. Sheng Ye Capital Limited is a subsidiary of Wisdom Cosmos Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "6866.HK": {
        "short_name": "ZUOLI M-FIN",
        "long_name": "Zuoli Kechuang Micro-finance Company Limited",
        "summary": "Zuoli Kechuang Micro-finance Company Limited operates as a microfinance company in the People's Republic of China. The company offers unsecured, guaranteed, collateralized, and pledged loans; enterprise loans, including agriculture loans and technology enterprises credit loans, as well as loans for other small and medium-sized enterprises and microenterprises; individual business, start-up, and other loans; and Internet micro-loans. The company was formerly known as Deqing Zuoli Kechuang Micro-finance Company Limited and changed its name to Zuoli Kechuang Micro-Finance Company Limited in April 2014. Zuoli Kechuang Micro-finance Company Limited was founded in 2011 and is headquartered in Huzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Huzhou"
    },
    "6878.HK": {
        "short_name": "DIFFER GROUP",
        "long_name": "Differ Group Holding Company Limited",
        "summary": "Differ Group Holding Company Limited, an investment holding company, trades in commodities in the People's Republic of China. The company provides financial related services, including finance lease services, express loan services, consultancy services, guarantee services, and security brokerage services. It is also involved in assets management business comprising property development and investment; distressed assets, equities investment, and fund management; and commodity trading business, as well as hotel and tourism services. The company was founded in 2008 and is headquartered in Xiamen, China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Xiamen"
    },
    "8223.HK": {
        "short_name": "ZYY",
        "long_name": "Ziyuanyuan Holdings Group Limited",
        "summary": "Ziyuanyuan Holdings Group Limited, an investment holding company, provides equipment-based finance leasing services in the People's Republic of China. It operates through two segments, Finance Leasing and Postpartum Care Service. The company offers sale-leaseback and direct finance leasing services to micro, small, and medium-sized enterprises in the medical equipment, printing, logistics, and transportation industries. It also provides maternal and child postpartum care industry services; technological services; and money lending services, as well as trades in equipment. The company was founded in 2014 and is based in Shenzhen, the People's Republic of China. Ziyuanyuan Holdings Group Limited is a subsidiary of Hero Global Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "8525.HK": {
        "short_name": "BAIYING HOLDING",
        "long_name": "Baiying Holdings Group Limited",
        "summary": "Baiying Holdings Group Limited, a finance leasing company, provides equipment-based financing solutions to small and medium-sized enterprises, individual entrepreneurs, and large enterprises in the People's Republic of China. The company primarily offers finance leasing services, including direct finance leasing and sale-leaseback services. It also provides commercial factoring; and advisory services in various areas, including project coordination, contract drafting and negotiation, project management, project financing, and compliance, as well as manufactures and sells condiment products. The company was formerly known as Byleasing Holdings Limited and changed its name to Baiying Holdings Group Limited in June 2020. Baiying Holdings Group Limited was founded in 2010 and is headquartered in Xiamen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Xiamen"
    },
    "8621.HK": {
        "short_name": "METROPOLIS CAP",
        "long_name": "Metropolis Capital Holdings Limited",
        "summary": "Metropolis Capital Holdings Limited, an investment holding company, provides finance lease, finance leasing advisory, and factoring services in the People's Republic of China. It offers vehicle finance leasing, and machinery and equipment finance leasing services to small and medium-sized enterprises, as well as individuals. The company was founded in 2009 and is headquartered in Shanghai, the People's Republic of China. Metropolis Capital Holdings Limited is a subsidiary of View Art Investment Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "AIHS": {
        "short_name": "Senmiao Technology Limited",
        "long_name": "Senmiao Technology Limited",
        "summary": "Senmiao Technology Limited engages in the automobile transaction and related services business in the People's Republic of China. Its services include the facilitation of automobile transaction and financing, connecting ride-hailing drivers to financial institutions to buy, or get financing on the purchase of, cars to be used to provide ride-hailing services. The company is also involved in the sale of automobiles; and provision of auto finance services. Senmiao Technology has strategic cooperation with Gaode Map for utilization in ride sharing initiatives. Senmiao Technology Limited was incorporated in 2017 and is based in Chengdu, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Chengdu"
    },
    "DXF": {
        "short_name": "Dunxin Financial Holdings Limit",
        "long_name": "Dunxin Financial Holdings Limited",
        "summary": "Dunxin Financial Holdings Limited engages in the microfinance lending business in Hubei, China. It provides consumer, commercial, collateral-backed, and enterprise loans that are secured by assets as collateral or guaranteed by a third party to individuals; micro, small, and medium sized enterprises; and sole proprietors. The company was formerly known as China Xiniya Fashion Limited and changed its name to Dunxin Financial Holdings Limited in March 2018. Dunxin Financial Holdings Limited was incorporated in 2010 and is headquartered in Wuhan, China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "ASE",
        "market": "us_market",
        "country": "China",
        "city": "Wuhan"
    },
    "FINV": {
        "short_name": "FinVolution Group",
        "long_name": "FinVolution Group",
        "summary": "FinVolution Group, an investment holding company, operates an online consumer finance marketplace in the People's Republic of China. It operates a fintech platform that connects underserved individual borrowers with financial institutions. The company's platform provides standard and other loan products. As of December 31, 2020, it had approximately 116.1 million cumulative registered users. The company was formerly known as PPDAI Group Inc. and changed its name to FinVolution Group in November 2019. FinVolution Group was founded in 2007 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    },
    "HA6.F": {
        "short_name": "HAIT.UT.INT.FIN.L. H YC 1",
        "long_name": "Haitong Unitrust International Financial Leasing Co., Ltd.",
        "summary": "Haitong Unitrust International Financial Leasing Co., Ltd., through its subsidiaries, operates as a financial leasing company in the People's Republic of China. It offers operating leasing services, factoring receivables, entrusted loans, and other loans, as well as advisory services; commercial and passenger vehicle leasing services; and aircraft leasing services. The company also engages in financing of aircraft related business; and government outsourcing and PPP project management businesses. It serves transportation and logistics, manufacturing, infrastructure, construction, health care, and other industries. The company was formerly known as Haitong UniTrust International Leasing Co., Ltd. and changed its name to Haitong Unitrust International Financial Leasing Co., Ltd. in August 2020. Haitong Unitrust International Financial Leasing Co., Ltd. was incorporated in 2004 and is headquartered in Shanghai, the People's Republic of China. Haitong Unitrust International Financial Leasing Co., Ltd. is a subsidiary of Haitong UT Capital Group Co., Limited.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "HUNTF": {
        "short_name": "HUNTER MARITIME ACQUISITION COR",
        "long_name": "Hunter Maritime Acquisition Corp.",
        "summary": "Hunter Maritime Acquisition Corp., a fintech company, operates an online consumer and business finance marketplace in China. Its market place facilitates the origination of debt financing by directly connecting individual and commercial borrowers with lenders. The company is based in Beijing, China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "JT": {
        "short_name": "Jianpu Technology Inc.",
        "long_name": "Jianpu Technology Inc.",
        "summary": "Jianpu Technology Inc. operates a platform that provides online discovery and recommendation services for financial products in the People's Republic of China. Its platform allows users to access to financial products, including consumer and other loans, credit cards, and wealth management products. The company recommends loans and credit cards to individual users and assists the financial service providers in targeting users with specific characteristics based on the users' financial needs and credit profile, as well as the products offerings and risk appetite of the financial service providers. Its platform provides sales and marketing, big data risk management, and integrated solutions primarily to financial service providers. The company operates its platform under the Rong360 brand name. The company was founded in 2011 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "LU": {
        "short_name": "Lufax Holding Ltd",
        "long_name": "Lufax Holding Ltd",
        "summary": "Lufax Holding Ltd operates a technology-empowered personal financial services platform in China. It offers loan products, including unsecured loans and secured loans, as well as consumer finance loans. The company also provides wealth management platforms, such as Lufax (Lu.com), Lu International (Singapore), and Lu International (Hong Kong) to the middle class and affluent investors to invest in products and portfolios; retail credit facilitation services platform that offers small business owners with lending solutions; and technology empowerment solutions for financial institutions. Lufax Holding Ltd was incorporated in 2014 and is headquartered in Shanghai, China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    },
    "LX": {
        "short_name": "LexinFintech Holdings Ltd.",
        "long_name": "LexinFintech Holdings Ltd.",
        "summary": "LexinFintech Holdings Ltd., through its subsidiaries, operates as an online consumption and consumer finance platform for young professionals in the People's Republic of China. The company operates Fenqile.com, a consumption and consumer finance platform that offers installment purchase loans, personal installment loans, and other loan products, as well as provides online direct sales with installment payment terms; and Le Card, a membership platform, which offers savings, benefits, and membership privileges to food and beverage, apparel, hospitality, and leisure sectors. It also matches user loans with diversified funding sources, including individual investors on its Juzi Licai online investment platform, third-party commercial banks, consumer finance companies, institutional funding partners, investors of its asset-backed securities, and other licensed financial institutions. In addition, the company offers technical support and consulting services; Software development services; and financial technology services. The company was formerly known as Staging Finance Holding Ltd. and changed its name to LexinFintech Holdings Ltd. in March 2017. LexinFintech Holdings Ltd. was incorporated in 2013 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "LYL": {
        "short_name": "Dragon Victory International Li",
        "long_name": "Dragon Victory International Limited",
        "summary": "Dragon Victory International Limited operates a reward-based crowdfunding platform in the People's Republic of China. The company operates through four segments: Crowdfunding Platform Service, Incubation Services, Finder's Fees Services, and Auto-Parts Procurement Services. It operates 5etou, an online crowdfunding platform at 5etou.cn that enables project searching for funding to connect with funding sources. The company also provides business incubation services related to marketing, sales and strategic planning, and guidance and general resources in ancillary services, such as human resources, legal, accounting, operations, assisting with feasibility studies, and other types of services. In addition, it offers finder's service to assist companies to obtain loans or additional equity financing, introduce them to potential business partners, find merger candidates or other strategic relationships, or assist with feasibility studies. Further, the company offers procurement services to auto-repair shops that have demands for auto-parts from auto-parts suppliers, and transacting with auto-parts shops. Dragon Victory International Limited was founded in 2015 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "PP3.F": {
        "short_name": "FINVOLUTION GRP (SP.ADR)",
        "long_name": "FinVolution Group",
        "summary": "FinVolution Group, an investment holding company, operates an online consumer finance marketplace in the People's Republic of China. It operates a fintech platform that connects underserved individual borrowers with financial institutions. The company's platform provides standard and other loan products. As of December 31, 2020, it had approximately 116.1 million cumulative registered users. The company was formerly known as PPDAI Group Inc. and changed its name to FinVolution Group in November 2019. FinVolution Group was founded in 2007 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "PT": {
        "short_name": "Pintec Technology Holdings Limi",
        "long_name": "Pintec Technology Holdings Limited",
        "summary": "Pintec Technology Holdings Limited, through with its subsidiaries, operates an online technology platform that enables financial services in the People's Republic of China. The company connects business partners and financial partners on its platform and enables them to provide financial services to end users. Its technology platform include assistance for borrowers to obtain loans from third party investors and various financial partners; a lending solution for borrowers to originate loans; a lending solution for borrowers who want to finance online purchases; and a wealth management and insurance product distribution solution for asset management and insurance companies to facilitate the sales of products. The company has a strategic business cooperation with Fullerton Credit; and cooperation with Aspire Holdings Ltd. to develop advanced fintech solutions. The company was founded in 2012 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NGM",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "QD": {
        "short_name": "Qudian Inc.",
        "long_name": "Qudian Inc.",
        "summary": "Qudian Inc. provides online small consumer credit products in the People's Republic of China. It uses big data-enabled technologies, including artificial intelligence and machine learning to transform the consumer finance experience. The company offers small credit products, such as cash credit products; and merchandise credit products to finance borrowers' direct purchase of merchandise offered on its marketplace on installment basis. In addition, it operates a platform for loan recommendations and referrals services to third-party financial service providers. Qudian Inc. was founded in 2014 and is headquartered in Xiamen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Xiamen"
    },
    "QFIN": {
        "short_name": "360 DigiTech, Inc.",
        "long_name": "360 DigiTech, Inc.",
        "summary": "360 DigiTech, Inc., through its subsidiaries, operates a digital consumer finance platform under the 360 Jietiao brand in the People's Republic of China. Its platform provides online consumer finance products to the borrowers funded by institutional funding partners. The company also provides incremental credit assessment, collection, and other services, as well as guarantee for defaulted loans. The company was formerly known as 360 Finance, Inc. and changed its name to 360 DigiTech, Inc. in September 2020. 360 DigiTech, Inc. was founded in 2016 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    },
    "RAHGF": {
        "short_name": "ROAN HOLDINGS GROUP CO LTD",
        "long_name": "Roan Holdings Group Co., Ltd.",
        "summary": "Roan Holdings Group Co., Ltd. operates as a non-bank financial corporation that provides financial services to micro, small, and medium-sized enterprises, and individuals in the People's Republic of China. It also provides health management, insurance, healthcare, and consumer financing services to the employees of large institutions. The company also serves customers in commerce and service, real estate, technology promotion and application services, construction, finance, wholesale and retail, and other industries. The company was formerly known as China Lending Corporation and changed its name to Roan Holdings Group Co., Ltd. in January 2020. Roan Holdings Group Co., Ltd. was founded in 2009 and is based in Hangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "VIEWF": {
        "short_name": "VIEWTRAN GROUP INC",
        "long_name": "Viewtran Group, Inc.",
        "summary": "Viewtran Group, Inc. provides supply chain financial services and enterprise solutions for the technology industry in China. It offers software development and technical deployment services; and hardware, software, and technical services. The company was formerly known as Cogo Group, Inc. and changed its name to Viewtran Group, Inc. in November 2013. Viewtran Group, Inc. is based in Shenzhen, China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "WEI": {
        "short_name": "Weidai Ltd.",
        "long_name": "Weidai Ltd.",
        "summary": "Weidai Ltd., through its subsidiaries, provides auto-backed financing solutions in the People's Republic of China. Its auto-backed financing platform connects borrowers primarily small and micro enterprise owners with online investors and institutional funding partners. The company was founded in 2011 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "X7F2.SG": {
        "short_name": "Dunxin Financial Holdings Ltd.R",
        "long_name": "Dunxin Financial Holdings Limited",
        "summary": "Dunxin Financial Holdings Limited engages in the microfinance lending business in Hubei, China. It provides consumer, commercial, collateral-backed, and enterprise loans that are secured by assets as collateral or guaranteed by a third party to individuals; micro, small, and medium sized enterprises; and sole proprietors. The company was formerly known as China Xiniya Fashion Limited and changed its name to Dunxin Financial Holdings Limited in March 2018. Dunxin Financial Holdings Limited was incorporated in 2010 and is headquartered in Wuhan, China.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "city": "Wuhan"
    },
    "XYF": {
        "short_name": "X Financial",
        "long_name": "X Financial",
        "summary": "X Financial provides personal finance services in the People's Republic of China. The company offers services as an online marketplace connecting borrowers and investors. Its loan product is Xiaoying credit loan, which consists of Xiaoying card loan catering to the credit card holders and Xiaoying preferred loan to small business owners. The company also offers Xiaoying housing loan, a home equity loan product for property owners; investment products through Xiaoying wealth management platform, such as loans, money market, and insurance products; and loan facilitation services to other platforms. X Financial was founded in 2014 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "YRD": {
        "short_name": "Yiren Digital Ltd.",
        "long_name": "Yiren Digital Ltd.",
        "summary": "Yiren Digital Ltd., through its subsidiaries, operates as an online consumer finance marketplace that connects borrowers and investors in the People's Republic of China. It provides loan facilitation services; and post-origination services, such as cash processing, collection, and SMS services. The company's loan products portfolio includes unsecured consumer loans; secured consumer loan, which include secured financial leasing, auto-secured, and property-secured loans; and small business loans. It also distributes short-term cash management, mutual fund investment, insurance, and securities and stock products. In addition, the company provides online investor education services, which include a range of investment and trading topics, and various types of training programs on wealth planning, market insights, and investment strategies; consultancy information technology support; referral; and IT, system maintenance, and customer support services. Further, it is involved in the provision of services for financing lease and insurance brokerage businesses. The company offers its products through www.yxpuhui.com, and a wealth management website and mobile application. As of December 31, 2020, it had 60 fixed income products, 810 mutual fund products, and 296 insurance products. The company was formerly known as Yirendai Ltd. and changed its name to Yiren Digital Ltd. in September 2019. Yiren Digital Ltd. was founded in 2012 and is based in Beijing, the People's Republic of China. Yiren Digital Ltd. is a subsidiary of Creditease Holdings (Cayman) Limited.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "YUANF": {
        "short_name": "FINCERA INC",
        "long_name": "Fincera Inc.",
        "summary": "Fincera Inc. focuses on providing online lending and e-commerce services for small and medium-sized businesses (SMBs) and individuals in China. The company operates in two segments, Internet-Based Financial and E-Commerce Services, and Property Lease and Management. The company's financial services platforms include CeraVest, a peer-to-peer lending platform that provides short-term financing primarily to SMBs; and CeraPay, a revolving credit product that processes and settles transactions between its borrowers and merchants. The company also owns and leases office space; and operates and manages Shijiazhuang Hilton hotel in the Kaiyuan Finance Center building. The company was formerly known as AutoChina International Limited and changed its name to Fincera Inc. in July 2015. Fincera Inc. was founded in 1994 and is headquartered in Shijiazhuang, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Shijiazhuang"
    }
}