{
    "000417.SZ": {
        "short_name": "HEFEI DEPARTMENT S",
        "long_name": "Hefei Department Store Group Co.,Ltd",
        "summary": "Hefei Department Store Group Co.,Ltd, together with its subsidiaries, operates department stores in China. The company operates 26 department store shopping centers, 191 supermarkets under the Jiafu name, 26 hundred electrical appliances stores, 300 chain stores, one hundred cross-border direct sales centers under the Tesco name, 3 large agricultural product wholesale markets, and 22 standardized vegetable markets. It is also involved in the small loan business, e-commerce and cross-border direct sales, airport entry port operation, and online and offline integration, as well as domestic and foreign trade combined industrial system services. The company was founded in 1959 and is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": null,
        "website": "http://www.hfbh.com.cn",
        "market_cap": 3657656064
    },
    "000419.SZ": {
        "short_name": "C/TONGCHENG HOLD C",
        "long_name": "Changsha Tongcheng Holdings Co.,Ltd",
        "summary": "Changsha Tongcheng Holdings Co., Ltd. engages in merchandising business in China. The company operates department stores, including shopping malls, electrical appliance chains, specialty stores, and supermarkets. It also provides tourism and hotel, and pawn broking services. The company operates four hotels, including commercial, leisure vacation, and conference hotels. In addition, it is involved in property management and investment activities. The company was founded in 1983 and is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": "410007",
        "website": "http://www.e-tongcheng.com",
        "market_cap": 2429815808
    },
    "000501.SZ": {
        "short_name": "WUHAN DEPARTMENT",
        "long_name": "Wuhan Department Store Group Co., Ltd.",
        "summary": "Wuhan Department Store Group Co., Ltd. engages in the development and operation of retail industry in Hubei province, China. It operates shopping malls and supermarket chains. The company was founded in 1959 and is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430022",
        "website": "http://www.wushang.com.cn",
        "market_cap": 9135637504
    },
    "000564.SZ": {
        "short_name": "CCOOP GROUP CO LTD",
        "long_name": "Ccoop Group Co., Ltd",
        "summary": "Ccoop Group Co., Ltd engages in the retail, supply and marketing, financial, and logistics business in China and internationally. The company operates 14 department stores and shopping malls primarily in Xi'an, Haikou, Tianjin, Baoji, Hanzhong, Yan'an, and Eastern Gansu. It also provides asset management and investment analysis services, as well as investment risks avoidance and asset allocation solutions for high-net-worth customers; Internet banking services; petty loans; pawn-broking services; trade, logistics, and supply chain financing services for manufacturers, agents, and stores; micro financing services to individuals and businesses; and factoring services. In addition, the company operates Cloud Warehouse, which offers supply-chain services integrating storage and dispatching for domestic FMCG manufacturers, brand owners, and dealers; and Cool shop, a supermarket and convenience store that offers daily consumer goods, as well as sells products online. Further, it is involved in the operation of logistics park; member stores, cooperative shops, and franchise stores; and a supply and marketing chain. The company was formerly known as Xi'an Minsheng Group Co., Ltd. and changed its name to Ccoop Group Co., Ltd in February 2017. Ccoop Group Co., Ltd was founded in 1959 and is based in Haikou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Haikou",
        "zipcode": null,
        "website": "http://www.gongxiaodaji.com",
        "market_cap": 16211220480
    },
    "000679.SZ": {
        "short_name": "DALIAN FRIENDSHIP",
        "long_name": "Dalian Friendship (Group) Co., Ltd.",
        "summary": "Dalian Friendship (Group) Co., Ltd. operates retail department stores in China. The company also engages in the hotel management activities; and real estate development. Dalian Friendship (Group) Co., Ltd. is based in Dalian, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116001",
        "website": "http://www.dlyy.com.cn",
        "market_cap": 1628748032
    },
    "000715.SZ": {
        "short_name": "ZHONGXING SHENYANG",
        "long_name": "Zhongxing Shenyang Commercial Building Group Co.,Ltd",
        "summary": "Zhongxing Shenyang Commercial Building Group Co.,Ltd engages in the merchandise retailing business in China. The company offers cosmetics, watches, gold and jewelry, attires, shoes and leathers, telecommunication and housing, textiles, and children goods, etc. through merchandise stores. Zhongxing Shenyang Commercial Building Group Co.,Ltd was founded in 1987 and is based in Shenyang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenyang",
        "zipcode": null,
        "website": "http://www.zxbusiness.com",
        "market_cap": 2095223808
    },
    "000785.SZ": {
        "short_name": "EASYHOME NEW RETAI",
        "long_name": "Easyhome New Retail Group Corporation Limited",
        "summary": "Beijing Easyhome Home New Retail Chain Group Co., Ltd. is based in China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": null,
        "zipcode": null,
        "website": "http://www.juran.com.cn",
        "market_cap": 41655275520
    },
    "000882.SZ": {
        "short_name": "BEIJ. HUAL. DEP.",
        "long_name": "Beijing Hualian Department Store Co., Ltd",
        "summary": "Beijing Hualian Department Store Co., Ltd engages in the operation and management of shopping malls. It also operates and manages theater, supermarkets, department stores, and international cooperation/brand franchises. It operates approximately 40 shopping malls in China. As of December 31, 2019, the company operated 15 cinemas and 115 screens. It also provides commercial factoring services, such as trade financing, accounts receivable management, and factoring consulting; leasing and property management services; and film projection services. The company was founded in 1998 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100037",
        "website": "http://www.bhgmall.com.cn",
        "market_cap": 4981977088
    },
    "002187.SZ": {
        "short_name": "GUANGZHOU GRANDBUY",
        "long_name": "Guangzhou Grandbuy Co., Ltd.",
        "summary": "Guangzhou Grandbuy Co., Ltd. primarily operates department stores in China. It also operates shopping and professional stores; and acts as a wholesale agent, as well as engages in online shopping business. The company is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.grandbuy.com.cn",
        "market_cap": 2859232256
    },
    "002251.SZ": {
        "short_name": "BETTER LIFE COMMER",
        "long_name": "Better Life Commercial Chain Share Co.,Ltd",
        "summary": "Better Life Commercial Chain Share Co.,Ltd engages in retailing business in Hunan, Guangxi, Jiangxi, Sichuan, and Chongqing. It offers products and services through supermarkets, department stores, e-commerce, and other retail formats. The company was formerly known as Better Life Commercial Chain Limited Liability Company. Better Life Commercial Chain Share Co.,Ltd was founded in 1995 and is based in Xiangtan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiangtan",
        "zipcode": "411100",
        "website": "http://www.bbg.com.cn",
        "market_cap": 6479280128
    },
    "002264.SZ": {
        "short_name": "NEW HUADU SUPERCEN",
        "long_name": "New Hua Du Supercenter Co.,Ltd.",
        "summary": "New Hua Du Supercenter Co.,Ltd. operates a chain of hypermarkets, supermarkets, and department stores. The company has a network of stores in Fuzhou, Xiamen, Zhangzhou, Quanzhou, Sanming, Longyan, Putian, Nanping, Ningde, Shantou, Nanchang, Zhangzhou, and Hangzhou cities. New Hua Du Supercenter Co.,Ltd. is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": null,
        "website": "http://www.nhd-mart.com",
        "market_cap": 3087383552
    },
    "002277.SZ": {
        "short_name": "HUNAN FRIENDSHIP&A",
        "long_name": "Hunan Friendship&Apollo Commercial Co.,Ltd.",
        "summary": "Hunan Friendship&Apollo Commercial Co.,Ltd. engages in retailing and distribution businesses in China. Its operating formats include department stores, outlets, shopping malls, specialty stores, and online shopping platforms under the Friendship, Apollo, Friendship & Apollo Spring, Friendship & Apollo Outlets, and Friendship & Apollo Appliances brand names. The company's product categories comprise apparel, gold and jewelry, daily necessity, home appliance, cosmetic, and tobacco and alcohol products. It is also involved in the micro-credit and investment guarantee businesses, as well as renting properties. The company operates seven department stores, four shopping malls, and two outlets, as well as chain stores; and F&A Overseas Purchase and F&A WeChat Store online platforms. The company was founded in 2004 and is headquartered in Changsha, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": "410001",
        "website": "http://www.your-mart.cn",
        "market_cap": 4851711488
    },
    "002419.SZ": {
        "short_name": "RAINBOW DIGITAL CO",
        "long_name": "Rainbow Digital Commercial Co., Ltd.",
        "summary": "Rainbow Digital Commercial Co., Ltd. operates a chain of department stores, shopping malls, supermarkets, and convenience stores in China. It operates 68 general merchandise stores, 81 supermarkets, and shopping centers in 8 provinces and 25 cities, as well as 156 convenience stores. The company was formerly known as Rainbow Department Store Co., Ltd. and changed its name to Rainbow Digital Commercial Co., Ltd. in 2020. Rainbow Digital Commercial Co., Ltd. was founded in 1984 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.rainbow.cn",
        "market_cap": 7945986048
    },
    "002561.SZ": {
        "short_name": "SHANGHAI XUJIAHUI",
        "long_name": "Shanghai Xujiahui Commercial Co., Ltd.",
        "summary": "Shanghai Xujiahui Commercial Co., Ltd. operates retail department stores and supermarkets in China. It also operates commercial buildings. The company is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200030",
        "website": "http://www.xjh-sc.com",
        "market_cap": 3026754816
    },
    "002697.SZ": {
        "short_name": "CHENGDU HONGQI CHA",
        "long_name": "Chengdu Hongqi Chain Co.,Ltd.",
        "summary": "Chengdu Hongqi Chain Co.,Ltd. operates a chain of convenience stores in Sichuan Province, China. It operates approximately 2,900 stores. The company also operates a multi-functional convenience service platform. Chengdu Hongqi Chain Co.,Ltd. was founded in 2000 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "611731",
        "website": "http://www.hqls.com.cn",
        "market_cap": 7888000512
    },
    "0312.HK": {
        "short_name": "SHIRBLE STORE",
        "long_name": "Shirble Department Store Holdings (China) Limited",
        "summary": "Shirble Department Store Holdings (China) Limited, an investment holding company, operates department stores in the People's Republic of China. As of December 31, 2019, the company owned and operated 17 department stores, including 12 in Shenzhen; 3 in Shanwei; 1 in Meizhou City; and 1 in Changsha. It also offers property development and property development consulting, and property management services; and consulting, decoration design, and software development services. The company was founded in 1996 and is headquartered in Shenzhen, the People's Republic of China. Shirble Department Store Holdings (China) Limited is a subsidiary of Shirble Department Store Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.shirble.net",
        "market_cap": 960574976
    },
    "0848.HK": {
        "short_name": "MAOYE INT'L",
        "long_name": "Maoye International Holdings Limited",
        "summary": "Maoye International Holdings Limited, an investment holding company, operates and manages department stores in the People's Republic of China. The company operates in three segments: Operation of Department Stores, Property Development, and Others. The Operation of Department Stores segment is involved in the concessionaire sales; direct sale of merchandise; and leasing of commercial properties for the operation of department stores by third parties. The Property Development segment principally develops and sells commercial and residential properties; and leases commercial properties other than for the operation of department stores. The Others segment principally operates hotels; and provides ancillary services. Maoye International Holdings Limited also operates supermarket chain stores; and provides property management and advertising services. As of December 31, 2019, it operated and managed 48 stores. The company was incorporated in 2007 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.maoye.cn",
        "market_cap": 1696308992
    },
    "0980.HK": {
        "short_name": "LIANHUA",
        "long_name": "Lianhua Supermarket Holdings Co., Ltd.",
        "summary": "Lianhua Supermarket Holdings Co., Ltd., together with its subsidiaries, operates supermarkets, hypermarkets, and convenience stores primarily in the eastern region of the People's Republic of China. The company operates its stores under the Century Mart, Lianhua Supermarket, Hualian Supermarket, and Lianhua Quik brands. It is also involved in the sale of merchandise to wholesalers; provision of logistic services for wholesale business; sale of products through internet; and franchise of stores. As of December 31, 2020, the company operated 3,192 stores, including 140 hypermarkets, 2,131 supermarkets, and 921 convenience stores. The company was founded in 1991 and is based in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://lianhua.todayir.com",
        "market_cap": 1108403968
    },
    "3368.HK": {
        "short_name": "PARKSON GROUP",
        "long_name": "Parkson Retail Group Limited",
        "summary": "Parkson Retail Group Limited operates and manages a network of department stores, shopping malls, city outlets, supermarkets, and food and beverage outlets. The company offers various brands of fashion and lifestyle related merchandise focusing on four categories, which include fashion and apparel, cosmetics and accessories, household and electrical, and groceries and perishables targeting the young and contemporary market. As of December 31, 2020, it operated 40 Parkson stores, 2 Parkson Newcore city malls, and 1 Lion mall in 28 cities in the People's Republic of China. It also provides consultancy and management, property management, and food and beverage management services, as well as consumer financing. In addition, the company operates as a licensor for the Franco brand. The company was founded in 1994 and is headquartered in Shanghai, the People's Republic of China. Parkson Retail Group Limited is a subsidiary of PRG Corporation Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200051",
        "website": "http://www.parksongroup.com.cn",
        "market_cap": 684977792
    },
    "5MIA.F": {
        "short_name": "MAOYE INTL REG S  HD-,10",
        "long_name": "Maoye International Holdings Limited",
        "summary": "Maoye International Holdings Limited, an investment holding company, operates and manages department stores in the People's Republic of China. The company operates in three segments: Operation of Department Stores, Property Development, and Others. The Operation of Department Stores segment is involved in the concessionaire sales; direct sale of merchandise; and leasing of commercial properties for the operation of department stores by third parties. The Property Development segment principally develops and sells commercial and residential properties; and leases commercial properties other than for the operation of department stores. The Others segment principally operates hotels; and provides ancillary services. Maoye International Holdings Limited also operates supermarket chain stores; and provides property management and advertising services. As of December 31, 2019, it operated and managed 48 stores. The company was incorporated in 2007 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.maoye.cn",
        "market_cap": 160118992
    },
    "600280.SS": {
        "short_name": "NANJING CENTRAL EMPORIUM GP STO",
        "long_name": "Nanjing Central Emporium (Group) Stocks Co., Ltd.",
        "summary": "Nanjing Central Emporium (Group) Stocks Co., Ltd. operates department stores. It operates a chain of 14 department stores, as well as an e-commerce online shopping platform. The company is also involved in the development of commercial properties. The company was founded in 1936 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210041",
        "website": "http://www.njzsgroup.com",
        "market_cap": 3984154880
    },
    "600327.SS": {
        "short_name": "WUXI COMMERCIAL MANSION GRAND O",
        "long_name": "Wuxi Commercial Mansion Grand Orient Co., Ltd.",
        "summary": "Wuxi Commercial Mansion Grand Orient Co., Ltd. primarily engages in the sale and service of automobiles in China. The company operates 46 car stores in Wuxi and surrounding cities. It also provides car repair and maintenance services, as well as supplies automotive products. In addition, the company operates department stores, supermarkets, and restaurants; sells cooked food products to approximately 20 large and medium-sized enterprises; and offers catering services. Wuxi Commercial Mansion Grand Orient Co., Ltd. is based in Wuxi, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214000",
        "website": "http://www.eastall.com",
        "market_cap": 6671241216
    },
    "600655.SS": {
        "short_name": "SHANGHAI YUYUAN TOURIST MART(GR",
        "long_name": "Shanghai Yuyuan Tourist Mart (Group) Co., Ltd.",
        "summary": "Shanghai Yuyuan Tourist Mart (Group) Co., Ltd. operates as a tourism and financial company in China. The company engages in designing, producing, processing, wholesaling, and retailing of gold, silver, platinum, and diamond jewelry products, as well as jadeware, arts, and crafts; engages in catering and restaurants business; operates department stores; sells hardware and electricity products, chemical raw materials and products, metal materials, and construction and decoration materials; and engages in the wholesale and retail of furniture. It also provides catering business management, corporate management, investment and asset management, social and economic consulting, large-scale event organization, and exhibition services; engages in real estate development and operation, own house leasing, property management, e-commerce activities, and import and export of various types of goods and technologies; re-export trade and offset trade activities; and consignment business. The company was founded in 1896 and is based in Shanghai, China. Shanghai Yuyuan Tourist Mart (Group) Co., Ltd. operates as a subsidiary of Fosun International Limited.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200010",
        "website": "http://www.yuyuantm.com.cn",
        "market_cap": 47262195712
    },
    "600682.SS": {
        "short_name": "NANJING XINJIEKOU DEPT STORE",
        "long_name": "Nanjing Xinjiekou Department Store Co., Ltd.",
        "summary": "Nanjing Xinjiekou Department Store Co., Ltd. operates department stores in China. It also builds integrated hotels, and entertainment and shopping malls; and develops real estate properties. The company was founded in 1952 and is headquartered in Nanjing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://www.njxb.com",
        "market_cap": 14174748672
    },
    "600694.SS": {
        "short_name": "DASHANG CO LTD",
        "long_name": "Dashang Co., Ltd.",
        "summary": "Dashang Co., Ltd. operates a chain of department stores, supermarkets, and electrical appliance stores in China. It is also involved in the commercial real estate business; production of wine; and hotel, film studio, and beef businesses. The company was founded in 1995 and is headquartered in Dalian, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": null,
        "website": "http://www.dsjt.com",
        "market_cap": 6235654656
    },
    "600712.SS": {
        "short_name": "NANNING DEPARTMENT STORE CO",
        "long_name": "Nanning Department Store Co., Ltd.",
        "summary": "Nanning Department Store Co., Ltd. operates department stores and supermarkets in the People's Republic of China. It is also involved in e-commerce, car sales, commercial real estate, and other businesses. The company was founded in 1956 and is based in Nanning, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanning",
        "zipcode": "530012",
        "website": "http://www.nnbh.com.cn",
        "market_cap": 2396482048
    },
    "600729.SS": {
        "short_name": "CHONGQING DEPARTMENT STORE CO",
        "long_name": "Chongqing Department Store Co.,Ltd.",
        "summary": "Chongqing Department Store Co.,Ltd. operates department stores in the People's Republic of China. It operates 310 outlets in Chongqing, Sichuan, Guizhou, Hubei, and other places. The company was founded in 1950 and is based in Chongqing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "400010",
        "website": "http://www.e-cbest.com",
        "market_cap": 13183703040
    },
    "600738.SS": {
        "short_name": "LANZHOU LISHANG GUOCHAO INDUSTR",
        "long_name": "Lanzhou Lishang Guochao Industrial Group Co.,Ltd",
        "summary": "Lanzhou Lishang Guochao Industrial Group Co.,Ltd operates department stores in China. It offers various products, such as food, cosmetics, gold jewelry, clothing, shoes and hats, luggage leather goods, cultural and sports goods, household appliances, etc. The company also operates hotels and restaurants. In addition, it constructs shopping malls, hotels, and offices. The company was formerly known as Lanzhou Minbaishareholding(Group) Co.,Ltd. Lanzhou Minbai Shareholding (Group) Co., Ltd. was founded in 1992 and is based in Lanzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lanzhou",
        "zipcode": "730030",
        "website": "http://www.lzminbai.com.cn",
        "market_cap": 6257324032
    },
    "600774.SS": {
        "short_name": "WUHAN HANSHANG GROUP CO LTD",
        "long_name": "Wuhan Hanshang Group Co.,Ltd.",
        "summary": "Wuhan Hanshang Group Co.,Ltd. engages in retail business in China. It is also involved in exhibition, real estate, and tourism businesses. The company is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430050",
        "website": "http://www.whhsg.com",
        "market_cap": 3392872448
    },
    "600778.SS": {
        "short_name": "XINJIANG YOUHAO (GROUP) CO LTD",
        "long_name": "Xinjiang Youhao(Group)Co.,Ltd",
        "summary": "Xinjiang Youhao(Group)Co.,Ltd operates as a commercial retail enterprise in China. It operates shopping centers, department stores, supermarkets, electric appliance stores, and gourmet dining chain. The company was founded in 1958 and is based in Urumqi, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Urumqi",
        "zipcode": "830000",
        "website": "http://www.xjyh.com.cn",
        "market_cap": 1255308800
    },
    "600785.SS": {
        "short_name": "YINCHUAN XINHUA COMMERCIAL GP C",
        "long_name": "Yinchuan Xinhua Commercial (Group) Co., Ltd.",
        "summary": "Yinchuan Xinhua Commercial (Group) Co., Ltd. engages in commercial retail business in China. It operates department stores, supermarket chains, electronic chains, hypermarkets, convenience stores, etc., which offer stationery, sporting goods, office supplies, cosmetics, washing products, clothing, shoes, textiles, hardware, computer materials, household appliances, alcohol, tobacco, non-staple food, furniture, jewelry, watches, and arts and crafts. The company operates 242 stores under the Qinghai Xin Bai, Gansu Xin Bai, Xin Bai Bai Huo, Xin Bai Lian Chao, Xin Bai Electric Appliances, and Xin Bai Logistics brands located in the central business district of Ningxia and other provinces. It also engages in leasing business. The company was formerly known as Yinchuan Xinhua Department Store Co., Ltd. The company is based in Yinchuan, China. Yinchuan Xinhua Commercial (Group) Co., Ltd. is a subsidiary of Wu Mei Holdings Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yinchuan",
        "zipcode": "750001",
        "website": "http://www.xhbh.com.cn",
        "market_cap": 2601525504
    },
    "600814.SS": {
        "short_name": "HANGZHOU JIEBAI GROUP",
        "long_name": "Hangzhou Jiebai Group Co., Limited",
        "summary": "Hangzhou Jiebai Group Co., Limited operates a chain of department stores in China. The company was founded in 1918 and is based in Hangzhou, China. Hangzhou Jiebai Group Co., Limited operates as a subsidiary of Hangzhou Commerce & Tourism Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310001",
        "website": "http://www.jiebai.com",
        "market_cap": 5148194304
    },
    "600821.SS": {
        "short_name": "TIANJIN QUANYE BAZAAR (GP) CO. ",
        "long_name": "Tianjin Quanyechang (Group) Co.,Ltd.",
        "summary": "Tianjin Quanyechang (Group) Co., Ltd. operates department stores and supermarkets in Tianjin, China. Its stores offer dresses, jackets, sweaters, tops, trousers, sweater suits for women and children. Tianjin Quanyechang (Group) Co., Ltd. is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300022",
        "website": "http://www.qyc.com.cn",
        "market_cap": 7500009984
    },
    "600824.SS": {
        "short_name": "SHANGHAI YIMIN COMMERCE GROUP C",
        "long_name": "Shanghai Yimin Commercial Group Co., Ltd.",
        "summary": "Shanghai Yimin Commercial Group Co., Ltd. operates department stores in China. The company also operates commercial properties; and offers quasi financial and equity investment services. Its brands include Gujin Underwear, Tianbao Longfeng, Oriental Pawn, and Xingguang Photographic. The company was formerly known as Shanghai Yimin Commercial Co., Ltd. and changed its name to Shanghai Yimin Commercial Group Co., Ltd. in November 2010. Shanghai Yimin Commercial Group Co., Ltd. is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200020",
        "website": "http://www.yimingroup.com",
        "market_cap": 4047475200
    },
    "600827.SS": {
        "short_name": "SHANGHAI BAILIAN GROUP CO LTD",
        "long_name": "Shanghai Bailian (Group) Co., Ltd.",
        "summary": "Shanghai Bailian (Group) Co., Ltd. owns and operates department stores, shopping malls, outlets, large stores, supermarkets, and convenience stores. It is also involved in the fields of e-commerce, logistics, consumer services, commercial investment, real estate, asset management, and electronic information, as well as trades in non-ferrous and ferrous metals, automotive, light chemical, electrical, timber, fuel, etc. The company was founded in 2003 and is headquartered in Shanghai, China. Shanghai Bailian (Group) Co., Ltd. is a subsidiary of Bailian (Group) Co., Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200010",
        "website": "http://www.bailiangroup.cn",
        "market_cap": 35185590272
    },
    "600828.SS": {
        "short_name": "MAOYE COMMERCIAL CO LTD",
        "long_name": "Maoye Commercial Co., Ltd.",
        "summary": "Maoye Commercial Co., Ltd. operates and manages department stores in the People's Republic of China. The company also engages in property management, as well operates hotels. It operates department stores under the names Maoye Tiandi, Maoye Department Store, Renhe Spring, People's Department Store, and Vidtory. As of December 31, 2019, the company operates 22 physical retail stores. The company was founded in 1953 and is based in Chengdu, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": null,
        "website": "http://www.cpds.cn",
        "market_cap": 6408326144
    },
    "600857.SS": {
        "short_name": "NINGBO ZHONGBAI CO LTD",
        "long_name": "Ningbo Zhongbai Co., Ltd.",
        "summary": "Ningbo Zhongbai Co., Ltd. primarily operates department stores. It also operates dry seafood market; and provides real estate development, property leasing, property management, and related ancillary services. The company was formerly known as Hit. Shouchuang Technology Co., Ltd. and changed its name to Ningbo Zhongbai Co., Ltd. in May 2015. Ningbo Zhongbai Co., Ltd. was founded in 1992 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315010",
        "website": "http://www.600857.com.cn",
        "market_cap": 2990185472
    },
    "600858.SS": {
        "short_name": "SILVER PLAZA GROUP CO LTD",
        "long_name": "Inzone Group Co., Ltd.",
        "summary": "Inzone Group Co., Ltd. operates as a retail group in China. The company offers green food, jewelry, wine, electronics, and other products through department stores, supermarkets, shopping malls, outlets, e-commerce, and other retail formats. It operates through a network of 159 retail stores in Shandong, Hebei, Henan, Jiangsu, and other places. The company is based in Jinan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": null,
        "website": "http://www.yinzuogroup.com",
        "market_cap": 3271221504
    },
    "600859.SS": {
        "short_name": "WANGFUJING GROUP CO LTD",
        "long_name": "Wangfujing Group Co., Ltd.",
        "summary": "Wangfujing Group Co., Ltd. engages in retailing business in China. The company promotes the chain and scale development of department stores. It operates approximately 30 stores in 22 cities. Wangfujing Group Co., Ltd. was founded in 1955 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100006",
        "website": "http://www.wfj.com.cn",
        "market_cap": 23823112192
    },
    "600865.SS": {
        "short_name": "BAIDA GROUP CO",
        "long_name": "Baida Group Co.,Ltd",
        "summary": "Baida Group Co.,Ltd primarily operates department stores in China. It also operates Hangzhou Hotel; and provides commercial property management services. The company was founded in 1989 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311100",
        "website": "http://www.baidagroup.com",
        "market_cap": 3085167872
    },
    "600891.SS": {
        "short_name": "HARBIN CHURIN GROUP JOINTSTOCK ",
        "long_name": "Harbin Churin Group Jointstock Co., Ltd.",
        "summary": "Harbin Churin Group Jointstock Co., Ltd. engages in the commodity retailing and house leasing businesses primarily in Harbin, Heilongjiang Province, China. The company operates department stores and food stores. It distributes commodities, such as general merchandise, cosmetics, apparels, shoes and hats, gold and silver accessories, clocks and watches, textile products, toys, cultural products, household electrical appliances, photographic equipment, glass products, cigarettes and wines, and others. It is also involved in the design, production, issuing, and agent business of advertisements. Harbin Churin Group Jointstock Co., Ltd. is based in Harbin, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": "150001",
        "website": "http://www.qlgroup.com.cn",
        "market_cap": 234682672
    },
    "601010.SS": {
        "short_name": "WENFENG GREAT WORLD CHAIN DEVEL",
        "long_name": "Wenfeng Great World Chain Development Corporation",
        "summary": "Wenfeng Great World Chain Development Corporation operates various department stores and supermarkets in China. It is also involved in the maintenance and installation of household appliances, home appliances, warehousing, and distribution services. Wenfeng Great World Chain Development Corporation is based in Nantong, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nantong",
        "zipcode": "226007",
        "website": "http://www.wfdsj.com.cn",
        "market_cap": 5876640256
    },
    "601086.SS": {
        "short_name": "GANSU GUOFANG INDUSTRY AND TRAD",
        "long_name": "Gansu Guofang Industry & Trade (Group) Co., Ltd.",
        "summary": "Gansu Guofang Industry & Trade (Group) Co., Ltd. operates department stores in China. The company is headquartered in Lanzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lanzhou",
        "zipcode": "730000",
        "website": "http://www.guofanggroup.com",
        "market_cap": 2650680064
    },
    "601366.SS": {
        "short_name": "LIQUN COMMERCIAL GROUP CO LTD",
        "long_name": "Liqun Commercial Group Co., Ltd.",
        "summary": "Liqun Commercial Group Co., Ltd. operates as a commercial retail chain company in China. It operates department stores, supermarkets, convenience stores, and electrical appliances stores. The company was formerly known as Qingdao Liqun Department Store Group Co., Ltd. and changed its name to Liqun Commercial Group Co., Ltd. in January 2018. Liqun Commercial Group Co., Ltd. was founded in 1997 and is based in Qingdao, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": null,
        "website": "http://www.liquncommercialgroup.com",
        "market_cap": 5361008640
    },
    "601933.SS": {
        "short_name": "YONGHUI SUPERSTORES CO LTD",
        "long_name": "Yonghui Superstores Co., Ltd.",
        "summary": "Yonghui Superstores Co., Ltd. operates a chain of supermarkets in China. The company was founded in 2001 and is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "3500002",
        "website": "http://www.yonghui.cn",
        "market_cap": 51387965440
    },
    "603031.SS": {
        "short_name": "ANHUI ANDELI DEPARTMENT STORE C",
        "long_name": "Anhui Andeli Department Store Co., Ltd.",
        "summary": "Anhui Andeli Department Store Co., Ltd. operates department stores, large stores, supermarket chains, shopping malls, and logistics and distribution centers primarily in China. It operates approximately 40 stores. The company was founded in 1984 and is based in Chaohu, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chaohu",
        "zipcode": null,
        "website": "http://www.sinoadl.com",
        "market_cap": 2887360000
    },
    "603101.SS": {
        "short_name": "XINJIANG WINKA TIMES DEPARTMENT",
        "long_name": "Xinjiang Winka Times Department Store Co.,Ltd.",
        "summary": "Xinjiang Winka Times Department Store Co.,Ltd. operates department stores in China. It also operates shopping centers and supermarkets. The company is based in Urumqi, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Urumqi",
        "zipcode": "830002",
        "website": "http://www.wuikatimes.com",
        "market_cap": 2446080000
    },
    "603123.SS": {
        "short_name": "BEIJING CUIWEI TOWER CO LTD",
        "long_name": "Beijing Cuiwei Tower Co., Ltd.",
        "summary": "Beijing Cuiwei Tower Co., Ltd. engages in the operation of department stores in China. It also operates contemporary malls, supermarkets, and restaurants, as well as provides entertainment and other services. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100036",
        "website": "http://www.cwjt.com",
        "market_cap": 5886691840
    },
    "603708.SS": {
        "short_name": "JIAJIAYUE GROUP CO LTD",
        "long_name": "Jiajiayue Group Co., Ltd.",
        "summary": "Jiajiayue Group Co., Ltd. engages in the operation of supermarkets businesses in People's Republic of China. Its products include maternal and child supplies, international beauty products, health supplies, and digital products; cosmetics, such as facial skin care beauty products, fragrances, beauty tools, and personal care products; baby products comprising maternal food products, diapers/wet wipes, baby supplies, and baby care products; water and drink, milk dairy, alcohol, tea, and coffee products; kitchen seasonings, easy to eat products, edible oils, and north and south dry goods; towels, underwear products, socks, home and bed beddings, kitchen utensils, water shaving razors, hair dryers, and small appliances; paper products, clothing cleaning products, kitchen cleaning products, and cleaning tools; and fruits/seafood products. The company was founded in 1981 and is based in Weihai, the People's Republic of China. Jiajiayue Group Co., Ltd. is a subsidiary of Jiajiayue Holding Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Weihai",
        "zipcode": "264200",
        "website": "http://www.jiajiayue.com",
        "market_cap": 11565703168
    },
    "605188.SS": {
        "short_name": "JIANGXI GUOGUANG COMMERCIAL CHA",
        "long_name": "Jiangxi Guoguang Commercial Chains Co., Ltd.",
        "summary": "Jiangxi Guoguang Commercial Chains Co., Ltd. operates a chain of supermarkets and department stores in China. Its stores fresh food and food as its core category. The company has approximately 50 stores. Jiangxi Guoguang Commercial Chains Co., Ltd. is based in Ji'an, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ji'an",
        "zipcode": null,
        "website": "http://www.jxggls.com",
        "market_cap": 4559335936
    },
    "900923.SS": {
        "short_name": "SHANGHAI BAILIAN GROUP CO LTD",
        "long_name": "Shanghai Bailian (Group) Co., Ltd.",
        "summary": "Shanghai Bailian (Group) Co., Ltd. owns and operates department stores, shopping malls, outlets, large stores, supermarkets, and convenience stores. It is also involved in the fields of e-commerce, logistics, consumer services, commercial investment, real estate, asset management, and electronic information, as well as trades in non-ferrous and ferrous metals, automotive, light chemical, electrical, timber, fuel, etc. The company was founded in 2003 and is headquartered in Shanghai, China. Shanghai Bailian (Group) Co., Ltd. is a subsidiary of Bailian (Group) Co., Ltd.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200010",
        "website": "http://www.bailiangroup.cn",
        "market_cap": 34229243904
    },
    "G7E.F": {
        "short_name": "GOLDEN EAGLE R.GRP HD-,10",
        "long_name": "Golden Eagle Retail Group Limited",
        "summary": "Golden Eagle Retail Group Limited, an investment holding company, develops and operates lifestyle center and stylish department store chain in the People's Republic of China. The company operates through Retail Operations; Property Development and Hotel Operations; and Other Operations segments. It also operates supermarkets and hotels. As of December 31, 2020, the company operated 31 self-owned stores with a total gross floor area of 2,511,058 square meters and a total operating area of 1,709, 571 square meters; and 16 lifestyle centers with a total gross floor area of 1,991,662 square meters in the People's Republic of China. In addition, it engages in trading activities; property holding; operation of aquariums; and trading of cosmetic products. Further, the company is involved in the automobile inspection, sale, distribution, and exhibition; and property development and investment. Additionally, it offers communication and information service, as well as invests in education services. The company was founded in 1995 and is based in Nanjing, the People's Republic of China. Golden Eagle Retail Group Limited is a subsidiary of Golden Eagle International Retail Group Limited.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://www.geretail.com",
        "market_cap": 1200254976
    },
    "GDNEF": {
        "short_name": "GOLDEN EAGLE RETAIL GROUP LIMIT",
        "long_name": "Golden Eagle Retail Group Limited",
        "summary": "Golden Eagle Retail Group Limited, an investment holding company, develops and operates lifestyle center and stylish department store chain in the People's Republic of China. The company operates through Retail Operations; Property Development and Hotel Operations; and Other Operations segments. It also operates supermarkets and hotels. As of December 31, 2020, the company operated 31 self-owned stores with a total gross floor area of 2,511,058 square meters and a total operating area of 1,709, 571 square meters; and 16 lifestyle centers with a total gross floor area of 1,991,662 square meters in the People's Republic of China. In addition, it engages in trading activities; property holding; operation of aquariums; and trading of cosmetic products. Further, the company is involved in the automobile inspection, sale, distribution, and exhibition; and property development and investment. Additionally, it offers communication and information service, as well as invests in education services. The company was founded in 1995 and is based in Nanjing, the People's Republic of China. Golden Eagle Retail Group Limited is a subsidiary of Golden Eagle International Retail Group Limited.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://www.geretail.com",
        "market_cap": 1388461184
    },
    "LHUAF": {
        "short_name": "LIANHUA SUPERMARKET HLDGS CO LT",
        "long_name": "Lianhua Supermarket Holdings Co., Ltd.",
        "summary": "Lianhua Supermarket Holdings Co., Ltd., together with its subsidiaries, operates supermarkets, hypermarkets, and convenience stores primarily in the eastern region of the People's Republic of China. The company operates its stores under the Century Mart, Lianhua Supermarket, Hualian Supermarket, and Lianhua Quik brands. It is also involved in the sale of merchandise to wholesalers; provision of logistic services for wholesale business; sale of products through internet; and franchise of stores. As of December 31, 2020, the company operated 3,192 stores, including 140 hypermarkets, 2,131 supermarkets, and 921 convenience stores. The company was founded in 1991 and is based in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://lianhua.todayir.com",
        "market_cap": 168661952
    },
    "LSJ.F": {
        "short_name": "LIANHUA SUPER.HLDGS H YC1",
        "long_name": "Lianhua Supermarket Holdings Co., Ltd.",
        "summary": "Lianhua Supermarket Holdings Co., Ltd., together with its subsidiaries, operates supermarkets, hypermarkets, and convenience stores primarily in the eastern region of the People's Republic of China. The company operates its stores under the Century Mart, Lianhua Supermarket, Hualian Supermarket, and Lianhua Quik brands. It is also involved in the sale of merchandise to wholesalers; provision of logistic services for wholesale business; sale of products through internet; and franchise of stores. As of December 31, 2020, the company operated 3,192 stores, including 140 hypermarkets, 2,131 supermarkets, and 921 convenience stores. The company was founded in 1991 and is based in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://lianhua.todayir.com",
        "market_cap": 124910008
    },
    "P5IB.F": {
        "short_name": "PARKSON RETAIL GRP HD-,02",
        "long_name": "Parkson Retail Group Limited",
        "summary": "Parkson Retail Group Limited operates and manages a network of department stores, shopping malls, city outlets, supermarkets, and food and beverage outlets. The company offers various brands of fashion and lifestyle related merchandise focusing on four categories, which include fashion and apparel, cosmetics and accessories, household and electrical, and groceries and perishables targeting the young and contemporary market. As of December 31, 2020, it operated 40 Parkson stores, 2 Parkson Newcore city malls, and 1 Lion mall in 28 cities in the People's Republic of China. It also provides consultancy and management, property management, and food and beverage management services, as well as consumer financing. In addition, the company operates as a licensor for the Franco brand. The company was founded in 1994 and is headquartered in Shanghai, the People's Republic of China. Parkson Retail Group Limited is a subsidiary of PRG Corporation Limited.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200051",
        "website": "http://www.parksongroup.com.cn",
        "market_cap": 67223272
    },
    "SB2.F": {
        "short_name": "SHIRBLE DEP.STOR.CN HD-10",
        "long_name": "Shirble Department Store Holdings (China) Limited",
        "summary": "Shirble Department Store Holdings (China) Limited, an investment holding company, operates department stores in the People's Republic of China. As of December 31, 2019, the company owned and operated 17 department stores, including 12 in Shenzhen; 3 in Shanwei; 1 in Meizhou City; and 1 in Changsha. It also offers property development and property development consulting, and property management services; and consulting, decoration design, and software development services. The company was founded in 1996 and is headquartered in Shenzhen, the People's Republic of China. Shirble Department Store Holdings (China) Limited is a subsidiary of Shirble Department Store Limited.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.shirble.net",
        "market_cap": 88793744
    }
}