{
    "000908.SZ": {
        "short_name": "HUNAN JINGFENG PHA",
        "long_name": "Hunan Jingfeng Pharmaceutical Co.,Ltd.",
        "summary": "Hunan Jingfeng Pharmaceutical Co.,Ltd. manufactures and sells chemical drugs and biological agents. The company's principal product is sodium hyaluronate injection for use in orthopedics and surgery applications. It also offers ophthalmology and API products, as well as engages in the research and development of anti-tumor, cancer, and cardiovascular drugs; and provides CMO services covering cell culture, microbial fermentation, biologics, and pre-filled platforms. The company was founded in 2003 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "002019.SZ": {
        "short_name": "YIFAN PHARMACEUTIC",
        "long_name": "Yifan Pharmaceutical Co., Ltd.",
        "summary": "Yifan Pharmaceutical Co., Ltd. produces and sells drugs and medicines in China and internationally. It provides drugs across gynecology, pediatrics, orthopedics, and dermatology therapeutic areas; therapeutic infusion solutions; and pantothenic acid and Provitamin B5 products. The company also provides Chinese traditional medicines, women's health products, and blood tumor drugs. In addition, it offers APIs, including feed additives/animal health products, skin and hair care ingredients, functional food additives, and fine chemicals; and PBAT/PBS biodegradable resins and PVB films. The company was formerly known as Yifan Xinfu Pharmaceutical Co., Ltd. and changed its name to Yifan Pharmaceutical Co., Ltd. in October 2016. Yifan Pharmaceutical Co., Ltd. was founded in 2000 and is based in Lin'an, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Lin'an"
    },
    "002198.SZ": {
        "short_name": "GUANGDONG JIAYING",
        "long_name": "Guangdong Jiaying Pharmaceutical Co., Ltd",
        "summary": "Guangdong Jiaying Pharmaceutical Co., Ltd. engages in the research, development, production, and sale of Chinese medicines in Mainland China, Taiwan, Hong Kong and Macao, Southeast Asia, Europe, the United States, and internationally. The company provides medicines primarily for the treatment of throat, cold, orthopedics, rheumatism, gynecology, heat-clearing, and gastrointestinal diseases. It offers products in various dosage forms, such as powders, tablets, capsules, granules, and pills. The company sells its products through distribution agencies and sales outlets. Guangdong Jiaying Pharmaceutical Co., Ltd. is based in Meizhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Meizhou"
    },
    "002399.SZ": {
        "short_name": "SHENZHEN HEPALINK",
        "long_name": "Shenzhen Hepalink Pharmaceutical Group Co., Ltd.",
        "summary": "Shenzhen Hepalink Pharmaceutical Group Co., Ltd. engages in the manufacture and sale of pharmaceutical products in Hong Kong, the United States, Europe, Mainland China, and other countries/regions. It operates in three business segments: Finished Dose Pharmaceutical Products Business, Heparin API Business, and CDMO Business. The company's pharmaceutical products consist of finished dose pharmaceutical products, which primarily include enoxaparin sodium injection; active pharmaceutical ingredient (API) products, including heparin sodium API and enoxaparin sodium API; and other products, including pancreatin API. It is also involved in the provision of research and development, manufacturing, quality management, and program management services; and development and manufacture of recombinant pharmaceutical products and critical non-viral vectors, and intermediates for gene therapy. The company was formerly known as Shenzhen Hepalink Pharmaceutical Co.,Ltd. and changed its name to Shenzhen Hepalink Pharmaceutical Group Co., Ltd. in February 2017. Shenzhen Hepalink Pharmaceutical Group Co., Ltd. was founded in 1998 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "002422.SZ": {
        "short_name": "SICHUAN KELUN PHAR",
        "long_name": "Sichuan Kelun Pharmaceutical Co., Ltd.",
        "summary": "Sichuan Kelun Pharmaceutical Co., Ltd. researches, develops, manufactures, distributes, and sells pharmaceutical products in China and internationally. It offers infusion and non-infusion products, and new injection package. The company was founded in 1996 and is based in Chengdu, the People's Republic of China. Sichuan Kelun Pharmaceutical Co., Ltd. is a subsidiary of Sichuan Kelun Industry Group CO., LTD.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Chengdu"
    },
    "1093.HK": {
        "short_name": "CSPC PHARMA",
        "long_name": "CSPC Pharmaceutical Group Limited",
        "summary": "CSPC Pharmaceutical Group Limited, an investment holding company, manufactures and sells pharmaceutical products in the People's Republic of China, other Asian regions, the Americas, Europe, and internationally. It operates through Finished Drugs, Vitamin C, Antibiotics, and Others segments. The company provides NBP soft capsules and injections for acute ischemic stroke; Oulaining capsules and injections to treat mild to moderate memory and mental impairment; Xuanning for hypertension; Duomeisu for lymphoma, multiple myeloma, ovarian and breast cancers, and other malignant tumors; Jinyouli to prevent leucopenia and infection induced by chemotherapy; Ailineng for nerve glioma and brain metastases, and adjuvant treatment of malignant pleural and peritoneal effusion; Nuolining for chronic myelocytic and acute lymphoblastic leukemia; and Keaili for breast cancer. It also offers generic drugs, including Ouyi for anti-inflammatory, Gubang to treat osteoporosis, and Weihong for various infections, as well as Guoweikang, a vitamin C supplement tablets; traditional Chinese medicine; and antibiotics comprising Amoxicillin and Ampicillin capsules, Ceftriaxone and Cefazolin sodium injections, and Meropenum injections. In addition, the company provides antibiotics, vitamin C, and caffeine APIs; functional food and glucose products; and researches and develops various products with focus on the therapeutic areas of oncology, autoimmunity, psychiatry and neurology, digestion and metabolism, cardio-cerebrovascular system, and anti-infection. Further, it offers storage, sourcing, and distribution services; and healthcare services, as well as sells pharmaceutical equipment. The company was formerly known as China Pharmaceutical Group Limited and changed its name to CSPC Pharmaceutical Group Limited in March 2013. CSPC Pharmaceutical Group Limited was founded in 1997 and is headquartered in Shijiazhuang, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shijiazhuang"
    },
    "1643.HK": {
        "short_name": "MODERN CHI MED",
        "long_name": "Modern Chinese Medicine Group Co., Ltd.",
        "summary": "Modern Chinese Medicine Group Co. Ltd. produces and sells Chinese medicines. The company was founded in 1986 and is based in Chengde, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Chengde"
    },
    "1666.HK": {
        "short_name": "TONG REN TANG",
        "long_name": "Tong Ren Tang Technologies Co. Ltd.",
        "summary": "Tong Ren Tang Technologies Co. Ltd. manufactures and sells Chinese medicines in Mainland China, Hong Kong, and internationally. It offers its products in the form of tablets, soft capsules, concentrated pills, honey pills, and granules. The company also cultivates, purchases, and sells Chinese medicinal raw materials; produces and sells ointment, tea drinks, foot care products, and healthcare products; sells medicinal products; and provides medical research and development, advertisement, and Chinese medical consultation and treatment services. In addition, it is involved in the technological development and sale of biological products, Chinese and Western medicines, and cosmetics; wholesale and retail sale of Chinese medicines and healthcare products; and internal and external surgery, medical examination, and hospital management activities. Further, it produces and processes biochemical products; extracts and processes plants; and produces food products. The company was founded in 1669 and is based in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "2186.HK": {
        "short_name": "LUYE PHARMA",
        "long_name": "Luye Pharma Group Ltd.",
        "summary": "Luye Pharma Group Ltd. develops, produces, markets, and sells pharmaceutical products worldwide. The company offers Lipusu for ovarian cancer and treatment for metastatic carcinoma of ovary; CMNa, a chemical sensitizer for cancer radiotherapy; Tiandida for ovarian or non-small cell lung cancer; Tiandixin, a product used as an adjuvant therapy for malignant tumors, malignant hydrothorax and ascites, and respiratory infections; and Yitaida for acute promyelocytic leukemia and liver cancer. It also provides Seroquel and Seroquel XR for the treatment of schizophrenia and manic episodes of bipolar affective disorders; Rivastigmine Transdermal Patch for the treatment of Alzheimer's disease; Fentanyl Transdermal Patch for the treatment of cancer pain; and Buprenorphine Transdermal Patch for the treatment of chronic pain. In addition, it offers Beixi, an acarbose capsule for diabetes; and Lutingnuo, a glutathione injection for toxicity and injuries caused by ionizing radiation; Beitangning, a pioglitazone hydrochloride capsule to control blood glucose; Nuosen for acute upper digestive tract hemorrhage; and Sailimai for the treatment of diarrhea. Further, it provides Xuezhikang, a lipid adjusting capsule; Maitongna for cerebral edema and swelling by trauma; Oulai, a compound sodium aescinate gel for local swelling; Oukai for the treatment of soft tissue swelling and venous edema; Fengshiye for patients who have pains in bones, joints, and limbs; Apleek Transdermal Patch for contraception; Sidinuo for osteoporosis; and glucosamine hydrochloride tablets for osteoarthritis. Additionally, it distributes, sells, and retails pharmaceutical drugs; manufactures and sells eggs; and provides business and investment consultation, as well as contract research, process development, and manufacturing services. The company also engages in the cultivation of herbs and sales of herbal medicines. The company was founded in 1994 and is headquartered in Yantai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Yantai"
    },
    "300006.SZ": {
        "short_name": "CHONGQING LUMMY PH",
        "long_name": "Chongqing Lummy Pharmaceutical Co., Ltd.",
        "summary": "Chongqing Lummy Pharmaceutical Co., Ltd. researches and develops, manufactures, and sells pharmaceutical products in China. The company provides tumor, antibacterial, antiviral, and antifungal, as well as liver disease auxiliary, endocrinology system, and Chinese patent drugs; digestive system, immune system, blood system, cardiovascular system, and nervous system drugs; acid-base balance and nutritional products; and base large infusion products, American ginseng systems, and active pharmaceutical ingredients. Chongqing Lummy Pharmaceutical Co., Ltd. was founded in 1999 and is based in Chongqing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Chongqing"
    },
    "300109.SZ": {
        "short_name": "NKY MEDICAL HOLDIN",
        "long_name": "Boai NKY Medical Holdings Ltd.",
        "summary": "Boai NKY Medical Holdings Ltd. develops, manufactures, and sells polyvinylpyrrolidone (PVP) series products worldwide. The company offers KoVidone and PolyKoVidone line of products representing Povidone, Crospovidone, and Copovidone pharmaceutical excipients; OraRez line of PVM/MA copolymer and derivatives representing functional polymers for bioadhesive/mucoadhesive applications; KoVidone-1 broad spectrum biocidal, antifungal, and antiviral agents; and pharmaceutical solvents and intermediates. It also offers polymers, vinyl and vinyl ether compounds, PolyViscol, KoVidone I, WhiVidone, and PVPP. Its products are used in pharma, industrial, oral care, cosmetics, and food and beverage. The company was formerly known as Boai NKY Pharmaceuticals Ltd. and changed its name to NKY medical holding Ltd. in March 2016. Boai NKY Medical Holdings Ltd. is based in Heping, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Heping"
    },
    "300357.SZ": {
        "short_name": "ZHEJIANG WOLWO BIO",
        "long_name": "Zhejiang Wolwo Bio-Pharmaceutical Co., Ltd.",
        "summary": "Zhejiang Wolwo Bio-Pharmaceutical Co., Ltd., a biopharmaceutical company, researches and develops, produces, and sells pharmaceutical products for the diagnosis and treatment of allergic diseases in China and internationally. The company is based in Huzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Huzhou"
    },
    "600276.SS": {
        "short_name": "JIANGSU HENGRUI MEDICAL CO LTD",
        "long_name": "Jiangsu Hengrui Medicine Co., Ltd.",
        "summary": "Jiangsu Hengrui Medicine Co., Ltd., a pharmaceutical company, researches, develops, manufactures, and commercializes medicine worldwide. The company is developing Apatinib, Pyrotinib, Mecapegfilgrastim, SHR3680, SHR3162, SHR9549, SHR2554, SHR1459, SHR-1309, SHR-A1201, Camrelizumab, Famitinib, SHR-1316, SHR-1501, SHR-1603, SHR-1701, SHR-1702, and SHR-A1403 for oncology, metabolic, pain, autoimmune, and other indications. The company was founded in 1970 and is based in Lianyungang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Lianyungang"
    },
    "600385.SS": {
        "short_name": "SHANDONG JINTAI GROUP",
        "long_name": "Shandong Jintai Group Co., Ltd.",
        "summary": "Shandong Jintai Group Co., Ltd. produces and distributes chemical reagent medicines in China. The company provides tablets, capsules, ointments, membranes, and others. It is also involved in the enterprise investment business, as well as in the provision of leasing services. The company is based in Jinan, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Jinan"
    },
    "600436.SS": {
        "short_name": "ZHANGZHOU PIENTZEHUANG PHARMACE",
        "long_name": "Zhangzhou Pientzehuang Pharmaceutical., Ltd",
        "summary": "Zhangzhou Pientzehuang Pharmaceutical., Ltd produces and sells Chinese medicines. The company's product categories include medicines and health products, healthy foods, cosmetics, daily chemicals, and medical apparatus and instruments. The company is based in Zhangzhou, China. Zhangzhou Pientzehuang Pharmaceutical., Ltd is a subsidiary of Zhangzhou Jiulongjiang Construction Co., Ltd.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Zhangzhou"
    },
    "600572.SS": {
        "short_name": "ZHEJIANG CONBA PHARMACEUTICAL C",
        "long_name": "Zhejiang CONBA Pharmaceutical Co.,Ltd.",
        "summary": "Zhejiang CONBA Pharmaceutical Co.,Ltd. engages in the research and development, production, and sale of traditional Chinese medicines and botanical products in China. It offers chemical medicines, Chinese patent medicines, eye health products, nutritional supplements, health supplies, healthy daily necessities and food products, and other personal care products. The company was formerly known as Lanxi Yunshan Pharmaceutical Factory and changed its name to Zhejiang CONBA Pharmaceutical Co.,Ltd. in October 1999. Zhejiang CONBA Pharmaceutical Co.,Ltd. was founded in 1969 and is headquartered in Hangzhou, China. Zhejiang CONBA Pharmaceutical Co.,Ltd. is a subsidiary of Zhejiang Traditional Chinese Medicine Health Industry Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "600613.SS": {
        "short_name": "SHANGHAI SHENQI PHARM INVEST MA",
        "long_name": "Shanghai Shenqi Pharmaceutical Investment Management Co.,Ltd.",
        "summary": "Shanghai Shenqi Pharmaceutical Investment Management Co.,Ltd., together with its subsidiaries, researches, develops, produces, and sells pharmaceutical products primarily in China. It specializes in offering anti-tumor, cardio-cerebral vascular, and antifungal drugs, as well as cold and cough drugs under the miraculous brand, and medications for children under the Magic Doll name. The company also provides cantharidin sodium vitamin B6 injection under the Ai Yishu name for the treatment of cancer; Chinese medicines and chemical medicines; respiratory and digestive system medications; ginseng polysaccharide and cantharidin injections; and pediatric phlegm cough particles. In addition, it offers ethnic medicines; raw material medicines; drugs for rheumatic orthopedics, kidney, diarrhea, and gynecological menstruation; drugs under the Anshen Bunao name; sodium candida sulfate injections; Jie Yin Ling lotions; compound coral ginger solutions; and coral decoctions. Further, the company provides urea miconazole ointment complex products; cephalosporins; Yinqi Xinmai dripping pills; Yindan Xintai and Danxin Taidi pills; Metronidazole B6 tablets; Yuan Ye Zhike syrups; anti-particles; compound Shangfuning cream; and pediatric pharyngeal flat particles and clear toxic syrups. Additionally, it offers Keping, Paidui Jiangzhi, Zhizhike, Jinwugutong, Jingwu, and Tianma capsules; and Zhifan Zhike, Phenol yellow, Ganfu, and pediatric aminophenol alkylamine granules, as well as medications for injury, etc. The company also provides products in various other forms, such as sprays, films, tinctures, etc. It also operates under the magic, Guizhou, God, Speed Stop, and Qiang Lulu brand names. The company is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600671.SS": {
        "short_name": "HANGZHOU TIAN-MU-SHAN PHARMACEU",
        "long_name": "Hangzhou TianMuShan Pharmaceutical Enterprise Co.,Ltd",
        "summary": "Hangzhou TianMuShan Pharmaceutical Enterprise Co.,Ltd engages in the Chinese medicine, Western medicine, biological medicine, raw material medicine, health food, Chinese herbal medicine, and pharmaceutical businesses in China. It offers pearl eyesight eye drops, river car made of capsules, Xiangdan injections, Fu Le granules, Eucommia granules, compound fresh bamboo leachate, heart worry films, Liuwei Dihuang oral liquids/pills, menthols, metal Dendrobium soft capsules, metal maple bucket particles, iron maple dust particles, pinellia lotions, Jinkui Shenqi pills, nourishing and concentrating syrups, compound wild chrysanthemum cold particles, and Lily solid gold oral solutions. The company was founded in 1958 and is based in Lin'an City, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Lin'an City"
    },
    "600713.SS": {
        "short_name": "NANJING PHARMACEUTICAL CO LTD",
        "long_name": "NanJing Pharmaceutical Company Limited",
        "summary": "NanJing Pharmaceutical Company Limited engages pharmaceutical wholesale and retail businesses in China. It also operates approximately 510 pharmacy retail stores and an e-commerce platform. The company was founded in 1951 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Nanjing"
    },
    "600771.SS": {
        "short_name": "GUANGYUYUAN CHINESE HERBAL MEDI",
        "long_name": "GuangYuYuan Chinese Herbal Medicine Co., Ltd.",
        "summary": "GuangYuYuan Chinese Herbal Medicine Co., Ltd. manufactures and sells Chinese medicinal products. The company offers traditional Chinese medicines and health wines. It offers its products in the form of pills, capsules, and wine. The company was formerly known as Topsun Science And Technology Co Ltd. and changed its name to GuangYuYuan Chinese Herbal Medicine Co., Ltd. in July 2013. GuangYuYuan Chinese Herbal Medicine Co., Ltd. was founded in 1996 and is based in Xi'an, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Xi'an"
    },
    "600867.SS": {
        "short_name": "TONGHUA DONGBAO MEDICINES CO LT",
        "long_name": "Tonghua Dongbao Pharmaceutical Co., Ltd.",
        "summary": "Tonghua Dongbao Pharmaceutical Co., Ltd. researches and develops, manufactures, and sells pharmaceutical products for the treatment of diabetes and cardiovascular-based diseases in China. The company operates through Pharmaceutical Industry and Building Materials Industry segments. It lead product portfolio includes insulin analogues, such as insulin glargine, Insulin aspart, insulin detemir, and insulin lispro; antidiabetic drug agonist products; oral hypoglycemic agents; and Zhen Nao Ning and Nao Xue Kang capsules, as well as Gan Shulin pens, blood glucose meters, and other medical devices. The company is also involved in developing Y-PEG of recombinant human interferon a 2b injection, which has been completed Phase III clinical stage to treat chronic hepatitis C (2,3 gene type) and chronic hepatitis B III; Y-PEG a recombinant human granulocyte colony-stimulating factor injection that is in Phase II clinical stage for the treatment of chemotherapy-induced neutropenia; Y-PEG injection of recombinant human growth hormone, which is in Phase II clinical stage to treat short stature and growth hormone deficiency; and Y-PEG of recombinant human interferon a 2a injection that is in Phase II clinical stage to treat chronic hepatitis B and hepatitis C. It offers building materials comprising plastic windows and sections; and other products. The company has a strategic alliance with Adocia. Tonghua Dongbao Pharmaceutical Co., Ltd. was founded in 1985 and is based in Tonghua, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Tonghua"
    },
    "900904.SS": {
        "short_name": "SHANGHAI SHENQI PHARM INVEST MA",
        "long_name": "Shanghai Shenqi Pharmaceutical Investment Management Co.,Ltd.",
        "summary": "Shanghai Shenqi Pharmaceutical Investment Management Co.,Ltd., together with its subsidiaries, researches, develops, produces, and sells pharmaceutical products primarily in China. It specializes in offering anti-tumor, cardio-cerebral vascular, and antifungal drugs, as well as cold and cough drugs under the miraculous brand, and medications for children under the Magic Doll name. The company also provides cantharidin sodium vitamin B6 injection under the Ai Yishu name for the treatment of cancer; Chinese medicines and chemical medicines; respiratory and digestive system medications; ginseng polysaccharide and cantharidin injections; and pediatric phlegm cough particles. In addition, it offers ethnic medicines; raw material medicines; drugs for rheumatic orthopedics, kidney, diarrhea, and gynecological menstruation; drugs under the Anshen Bunao name; sodium candida sulfate injections; Jie Yin Ling lotions; compound coral ginger solutions; and coral decoctions. Further, the company provides urea miconazole ointment complex products; cephalosporins; Yinqi Xinmai dripping pills; Yindan Xintai and Danxin Taidi pills; Metronidazole B6 tablets; Yuan Ye Zhike syrups; anti-particles; compound Shangfuning cream; and pediatric pharyngeal flat particles and clear toxic syrups. Additionally, it offers Keping, Paidui Jiangzhi, Zhizhike, Jinwugutong, Jingwu, and Tianma capsules; and Zhifan Zhike, Phenol yellow, Ganfu, and pediatric aminophenol alkylamine granules, as well as medications for injury, etc. The company also provides products in various other forms, such as sprays, films, tinctures, etc. It also operates under the magic, Guizhou, God, Speed Stop, and Qiang Lulu brand names. The company is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "9989.HK": {
        "short_name": "HEPALINK",
        "long_name": "Shenzhen Hepalink Pharmaceutical Group Co., Ltd.",
        "summary": "Shenzhen Hepalink Pharmaceutical Group Co., Ltd. engages in the manufacture and sale of pharmaceutical products in Hong Kong, the United States, Europe, Mainland China, and other countries/regions. It operates in three business segments: Finished Dose Pharmaceutical Products Business, Heparin API Business, and CDMO Business. The company's pharmaceutical products consist of finished dose pharmaceutical products, which primarily include enoxaparin sodium injection; active pharmaceutical ingredient (API) products, including heparin sodium API and enoxaparin sodium API; and other products, including pancreatin API. It is also involved in the provision of research and development, manufacturing, quality management, and program management services; and development and manufacture of recombinant pharmaceutical products and critical non-viral vectors, and intermediates for gene therapy. The company was formerly known as Shenzhen Hepalink Pharmaceutical Co.,Ltd. and changed its name to Shenzhen Hepalink Pharmaceutical Group Co., Ltd. in February 2017. Shenzhen Hepalink Pharmaceutical Group Co., Ltd. was founded in 1998 and is headquartered in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "CVG.F": {
        "short_name": "CSPC PHARMACEUT.GR.",
        "long_name": "CSPC Pharmaceutical Group Limited",
        "summary": "CSPC Pharmaceutical Group Limited, an investment holding company, manufactures and sells pharmaceutical products in the People's Republic of China, other Asian regions, the Americas, Europe, and internationally. It operates through Finished Drugs, Vitamin C, Antibiotics, and Others segments. The company provides NBP soft capsules and injections for acute ischemic stroke; Oulaining capsules and injections to treat mild to moderate memory and mental impairment; Xuanning for hypertension; Duomeisu for lymphoma, multiple myeloma, ovarian and breast cancers, and other malignant tumors; Jinyouli to prevent leucopenia and infection induced by chemotherapy; Ailineng for nerve glioma and brain metastases, and adjuvant treatment of malignant pleural and peritoneal effusion; Nuolining for chronic myelocytic and acute lymphoblastic leukemia; and Keaili for breast cancer. It also offers generic drugs, including Ouyi for anti-inflammatory, Gubang to treat osteoporosis, and Weihong for various infections, as well as Guoweikang, a vitamin C supplement tablets; traditional Chinese medicine; and antibiotics comprising Amoxicillin and Ampicillin capsules, Ceftriaxone and Cefazolin sodium injections, and Meropenum injections. In addition, the company provides antibiotics, vitamin C, and caffeine APIs; functional food and glucose products; and researches and develops various products with focus on the therapeutic areas of oncology, autoimmunity, psychiatry and neurology, digestion and metabolism, cardio-cerebrovascular system, and anti-infection. Further, it offers storage, sourcing, and distribution services; and healthcare services, as well as sells pharmaceutical equipment. The company was formerly known as China Pharmaceutical Group Limited and changed its name to CSPC Pharmaceutical Group Limited in March 2013. CSPC Pharmaceutical Group Limited was founded in 1997 and is headquartered in Shijiazhuang, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shijiazhuang"
    },
    "LUP.F": {
        "short_name": "LUYE PHARMA GROUP DL-,02",
        "long_name": "Luye Pharma Group Ltd.",
        "summary": "Luye Pharma Group Ltd. develops, produces, markets, and sells pharmaceutical products worldwide. The company offers Lipusu for ovarian cancer and treatment for metastatic carcinoma of ovary; CMNa, a chemical sensitizer for cancer radiotherapy; Tiandida for ovarian or non-small cell lung cancer; Tiandixin, a product used as an adjuvant therapy for malignant tumors, malignant hydrothorax and ascites, and respiratory infections; and Yitaida for acute promyelocytic leukemia and liver cancer. It also provides Seroquel and Seroquel XR for the treatment of schizophrenia and manic episodes of bipolar affective disorders; Rivastigmine Transdermal Patch for the treatment of Alzheimer's disease; Fentanyl Transdermal Patch for the treatment of cancer pain; and Buprenorphine Transdermal Patch for the treatment of chronic pain. In addition, it offers Beixi, an acarbose capsule for diabetes; and Lutingnuo, a glutathione injection for toxicity and injuries caused by ionizing radiation; Beitangning, a pioglitazone hydrochloride capsule to control blood glucose; Nuosen for acute upper digestive tract hemorrhage; and Sailimai for the treatment of diarrhea. Further, it provides Xuezhikang, a lipid adjusting capsule; Maitongna for cerebral edema and swelling by trauma; Oulai, a compound sodium aescinate gel for local swelling; Oukai for the treatment of soft tissue swelling and venous edema; Fengshiye for patients who have pains in bones, joints, and limbs; Apleek Transdermal Patch for contraception; Sidinuo for osteoporosis; and glucosamine hydrochloride tablets for osteoarthritis. Additionally, it distributes, sells, and retails pharmaceutical drugs; manufactures and sells eggs; and provides business and investment consultation, as well as contract research, process development, and manufacturing services. The company also engages in the cultivation of herbs and sales of herbal medicines. The company was founded in 1994 and is headquartered in Yantai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Yantai"
    },
    "TNG.F": {
        "short_name": "TONG REN TANG TECHS NEW H",
        "long_name": "Tong Ren Tang Technologies Co. Ltd.",
        "summary": "Tong Ren Tang Technologies Co. Ltd. manufactures and sells Chinese medicines in Mainland China, Hong Kong, and internationally. It offers its products in the form of tablets, soft capsules, concentrated pills, honey pills, and granules. The company also cultivates, purchases, and sells Chinese medicinal raw materials; produces and sells ointment, tea drinks, foot care products, and healthcare products; sells medicinal products; and provides medical research and development, advertisement, and Chinese medical consultation and treatment services. In addition, it is involved in the technological development and sale of biological products, Chinese and Western medicines, and cosmetics; wholesale and retail sale of Chinese medicines and healthcare products; and internal and external surgery, medical examination, and hospital management activities. Further, it produces and processes biochemical products; extracts and processes plants; and produces food products. The company was founded in 1669 and is based in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    }
}