{
    "000078.SZ": {
        "short_name": "SHN NEPTUNUS BIO",
        "long_name": "Shenzhen Neptunus Bioengineering Co., Ltd.",
        "summary": "Shenzhen Neptunus Bioengineering Co., Ltd. researches and develops, manufactures, and sells pharmaceutical products primarily in China. It offers pharmaceutical products in the areas of anti-tumor, cardiovascular disease, and other disease. The company was founded in 1992 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.neptunus.com",
        "market_cap": "Mid Cap"
    },
    "000153.SZ": {
        "short_name": "ANHUI FENGYUAN PHA",
        "long_name": "Anhui Fengyuan Pharmaceutical Co., Ltd.",
        "summary": "Anhui Fengyuan Pharmaceutical Co., Ltd. researches and develops, produces, and sells biological pharmacy, chemical pharmacy, and traditional Chinese medicines primarily in China. The company offers antipyretic-analgesic, cardiovascular, antibiotic, nervous system, anti-tumor, antiulcer, and hormone drugs, as well as nutraceuticals. It also provides general medicines for vitamin and mineral deficiency; medicines for resisting parasitic diseases and microorganisms; coenzymes; and antiviral and uterine contractive medicines. In addition, the company offers sedative-hypnotic drugs; drugs for curing mesenteric stress syndrome; drugs for lowering blood pressure; and drugs for curing benign prostatic hyperplasia. It also exports its products to Europe, North America, Africa, Southeast Asia, and Central Asia. The company is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": null,
        "website": "http://www.bbcayy.com",
        "market_cap": "Mid Cap"
    },
    "000403.SZ": {
        "short_name": "PACIFIC SHUANGLIN",
        "long_name": "Pacific Shuanglin Bio-pharmacy Co., LTD",
        "summary": "Pacific Shuanglin Bio-pharmacy Co., Ltd. engages in the biochemical engineering, pharmaceutical industry equipment, and medical materials businesses in China. Its lead products include human serum albumin, human immunoglobulin, intravenous human immunoglobulin (PH4), human rabies immunoglobulin, hepatitis B human immunoglobulin, tetanus human immunoglobulin, tianqi analgesic cream, musk herd cream, musk bone paste, anti-inflammatory analgesic cream, dieshangling plasters, and medical gauzes. The company is also involved in the development of porcine pulmonary surfactants, shaqifang compounds, a1-protease inhibitors, human coagulation factor VIII products, and human fibrinogens. In addition, it engages in the investment, consultation, and technology promotion of pharmaceutical and biotechnology development projects; real estate development; and electronic product information consultation, as well as in the provision of electricity. The company was formerly known as Southern Shuanglin Bio-pharmacy Co., Ltd. and changed its name to Pacific Shuanglin Bio-pharmacy Co., Ltd. in April 2021. Pacific Shuanglin Bio-pharmacy Co., Ltd. is based in Taiyuan, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": "030006",
        "website": null,
        "market_cap": "Large Cap"
    },
    "000513.SZ": {
        "short_name": "LIVZON PHARMACEUTI",
        "long_name": "Livzon Pharmaceutical Group Inc.",
        "summary": "Livzon Pharmaceutical Group Inc. engages in the research, development, production, and distribution of pharmaceutical products in the People's Republic of China. Its products include Ilaprazole enteric coated tablets for the treatment of duodenal ulcers and reflux esophagitis; Laprazole sodium for injection to treat peptic ulcer hemorrhage; Leuprorelin Acetate Microspheres for injection; Urofollitropin for injection to treat anovulation and sufferers; Perospirone Hydrochloride for the treatment of schizophrenia; Anti-viral Granules to treat upper respiratory tract infection and influenza; and Shenqi Fuzheng Injection for the treatment of weakness and tiredness, lassitude, spontaneous sweating, vertigo, and for the patients of lung cancer and stomach cancer. The company also offers active pharmaceutical ingredients (APIs) and intermediates, such as diagnostic kit for IgM/IgG antibody to coronavirus; and diagnostic reagents and equipment, including diagnostic kit for human immunodeficiency virus antibody, diagnostic kit for anti-nuclear antibody panel, and diagnostic kit for tuberculosis specific infected T cells. In addition, it provides biologic products, traditional Chinese drug medicine, biochemical drugs, microbiological preparations, antibiotics, and pharmaceutical raw materials. The company also exports its products. Livzon Pharmaceutical Group Inc. was founded in 1985 and is based in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": "519090",
        "website": "http://www.livzon.com.cn",
        "market_cap": "Large Cap"
    },
    "000538.SZ": {
        "short_name": "YUNNAN BAIYAO GRP",
        "long_name": "Yunnan Baiyao Group Co.,Ltd",
        "summary": "Yunnan Baiyao Group Co.,Ltd engages in the pharmaceutical business in China and internationally. It provides health products, drugs, medical instruments, Chinese medicine resources, and tea. The company offers its products under the Yunnan Baiyao, Yunfeng, Tong Qiaoqiao, Yunjian, Life, Jinkoujian, Langjian, Yangyuanqing, Caizhiji, Baiyao Health, Leopard Seven, Qiancaotang, Qiancao Meizi, and Tianzihong brand names. Yunnan Baiyao Group Co., Ltd. was founded in 1902 and is based in Kunming, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": "650500",
        "website": "http://www.yunnanbaiyao.com.cn",
        "market_cap": "Large Cap"
    },
    "000566.SZ": {
        "short_name": "HAINAN HAIYAO CO",
        "long_name": "Hainan Haiyao Co., Ltd.",
        "summary": "Hainan Haiyao Co., Ltd. manufactures and sells pharmaceutical products in China. The company develops approximately 132 products in various forms, such as general medicines, powder formulations, capsules, granules, tablets, injections, APIs, etc. in various anti-infection, anti-tumor, nervous system, digestive system, and sandan. It also produces vitamin C products, sterile raw materials, and pharmaceutical intermediates and chemicals, as well as REZ-1 digital cochlear products; and provides software platform, software products, and their related information services based on mobile Internet and cloud services for medical, health, and other industries. The company also exports its products to Vietnam, India, Cambodia, Singapore, Malaysia, and other Southeast Asia. Hainan Haiyao Co., Ltd. was founded in 1965 and is based in Haikou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Haikou",
        "zipcode": "570311",
        "website": "http://www.haiyao.com.cn",
        "market_cap": "Mid Cap"
    },
    "000597.SZ": {
        "short_name": "NORTHEAST PHARMACE",
        "long_name": "Northeast Pharmaceutical Group Co., Ltd.",
        "summary": "Northeast Pharmaceutical Group Co., Ltd. provides chemical synthetic and bio-fermentation APIs, and medicinal and micro-ecological preparation products in China. It offers various nutritional products, such as Vitamin C, L-Carnitine, and other products; API products comprising fosfomycin, anti-aids, and other products; and chemical products, including chemical and pharmaceutical intermediates, chiral separation reagent products, etc. The company also provides digestives, narcotic medicines, cardiovascular, cerebrovascular medicines, etc. In addition, it engages in medical distribution business. Northeast Pharmaceutical Group Co., Ltd. was founded in 1993 and is based in Shenyang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenyang",
        "zipcode": null,
        "website": "http://www.nepharm.com",
        "market_cap": "Mid Cap"
    },
    "000623.SZ": {
        "short_name": "JILIN AODONG PHARM",
        "long_name": "Jilin Aodong Pharmaceutical Group Co., Ltd.",
        "summary": "Jilin Aodong Pharmaceutical Group Co., Ltd. produces and sells pharmaceutical products in China. The company offers various drugs, such as oral liquid solutions, injections, capsules, granules, pills, tablets, Chinese herbal medicines, powders, syrups, spirits, and ointments, as well as enzymes, biochemical medicine, and plant chemical medicine. It also provides healthcare products. In addition, the company engages in highway construction and toll collection businesses. The company was founded in 1957 and is headquartered in Dunhua, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dunhua",
        "zipcode": "133700",
        "website": "http://www.jlaod.com",
        "market_cap": "Large Cap"
    },
    "000627.SZ": {
        "short_name": "HUBEI BIOCAUSE PH",
        "long_name": "Hubei Biocause Pharmaceutical Co., Ltd.",
        "summary": "Hubei Biocause Pharmaceutical Co., Ltd. primarily provides life and motor insurance products in China. The company also engages in the pharmaceutical, chemical, and new energy fuel businesses. It is involved in the contract research and production of APIs, intermediates, and formulations, including tablets, granules, capsules, etc.; and provision of chemicals comprising dimethyl ether gas and a-chloropropionyl chloride. The company also exports its products to the United States, the European Union, and internationally. The company is based in Jingmen, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jingmen",
        "zipcode": null,
        "website": "http://www.biocause.com",
        "market_cap": "Large Cap"
    },
    "000650.SZ": {
        "short_name": "RENHE PHARMACY CO",
        "long_name": "Renhe Pharmacy Co., Ltd.",
        "summary": "Renhe Pharmacy Co., Ltd. produces and sells pharmaceutical products. It offers Chinese and western medicines; chemical drugs; dietary supplements; and active pharmaceutical ingredients. It also provides health related products, such as oral solid and liquid dosages, large and small volume injections, lotions for external use, liniments, suppositories, and ointments; and eye drops, bulk medicines, hard and soft capsules, and granules tablets. The company was founded in 1996 and is based in Nanchang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330038",
        "website": "http://www.renheyaoye.com",
        "market_cap": "Large Cap"
    },
    "000661.SZ": {
        "short_name": "CHANGCHUN HIGH NEW",
        "long_name": "Changchun High & New Technology Industry (Group) Inc.",
        "summary": "Changchun High & New Technology Industry (Group) Inc., together with its subsidiaries, manufactures and sells biopharmaceuticals and proprietary Chinese medicines in China. It also engages in real estate development, property management, and real estate leasing services. The company was founded in 1993 and is based in Changchun, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": "130021",
        "website": "http://www.cchn.com.cn",
        "market_cap": "Large Cap"
    },
    "000739.SZ": {
        "short_name": "APELOA PHARMACEUTI",
        "long_name": "Apeloa Pharmaceutical Co.,Ltd",
        "summary": "Apeloa Pharmaceutical Co.,Ltd researches and develops, produces, and sells pharmaceutical products in China and internationally. It provides products in the cardio-cerebrovascular, anti-infection, anti-viral, anti-tumor, and other treatment areas. The company offers preparations, raw material intermediates, and veterinary drugs primarily under the Tianliwei, Beshin, Yosemade, Jutai, and other brands. It also provides contract research and development, and production services for pharmaceutical companies. The company is headquartered in Dongyang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongyang",
        "zipcode": "322118",
        "website": "http://www.apeloa.com",
        "market_cap": "Large Cap"
    },
    "000756.SZ": {
        "short_name": "SHANDONG XINHUA PH",
        "long_name": "Shandong Xinhua Pharmaceutical Company Limited",
        "summary": "Shandong Xinhua Pharmaceutical Company Limited, through its subsidiaries, develops, manufactures, and sells bulk pharmaceuticals, preparations, and chemical products. It operates through Chemical Bulk Drugs, Preparations, and Chemical Intermediates and Other products. It offers active pharmaceutical ingredients, pharmaceutical preparations, and chemical products, such as antipyretic analgesics; drugs for cardiovascular and cerebrovascular diseases; anti-infectives; drugs for central nervous system diseases; and other drugs under the brand of Xinhua. The company also provides prepared Chinese herbal medicine for decoction, traditional Chinese medicines, chemical raw materials, chemical preparations, antibiotics, biochemical medicines, chemical bulk drugs, anesthetics, anti-psychotic drugs, pharmaceutical precursor chemicals, protein assimilation preparations, peptide hormones, medical toxic drugs, etc. In addition, it offers raw materials and intermediates, powders for injection and tablets, and bulk pharmaceutical and intermediates; tablets, hard capsules, granules, and dry suspension; imports and exports goods and technologies; designs medical projects; develops and sells real estate; and health products research and development activities. Additionally, the company engages in the certification and import and export business; electrical equipment engineering; and installation and testing of chemical equipment and electrical equipment, as well as sales of mechanical, hardware, and electrical equipment. It also provides contract manufacturing services of APIs and pharmaceutical intermediates, as well as OTC and generic products; and internet data services, internet sales, and internet information services for pharmaceuticals and medical devices, etc. The company operates in the People's Republic of China, the Americas, Europe, and internationally. Shandong Xinhua Pharmaceutical Company Limited was founded in 1943 and is based in Zibo, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zibo",
        "zipcode": "255086",
        "website": "http://www.xhzy.com",
        "market_cap": "Mid Cap"
    },
    "000766.SZ": {
        "short_name": "TONGHUA GH PHARMAC",
        "long_name": "Tonghua Golden-Horse Pharmaceutical Industry Co,Ltd",
        "summary": "Tonghua Golden-Horse Pharmaceutical Industry Co., Ltd. engages in the research, development, manufacture, and sale of pharmaceutical products in China. Its products primarily focus on the rheumatism, digestion, cancer, and gynecology fields. The company offers traditional Chinese medicines, such as gynecological, rheumatic and bone pain, urology, detoxification, cardio-cerebral, digestive, respiratory, diabetes, and pediatric medication products, as well as anti-tumor drugs, prescription and OTC drugs, and Western medicines. The company offers its products in the form of capsules, tablets, injections, liquids, etc. Tonghua Golden-Horse Pharmaceutical Industry Co., Ltd. was founded in 1990 and is based in Tonghua, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tonghua",
        "zipcode": "134001",
        "website": "http://www.thjm.cn",
        "market_cap": "Mid Cap"
    },
    "000788.SZ": {
        "short_name": "PKU HEALTHCARE COR",
        "long_name": "PKU HealthCare Corp.,Ltd.",
        "summary": "PKU HealthCare Corp.,Ltd. researches, develops, manufactures, and exports pharmaceutical preparations in western China. The company offers various products, including anti-microbials, anti-tumor, cardiovascular, anti-allergy, nonsteroidal anti-inflammatory products, as well as blood sugar products, regulatory immune anti-tumor, digestive system, and blood volume expanders. It also provides treatment of mental disorders and other products. The company was formerly known as PUK International Hospital Group Southwest Synthetic Pharmaceutical Corp., Ltd. and changed its name to PKU HealthCare Corp., Ltd. in November 2013. PKU HealthCare Corp.,Ltd. was founded in 1965 and is based in Chongqing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "401121",
        "website": "http://www.pku-hc.com",
        "market_cap": "Mid Cap"
    },
    "000790.SZ": {
        "short_name": "CHENGDU HUASUN TEC",
        "long_name": "Chengdu Huasun Technology Group Inc., Ltd.",
        "summary": "Chengdu Huasun Technology Group Inc., Ltd. manufactures and sells medicines, bio-pharmaceutical products, and building steel structures. The company manufactures modern Chinese medicines, traditional Chinese medicines, and chemical medicines; and sells drugs. It also engages in the research and development, production, and sale of biological products and biotechnology drugs; and medicines for the treatment of cardiovascular and cerebrovascular diseases. In addition, the company designs, produces, installs, and services steel structure buildings. The company was formerly known as Chengdu Taihe Health Technology Group Inc., Ltd. and changed its name to Chengdu Huasun Technology Group Inc., Ltd. in April 2020. Chengdu Huasun Technology Group Inc., Ltd. was founded in 1998 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": null,
        "website": "http://www.thjkjt.com",
        "market_cap": "Mid Cap"
    },
    "000915.SZ": {
        "short_name": "SHANDONG WIT DYNE",
        "long_name": "Shandong Shanda Wit Science and Technology Co., Ltd.",
        "summary": "Shandong Shanda Wit Science and Technology Co., Ltd. engages in the pharmaceutical and environment protection businesses in China. Its medical products include azithromycin granules, licorice zinc granules, combined calcium carbonate, vitamin AD drops, epalat tablet, valsartan hydrochlorothiazide gel, roxithromycin, rosiglitazone tartrate tablets, and glimepiride tablets. The company's environmental products comprise deep disc filters, sulfuric acid diluents, industrial wastewater treatment solutions, chlorine dioxide generators, chlorine dioxide preparation devices, and power plant flue gas desulfurization and denitrification total contracting devices, as well as involved in the planning and construction of constructed wetland. Its environmental products also consists of optional equipment and raw materials; chlorine dioxide disinfectants, compounds, and composites; gas exhaust treatment; and solid waste treatment. The company also provides information products comprising DLP splicing display units, LCD splicing display units, image stitching processors, industrial automation control products, and communication products; and modified asphalt products, rubber asphalt non - curing waterproof materials, and asphalt anti Â\u0096 corrosion products. In addition, it is involved in the design and installation of display, communications, and industrial control system; system integration; research, development, and production of high-performance road modified and waterproof asphalt products; property rental and management activities; and provision of education services. Shandong Shanda Wit Science and Technology Co., Ltd. was founded in 1993 and is based in Jinan, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": "250061",
        "website": "http://www.sd-wit.com",
        "market_cap": "Mid Cap"
    },
    "000919.SZ": {
        "short_name": "JINLING PHARMACEUT",
        "long_name": "Jinling Pharmaceutical Company Limited",
        "summary": "Jinling Pharmaceutical Company Limited manufactures and sells pharmaceutical products in China. The company offers Mailuoning injection for the treatment of thrombo-occlusive vasculitis, arteriosclerotic occlusive disease, cerebral thrombosis and sequelae, multiple arteritis, acute arterial embolism of the limbs, diabetic gangrene, venous thrombosis, thrombophlebitis, etc.; ferrous succinate tablets for the prevention and treatment of iron deficiency anemia; and lentinan injection for treatment of malignant tumors. It also provides medical health care services. Jinling Pharmaceutical Company Limited is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210058",
        "website": "http://www.jlyy000919.com",
        "market_cap": "Mid Cap"
    },
    "000963.SZ": {
        "short_name": "HUADONG MEDICINE",
        "long_name": "Huadong Medicine Co., Ltd",
        "summary": "Huadong Medicine Co., Ltd. produces and sells various pharmaceutical products in China. The company offers Chinese patent drugs, immunosuppressive agents, endocrine drugs, digestive system drugs, antineoplastic drugs, cardiovascular drugs, and antibiotic drugs. Its products include gastrointestinal agents, APIs, and other products. The company also engages in the production and management of traditional Chinese and western raw medicines and preparations, and health care products; sale of biological products as a proxy; wholesale of TCM materials, TCM decoction pieces, chemical preparations, etc.; warehousing and storage business; and research, development, production, and sale of aesthetic medicine products. Huadong Medicine Co., Ltd. was founded in 1993 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310011",
        "website": "http://www.eastchinapharm.com",
        "market_cap": "Large Cap"
    },
    "000989.SZ": {
        "short_name": "JIUZHITANG CO.LTD",
        "long_name": "Jiuzhitang Co., Ltd.",
        "summary": "Jiuzhitang Co., Ltd. provides traditional Chinese, chemical, biological, and health medicine products in China. The company offers shuxuetong injections, Angong Niuhuang Wan, Danxi granules, and Gastrodia Uncaria for cardiovascular and cerebrovascular disease; Guizhi Fuling pills, Buxue Shengru granules, and hemostasis and analgesia products for gynecological disease; Schicon for respiratory disease; and Jiaqi Ganzian granules, Jianwei Yuyang tablets, Jienchang Ning, and Chidan yellowing products for digestive disease. It also provides non-prescription drugs for treating nourishing QI and blood, cardiovascular and cerebrovascular, urinary system, pediatric, gynecological, skeletal muscle, respiratory, dermatology, nervous system, ENT, digestive system, and tumor diseases. Jiuzhitang Co., Ltd. was founded in 1999 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100026",
        "website": "http://www.hnjzt.com",
        "market_cap": "Mid Cap"
    },
    "000999.SZ": {
        "short_name": "CHINA RESOURCES SA",
        "long_name": "China Resources Sanjiu Medical & Pharmaceutical Co., Ltd.",
        "summary": "China Resources Sanjiu Medical & Pharmaceutical Co., Ltd. researches and develops, produces, and sells pharmaceutical products in the People's Republic of China and internationally. It also provides related health services. The company offers OTC products, including cold, skin, gastrointestinal, cough relieving, orthopedics, and pediatrics drugs; prescription drug products in traditional Chinese medicine, tumors, cardiovascular and cerebrovascular, digestive system, orthopedics, and pediatrics; Chinese medicine injections; formula granules; and anti-infective drugs. It sells its products under 999 family medicine brands, Sanjiuweitai series, 999 Ganmaoling series, 999 dermatitis series, and other products. The company was formerly known as Sanjiu Pharmaceutical Co., Ltd. and changed its name to China Resources Sanjiu Medical & Pharmaceutical Co., Ltd. in February 2010. The company was founded in 1999 and is based in Shenzhen, the People's Republic of China. China Resources Sanjiu Medical & Pharmaceutical Co., Ltd. is a subsidiary of China Resources (Holdings) Co., Ltd.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518110",
        "website": "http://www.999.com.cn",
        "market_cap": "Large Cap"
    },
    "002001.SZ": {
        "short_name": "ZHEJIANG NHU CO",
        "long_name": "Zhejiang NHU Company Ltd.",
        "summary": "Zhejiang NHU Company Ltd. engages in the production and sale of nutritional products, aroma chemicals, and polymer materials in China. The company offers nutrition products, comprising feed and food additives, such as vitamin E, vitamin A, vitamin C, DL-Methionine, vitamin D3, D-Biotin, coenzyme Q10, carotenoids, etc.; and aroma chemicals, including linalool series, citral series, leaf alcohol series, methyl dihydro jasmonate, raspberry ketone, ligustral, etc. for daily chemicals, food, and medicine fields. Zhejiang NHU Company Ltd. was founded in 1999 and is based in Xinchang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xinchang",
        "zipcode": "312500",
        "website": "http://www.cnhu.com",
        "market_cap": "Large Cap"
    },
    "002004.SZ": {
        "short_name": "HUAPONT-LIFE SCIEN",
        "long_name": "Huapont Life Sciences Co., Ltd.",
        "summary": "Huapont Life Sciences Co., Ltd. engages in the pharmaceutical and agrochemical businesses in China and internationally. It is involved in the research and development, production, sale, and services of pesticide intermediates, original drugs, and preparations. The company also offers medicines for skin and other applications, as well as provides medical services. The company was formerly known as Huapont-Nutrichem Co., Ltd. and changed its name to Huapont Life Sciences Co., Ltd. in September 2015. Huapont Life Sciences Co., Ltd. was founded in 2001 and is based in Chongqing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "401121",
        "website": "http://www.huapont.com.cn",
        "market_cap": "Large Cap"
    },
    "002020.SZ": {
        "short_name": "ZHEJIANG JINGXIN P",
        "long_name": "Zhejiang Jingxin Pharmaceutical Co., Ltd.",
        "summary": "Zhejiang Jingxin Pharmaceutical Co., Ltd. researches and develops, produces, and sells pharmaceutical products in China and internationally. The company offers APIs, antihypertensive products, antibiotics, quinolones, gastrointestinal promotions, antidiabetics, antipileptics, antihistamines, H+ pump depressants, antihyper cholesterolemia products, histamine H2 receptor blokades, antihyper cholesterolemirs, antidepressants, cephalosporin products, and biopharma products. It also provides diagnostic medical displays, surgical medical displays, clinical medical displays, medical large screens, medical integrated machines, ultrasonic medical displays, and other products. The company was formerly known as Zhejiang Jingxin Pharmaceutical Factory and changed its name to Zhejiang Jingxin Pharmaceutical Co., Ltd. in 2000. Zhejiang Jingxin Pharmaceutical Co., Ltd. was founded in 1974 and is headquartered in Xinchang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xinchang",
        "zipcode": "312500",
        "website": "http://www.jingxinpharm.com",
        "market_cap": "Mid Cap"
    },
    "002099.SZ": {
        "short_name": "ZHEJIANG HISOAR PH",
        "long_name": "Zhejiang Hisoar Pharmaceutical Co., Ltd.",
        "summary": "Zhejiang Hisoar Pharmaceutical Co., Ltd., a pharmaceutical company, produces and sells fine chemicals and special raw drugs in China and internationally. It offers antibiotic, anti-virus, cardiovascular, sugar-reducing, and other materials; and medicine intermediates, and other customized and processed products, such as clindamycin, 4-AA Iso-carbapenem series, thiamphenicol, florfenicol, voglibose, eclindamycin, 4-AA iso-carbapenem, thiamphenicol, florfenicol, voglibose, etc. It also exports its products. The company was founded in 1966 and is based in Taizhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taizhou",
        "zipcode": "318000",
        "website": "http://www.hisoar.com",
        "market_cap": "Large Cap"
    },
    "002107.SZ": {
        "short_name": "SHANDONG WOHUA PHA",
        "long_name": "Shandong Wohua Pharmaceutical Co., Ltd.",
        "summary": "Shandong Wohua Pharmaceutical Co., Ltd. manufactures and sells pharmaceutical products in China. It offers Xinkeshu tablets, Naoxueshu oral solutions, Tongluo Huayu capsules, oral liquids, and Zhenju Jiangya tablets for cardiovascular and cerebrovascular; respiratory system drugs; medicines for women and children; urinary system drugs; heat purging fire drugs; digestive system drugs; anti-rheumatic drugs; and drugs for soothe the nerves. The company is based in Weifang, China. Shandong Wohua Pharmaceutical Co., Ltd. is a subsidiary of Beijing Zhongzheng Wanrong Investment(Group) Co., Ltd.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Weifang",
        "zipcode": "261205",
        "website": "http://www.wohua.cn",
        "market_cap": "Mid Cap"
    },
    "002118.SZ": {
        "short_name": "JILIN ZIXIN PHARMA",
        "long_name": "Jilin Zixin Pharmaceutical Industrial Co.,Ltd.",
        "summary": "Jilin Zixin Pharmaceutical Industrial Co.,Ltd researches, develops, produces, and sells Chinese medicines, gene sequencers, and supporting reagents in China. It provides ginseng products; prescription products; OTC drugs; and other products. Jilin Zixin Pharmaceutical Industrial Co.,Ltd was founded in 1998 and is based in Changchun, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": "130041",
        "website": "http://www.jilinzixin.com.cn",
        "market_cap": "Mid Cap"
    },
    "002219.SZ": {
        "short_name": "HENGKANG MEDICAL G",
        "long_name": "Hengkang Medical Group Co.,Ltd",
        "summary": "Hengkang Medical Group Co.,Ltd provides medical services, pharmaceuticals, health care, and daily products in China and internationally. It operates hospitals. The company also manufactures pharmaceutical products in the areas of pain, cold, cough, gynecology, cardiovascular, digestive, and urinary systems. In addition, it offers Chinese herbal medicines, infusion, and hemostasis products, as well as daily care products, including toothpaste and toothbrush. The company was formerly known as Gansu Duyiwei Biological Pharmaceutical Co., Ltd. and changed its name to Hengkang Medical Group Co.,Ltd in January 2014. Hengkang Medical Group Co.,Ltd. was founded in 2001 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610063",
        "website": "http://www.hkmg.com",
        "market_cap": "Mid Cap"
    },
    "002262.SZ": {
        "short_name": "JIANGSU NHWA PHARM",
        "long_name": "Jiangsu Nhwa Pharmaceutical Co., LTD",
        "summary": "Jiangsu Nhwa Pharmaceutical Co., LTD produces and sells central nervous system drugs in China and internationally. It offers drugs in the anesthesia, psychiatry, and neurological categories. The company also provides APIs in the areas of central nervous system, anesthetic and sedative, anti-fungal, and others. In addition, it is developing various cardiovascular products, such as Iptakalim, an anti-hypertension drug. The company has a collaborative research agreement with the Ann Romney Center for Neurologic Diseases at Brigham, and Women's Hospital and Biodextris to develop a novel immuno-stimulatory therapy for neurologic disorders. Jiangsu Nhwa Pharmaceutical Co., LTD was founded in 1978 and is based in Xuzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xuzhou",
        "zipcode": "221009",
        "website": "http://www.nhwa-group.com",
        "market_cap": "Large Cap"
    },
    "002317.SZ": {
        "short_name": "GUANGDONG ZHONGSHE",
        "long_name": "Guangdong Zhongsheng Pharmaceutical Co., Ltd.",
        "summary": "Guangdong Zhongsheng Pharmaceutical Co., Ltd. researches, develops, produces, and sells pharmaceutical products in China. The company offers Chinese and chemical medicines. It is also involved in the research and development of products in the fields of ophthalmology, cardiovascular, cerebrovascular, respiratory, digestive, diabetes, tumor, and senile degenerative diseases. The company was founded in 1979 and is based in Dongguan, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": null,
        "website": "http://www.zspcl.com",
        "market_cap": "Mid Cap"
    },
    "002332.SZ": {
        "short_name": "ZHEJIANG XIANJU PH",
        "long_name": "Zhejiang Xianju Pharmaceutical Co.,Ltd.",
        "summary": "Zhejiang Xianju Pharmaceutical Co.,Ltd. manufactures and sells steroids and hormones worldwide. It offers active pharmaceutical ingredients, such as steroid drugs, and male and female hormones; intermediates; and finished formulations in the form of tablets, capsules, granules, soft capsules, powder inhalations, creams, gels, injections, and powder-injections. The company was founded in 1972 and is based in Xianju, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xianju",
        "zipcode": "317300",
        "website": "http://en.xjpharma.com/",
        "market_cap": "Large Cap"
    },
    "002349.SZ": {
        "short_name": "NANTONG JINGHUA PH",
        "long_name": "Nantong Jinghua Pharmaceutical Co., Ltd.",
        "summary": "Nantong Jinghua Pharmaceutical Co., Ltd. engages in the research and development, manufacture, and sale of APIs and pharmaceutical intermediates in China. Its primary products include Phenylbutazone, Primidone, Phenobarbital, Fluorouracil, Propylthiouracil, Piroxicam, and Flucytosine APIs. The company was founded in 1957 and is based in Nantong, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nantong",
        "zipcode": "226407",
        "website": "http://www.jinghuapharm.com",
        "market_cap": "Mid Cap"
    },
    "002365.SZ": {
        "short_name": "QIANJIANG YONGAN P",
        "long_name": "Qianjiang Yongan Pharmaceutical Co., Ltd.",
        "summary": "Qianjiang Yongan Pharmaceutical Co., Ltd. manufactures and sells taurine in China and internationally. The company was founded in 2001 and is based in Qianjiang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qianjiang",
        "zipcode": "433132",
        "website": "http://www.chinataurine.com",
        "market_cap": "Mid Cap"
    },
    "002370.SZ": {
        "short_name": "ZHEJIANG YATAI PHA",
        "long_name": "Zhejiang Yatai Pharmaceutical Co., Ltd.",
        "summary": "Zhejiang Yatai Pharmaceutical Co., Ltd. researches, produces, sells, and exports pharmaceutical products in China and internationally. The company offers tablets, capsules, patches, powder injections, and troches. It also provides chemical agents and raw materials, and diagnostic reagents, as well as pharmaceutical research and development outsourcing services. Zhejiang Yatai Pharmaceutical Co., Ltd. was founded in 1989 and is based in Shaoxing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shaoxing",
        "zipcode": "312030",
        "website": "http://en.ytyaoye.com",
        "market_cap": "Mid Cap"
    },
    "002390.SZ": {
        "short_name": "GUIZHOU XINBANG PH",
        "long_name": "Guizhou Xinbang Pharmaceutical Co., Ltd.",
        "summary": "Guizhou Xinbang Pharmaceutical Co., Ltd. engages in the research, development, manufacture, and sale of Chinese herbal medicines and biological drugs in China and internationally. It offers cardiovascular and cerebrovascular, digestive system, endocrine, tumor and immune regulation, blood system, rheumatism and rheumatoid, urinary system, antipyretic analgesic, cold medication, gynecological treatment, and anti-infective drugs. The company was founded in 1995 and is headquartered in Guiyang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guiyang",
        "zipcode": "550018",
        "website": "http://www.xinbang.com",
        "market_cap": "Large Cap"
    },
    "002393.SZ": {
        "short_name": "TIANJIN LISHENG PH",
        "long_name": "Tianjin Lisheng Pharmaceutical Co.,Ltd.",
        "summary": "Tianjin Lisheng Pharmaceutical Co.,Ltd. researches and develops medicines. The company offers raw materials, drugs, and medicinal plastic bottles. It also exports its products. The company was founded in 1951 and is based in Tianjin, China. Tianjin Lisheng Pharmaceutical Co.,Ltd. is a subsidiary of Tianjin Pharmaceutical Holdings Ltd.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300385",
        "website": "http://www.lishengpharma.com",
        "market_cap": "Mid Cap"
    },
    "002412.SZ": {
        "short_name": "HUNAN HANSEN PHARM",
        "long_name": "Hunan Hansen Pharmaceutical Co., Ltd.",
        "summary": "Hunan Hansen Pharmaceutical Co., Ltd. produces and sells Chinese and western medicines in China and internationally. It provides medicines in injection, oral liquid, tablet, capsule, granule, syrup, ointment, tincture, pill, and other forms. The company is based in Yiyang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yiyang",
        "zipcode": "413000",
        "website": "http://www.hansenzy.com",
        "market_cap": "Mid Cap"
    },
    "002424.SZ": {
        "short_name": "GUIZHOU BAILING GR",
        "long_name": "Guizhou Bailing Group Pharmaceutical Co., Ltd.",
        "summary": "Guizhou Bailing Group Pharmaceutical Co., Ltd. researches, develops, produces, and sells Chinese medicines in China. The company provides medicines in the form of tablets, capsules, granules, syrups, pills, powders, tinctures, sprays, and ointments for cardiovascular and cerebrovascular diseases, cough, cold, pediatric, and gynecologic diseases. Guizhou Bailing Group Pharmaceutical Co., Ltd. was founded in 2005 and is based in Anshun, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Anshun",
        "zipcode": null,
        "website": "http://www.gzbl.com",
        "market_cap": "Large Cap"
    },
    "002433.SZ": {
        "short_name": "GUANGDONG TAIANTAN",
        "long_name": "Guangdong Taiantang Pharmaceutical Co., Ltd.",
        "summary": "Guangdong Taiantang Pharmaceutical Co., Ltd. engages in the research, development, production, and sale of traditional Chinese medicines in China. It offers medicines for the areas, including reproductive male, reproductive gynecology, cardiovascular, dermatology, pediatrics, respiratory, replenishment, digestive hepatobiliary, rheumatology, and health and other areas. Goangdong Taiantang Pharmaceutical Co., Ltd. was founded in 1995 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.pibao.cn",
        "market_cap": "Mid Cap"
    },
    "002437.SZ": {
        "short_name": "HARBIN GLORIA PHAR",
        "long_name": "Harbin Gloria Pharmaceuticals Co., Ltd",
        "summary": "Harbin Gloria Pharmaceuticals Co., Ltd. engages in the research, development, production, and sale of pharmaceutical products primarily in the People's Republic of China. It offers cardiac cerebrovascular medication, skeletal muscle system, vitamins and minerals, urinary system medication, antitumor medication, anti-infective drugs, respiratory medication, antihistamine, peptic, and other products. Harbin Gloria Pharmaceuticals Co., Ltd. was founded in 2000 and is based in Harbin, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": "150025",
        "website": "http://www.gloria.cc",
        "market_cap": "Mid Cap"
    },
    "002550.SZ": {
        "short_name": "CHANGZHOU QIANHONG",
        "long_name": "Changzhou Qianhong Biopharma CO.,LTD",
        "summary": "Changzhou Qianhong Biopharma CO.,LTD engages in the research and development, production, and sale of bio-pharmaceutical products with the focus on polysaccharides and enzymes in China. The company provides various API products, including heparin sodium, heparin calcium, enoxaparin sodium, nadroparin calcium, and dalteparin sodium for use as anticoagulants; pancreatin for use as a digestive agent; asparaginase for use as an antineoplastic agent; kallidinogenase kallikrein for use in the treatment of microcirculation disorders; and heparinoid. It also offers a range of preparations, such as nadroparin calcium PFS, enoxaparin sodium PFS, dalteparin sodium PFS, and asparaginase and heparin sodium injections for use as anticoagulants. In addition, the company exports its products. Changzhou Qianhong Biopharma CO.,LTD was founded in 1971 and is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": "213022",
        "website": "http://www.qhsh.com.cn",
        "market_cap": "Mid Cap"
    },
    "002626.SZ": {
        "short_name": "XIAMEN KINGDOMWAY",
        "long_name": "Xiamen Kingdomway Group Company",
        "summary": "Xiamen Kingdomway Group Company engages in the manufacturing and sale of the nutrition and health resources in China and internationally. It offers a series of raw material products, including coenzyme Q10, VA, VD3, microalgae DHA, and plant ARA, as well as provides dietary supplements and sports nutrition products. The company was formerly known as Xiamen Jindawei Vitamin Co., Ltd. Xiamen Kingdomway Group Company was founded in 1997 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": null,
        "website": "http://www.kingdomway.com",
        "market_cap": "Large Cap"
    },
    "002644.SZ": {
        "short_name": "LANZHOU FOCI PHARM",
        "long_name": "LanZhou Foci Pharmaceutical Co.,Ltd.",
        "summary": "LanZhou Foci Pharmaceutical Co.,Ltd., a pharmaceutical company, manufactures and sells traditional Chinese medicines in China. It provides its products in various dosage forms, including pills, tablets, granules, capsules, concentrated decoctions, mixtures, oral liquids, syrups, and medicinal wines under the Min Shan and Foci brands. The company also engages in researching activities for the development of new herbal drugs. It also exports its products to approximately 27 countries, which include the United States, Canada, Japan, Singapore, Indonesia, Thailand, Malaysia, New Zealand, Australia, Russia, Ukraine, Hong Kong, etc. The company was founded in 1929 and is based in Lanzhou, China. LanZhou Foci Pharmaceutical Co.,Ltd. is a subsidiary of Lanzhou Foci Pharmaceutical Factory.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lanzhou",
        "zipcode": null,
        "website": "http://www.fczy.com",
        "market_cap": "Mid Cap"
    },
    "002688.SZ": {
        "short_name": "JINHE BIOTECHNOLOG",
        "long_name": "Jinhe Biotechnology CO., LTD.",
        "summary": "Jinhe Biotechnology CO., LTD. produces and sells veterinary medicines in China. The company offers chlortetracycline feed grade, an antimicrobial drug for the inhibition and treatment of white dysentery, enteritis, pheumonia, typhoid, paratyphoid, cholera, etc. in poultry and livestock; and chlortetracycline hydrochloride for the inhibition and treatment of pullorum disease, typhoid, and swine enteritis, as well as bacterial diseases, including paratyphoid and cholera. It also exports its products to the United States, South-east Asia, Latin America, Europe, etc. The company is based in Dalian, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116023",
        "website": "http://www.jinhe.com.cn",
        "market_cap": "Mid Cap"
    },
    "002693.SZ": {
        "short_name": "HAINAN SHUANGCHENG",
        "long_name": "Hainan Shuangcheng Pharmaceuticals Co., Ltd.",
        "summary": "Hainan Shuangcheng Pharmaceuticals Co., Ltd. researches, develops, manufactures, and markets synthesized peptide drugs and active pharmaceutical ingredients worldwide. It offers somatostatin, thymosin, clindamycin hydrochloride, thymopentin, L-carnitine, uranin hydrobromide, inosine, cyclophosphine adenosine, motidine, scopolamine, and sodium ferulate for injections, as well as vitamin B6. The company was founded in 2000 and is based in Haikou, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Haikou",
        "zipcode": "570311",
        "website": "http://www.shuangchengmed.com",
        "market_cap": "Small Cap"
    },
    "002728.SZ": {
        "short_name": "TEYI PHARMACEUTICA",
        "long_name": "Teyi Pharmaceutical Group Co.,Ltd",
        "summary": "Teyi Pharmaceutical Group Co., Ltd. engages in the research and development, production, and sale of proprietary Chinese medicines, and chemical preparations, raw materials, and products in China. The company offers cough and phlegm, kidney, anti- infection, cardiovascular, and digestive system drugs. Its chemical raw materials and products include aluminum magnesium carbonate, phenytoin, ferrous sulfate, glacial acetic acid, calcium chloride, sodium chloride, strontium and tannic acid, and zinc sulfate. The company was formerly known as Guangdong Taicheng Pharmaceutical Co., Ltd. and changed its name to Teyi Pharmaceutical Group Co., Ltd. in November 2016. Teyi Pharmaceutical Group Co., Ltd. is based in Taishan, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taishan",
        "zipcode": "529200",
        "website": "http://www.tczy.com.cn",
        "market_cap": "Mid Cap"
    },
    "002737.SZ": {
        "short_name": "SUNFLOWER PHARMACE",
        "long_name": "Sunflower Pharmaceutical Group Co.,Ltd",
        "summary": "Sunflower Pharmaceutical Group Co.,Ltd develops, manufactures, and sells Chinese pharmaceuticals in China. The company produces Chinese patent medicines, chemicals, biological medicines, and health care medicines. Its products include children's medicines, digestive medicines, flu medicines, gynecologic medicines, liver and gallbladder gastrointestinal medicines, cold medicines, rheumatic medicines, heart and brain vascular medicines, geriatrics and chronic disease medicines, cardiovascular medicines, etc. under the Sun Flower and Little Sun Flower brands. The company was founded in 2005 and is based in Harbin, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": null,
        "website": "http://www.kuihuayaoye.com",
        "market_cap": "Mid Cap"
    },
    "002750.SZ": {
        "short_name": "KUNMING LONGJIN PH",
        "long_name": "Kunming Longjin Pharmaceutical Co., Ltd.",
        "summary": "Kunming Longjin Pharmaceutical Co., Ltd. develops, produces, and sells natural botanicals and chemical freeze-dried powder injections in China. It offers Chinese, biochemical, chemical, cardio-cerebral vascular, and digestive system medicines; immune system and first aid medications; and vitamins, minerals, and enteral and parenteral nutrition products. The company was founded in 1996 and is based in Kunming, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": "650503",
        "website": "http://www.longjin.com.cn",
        "market_cap": "Mid Cap"
    },
    "002773.SZ": {
        "short_name": "CHENGDU KANGHONG P",
        "long_name": "Chengdu Kanghong Pharmaceuticals Group Co., Ltd",
        "summary": "Chengdu Kanghong Pharmaceuticals Group Co., Ltd engages in the research, development, production, and sale of biological products, Chinese medicines, and chemical drugs in China. It offers ophthalmic system, central nervous system, digestive system, and other system drugs. The company was founded in 1996 and is headquartered in Chengdu, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": null,
        "website": "http://www.cnkh.com",
        "market_cap": "Large Cap"
    },
    "002793.SZ": {
        "short_name": "LUOXIN PHARMACEUTI",
        "long_name": "Luoxin Pharmaceuticals Group Stock Co., Ltd.",
        "summary": "Luoxin Pharmaceuticals Group Stock Co., Ltd. engages in the research and development, manufacture, and trading of drugs in China. The company provides antiviral, anti-infective, respiratory and digestive system, nervous and endocrine system, cardiovascular system, oncology, and anti-allergic APIs and intermediates, as well as antipyretic, analgesics, and anti-inflammatory APIs and intermediates. It also offers medical treatment and health services. The company was formerly known as Zhejiang Doyin Pump Industry Co., Ltd. and changed its name to Luoxin Pharmaceuticals Group Stock Co., Ltd. in April 2020. Luoxin Pharmaceuticals Group Stock Co., Ltd. is based in Linyi, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201210",
        "website": "http://www.luoxin.cn",
        "market_cap": "Large Cap"
    },
    "002817.SZ": {
        "short_name": "ANHUI HUANGSHAN CA",
        "long_name": "Anhui Huangshan Capsule Co., Ltd.",
        "summary": "Anhui Huangshan Capsule Co., Ltd. manufactures and sells vacant hard capsules. It offers entersoluble vacant gelatin capsules, vegetable entersoluble capsules, vacant gelatin capsules, colon soluble vacant gelatin capsules, vegetable capsules, and pulluan capsules. The company was founded in 1989 and is based in Jingde, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jingde",
        "zipcode": "242605",
        "website": "http://www.hsjn.com",
        "market_cap": "Small Cap"
    },
    "002864.SZ": {
        "short_name": "SHAANXI PANLONG PH",
        "long_name": "Shaanxi Panlong Pharmaceutical Group Limited By Share Ltd",
        "summary": "Shaanxi Panlong Pharmaceutical Group Limited By Share Ltd researches and develops, produces, and sells drugs and GAP cultivation of medicinal materials in China. It offers orthopedic, cardio-cerebrovascular, digestive, supplement category, respiratory, Chinese anti-inflammatory, pediatric, gynecology, hepatobiliary, and specialty drugs. The company was founded in 1992 and is headquartered in Xi'an, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710025",
        "website": "http://www.pljt.com",
        "market_cap": "Mid Cap"
    },
    "002880.SZ": {
        "short_name": "SHENZHEN WEIGUANG",
        "long_name": "Shenzhen Weiguang Biological Products Co., Ltd.",
        "summary": "Shenzhen Weiguang Biological Products Co., Ltd. primarily engages in the research, development, production, and sale of blood products in China. The company offers human albumin, intravenous immunoglobulin (pH4), freeze-dried intravenous human immunoglobulin (pH4), human immunoglobulin, hepatitis B human immunoglobulin, rabies patient immunoglobulin, tetanus human immunoglobulin, histamine human immunoglobulin, and human fibrinogen, as well as a total of 9 varieties and 21 specifications. Shenzhen Weiguang Biological Products Co., Ltd. was founded in 1985 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518107",
        "website": "http://www.szwg.com",
        "market_cap": "Mid Cap"
    },
    "002900.SZ": {
        "short_name": "HARBIN MEDISAN PHA",
        "long_name": "Harbin Medisan Pharmaceutical Co., Ltd.",
        "summary": "Harbin Medisan Pharmaceutical Co., Ltd. researches, develops, produces, and sells chemical formulations in China. It offers Araxetan, alanyl glutamine, brain protein hydrolyzate, ligustrazine hydrochloride, bone peptide, Yanhuning, glucose, and sodium chloride injections, as well as rice nitrogen tablets, valsartan dispersible tablets, and other drugs for use in the various indications comprising nervous system, cardiovascular and cerebrovascular, musculoskeletal, systemic anti-infective, regulating water, electrolyte and acid-base balance, nutritional supplements, and other medical fields. The company was founded in 1996 and is based in Harbin, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": "150025",
        "website": "http://www.medisan.com.cn",
        "market_cap": "Mid Cap"
    },
    "002907.SZ": {
        "short_name": "CHONGQING PHARSCIN",
        "long_name": "Chongqing Pharscin Pharmaceutical Co., Ltd.",
        "summary": "Chongqing Pharscin Pharmaceutical Co., Ltd. engages in the research and development, production, and sale of drugs in China. The company offers tablets, powders, granules, hard capsules, soft capsules, powder injections, freeze-dried powder injections, small volume injections, API synthesis, and botanical drug extractions. It provides its products in the areas of CNS, digestion, otolaryngology, oncology, cardiovascular, and cerebrovascular related diseases. The company is headquartered in Chongqing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "401120",
        "website": "http://www.pharscin.com",
        "market_cap": "Mid Cap"
    },
    "002923.SZ": {
        "short_name": "ZHUHAI RUNDU PHARM",
        "long_name": "Zhuhai Rundu Pharmaceutical Co., Ltd.",
        "summary": "Zhuhai Rundu Pharmaceutical Co., Ltd. engages in the research and development, production, and marketing of pharmaceutical ingredients for cardiovascular, gastrointestinal, CNS, and anesthesia. It offers APIs, intermediates, and pellets, as well as formulations in the forms of capsules, tablets, and injections. The company serves in the United States, Germany, Spain, Holland, Slovenia, Argentina, Brazil, Honduras, Japan, Korea, India, Jordan, Syria, Saudi Arabia, Algeria, Tunisia, Egypt, etc. Zhuhai Rundu Pharmaceutical Co., Ltd. was founded in 1997 and is based in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": "519041",
        "website": "http://www.rdpharma.cn",
        "market_cap": "Mid Cap"
    },
    "002940.SZ": {
        "short_name": "ZHEJIANG ANGLIKANG",
        "long_name": "Zhejiang AngLiKang Pharmaceutical CO.,LTD.",
        "summary": "Zhejiang Anglikang Pharmaceutical Co., Ltd. produces and sells bulk pharmaceutical materials, pharmaceutic preparations, and medical empty capsules. The company offers pharmaceutical preparations, such as Levamlodipine Besylate, Levofloxacin Hydrochloride, Nifedipine sustain-released, Cefaclor sustained-release, Cefpodoxime Proxetil tablets, as well as Cefaclor capsules and granules. It also provides APLs, including Cefradine, Cefalexin, Cefradine sterile with L-arginine, Cefadroxil, Cefaclor, Cefixime, Doxofylline, Oryzanol, Telmisartan, and 7-Amino-3-methyl-3-cephem-4-carboxylic acid, as well as Ketoleucine, Ketovaine, D, L-Ketoisoleucine, D, L-a-Hydroxymethionine, and Ketone phenylalanine calcium. The company was founded in 2001 and is based in Shengzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shengzhou",
        "zipcode": "312400",
        "website": "http://www.alkpharm.com",
        "market_cap": "Mid Cap"
    },
    "0503.HK": {
        "short_name": "LANSEN PHARMA",
        "long_name": "Lansen Pharmaceutical Holdings Limited",
        "summary": "Lansen Pharmaceutical Holdings Limited, an investment holding company, develops, produces, and sells specialty pharmaceuticals for use in the field of rheumatology and dermatology in the People's Republic of China and internationally. It operates through Pharmaceuticals, Cosmetics Products, and Healthcare Products segments. The company offers specialist medicines and Chinese medicine generic drugs; cosmetic products; and plant extracts and healthcare products. It also engages in research, development, and industrialization of industrial enzyme preparations, molecular biology tool enzymes, and bioactive factors for cosmetics and biological skincare products. The company was founded in 2001 and is headquartered in Ningbo, the People's Republic of China. Lansen Pharmaceutical Holdings Limited is a subsidiary of Cathay International Pharma Manufacture and Distribution (China) Limited.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315174",
        "website": "http://www.lansen.com.cn",
        "market_cap": "Small Cap"
    },
    "0570.HK": {
        "short_name": "TRAD CHI MED",
        "long_name": "China Traditional Chinese Medicine Holdings Co. Limited",
        "summary": "China Traditional Chinese Medicine Holdings Co. Limited, an investment holding company, engages in the research and development, production, and sale of Chinese medicine and pharmaceutical products in the People's Republic of China. The company offers granules, finished drugs, decoction pieces, and healthcare products. It is also involved in the cultivation of Chinese medicinal herbs; preparation of traditional Chinese medicines; trading of pharmaceutical products; provision of traditional Chinese medical consultation services; and retail of pharmaceuticals and decoction. The company also provides logistics and warehouse, and property leasing services. The company sells its products to hospitals and retail pharmacies. The company was formerly known as China Traditional Chinese Medicine Co. Limited and changed its name to China Traditional Chinese Medicine Holdings Co. Limited in July 2016. China Traditional China Traditional Chinese Medicine Holdings Co. Limited is headquartered in Foshan, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Foshan",
        "zipcode": null,
        "website": "http://www.china-tcm.com.cn",
        "market_cap": "Large Cap"
    },
    "0719.HK": {
        "short_name": "SHANDONG XINHUA",
        "long_name": "Shandong Xinhua Pharmaceutical Company Limited",
        "summary": "Shandong Xinhua Pharmaceutical Company Limited, through its subsidiaries, develops, manufactures, and sells bulk pharmaceuticals, preparations, and chemical products. It operates through Chemical Bulk Drugs, Preparations, and Chemical Intermediates and Other products. It offers active pharmaceutical ingredients, pharmaceutical preparations, and chemical products, such as antipyretic analgesics; drugs for cardiovascular and cerebrovascular diseases; anti-infectives; drugs for central nervous system diseases; and other drugs under the brand of Xinhua. The company also provides prepared Chinese herbal medicine for decoction, traditional Chinese medicines, chemical raw materials, chemical preparations, antibiotics, biochemical medicines, chemical bulk drugs, anesthetics, anti-psychotic drugs, pharmaceutical precursor chemicals, protein assimilation preparations, peptide hormones, medical toxic drugs, etc. In addition, it offers raw materials and intermediates, powders for injection and tablets, and bulk pharmaceutical and intermediates; tablets, hard capsules, granules, and dry suspension; imports and exports goods and technologies; designs medical projects; develops and sells real estate; and health products research and development activities. Additionally, the company engages in the certification and import and export business; electrical equipment engineering; and installation and testing of chemical equipment and electrical equipment, as well as sales of mechanical, hardware, and electrical equipment. It also provides contract manufacturing services of APIs and pharmaceutical intermediates, as well as OTC and generic products; and internet data services, internet sales, and internet information services for pharmaceuticals and medical devices, etc. The company operates in the People's Republic of China, the Americas, Europe, and internationally. Shandong Xinhua Pharmaceutical Company Limited was founded in 1943 and is based in Zibo, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zibo",
        "zipcode": "255086",
        "website": "http://www.xhzy.com",
        "market_cap": "Mid Cap"
    },
    "0874.HK": {
        "short_name": "BAIYUNSHAN PH",
        "long_name": "Guangzhou Baiyunshan Pharmaceutical Holdings Company Limited",
        "summary": "Guangzhou Baiyunshan Pharmaceutical Holdings Company Limited engages in the research, development, manufacture, and sale of Chinese patent and Western medicines, chemical raw materials, natural and biological medicines, and chemical raw material intermediates in the People's Republic of China and internationally. It operates through four segments: Great Southern TCM, Great Commerce, Great Health, and Others. The company is also involved in the wholesale, retail, import, and export of Western and Chinese medicines, and medical apparatus and instruments; and research and development, production, and sale of beverages, food, healthcare products, pre-packaging food, dairy products, ganoderma spore oil capsules, lozenges, tortoise herb jelly, etc. In addition, it invests in health industry, such as medical care, health management, health preservation, elderly care, etc.; and provides commercial and advertising services. As of December 31, 2020, the company had 141 retail chain pharmacy outlets, which included 27 Cai Zhi Lin pharmacy outlets, 33 Jian Min pharmacy outlets, 36 GPC Prescription Pharmacy outlets, and 24 Hainan Guangyao Chenfei Pharmaceutical Chain outlets, as well as 21 retail stores. The company was formerly known as Guangzhou Pharmaceutical Company Limited and changed its name to Guangzhou Baiyunshan Pharmaceutical Holdings Company Limited in August 2013. Guangzhou Baiyunshan Pharmaceutical Holdings Company Limited was incorporated in 1997 and is based in Guangzhou, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510130",
        "website": "http://www.gybys.com.cn",
        "market_cap": "Large Cap"
    },
    "08HH.SG": {
        "short_name": "Shanghai Fos.Pharm.(Gr.)Co.LtdR",
        "long_name": "Shanghai Fosun Pharmaceutical (Group) Co., Ltd.",
        "summary": "Shanghai Fosun Pharmaceutical (Group) Co., Ltd. researches, develops, manufactures, trades, and sells pharmaceutical products in Mainland China and internationally. It operates in five segments: Pharmaceutical Manufacturing and Research and Development, Healthcare Service, Medical Devices and Medical Diagnosis, Pharmaceutical Distribution and Retail, and Other business Operations. It offers pharmaceutical products in the areas of metabolic and digestive system; antitumor; anti-infective; central nervous system drugs; cardiovascular system; blood system; vaccines; and APIs and intermediates. The company also provides medical diagnosis and medical device products in the field of in vitro diagnostics, the products involve clinical chemistry, clinical immunity, molecular diagnostics, gene chip technology, clinical microbiology, and other fields of laboratory medicine. In addition, it offers medical services in various hospitals. The company was formerly known as Shanghai Fosun Industrial Co. Ltd. and changed its name to Shanghai Fosun Pharmaceutical (Group) Co., Ltd. in December 2004. The company was founded in 1994 and is based in Shanghai, China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200233",
        "website": "http://www.fosunpharma.com",
        "market_cap": "Large Cap"
    },
    "1349.HK": {
        "short_name": "FUDANZHANGJIANG",
        "long_name": "Shanghai Fudan-Zhangjiang Bio-Pharmaceutical Co., Ltd.",
        "summary": "Shanghai Fudan-Zhangjiang Bio-Pharmaceutical Co., Ltd., together with its subsidiaries, researches, develops, manufactures, and sells bio-pharmaceutical products. It offers genetic engineering platform drugs, including CD30-MMAE, which is in clinical trial Phase I for tumors; Trop 2 antibody-conjugated drug that is in pre-clinical studies for triple negative breast cancer, bladder and gastric cancer, and other tumors; and HER2 antibody-drug conjugate, which is in pre-clinical study for tumors. The company also provides photodynamic technical platform drugs, such as hemoporfin for port wine stain, which is in Phase IV clinical trial; aminolevulinic acid, which is in Phase II clinical trials for cervical diseases infected by HPV; and aminolevulinic acid that is in Phase I clinical trials for acne, as well as completed pre-clinical study for brain gliomas. In addition, it offers nano technical platform drugs comprising Nanoparticle Albumin-bound Paclitaxel that is in pre-clinical studies for tumors, as well as developing Doxorubicin liposome for tumors. Further, the company offers oral solid preparation technology, which includes obeticholic acid for Hepatobiliary disease; and JAK1 inhibitor that is in Phase I clinical trial for rheumatoid arthritis. Additionally, it researches and develops pharmaceutical and medical devices; medical diagnostic products; provides related services; and sells daily necessities, and clinical laboratory analysis instruments and software. It also engages in the technology development, transfer, consulting, and promotion activities; and production of freeze-dried powder injections and APIs, as well as invests in overseas medical projects. The company was founded in 1996 and is based in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201210",
        "website": "http://www.fd-zj.com",
        "market_cap": "Mid Cap"
    },
    "1513.HK": {
        "short_name": "LIVZON PHARMA",
        "long_name": "Livzon Pharmaceutical Group Inc.",
        "summary": "Livzon Pharmaceutical Group Inc. engages in the research, development, production, and distribution of pharmaceutical products in the People's Republic of China. Its products include Ilaprazole enteric coated tablets for the treatment of duodenal ulcers and reflux esophagitis; Laprazole sodium for injection to treat peptic ulcer hemorrhage; Leuprorelin Acetate Microspheres for injection; Urofollitropin for injection to treat anovulation and sufferers; Perospirone Hydrochloride for the treatment of schizophrenia; Anti-viral Granules to treat upper respiratory tract infection and influenza; and Shenqi Fuzheng Injection for the treatment of weakness and tiredness, lassitude, spontaneous sweating, vertigo, and for the patients of lung cancer and stomach cancer. The company also offers active pharmaceutical ingredients (APIs) and intermediates, such as diagnostic kit for IgM/IgG antibody to coronavirus; and diagnostic reagents and equipment, including diagnostic kit for human immunodeficiency virus antibody, diagnostic kit for anti-nuclear antibody panel, and diagnostic kit for tuberculosis specific infected T cells. In addition, it provides biologic products, traditional Chinese drug medicine, biochemical drugs, microbiological preparations, antibiotics, and pharmaceutical raw materials. The company also exports its products. Livzon Pharmaceutical Group Inc. was founded in 1985 and is based in Zhuhai, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": "519090",
        "website": "http://www.livzon.com.cn",
        "market_cap": "Large Cap"
    },
    "1558.HK": {
        "short_name": "HEC PHARM",
        "long_name": "YiChang HEC ChangJiang Pharmaceutical Co., Ltd.",
        "summary": "YiChang HEC ChangJiang Pharmaceutical Co., Ltd. develops, manufactures, and sells pharmaceutical products in the therapeutic areas of anti-virus, endocrine and metabolic diseases, and cardiovascular diseases in the People's Republic of China. It also manufactures and sells active pharmaceutical ingredients; researches and develops medical devices and drugs, as well as biotechnology; and provides medical consulting services. The company sells its products to hospitals and medical institutions through a network of distributors. It has a strategic cooperation framework agreement with Alibaba Health Technology (China) Limited to carry out influenza special projects; Jointown Pharmaceutical Group Co., Ltd.; Guangdong Yihao Pharmaceutical Co., Ltd.; and Shenzhen HEC Industrial Development Co., Ltd, as well as strategic cooperative partnership with China National Accord Medicines Corporation Ltd. The company was formerly known as Yichang Changjiang Pharmaceutical Company Limited and changed its name to YiChang HEC ChangJiang Pharmaceutical Co., Ltd. in May 2015. The company was incorporated in 2001 and is based in Yichang, China. YiChang HEC ChangJiang Pharmaceutical Co., Ltd. is a subsidiary of Guangdong HEC Technology Holding Co., Ltd.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Yichang",
        "zipcode": null,
        "website": "http://cj.hec.cn",
        "market_cap": "Mid Cap"
    },
    "1652.HK": {
        "short_name": "FUSEN PHARM",
        "long_name": "Fusen Pharmaceutical Company Limited",
        "summary": "Fusen Pharmaceutical Company Limited, an investment holding company, manufactures and sells pharmaceutical products under the Fusen brand in the People's Republic of China. It offers over the counter and prescription based proprietary Chinese medicine (PCM) products in various dosage forms. The company's product portfolio includes Shuanghuanglian-based cold medicines comprising Shuanghuanglian oral solutions and Shuanghuanglian injections; and other PCM and western medicine products, such as Chaihu injection, as well as flunarizine hydrochloride capsules, compound ferrous sulfate granules, and clarithromycin sustained release tablets. In addition, it researches, develops, produces, and sells various PCMs and chemical medicines for the treatments of cold and fever, cardiovascular and gynecological diseases, and anemia. Further, the company offers business management and consulting services. The company was founded in 2003 and is headquartered in Nanyang, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Nanyang",
        "zipcode": null,
        "website": "http://www.fusenyy.com",
        "market_cap": "Mid Cap"
    },
    "1681.HK": {
        "short_name": "CONSUN PHARMA",
        "long_name": "Consun Pharmaceutical Group Limited",
        "summary": "Consun Pharmaceutical Group Limited, an investment holding company, researches and develops, manufactures, and sells Chinese medicines and medical contrast medium products in the People's Republic of China. The company operates in two segments, Consun Pharmaceutical and Yulin Pharmaceutical. It offers uremic clearance granule to treat chronic kidney diseases; Yishen Huashi particles to treat proteinuria; Gadopentetate Dimeglumine injections for magnetic resonance image diagnostics of nervous centralis, stomach, chest, pelvic cavity, and extremities, as well as for renal function assessment; and Iopamidol injections used for neuroradiology, angiography, and urography. The company also provides Yuanli Kang, an iron-dextrin oral solution; Yibao Yua, an erythromycin estolate suspension; Yuantong Ning, a cetirizine hydrochloride oral solution; and Zhixueling capsules to treat hysteromyoma bleeding, prolonged lochiorrhea, intermenstrual bleeding, bleeding after use of a contraceptive ring, hemorrhoidal bleeding, and epistaxis. In addition, it offers Gyn Antidysmenorrheic tablets for the treatment of irregular menstruation, irregular period during perimenopause, and abdominal pain during menstruation due to hepatic depression and blood deficiency; and Antibacterial Fujie lotion for staphylococcus aureus, Candida albicans, and escherichia coli in the feminine vaginal. Further, the company provides bone-setting liquid; Yunxiang analgesic tincture for treatment of rheumatism, common cold, headache, stomachache, cardiodynia, and pain in gastral cavity and chilblain; Sanqi Chuangchun capsules for activating blood circulation and dispersing blood stasis; Shiduqing capsules and tablets, and Paeonol ointment for skin disease. Additionally, it offers hepatobiliary, gastroenterology, and other medicines. The company was founded in 1997 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.chinaconsun.com",
        "market_cap": "Mid Cap"
    },
    "1LP.F": {
        "short_name": "LANSEN PHARMAC.HLD.DL-,01",
        "long_name": "Lansen Pharmaceutical Holdings Limited",
        "summary": "Lansen Pharmaceutical Holdings Limited, an investment holding company, develops, produces, and sells specialty pharmaceuticals for use in the field of rheumatology and dermatology in the People's Republic of China and internationally. It operates through Pharmaceuticals, Cosmetics Products, and Healthcare Products segments. The company offers specialist medicines and Chinese medicine generic drugs; cosmetic products; and plant extracts and healthcare products. It also engages in research, development, and industrialization of industrial enzyme preparations, molecular biology tool enzymes, and bioactive factors for cosmetics and biological skincare products. The company was founded in 2001 and is headquartered in Ningbo, the People's Republic of China. Lansen Pharmaceutical Holdings Limited is a subsidiary of Cathay International Pharma Manufacture and Distribution (China) Limited.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315174",
        "website": "http://www.lansen.com.cn",
        "market_cap": "Small Cap"
    },
    "2196.HK": {
        "short_name": "FOSUN PHARMA",
        "long_name": "Shanghai Fosun Pharmaceutical (Group) Co., Ltd.",
        "summary": "Shanghai Fosun Pharmaceutical (Group) Co., Ltd. researches, develops, manufactures, trades, and sells pharmaceutical products in Mainland China and internationally. It operates in five segments: Pharmaceutical Manufacturing and Research and Development, Healthcare Service, Medical Devices and Medical Diagnosis, Pharmaceutical Distribution and Retail, and Other business Operations. It offers pharmaceutical products in the areas of metabolic and digestive system; antitumor; anti-infective; central nervous system drugs; cardiovascular system; blood system; vaccines; and APIs and intermediates. The company also provides medical diagnosis and medical device products in the field of in vitro diagnostics, the products involve clinical chemistry, clinical immunity, molecular diagnostics, gene chip technology, clinical microbiology, and other fields of laboratory medicine. In addition, it offers medical services in various hospitals. The company was formerly known as Shanghai Fosun Industrial Co. Ltd. and changed its name to Shanghai Fosun Pharmaceutical (Group) Co., Ltd. in December 2004. The company was founded in 1994 and is based in Shanghai, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200233",
        "website": "http://www.fosunpharma.com",
        "market_cap": "Large Cap"
    },
    "2877.HK": {
        "short_name": "SHINEWAY PHARM",
        "long_name": "China Shineway Pharmaceutical Group Limited",
        "summary": "China Shineway Pharmaceutical Group Limited, an investment holding company, engages in the research and development, manufacture, and trade of Chinese medicines in the People's Republic of China and Hong Kong. The company offers modern Chinese medicines in the form of soft capsules, granules, and injections in various therapeutic areas, including cardio-cerebrovascular, antiviral, orthopedics, pediatrics, gynecology, neurology, gastroenterology, ophthalmology, oncology, and immunology. It also trades in agricultural products. The company was incorporated in 2004 and is headquartered in Shijiazhuang, the People's Republic of China. China Shineway Pharmaceutical Group Limited is a subsidiary of Forway Investment Limited.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": "051430",
        "website": "http://www.shineway.com",
        "market_cap": "Mid Cap"
    },
    "2UO1.F": {
        "short_name": "HAPPINESS BIOT.GRP -,0005",
        "long_name": "Happiness Biotech Group Limited",
        "summary": "Happiness Biotech Group Limited engages in the research, development, manufacture, and sale of nutraceutical and dietary supplement products in the People's Republic of China and internationally. The company's product category includes lucidum spore powder, cordyceps mycelia, ejiao solution, American ginseng, and other products. It also offers a range of ganoderma lucidum products, such as essence oil, cleansing milk, shampoo, shower gel, and nourishing cream products under the Cai Zhi Ning brand, as well as edible fungi. In addition, the company provides disinfectants, non-medical face masks, and COVID-19 anti-body testing kits. It sells its products through distributors, large-scale chain drugstores, malls, and supermarkets under the Happiness brand. Happiness Biotech Group Limited was founded in 2004 and is headquartered in Nanping, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Nanping",
        "zipcode": "353200",
        "website": "http://www.happ.org.cn",
        "market_cap": "Small Cap"
    },
    "300016.SZ": {
        "short_name": "BEIJING BEILU PHAR",
        "long_name": "Beijing Beilu Pharmaceutical Co., Ltd.",
        "summary": "Beijing Beilu Pharmaceutical Co., Ltd. develops, produces, and sells pharmaceutical products. The company's products include contrast agents, central nervous system products, and oral anti-diabetic drugs. Beijing Beilu Pharmaceutical Co., Ltd. also produces precision medicine. The company was founded in 1992 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100082",
        "website": "http://www.beilu.com.cn",
        "market_cap": "Mid Cap"
    },
    "300026.SZ": {
        "short_name": "TIANJIN CHASE SUN",
        "long_name": "Tianjin Chase Sun Pharmaceutical Co.,Ltd",
        "summary": "Tianjin Chase Sun Pharmaceutical Co.,Ltd engages in the research, development, production, and marketing of various pharmaceutical products in China. The company offers Chinese herb preparation products, medicinal granules, synthetic drugs, biotech drugs, medical apparatus, and Internet based therapy. It is also involved in the research and development of various drugs in the areas of sepsis, pulmonary hypertension, leukemia, cardiovascular and cerebrovascular diseases, arthritis, ischemic stroke, HCV, vascular disease, psychosis, and chemotherapy, as well as anesthesia drugs and immunomodulators. The company was founded in 1996 and is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "10200536",
        "website": "http://www.chasesun.cn",
        "market_cap": "Large Cap"
    },
    "300039.SZ": {
        "short_name": "SHANGHAI KAIBAO PH",
        "long_name": "Shanghai Kaibao Pharmaceutical CO.,Ltd",
        "summary": "Shanghai Kaibao Pharmaceutical CO.,Ltd researches, develops, produces, and sells modern Chinese medicines primarily in China. The company's primary product is Tanreqing injection that clears heat and detoxifies; relieves cough and removes phlegm; and for treatment of pneumonia, acute and chronic bronchitis, and upper respiratory tract infection. It also provides Kaibao Chuanxiong capsules; Kaibao Weiyuan tablets; And Kaibao pressure-release sustained release tablets. In addition, the company offers western medicines in various dosage forms, such as lyophilized powder injection, small volume injection, tablet, capsule, granule, pill, cream, and other dosage forms. Its western medicines comprise Kaixilai freeze-dried powder, tiopronin sodium, ginseng capsule, and Shanhaidan, alopecia areata, as well as Yuanman brand health win. The company is also developing Youxinding Capsule for treatment of depressions, which is in phase II clinical study; classic Fangding Guiyou soft capsule that is in phase III clinical study; Shufeng analgesic capsule for the treatment of migraine, which is in phase III clinical study; Huadan Anshen mixture for anti-insomnia that is in phase III clinical study; and Tanzheqing series of products, which is in phase III clinical study. Shanghai Kaibao Pharmaceutical CO.,Ltd was founded in 2000 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201401",
        "website": "http://www.xykb.com",
        "market_cap": "Mid Cap"
    },
    "300086.SZ": {
        "short_name": "HONZ PHARMACEUTICA",
        "long_name": "Honz Pharmaceutical Co., Ltd.",
        "summary": "Honz Pharmaceutical Co., Ltd. engages in the research and development, manufacture, and sale of pediatric medicines in China. It offers medicines for children and adults in the areas of anti-anaphylaxis, antidiarrheal and digestive, cough, anti-flu, antipyretic, anti-infection, anti-fungal, antipyretic-analgesic, and endocrine. The company markets its products through a network of agents and sales terminals. The company was formerly known as HaiNan Honz Pharmaceutical Co.,Ltd. and changed its name to Honz Pharmaceutical Co., Ltd. in November 2016. Honz Pharmaceutical Co., Ltd. is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.honz.com.cn",
        "market_cap": "Mid Cap"
    },
    "300110.SZ": {
        "short_name": "HUAREN PHARMACEUTI",
        "long_name": "Huaren Pharmaceutical Co., Ltd.",
        "summary": "Huaren Pharmaceutical Co., Ltd. produces and sells non-PVC soft bag infusions in China. The company offers non-PVC double tube double valves, single tube single valves, and single tube double valve soft bags, as well as plastic and glass bottles. It also provides sodium lactate ringer injection, compound sodium chloride injection, glucose injection, sodium chloride injection, sterilized injection water, physiological sodium chloride solution, and mannitol injection products. In addition, the company offers various medical devices, such as incision pull-open fixators, disposable casing puncture device, disposable specimen pickup device, and devices for endoscopy; disposable slip pads, disposable backflow drainage bags, and sterile drainage bags; and abdominal dialysis external short tubes, iodine liquid protection cap, disposable abdominal drainage bags, and various types of rubber plugs, as well as pre-sealing pistons, conveyor plugs for infusion bags, dosing plugs for infusion bags, and polycarbonate for injections to fold plugs. Further, it provides injections for various diseases categories, which include the circulatory system, nervous system, blood volume extender, blood purification, anti-hepatitis and hepatitis assisted drugs, and hemostatic and anti-infective class; and retention needle and accessory products. Huaren Pharmaceutical Co., Ltd. was founded in 1998 and is based in Qingdao, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": "266100",
        "website": "http://www.qdhuaren.com",
        "market_cap": "Mid Cap"
    },
    "300119.SZ": {
        "short_name": "TIANJIN RINGPU BIO",
        "long_name": "Tianjin Ringpu Bio-Technology Co., Ltd.",
        "summary": "Tianjin Ringpu Bio-Technology Co., Ltd. develops, manufactures, and sells animal health products in China. It provides approximately 280 varieties of animal health products, including chemical drugs, biological products, feed additives, and plant extracts for poultry, livestock, pets, and aquatic animals. The company was founded in 1998 and is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300308",
        "website": "http://www.ringpu.com",
        "market_cap": "Large Cap"
    },
    "300142.SZ": {
        "short_name": "WALVAX BIOTECHNOLO",
        "long_name": "Walvax Biotechnology Co., Ltd.",
        "summary": "Walvax Biotechnology Co., Ltd., a biological pharmaceutical company, researches and develops, produces, and sells bio-medicine products in China. The company offers biomedicines, such as vaccines, blood products, and others. It provides Group A, C meningococcal polysaccharide conjugate vaccine for infants below or equal to 2 years preventing diseases, such as cerebrospinal meningitis and septicemia; Group A and C meningococcal polysaccharide vaccine for in adults and children over the age of 2 years and adults to prevent disease caused by the bacterium Neisseria meningitidis group A or group C; and Group ACYW135 meningococcal polysaccharide vaccine for children above 2 years old to prevent epidemic cerebrospinal meningitis caused by Neisseria meningitidis group A, C, Y, and W135. The company also offers haemophilus influenzae type b conjugate vaccine for children from the age of 2 months to 5 years for the prevention of infectious diseases, including meningitis, pneumonia, septicemia, cellulitis, arthritis, epiglottitis, etc. In addition, it provides diphtheria, tetanus, and acellular pertussis combined vaccine for the prevention of diphtheria, tetanus, and pertussis for individuals from the age of 3 months to 6 years; and 23-valent pneumococcal polysaccharide vaccine for children above 2 years old to prevent pneumococcal disease caused by 23 serotypes. Walvax Biotechnology Co., Ltd. was founded in 2001 and is headquartered in Kunming, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": "650106",
        "website": "http://www.walvax.com",
        "market_cap": "Large Cap"
    },
    "300158.SZ": {
        "short_name": "SHANXI ZHENDONG PH",
        "long_name": "Shanxi Zhendong Pharmaceutical Co.,Ltd",
        "summary": "Shanxi Zhendong Pharmaceutical Co.,Ltd, together with its subsidiaries, researches, develops, manufactures, and markets pharmaceutical products and Chinese medicines in China. It offers cancer drugs, cardiovascular drugs, infectious disease drugs, and respiratory drugs; antibiotics, antitumor drugs, vitamins, etc.; Chinese medicines; calcium preparations; and active pharmaceutical ingredients, as well as sells gastrointestinal drugs. The company offers its products in various dosage forms, such as large volume injections, small volume injections, powder injections, lyophilized powders, tablets, hard capsules, granules, dry suspensions, ointments, psychotropic substances, and other formulations Shanxi Zhendong Pharmaceutical Co.,Ltd is based in Changzhi, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhi",
        "zipcode": "047100",
        "website": "http://www.zdjt.com",
        "market_cap": "Mid Cap"
    },
    "300194.SZ": {
        "short_name": "FUAN PHARMACEUTICA",
        "long_name": "Fuan Pharmaceutical (Group) Co., Ltd.",
        "summary": "Fuan Pharmaceutical (Group) Co., Ltd., together with its subsidiaries, researches and develops, manufactures, and sells pharmaceutical intermediates, bulk drugs, and formulations in the People's Republic of China. It offers APIs and intermediates, as well as formulations, such as anti-infective, cardiovascular, digestive, leaflet, and other products. The company was formerly known as Chongqing Fuan Pharmaceutical (Group) Co., Ltd. and changed its name to Fuan Pharmaceutical (Group) Co., Ltd. in August 2013. Fuan Pharmaceutical (Group) Co., Ltd. was founded in 2004 and is based in Chongqing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "401254",
        "website": "http://www.fapharm.com",
        "market_cap": "Mid Cap"
    },
    "300199.SZ": {
        "short_name": "HYBIO PHARMACEUTIC",
        "long_name": "Hybio Pharmaceutical Co., Ltd.",
        "summary": "Hybio Pharmaceutical Co., Ltd., a peptide pharmaceutical company, engages in the research and development, manufacture, and sale of polypeptide drugs in the People's Republic of China and internationally. Its peptide finished dosage products include digestive system agents, immune modulators, PTH and Ca metabolic modulators, hormone and endocrine modulators, FD for circulatory and blood systems, antiviral agents, and hemostatic products. The company also provides custom and GMP peptides; and a range of peptide APIs. Hybio Pharmaceutical Co., Ltd. was founded in 1998 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.hybio.com.cn",
        "market_cap": "Mid Cap"
    },
    "300239.SZ": {
        "short_name": "BAOTOU DONGBAO BIO",
        "long_name": "Baotou Dongbao Bio-Tech Co.,Ltd",
        "summary": "Baotou Dongbao Bio-Tech Co., Ltd. engages in the research and development, production, and sale of gelatin and collagen products in the People's Republic of China and internationally. It offers food additive and pharmaceutical gelatin, as well as collagen peptide. The company was founded in 1997 and is based in Baotou, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Baotou",
        "zipcode": "014030",
        "website": "http://www.dongbaoshengwu.com",
        "market_cap": "Mid Cap"
    },
    "300267.SZ": {
        "short_name": "HUNAN ER-KANG PHAR",
        "long_name": "Hunan Er-Kang Pharmaceutical Co., Ltd",
        "summary": "Hunan Er-Kang Pharmaceutical Co., Ltd manufactures and sells APIs, finished drug products, and pharmaceutical excipients in China and internationally. Its APIs include glycerin, dilute hydrochloric acid, dihydroxypropyl theophylline, sulbenicillin sodium, calamine powder, sulfadiazine, sulphaguanidine, TMP, and resorcinol. The company's finished drugs primarily include sulbenicillin sodium for injection and compound liquorice tablets. Its conventional pharmaceutical excipients include pharmaceutical glycerin, medicinal ethanol, medicinal propylene glycol, medicinal sodium hydroxide, and sucrose; and new pharmaceutical excipients comprise hydroxypropyl starch empty capsules, hydroxypropyl starch soft capsules, and citrate and its series products. The company was founded in 2003 and is based in Liuyang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Liuyang",
        "zipcode": null,
        "website": "http://www.hnerkang.com",
        "market_cap": "Mid Cap"
    },
    "300436.SZ": {
        "short_name": "FUJIAN COSUNTER PH",
        "long_name": "Fujian Cosunter Pharmaceutical Co., Ltd.",
        "summary": "Fujian Cosunter Pharmaceutical Co., Ltd. engages in the research and development, manufacture, and sale of pharmaceutical products in China. The company offers crude drugs and solid preparations in the form of tablets, capsules, granules, medicinal teas, etc. for use in the treatment of hepatitis B virus. Its products include Adefovir Dipivoxil and Lamivudine tablets, as well as Entecavir and Tenofovir Disoproxil Fumarate capsules. The company was founded in 2001 and is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350003",
        "website": "http://www.cosunter.com",
        "market_cap": "Mid Cap"
    },
    "300452.SZ": {
        "short_name": "ANHUI SUNHERE PHAR",
        "long_name": "Anhui Sunhere Pharmaceutical Excipients Co.,Ltd.",
        "summary": "Anhui Sunhere Pharmaceutical Excipients Co.,Ltd. manufactures and sells pharmaceutical excipients and professional medicines in China. The company provides cellulose, starch, povidone, stearic acid, coating powder, resin, food additive, and other products. It also exports its products to Europe, the United States, Southeast Asia, and internationally. The company is based in Huainan, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huainan",
        "zipcode": "232007",
        "website": "http://www.shanhe01.com",
        "market_cap": "Mid Cap"
    },
    "300519.SZ": {
        "short_name": "ZHEJIANG XINGUANG",
        "long_name": "Zhejiang Xinguang Pharmaceutical Co., Ltd.",
        "summary": "Zhejiang Xinguang Pharmaceutical Co., Ltd. produces and sells pharmaceutical products in China. The company offers pharmaceutical products in the areas of cardiovascular, orthopedics, health food, respiratory system, digestive system, and urinary system; and products for the removal of heat and toxic substances, as well as tonic and other products. It offers its products in the form of oral solution, troche, capsule, granule, syrup, and bulks. Zhejiang Xinguang Pharmaceutical Co., Ltd. was founded in 1970 and is based in Shengzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shengzhou",
        "zipcode": null,
        "website": "http://www.xgpharma.com",
        "market_cap": "Mid Cap"
    },
    "300534.SZ": {
        "short_name": "GANSU LONGSHENRONG",
        "long_name": "Gansu Longshenrongfa Pharmaceutical Industry Co.,Ltd",
        "summary": "Gansu Longshenrongfa Pharmaceutical Industry Co.,Ltd researches, develops, produces, and sells traditional Chinese medicines. It offers Yuan Hu Zhitong dropping pills for abdominal pain, stomach pain, hypochondriac pain, and headache, as well as to regulate qi and promote blood; Ma Xing Zhi cough capsules for acute and chronic bronchitis and wheezing; Qiwei Wenyang capsules; Xiaoshuan Tongluo and Compound Danshen tablets to promote blood circulation; Astragalus Angelica capsules for radiation hazards; and Citrate bismuth bacteriostatic gels. The company also provides Berberine citrate films for the treatment of cervical erosion; Shu Xinning tablets to improve coronary blood circulation, as well as treat hypertension, coronary heart disease, and angina pectoris; Sanqi injury pills for bruises, rheumatism, joint pain, acute and chronic contusion, and neuralgia; and anti-inflammatory and gallbladder tablets for heat, dampness, and daring treatment. In addition, it offers Pediatric Qingfei Zhike tablets for the treatment of heat, cough, and phlegm; pediatric clearing spirit tablets; and Suanzaoren oil drop pills to regulate blood lipids. The company was founded in 2002 and is based in Lanzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lanzhou",
        "zipcode": null,
        "website": "http://www.lsrfzy.com",
        "market_cap": "Small Cap"
    },
    "300558.SZ": {
        "short_name": "BETTA PHARMACEUTIC",
        "long_name": "Betta Pharmaceuticals Co., Ltd.",
        "summary": "Betta Pharmaceuticals Co., Ltd. researches and develops, manufactures, and markets medicines for the treatment of malignant tumors, diabetes, and cardio-cerebrovascular diseases in China. The company offers Icotinib hydrochloride, an orally administered small-molecule and a reversible tyrosine kinase inhibitor, which is used to treat non-small-cell lung cancer. It is also developing CM082 for treating malignant tumor and eye-ground maculopathy. The company has agreement with Amgen Inc. for marketing Vectibix, an anti-tumor drug in China. Betta Pharmaceuticals Co., Ltd. was founded in 2003 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.bettapharma.com",
        "market_cap": "Large Cap"
    },
    "300584.SZ": {
        "short_name": "NANJING HICIN PHAR",
        "long_name": "Nanjing Hicin Pharmaceutical Co., Ltd.",
        "summary": "Nanjing Hicin Pharmaceutical Co., Ltd. engages in the research, development, manufacture, marketing, and sale of pharmaceutical preparations and synthetic chemicals in China. The company offers antivirals, antibiotics, endocrine drugs, gastrointestinal drugs, orthopedic drugs, drugs for cardio-cerebral system, and immuno-modulate agents. It also provides technical transferring services. The company also exports APIs; omeprazole sodium and cefepime hydrochloride for injections; and lansoprazole tablets to South-Asian countries, South-American countries, and European countries. Nanjing Hicin Pharmaceutical Co., Ltd. was founded in 2003 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210009",
        "website": "http://www.hicin.cn",
        "market_cap": "Mid Cap"
    },
    "300601.SZ": {
        "short_name": "SHENZHEN KANGTAI B",
        "long_name": "Shenzhen Kangtai Biological Products Co., Ltd.",
        "summary": "Shenzhen Kangtai Biological Products Co., Ltd. develops, produces, and sells various types of human vaccines in China. The company's products include cell-free whitebait type b haemophilus combined vaccine, measles rubella combined with live attenuated vaccine, haemophilus influenzae type b conjugate vaccine, recombinant hepatitis B vaccine, hepatitis B vaccine, and other products. Shenzhen Kangtai Biological Products Co., Ltd. has an agreement between YTB and Yong Tai Berhad in relation to the development and commercialization of Covid-19 inactivated vaccine in Malaysia. Shenzhen Kangtai Biological Products Co., Ltd. was founded in 1992 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.biokangtai.com",
        "market_cap": "Large Cap"
    },
    "300630.SZ": {
        "short_name": "HAINAN POLY PHARM",
        "long_name": "Hainan Poly Pharm. Co., Ltd.",
        "summary": "Hainan Poly Pharm. Co., Ltd. researches and develops, produces, and sells pharmaceutical products in China. The company offers APIs. The company offers formulations in various therapeutic areas, which include anti-allergy, non-steroid anti-inflammatory, antibiotic, and digestive drugs. Its products include desloratadine preparations in anti-allergy drugs, diclofenac preparations in non-steroidal anti-inflammatory drugs, azithromycin for injection and clarithromycin preparations in antibiotic drugs, and trimebutine maleate preparations in digestive drugs. Hainan Poly Pharm. Co., Ltd. was founded in 1992 and is based in Haikou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Haikou",
        "zipcode": null,
        "website": "http://english.hnpoly.com",
        "market_cap": "Large Cap"
    },
    "300636.SZ": {
        "short_name": "JIANGXI SYNERGY PH",
        "long_name": "Jiangxi Synergy Pharmaceutical Co., Ltd.",
        "summary": "Jiangxi Synergy Pharmaceutical Co., Ltd. manufactures and sells APIs worldwide. It offers APIs, liquid crystal compounds, and intermediates. The company was founded in 2004 and is headquartered in Yichun, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yichun",
        "zipcode": "330700",
        "website": "http://www.jxsynergy.com",
        "market_cap": "Mid Cap"
    },
    "300683.SZ": {
        "short_name": "WUHAN HITECK BIOLO",
        "long_name": "Wuhan Hiteck Biological Pharma Co., Ltd.",
        "summary": "Wuhan Hiteck Biological Pharma Co., Ltd., a biopharmaceutical company, engages in the research and development, production, and sale of biological engineering products and freeze-dried powder injection primarily in China. Its products include Jinlujie 20ug, a mouse nerve growth factor for injection; and recombinant allosteric human tumor necrosis factor, which is in phase III clinical trial used for the treatment of apoptosis. The company offers its products in the field of nervous system and oncology. Wuhan Hiteck Biological Pharma Co., Ltd. is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430056",
        "website": "http://www.hiteck.com.cn",
        "market_cap": "Mid Cap"
    },
    "300702.SZ": {
        "short_name": "ZHEJIANG TIANYU PH",
        "long_name": "Zhejiang Tianyu Pharmaceutical Co., Ltd.",
        "summary": "Zhejiang Tianyu Pharmaceutical Co., Ltd. engages in the research, development, manufacture, and sale of pharmaceutical intermediates and APIs in China and internationally. The company offers pharmaceutical intermediates and APIs of cardiovascular, anti-diabetic, anti-atherosclerosis, anticoagulant, and anti-asthmatic series. It also provides fine chemicals and CMO services. The company was founded in 1993 and is based in Taizhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taizhou",
        "zipcode": "318020",
        "website": "http://www.tianyupharm.com",
        "market_cap": "Large Cap"
    },
    "300723.SZ": {
        "short_name": "YIPINHONG PHARMACE",
        "long_name": "Yipinhong Pharmaceutical Co.,Ltd",
        "summary": "Yipinhong Pharmaceutical Co.,Ltd, together with its subsidiaries, engages in the research and development, production, and sale of pharmaceutical products. It offers anti-infection, pediatric, cardiovascular, genitourinary, respiratory, liver and digestion, and dermatological products, as well as anti-inflammatory and analgesic products. The company was founded in 2002 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510623",
        "website": "http://www.gdyph.com",
        "market_cap": "Mid Cap"
    },
    "300725.SZ": {
        "short_name": "PHARMABLOCK SCIENC",
        "long_name": "PharmaBlock Sciences (Nanjing), Inc.",
        "summary": "PharmaBlock Sciences (Nanjing), Inc. provides chemistry products and services to pharmaceutical research and development, and commercial production. It offers scaffolds and building blocks; custom synthesis services; and process research and development, as well as manufactures key intermediates and RSMs. The company was founded in 2006 and is based in Nanjing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210032",
        "website": "http://www.pharmablock.com",
        "market_cap": "Large Cap"
    },
    "3692.HK": {
        "short_name": "HANSOH PHARMA",
        "long_name": "Hansoh Pharmaceutical Group Company Limited",
        "summary": "Hansoh Pharmaceutical Group Company Limited, an investment holding company, engages in the research, development, manufacture, marketing, and sale of pharmaceuticals and active pharmaceutical ingredients in the People's Republic of China. The company provides products for therapeutic areas, including central nervous system diseases, oncology, anti-infectives, diabetes, and cardiovascular, as well as gastrointestinal area. Its principal products include Mailingda, a category 1.1 drug for the treatment of chronic myelogenous leukemia; and Ameile, Hansoh Xinfu, Pulaile, Zefei, Xinwei, Xinmei, Xintai, Tanneng, Afatinib Dimaleate, Sunitinib Malate, Oulanning, Ameining, Ailanning, Zetan, Hengjie, Hengsen, Fulaimei, Fulaidi, Fulairui, Ruibote, Zexin, Ruiyisheng, Empagliflozin, and Saxagliptin, which are generic drugs. The company serves pharmaceutical product distributors. It has a strategic collaboration with Viela Bio, Inc. to develop and commercialize inebilizumab for the treatment of autoimmune diseases and hematologic cancers; and strategic collaboration and license agreement with EQRx, INC. to research, develop, manufacture, and commercialize Almonertinib. The company was founded in 1995 and is headquartered in Lianyungang, the People's Republic of China. Hansoh Pharmaceutical Group Company Limited is a subsidiary of Stellar Infinity Company Ltd.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Lianyungang",
        "zipcode": "222069",
        "website": "http://www.hspharm.com",
        "market_cap": "Large Cap"
    },
    "3737.HK": {
        "short_name": "ZHONGZHIPHARM",
        "long_name": "Zhongzhi Pharmaceutical Holdings Limited",
        "summary": "Zhongzhi Pharmaceutical Holdings Limited, an investment holding company, engages in the research, development, manufacture, and sale of pharmaceutical products in the People's Republic of China. It provides Chinese patent medicines and decoction pieces under the Zeus, Liumian, and Caojinghua brands. The company is also involved in the operation of chain and online pharmacies; manufacture and sale of food and Chinese herbs; and property management. As of December 31, 2020, it operated 366 self-operated chain pharmacies, including 325 medical insurance designated pharmacies located in Zhongshan in the Guangdong Province under the Zeus brand. The company was founded in 1993 and is headquartered in Zhongshan, the People's Republic of China. Zhongzhi Pharmaceutical Holdings Limited is a subsidiary of Crystal Talent Investment Group Limited.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zhongshan",
        "zipcode": null,
        "website": "http://www.zeus.cn",
        "market_cap": "Small Cap"
    },
    "3KY.F": {
        "short_name": "HANSOH PHARMAC. HD-,00001",
        "long_name": "Hansoh Pharmaceutical Group Company Limited",
        "summary": "Hansoh Pharmaceutical Group Company Limited, an investment holding company, engages in the research, development, manufacture, marketing, and sale of pharmaceuticals and active pharmaceutical ingredients in the People's Republic of China. The company provides products for therapeutic areas, including central nervous system diseases, oncology, anti-infectives, diabetes, and cardiovascular, as well as gastrointestinal area. Its principal products include Mailingda, a category 1.1 drug for the treatment of chronic myelogenous leukemia; and Ameile, Hansoh Xinfu, Pulaile, Zefei, Xinwei, Xinmei, Xintai, Tanneng, Afatinib Dimaleate, Sunitinib Malate, Oulanning, Ameining, Ailanning, Zetan, Hengjie, Hengsen, Fulaimei, Fulaidi, Fulairui, Ruibote, Zexin, Ruiyisheng, Empagliflozin, and Saxagliptin, which are generic drugs. The company serves pharmaceutical product distributors. It has a strategic collaboration with Viela Bio, Inc. to develop and commercialize inebilizumab for the treatment of autoimmune diseases and hematologic cancers; and strategic collaboration and license agreement with EQRx, INC. to research, develop, manufacture, and commercialize Almonertinib. The company was founded in 1995 and is headquartered in Lianyungang, the People's Republic of China. Hansoh Pharmaceutical Group Company Limited is a subsidiary of Stellar Infinity Company Ltd.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Lianyungang",
        "zipcode": "222069",
        "website": "http://www.hspharm.com",
        "market_cap": "Large Cap"
    },
    "600079.SS": {
        "short_name": "HUMANWELL HEALTHCARE (GROUP) CO",
        "long_name": "Humanwell Healthcare (Group) Co.,Ltd.",
        "summary": "Humanwell Healthcare (Group) Co.,Ltd. provides healthcare solutions in the Asia Pacific, North America, Africa, and internationally. The company offers anesthetic/analgesic products; women's health products for unplanned pregnancy, emergency contraception, and birth control; consumer healthcare products for women; and CNS drugs for bronchitis, migraine, dysmenorrhea, neuralgia, epilepsy, acute and chronic cerebrovascular diseases, and brain injury and peripheral vascular diseases. It also provides herbal medicines for cold and flu, rheumatoid arthritis, skin care, hepatitis, urinary tract infection, and hypomnesis; anti-infection drugs; OTC medicines for digestive disorders, cold and flu, anti-inflammation, anti-infection, and nutritional supplements; and other products targeting cardiovascular, gastrointestinal, and reproductive diseases. The company was formerly known as Wuhan Humanwell Healthcare (Group) Co., Ltd. and changed its name to Humanwell Healthcare (Group) Co.,Ltd. in March 2013. Humanwell Healthcare (Group) Co.,Ltd. was founded in 1993 and is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430075",
        "website": "http://www.humanwell.com.cn",
        "market_cap": "Large Cap"
    },
    "600080.SS": {
        "short_name": "GINWA ENTERPRISE GROUP",
        "long_name": "Ginwa Enterprise (Group) Inc.",
        "summary": "Ginwa Enterprise (Group) Inc. researches, develops, produces, and sells proprietary Chinese, biological, and chemical medicines in China. It offers orthopedic, immune, pediatric, antibiotic, digestive system, gynecological, cardiovascular, antipyretic, analgesic, antiviral, and other products. The company provides its products in the form of capsules, powders, and tablets. Ginwa Enterprise (Group) Inc. is based in Xi'an, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": null,
        "website": "http://www.ginwa.com.cn",
        "market_cap": "Mid Cap"
    },
    "600085.SS": {
        "short_name": "BEIJING TONGRENTANG CO",
        "long_name": "Beijing Tongrentang Co., Ltd",
        "summary": "Beijing Tongrentang Co., Ltd engages in the scientific research, production, sale, and distribution of Chinese medicines in China and internationally. It covers 28 product formulations, such as pills, powders, wines and capsules, oral liquids, and dripping pills with the original powder preparation in the areas of cardiovascular, cerebrovascular, and gynecological diseases, as well as anti-depressive new drugs. The company sells its products under the brand names of Angong Niuhuang Wan, Tongren Dahuo Wan Pills, Tongren Niuhuang Qingxin Pills, Zi Xuesan, National wine, Tongren Wuji Baifeng Pills, Zhuanggu medicinal liquor, Bureau Fang Zhibao, Reconstituted pill, and Yufeng Ningxin Dropping Pills. The company was founded in 1669 and is based in Beijing, China. Beijing Tongrentang Co., Ltd is a subsidiary of China Beijing Tongrentang (Group) Co., Ltd.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100062",
        "website": "http://www.tongrentanggf.com",
        "market_cap": "Large Cap"
    },
    "600129.SS": {
        "short_name": "CHONGQING TAIJI IND",
        "long_name": "Chongqing Taiji Industry(Group) Co.,Ltd",
        "summary": "Chongqing Taiji Industry(Group) Co.,Ltd operates in the pharmaceutical industry in China and internationally. It researches, develops, produces, and sells Chinese medicine and health products. The company offers its products in various dosage forms, including tablets, oral liquids, syrups, dripping pills, granules, capsules, tinctures, powders, etc. It offers its products in various areas, such as digestive system, respiratory system, cardiovascular and cerebrovascular, pediatrics and gynecology, systemic anti-infective drugs, analgesia and antibiotics, orthopedics, cold clearing and cough relief, and endocrine and nervous system drugs. The company is based in Chongqing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "408000",
        "website": "http://www.taiji.com",
        "market_cap": "Large Cap"
    },
    "600195.SS": {
        "short_name": "CHINA ANIMAL HUSBANDRY INDUSTRY",
        "long_name": "China Animal Husbandry Industry Co., Ltd.",
        "summary": "China Animal Husbandry Industry Co., Ltd. manufactures and sells animal health and nutrition products in China. The company offers veterinary drugs and vaccines, veterinary biological products, and feed and feed additives. It also trades in raw materials. The company was founded in 1998 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100070",
        "website": "http://www.cahic.com",
        "market_cap": "Large Cap"
    },
    "600196.SS": {
        "short_name": "SHANGHAI FOSUN PHARMACEUTICAL G",
        "long_name": "Shanghai Fosun Pharmaceutical (Group) Co., Ltd.",
        "summary": "Shanghai Fosun Pharmaceutical (Group) Co., Ltd. researches, develops, manufactures, trades, and sells pharmaceutical products in Mainland China and internationally. It operates in five segments: Pharmaceutical Manufacturing and Research and Development, Healthcare Service, Medical Devices and Medical Diagnosis, Pharmaceutical Distribution and Retail, and Other business Operations. It offers pharmaceutical products in the areas of metabolic and digestive system; antitumor; anti-infective; central nervous system drugs; cardiovascular system; blood system; vaccines; and APIs and intermediates. The company also provides medical diagnosis and medical device products in the field of in vitro diagnostics, the products involve clinical chemistry, clinical immunity, molecular diagnostics, gene chip technology, clinical microbiology, and other fields of laboratory medicine. In addition, it offers medical services in various hospitals. The company was formerly known as Shanghai Fosun Industrial Co. Ltd. and changed its name to Shanghai Fosun Pharmaceutical (Group) Co., Ltd. in December 2004. The company was founded in 1994 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200233",
        "website": "http://www.fosunpharma.com",
        "market_cap": "Large Cap"
    },
    "600211.SS": {
        "short_name": "TIBET RHODIOLA PHARMACEUTICAL H",
        "long_name": "Tibet Rhodiola Pharmaceutical Holding Co.",
        "summary": "Tibet Rhodiola Pharmaceutical Holding Co. engages in the research and development, production, and sale of pharmaceuticals in China. The company offers Tibetan medicines, botanical medicine products, chemical medicine products, and biological products. Tibet Rhodiola Pharmaceutical Holding Co. was founded in 1999 and is based in Lhasa, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lhasa",
        "zipcode": "850000",
        "website": "http://www.xzyy.cn",
        "market_cap": "Large Cap"
    },
    "600216.SS": {
        "short_name": "ZHEJIANG MEDICINE",
        "long_name": "Zhejiang Medicine Co., Ltd.",
        "summary": "Zhejiang Medicine Co., Ltd. produces and sells fat-soluble vitamins, quasi-vitamins, quinolone antibiotics, anti-drug-resistant antibiotics, and other products. The company offers anti-infective drugs, glucosidase inhibitors, and immune suppressants; and human and animal nutrition products. It also provides glycopeptides medicines, natural drugs, and feed additives; and vitamin D3 oil, various vitamin products, and vitamin APIs, as well as biological medicines, pharmaceutical intermediates, and biological pesticides. In addition, the company offers nutriceuticals, such as high-purity synthetic and natural vitamin E, biotin, vitamin A and its derivatives, vitamin d3, and Ã\u009f-carotene; anti-drug-resistant antibiotics, cardiovascular products, and antiviral products, including oncology and anti-infective drugs; nutriceutical soft capsules; and drug products, such as oral solid dosage forms and large volume injections. Further, it engages in the wholesale and retail of medical drugs and apparatus, medical instruments, healthcare products, and food. The company was founded in 1954 and is based in Shaoxing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shaoxing",
        "zipcode": "312366",
        "website": "http://www.china-zmc.com",
        "market_cap": "Large Cap"
    },
    "600222.SS": {
        "short_name": "HENAN TALOPH PHARMACEUTICAL STO",
        "long_name": "Henan Taloph Pharmaceutical Stock Co.,Ltd",
        "summary": "Henan Taloph Pharmaceutical Stock Co., Ltd. researches, produces, and sells Chinese and western medicines in China. It primarily offers its products in the forms of oral liquids, tablets, capsules, fluids, and other forms. The company's principal products include Huperzine A tablets, phenoxybenzamine hydrochloride tablets, pazufloxacin mesylate sodium chloride injections, and various infusion products. It serves hospitals, pharmacies, and patients. The company was formerly known as Henan Joyline & Joysun Pharmaceutical Stock Co., Ltd. Henan Taloph Pharmaceutical Stock Co., Ltd. is based in Zhengzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": "450001",
        "website": "http://www.taloph.com",
        "market_cap": "Mid Cap"
    },
    "600252.SS": {
        "short_name": "GUANGXI WUZHOU ZHONGHENG GROUP ",
        "long_name": "Guangxi Wuzhou Zhongheng Group Co.,Ltd",
        "summary": "Guangxi Wuzhou Zhongheng Group Co., Ltd. researches, develops, manufactures, and sells pharmaceuticals in China. The company offers pills, capsules, and injections and tablets for cardiovascular and cerebrovascular diseases, bruises, gynecological diseases, and respiratory diseases. It also produces health food products under the DOUBLE MONEY brand, as well as health-care functional beverages, smokable turtle pastes, jelly-type turtle paste, etc. The company is based in Wuzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuzhou",
        "zipcode": "543000",
        "website": "http://www.wz-zhongheng.com",
        "market_cap": "Mid Cap"
    },
    "600267.SS": {
        "short_name": "ZHEJIANG HISUN PHARMACEUTICAL C",
        "long_name": "Zhejiang Hisun Pharmaceutical Co., Ltd.",
        "summary": "Zhejiang Hisun Pharmaceutical Co., Ltd. manufactures and supplies pharmaceutical products in China. It provides active pharmaceutical ingredients and finished dosage form products. The company offers products in the areas of anti-tumor, cardiovascular, anti-infective, liver care, orthopedics, anticancer, anti-parasitic, immunosuppressant, etc.; and weight loss, anti-viral, anti-TB, veterinary pharma, and others. It also provides product consultation and CMO/CRO manufacturing services. The company was founded in 1956 and is headquartered in Taizhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taizhou",
        "zipcode": "318000",
        "website": "http://www.hisunpharm.com",
        "market_cap": "Large Cap"
    },
    "600277.SS": {
        "short_name": "ELION CLEAN ENERGY CO LTD",
        "long_name": "Elion Energy Company Limited",
        "summary": "Elion Energy Company Limited manufactures and distributes chemical products in China. It produces and markets polyvinyl chloride, synthetic new materials, caustic soda, liquid chlorine, and other products. The company also focuses on clean energy and environmental protection businesses. Elion Energy Company Limited was founded in 1999 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100026",
        "website": "http://www.elion.cn",
        "market_cap": "Mid Cap"
    },
    "600285.SS": {
        "short_name": "HENAN LINGRUI PHARMACEUTICAL",
        "long_name": "Henan Lingrui Pharmaceutical Co., Ltd.",
        "summary": "Henan Lingrui Pharmaceutical Co., Ltd. produces and sells medicines in China. The company offers its products in ten dosage forms, such as adhesive plasters, tablets, capsules, granules, tinctures, etc. covering approximately 100 product varieties. Its products include Tongluoqutong plasters, Peiyuantongnao capsules, Danlutongdu tablets, stomachache free tablets, Shenqi Hypoglycemic capsules, and others. Henan Lingrui Pharmaceutical Co., Ltd. was founded in 1992 and is based in Xinyang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xinyang",
        "zipcode": "465550",
        "website": "http://www.lingrui.com",
        "market_cap": "Mid Cap"
    },
    "600332.SS": {
        "short_name": "GUANGZHOU BAIYUNSHAN PHARMACEUT",
        "long_name": "Guangzhou Baiyunshan Pharmaceutical Holdings Company Limited",
        "summary": "Guangzhou Baiyunshan Pharmaceutical Holdings Company Limited engages in the research, development, manufacture, and sale of Chinese patent and Western medicines, chemical raw materials, natural and biological medicines, and chemical raw material intermediates in the People's Republic of China and internationally. It operates through four segments: Great Southern TCM, Great Commerce, Great Health, and Others. The company is also involved in the wholesale, retail, import, and export of Western and Chinese medicines, and medical apparatus and instruments; and research and development, production, and sale of beverages, food, healthcare products, pre-packaging food, dairy products, ganoderma spore oil capsules, lozenges, tortoise herb jelly, etc. In addition, it invests in health industry, such as medical care, health management, health preservation, elderly care, etc.; and provides commercial and advertising services. As of December 31, 2020, the company had 141 retail chain pharmacy outlets, which included 27 Cai Zhi Lin pharmacy outlets, 33 Jian Min pharmacy outlets, 36 GPC Prescription Pharmacy outlets, and 24 Hainan Guangyao Chenfei Pharmaceutical Chain outlets, as well as 21 retail stores. The company was formerly known as Guangzhou Pharmaceutical Company Limited and changed its name to Guangzhou Baiyunshan Pharmaceutical Holdings Company Limited in August 2013. Guangzhou Baiyunshan Pharmaceutical Holdings Company Limited was incorporated in 1997 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510130",
        "website": "http://www.gybys.com.cn",
        "market_cap": "Large Cap"
    },
    "600351.SS": {
        "short_name": "YABAO PHARMACEUTICAL GROUP CO L",
        "long_name": "Yabao Pharmaceutical Group Co., Ltd",
        "summary": "Yabao Pharmaceutical Group Co., Ltd researches, develops, manufactures, and sells Chinese and Western medicines, raw materials, pharmaceutical packaging materials, and health care products in China and internationally. The company offers products for children's medication, gynecological, cardiovascular, cerebrovascular, pediatric, and elderly chronic diseases. It provides children's medication drugs under the Ding Gui brand name; gynecological drugs under the 100 Yu brand name; and cardiovascular and cerebrovascular drugs under the Ya Bao brand name. The company offers plastic bottles, cartons, and other pharmaceutical packaging materials. The company offers its products in the form of injections, tablets, capsules, granules, pills, patches, freeze-dried powders, mixtures, suppositories, and solutions. Yabao Pharmaceutical Group Co., Ltd was founded in 1978 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100176",
        "website": "http://www.yabao.com.cn",
        "market_cap": "Mid Cap"
    },
    "600380.SS": {
        "short_name": "JOINCARE PHARMACEUTICAL GROUP I",
        "long_name": "Joincare Pharmaceutical Group Industry Co.,Ltd.",
        "summary": "Joincare Pharmaceutical Group Industry Co., Ltd. researches, develops, produces, sells, and services medicine and health products primarily in China. It also offers proprietary Chinese medicines, testing reagents, monoclonal antibodies, APIs, and chemical preparations. In addition, the company offers traditional Chinese medicine and health food, such as Taitai Oral Liquid, Jingxin Oral Liquid, Dysmenorrhea Oral Liquid, Zhengyuan Dan, Hanlin Qingzhi Capsule, Yike Post, Kungfu V Effervescent Tablets, etc.; Chinese medicine decoction pieces; pharmaceutical products; and Eagle brand health products, which includes American Ginseng series, deer essence, Ganoderma lucidum series, vitamin series, etc. Further, it supplies the intermediates F9 and 4AA; and provides genetic diagnostic reagents for food safety, human major infectious disease prevention and control, animal disease prevention and control, entry and exit inspection, and quarantine. Additionally, the company offers various evaluation devices for the effectiveness of inhalation preparations, respiratory simulators for different populations, dynamic laser diffraction particle size analyzers for inhalation preparations, and other professional analytical instruments, such as HPLC; and food additives, as well as engages in business investment and other businesses. Joincare Pharmaceutical Group Industry Co., Ltd. was founded in 1992 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.joincare.com",
        "market_cap": "Large Cap"
    },
    "600420.SS": {
        "short_name": "SHANGHAI SHYNDEC PHARMACEUTICAL",
        "long_name": "Shanghai Shyndec Pharmaceutical Co., Ltd.",
        "summary": "Shanghai Shyndec Pharmaceutical Co., Ltd. manufactures drug preparation products in China and internationally. It focuses on anti-infection, cardiovascular and cerebrovascular, anti-tumor, leptin drugs, metabolism, and endocrine areas. Shanghai Shyndec Pharmaceutical Co., Ltd. was founded in 1996 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200040",
        "website": "http://www.shyndec.com",
        "market_cap": "Large Cap"
    },
    "600422.SS": {
        "short_name": "KPC PHARMACEUTICALS INC",
        "long_name": "KPC Pharmaceuticals, Inc.",
        "summary": "KPC Pharmaceuticals, Inc., a pharmaceutical company, engages in the research and development, production, marketing, and commercial wholesale of botanical drugs in the People's Republic of China and internationally. It offers artemether, panax notoginseng, and gastrodine series drugs, as well as Chinese medicines and ethnic drugs under the Luotai, Tianxuanqing, Artemedine, Artem, and Arco brand names for treating cardio-cerebral-vascular and nervous system diseases, as well as malaria. The company also provides Dai medicines; antibiotics, chemical medicinal raw materials, chemical pharmaceutical preparations, traditional Chinese medicinal materials, biological products, biochemical drugs, and health foods; Amoxicillin, Cefaclor, Alfacalcidol, Artz, Snaplets, and Ribavirin spray products; glycyrrhizic acid; and GLP-1, a long-acting hypoglycemic drug. It markets artemisinin antimalarials, generic drugs, and medical apparatus. The company was formerly known as Kunming Pharmaceutical Corporation and changed its name to KPC Pharmaceuticals, Inc. in April 2015. KPC Pharmaceuticals, Inc. was founded in 1951 and is based in Kunming, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": "650106",
        "website": "http://www.kpc.com.cn",
        "market_cap": "Mid Cap"
    },
    "600479.SS": {
        "short_name": "ZHUZHOU QIANJIN PHARMACEUTICAL ",
        "long_name": "ZhuZhou QianJin Pharmaceutical Co.,Ltd",
        "summary": "ZhuZhou QianJin Pharmaceutical Co.,Ltd produces and sells pharmaceutical products in China. The company offers gynecology, pediatrics, beauty, antimicrobial, circulatory, endocrine, specialty, digestive, nervous, and cardiovascular products. It also provides health pillows and ginger tea; hygiene products; and wine. The company is based in Zhuzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuzhou",
        "zipcode": "412000",
        "website": "http://www.qjyy.com",
        "market_cap": "Mid Cap"
    },
    "600488.SS": {
        "short_name": "TIANJIN TIANYAO PHARMACEUTICAL ",
        "long_name": "Tianjin Tianyao Pharmaceuticals Co., Ltd.",
        "summary": "Tianjin Tianyao Pharmaceuticals Co., Ltd. engages in the research, manufacture, and export of pharmaceutical APIs in Asia. It primarily provides corticosteroid, cardio cerebrovascular, and analgesic APIs and formulations. The company offers bulk drugs, including dexamethasone, dexamethasone sodium phosphate, dexamethasone acetate, triamcinlone acetonide acetate, prednisone acetate, prednisone, prednisolone, flucinonide, halcinonide, triamcinolone acetonide, clobetasol propionate, betamethasone, methylprednisolone hydrocortisone acetate, methylprednisolone, and triamcinolone. The company is based in Tianjin, China. Tianjin Tianyao Pharmaceuticals Co., Ltd. (SHSE : 600488) operates as a subsidiary of Jinhushen Biomedical Technology Co., Ltd.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300462",
        "website": "http://www.kingyork.biz/tianyaoyaoyeen",
        "market_cap": "Mid Cap"
    },
    "600511.SS": {
        "short_name": "CHINA NATIONAL MEDICINES CORP",
        "long_name": "China National Medicines Corporation Ltd.",
        "summary": "China National Medicines Corporation Ltd., together with its subsidiaries, distributes pharmaceutical and healthcare products in China. The company also provides logistics and warehousing services; and operates a B2B e-commerce platform. It serves hospitals, retail pharmacies, and medical institutions. The company was founded in 1999 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100077",
        "website": "http://www.cncm.com.cn",
        "market_cap": "Large Cap"
    },
    "600513.SS": {
        "short_name": "JIANGSU LIANHUAN PHARMACEUTICAL",
        "long_name": "Jiangsu Lianhuan Pharmaceutical Co., Ltd.",
        "summary": "Jiangsu Lianhuan Pharmaceutical Co., Ltd. manufactures and sells chemical raw materials, preparations, and organic intermediates in China. The company offers urinary system drugs, antihistamines, cardiovascular drugs, steroid hormones, antibiotics, and other products. Its products portfolio comprises eplet, terfenadine, ebastine tablets, felodipine tablets, felodipine sustained-release capsules, simvastatin tablets, danazol capsules and suppositories, metformin gliclazide tablets, lumbrokinase capsules, balofloxacin tablets, and sertraline hydrochloride; and APIs. It exports its products to approximately 20 countries, such as Europe, the United States, Southeast Asia, and Australia. The company was founded in 2000 and is based in Yangzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yangzhou",
        "zipcode": "225009",
        "website": "http://www.lhpharma.com",
        "market_cap": "Mid Cap"
    },
    "600518.SS": {
        "short_name": "KANGMEI PHARMACEUTICAL CO LTD",
        "long_name": "Kangmei Pharmaceutical Co., Ltd.",
        "summary": "Kangmei Pharmaceutical Co., Ltd. produces and sells Chinese medicines in China. It also offers chemical medicines and food products; and operates hospitals and Chinese medicine pharmacies. The company was founded in 1997 and is headquartered in Puning, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Puning",
        "zipcode": "515300",
        "website": "http://www.kangmei.com.cn",
        "market_cap": "Large Cap"
    },
    "600521.SS": {
        "short_name": "ZHEJIANG HUAHAI PHARMACEUTICAL ",
        "long_name": "Zhejiang Huahai Pharmaceutical Co., Ltd.",
        "summary": "Zhejiang Huahai Pharmaceutical Co., Ltd. operates as a pharmaceutical company in China and internationally. The company offers central neurological, cardiovascular, anti-viral, and other products. It also engages in packaging components business, such as high-density polyethylene bottles and polypropylene caps. In addition, the company provides contract manufacturing and other services. Further, it is involved in import and export trade services. Pharmaceutical Co., Ltd. was founded in 1989 and is headquartered in Linhai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Linhai",
        "zipcode": "317024",
        "website": "http://www.huahaipharm.com",
        "market_cap": "Large Cap"
    },
    "600530.SS": {
        "short_name": "SHANGHAI JIAODA ONLLY CO. LTD.",
        "long_name": "Shanghai Jiaoda Onlly Co.,Ltd",
        "summary": "Shanghai Jiaoda Onlly Co., Ltd., together with its subsidiaries, engages in the health-care food business in China. Its health-care food products are used for gastrointestinal function, heart and brain condition improvement, fatigue, and blood lipid and blood sugar, and other health needs. The company also develops commercial residential building projects; offers finance services to small and micro enterprises, and individual clients; and provides natural organic products and technical services for industries involved in natural medicine, functional food, food additives, natural cosmetics, essence, and flavors. Shanghai Jiaoda Onlly Co., Ltd. was founded in 1990 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200030",
        "website": "http://www.onlly.com.cn",
        "market_cap": "Mid Cap"
    },
    "600535.SS": {
        "short_name": "TASLY PHARMACEUTICAL GROUP CO L",
        "long_name": "Tasly Pharmaceutical Group Co., Ltd",
        "summary": "Tasly Pharmaceutical Group Co., Ltd. engages in biological medicine, health, and medical service businesses in China. It offers herbal and chemical medicines, health products, pharmaceutical substances and APIs, herbal extracts, concentrated herbal granules, and tea series products. The company also provides cosmetic series products, including moisture lotions, moisture creams, eye creams, and face washing foams; daily hygiene products, such as sanitary and carefree pads, honey-propolis soaps, and pollen soaps; and medical equipment, which include massage tappers, massage cushions, and circulation machines. It also exports its products to the United States, Russia, and countries in Europe, Africa, and rest of Asia. Tasly Pharmaceutical Group Co., Ltd. was founded in 1994 and is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300410",
        "website": "http://www.tasly.com",
        "market_cap": "Large Cap"
    },
    "600557.SS": {
        "short_name": "JIANGSU KANION PHARMACEUTICAL C",
        "long_name": "Jiangsu Kanion Pharmaceutical Co.,Ltd.",
        "summary": "Jiangsu Kanion Pharmaceutical Co.,Ltd. researches and develops, produces, and sells Chinese medicines. The company was founded in 1975 and is based in Lianyungang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lianyungang",
        "zipcode": null,
        "website": "http://www.kanion.com",
        "market_cap": "Mid Cap"
    },
    "600566.SS": {
        "short_name": "HUBEI JUMPCAN PHARMACEUTICAL CO",
        "long_name": "Hubei Jumpcan Pharmaceutical Co., Ltd.",
        "summary": "Hubei Jumpcan Pharmaceutical Co., Ltd. engages in the research, development, manufacturing, and trading of Chinese traditional medicines, western medicines, daily use chemical based Chinese traditional medicines, and Chinese medicine health products in China. The company offers Chinese and western medicines in the areas of pediatrics, gynecology, pneumology, gastroenterology, and geriatrics; oral and skin care products; and anti-fatigue, anti-aging, antioxidant, and immunity-enhancing Chinese medicine health products. It also develops Chinese and western medicines in the areas of detoxification, digestive system, respiratory system, nervous system, anti-infection, cardiovascular, narcotic analgesic, nutrition, musculoskeletal, and hemostasis. The company was formerly known as Hubei Hongcheng General Machinery Co., Ltd and changed its name to Hubei Jumpcan Pharmaceutical Co., Ltd. in March 2015. Hubei Jumpcan Pharmaceutical Co., Ltd. is based in Taixing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taixing",
        "zipcode": "225441",
        "website": "http://www.jumpcan.com",
        "market_cap": "Large Cap"
    },
    "600568.SS": {
        "short_name": "ZHONG ZHU HEALTHCARE HOLDING CO",
        "long_name": "Zhongzhu Healthcare Holding Co.,Ltd",
        "summary": "Zhongzhu Healthcare Holding Co.,Ltd constructs and develops real estate properties in China. It also produces ophthalmic drugs; researches and develops natural botanical drugs. In addition, it researches and develops drugs, such as recombinant human endostatin adenovirus injection, which is an anticancer gene therapy; Genistein capsule for the treatment of postmenopausal osteoporosis; and motherwort that is primarily a gynecological drug. Further, the company offers medical instruments, including radiation therapy, hyperthermia, phototherapy, and ultrasound diagnosis, as well as develops imaging breast tumor detection systems. Additionally, it offers medical services. The company was formerly known as Zhongzhu Holding Co., Ltd. and changed its name to Zhongzhu Healthcare Holding Co.,Ltd in June 2016. Zhongzhu Healthcare Holding Co.,Ltd was founded in 1970 and is headquartered in Qianjiang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qianjiang",
        "zipcode": null,
        "website": "http://www.zz600568.com",
        "market_cap": "Mid Cap"
    },
    "600594.SS": {
        "short_name": "GUIZHOU YIBAI PHARMACEUTICAL CO",
        "long_name": "Guizhou Yibai Pharmaceutical Co., Ltd.",
        "summary": "Guizhou Yibai Pharmaceutical Co., Ltd. researches, develops, produces, and sells pharmaceutical products in China. It offers products in the form of capsules, tablets, granules, syrups, small-volume injections, freeze-dried powder injections, pills, and oral solutions in the areas of tumor system, cerebrovascular, respiratory system, rheumatism, digestive system, pediatric, gynecological, anti-infection, anti-inflammatory, analgesic, and other diseases. The company was founded in 1995 and is based in Guiyang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guiyang",
        "zipcode": "550008",
        "website": "http://www.gzcci.com",
        "market_cap": "Mid Cap"
    },
    "600664.SS": {
        "short_name": "HARBIN PHARMACEUTICAL GROUP CO ",
        "long_name": "Harbin Pharmaceutical Group Co., Ltd.",
        "summary": "Harbin Pharmaceutical Group Co., Ltd. engages in the research, development, manufacture, and trade of pharmaceuticals in China and internationally. The company operates through seven segments: Antibiotics, Small-Molecular Drug Preparations, OTC and Healthcare Products, Modern Chinese Medicines, Biopharmaceuticals, Animal Vaccines, and Medicine Circulations. It offers a series of penicillin and cephalosporin products, as well as intermediates. The company's lead products include Shuang Huanglian freeze-dried injection; Danshen freeze-dried injection; Shuang Huanglian powder for injection; roxithromycin dispersible tablets; belladonna, sulfamethoxazole, and trimerhoprim tablets; pediatric paracetamol, atificial cow-bezoar, and chlorphenamine maleate granules; Shuanghuanglian oral liquid; and ceftriaxone sodium for injection. Its lead products also comprise amoxicillin capsules, cefotiam hydrochloride for injection, panax ginseng extract, cefepime hydrochloride for injection, cefoperazone sodium for injection, and amoxicillin sodium and clavulanate potassium for injection; cefuroxime, ceftazidime, cefotaxime sodium, and ceftriaxone sodium for injection; and ampicillin capsules. The company is based in Harbin, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": "150070",
        "website": "http://www.hayao.com",
        "market_cap": "Mid Cap"
    },
    "600781.SS": {
        "short_name": "FUREN GROUP PHARMACEUTICAL CO L",
        "long_name": "FUREN Group Pharmaceutical Co., Ltd.",
        "summary": "FUREN Group Pharmaceutical Co., Ltd. primarily engages in the manufacture and distribution of pharmaceuticals in Henan Province and Shanghai, China. The company produces traditional Chinese medicines, such as capsules, tablets, granules, gels, injections, oral liquids, and others. It provides granules for heart attacks; capsules for diabetes and hyperlipidemia; and others. It is also involved in warehousing and trading businesses. The company was founded in 1996 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200031",
        "website": "http://www.shfuren.cn",
        "market_cap": "Mid Cap"
    },
    "600789.SS": {
        "short_name": "SHANDONG LUKANG PHARMACEUTICAL ",
        "long_name": "Shandong Lukang Pharmaceutical Co.,Ltd.",
        "summary": "Shandong Lukang Pharmaceutical Co.,Ltd. manufactures and sells bio-pharmaceuticals and antibiotics in China. The company offers human and animal active pharmaceutical ingredients; human and animal preparations; bio-pesticides; herbal medicines; and amino acid. It is also involved in the sewage treatment, odor control, sewage facilities management, environmental protection material production and sale, and management of water disposal. The company exports its products to approximately 40 countries in Asia, Europe, Africa, and the United States. The company was formerly known as Jining Antibiotic Factory and changed its name to Shandong Lukang Pharmaceutical Co.,Ltd. in October 1993. Shandong Lukang Pharmaceutical Co.,Ltd. was founded in 1966 and is based in Jining, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jining",
        "zipcode": "272021",
        "website": "http://www.lkpc.com",
        "market_cap": "Mid Cap"
    },
    "600829.SS": {
        "short_name": "HPGC RENMINTONGTAI PHARMACEUTIC",
        "long_name": "HPGC Renmintongtai Pharmaceutical Corporation",
        "summary": "HPGC Renmintongtai Pharmaceutical Corporation engages in the wholesale and retail of pharmaceutical products in China and internationally. The company offers Chinese medicines, Chinese herbal medicine, chemical preparations, antibiotics, biological products, and biochemical drugs, as well as medical equipment and health products. It also provides logistics services, including warehousing and distribution; and hospital services comprising medical treatment, scientific research, prevention, health care, rehabilitation, blood purification, and renal disease treatment. In addition, the company offers Chinese and Western medicines, Chinese herbal medicines, nourishing health care products, medical equipment, cosmetics, and daily necessities through an e-commerce platform. It operates 319 chain stores in Heilongjiang Province. The company was founded in 1950 and is headquartered in Harbin, China. HPGC Renmintongtai Pharmaceutical Corporation is a subsidiary of Harbin Pharmaceutical Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": "150071",
        "website": "http://www.hyrmtt.com.cn",
        "market_cap": "Mid Cap"
    },
    "600976.SS": {
        "short_name": "JIANMIN PHARMACEUTICAL GROUP CO",
        "long_name": "Jianmin Pharmaceutical Group Co., Ltd.",
        "summary": "Jianmin Pharmaceutical Group Co., Ltd. manufactures and sells Chinese medicines in China. It offers pediatric drugs under the Jianmin, Longmu, and Yekaitai brands. The company is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": null,
        "website": "http://www.whjm.com",
        "market_cap": "Mid Cap"
    },
    "600993.SS": {
        "short_name": "MAYINGLONG PHARMACEUTICAL GP CO",
        "long_name": "Mayinglong Pharmaceutical Group Co., LTD.",
        "summary": "Mayinglong Pharmaceutical Group Co., Ltd. engages in the manufacture, wholesale, and retail of pharmaceutical products primarily in China. It offers hemorrhoid, gynecological, cough, skin, cosmeceutical, and other products, as well as drugstore and merchants varieties. The company provides its products in various dosage forms comprising ointments, suppositories, tablets, lotions and granules, and creams. It also operates hospitals. Mayinglong Pharmaceutical Group Co., Ltd. was founded in 1582 and is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430064",
        "website": "http://www.mayinglong.cn",
        "market_cap": "Mid Cap"
    },
    "603079.SS": {
        "short_name": "ZHEJIANG SHENGDA BIO-PHARM CO L",
        "long_name": "Zhejiang Shengda Bio-Pharm Co., Ltd.",
        "summary": "Zhejiang Shengda Bio-Pharm Co., Ltd. engages in the research, development, production, and sale of food and feed additives worldwide. The company offers vitamins, such as biotin and folic acid, etc.; biological fresh-keeping agents, including nisin and natamycin; and intermediate APIs. It also produces natural food preservatives. The company is based in Tiantai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tiantai",
        "zipcode": "317200",
        "website": "http://www.sd-pharm.com",
        "market_cap": "Mid Cap"
    },
    "603139.SS": {
        "short_name": "SHAANXI KANGHUI PHARMACEUTICAL ",
        "long_name": "Shaanxi Kanghui Pharmaceutical Co., Ltd.",
        "summary": "Shaanxi Kanghui Pharmaceutical Co., Ltd. researches, develops, produces, and sells pharmaceutical products in China. It offers gynecological, orthopedic, dermatology, diabetes, respiratory, urinary system, gastrointestinal liver and gallbladder, and other drugs in the form of tablets, capsules, granules, and oral liquids. The company is based in Xianyang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xianyang",
        "zipcode": "712000",
        "website": "http://www.sxkh.com",
        "market_cap": "Small Cap"
    },
    "603168.SS": {
        "short_name": "ZHEJIANG SHAPUAISI PHARM CO LTD",
        "long_name": "Zhejiang Shapuaisi Pharmaceutical Co.,Ltd.",
        "summary": "Zhejiang Shapuaisi Pharmaceutical Co.,Ltd. engages in the research and development, production, and sale of pharmaceutical products. The company provides its products to ophthalmology, antipyretic and analgesic, antibacterial anti-inflammatory, endocrine, liver disease adjuvant, cardiovascular, detoxification, diuretic row stone, gynecology, infusion, and jianweixiaosh categories. It offers its products in injections, oral solutions, eye drops, tablets, capsules, suppositories, granules, medicine raw materials, rinsing agents, mixtures, and other dosage forms. Zhejiang Shapuaisi Pharmaceutical Co.,Ltd. was founded in 1978 and is based in Pinghu, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Pinghu",
        "zipcode": null,
        "website": "http://www.zjspas.com",
        "market_cap": "Mid Cap"
    },
    "603367.SS": {
        "short_name": "CISEN PHARMACEUTICAL CO LTD",
        "long_name": "Cisen Pharmaceutical Co., Ltd.",
        "summary": "Cisen Pharmaceutical Co., Ltd., together with its subsidiaries, manufactures and sells chemical drug preparations and health care products in China and internationally. The company's chemical drug preparations include liver disease drugs, antitumor and auxiliary drugs, nutrition preparations, contrast agents, antibiotics, digestive system agents, polypropylene ampoules, and external preparations, as well as sedation anesthesia, cardiovascular, cough and asthma, immunomodulator, infusion, and therapeutic infusion products. It also engages in the formulation, development, manufacturing, and marketing of generic pharmaceutical products. The company was formerly known as Shandong Lukang Cisen Pharmaceutical Co., Ltd. and changed its name to Cisen Pharmaceutical Co., Ltd. in 2011. Cisen Pharmaceutical Co., Ltd. is based in Jining, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jining",
        "zipcode": "272073",
        "website": "http://www.lkcisen.com",
        "market_cap": "Mid Cap"
    },
    "603456.SS": {
        "short_name": "ZHEJIANG JIUZHOU PHARMACEUTICAL",
        "long_name": "Zhejiang Jiuzhou Pharmaceutical Co., Ltd",
        "summary": "Zhejiang Jiuzhou Pharmaceutical Co., Ltd manufactures and sells active pharmaceutical ingredients (API) and intermediates in China and internationally. Its API pipeline comprise central nervous system, non-steroidal, anti-infection, hypoglycemic and antiviral, tumor treatment, and cardiovascular drugs. The company also provides asymmetric catalysts and lithium battery materials. Zhejiang Jiuzhou Pharmaceutical Co., Ltd was founded in 1973 and is based in Taizhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taizhou",
        "zipcode": "318000",
        "website": "http://www.jiuzhoupharma.com",
        "market_cap": "Large Cap"
    },
    "603520.SS": {
        "short_name": "ZHEJIANG STARRY PHARMACEUTICAL ",
        "long_name": "Zhejiang Starry Pharmaceutical Co., Ltd.",
        "summary": "Zhejiang Starry Pharmaceutical Co., Ltd. engages in the research and development, manufacture, and marketing of active ingredient and intermediate X-CT non-ionic contrast agents, and fluoroquinolones in China and internationally. Its contrast medium products include iohexol, iohexol hydrolysate, iohexol iodide, ioversol, iopamidol, iomeprol, iopromide, gadobenate dimeglumine, iodixanol, gadopentetate dimeglumine, and gadoterate meglumine; and fluoroquinolones products comprise levofloxacin hemihydrate, levofloxacin HCL, levofloxacin acid ester, levofloxacin acid, pazufloxacin, and pazufloxacin mesylate. The company was founded in 1997 and is based in Xianju, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xianju",
        "zipcode": "317300",
        "website": "http://www.starrypharm.com",
        "market_cap": "Large Cap"
    },
    "603538.SS": {
        "short_name": "NINGBO MENOVO PHARMACEUTICAL CO",
        "long_name": "Ningbo Menovo Pharmaceutical Co., Ltd.",
        "summary": "Ningbo Menovo Pharmaceutical Co., Ltd. researches, develops, manufactures, and sells pharmaceutical products. It offers APIs, intermediates, and formulations for the treatment of cardiovascular, central nervous, respiratory, antitumor, anti-infection, digestive, geriatric, and antiviral diseases. The company was founded in 2004 and is headquartered in Ningbo, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315040",
        "website": "http://www.menovopharm.com",
        "market_cap": "Mid Cap"
    },
    "603567.SS": {
        "short_name": "HEILONGJIANG ZBD PHARMACEUTICAL",
        "long_name": "Heilongjiang ZBD Pharmaceutical Co., Ltd.",
        "summary": "Heilongjiang ZBD Pharmaceutical Co., Ltd. engages in the research, development, production, and sale of Chinese medicines in China. It offers cardiovascular and cerebrovascular, respiratory system, orthopedics, tumors, digestive system, anti-infection, mental nerve, genitourinary, and other disease fields. The company was founded in 1996 and is based in Hulin, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hulin",
        "zipcode": null,
        "website": "http://www.zbdzy.com",
        "market_cap": "Large Cap"
    },
    "603669.SS": {
        "short_name": "LIONCO PHARMACEUTICAL GROUP CO",
        "long_name": "Lionco Pharmaceutical Group Co., Ltd.",
        "summary": "Lionco Pharmaceutical Group Co., Ltd., together with its subsidiaries, researches, develops, produces, and sells pharmaceuticals in China. The company offers nutrition, antimicrobial, antiviral, digestion, cardiovascular and cerebrovascular, detoxification, anti-tumor, and other products. It also operates research institutes that specialize in the research of chemical drugs, natural medicines, and biological drugs. Lionco Pharmaceutical Group Co., Ltd. was founded in 2003 and is based in Shannan, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shannan",
        "zipcode": "856000",
        "website": "http://www.lingkang.com.cn",
        "market_cap": "Mid Cap"
    },
    "603676.SS": {
        "short_name": "TIBET WEIXINKANG MEDICINE CO LT",
        "long_name": "Tibet Weixinkang Medicine Co., Ltd.",
        "summary": "Tibet Weixinkang Medicine Co., Ltd. engages in the research and development, production, and sale of pharmaceutical products in China. The company's products include parenteral nutrition vitamins, electrolyte supplements, intravenous iron supplements, antibiotics, and medicine for digestive system and liver diseases. It also offers injection multivitamins, potassium magnesium aspartate for injection, iron sucrose injection, potassium aspartate injection, etc. The company was formerly known as Weixinkang Medicine Youxian Gongsi and changed its name to Tibet Weixinkang Medicine Co., Ltd. in 2015. Tibet Weixinkang Medicine Co., Ltd. was founded in 2006 and is headquartered in Lhasa, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lhasa",
        "zipcode": null,
        "website": "http://www.wxkpharma.com",
        "market_cap": "Mid Cap"
    },
    "603707.SS": {
        "short_name": "NANJING KING-FRIEND BIOCHEMICAL",
        "long_name": "Nanjing King-Friend Biochemical Pharmaceutical Co., Ltd",
        "summary": "Nanjing King-Friend Biochemical Pharmaceutical Co., Ltd manufactures and sells heparin sodium and low molecular weight heparin products for pharmaceutical companies in the People's Republic of China. It offers enoxaparin sodium, dalteparin sodium, and naqu heparin calcium injections. The company also exports its products primarily to the European and American countries. The company was founded in 2000 and is based in Nanjing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210061",
        "website": "http://www.nkf-pharma.com",
        "market_cap": "Large Cap"
    },
    "603858.SS": {
        "short_name": "SHANDONG BUCHANG PHARMACEUTICAL",
        "long_name": "Shandong Buchang Pharmaceuticals Co., Ltd.",
        "summary": "Shandong Buchang Pharmaceuticals Co., Ltd. engages in the research and development, production, and sale of medicines in China. It offers medicines to treat cardiac and cerebral vascular, urinary and digestive, respiratory, gynecological, and other diseases, as well as diabetes. The company was founded in 1993 and is based in Heze, China. Shandong Buchang Pharmaceuticals Co., Ltd. is a subsidiary of Shanghai Zhangjiang (Group) Co., Ltd.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Heze",
        "zipcode": "274000",
        "website": "http://www.buchang.com",
        "market_cap": "Large Cap"
    },
    "603998.SS": {
        "short_name": "HUNAN FANGSHENG PHARMACEUTICAL ",
        "long_name": "Hunan Fangsheng Pharmaceutical Co., Ltd.",
        "summary": "Hunan Fangsheng Pharmaceutical Co., Ltd. researches and develops, produces, and sells pharmaceutical products in China. The company offers cardio-cerebrovascular, pediatric, gynecological, orthopedics, traumatology, anti-infective, oncology, digestive system, urinary system, heat-clearing and detoxifying, and other drugs. It is also involved in the wholesale of pharmaceutical products and medical devices; provision of biotechnology related research, consulting, technical transfer, and other technology based services; and research and industrialization of individualized medicine laboratory technology. The company was founded in 2002 and is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": null,
        "website": "http://www.fangsheng.com.cn",
        "market_cap": "Mid Cap"
    },
    "6185.HK": {
        "short_name": "CANSINOBIO-B",
        "long_name": "CanSino Biologics Inc.",
        "summary": "CanSino Biologics Inc. develops, manufactures, and commercializes vaccines in the People's Republic of China. The company develops Ad5-EBOV, an Ebola virus vaccine; and MCV2 and MCV4 vaccines for the prevention of N. meningitides; and DTcP vaccine for infants and DTcP Booster vaccine, which are in Phase I clinical trial for addressing the weaker protection preventing pertussis after primary vaccination. It also develops Tdcp Adolescent and Adult vaccine for treating pertussis; PBPV, a serotype-independent protein-based pneumococcal vaccine that is in Phase I clinical trial; PCV13i, a pneumococcal conjugate vaccine, which is in Phase I clinical trial; TB Booster for the BCG-vaccinated population; and Ad5-nCov, a recombinant novel coronavirus disease vaccine. In addition, the company is developing various preclinical stage products, including DTcP-Hib Combo vaccine; CSB012 to treat adenovirus; CSB013 for ZIKA virus; CSB105 to treat meningitis; CSB016 for treating shingles; and CSB107 for polio. It has a collaboration with The National Research Council of Canada to advance vaccine against COVID-19; and co-development agreement with Precision NanoSystems, Inc. to develop a mRNA lipid nanoparticle vaccine against COVID-19. CanSino Biologics Inc. was founded in 2009 and is headquartered in Tianjin, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": null,
        "website": "http://www.cansinotech.com",
        "market_cap": "Large Cap"
    },
    "688185.SS": {
        "short_name": "CANSINO BIOLOGICS INC",
        "long_name": "CanSino Biologics Inc.",
        "summary": "CanSino Biologics Inc. develops, manufactures, and commercializes vaccines in the People's Republic of China. The company develops Ad5-EBOV, an Ebola virus vaccine; and MCV2 and MCV4 vaccines for the prevention of N. meningitides; and DTcP vaccine for infants and DTcP Booster vaccine, which are in Phase I clinical trial for addressing the weaker protection preventing pertussis after primary vaccination. It also develops Tdcp Adolescent and Adult vaccine for treating pertussis; PBPV, a serotype-independent protein-based pneumococcal vaccine that is in Phase I clinical trial; PCV13i, a pneumococcal conjugate vaccine, which is in Phase I clinical trial; TB Booster for the BCG-vaccinated population; and Ad5-nCov, a recombinant novel coronavirus disease vaccine. In addition, the company is developing various preclinical stage products, including DTcP-Hib Combo vaccine; CSB012 to treat adenovirus; CSB013 for ZIKA virus; CSB105 to treat meningitis; CSB016 for treating shingles; and CSB107 for polio. It has a collaboration with The National Research Council of Canada to advance vaccine against COVID-19; and co-development agreement with Precision NanoSystems, Inc. to develop a mRNA lipid nanoparticle vaccine against COVID-19. CanSino Biologics Inc. was founded in 2009 and is headquartered in Tianjin, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": null,
        "website": "http://www.cansinotech.com",
        "market_cap": "Large Cap"
    },
    "688321.SS": {
        "short_name": "SHENZHEN CHIPSCREEN BIOSCIENCES",
        "long_name": "Shenzhen Chipscreen Biosciences Co., Ltd.",
        "summary": "Shenzhen Chipscreen Biosciences Co., Ltd. engages in the research, development, and sale of original small molecule drugs. The company develops precursor compounds and original new drug product lines that are in various research phase of the specific global intellectual property protection in three areas, such as cancer, metabolic diseases, and autoimmune diseases. Shenzhen Chipscreen Biosciences Co., Ltd. was founded in 2001 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.chipscreen.com",
        "market_cap": "Large Cap"
    },
    "688505.SS": {
        "short_name": "SHANGHAI FUDAN-ZHANGJIAN BIO-PH",
        "long_name": "Shanghai Fudan-Zhangjiang Bio-Pharmaceutical Co., Ltd.",
        "summary": "Shanghai Fudan-Zhangjiang Bio-Pharmaceutical Co., Ltd., together with its subsidiaries, researches, develops, manufactures, and sells bio-pharmaceutical products. It offers genetic engineering platform drugs, including CD30-MMAE, which is in clinical trial Phase I for tumors; Trop 2 antibody-conjugated drug that is in pre-clinical studies for triple negative breast cancer, bladder and gastric cancer, and other tumors; and HER2 antibody-drug conjugate, which is in pre-clinical study for tumors. The company also provides photodynamic technical platform drugs, such as hemoporfin for port wine stain, which is in Phase IV clinical trial; aminolevulinic acid, which is in Phase II clinical trials for cervical diseases infected by HPV; and aminolevulinic acid that is in Phase I clinical trials for acne, as well as completed pre-clinical study for brain gliomas. In addition, it offers nano technical platform drugs comprising Nanoparticle Albumin-bound Paclitaxel that is in pre-clinical studies for tumors, as well as developing Doxorubicin liposome for tumors. Further, the company offers oral solid preparation technology, which includes obeticholic acid for Hepatobiliary disease; and JAK1 inhibitor that is in Phase I clinical trial for rheumatoid arthritis. Additionally, it researches and develops pharmaceutical and medical devices; medical diagnostic products; provides related services; and sells daily necessities, and clinical laboratory analysis instruments and software. It also engages in the technology development, transfer, consulting, and promotion activities; and production of freeze-dried powder injections and APIs, as well as invests in overseas medical projects. The company was founded in 1996 and is based in Shanghai, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201210",
        "website": "http://www.fd-zj.com",
        "market_cap": "Large Cap"
    },
    "688566.SS": {
        "short_name": "JIANGSU JIBEIER PHARMACEUTICAL ",
        "long_name": "JiangsuJibeier Pharmaceutical Co., Ltd.",
        "summary": "Jiangsu Jibeier Pharmaceutical Co., Ltd., a pharmaceutical company, engages in the research, development, production, and sale of chemical preparations, proprietary Chinese medicine preparations, and bulk medicines. The company's products cover various therapeutic areas, such as improving white blood cells, enhancing immunity, treating joint diseases, anti-hypertension, anti-eye infections, treating bronchitis, protecting liver function, etc. It is also developing drugs for the treatment of depression, tumors, stomach diseases, and other diseases. The company was founded in 2001 and is based in Zhenjiang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhenjiang",
        "zipcode": "212000",
        "website": "http://www.jibeier.com.cn",
        "market_cap": "Mid Cap"
    },
    "6896.HK": {
        "short_name": "GOLDEN THROAT",
        "long_name": "Golden Throat Holdings Group Company Limited",
        "summary": "Golden Throat Holdings Group Company Limited, an investment holding company, manufactures and sells pharmaceutical, healthcare food, and other products in the People's Republic of China. It offers Golden Throat lozenges over-the-counter medicine to relive symptoms of sore, dry throat, and hoarse voice caused by acute pharyngitis. It also provides Golden Throat lozenge series products that include Dule lozenges and sugar-free Dule lozenges in various flavors, such as orange, fructus momordicae, chrysanthemum, American ginseng, and hawthorn; Yinxingye tablet that are designed to facilitate blood circulation, remove blood stasis, and dredge energy channels; and herbal vegetable beverages for soothing voice and relieving sore throats. The company also exports its products to the United States, Canada, Russia, Japan, the European Union, Australia, Southeast Asia, the Middle East, Mexico, and Africa. Golden Throat Holdings Group Company Limited was founded in 1956 and is headquartered in Liuzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Liuzhou",
        "zipcode": null,
        "website": "http://www.goldenthroat.com",
        "market_cap": "Small Cap"
    },
    "8049.HK": {
        "short_name": "JILIN CHANGLONG",
        "long_name": "Jilin Province Huinan Changlong Bio-pharmacy Company Limited",
        "summary": "Jilin Province Huinan Changlong Bio-pharmacy Company Limited engages in the manufacture and distribution of Chinese medicines and pharmaceutical products in the People's Republic of China. It offers tablets, capsules, bulk drugs, pills, Chinese medicine pretreatment and extraction products, powders for injections, lyophilized powder for injections, small volume injection solutions, APIs, and granules. The company markets its products under the Changlong and Qing Tong brands. The company was formerly known as Jilin Province Huinan Biochemical Pharmaceutical Company Limited. Jilin Province Huinan Changlong Bio-pharmacy Company Limited was founded in 1989 and is based in Tonghua, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Tonghua",
        "zipcode": "135100",
        "website": "http://www.jlchanglong.com",
        "market_cap": "Small Cap"
    },
    "8329.HK": {
        "short_name": "NEP INTERLONG",
        "long_name": "Shenzhen Neptunus Interlong Bio-technique Company Limited",
        "summary": "Shenzhen Neptunus Interlong Bio-technique Company Limited, together with its subsidiaries, researches, develops, produces, and sells medicines in the People's Republic of China. It is also involved in the purchase, sale, and distribution of medicines and healthcare food products; and research and development of biological technology products and in vitro diagnostic reagents. In addition, the company manufactures herbal medicines, generic drugs, and transfusion products, as well as medical devices. It serves approximately 500 medical organizations. The company is based in Shenzhen, the People's Republic of China. Shenzhen Neptunus Interlong Bio-technique Company Limited is a subsidiary of Shenzhen Neptunus Bio-engineering Company Limited.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518000",
        "website": "http://www.interlong.com",
        "market_cap": "Small Cap"
    },
    "AIDA": {
        "short_name": "AIDA PHARMA INC",
        "long_name": "Aida Pharmaceuticals, Inc.",
        "summary": "Aida Pharmaceuticals, Inc., together with its subsidiaries, engages in the formulation, clinical testing, registration, manufacture, sales, and marketing of pharmaceutical and genetic products in mainland China. It offers antibiotics, cardiovascular, and anti-cancer drugs. The company provides its products in the form of powder for injection; and liquid for intravenous injection, capsule, tablet, and ointment. The company provides Etimicin Sulfate, an injectable powder form, as well as rh-Apo2l, a biopharmaceutical therapy for cancers. Aida Pharmaceuticals, Inc. was founded in 1999 and is headquartered in Hangzhou, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310016",
        "website": null,
        "market_cap": "Small Cap"
    },
    "AOXG": {
        "short_name": "AOXING PHARMACEUTICAL CO INC",
        "long_name": "Aoxing Pharmaceutical Company, Inc.",
        "summary": "Aoxing Pharmaceutical Company, Inc. a specialty pharmaceutical company, engages in research and development, manufacture, and distribution of narcotic, pain-management, and addiction treatment pharmaceutical products primarily in the People's Republic of China. The company's principal products include Zhongtong'an, a capsule of herbal extraction for the indication of oral and dental pain; and Yiqi Qiangshen Granule, an OTC herbal extraction for tonifying qi and empowering body, and promoting blood circulation to remove meridian obstruction, as well as Tilidine hydrochloride, an orally-absorbed synthetic narcotic analgesic tablet used in 50mg or 100mg dosage for relief of acute, moderate to severe pain, and chronic cancer-related pain. Its products under development comprise Oxycodone and Acetaminophen tablets and capsules, which has completed clinical trials for the treatment of acute and chronic pain; Buprenorphine/Naloxone, a sublingual combo tablet that has completed Phase II clinical trials for the treatment of opioid dependence; and Tilidine/Naloxone, a compound capsule which is in Phase II clinical trial to treat acute and chronic pain. The company was formerly known as China Aoxing Pharmaceutical Company, Inc. and changed its name to Aoxing Pharmaceutical Company, Inc. in March 2010. Aoxing Pharmaceutical Company, Inc. is headquartered in Shijiazhuang, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": null,
        "website": "http://axzyen.icm.cn",
        "market_cap": "Small Cap"
    },
    "BFK.SI": {
        "short_name": "Pharmesis Intl",
        "long_name": "Pharmesis International Ltd.",
        "summary": "Pharmesis International Ltd., an investment holding company, researches, develops, produces, sells, and markets western medicines and traditional Chinese medicine (TCM) formulated products for hospitals and medical institutions in the People's Republic of China. The company provides prescribed products and over-the-counter drugs. It offers western medicine products under the brand name of Kinna, including Anethole Trithione for the treatment of illness relating to the liver and gall bladder; Compound Procaine hydrochloride to treat arteriosclerosi, menopausal symptoms, dyspepsia, and adynamia; Lianpushuangqing for acute inflammation; AFenKa to treat migraine, pain, headache, nasosinusitis, cold, muscle pain, menstrual pain, toothache, and arthritis; Xiao Shi Jian Pi to treat flatus, inappetency, dyspepsy, and spleen weakness; and Xiao Luo Tong for the rheumatoid arthritis and other rheumatic diseases treatment. The company also provides TCM formulated products under the Longlife brand name comprising Gulin Gansu for acute and chronic hepatitis treatment; Er Ding granules to treat jaundice, and clear heat and toxics; and Kang Gu Zeng Sheng for boosting the functions of kidney, as well as for increasing blood circulation and alleviating pain. In addition, it offers health supplement products, such as Mei Li Wei Ta to combat aging process and support bone health for women; Hao Xiu Xi to enhance sleep and regulate blood fats; Hao Zhuang Tai to regulate blood fats and fight fatique; and Qianlieman'an for promoting healthy prostate function and colon health, and supporting urinary function, as well as SHULINGHOU for the treatment of acute and chronic pharyngitis, laryngitis, sore throat, and hoarseness. Further, the company engages in the wholesale of chemical drugs, biological raw products, TCM products, antibiotics, and antibiotic agents. Pharmesis International Ltd. was founded in 1996 and is headquartered in the Chengdu, People's Republic of China.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": null,
        "website": "http://www.pharmesis.com",
        "market_cap": "Small Cap"
    },
    "BNIGF": {
        "short_name": "BERONI GROUP LTD",
        "long_name": "Beroni Group Limited",
        "summary": "Beroni Group Limited, together with its subsidiaries, develops and sells smoking control products, air purifiers, water filters, cosmetics, and health care products and supplements in China and Japan. It operates through Nicobloc, Fogibloc Air Purifier, Olansi Water Filter, MRET Water Activator, Health Supplements, Cosmetic products, and Cell Therapies segments. The company's products include NicoBloc, a smoking cessation/harm reduction product; Fogibloc, an air purifier system; and lung cleansing health supplements. It also offers cosmetic products, such as V show rejuvenation liquids, hyaluronic acid moisturizing silk masks, and avocado poly-peptide intensive treatment silk masks. In addition, the company provides fruit and vegetable detoxification machines, and multifunctional dust mite controllers. Further, it offers medical drugs, health foods, supplements, cosmetic products, and household goods under Vitatreal brand and third party brands through its wholesale network to chemists, clinics, dentists, supermarkets, and other retail outlets, as well as its Website. The company has a strategic cooperation agreement with Tianjin University in China to develop a medical solution for the coronavirus. The company was founded in 2014 and is based in Tianjin, the People's Republic of China. Beroni Group Limited is a subsidiary of Beroni Technology Ltd.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300380",
        "website": "http://www.beronigroup.com",
        "market_cap": "Small Cap"
    },
    "BSPM": {
        "short_name": "Biostar Pharmaceuticals, Inc.",
        "long_name": "Biostar Pharmaceuticals, Inc.",
        "summary": "Biostar Pharmaceuticals, Inc. develops, manufactures, and markets over-the-counter (OTC) and prescription pharmaceutical products for various diseases and conditions in the People's Republic of China. The company principally offers Xin Ao Xing Oleanolic Acid capsule, an OTC medicine for chronic hepatitis B. It also provides 12 other OTC products and 17 prescription-based pharmaceuticals. The company's OTC products also comprise Ganwang compound paracetamol and amantadine hydrochloride capsule for the relief of common cold, runny nose, sore throat, headache, and fever; Tianqi Dysmenorrhea capsule, a traditional Chinese medicine used for pain and other symptoms associated with menstruation; Deafness Tongqiao pills for hepatobiliary Huosheng, head swelling, deafness and tinnitus, ear pus, dry stool, and urine-yellow; Wenweishu capsules for the treatment of chronic gastritis and pain of epigastric cold; Zhitongtougu ointment for treating joint pain, swelling, tenderness, or dysfunction; and Chuzhang Zehaifu tablets for cataract. Its prescription pharmaceutical products include Danshen granules; Taohuasan pediatric medicines; Jingang tablets; Danxiang Rhinitis tablets; Yanlixiao capsules; Piracetam tablets; Huangyangning tablets; Hyperthyroidism capsules; Fosfomycin Calcium capsules; Qianlietong capsules; Yituo Erythromycin particles; Danshen tablets; Muxiang Shunqi pills; Sifangwei capsules; and Aspirin Enteric-coated tablets. The company also operates a Website that serves as Internet-based China Hepatitis Internet hospital, which offers HBV patients with information on HBV and treatment options, as well as methods to purchase HBV medicines. Biostar Pharmaceuticals, Inc. sells its products through distributors and a network of sales people in approximately 28 provinces. The company was incorporated in 2007 and is headquartered in Xianyang, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Xianyang",
        "zipcode": "712000",
        "website": "http://biostarpharmaceuticals.com",
        "market_cap": "Small Cap"
    },
    "C1P.F": {
        "short_name": "CONSUN PHARMAC.GR.HD -,10",
        "long_name": "Consun Pharmaceutical Group Limited",
        "summary": "Consun Pharmaceutical Group Limited, an investment holding company, researches and develops, manufactures, and sells Chinese medicines and medical contrast medium products in the People's Republic of China. The company operates in two segments, Consun Pharmaceutical and Yulin Pharmaceutical. It offers uremic clearance granule to treat chronic kidney diseases; Yishen Huashi particles to treat proteinuria; Gadopentetate Dimeglumine injections for magnetic resonance image diagnostics of nervous centralis, stomach, chest, pelvic cavity, and extremities, as well as for renal function assessment; and Iopamidol injections used for neuroradiology, angiography, and urography. The company also provides Yuanli Kang, an iron-dextrin oral solution; Yibao Yua, an erythromycin estolate suspension; Yuantong Ning, a cetirizine hydrochloride oral solution; and Zhixueling capsules to treat hysteromyoma bleeding, prolonged lochiorrhea, intermenstrual bleeding, bleeding after use of a contraceptive ring, hemorrhoidal bleeding, and epistaxis. In addition, it offers Gyn Antidysmenorrheic tablets for the treatment of irregular menstruation, irregular period during perimenopause, and abdominal pain during menstruation due to hepatic depression and blood deficiency; and Antibacterial Fujie lotion for staphylococcus aureus, Candida albicans, and escherichia coli in the feminine vaginal. Further, the company provides bone-setting liquid; Yunxiang analgesic tincture for treatment of rheumatism, common cold, headache, stomachache, cardiodynia, and pain in gastral cavity and chilblain; Sanqi Chuangchun capsules for activating blood circulation and dispersing blood stasis; Shiduqing capsules and tablets, and Paeonol ointment for skin disease. Additionally, it offers hepatobiliary, gastroenterology, and other medicines. The company was founded in 1997 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.chinaconsun.com",
        "market_cap": "Small Cap"
    },
    "C1S.F": {
        "short_name": "CHINA SHINEWAY PHAR.HD-10",
        "long_name": "China Shineway Pharmaceutical Group Limited",
        "summary": "China Shineway Pharmaceutical Group Limited, an investment holding company, engages in the research and development, manufacture, and trade of Chinese medicines in the People's Republic of China and Hong Kong. The company offers modern Chinese medicines in the form of soft capsules, granules, and injections in various therapeutic areas, including cardio-cerebrovascular, antiviral, orthopedics, pediatrics, gynecology, neurology, gastroenterology, ophthalmology, oncology, and immunology. It also trades in agricultural products. The company was incorporated in 2004 and is headquartered in Shijiazhuang, the People's Republic of China. China Shineway Pharmaceutical Group Limited is a subsidiary of Forway Investment Limited.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": "051430",
        "website": "http://www.shineway.com",
        "market_cap": "Small Cap"
    },
    "CASBF": {
        "short_name": "CANSINO BIOLOGICS INC",
        "long_name": "CanSino Biologics Inc.",
        "summary": "CanSino Biologics Inc. develops, manufactures, and commercializes vaccines in the People's Republic of China. The company develops Ad5-EBOV, an Ebola virus vaccine; and MCV2 and MCV4 vaccines for the prevention of N. meningitides; and DTcP vaccine for infants and DTcP Booster vaccine, which are in Phase I clinical trial for addressing the weaker protection preventing pertussis after primary vaccination. It also develops Tdcp Adolescent and Adult vaccine for treating pertussis; PBPV, a serotype-independent protein-based pneumococcal vaccine that is in Phase I clinical trial; PCV13i, a pneumococcal conjugate vaccine, which is in Phase I clinical trial; TB Booster for the BCG-vaccinated population; and Ad5-nCov, a recombinant novel coronavirus disease vaccine. In addition, the company is developing various preclinical stage products, including DTcP-Hib Combo vaccine; CSB012 to treat adenovirus; CSB013 for ZIKA virus; CSB105 to treat meningitis; CSB016 for treating shingles; and CSB107 for polio. It has a collaboration with The National Research Council of Canada to advance vaccine against COVID-19; and co-development agreement with Precision NanoSystems, Inc. to develop a mRNA lipid nanoparticle vaccine against COVID-19. CanSino Biologics Inc. was founded in 2009 and is headquartered in Tianjin, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": null,
        "website": "http://www.cansinotech.com",
        "market_cap": "Large Cap"
    },
    "CJH.F": {
        "short_name": "CANSINO BIOLOGICS H  YC 1",
        "long_name": "CanSino Biologics Inc.",
        "summary": "CanSino Biologics Inc. develops, manufactures, and commercializes vaccines in the People's Republic of China. The company develops Ad5-EBOV, an Ebola virus vaccine; and MCV2 and MCV4 vaccines for the prevention of N. meningitides; and DTcP vaccine for infants and DTcP Booster vaccine, which are in Phase I clinical trial for addressing the weaker protection preventing pertussis after primary vaccination. It also develops Tdcp Adolescent and Adult vaccine for treating pertussis; PBPV, a serotype-independent protein-based pneumococcal vaccine that is in Phase I clinical trial; PCV13i, a pneumococcal conjugate vaccine, which is in Phase I clinical trial; TB Booster for the BCG-vaccinated population; and Ad5-nCov, a recombinant novel coronavirus disease vaccine. In addition, the company is developing various preclinical stage products, including DTcP-Hib Combo vaccine; CSB012 to treat adenovirus; CSB013 for ZIKA virus; CSB105 to treat meningitis; CSB016 for treating shingles; and CSB107 for polio. It has a collaboration with The National Research Council of Canada to advance vaccine against COVID-19; and co-development agreement with Precision NanoSystems, Inc. to develop a mRNA lipid nanoparticle vaccine against COVID-19. CanSino Biologics Inc. was founded in 2009 and is headquartered in Tianjin, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": null,
        "website": "http://www.cansinotech.com",
        "market_cap": "Large Cap"
    },
    "CJH.SG": {
        "short_name": "CanSino Biologics Inc. Register",
        "long_name": "CanSino Biologics Inc.",
        "summary": "CanSino Biologics Inc. develops, manufactures, and commercializes vaccines in the People's Republic of China. The company develops Ad5-EBOV, an Ebola virus vaccine; and MCV2 and MCV4 vaccines for the prevention of N. meningitides; and DTcP vaccine for infants and DTcP Booster vaccine, which are in Phase I clinical trial for addressing the weaker protection preventing pertussis after primary vaccination. It also develops Tdcp Adolescent and Adult vaccine for treating pertussis; PBPV, a serotype-independent protein-based pneumococcal vaccine that is in Phase I clinical trial; PCV13i, a pneumococcal conjugate vaccine, which is in Phase I clinical trial; TB Booster for the BCG-vaccinated population; and Ad5-nCov, a recombinant novel coronavirus disease vaccine. In addition, the company is developing various preclinical stage products, including DTcP-Hib Combo vaccine; CSB012 to treat adenovirus; CSB013 for ZIKA virus; CSB105 to treat meningitis; CSB016 for treating shingles; and CSB107 for polio. It has a collaboration with The National Research Council of Canada to advance vaccine against COVID-19; and co-development agreement with Precision NanoSystems, Inc. to develop a mRNA lipid nanoparticle vaccine against COVID-19. CanSino Biologics Inc. was founded in 2009 and is headquartered in Tianjin, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": null,
        "website": "http://www.cansinotech.com",
        "market_cap": "Large Cap"
    },
    "CPHI": {
        "short_name": "China Pharma Holdings, Inc.",
        "long_name": "China Pharma Holdings, Inc.",
        "summary": "China Pharma Holdings, Inc. develops, manufactures, and markets generic and branded pharmaceutical, and biochemical products primarily to hospitals and private retailers in the People's Republic of China. The company offers products in the form of dry powder injectables, liquid injectables, tablets, capsules, and cephalosporin oral solutions. Its products include Cerebroprotein Hydroloysate injection to treat memory decline and attention deficit; Gastrodin injection for tiredness, loss of concentration, poor sleep, and traumatic syndromes of the brain; Propylgallate and Ozagrel Sodium to treat cerebral thrombosis, coronary heart disease, and after surgery complications; Alginic Sodium Diester injection for ischemic heart, cerebrovascular, and high lipoprotein blood diseases; Bumetanide to treat edema diseases; and Candesartan for hypertension. It also provides Roxithromycin dispersible tablets for pharyngitis and tonsillitis; Cefaclor dispersible tablets for tympanitis, lower respiratory tract infection, urinary tract infections, and skin/skin tissue infection; Cefalexin capsules for acute tonsillitis; Andrographolide for sore throat caused by upper respiratory tract infection; Clarithromycin granules and capsules; and Naproxen Sodium and PseudophedrineHydrochlorida sustained release tablets. In addition, the company offers Hepatocyte growth-promoting factor, Tiopronin, Compound Ammonium Glycyrrhetate S, and Omeparzole for the treatment of digestive diseases. Further, it provides Vitamin B6 injection; Granisetron Hydrochloride injection to treat nausea and vomiting caused by radiotherapy and chemotherapy during the treatment of malignant tumors; Noni Enzyme, a food supplement; sanitizers; and masks. The company offers its products through distributors, as well as through its network of 16 sales offices and approximately 1,000 sales representatives. China Pharma Holdings, Inc. was founded in 1993 and is based in Haikou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "ASE",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Haikou",
        "zipcode": "570216",
        "website": "http://www.chinapharmaholdings.com",
        "market_cap": "Small Cap"
    },
    "GBLP": {
        "short_name": "GLOBAL PHARMATECH INC",
        "long_name": "Global Pharmatech, Inc.",
        "summary": "Global Pharmatech, Inc. engages in the research, production, and development of herbal medicine, bio-medicine, chemical medicine, traditional chinese medicine, and dietary supplements primarily in China. The company's principal product line consists of XS CAPSULE (XIN-SHU) for the treatment of angina and other coronary disease; JUTAI SOFT CAPSULE, a dietary supplement; QINGXUAN ANTI-HYPERTENSION TABLET, an over-the-counter drug product indicated for the treatment of hypertension and high serum cholesterol level; and YANREQING TABLET for the treatment of inflammation. It also manufactures and sells other proprietary drugs, generics, and dietary supplements used to treat symptoms ranging from headaches, coughing, and dry mouth to infections, and numbness of limbs. The company markets its products through distributors, such as wholesale companies and chain store representatives, as well as through its sales force. Global Pharmatech, Inc. was founded in 2001 and is based in Changchun, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": "130 012",
        "website": null,
        "market_cap": "Small Cap"
    },
    "GENX": {
        "short_name": "GENEX PHARMACEUTICALS INC",
        "long_name": "Genex Pharmaceutical, Inc.",
        "summary": "Genex Pharmaceutical, Inc. produces and distributes Reconstituted Bone Xenograft (RBX) in the People's Republic of China. The RBX is a medical device that accelerates bone healing. The company distributes its medical devices to approximately 500 hospitals, as well as to other medical device customers. Genex Pharmaceutical is headquartered in Tianjin City, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Tianjin City",
        "zipcode": "300074",
        "website": null,
        "market_cap": "Small Cap"
    },
    "GPHG": {
        "short_name": "GLOBAL PHARM HLDGS GROUP INC",
        "long_name": "Global Pharm Holdings Group, Inc.",
        "summary": "Global Pharm Holdings Group, Inc., through its subsidiaries, engages in the distribution of pharmaceuticals-related products, Chinese herb cultivation, and preparation of raw materials for medicine in China. It distributes prescription and non-prescription drugs in the form of injections, tablets, pastes, granules, and capsules for various diseases. The company is also involved in the cultivation, processing, and sale of Chinese herbs, such as wild ginseng, chrysanthemum, salvia, angelica, wind, schisandra, rana, etc. In addition, it sells biochemical drugs, cosmetics, pre-packaged food, and medical devices. The company markets its products directly to hospitals, clinics, pharmacies and drugstores, and other healthcare institutions. Global Pharm Holdings Group, Inc. is based in Shenzhen, China. As of December 31, 2018, Global Pharm Holdings Group, Inc. operates as a subsidiary of Fortune Insight Limited.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518026",
        "website": "http://www.globalpharmholdings.com",
        "market_cap": "Small Cap"
    },
    "GU5.F": {
        "short_name": "GUANG.BAIY.PHAR.HO.H YC 1",
        "long_name": "Guangzhou Baiyunshan Pharmaceutical Holdings Company Limited",
        "summary": "Guangzhou Baiyunshan Pharmaceutical Holdings Company Limited engages in the research, development, manufacture, and sale of Chinese patent and Western medicines, chemical raw materials, natural and biological medicines, and chemical raw material intermediates in the People's Republic of China and internationally. It operates through four segments: Great Southern TCM, Great Commerce, Great Health, and Others. The company is also involved in the wholesale, retail, import, and export of Western and Chinese medicines, and medical apparatus and instruments; and research and development, production, and sale of beverages, food, healthcare products, pre-packaging food, dairy products, ganoderma spore oil capsules, lozenges, tortoise herb jelly, etc. In addition, it invests in health industry, such as medical care, health management, health preservation, elderly care, etc.; and provides commercial and advertising services. As of December 31, 2020, the company had 141 retail chain pharmacy outlets, which included 27 Cai Zhi Lin pharmacy outlets, 33 Jian Min pharmacy outlets, 36 GPC Prescription Pharmacy outlets, and 24 Hainan Guangyao Chenfei Pharmaceutical Chain outlets, as well as 21 retail stores. The company was formerly known as Guangzhou Pharmaceutical Company Limited and changed its name to Guangzhou Baiyunshan Pharmaceutical Holdings Company Limited in August 2013. Guangzhou Baiyunshan Pharmaceutical Holdings Company Limited was incorporated in 1997 and is based in Guangzhou, China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510130",
        "website": "http://www.gybys.com.cn",
        "market_cap": "Mid Cap"
    },
    "HAPP": {
        "short_name": "Happiness Biotech Group Limited",
        "long_name": "Happiness Biotech Group Limited",
        "summary": "Happiness Biotech Group Limited engages in the research, development, manufacture, and sale of nutraceutical and dietary supplement products in the People's Republic of China and internationally. The company's product category includes lucidum spore powder, cordyceps mycelia, ejiao solution, American ginseng, and other products. It also offers a range of ganoderma lucidum products, such as essence oil, cleansing milk, shampoo, shower gel, and nourishing cream products under the Cai Zhi Ning brand, as well as edible fungi. In addition, the company provides disinfectants, non-medical face masks, and COVID-19 anti-body testing kits. It sells its products through distributors, large-scale chain drugstores, malls, and supermarkets under the Happiness brand. Happiness Biotech Group Limited was founded in 2004 and is headquartered in Nanping, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Nanping",
        "zipcode": "353200",
        "website": "http://www.happ.org.cn",
        "market_cap": "Small Cap"
    },
    "HUMDF": {
        "short_name": "HUA MEDICINE",
        "long_name": "Hua Medicine (Shanghai) Ltd.",
        "summary": "Hua Medicine (Shanghai) Ltd. operates as a drug development company that focuses on therapies for the treatment of diabetes in China. It develops Dorzagliatin or HMS5552, an oral drug for the treatment of Type 2 Diabetes. The company also offers Dorzagliatin in combination with Metformin that is in Phase I clinical trial. In addition, it provides Dorzagliatin in combination with Sitagliptin, Empagli, Pioglitazone, and Insulin for the treatment of Type 2 diabetes that is in pre-clinical stage. Further, the company is developing mGLUR5 for the treatment of Parkinson's disease levodopa-induced dyskinesia or PD-LID. The company was incorporated in 2011 and is headquartered in Shanghai, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.huamedicine.com",
        "market_cap": "Small Cap"
    },
    "LP6.F": {
        "short_name": "LIVZON PHARMAC. GRP H YC1",
        "long_name": "Livzon Pharmaceutical Group Inc.",
        "summary": "Livzon Pharmaceutical Group Inc. engages in the research, development, production, and distribution of pharmaceutical products in the People's Republic of China. Its products include Ilaprazole enteric coated tablets for the treatment of duodenal ulcers and reflux esophagitis; Laprazole sodium for injection to treat peptic ulcer hemorrhage; Leuprorelin Acetate Microspheres for injection; Urofollitropin for injection to treat anovulation and sufferers; Perospirone Hydrochloride for the treatment of schizophrenia; Anti-viral Granules to treat upper respiratory tract infection and influenza; and Shenqi Fuzheng Injection for the treatment of weakness and tiredness, lassitude, spontaneous sweating, vertigo, and for the patients of lung cancer and stomach cancer. The company also offers active pharmaceutical ingredients (APIs) and intermediates, such as diagnostic kit for IgM/IgG antibody to coronavirus; and diagnostic reagents and equipment, including diagnostic kit for human immunodeficiency virus antibody, diagnostic kit for anti-nuclear antibody panel, and diagnostic kit for tuberculosis specific infected T cells. In addition, it provides biologic products, traditional Chinese drug medicine, biochemical drugs, microbiological preparations, antibiotics, and pharmaceutical raw materials. The company also exports its products. Livzon Pharmaceutical Group Inc. was founded in 1985 and is based in Zhuhai, China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": "519090",
        "website": "http://www.livzon.com.cn",
        "market_cap": "Mid Cap"
    },
    "QLI": {
        "short_name": "Qilian International Holding Gr",
        "long_name": "Qilian International Holding Group Limited",
        "summary": "Qilian International Holding Group Limited engages in the research, development, and production of active pharmaceutical ingredients (APIs) and traditional Chinese medicine derivative (TCMD) products in China. The company offers licorice products, including Gan Di Xin, an antitussive and expectorant medicine; Qilian Shan Licorice Extract, an ingredient for pharmaceutical companies to manufacture traditional licorice tablets; and Qilian Shan licorice liquid extract, a primary ingredient for medical preparation companies to produce compound licorice oral solutions. It also provides Qilian Shan oxytetracycline tablets to prevent and treat a range of diseases in chickens, turkeys, cattle, swine, and human; and Qilian Shan oxytetracycline APIs for pharmaceutical companies to manufacture medications. In addition, the company offers TCMD products, such as Ahan antibacterial paste to treat refractory chronic skin diseases; heparin products, including heparin sodium preparations for pharmaceutical companies to produce medications for cardiovascular diseases, cerebrovascular diseases, and hemodialysis; and sausage casings comprising Zhu Xiaochang sausage casings, which are natural food products for culinary application. Further, it provides Xiongguan organic fertilizers to improve crop yield and soil's chemical properties, and reduce soil compaction; and Xiongguan organic-inorganic compound fertilizers to increased plant growth. The company was incorporated in 2019 and is based in Jiuquan, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Jiuquan",
        "zipcode": "735000",
        "website": "http://www.qlsyy.net",
        "market_cap": "Small Cap"
    },
    "SFOSF": {
        "short_name": "SHANGHAI FOSUN PHARMACEUTICAL G",
        "long_name": "Shanghai Fosun Pharmaceutical (Group) Co., Ltd.",
        "summary": "Shanghai Fosun Pharmaceutical (Group) Co., Ltd. researches, develops, manufactures, trades, and sells pharmaceutical products in Mainland China and internationally. It operates in five segments: Pharmaceutical Manufacturing and Research and Development, Healthcare Service, Medical Devices and Medical Diagnosis, Pharmaceutical Distribution and Retail, and Other business Operations. It offers pharmaceutical products in the areas of metabolic and digestive system; antitumor; anti-infective; central nervous system drugs; cardiovascular system; blood system; vaccines; and APIs and intermediates. The company also provides medical diagnosis and medical device products in the field of in vitro diagnostics, the products involve clinical chemistry, clinical immunity, molecular diagnostics, gene chip technology, clinical microbiology, and other fields of laboratory medicine. In addition, it offers medical services in various hospitals. The company was formerly known as Shanghai Fosun Industrial Co. Ltd. and changed its name to Shanghai Fosun Pharmaceutical (Group) Co., Ltd. in December 2004. The company was founded in 1994 and is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200233",
        "website": "http://www.fosunpharma.com",
        "market_cap": "Large Cap"
    },
    "SXTC": {
        "short_name": "China SXT Pharmaceuticals, Inc.",
        "long_name": "China SXT Pharmaceuticals, Inc.",
        "summary": "China SXT Pharmaceuticals, Inc., a pharmaceutical company, engages in the research, development, manufacture, marketing, and sale of traditional Chinese medicine piece tablets (TCMP) in China. It offers advanced, fine, and regular TCMP products, such as ChenXiang, SanQiFen, HongQi, SuMu, JiangXiang, CuYanHuSuo, XiaTianWu, LuXueJing, XueJie, ChaoSuanZaoRen, HongQuMi, ChuanBeiMu, HuangShuKuiHua, WuWeiZi, DingXiang, RenShen, QingGuo, JueMingZi, and ShaRen. The company provides its products under the Suxuantang, Hui Chun Tang, and Tong Ren Tang brands. As of May 2, 2020, it served 116 pharmaceutical companies, 56 pharmacies, and 76 hospitals. The company was founded in 2005 and is based in Taizhou, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Taizhou",
        "zipcode": "225300",
        "website": "http://www.sxtchina.com",
        "market_cap": "Small Cap"
    },
    "SYUP": {
        "short_name": "ANBC INC",
        "long_name": "ANBC, INC.",
        "summary": "Shanghai Yutong Pharma, Inc. engages in the development, manufacturing, and commercialization of traditional Chinese herbal medicines and biological pharmaceuticals in the People's Republic of China. Its products primarily include Qilisheng a product formulated to be a general health enhancer by fortifying the immune system; Qi-ju-di-huang, an oral solution that protects the kidney and the liver; Qing-re-jie-du, an oral solution that reduces fever and relieves heat; Sheng-mai-yin, a solution that protects energy and enhances body fluids; Xiao-qing-long, an oral solution that relieves cough and dyspnea; Shen-bao, a syrup for the treatment of impotence and spermatorrhoea; Ban-xia, a syrup that relieves cough; and Gan-mao-zhi-ke, a syrup that relieves flu symptoms, cough, and nasal congestion. It also offers Ban-lan-gen that relieves cold and flu symptoms; Gan-mao-qing-re that relieves minor body aches and pains, and reduces fever; Huang-dan-yin-chen used in the treatment for jaundice infection hepatitis; and Liu-shen-qu for treatment of vomitings and dysentery. It offers its products to distributors on a wholesale basis. The company is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201702",
        "website": null,
        "market_cap": "Small Cap"
    },
    "T14.SI": {
        "short_name": "Tianjin ZX USD",
        "long_name": "Tianjin Zhong Xin Pharmaceutical Group Corporation Limited",
        "summary": "Tianjin Zhong Xin Pharmaceutical Group Corporation Limited, together with its subsidiaries, manufactures and sells Chinese herbal medicines, proprietary Chinese medicines, chemical raw materials and preparations, and nutritional and health products primarily in the People's Republic of China. It operates in Chinese Medicine and Western Medicine segments. The company is also involved in the manufacture and sale of Chinese and western pharmaceutical and biological products; wholesale and retail sale of medicines, biochemical pharmaceutical products, and daily use products; and operation of hospitals, as well as offers pharmaceutical consultancy services. In addition, it provides logistics, stocks, equipment installation, and medicine processing services. The company sells its medicinal products under its own brand to the wholesalers; and purchases medicinal products and biological products under other brands from distributors and sells these to other wholesalers. Tianjin Zhong Xin Pharmaceutical Group Corporation Limited was incorporated in 1992 and is based in Tianjin, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300193",
        "website": "http://www.zhongxinp.com",
        "market_cap": "Mid Cap"
    },
    "TNPH": {
        "short_name": "TIAN'AN PHARMACEUTICAL COMPANY ",
        "long_name": "Tian'an Pharmaceutical Co., Ltd.",
        "summary": "Tian'an Pharmaceutical Co., Ltd. develops, manufactures, and sells traditional Chinese herbal medicines, including pallets, hard capsules, and soft ointments for the treatment and prevention of diseases in China. It also engages in the research and development of biology goods and health care products. The company's pharmaceutical and nutraceutical products include Compound Ginseng capsule, a Chinese medicine preparation that is used to cure and treat prostate gland proliferation; Nizhuanle Yin granule, a Chinese medicine preparation that treats the decomposition or inflammation of the stomach's mucous membrane; and Tianan soft capsule, which is used to adjust high amounts of fat in the blood stream, improve blood vessel ventilation, and soften blood vessels. Its products also include Tianan Pain Relief Capsule, a Chinese medicine preparation, which is under development to cure pain in joints, headache, pain from muscle injury, cancer, and gynecological disorders, as well as general pain. Tian' An Pharmaceutical sells its products to independent distributors, who sell products to pharmacies and drugstores, and hospitals. The company was founded in 2003 and is based in Xi'an, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "TYHT": {
        "short_name": "Shineco, Inc.",
        "long_name": "Shineco, Inc.",
        "summary": "Shineco, Inc., through its subsidiaries, produces, distributes, and sells health and well-being focused plant-based products in China. It processes and distributes traditional Chinese herbal medicine products, as well as other pharmaceutical products directly to individual customers. The company also plants, processes, and distributes green and organic vegetables and fruits; and grows, cultivates, and sells yew trees that are used for the production of anti-cancer medication, as well as ornamental bonsai trees for purifying indoor air quality. In addition, it offers logistics services for agricultural products. Further, the company develops, manufactures, and distributes specialized fabrics, textiles, health supplements, and other byproducts derived from an indigenous Chinese plant Apocynum Venetum. The company sells its Chinese medicinal products and western medicines through wholesale customers; and its 13 Ankang retail pharmacies operating under the Sunsimiao Pharmacies name, as well as 66 pharmacies operated by third parties. Shineco, Inc. sells its decoction pieces on the Anhui Bozhou Chinese medicine transaction market to medical materials companies and Chinese patent medicine factories. The company sells its Luobuma textile products online through third party e-commerce websites, as well as through distributors under the Tenethealth brand; and yew trees and agricultural products primarily through its sales personnel, and group and institutional sales. The company was formerly known as Beijing Tenet Jove Technological Development Co., Ltd. and changed its name to Shineco, Inc. in June 2005. Shineco, Inc. was founded in 1997 and is based in Beijing, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100176",
        "website": "http://www.tianyiluobuma.com",
        "market_cap": "Small Cap"
    },
    "XIN.F": {
        "short_name": "SHANDONG XINHUA PHA.H YC1",
        "long_name": "Shandong Xinhua Pharmaceutical Company Limited",
        "summary": "Shandong Xinhua Pharmaceutical Company Limited, through its subsidiaries, develops, manufactures, and sells bulk pharmaceuticals, preparations, and chemical products. It operates through Chemical Bulk Drugs, Preparations, and Chemical Intermediates and Other products. It offers active pharmaceutical ingredients, pharmaceutical preparations, and chemical products, such as antipyretic analgesics; drugs for cardiovascular and cerebrovascular diseases; anti-infectives; drugs for central nervous system diseases; and other drugs under the brand of Xinhua. The company also provides prepared Chinese herbal medicine for decoction, traditional Chinese medicines, chemical raw materials, chemical preparations, antibiotics, biochemical medicines, chemical bulk drugs, anesthetics, anti-psychotic drugs, pharmaceutical precursor chemicals, protein assimilation preparations, peptide hormones, medical toxic drugs, etc. In addition, it offers raw materials and intermediates, powders for injection and tablets, and bulk pharmaceutical and intermediates; tablets, hard capsules, granules, and dry suspension; imports and exports goods and technologies; designs medical projects; develops and sells real estate; and health products research and development activities. Additionally, the company engages in the certification and import and export business; electrical equipment engineering; and installation and testing of chemical equipment and electrical equipment, as well as sales of mechanical, hardware, and electrical equipment. It also provides contract manufacturing services of APIs and pharmaceutical intermediates, as well as OTC and generic products; and internet data services, internet sales, and internet information services for pharmaceuticals and medical devices, etc. The company operates in the People's Republic of China, the Americas, Europe, and internationally. Shandong Xinhua Pharmaceutical Company Limited was founded in 1943 and is based in Zibo, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Zibo",
        "zipcode": "255086",
        "website": "http://www.xhzy.com",
        "market_cap": "Small Cap"
    },
    "XQJ.F": {
        "short_name": "CHINA PHARMA HLDGS DL-001",
        "long_name": "China Pharma Holdings, Inc.",
        "summary": "China Pharma Holdings, Inc. develops, manufactures, and markets generic and branded pharmaceutical, and biochemical products primarily to hospitals and private retailers in the People's Republic of China. The company offers products in the form of dry powder injectables, liquid injectables, tablets, capsules, and cephalosporin oral solutions. Its products include Cerebroprotein Hydroloysate injection to treat memory decline and attention deficit; Gastrodin injection for tiredness, loss of concentration, poor sleep, and traumatic syndromes of the brain; Propylgallate and Ozagrel Sodium to treat cerebral thrombosis, coronary heart disease, and after surgery complications; Alginic Sodium Diester injection for ischemic heart, cerebrovascular, and high lipoprotein blood diseases; Bumetanide to treat edema diseases; and Candesartan for hypertension. It also provides Roxithromycin dispersible tablets for pharyngitis and tonsillitis; Cefaclor dispersible tablets for tympanitis, lower respiratory tract infection, urinary tract infections, and skin/skin tissue infection; Cefalexin capsules for acute tonsillitis; Andrographolide for sore throat caused by upper respiratory tract infection; Clarithromycin granules and capsules; and Naproxen Sodium and PseudophedrineHydrochlorida sustained release tablets. In addition, the company offers Hepatocyte growth-promoting factor, Tiopronin, Compound Ammonium Glycyrrhetate S, and Omeparzole for the treatment of digestive diseases. Further, it provides Vitamin B6 injection; Granisetron Hydrochloride injection to treat nausea and vomiting caused by radiotherapy and chemotherapy during the treatment of malignant tumors; Noni Enzyme, a food supplement; sanitizers; and masks. The company offers its products through distributors, as well as through its network of 16 sales offices and approximately 1,000 sales representatives. China Pharma Holdings, Inc. was founded in 1993 and is based in Haikou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Haikou",
        "zipcode": "570216",
        "website": "http://www.chinapharmaholdings.com",
        "market_cap": "Small Cap"
    }
}