{
    "000526.SZ": {
        "short_name": "XUEDA (XIAMEN) EDU",
        "long_name": "Xueda (Xiamen) Education Technology Group Co., Ltd.",
        "summary": "Xueda (Xiamen) Education Technology Group Co., Ltd. engages in the development, operation, and management of real estate properties. It is involved in the development of residential communities and commercial projects; and sale and lease of commodity housings, office buildings, and commercial plazas. The company was formerly known as Xiamen Unigroup Xue Co., Ltd. and changed its name to Xueda (Xiamen) Education Technology Group Co., Ltd. in April 2021. Xueda (Xiamen) Education Technology Group Co., Ltd. is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Xiamen"
    },
    "002261.SZ": {
        "short_name": "TALKWEB INFORMATIO",
        "long_name": "Talkweb Information System Co.,Ltd.",
        "summary": "Talkweb Information System Co.,Ltd. provides online education and mobile games in China and internationally. It offers Internet-based education services for 0-18 year olds. The company also operates preschool education institutions; and primary schools and middle schools that offer learning management system and personalized learning system, including learning, homework, exams, and assessments, as well as personalized after-school learning services. It has approximately 15000 partnered kindergartens; and 25000 primary and middle schools. The company was founded in 1996 and is headquartered in Changsha, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Changsha"
    },
    "002607.SZ": {
        "short_name": "OFFCN EDUCATION TE",
        "long_name": "Offcn Education Technology Co., Ltd.",
        "summary": "Offcn Education Technology Co., Ltd operates as a full-category vocational education institution in China. The company provides enrollment examination training, academic qualification preparation, and vocational ability training services. IT also offers educational technology consulting, technology development, technology promotion, technology transfer, and technical services; consulting; cultural and corporate management consulting services; corporate investment consulting services; computer technology training services; public relations services; conference services; human resources services; operating telecommunications services; and retail and wholesale publications. Additionally, the company hosts exhibitions, and organizes Cultural and artistic exchange activities. The company is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "0382.HK": {
        "short_name": "EDVANTAGE GROUP",
        "long_name": "Edvantage Group Holdings Limited",
        "summary": "Edvantage Group Holdings Limited, an investment holding company, operates private higher and vocational education institutions in the People's Republic of China and internationally. The company operates Huashang College Guangdong University of Finance and Economics, Guangzhou Huashang Vocational College, and Global Business College of Australia. It also provides management, and education consulting and training services. The company was founded in 2003 and is headquartered in Guangzhou, People's Republic of China. Edvantage Group Holdings Limited is a subsidiary of Debo Education Investments Holdings Limited.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "0T8A.F": {
        "short_name": "TARENA INTL ADR A1 DL-001",
        "long_name": "Tarena International, Inc.",
        "summary": "Tarena International, Inc., through its subsidiaries, provides professional education services through full-time and part-time classes under the Tarena brand in the People's Republic of China. It operates through two segments, Adult Training and Kid Training. The company offers education courses in 7 information technology (IT) subjects, such as Java, software testing, Linux and network engineering, Big Data, Web front-end development, Python, and network engineer courses; and 3 non-IT subjects, including digital art, online sales and marketing, computer-based design courses through live distance instruction, and visual effects-VFX, as well as classroom-based tutoring and online learning modules. It also provides 7 K-12 education programs for children, including computer coding and robotics programming courses under the TongchengTongmei brand. In addition, the company offers online learning platform for education courses and job placement training courses. As of December 31, 2020, it had a network of 104 directly managed learning centers in 45 cities; and 236 TongchengTongmei standalone learning centers in 53 cities. The company was founded in 2002 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "1317.HK": {
        "short_name": "MAPLELEAF EDU",
        "long_name": "China Maple Leaf Educational Systems Limited",
        "summary": "China Maple Leaf Educational Systems Limited, together with its subsidiaries, operates bilingual private schools and preschools in the People's Republic of China and Southeast Asia. The company also offers dual-diploma curriculum, such as British Columbia curriculum and Chinese curriculum; and bilingual education services under the Canadian International School and Kingsley International School names. It operates bilingual private schools and preschools under the Maple Leaf brand name. As of October 15, 2020, the company operated 114 schools, including 18 high schools, 29 middle schools, 32 elementary schools, 32 preschools, and 3 foreign national schools. It also provides construction, technical support, catering, and stationary sales, water, and clothing related services, as well as vocational cultural exchange and overseas study services. China Maple Leaf Educational Systems Limited was founded in 1995 and is headquartered in Dalian, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Dalian"
    },
    "1449.HK": {
        "short_name": "LEADER EDU",
        "long_name": "Leader Education Limited",
        "summary": "Leader Education Limited, an investment holding company, provides private higher education services in the People's Republic of China. The company operates Heilongjiang College in Harbin City, Heilongjiang province that primarily offers undergraduate programs in the areas of engineering, business, railway, economics, literature, and arts. It also provides technical and management consultancy services. Leader Education Limited was founded in 2002 and is headquartered in Harbin, China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Harbin"
    },
    "1525.HK": {
        "short_name": "GENCH EDU",
        "long_name": "Shanghai Gench Education Group Limited",
        "summary": "Shanghai Gench Education Group Limited, an investment holding company, provides higher education services in the People's Republic of China. The company primarily operates a private university in Shanghai. It provides education services to its students with a focus on applied sciences. The company also provides common undergraduate education services. As of September 30, 2019, Shanghai Jian Qiao University offered 54 majors and concentrations in its formal undergraduate program in a range of areas and 13 majors in its junior college program. The company was founded in 1999 and is headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "1565.HK": {
        "short_name": "VIRSCEND EDU",
        "long_name": "Virscend Education Company Limited",
        "summary": "Virscend Education Company Limited, an investment holding company, provides private education services in the People's Republic of China. It operates schools for grades K-12, which include Chengdu Foreign Languages School, Chengdu Experimental Foreign Languages School, Chengdu Experimental Foreign Languages School (Western Campus), the Primary School Attached to Chengdu Foreign Languages School, and Kindergarten of the Primary School attached to Chengdu Jinniu District Foreign Languages School. The company also operates Chengdu Institute Sichuan International Studies University; and offers elementary school education services. As of December 31, 2020, it had an enrollment of approximately 58,245 students, which included 40,688 students in K-12 schools and 17,557 students in the university. Virscend Education Company Limited was founded in 2000 and is headquartered in Chengdu, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Chengdu"
    },
    "1569.HK": {
        "short_name": "MINSHENG EDU",
        "long_name": "Minsheng Education Group Company Limited",
        "summary": "Minsheng Education Group Company Limited, an investment holding company, provides educational services in the People's Republic of China. The company operates seven higher education schools, two secondary vocational schools, and one high schools. It also provides undergraduate and junior college education service; education management and services; disease diagnosis and treatment services; university and college logistics services; rental and business management services; investment management and services; education consulting and management services; and asset management, and project investment and management services. In addition, the company invests in education projects, as well as develops real estate properties. Further, it provides organizing cultural and artistic exchange; advertising; computer animation design; and educational software development and other related services. The company was incorporated in 2005 and is headquartered in Beijing, the People's Republic of China. Minsheng Education Group Company Limited is a subsidiary of Minsheng Group Company Limited.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "1756.HK": {
        "short_name": "HUALI UNIV GP",
        "long_name": "Huali University Group Limited",
        "summary": "Huali University Group Limited, an investment holding company, provides private higher education and vocational education services in the People's Republic of China. The company offers applied science-focused and practice-oriented programs. It also provides student accommodation services. As of August 31, 2020, it had approximately 43,314 students enrolled at its 3 schools. The company was founded in 2000 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "1758.HK": {
        "short_name": "BOJUN EDU",
        "long_name": "Bojun Education Company Limited",
        "summary": "Bojun Education Company Limited, an investment holding company, provides private education services in the People's Republic of China. It operates through two segments, Preschool Education and Degree Education. The company provides education services to kindergarten, as well as preschool, primary, middle, and high schools students. As of September 1, 2020, it operated 13 schools, which include 6 kindergartens, 1 primary and middle school, 2 middle schools, and 1 middle and high school in Chengdu, as well as 1 primary and middle school in Bazhong and Guangyuan, and 1 primary middle and high school in Ziyang. It also offers education consultancy and management, eco-tourism agriculture, and exhibition services. The company was founded in 2001 and is headquartered in Chengdu, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Chengdu"
    },
    "1765.HK": {
        "short_name": "HOPE EDU",
        "long_name": "Hope Education Group Co., Ltd.",
        "summary": "Hope Education Group Co., Ltd. provides higher education services in China. The company provides technician education and training, self-study examination, adult education, technical management and consultancy, and other training services, as well as sells textbooks and dormitory beddings. As of August 31, 2020, it owned and operated 16 schools in 6 provinces, including 6 colleges and universities, 8 junior colleges, and 2 technician colleges. The company was founded in 2007 and is headquartered in Chengdu, China. Hope Education Group Co., Ltd. is a subsidiary of Hope Education Investment Limited.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Chengdu"
    },
    "1773.HK": {
        "short_name": "TIANLI EDU",
        "long_name": "Tianli Education International Holdings Limited",
        "summary": "Tianli Education International Holdings Limited, an investment holding company, provides private education services in China. The company offers K-12 education services; and tutoring services for K-12 students and pre-kindergarten children, as well as management services. As of December 31, 2020, it had a network of 32 K-12 schools, which administered 20 high school programs, 24 middle school programs, 27 elementary school programs, and 7 kindergarten programs; 5 self-owned tutorial centers; and 3 franchised early childhood education centers. The company was founded in 2002 and is headquartered in Chengdu, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Chengdu"
    },
    "1797.HK": {
        "short_name": "KOOLEARN",
        "long_name": "Koolearn Technology Holding Limited",
        "summary": "Koolearn Technology Holding Limited provides online extracurricular education services in China. It operates through three segments: College Education, K12 Education, and Pre-school Education. The College Education segment offers college test preparation and overseas test preparation courses to college students and working professionals. The K12 Education segment provides after-school tutoring courses and preparation courses for high school and national college entrance exams. The Pre-school Education segment offers online educational content delivered through its Donut English-learning and child education apps and Donut live online English classroom courses. The company provides pre-recorded online education packages to institutional customers, including universities, public libraries, telecom operators, and online video streaming service providers. It also provides software and technology, and education advisory services. The company was founded in 2005 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "1851.HK": {
        "short_name": "GINGKO EDU",
        "long_name": "China Gingko Education Group Company Limited",
        "summary": "China Gingko Education Group Company Limited, together with its subsidiaries, provides higher education services on hospitality management in the People's Republic of China. The company operates Yinxing Hospitality Management College of CUIT that offers a range of courses in the management, literature, engineering, education, economics, and arts disciplines. Its college provides 25 bachelor's degree programs and 22 junior college diploma programs to approximately 9,553 students. The company was incorporated in 2018 and is headquartered in Chengdu, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Chengdu"
    },
    "1871.HK": {
        "short_name": "CHINA ORIENTED",
        "long_name": "China Oriented International Holdings Limited",
        "summary": "China Oriented International Holdings Limited, an investment holding company, provides driving training services in the People's Republic of China. It offers driving training services for the preparation of driving tests of large and small vehicles. The company was founded in 2012 and is headquartered in Zhumadian, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Zhumadian"
    },
    "1890.HK": {
        "short_name": "CHINA KEPEI",
        "long_name": "China Kepei Education Group Limited",
        "summary": "China Kepei Education Group Limited, an investment holding company, provides private higher education services focusing on profession-oriented education. It operates Guangdong Polytechnic College, a degree-granting undergraduate-level education institution that offers 41 majors, including 29 undergraduate majors and 20 junior college majors in a range of subject areas. The company also operates Zhaoqing Science and Technology Secondary Vocational School, a secondary vocational school, which provides secondary vocational education in 12 majors comprising automobile servicing, electronic commerce, and electromechanical technology application. As of December 31, 2019, it had an aggregate of 57,924 students enrolled at its schools located in Guangdong Province, the People's Republic of China. The company was founded in 2000 and is headquartered in Zhaoqing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Zhaoqing"
    },
    "18WA.F": {
        "short_name": "GAOTU TECHEDU INC",
        "long_name": "GSX Techedu Inc.",
        "summary": "GSX Techedu Inc., a technology-driven education company, provides online K-12 after-school tutoring services in the People's Republic of China. Its K-12 after-school tutoring courses cover various K-12 academic subjects, including mathematics, English, Chinese, physics, chemistry, biology, history, geography, and political science. The company also provides foreign language courses comprising English and Japanese, as well as English test preparation courses for students taking post-graduate entrance exams; and professional courses primarily for working adults preparing for professional qualification exams, such as teacher's qualification, the Chartered Financial Analyst designation, securities qualification exams, and other exams. In addition, it offers admission courses for admission tests, including national graduate entrance examination, civil service examinations, and others. Further, the company provides other courses, including offline business consulting courses to enhance management skills for principals and other officers of private education institutions; and operates Weishi, an interactive learning platform on WeChat for instructors and students. The company was formerly known as BaiJiaHuLian Group Holdings Limited and changed its name to GSX Techedu Inc. in January 2019. GSX Techedu Inc. was incorporated in 2014 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "1935.HK": {
        "short_name": "JH EDUCATION",
        "long_name": "JH Educational Technology INC.",
        "summary": "JH Educational Technology INC., an investment holding company, provides higher and secondary education, and related management services in the People's Republic of China. It operates and controls three schools, including Zhejiang Changzheng Vocational & Technical College, a junior college offers approximately 38 majors across seven key subject categories; Jingyi Secondary School that provide noncompulsory private education for high school students; and Zhengzhou College of Economics and Business, an undergraduate college provides formal undergraduate education and junior college education. The company also offers technical and management consultancy, and training services. JH Educational Technology INC. was founded in 1997 and is headquartered in Yueqing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Yueqing"
    },
    "1969.HK": {
        "short_name": "CHINA CHUNLAI",
        "long_name": "China Chunlai Education Group Co., Ltd.",
        "summary": "China Chunlai Education Group Co., Ltd., together with its subsidiaries, provides private higher education services in the People's Republic of China. It operates three colleges in Henan Province; one college in Hubei Province; and one college in Jiangsu Province. The company was founded in 2004 and is headquartered in Shangqiu, the People's Republic of China. China Chunlai Education Group Co., Ltd. operates as a subsidiary of Chunlai Investment Co., Limited.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shangqiu"
    },
    "2779.HK": {
        "short_name": "CH XINHUA EDU",
        "long_name": "China Xinhua Education Group Limited",
        "summary": "China Xinhua Education Group Limited provides higher education services in the People's Republic of China. As of December 31, 2018, it invested in operated three educational institutions, which included Xinhua University, an university-level education institution that offers undergraduate, junior college, and continuing education focusing on applied sciences; Xinhua School, a private secondary vocational school, which provides general, undergraduate oriented, and five-year junior college oriented secondary vocational education programs, as well as vocational education programs; and School of Clinical Medicine, an university. The company also offers technical and management consultancy services. China Xinhua Education Group Limited was founded in 1999 and is headquartered in Hefei, China. China Xinhua Education Group Limited is a subsidiary of Wu Junbao Company Limited.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Hefei"
    },
    "2YU.F": {
        "short_name": "CN YUH.ED.CORP. HD-,00001",
        "long_name": "China YuHua Education Corporation Limited",
        "summary": "China YuHua Education Corporation Limited provides education services in the People's Republic of China and Thailand. The company operates through Kindergartens, Grade 1Â\u009612, and University segments. Its services include private education; university education that includes tertiary level education; and K-12 school education, which provides education from kindergarten to high school under the YuHua brand. The company also operates vocational schools. As of August 31, 2020, it operated 26 schools in China and 1 school in Thailand. In addition, the company is involved in the property management business; and provision of research and training services. The company was founded in 2001 and is headquartered in Zhengzhou, the People's Republic of China. China YuHua Education Corporation Limited is a subsidiary of GuangYu Investment Holdings Limited.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Zhengzhou"
    },
    "300282.SZ": {
        "short_name": "SANSHENG INTELLECT",
        "long_name": "Sansheng Intellectual Education Technology CO.,LTD.",
        "summary": "Sansheng Intellectual Education Technology CO.,LTD. engages in the intellectual education, intelligent education equipment, and education service businesses in China and internationally. It offers a cloud-based intellectual education services and personalized training services; and infrared touch interaction products for various industries, such as education, finance, transportation, retail, entertainment, telecommunications, medicine, industrial control, etc. The company was founded in 2003 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "300359.SZ": {
        "short_name": "QTONE EDUCATION GR",
        "long_name": "Qtone Education Group (Guangdong) Co.,Ltd",
        "summary": "Qtone Education Group (Guangdong) Co., Ltd. provides online education services in China. The company offers solutions for regional and single school wisdom education, including education management and teaching applications, as well as education cloud resource pool construction. It also provides continuing education and campus services. The company was formerly known as Guangdong Qtone Education Co., Ltd. and changed its name to Qtone Education Group (Guangdong) Co., Ltd. in July 2016. Qtone Education Group (Guangdong) Co., Ltd. was founded in 2005 and is based in Zhongshan, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Zhongshan"
    },
    "300559.SZ": {
        "short_name": "CHENGDU JIAFAANTA",
        "long_name": "Chengdu Jiafaantai Education Technology Co., Ltd.",
        "summary": "Chengdu Jiafaantai Education Technology Co., Ltd. engages in the research, development, production, and sale of educational information products in China. Its products include national standardization test site construction, classroom total, school resource cloud, teaching management, and wisdom based solutions; teaching recording and broadcasting systems; vehicle wireless cheating signal monitoring and analysis systems; English listening and speaking intelligent solutions; and walking class scheduling systems. The company was formerly known as Chengdu Jiafaantai Technology Co., Ltd and changed its name to Chengdu Jiafaantai Education Technology Co., Ltd. in June 2018. Chengdu Jiafaantai Education Technology Co., Ltd. was founded in 2002 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Chengdu"
    },
    "300864.SZ": {
        "short_name": "ACADEMY OF ENVIRON",
        "long_name": "Academy of Environmental Planning and Design, Co.,Ltd. Nanjing University",
        "summary": "Academy of Environmental Planning and Design, Co.,Ltd. Nanjing University, operates an institute for higher learning and research centers in China and internationally. It provides environmental science research and teaching services. The company offers environmental protection services, including consulting, environmental planning, engineering design, environmental impact assessment, supervision and verification, clean production, water resources demonstration, education and training, etc. for various levels of government and development zones. It also provides services to alumni working in environmental protection related fields. The company is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Nanjing"
    },
    "3978.HK": {
        "short_name": "BESTSTUDY EDU",
        "long_name": "China Beststudy Education Group",
        "summary": "China Beststudy Education Group provides K-12 after-school education services in China. The company offers small group and individualized tutoring services to enhance students' academic performance, which covers academic subjects taught in primary schools, middle schools, and high schools in China; talent education services to cultivate the all-round development of students; and full-time test preparation programs to help middle school and high school graduates achieve admission to their preferred schools. It also provides management consultancy, Internet information, and technical support and development services, as well as engages in investment activities. As of December 31, 2020, it had a total of 268 education centers. China Beststudy Education Group was founded in 1997 and is headquartered in Guangzhou, China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "3IZ.F": {
        "short_name": "ATA CREA.GLO. ADR/2 DL-01",
        "long_name": "ATA Creativity Global",
        "summary": "ATA Creativity Global, together with its subsidiaries, provides educational services to individual students through its training center network in China. The company's educational services include portfolio training, research-based learning, overseas study counselling, K-12 education assessment, and other educational services. It also offers online courses for students. The company was formerly known as ATA Inc. and changed its name to ATA Creativity Global in September 2019. ATA Creativity Global was founded in 1999 and is based in Beijing, China.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "600661.SS": {
        "short_name": "SHANGHAI XINNANYANG ONLY EDUCAT",
        "long_name": "Shanghai Xinnanyang Only Education & Technology Co., Ltd.",
        "summary": "Shanghai Xinnanyang Only Education & Technology Co., Ltd. primarily operates in the education and training sector in the People's Republic of China. The company provides K12 education services, such as middle school curriculum interest training, language training, children education training, adult education training, and education and training consulting services. It also offers vocational education services; management training services, such as corporate, civil service, manufacturing management, and high-end management training services; and international education services. In addition, the company manufactures precision products, such as hydraulic coupling, forging, and bronze products; and invests in, constructs, and operates terrestrial digital television service platforms. The company was founded in 1992 and is based in Shanghai, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "6169.HK": {
        "short_name": "YUHUA EDU",
        "long_name": "China YuHua Education Corporation Limited",
        "summary": "China YuHua Education Corporation Limited provides education services in the People's Republic of China and Thailand. The company operates through Kindergartens, Grade 1Â\u009612, and University segments. Its services include private education; university education that includes tertiary level education; and K-12 school education, which provides education from kindergarten to high school under the YuHua brand. The company also operates vocational schools. As of August 31, 2020, it operated 26 schools in China and 1 school in Thailand. In addition, the company is involved in the property management business; and provision of research and training services. The company was founded in 2001 and is headquartered in Zhengzhou, the People's Republic of China. China YuHua Education Corporation Limited is a subsidiary of GuangYu Investment Holdings Limited.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Zhengzhou"
    },
    "9616.HK": {
        "short_name": "NEUEDU",
        "long_name": "Neusoft Education Technology Co. Limited",
        "summary": "Neusoft Education Technology Co. Limited provides digital IT higher education services in the People's Republic of China. It offers full-time formal higher education services, continuing education services, and education resources and apprenticeship programmes in the areas of computer science, electronic information, digital media, information management service, and healthcare technology. The company was founded in 2000 and is headquartered in Dalian, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Dalian"
    },
    "9986.HK": {
        "short_name": "DASHAN EDU",
        "long_name": "Dashan Education Holdings Limited",
        "summary": "Dashan Education Holdings Limited provides primary and secondary after-school education services in Zhengzhou, China. The company offers online merge offline after-school education services, which supplement primary and secondary school students regular English, Chinese, mathematics, and other curriculum at school. As of December 31, 2020, it operates 99 self-operated teaching centers; and 9 franchisees. The company also sells books and teaching materials; and offers brand name licensing and advisory services. Dashan Education Holdings Limited was incorporated in 1998 and is headquartered in Zhengzhou, China. Dashan Education Holdings Limited operates as a subsidiary of Lucky Heaven International Limited.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Zhengzhou"
    },
    "9CK.F": {
        "short_name": "CHINA KEPEI ED. DL-,00001",
        "long_name": "China Kepei Education Group Limited",
        "summary": "China Kepei Education Group Limited, an investment holding company, provides private higher education services focusing on profession-oriented education. It operates Guangdong Polytechnic College, a degree-granting undergraduate-level education institution that offers 41 majors, including 29 undergraduate majors and 20 junior college majors in a range of subject areas. The company also operates Zhaoqing Science and Technology Secondary Vocational School, a secondary vocational school, which provides secondary vocational education in 12 majors comprising automobile servicing, electronic commerce, and electromechanical technology application. As of December 31, 2019, it had an aggregate of 57,924 students enrolled at its schools located in Guangdong Province, the People's Republic of China. The company was founded in 2000 and is headquartered in Zhaoqing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Zhaoqing"
    },
    "AACG": {
        "short_name": "ATA Creativity Global",
        "long_name": "ATA Creativity Global",
        "summary": "ATA Creativity Global, together with its subsidiaries, provides educational services to individual students through its training center network in China. The company's educational services include portfolio training, research-based learning, overseas study counselling, K-12 education assessment, and other educational services. It also offers online courses for students. The company was formerly known as ATA Inc. and changed its name to ATA Creativity Global in September 2019. ATA Creativity Global was founded in 1999 and is based in Beijing, China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NGM",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "AMBO": {
        "short_name": "Ambow Education Holding Ltd. Am",
        "long_name": "Ambow Education Holding Ltd.",
        "summary": "Ambow Education Holding Ltd. provides educational and career enhancement services and products to students, recent graduates, and corporate employees and management in the People's Republic of China. The company operates through two segments, K-12 Schools and CP&CE Programs. The K-12 Schools segment provides educational services covering K-12 programs and tutoring services; and international education programs. The CP&CE Programs segment operates tutoring centers that provide classroom instruction, small class, and one-on-one tutoring services for students to perform better in school and prepare for important tests, primarily high school and university entrance exams; and educational curriculum through its web-based applications. This segment also offers educational software products include eBoPo, which offers full subjects, online practice tests, and instructions for K-12 level students; career enhancement services and products focusing on improving educational opportunities for primary and advanced degree school students, and employment opportunities for university graduates; and outbound and in-house management trainings for corporate clients. In addition, this segment provides students with training for professional skills, such as case studies, job environment simulation, and technical skills; soft skills, including time management, presentation, leadership, and interview techniques; and intellectualized operational services to corporate clients, colleges, and universities. As of December 31, 2019, the company had 60 centers and schools comprising 3 K-12 schools, 25 tutoring centers, 26 training offices, 5 career enhancement centers, and 1 career enhancement college. The company was founded in 2000 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "ASE",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "BEDU": {
        "short_name": "Bright Scholar Education Holdin",
        "long_name": "Bright Scholar Education Holdings Limited",
        "summary": "Bright Scholar Education Holdings Limited, an education service provider, operates and provides K-12 schools and complementary education services in China and internationally. Its schools comprise international and bilingual schools, and kindergartens. The company also offers a range of complementary education services, including international camps and after-school programs, as well as international education consulting services. As of August 31, 2020, it operated 94 schools across 12 provinces in China, as well as 8 schools internationally with a total student capacity of 75,311 students. Bright Scholar Education Holdings Limited was founded in 1994 and is based in Foshan, China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Foshan"
    },
    "BSK.F": {
        "short_name": "BR.SCH.ED.HLD.SP.ADR CL.A",
        "long_name": "Bright Scholar Education Holdings Limited",
        "summary": "Bright Scholar Education Holdings Limited, an education service provider, operates and provides K-12 schools and complementary education services in China and internationally. Its schools comprise international and bilingual schools, and kindergartens. The company also offers a range of complementary education services, including international camps and after-school programs, as well as international education consulting services. As of August 31, 2020, it operated 94 schools across 12 provinces in China, as well as 8 schools internationally with a total student capacity of 75,311 students. Bright Scholar Education Holdings Limited was founded in 1994 and is based in Foshan, China.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Foshan"
    },
    "C4GA.F": {
        "short_name": "CHINA ONL.ED.SP.ADR A  15",
        "long_name": "China Online Education Group",
        "summary": "China Online Education Group, through its subsidiaries, provides online English language education services to students in the People's Republic of China and the Philippines. The company operates online and mobile education platforms that enable students to take live interactive English lessons with international foreign teachers. Its flagship courses include Classic English Junior and Classic English for the development of English communication skills. It also offers American Academy and Small Class courses; 51 Talk New Concept English course; and various specialty courses, such as Business English, IELTS Speaking, Free-talk, Interview English, Travel English, and Daily English for situation-based English education. China Online Education Group was founded in 2011 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "CATG": {
        "short_name": "CAPSTONE TECHNOLOGIES GROUP INC",
        "long_name": "Capstone Technologies Group, Inc.",
        "summary": "China Bilingual Technology & Education Group Inc., an education company, owns and operates K-12 private boarding schools in Shanxi and Sichuan Provinces, the People's Republic of China. The company operates 3 schools comprising kindergarten, elementary, and middle and high school levels with approximately 14,583 students, and 1,876 faculty and staff. It also provides high education to its students with focusing on cultural skills in Chinese and English, as well as curriculum. The company was founded in 1998 and is based in Taiyuan, the People's Republic of China. As of December 6, 2016, China Bilingual Technology & Education Group Inc. operates as a subsidiary of Capstone Technologies, Inc..",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Taiyuan"
    },
    "CLEU": {
        "short_name": "China Liberal Education Holding",
        "long_name": "China Liberal Education Holdings Limited",
        "summary": "China Liberal Education Holdings Limited provides educational services and products under the China Liberal brand name in China. The company offers Sino-foreign jointly managed and delivered academic programs, including undergraduate and postgraduate education; and diploma and non-degree higher education, and senior secondary education programs in the areas of languages, liberal arts, and businesses. It also provides overseas study consulting and technological consulting services for Chinese universities to enhance their campus information and data management system, as well as to optimize their teaching, operating, and management environment. The company's consulting services include campus intranet solution buildout, school management software customization, smart devices, installation and testing, and school management data collection and analysis. In addition, it develops and provides textbooks and other course materials to students enrolled under the Sino-foreign Jointly Managed Academic Programs, as well as offers job readiness training to graduating students. The company was founded in 2011 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "CML1.F": {
        "short_name": "CHINA MAPLE LE.ED.HD,0005",
        "long_name": "China Maple Leaf Educational Systems Limited",
        "summary": "China Maple Leaf Educational Systems Limited, together with its subsidiaries, operates bilingual private schools and preschools in the People's Republic of China and Southeast Asia. The company also offers dual-diploma curriculum, such as British Columbia curriculum and Chinese curriculum; and bilingual education services under the Canadian International School and Kingsley International School names. It operates bilingual private schools and preschools under the Maple Leaf brand name. As of October 15, 2020, the company operated 114 schools, including 18 high schools, 29 middle schools, 32 elementary schools, 32 preschools, and 3 foreign national schools. It also provides construction, technical support, catering, and stationary sales, water, and clothing related services, as well as vocational cultural exchange and overseas study services. China Maple Leaf Educational Systems Limited was founded in 1995 and is headquartered in Dalian, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Dalian"
    },
    "COE": {
        "short_name": "China Online Education Group",
        "long_name": "China Online Education Group",
        "summary": "China Online Education Group, through its subsidiaries, provides online English language education services to students in the People's Republic of China and the Philippines. The company operates online and mobile education platforms that enable students to take live interactive English lessons with international foreign teachers. Its flagship courses include Classic English Junior and Classic English for the development of English communication skills. It also offers American Academy and Small Class courses; 51 Talk New Concept English course; and various specialty courses, such as Business English, IELTS Speaking, Free-talk, Interview English, Travel English, and Daily English for situation-based English education. China Online Education Group was founded in 2011 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "EDTK": {
        "short_name": "Skillful Craftsman Education Te",
        "long_name": "Skillful Craftsman Education Technology Limited",
        "summary": "Skillful Craftsman Education Technology Limited provides vocational online education and technology services to college students and graduates in the People's Republic of China. Its education services cover a range of subjects, including vocational, continuing, and basic education, as well as higher education. It operates three education platforms, including the Lifelong Education Public Service Platform that offers approximately 200 courses; Vocational Training platform, which provides 407 courses covering such as mechanics, electronics, auto repair, and construction subjects; and Virtual Simulation Experimental Training platform that offers 9 experimental programs. The company also offers technology services, including software development and maintenance, hardware installation, and testing and related consulting and training services, as well as cloud services for private companies, academic institutions, and government agencies. Skillful Craftsman Education Technology Limited was founded in 2013 and is headquartered in Wuxi, China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Wuxi"
    },
    "EDU": {
        "short_name": "New Oriental Education & Techno",
        "long_name": "New Oriental Education & Technology Group Inc.",
        "summary": "New Oriental Education & Technology Group Inc. provides private educational services under the New Oriental brand in the People's Republic of China. It operates through K-12 AST, Test Preparation and Other Courses; and Others segments. The company offers test preparation courses to students taking language and entrance exams used by educational institutions in the United States, the People's Republic of China, and the Commonwealth countries; and after-school tutoring courses for middle and high school students to enhance their exam scores, as well as for children to teach English. It also provides language training courses, including English, as well as other foreign languages, such as German, Japanese, French, Korean, Italian, and Spanish; operates a full-time private primary and secondary school in Yangzhou seeking a full curriculum with a focus on English; develops and edits educational materials for language training and test preparation; and offers online education programs that include college, K-12, and pre-school education. In addition, the company offers overseas studies consulting and overseas study tour services. As of May 31, 2020, it offered educational programs, services, and products to students through a network of 104 schools, 1,361 learning centers, and 12 bookstores. The company was founded in 1993 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "EDUN.MX": {
        "short_name": "NEW ORIENTAL ED & TECHNOLOGY GP",
        "long_name": "New Oriental Education & Technology Group Inc.",
        "summary": "New Oriental Education & Technology Group Inc. provides private educational services under the New Oriental brand in the People's Republic of China. It operates through K-12 AST, Test Preparation and Other Courses; and Others segments. The company offers test preparation courses to students taking language and entrance exams used by educational institutions in the United States, the People's Republic of China, and the Commonwealth countries; and after-school tutoring courses for middle and high school students to enhance their exam scores, as well as for children to teach English. It also provides language training courses, including English, as well as other foreign languages, such as German, Japanese, French, Korean, Italian, and Spanish; operates a full-time private primary and secondary school in Yangzhou seeking a full curriculum with a focus on English; develops and edits educational materials for language training and test preparation; and offers online education programs that include college, K-12, and pre-school education. In addition, the company offers overseas studies consulting and overseas study tour services. As of May 31, 2020, it offered educational programs, services, and products to students through a network of 104 schools, 1,361 learning centers, and 12 bookstores. The company was founded in 1993 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "MXN",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "city": "Beijing"
    },
    "FEDU": {
        "short_name": "Four Seasons Education (Cayman)",
        "long_name": "Four Seasons Education (Cayman) Inc.",
        "summary": "Four Seasons Education (Cayman) Inc., together with its subsidiaries, provides after-school education services focusing on math education for kindergarten, elementary and middle school students in the People's Republic of China. The company's education services comprise standard programs; personalized Ivy programs; and special programs, including workshops on specific math topics and courses delivered to K-12 schools. As of February 28, 2020, the company operated 53 learning centers in 11 cities in China. Four Seasons Education (Cayman) Inc. was founded in 2007 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    },
    "FHS": {
        "short_name": "First High-School Education Gro",
        "long_name": "First High-School Education Group Co., Ltd.",
        "summary": "First High-School Education Group Co., Ltd. operates private high schools in Western China. It provides private fundamental education and complementary education services, including middle and high school, and tutorial school. The company was founded in 2012 and is based in Kunming, China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Kunming"
    },
    "GSX": {
        "short_name": "GSX Techedu Inc.",
        "long_name": "GSX Techedu Inc.",
        "summary": "GSX Techedu Inc., a technology-driven education company, provides online K-12 after-school tutoring services in the People's Republic of China. Its K-12 after-school tutoring courses cover various K-12 academic subjects, including mathematics, English, Chinese, physics, chemistry, biology, history, geography, and political science. The company also provides foreign language courses comprising English and Japanese, as well as English test preparation courses for students taking post-graduate entrance exams; and professional courses primarily for working adults preparing for professional qualification exams, such as teacher's qualification, the Chartered Financial Analyst designation, securities qualification exams, and other exams. In addition, it offers admission courses for admission tests, including national graduate entrance examination, civil service examinations, and others. Further, the company provides other courses, including offline business consulting courses to enhance management skills for principals and other officers of private education institutions; and operates Weishi, an interactive learning platform on WeChat for instructors and students. The company was formerly known as BaiJiaHuLian Group Holdings Limited and changed its name to GSX Techedu Inc. in January 2019. GSX Techedu Inc. was incorporated in 2014 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "H0X.SG": {
        "short_name": "Hailiang Education Group Inc. R",
        "long_name": "Hailiang Education Group Inc.",
        "summary": "Hailiang Education Group Inc. provides K-12 educational services in the People's Republic of China. The company operates 9 affiliated schools; and 28 managed schools. It also offers management consulting, educational training and logistic, overseas study consulting, hotel management, study trip, transportation, branding, academic management, education resources, school culture, admission, finance, human resources, procurement, IT, internal audit, and property management services, as well as after-school enrichment program. In addition, the company's schools offer basic educational and international programs at the primary school, middle school, and high school levels, as well as courses designed for students, such as A-levels courses for the United Kingdom universities, SAT courses for the United States universities, and VCE courses for the Australia universities for students planning to apply to undergraduate programs in the United States, the United Kingdom, and Australia. As of June 30, 2020, it had 23,716 students enrolled in its affiliated schools; and 42,628 students enrolled in its managed schools. Hailiang Education Group Inc. was founded in 1995 and is based in Hangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "HE1.F": {
        "short_name": "HOPE ED. GRP  DL-,00001",
        "long_name": "Hope Education Group Co., Ltd.",
        "summary": "Hope Education Group Co., Ltd. provides higher education services in China. The company provides technician education and training, self-study examination, adult education, technical management and consultancy, and other training services, as well as sells textbooks and dormitory beddings. As of August 31, 2020, it owned and operated 16 schools in 6 provinces, including 6 colleges and universities, 8 junior colleges, and 2 technician colleges. The company was founded in 2007 and is headquartered in Chengdu, China. Hope Education Group Co., Ltd. is a subsidiary of Hope Education Investment Limited.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Chengdu"
    },
    "HLG": {
        "short_name": "Hailiang Education Group Inc.",
        "long_name": "Hailiang Education Group Inc.",
        "summary": "Hailiang Education Group Inc. provides K-12 educational services in the People's Republic of China. The company operates 9 affiliated schools; and 28 managed schools. It also offers management consulting, educational training and logistic, overseas study consulting, hotel management, study trip, transportation, branding, academic management, education resources, school culture, admission, finance, human resources, procurement, IT, internal audit, and property management services, as well as after-school enrichment program. In addition, the company's schools offer basic educational and international programs at the primary school, middle school, and high school levels, as well as courses designed for students, such as A-levels courses for the United Kingdom universities, SAT courses for the United States universities, and VCE courses for the Australia universities for students planning to apply to undergraduate programs in the United States, the United Kingdom, and Australia. As of June 30, 2020, it had 23,716 students enrolled in its affiliated schools; and 42,628 students enrolled in its managed schools. Hailiang Education Group Inc. was founded in 1995 and is based in Hangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NGM",
        "market": "us_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "IH": {
        "short_name": "iHuman Inc.",
        "long_name": "iHuman Inc.",
        "summary": "iHuman Inc. provides childhood edutainment products and services to individual users, education organizations, and distributors in the People's Republic of China. The company offers interactive and self-directed learning apps, including iHuman Chinese, iHuman English World, iHuman Pinyin, iHuman Magic Math, iHuman Books, and iHuman Stories. It also provides learning materials in physical and digital formats; and smart learning devices. The company was founded in 1996 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "IZZ.F": {
        "short_name": "TAL EDUCATION GR.ADR A1/3",
        "long_name": "TAL Education Group",
        "summary": "TAL Education Group provides K-12 after-school tutoring services in the People's Republic of China. The company offers tutoring services to K-12 students covering various academic subjects, including mathematics, physics, chemistry, biology, history, geography, political science, English, and Chinese. It also provides tutoring services primarily through small classes under the Xueersi, Mobby, and Firstleap brand names; personalized premium services under Izhikang name. In addition, the company operates jzb.com, an online education platform that serves as a gateway for online courses offered through xueersi.com; and other Websites for specific topics and offerings, such as college entrance examinations, high school entrance examinations, graduate school entrance examinations, preschool education, and raising infants and toddlers, as well as mathematics, English, and Chinese composition. Further, it operates mmbang.com and the Mama Bang app, an online platform focusing on children, baby, and maternity market; and provides consulting services for overseas studies under the Shunshun Liuxue name, as well as tutoring services for students aged two through twelve under the Mobby brand. Additionally, the company offers education and management consulting, investment management and consulting services; develops and sells software and networks, as well as related consulting services; and sells educational materials. As of February 29, 2020, its educational network included 871 learning centers and 767 service centers in 69 cities throughout China and one city in the United States. The company was founded in 2003 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "KTD.F": {
        "short_name": "KOOLEARN TECHN. DL-,00002",
        "long_name": "Koolearn Technology Holding Limited",
        "summary": "Koolearn Technology Holding Limited provides online extracurricular education services in China. It operates through three segments: College Education, K12 Education, and Pre-school Education. The College Education segment offers college test preparation and overseas test preparation courses to college students and working professionals. The K12 Education segment provides after-school tutoring courses and preparation courses for high school and national college entrance exams. The Pre-school Education segment offers online educational content delivered through its Donut English-learning and child education apps and Donut live online English classroom courses. The company provides pre-recorded online education packages to institutional customers, including universities, public libraries, telecom operators, and online video streaming service providers. It also provides software and technology, and education advisory services. The company was founded in 2005 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "LAIX": {
        "short_name": "LAIX Inc.",
        "long_name": "LAIX Inc.",
        "summary": "LAIX Inc., an artificial intelligence (AI) company, provides online English learning products and services in the People's Republic of China. It offers English Liulishuo app, which offers a suite of courses, including free courses for leisure learning, the paid personalized standard courses, DongNi English, and other paid courses, as well as DongNi English A+ app; LiuLi Reading mobile app that allows users to read articles from publishers supplemented by detailed learning tips and quizzes; and Kids Liulishuo, a mobile app that enhance the reading, hearing, and speaking abilities of kids. The company also provides IELTS Liulishuo app for IELTS speaking practice tests; and enterprise learning services for corporate customers. In addition, it is involved in AI lab operation; technology development; and provision of loan arrangement and marketing support services. The company was formerly known as LingoChamp Inc. LAIX Inc. was incorporated in 2013 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    },
    "LXEH": {
        "short_name": "Lixiang Education Holding Co., ",
        "long_name": "Lixiang Education Holding Co., Ltd.",
        "summary": "Lixiang Education Holding Co., Ltd. provides primary and middle school education services from grade 1 to grade 9 in the People's Republic of China. As of June 30, 2020, the company operated two campuses, including Baiyun Campus and Yijing Campus. It also operates a Liandu Foreign Language School. The company was formerly known as Lianwai Education Group Limited and changed its name to Lixiang Education Holding Co., Ltd. in May 26, 2020. The company was founded in 2001 and is based in Lishui, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Lishui"
    },
    "MEG.SG": {
        "short_name": "Minsheng Education Grp Co. LtdR",
        "long_name": "Minsheng Education Group Company Limited",
        "summary": "Minsheng Education Group Company Limited, an investment holding company, provides educational services in the People's Republic of China. The company operates seven higher education schools, two secondary vocational schools, and one high schools. It also provides undergraduate and junior college education service; education management and services; disease diagnosis and treatment services; university and college logistics services; rental and business management services; investment management and services; education consulting and management services; and asset management, and project investment and management services. In addition, the company invests in education projects, as well as develops real estate properties. Further, it provides organizing cultural and artistic exchange; advertising; computer animation design; and educational software development and other related services. The company was incorporated in 2005 and is headquartered in Beijing, the People's Republic of China. Minsheng Education Group Company Limited is a subsidiary of Minsheng Group Company Limited.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "METX": {
        "short_name": "Meten EdtechX Education Group L",
        "long_name": "Meten EdtechX Education Group Ltd.",
        "summary": "Meten EdtechX Education Group Ltd. provides English language training (ELT) services in the People's Republic of China. It operates through four segments: General Adult English Training, Overseas Training Services, Online English Training, and Junior English Training. The company delivers English language and future skills training for Chinese students and professionals. It offers adult and junior ELT services under the Meten brand name, junior ELT services under the ABC brand name, and online ELT services under the Likeshuo brand name through a digital platform and network of learning centers. As of December 31, 2020, the company had a network of 105 self-operated learning centers covering 28 cities in 15 provinces, autonomous regions, and municipalities, as well as 13 franchised learning centers covering 12 cities in 11 provinces and municipalities. Meten EdtechX Education Group Ltd. was founded in 2006 and is based in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "N1U.F": {
        "short_name": "NEW ORIENT.EDU.+TEC.ADR/1",
        "long_name": "New Oriental Education & Technology Group Inc.",
        "summary": "New Oriental Education & Technology Group Inc. provides private educational services under the New Oriental brand in the People's Republic of China. It operates through K-12 AST, Test Preparation and Other Courses; and Others segments. The company offers test preparation courses to students taking language and entrance exams used by educational institutions in the United States, the People's Republic of China, and the Commonwealth countries; and after-school tutoring courses for middle and high school students to enhance their exam scores, as well as for children to teach English. It also provides language training courses, including English, as well as other foreign languages, such as German, Japanese, French, Korean, Italian, and Spanish; operates a full-time private primary and secondary school in Yangzhou seeking a full curriculum with a focus on English; develops and edits educational materials for language training and test preparation; and offers online education programs that include college, K-12, and pre-school education. In addition, the company offers overseas studies consulting and overseas study tour services. As of May 31, 2020, it offered educational programs, services, and products to students through a network of 104 schools, 1,361 learning centers, and 12 bookstores. The company was founded in 1993 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "NEW": {
        "short_name": "Puxin Limited",
        "long_name": "Puxin Limited",
        "summary": "Puxin Limited, together with its subsidiaries, provides K-12 and study-abroad tutoring services in the People's Republic of China. Its K-12 tutoring services offer result-oriented educational services in various forms, such as classroom-based after-school tutoring, full-time tutoring for preparation of university entrance exams, and art college admission exams, as well as online courses in a large-class setting to help students enhance their academic results through group class and personalized tutoring courses; full-time tutoring services to high school students preparing for university entrance exams and art college admission exams; after-school tutoring services in group class settings and through personalized sessions; personalized K-12 tutoring courses to adapt to each student's learning pace, pattern, and approach; and extracurricular courses, such as painting, calligraphy, and science. The company's study-abroad tutoring services helps students to prepare for admission tests and applications for high schools, universities, and graduate programs primarily in English-speaking countries through study-abroad test preparation courses and study-abroad consulting services. It also provides web-based platforms and mobile apps for K-12 tutoring services; and cloud-based products and services for K-12 tutoring and study-abroad tutoring services. As of December 31, 2020, it operated 407 learning centers, which include 328 K-12 and 79 study-abroad learning centers. The company offers its products under the Puxin, Puxin-Lingxian, Puxin-YESSAT, Puxin-Fubusi, and ZMN Education brands, as well as operates franchised schools under the Global Education brand. Puxin Limited was founded in 2014 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "ONE": {
        "short_name": "OneSmart International Educatio",
        "long_name": "OneSmart International Education Group Limited",
        "summary": "OneSmart International Education Group Limited provides tutoring services for the students of kindergarten and primary, middle, and high schools (K12) in the People's Republic of China. The company offers premium tutoring services for exam preparation under OneSmart VIP brand; young children services, including Chinese language, mathematics, science, and computer programming under the HappyMath brand; and English tutoring services focusing on early childhood under the brand FasTrack English brand. It also provides online education courses under the OneSmart Online brand to existing student base from OneSmart VIP, HappyMath, and FasTrack English. As of August 31, 2020, the company operated a network of 480 learning centers across 40 cities in China. The company was formerly known as OneSmart Education Group Limited. OneSmart International Education Group Limited was founded in 2007 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    },
    "OSM.SG": {
        "short_name": "OneSmart International EducatiR",
        "long_name": "OneSmart International Education Group Limited",
        "summary": "OneSmart International Education Group Limited provides tutoring services for the students of kindergarten and primary, middle, and high schools (K12) in the People's Republic of China. The company offers premium tutoring services for exam preparation under OneSmart VIP brand; young children services, including Chinese language, mathematics, science, and computer programming under the HappyMath brand; and English tutoring services focusing on early childhood under the brand FasTrack English brand. It also provides online education courses under the OneSmart Online brand to existing student base from OneSmart VIP, HappyMath, and FasTrack English. As of August 31, 2020, the company operated a network of 480 learning centers across 40 cities in China. The company was formerly known as OneSmart Education Group Limited. OneSmart International Education Group Limited was founded in 2007 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "REDU": {
        "short_name": "RISE Education Cayman Ltd",
        "long_name": "RISE Education Cayman Ltd",
        "summary": "RISE Education Cayman Ltd, through its subsidiaries, provides junior English language training services under the RISE brand in China, Hong Kong, and Singapore. The company offers a range of educational programs, services, and products, which primarily include educational courses, sale of course materials, franchise services, and study tours. It also provides educational consulting services; and academic tutoring, test preparation, and admissions consulting services. The company offers Can-Talk, Rise Library Online, Rise Camp, Rise Workshop, and Rise Overseas Study Tour complementary products, as well as STEAM Courses that integrates various subjects, such as science, technology, engineering, art, and mathematics. As of December 31, 2020, it had a network of 512 learning centers comprising 92 self-owned learning centers and 420 franchised learning centers. The company was founded in 2007 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NGM",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "RTE.AX": {
        "short_name": "RETECH CDI 1:1",
        "long_name": "Retech Technology Co., Limited",
        "summary": "Retech Technology Co., Limited, an investment holding company, provides technology solutions to corporate customers, vocational schools, ESG related companies, and students in the People's Republic of China, Hong Kong, and Australia. The company also develops E-Learning platforms, E-Courses, and e-learning solutions, which enables its clients to deliver their offline training content online through various channels or devices, such as desktop, mobile, WeChat, face-to-face training solution, etc. It also provides referral and technical consultancy services; software licensing services; and property management services, as well as operates language coaching schools. The company was incorporated in 2016 and is based in Shanghai, the People's Republic of China.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "China",
        "city": "Shanghai"
    },
    "RYB": {
        "short_name": "RYB Education, Inc.",
        "long_name": "RYB Education, Inc.",
        "summary": "RYB Education, Inc. provides early childhood education service in the People's Republic of China. The company offers kindergarten services to 2-6-year-old children; and play-and-learn centers services for the joint participation of 0-6-year-old children and their adult family members to promote children's development, foster bonding with family, and prepare them for their entry into kindergartens and primary schools. It also develops and sells educational products and services, such as teaching aids, educational toys, at-home educational products, and school uniforms through franchisees and other business partners, as well as directly to a market of families. As of December 31, 2019, it operated 100 directly operated and 250 franchise kindergartens; and 6 play-and-learn centers. The company was formerly known as Top Margin Limited and changed its name to RYB Education, Inc. in June 2017. RYB Education, Inc. was founded in 1998 and is based in Beijing, China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "S79.F": {
        "short_name": "SUNL.TECH.GR.ADR DL-00005",
        "long_name": "Sunlands Technology Group",
        "summary": "Sunlands Technology Group, through its subsidiaries, provides online education services in the People's Republic of China. It offers various degree- and diploma-oriented post-secondary courses, including preparation courses for the self-taught higher education examination (STE) for learners pursuing associate diplomas or bachelor's degrees, as well as for the entrance examinations of Master of Business Administration programs. The company's STE courses cover 19 majors, including Chinese language and literature, law, pre-school education, marketing, English, human resource management, business administration, business management, modern corporate governance, financial management, advertising, accounting, engineering management, administrative management, computer information management, finance, convention management, chain operation management, and visual communication and design. It also provides professional certification preparation course offerings that cover various industries and professions, such as accounting, human resources, teaching, and finance. The company was formerly known as Sunlands Online Education Group and changed its name to Sunlands Technology Group in August 2018. Sunlands Technology Group was founded in 2003 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "STG": {
        "short_name": "Sunlands Technology Group",
        "long_name": "Sunlands Technology Group",
        "summary": "Sunlands Technology Group, through its subsidiaries, provides online education services in the People's Republic of China. It offers various degree- and diploma-oriented post-secondary courses, including preparation courses for the self-taught higher education examination (STE) for learners pursuing associate diplomas or bachelor's degrees, as well as for the entrance examinations of Master of Business Administration programs. The company's STE courses cover 19 majors, including Chinese language and literature, law, pre-school education, marketing, English, human resource management, business administration, business management, modern corporate governance, financial management, advertising, accounting, engineering management, administrative management, computer information management, finance, convention management, chain operation management, and visual communication and design. It also provides professional certification preparation course offerings that cover various industries and professions, such as accounting, human resources, teaching, and finance. The company was formerly known as Sunlands Online Education Group and changed its name to Sunlands Technology Group in August 2018. Sunlands Technology Group was founded in 2003 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "TAL": {
        "short_name": "TAL Education Group",
        "long_name": "TAL Education Group",
        "summary": "TAL Education Group provides K-12 after-school tutoring services in the People's Republic of China. The company offers tutoring services to K-12 students covering various academic subjects, including mathematics, physics, chemistry, biology, history, geography, political science, English, and Chinese. It also provides tutoring services primarily through small classes under the Xueersi, Mobby, and Firstleap brand names; personalized premium services under Izhikang name. In addition, the company operates jzb.com, an online education platform that serves as a gateway for online courses offered through xueersi.com; and other Websites for specific topics and offerings, such as college entrance examinations, high school entrance examinations, graduate school entrance examinations, preschool education, and raising infants and toddlers, as well as mathematics, English, and Chinese composition. Further, it operates mmbang.com and the Mama Bang app, an online platform focusing on children, baby, and maternity market; and provides consulting services for overseas studies under the Shunshun Liuxue name, as well as tutoring services for students aged two through twelve under the Mobby brand. Additionally, the company offers education and management consulting, investment management and consulting services; develops and sells software and networks, as well as related consulting services; and sells educational materials. As of February 29, 2020, its educational network included 871 learning centers and 767 service centers in 69 cities throughout China and one city in the United States. The company was founded in 2003 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "TEDU": {
        "short_name": "Tarena International, Inc.",
        "long_name": "Tarena International, Inc.",
        "summary": "Tarena International, Inc., through its subsidiaries, provides professional education services through full-time and part-time classes under the Tarena brand in the People's Republic of China. It operates through two segments, Adult Training and Kid Training. The company offers education courses in 7 information technology (IT) subjects, such as Java, software testing, Linux and network engineering, Big Data, Web front-end development, Python, and network engineer courses; and 3 non-IT subjects, including digital art, online sales and marketing, computer-based design courses through live distance instruction, and visual effects-VFX, as well as classroom-based tutoring and online learning modules. It also provides 7 K-12 education programs for children, including computer coding and robotics programming courses under the TongchengTongmei brand. In addition, the company offers online learning platform for education courses and job placement training courses. As of December 31, 2020, it had a network of 104 directly managed learning centers in 45 cities; and 236 TongchengTongmei standalone learning centers in 53 cities. The company was founded in 2002 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "WAFU": {
        "short_name": "Wah Fu Education Group Limited",
        "long_name": "Wah Fu Education Group Limited",
        "summary": "Wah Fu Education Group Limited, through its subsidiaries, provides online exam preparation services and related technology solutions in the People's Republic of China. The company operates in two segments, Online Education Services; and Technological Development and Operation Services. The Online Education Services segment offers online education platforms to institutions, such as universities and training institutions, and online course development service companies. This segment provides self-study examination, continuing education, and non-diploma training platforms that allow students to enroll in courses for college credit; vocational education 1+X and higher vocational enrollment expansion teaching and educational administration platform; Huafu e-school system and paperless examination platform; and online training and examination preparation services directly to students. The Technological Development and Operation Services segment develops and maintains online education platforms and online courses for its clients, including universities and government agencies, as well as private clients, such as publishers; and provides consulting, maintenance, and updating services related to online education programs. Wah Fu Education Group Limited was founded in 1999 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "YQ": {
        "short_name": "17 Education & Technology Group",
        "long_name": "17 Education & Technology Group Inc.",
        "summary": "17 Education & Technology Group Inc., an education technology company, provides K-12 online education service in the People's Republic of China. It also offers online K-12 large-class after-school tutoring services on development of course syllabi and content and adaptation for live classes areas. The company was incorporated in 2012 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "ZX3.F": {
        "short_name": "CHINA EAST ED HLDGS LTD",
        "long_name": "China East Education Holdings Limited",
        "summary": "China East Education Holdings Limited, an investment holding company, provides vocational training education services. The company provides vocational training education in culinary arts, information technology and internet technology, auto services, and fashion and beauty sectors. As of December 31, 2020, it operated a network of 206 schools, which included 64 New East Culinary Education centers that offer culinary training programs in the cooking traditions and practices of Chinese cuisines; 35 Omick Education of Western Cuisine and Pastry centers, which provide culinary training on western pastry and western food that include baking, desserts, western cuisines, bartending, and barista training; 31 Xinhua Internet Technology Education centers; 22 Wisezone Data Technology Education centers that provide information and internet technology programs to junior college and university students; 33 Wontone Automotive Education centers, which provide auto repair skill training, and practical training of other auto services, including automobile commerce; 1 On-mind Fashion & Beauty Education center that focuses on skill development of fashion and beauty professionals; and 20 customized catering experience centers under Cuisine Academy brand in 29 provinces in Mainland China and Hong Kong. The company also engages in the provision of data technology educational services; and technology development, consulting, and promotion business. China East Education Holdings Limited was founded in 1988 and is headquartered in Hefei, China.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Hefei"
    }
}