{
    "000938.SZ": {
        "short_name": "UNISPLENDOUR CO. L",
        "long_name": "Unisplendour Corporation Limited",
        "summary": "Unisplendour Corporation Limited, a technology company, provides electronics and information technology (IT) solutions in China and internationally. The company offers cloud computing, mobile Internet, big data processing, and other services for IT applications; and research and development, building, operation, and maintenance of information systems. It also provides equipment, such as intelligent network equipment, storage systems, and servers; desktop and mobile software solutions; and technical consulting, infrastructure solutions, and support services. The company was founded in 1999 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100084",
        "website": "http://www.thunis.com",
        "market_cap": 63951392768
    },
    "002819.SZ": {
        "short_name": "BEIJING ORIENTAL J",
        "long_name": "Beijing Oriental Jicheng Co., Ltd.",
        "summary": "Beijing Oriental Jicheng Co., Ltd. offers products and solutions for test and measurement applications in China. The company provides services, including consultations on the value-added sales, system integration, technical rental, equipment testing and calibration, maintenance and repair, outsourcing management of scientific assets, etc. It also operates jicheng.net.cn, an e-business platform for instrumentation industry. The company serves customers in various sectors, such as industrial electronics manufacturing, telecommunications and information technology, R&D, education and scientific research, electric power, petroleum and chemical, aviation and aerospace, microelectronics, new energy, biological pharmacy and environmental protection, etc. Beijing Oriental Jicheng Co., Ltd. was founded in 2000 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100142",
        "website": "http://www.jicheng.net",
        "market_cap": 5428121088
    },
    "002953.SZ": {
        "short_name": "GUANGDONG RIFENG E",
        "long_name": "GuangDong Rifeng Electric Cable Co., Ltd.",
        "summary": "GuangDong Rifeng Electric Cable Co., Ltd. engages in the manufacture and sale of cables in the People's Republic of China and internationally. The company provides rubber cables, housing wires, PVC/LSOH cables, power cables, instrumentation cables, shipboard and marine cables, plugs and connectors, control cables, heavy machinery cables, communication cables, connector cables, and power cords. Its products are used in household appliances, electrical engineering, petroleum chemical industry, metallurgy, construction machinery, communications engineering, wind power, environmental protection engineering, dam embankment engineering, instrumentation, computer communications, control, and other fields. The company was founded in 2009 and is based in Zhongshan, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhongshan",
        "zipcode": "528401",
        "website": "http://www.rfcable.com.cn",
        "market_cap": 2521245696
    },
    "0400.HK": {
        "short_name": "COGOBUY",
        "long_name": "Cogobuy Group",
        "summary": "Cogobuy Group operates as an e-commerce company serving the electronics manufacturing industry in the People's Republic of China and Hong Kong. It sells integrated circuits and other electronic components comprising microcontrollers/processors, sensors and converters, signal and interface products, amplifiers, filters, optoelectronic devices, resistors, inductors, discrete devices, connectors, switches, relays, circuit protection devices, development tools and systems, multimedia ICs, and dedicated and motor control ICs, as well as FPGA/CPLD, DSP, memory, wireless and RF, power management, capacitance, timer, and clock products. The company offers its products through its e-commerce platform, cogobuy.com, which includes a direct sales platform, as well as through an online marketplace, and a team of technical consultants and professional sales representatives. It also provides media communication and collaboration platforms and solutions; supply chain financing services; and develops e-commerce software technology. In addition, the company develops and sells electronic communication products; operates the INGDAN.com platform; and holds Internet content provider license. It serves electronics manufacturers, including small and medium enterprise, and blue-chip customers. The company was founded in 2000 and is headquartered in Shenzhen, the People's Republic of China. Cogobuy Group is a subsidiary of Envision Global Investments Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.cogobuy.com",
        "market_cap": 2846521600
    },
    "300563.SZ": {
        "short_name": "SHENYU COMMUNICATI",
        "long_name": "Shenyu Communication Technology Inc.",
        "summary": "Shenyu Communication Technology Inc. engages in the research and development, production, and sale of radio frequency coaxial cables in China. The company offers high-end stationary phase, microwave low loss, semi rigid, fine coaxial radio frequency, and very thin radio frequency coaxial cables; high speed data lines; radio frequency cable components; AF high temperature installation cables; and various high-frequency low-loss steady-phase cable assemblies and low-loss flexible microwave feeders. Its products are used in aerospace, ship, consumer electronics, medical equipment, communication base station, and high-frequency test instrument applications. Shenyu Communication Technology Inc. was founded in 2003 and is based in Jiangyin, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiangyin",
        "zipcode": null,
        "website": "http://www.shenyucable.com",
        "market_cap": 2799115520
    },
    "600149.SS": {
        "short_name": "LANGFANG DEVELOPMENT CO. LTD.",
        "long_name": "Langfang Development Co., Ltd.",
        "summary": "Langfang Development Co., Ltd. distributes electronic products and provides network technology services in China. It also offers real estate consulting services; and leases properties. The company was formerly known as C&T Technology Development CO., LTD. Langfang Development Co., Ltd. is based in Langfang, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Langfang",
        "zipcode": "065000",
        "website": null,
        "market_cap": 2117491328
    },
    "601616.SS": {
        "short_name": "SHANGHAI GUANGDIAN ELECTRIC GRO",
        "long_name": "Shanghai Guangdian Electric Group Co., Ltd.",
        "summary": "Shanghai Guangdian Electric Group Co., Ltd. manufactures and sells electrical equipment in China. It provides switchgears; voltage core components, such as voltage circuit breakers and intelligent control terminal series; solar grid connection devices; and high-voltage frequency converter devices. The company offers its products under the SGEG, GE, AE, Honeywell, and AEG brands. Shanghai Guangdian Electric Group Co., Ltd. was founded in 1986 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201401",
        "website": "http://www.sgeg.cn",
        "market_cap": 3040618752
    },
    "603516.SS": {
        "short_name": "BEIJING TRICOLOR TECHNOLOGY CO ",
        "long_name": "Beijing Tricolor Technology Co., Ltd",
        "summary": "Beijing Tricolor Technology Co., Ltd manufactures and sells professional audio and video products worldwide. The company offers matrix switcher, video wall controller, KVM switches, signal transceiver, and accessories. Its products are used in multimedia video scenarios, such as command and control centers, conference rooms, big data centers, and exhibitions. Beijing Tricolor Technology Co., Ltd was founded in 2011 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100095",
        "website": "http://www.chinargb.com.cn",
        "market_cap": 4216120576
    },
    "7C3.F": {
        "short_name": "COGOBUY GROUP DL-,0000001",
        "long_name": "Cogobuy Group",
        "summary": "Cogobuy Group operates as an e-commerce company serving the electronics manufacturing industry in the People's Republic of China and Hong Kong. It sells integrated circuits and other electronic components comprising microcontrollers/processors, sensors and converters, signal and interface products, amplifiers, filters, optoelectronic devices, resistors, inductors, discrete devices, connectors, switches, relays, circuit protection devices, development tools and systems, multimedia ICs, and dedicated and motor control ICs, as well as FPGA/CPLD, DSP, memory, wireless and RF, power management, capacitance, timer, and clock products. The company offers its products through its e-commerce platform, cogobuy.com, which includes a direct sales platform, as well as through an online marketplace, and a team of technical consultants and professional sales representatives. It also provides media communication and collaboration platforms and solutions; supply chain financing services; and develops e-commerce software technology. In addition, the company develops and sells electronic communication products; operates the INGDAN.com platform; and holds Internet content provider license. It serves electronics manufacturers, including small and medium enterprise, and blue-chip customers. The company was founded in 2000 and is headquartered in Shenzhen, the People's Republic of China. Cogobuy Group is a subsidiary of Envision Global Investments Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.cogobuy.com",
        "market_cap": 306274496
    },
    "8045.HK": {
        "short_name": "NANDASOFT",
        "long_name": "Jiangsu NandaSoft Technology Company Limited",
        "summary": "Jiangsu NandaSoft Technology Company Limited, together with its subsidiaries, provides system integration services primarily in the People's Republic of China. It operates through four segments: Computer Hardware and Software Products; System Integration Service; Property Investment; and Online Education. The company also engages in the sale of computer hardware and software outsourcing products; trading of information technology related products and equipment; provision of information technology training services; and developing, manufacturing, and marketing of network security software, internet application software, education software, and business application software. In addition, it offers services related to building installation and information system integration; invests in properties; and researches and develops medicine and pharmaceutical equipment. Further, it provides properties management services, communication intelligence control systems, and online education services. The company was formerly known as Jiangsu NandaSoft Company Limited and changed its name to Jiangsu NandaSoft Technology Company Limited in September 2008. Jiangsu NandaSoft Technology Company Limited was incorporated in 1998 and is based in Nanjing, China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210036",
        "website": "http://www.nandasoft.com",
        "market_cap": 170976000
    },
    "8106.HK": {
        "short_name": "SHENGHUA LANDE",
        "long_name": "Shenghua Lande Scitech Limited",
        "summary": "Shenghua Lande Scitech Limited, an investment holding company, engages in the trading of hardware and computer software in the People's Republic of China. It also provides telecommunication solutions; smart city solutions; and e-commerce supply chain services. The company was formerly known as Zheda Lande Scitech Limited and changed its name to Shenghua Lande Scitech Limited in June 2017. The company was founded in 1996 and is based in Huzhou, the People's Republic of China. Shenghua Lande Scitech Limited is a subsidiary of Zhejiang Shenghua Holdings Group Company Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Huzhou",
        "zipcode": null,
        "website": "http://www.landpage.com.cn",
        "market_cap": 97763376
    }
}