{
    "000020.SZ": {
        "short_name": "S/Z ZHONGHENG HUAF",
        "long_name": "Shenzhen Zhongheng Huafa Co., Ltd.",
        "summary": "Shenzhen Zhongheng Huafa Co., Ltd. produces and sells injection molded parts, light packaging materials, and LCD whole machines primarily in Central and South China, and Hong Kong. It is also involved in property leasing and management operations. The company was formerly known as Shenzhen Huafa Electronics Co.,Ltd. and changed its name to Shenzhen Zhongheng Huafa Co., Ltd. in September 2007. Shenzhen Zhongheng Huafa Co., Ltd. was founded in 1981 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518031",
        "website": "http://www.hwafa.com.cn",
        "market_cap": "Small Cap"
    },
    "000049.SZ": {
        "short_name": "SHENZHEN DESAY BAT",
        "long_name": "Shenzhen Desay Battery Technology Co., Ltd.",
        "summary": "Shenzhen Desay Battery Technology Co., Ltd. operates in lithium battery industry in China and internationally. The company offers small and medium-sized lithium battery packages and mobile power management systems. It serves consumer electronics manufacturers. The company was formerly known as Shenzhen Worldsun Enterprise Co., Ltd. and changed its name to Shenzhen Desay Battery Technology Co., Ltd. in June 2005. The company was founded in 1995 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.desaybattery.com",
        "market_cap": "Small Cap"
    },
    "000062.SZ": {
        "short_name": "SHN HUAQIANG IND",
        "long_name": "Shenzhen Huaqiang Industry Co., Ltd.",
        "summary": "Shenzhen Huaqiang Industry Co., Ltd. operates as an electronic components distributor in China. The company is also involved in the distribution and supply chain management of integrated circuit, storage, devices, and various passive elements; publishing of electronic components supply and demand information; online transactions; and logistics distribution, financial supply chain, and data study activities. In addition, it develops and manages e-commerce service platform; and trades in electronic products. The company was founded in 1994 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.szhq000062.com",
        "market_cap": "Mid Cap"
    },
    "000068.SZ": {
        "short_name": "SHENZHEN HUAKONG S",
        "long_name": "Shenzhen Huakong Seg Co., Ltd.",
        "summary": "Shenzhen Huakong Seg Co., Ltd. does not have significant operations. Previously, the company was involved in the design, manufacture, and sale of electronic components. Shenzhen Huakong Seg Co., Ltd. is based in Shenzhen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518118",
        "website": "http://www.huakongseg.com.cn",
        "market_cap": "Small Cap"
    },
    "000413.SZ": {
        "short_name": "DONGXU OPTOELECTRO",
        "long_name": "Tunghsu Optoelectronic Technology Co., Ltd.",
        "summary": "Tunghsu Optoelectronic Technology Co., Ltd. engages in the development and sale of liquid crystal glass substrates and equipment in China. It also offers energy buses, and single-layer graphene and graphene-based lithium-ion battery related products; and purchases and sells memory chip products, peripherals and e-sports main computers, LCD screen modules, and whole machine products. In addition, the company is involved in the development and sale of real estate properties. The company was formerly known as Shijiazhuang Baoshi Electronic Glass Co., Ltd. Tunghsu Optoelectronic Technology Co., Ltd. was founded in 1992 and is based in Shijiazhuang, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": "050035",
        "website": "http://www.dongxuguangdian.com.cn",
        "market_cap": "Small Cap"
    },
    "000701.SZ": {
        "short_name": "XIAMEN XINDE CO",
        "long_name": "Xiamen Xindeco Ltd.",
        "summary": "Xiamen Xindeco Ltd. engages in the electronic information, automobile distribution, and supply chain businesses in China and internationally. It produces a range of in-line LED, SMD LED, high power white LED, LED road lighting, LED tunnel lighting, LED indoor lighting, LED traffic display, LED display, and other products. The company is also involved in the research and development, manufacture, and sale of RFID products; and provision of supply chain services to the non-ferrous and ferrous metal industries. In addition, it provides car dealership services; and real estate services. The company was founded in 1984 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361016",
        "website": "http://www.xindeco.com.cn",
        "market_cap": "Small Cap"
    },
    "000727.SZ": {
        "short_name": "TPV TECHNOLOGY CO",
        "long_name": "TPV Technology Co., Ltd.",
        "summary": "Nanjing Huadong Electronics Information & Technology Co., Ltd. manufactures and sells flat panel displays, touch displays, quartz crystals, magnetic materials, and power supply products in China and internationally. Its products include TFT-LCD, touch screen, and LCD and display module products; crystal resonators, oscillators, filters, and other components; and magnetic power, magnetic core, power supply, and other components. The company was founded in 1993 and is based in Nanjing, China. Nanjing Huadong Electronics Information & Technology Co., Ltd. operates as a subsidiary of China Electronics Corporation.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://www.huadongtech.com",
        "market_cap": "Small Cap"
    },
    "002036.SZ": {
        "short_name": "LIANCHUANG ELECTRO",
        "long_name": "LianChuang Electronic Technology Co., Ltd.",
        "summary": "LianChuang Electronic Technology Co., Ltd. engages in the research and development, production, and sale of touch glasses, display modules, and optics for mobile communication and computers in China and internationally. The company was founded in 2006 and is based in Nanchang, china.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330096",
        "website": "http://www.lcetron.com",
        "market_cap": "Small Cap"
    },
    "002055.SZ": {
        "short_name": "SHENZHEN DEREN ELE",
        "long_name": "Shenzhen Deren Electronic Co., Ltd.",
        "summary": "Shenzhen Deren Electronic Co., Ltd. engages in the research, development, manufacture, and sale of connectors and precision components for the home appliance, consumer and automotive electronics, and telematics technology sectors. It offers MFI, FPC, and FFC products, as well as LED supports, LED optical lens, camera lens, wiring harnesses, and connectors for the home appliance and consumer products industry; lighting, connection, and electric systems, as well as automotive electronics and NEV technology products for the automotive electronics and electrics industry; and various telematics industry solutions. The company was founded in 1989 and is based in Shenzhen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.deren.com.cn",
        "market_cap": "Small Cap"
    },
    "002106.SZ": {
        "short_name": "SHENZHEN LAIBAO HI",
        "long_name": "Shenzhen Laibao Hi-Tech Co., Ltd.",
        "summary": "Shenzhen Laibao Hi-Tech Co., Ltd. engages in the research and development, production, and sale of flat panel display upstream materials and touch devices in China. Its principal products include capacitive touch screens, ITO conductive glasses, color filters, and TFT-LCD panels. The company provides its products for use in smart phones, tablet computers, touch notebook computers, and integrated computers, as well as in automotive instrumentation, medical, and industrial control panel applications. Shenzhen Laibao Hi-Tech Co., Ltd. was founded in 1992 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518107",
        "website": "http://www.laibao.com.cn",
        "market_cap": "Small Cap"
    },
    "002112.SZ": {
        "short_name": "SAN BIAN SCI-TECH",
        "long_name": "SAN BIAN SCIENCE& TECHNOLOGY Co., LTD.",
        "summary": "SAN BIAN SCIENCE& TECHNOLOGY Co., LTD. produces and sells large and medium size transformers in China and internationally. Its principal products include oil immersed power transformers, dry-type transformers, transformers for petrifaction, combined transformers, amorphous alloy transformers, combined transformer substations, low voltage cable branch boxes and distribution equipment, special transformers, and others. The company was founded in 1968 and is based in Taizhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taizhou",
        "zipcode": "317100",
        "website": "http://www.sanbian.cn",
        "market_cap": "Micro Cap"
    },
    "002138.SZ": {
        "short_name": "SZ SUNLORD ELECTRO",
        "long_name": "Shenzhen Sunlord Electronics Co.,Ltd.",
        "summary": "Shenzhen Sunlord Electronics Co.,Ltd. operates as a technology developer for the passive component industry worldwide. It offers planar electronic and wire wound electronic transformers; coils/inductors, such as metal alloy multilayer chip power inductor/MPM, wire wound SMD power inductors/WPL series, wire wound SMD power inductors/WPN series; fine ceramic products, including zirconia fingerprint identification sensor covers and zirconia back covers; and customized components comprises wireless charging coil assemblies, NFC products, through-hole boards, and HDI boards. The company also provides chip temperature sensing NTC thermistors and sensors, and chip polymer PTC thermistors; EMC components consisting of multilayer chip ferrite beads, wire wound chip ferrite beads, chip 3-terminal filters, and common mode filters; circuit protection components, including multilayer varistors, glass ceramic ESD suppressors, and leaded varistors for voltage surge suppressions; RF components; and solid tantalum chip capacitors and solid niobium oxide chip capacitors. Its products applications include energy, computer, consumer products, communications, and automotive electronics, as well as switching power applications. Shenzhen Sunlord Electronics Co.,Ltd. was founded in 2000 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.sunlordinc.com",
        "market_cap": "Mid Cap"
    },
    "002139.SZ": {
        "short_name": "SHENZHEN TOPBAND C",
        "long_name": "Shenzhen Topband Co., Ltd.",
        "summary": "Shenzhen Topband Co., Ltd. researches, develops, produces, and sells intelligent control system solutions worldwide. The company provides diversified customized solutions for home appliances, tools, industry, and new energy applications. It also offers customized product concepts, design, development, manufacturing, and delivery services for master and power control, motor drive and control, and display control of home appliances; and for electronic controls, motors and batteries, and product forms that comprise controllers, modules, and complete machines. In addition, the company provides products and system solutions, such as battery cells, battery management and control, battery packs, and charging cabinets for communication base station energy storage, home energy storage, power batteries for two- or three- wheeled vehicles and other special vehicles, mobile charging power, and IoT applications. Further, it offers step and servo drives, and control products; and controllers, drivers, and motors used in 3C electronics, robotics, medical and semiconductor equipment, textile and packaging machinery, etc. The company was founded in 1996 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518108",
        "website": "http://www.topband.com.cn",
        "market_cap": "Mid Cap"
    },
    "002169.SZ": {
        "short_name": "GUANGZHOU ZHIGUANG",
        "long_name": "Guangzhou Zhiguang Electric Co., Ltd.",
        "summary": "Guangzhou Zhiguang Electric Co., Ltd. provides energy technology products and services. The company offers motor control, grid control, electric power cable, energy conversion, and power automation products. It also provides turnkey solution for large industrial electrical power saving and efficiency projects, and energy conservation and efficiency enhancement in large-sized power plants; optimal utilization of regional energy and integrated energy systems; and design for power engineering, as well as offers electricity investment, electricity distribution, and electricity services. Guangzhou Zhiguang Electric Co., Ltd. was founded in 1999 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510535",
        "website": "http://www.gzzg.com.cn",
        "market_cap": "Small Cap"
    },
    "002179.SZ": {
        "short_name": "AVIC JONHON OPTR",
        "long_name": "AVIC Jonhon Optronic Technology Co., Ltd.",
        "summary": "AVIC Jonhon Optronic Technology Co., Ltd. engages in the research and development of optical, electrical, fluid technology, and integrated solutions in China. Its electrical connectors include various connectors comprising circular, rectangular, data transmission, filter, and network electrical connectors, as well as RF coaxial series adapters; and optical connectors comprise optical passive connectors, optical transceiver modules, and optical and electrical equipment and systems. The company also provides interconnect solutions. Its products are used in the aviation, aerospace and military, telecom and data center equipment, railway transportation, new energy vehicle, power equipment, petroleum equipment, medical equipment, intelligent equipment, and other civil industrial fields. The company also exports its products to approximately 30 countries and regions, including Europe, the United States, Israel, Australia, Korea, India, etc. The company was formerly known as China Aviation Optical-Electrical Technology Co., Ltd. and changed its name to AVIC Jonhon Optronic Technology Co., Ltd. in July 2016. AVIC Jonhon Optronic Technology Co., Ltd. is headquartered in Luoyang, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Luoyang",
        "zipcode": "471003",
        "website": "http://en.jonhon.cn",
        "market_cap": "Large Cap"
    },
    "002222.SZ": {
        "short_name": "CASTECH INC",
        "long_name": "CASTECH Inc.",
        "summary": "CASTECH Inc. researches, develops, manufactures, and sells crystals, optics, and laser components primarily in China. The company offers NLO, laser, magneto-optical, birefringent, AO and EO, and scintillation crystals, as well as oven and temperature controller accessories; precision optics, including coatings, materials, windows, mirrors, prisms, polarizers, cylindrical lenses, spherical lenses, waveplates, and beam splitters; and laser components, such as AO and EO devices, isolators and rotators, attenuators, beam expanders, fiber collimators, and laser lenses. It also exports its products to North America, Europe, Japan, and other Asian countries. The company was founded in 1988 and is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350003",
        "website": "http://www.castech.com",
        "market_cap": "Small Cap"
    },
    "002273.SZ": {
        "short_name": "ZHEJIANG QUARTZ CR",
        "long_name": "Zhejiang Crystal-Optech Co., Ltd",
        "summary": "Zhejiang Crystal-Optech Co., Ltd researches, develops, and manufactures optical imaging, LED, micro display, and reflective materials in China. The company offers optical imaging products, including optical low pass filters, infra-red cut filters (IRCF), blue glass IRCF, IRCF with black masks, IRCF and lens assemblies, and IRCF switchers, as well as spacer wafers, pattern coatings, resin IRCF, CMOS covers, lens covers, and UV filters; projectors comprising polarization beam splitters, integral type color wheels, sequential color recaptures, color selective mirrors, LCOS seal glasses, and heat-dissipating bands; and watch cover glass products. It also provides doublet spherical lenses, spherical mirrors, miniature triangular prisms, total reflection prisms, and combination prisms; and ultra AR coatings, AR coated covers, and high reflection coatings, as well as narrow band pass, long pass, dual band pass, triple band pass, and RGB filters. In addition, the company offers short focus projectors and smart glass, head-up display, and compact projector products; sapphire crystals products, and flat sapphire substrate and patterned sapphire substrate for LEDs; sapphire optical products; reflective material series; and safety protection products. Its products are primarily applied in digital, mobile phones, security monitoring, computers, and other digital camera lenses, as well as semiconductor illuminations, micro projectors, smart glasses, road traffic marks, and safety protections. Zhejiang Crystal-Optech Co., Ltd was founded in 2002 and is based in Taizhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taizhou",
        "zipcode": "318015",
        "website": "http://www.crystal-optech.com",
        "market_cap": "Mid Cap"
    },
    "002288.SZ": {
        "short_name": "GUANGDONG CHAOHUA",
        "long_name": "Guangdong Chaohua Technology Co., Ltd",
        "summary": "Guangdong Chaohua Technology Co., Ltd. primarily produces and sells printed circuit boards in China and internationally. The company offers single-sided, double-sided, and multilayer printed circuit boards. It also provides paper based laminates and composite base copper clad laminates; electrolytic copper foils; solder masks, resistant inks, and legends; wood pulp papers for CCL; and CNC drilling machines. The company is based in Meizhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Meizhou",
        "zipcode": "514759",
        "website": "http://www.chaohuatech.com",
        "market_cap": "Small Cap"
    },
    "002289.SZ": {
        "short_name": "SHENZHEN SUCCESS E",
        "long_name": "Shenzhen Success Electronics Co., Ltd",
        "summary": "Shenzhen Success Electronics Co., Ltd develops and manufactures sensors, capacitive touch screens, small and medium size LCDs and corresponding modules, and glass cover products. It offers TN, HTN, STN, CSTN, and TFT LCDs; and GFF, OGS, and GG capacitive touch screens. The company also provides a range of touch and display integrated solutions for smart phone manufacturers. Its products are used in communications terminals, household appliances, automotive electronics, digital products, and other industries. The company exports its products to Europe, Japan, South Korea, Singapore, and other countries. Shenzhen Success Electronics Co., Ltd. was founded in 2004 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.szsuccess.com.cn",
        "market_cap": "Small Cap"
    },
    "002371.SZ": {
        "short_name": "NAURA TECHNOLOGY G",
        "long_name": "NAURA Technology Group Co., Ltd.",
        "summary": "NAURA Technology Group Co., Ltd. engages in the research, development, manufacture, and sale of electronic equipment and components in the People's Republic of China. The company offers semiconductor equipment, including etching equipment, physical vapor deposition and chemical vapor deposition equipment, oxidation/diffusion equipment, cleaning systems, annealing, and other semiconductor equipment, as well as flat panel display manufacturing equipment, gas mass flow controllers, and other components; and vacuum, atmosphere-protective, and continuous heat treatment equipment, as well as crystal growth equipment, which are used in new energy, new materials, vacuum electronics, aerospace and magnetic materials, and other fields. It also provides turn-key lithium ion battery solutions, including mixer series, coater series, slitting machine series, rolling mill series, winding machine series, laminating machine series, and automatic assembly lines for chip packaging, test equipment, drying equipment, battery pack production line, energy storage cabinets, and others. In addition, the company offers precision components, such as precision resistors, tantalum capacitors, quartz crystal devices, microwave components, power supplies, hybrid integrated circuits, and electronic components for use in aerospace, aviation, automatic control, power electronics, precision instrument, and rail transport industries. The company was formerly known as Beijing Sevenstar Electronics Co., Ltd. and changed its name to NAURA Technology Group Co., Ltd. in February 2017. NAURA Technology Group Co., Ltd. was founded in 2001 and is based in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100176",
        "website": "http://www.naura.com",
        "market_cap": "Large Cap"
    },
    "002384.SZ": {
        "short_name": "SUZHOU DONGSHAN PR",
        "long_name": "Suzhou Dongshan Precision Manufacturing Co., Ltd.",
        "summary": "Suzhou Dongshan Precision Manufacturing Co., Ltd. produces and sells critical components for IoT intelligence, telecommunication equipment, metal precision, LED technologies, and interconnect solutions. The company offers flexible circuits, flexible circuit assembly products, flexible circuit module assembly products, rigid printed circuit boards (PCB), flexible printed circuits, rigid-flex PCBs, and PCB assembly and box build products for automotive, telecom equipment, consumer electronics, high-reliability systems, telecommunications infrastructure, and consumer technology applications. It also provides HD electronic display products, such as indoor fine-pitch RGB and outdoor RGB products for HD displays, TV backlights, mobile phones, and other lighting applications. In addition, the company offers telecom equipment and metal precision products comprising base station antennas, RF filters, technical ceramic products, sheet metal products, stamping parts, die-casting products, and CNC and thermal products for the automotive, communication base station, and medical treatment applications. It provides its products and services in mainland China, Taiwan, South Korea, Finland, India, Sweden, Germany, Poland, Estonia, the United States, and Mexico. The company was formerly known as Suzhou Dongshan Sheet Metal Liability Co., Ltd. and changed its name to Suzhou Dongshan Precision Manufacturing Co., Ltd. in 2007. Suzhou Dongshan Precision Manufacturing Co., Ltd. was founded in 1998 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215107",
        "website": "http://www.dsbj.com",
        "market_cap": "Mid Cap"
    },
    "002387.SZ": {
        "short_name": "VISIONOX TECHNOLOG",
        "long_name": "Visionox Technology Inc.",
        "summary": "Visionox Technology Inc. researches, develops, manufactures, markets, and sells organic light emitting display products worldwide. The company provides active-matrix organic light-emitting diode display and passive-matrix organic light-emitting diode flexible display products that are used in the consumer electronics, communications, railways, petroleum, chemical, metallurgy, machinery, industrial control instruments, finance, health care, automotive displays, and other industries. It also provides aftersales services. The company was formerly known as Blackcow Food Co., Ltd. and changed its name to Visionox Technology Inc. in June 2018. Visionox Technology Inc. was founded in 1996 and is based in Chaoyang, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chaoyang",
        "zipcode": "100027",
        "website": "http://www.visionox.com",
        "market_cap": "Mid Cap"
    },
    "002436.SZ": {
        "short_name": "SHENZHEN FASTPRINT",
        "long_name": "Shenzhen Fastprint Circuit Tech Co., Ltd.",
        "summary": "Shenzhen Fastprint Circuit Tech Co., Ltd. manufactures and sells PCBs in China and internationally. It offers backplanes, HDI boards, high frequency boards, high TG boards, halogen-free boards, flex and rigid-flex boards, and other boards for use in high-tech products; rigid multilayer PCBs, metal-substrate PCBs, HDI PCBs, high-speed signal transmission boards, and semiconductor test products; and IC substrates. The company also provides PCB design services, such as PCB layout design, signal and power integrity design, EMC design and rectification, high speed test, and automatic router training services; and PCB assembly services for electronics manufacturers. It primarily serves communications, aerospace, defense, IT, medical equipment, precision test equipment, and industrial control companies. The company was founded in 1999 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.chinafastprint.com",
        "market_cap": "Mid Cap"
    },
    "002456.SZ": {
        "short_name": "OFILM GROUP CO LTD",
        "long_name": "OFILM Group Co., Ltd.",
        "summary": "OFILM Group Co., Ltd. manufactures and sells optic and photoelectric products. Its products include compact camera modules, touch panel modules, fingerprint recognition module, and electronic products of intelligent vehicles. The company's products are used in consumer electronics, as well as smart phones, tablets, PCs, smart cars, and wearable electronics. It operates in China, the United States, Japan, South Korea, and Europe. The company was formerly known as O-film Tech Co., Ltd. and changed its name to OFILM Group Co., Ltd. in March 2019. OFILM Group Co., Ltd. was founded in 2002 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.ofilm.com",
        "market_cap": "Mid Cap"
    },
    "002463.SZ": {
        "short_name": "WUS PRINTED CIRCUI",
        "long_name": "Wus Printed Circuit (Kunshan) Co., Ltd.",
        "summary": "Wus Printed Circuit (Kunshan) Co., Ltd. engages in the research, development, design, manufacture, and sale of printed circuit boards in China. The company offers backplane, line card, power amplifier, antenna, and server products. Its products are used in communications, communications equipment, and automobiles markets. The company was founded in 1992 and is based in Kunshan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunshan",
        "zipcode": "215300",
        "website": "http://www.wuscn.com",
        "market_cap": "Mid Cap"
    },
    "002475.SZ": {
        "short_name": "LUXSHARE PRECISION",
        "long_name": "Luxshare Precision Industry Co., Ltd.",
        "summary": "Luxshare Precision Industry Co., Ltd., together with its subsidiaries, designs, manufactures, and sells cable assembly and connector system solutions worldwide. The company primarily offers cable assemblies, connectors, power cables, antennas, bare wires, coaxial and flexible cables, flexible printed circuit boards, precision hardware/plastic components, acoustic components, and smart wearables. Its products are used in enterprise, cloud, automotive, medical applications, as well as consumer electronics, such as computers, devices, and peripherals. The company was founded in 2004 and is based in Dongguan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": null,
        "website": "http://www.luxshare-ict.com",
        "market_cap": "Large Cap"
    },
    "002579.SZ": {
        "short_name": "HUIZHOU CHINA EAGL",
        "long_name": "Huizhou China Eagle Electronic Technology Inc.",
        "summary": "Huizhou China Eagle Electronic Technology Co., Ltd. researches and develops, produces, and sells printed circuit boards in China and internationally. The company's products include offers rigid and flexible circuit, multilayer, HDI, and aluminum substrate boards. Its products are used in consumer electronics, network communications, automotive electronics, security, LED displays, medical equipment, AI, IOT, AR/VR, and drones, etc. The company was founded in 2000 and is headquartered in Huizhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huizhou",
        "zipcode": null,
        "website": "http://www.ceepcb.com",
        "market_cap": "Small Cap"
    },
    "002587.SZ": {
        "short_name": "SHENZHEN AOTO ELEC",
        "long_name": "Shenzhen AOTO Electronics Co., Ltd.",
        "summary": "Shenzhen AOTO Electronics Co., Ltd. designs, manufactures, and sells LED display products and solutions in China and internationally. It offers commercial LED display solutions for high-end retail and transport applications, command centers, conference halls, and broadcast studios; out of home, indoor, and outdoor LED display products; LED video controllers; rental LED display products; and software systems. AOTO Electronics Co., Ltd. was founded in 1993 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.szaoto.com",
        "market_cap": "Small Cap"
    },
    "002600.SZ": {
        "short_name": "LINGYI ITECH (GUAN",
        "long_name": "Lingyi iTech (Guangdong) Company",
        "summary": "Lingyi Itech (Guangdong) Company develops, produces, and sells magnetic materials and products. The company offers permanent ferrite magnets, such as wet and dry anisotropic, isotropic, and rubber ferrite magnets; bonded NdFeB and sintered SmCo magnets; and Ni-Zn and Mn-Zn ferrite cores, and inductors with ferrite cores. It also offers precision components and modules, precision structural parts, liquid crystal display modules, capacitive touch screens, wires and cables, and motors. In addition, the company provides trade logistics and supply chain finance services. Its products are used in consumer electronics, automotive control, smart security, smart wear and home, new materials, new energy vehicles, and other fields. The company was founded in 1975 and is based in Jiangmen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiangmen",
        "zipcode": "529000",
        "website": "http://www.lingyiitech.com",
        "market_cap": "Mid Cap"
    },
    "002618.SZ": {
        "short_name": "SHENZHEN DANBOND",
        "long_name": "Shenzhen Danbond Technology Co.,Ltd.",
        "summary": "Shenzhen Danbond Technology Co.,Ltd. engages in the research, development, manufacture, and sale of flexible circuits and its materials primarily in China. The company offers FCCL single and double side substrates used in LCD monitors, LCD TVs, cameras, mobile phones, netbooks, e-books, cars, etc.; COF flexible encapsulation substrates; COF products used in LCD TVs, smart 3G phones and laptop computers, and other products with LCD display drivers; and FPC flexible printed circuit boards. It also provides encapsulation-related heat curing adhesive and micro adhesive glue films. The company was founded in 2001 and is based in Shenzhen, China. Shenzhen Danbond Technology Co.,Ltd. is a subsidiary of Shenzhen Danbond Investment Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.danbang.com",
        "market_cap": "Micro Cap"
    },
    "002655.SZ": {
        "short_name": "GETTOP ACOUSTIC CO",
        "long_name": "Gettop Acoustic Co., Ltd.",
        "summary": "Gettop Acoustic Co., Ltd. manufactures and sells electro-acoustic components and assemblies worldwide. It offers miniature microphones, micro speakers/receivers, and module products. The company's products are used in mobile communication devices, portable PC and flat panel TV products, personal digital devices, car kits, and other consumer electronics. It also provides electro-acoustic solutions. The company was formerly known as Shandong Gettop Acoustic Co., Ltd. and changed its name to Gettop Acoustic Co., Ltd. in October 2018. Gettop Acoustic Co., Ltd. was founded in 2001 and is headquartered in Weifang, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Weifang",
        "zipcode": "261200",
        "website": "http://www.gettopacoustic.com",
        "market_cap": "Small Cap"
    },
    "002660.SZ": {
        "short_name": "SHENZHEN MOSO POWE",
        "long_name": "Moso Power Supply Technology Co.,Ltd",
        "summary": "MOSO Power Supply Technology Co., Ltd. provides power supply solutions in China and internationally. The company offers LED drivers, such as road, industrial, and landscape lighting solutions; and switch power supply products comprising wall plugs, desktops, and bare boards. It also provides photovoltaic products, including single-phase, two-phase, and three-phase string inverters; and charging piles. MOSO Power Supply Technology Co., Ltd. was founded in 2006 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518108",
        "website": "http://www.mosopower.com",
        "market_cap": "Small Cap"
    },
    "002729.SZ": {
        "short_name": "HOLLYLAND (CHINA)",
        "long_name": "Hollyland (China) Electronics Technology Corporation Limited",
        "summary": "Hollyland (China) Electronics Technology Corporation Limited engages in the development, production, and marketing of circuit protection products worldwide. The company offers various products, including axial leaded fuse; low voltage fuse; radial lead fuse; SMD fuse; miniature fuse, micro fuse; new energy application fuse, such as photovoltaic fuse and electric vehicle and charger; thermal fuse; PPTC; and fuse accessories, as well as other circuit protection devices. Its products are used in communication, computer, transportation, toy, household appliance, battery, new energy resource, and other electronic power system protection applications. The company was formerly known as Xiamen Ningly Electronics Company Limited and changed its name to Hollyland (China) Electronics Technology Corporation Limited in July 2010. Hollyland (China) Electronics Technology Corporation Limited was founded in 1992 and is headquartered in Xiamen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361000",
        "website": "http://www.hollyfuse.com",
        "market_cap": "Small Cap"
    },
    "002815.SZ": {
        "short_name": "SUNTAK TECHNOLOGY",
        "long_name": "Suntak Technology Co.,Ltd.",
        "summary": "Suntak Technology Co.,Ltd. manufactures and sells printed circuit boards in China. The company offers 4-layer rigid-flexible, golden finger, backplane, heavy copper, and copper paste filling boards; HDI boards; layer, black-ink, and multilayer rigid flexible boards, as well as large panel lamination boards; double sided, single sided, and 4 layer flex boards; and multilayer boards. Its products are used in communication, industrial control, power electronics, medical, security, consuming, computer, automotive, aerospace, military, and other industries. The company also exports its products to Europe, North America, Japan, and other Asia Pacific countries. The company was formerly known as Shenzhen Suntak Circuit Technology Co., Ltd. and changed its name to Suntak Technology Co.,Ltd. in May 2018. Suntak Technology Co.,Ltd. was founded in 1995 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518132",
        "website": "http://www.suntakpcb.com",
        "market_cap": "Small Cap"
    },
    "002841.SZ": {
        "short_name": "GUANGZHOU SHIYUAN",
        "long_name": "Guangzhou Shiyuan Electronic Technology Company Limited",
        "summary": "Guangzhou Shiyuan Electronic Technology Company Limited engages in the design, development, and sale of LCD main boards, intelligent interactive panels, medical devices, and related intelligent hardware in the People's Republic of China. It also offers interactive flat panels, and software and peripheral products; smart home and automotive electronics; and artificial intelligence products, as well as corporate services. The company markets its products under the seewo and MAXHUB brand names. Its products are used in education and commercial sectors. In addition, the company offers medical devices for home and hospital use under the Xicoo brand name. Guangzhou Shiyuan Electronic Technology Company Limited was founded in 2005 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.cvte.com",
        "market_cap": "Large Cap"
    },
    "002850.SZ": {
        "short_name": "SHENZHEN KEDALI IN",
        "long_name": "Shenzhen Kedali Industry Co., Ltd.",
        "summary": "Shenzhen Kedali Industry Co., Ltd. produces and sells structural components of new energy, automobiles, and solar/electrical powered automobile batteries. The company offers IT lithium battery parts, power battery components, and structural battery parts. It serves manufacturers of lithium-ion batteries and power battery cells. The company was founded in 1996 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518109",
        "website": "http://www.kedali.com.cn",
        "market_cap": "Mid Cap"
    },
    "002866.SZ": {
        "short_name": "JIANGSU TRANSIMAGE",
        "long_name": "Jiangsu Transimage Technology Co., Ltd.",
        "summary": "Jiangsu Transimage Technology Co., Ltd. researches, produces, and sells flexible circuit boards, notebook computer accessories, insulation conductive materials, and rubber and other products in China. It also provides MEM, touch pad, and film printed circuit products. The company was founded in 2007 and is based in Gaoyou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Gaoyou",
        "zipcode": "225 600",
        "website": "http://www.transimage.cn",
        "market_cap": "Small Cap"
    },
    "002885.SZ": {
        "short_name": "SHENZHEN JINGQUANH",
        "long_name": "Shenzhen JingQuanHua Electronics Co.,Ltd.",
        "summary": "Shenzhen JingQuanHua Electronics Co.,Ltd. designs, manufactures, and sells electromagnetic components, power supplies, and specialized transformers worldwide. The company offers chargers, power adapters, customized power supplies, and smart power converters; high and low frequency transformers, filters, inductors, potting components, and others; and three phase transformers and specialized reactors. Its products are primarily used in various applications, such as home appliance, consumer electronic, UPS power application, LED lightings, telecom, PV inverter, etc. Shenzhen JingQuanHua Electronics Co.,Ltd. was founded in 1996 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518110",
        "website": "http://www.everrise.net",
        "market_cap": "Small Cap"
    },
    "002897.SZ": {
        "short_name": "WENZHOU YIHUA CONN",
        "long_name": "Wenzhou Yihua Connector Co., Ltd.",
        "summary": "Wenzhou Yihua Connector Co., Ltd. manufactures and sells electronic connectors in China. It offers network connectors, consumer electronic connectors and wire harness products, optical transceivers, and power and automotive connectors, as well as wired jacks and transformer series connectors. The company was founded in 1995 and is based in Yueqing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yueqing",
        "zipcode": null,
        "website": "http://www.czt.cn",
        "market_cap": "Small Cap"
    },
    "002902.SZ": {
        "short_name": "DONGGUAN MENTECH O",
        "long_name": "Dongguan Mentech Optical & Magnetic Co., Ltd.",
        "summary": "Dongguan Mentech Optical & Magnetic Co., Ltd. researches, develops, manufactures, and sells magnetic and optical components/modules for data communication industries in China and internationally. The company offers optical transceivers and components; energy equipment, including telecommunication power supply systems, PV power supply systems, power distribution equipment, and telecommunication power modules; and high speed IO and RJ connectors. It also provides magnetic components, such as telecom and power magnetic components and multilayer inductance; and consumer power supply products comprising adapters and chargers. The company's products are used in the access network, backbone, metro, fiber optic switch, fiber optic transceiver, digital television, optical communication, motherboard, network switch, router, set-top box, and network data communication industries. Dongguan Mentech Optical & Magnetic Co., Ltd. was founded in 2008 and is headquartered in Dongguan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": null,
        "website": "http://www.mnc-tek.com",
        "market_cap": "Small Cap"
    },
    "002913.SZ": {
        "short_name": "AOSHIKANG TECHNOLO",
        "long_name": "AoshikangTechnologyCo. ,Ltd",
        "summary": "Aoshikang Technology Co., Ltd engages in the research, development, production, and sale of printed circuit boards in Asia, Europe, and the Americas. The company offers double-sided and multi-layer printed circuit boards. Its products are used in computer, consumer electronics, communications equipment, automotive electronics, industrial control and medical electronics, and other fields. The company was formerly known as Aoshikang Technology (Yiyang) Co., Ltd. Aoshikang Technology Co., Ltd was founded in 2005 and is based in Yiyang, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yiyang",
        "zipcode": null,
        "website": "http://www.askpcb.com",
        "market_cap": "Small Cap"
    },
    "002916.SZ": {
        "short_name": "SHENNAN CIRCUITS C",
        "long_name": "Shennan Circuit Company Limited",
        "summary": "Shennan Circuit Company Limited designs, manufactures, and sells printed circuit boards, packaging substrates, and electronic assemblies in China and internationally. The company was formerly known as CATIC Shenzhen Shennan Circuit Company and changed its name to Shennan Circuit Company Limited in January 2000. Shennan Circuit Company Limited was founded in 1984 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518117",
        "website": "http://www.scc.com.cn",
        "market_cap": "Mid Cap"
    },
    "002938.SZ": {
        "short_name": "AVARY HOLDING (SHE",
        "long_name": "Avary Holding (Shenzhen) Co., Limited",
        "summary": "Avary Holding (Shenzhen) Co., Limited engages in the research and development, design, manufacture, and sale of printed circuit boards primarily in China. Its products are used in communication, consumer electronic and computer, and automotive electronics and industrial control industries. The company was founded in 1999 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.avaryholding.com",
        "market_cap": "Large Cap"
    },
    "002947.SZ": {
        "short_name": "SUZHOU HENGMINGDA",
        "long_name": "Suzhou Hengmingda Electronic Technology Co., Ltd.",
        "summary": "Suzhou Hengmingda Electronic Technology Co., Ltd. primarily engages in the design, research and development, production, and sale of consumer electronic functional devices. The company's principal products are precision functional devices for consumer electronics products. Its products are used in mobile phones, tablet and notebook computers, smart wearable devices, and other consumer electronic products and components. The company was founded in 2011 and is based in Kunshan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunshan",
        "zipcode": null,
        "website": "http://www.hengmingda.com",
        "market_cap": "Small Cap"
    },
    "002955.SZ": {
        "short_name": "HITEVISION CO LTD",
        "long_name": "Hitevision Co., Ltd.",
        "summary": "Hitevision Co., Ltd. develops and manufactures multi-media audio visual solutions worldwide. The company offers unified collaboration solutions, such as InGlassTM, PCAP, and infrared touch technology solutions, as well as integration of audio and video, and stylish design fits; interactive education solutions; and OC module and optical bonding technology solutions. It serves customers in education and audio visual industry. The company was founded in 1990 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.honghe-tech.com",
        "market_cap": "Small Cap"
    },
    "002962.SZ": {
        "short_name": "HUBEI W-OLF PHOTOE",
        "long_name": "Hubei W-olf Photoelectric Technology Co., Ltd.",
        "summary": "Hubei W-olf Photoelectric Technology Co., Ltd. engages in the research and development, production, and sale of precision photoelectric film components in China. The company's principal products include infrared cut-off filters and biometric filters. Its products are primarily used in digital imaging fields, such as phone cameras, computer built-in cameras, car cameras, and security cameras. The company was founded in 2012 and is headquartered in Jingzhou City, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jingzhou City",
        "zipcode": null,
        "website": "http://www.w-olf.com",
        "market_cap": "Small Cap"
    },
    "002963.SZ": {
        "short_name": "HES TECHNOLOGY GRO",
        "long_name": "Haoersai Technology Group Corp., Ltd.",
        "summary": "Haoersai Technology Group Corp., Ltd. specializes in architectural and landscape lighting design and engineering services. The company undertakes architectural lighting design and construction projects for Fortune 500 enterprises, and Chinese ministries and commissions. The company was formerly known as HES Technology Group Co., Ltd. and changed its name to Haoersai Technology Group Corp., Ltd. in May 2020. Haoersai Technology Group Corp., Ltd. is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.haoersai.com",
        "market_cap": "Small Cap"
    },
    "002972.SZ": {
        "short_name": "SHENZHEN KEANDA EL",
        "long_name": "Shenzhen keanda electronic technology co.,ltd",
        "summary": "Shenzhen keanda electronic technology co.,ltd develops, designs, produces, and markets rail transit signaling control system and lightning protection products. It offers integrated lightning protection grounding systems. The company was founded in 1998 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518026",
        "website": "http://www.keanda.com.cn/indexe.aspx",
        "market_cap": "Small Cap"
    },
    "002983.SZ": {
        "short_name": "ANHUI COREACH TECH",
        "long_name": "Anhui Coreach Technology Co.,Ltd",
        "summary": "Anhui Coreach Technology Co.,Ltd engages in the research and development, production, and sale of display photoelectric and health intelligent light source systems. It offers backlight, lighting, and packaging products. The company was founded in 2012 and is headquartered in Hefei, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": null,
        "website": "http://www.coreach.com.cn",
        "market_cap": "Small Cap"
    },
    "002992.SZ": {
        "short_name": "SHENZHEN BAOMING T",
        "long_name": "Shenzhen Baoming Technology Co.,Ltd.",
        "summary": "Shenzhen Baoming Technology Co.,Ltd. engages in the research and development, production, and sale of LED backlight modules and capacitive touch screens of small and medium size flat panel display devices in China. Its LED backlight modules are used in mobile phones, as well as other small and medium size displays, such as GPS and digital cameras; and capacitive touch screens are used in mobile phones and tablet PCs. The company was founded in 2006 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518110",
        "website": "http://www.bmseiko.com",
        "market_cap": "Small Cap"
    },
    "003028.SZ": {
        "short_name": "GENBYTE TECHNOLOGY",
        "long_name": "Genbyte Technology Inc.",
        "summary": "Genbyte Technology Inc. manufactures and sells controllers for use in household appliances, industrial inverters, and power supply and automotive products in China. It offers refrigerator controllers, inverter air-conditioner controllers, washing machine controllers, controllers for kitchen and bath appliances, controllers for small appliances, automotive refrigerator and air-conditioner controllers, controllers for switch mode power supplies, remote controllers, controllers for industrial inverter, FPC controllers, and high voltage power supply products. The company was founded in 1999 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.ezhenbang.com",
        "market_cap": "Small Cap"
    },
    "0334.HK": {
        "short_name": "CH DISPLAY OPT",
        "long_name": "China Display Optoelectronics Technology Holdings Limited",
        "summary": "China Display Optoelectronics Technology Holdings Limited, an investment holding company, engages in the research, development, manufacture, distribution, and sale of liquid crystal display modules for mobile phones and tablets in Mainland China, Hong Kong, Turkey, Thailand, South Korea, and Taiwan. It is also involved in the development and sale of software, and provision of technical consultancy services. The company was formerly known as TCL Display Technology Holdings Limited and changed its name to China Display Optoelectronics Technology Holdings Limited in January 2017. The company was founded in 2004 and is headquartered in HuiZhou, the People's Republic of China. China Display Optoelectronics Technology Holdings Limited is a subsidiary of High Value Ventures Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Huizhou",
        "zipcode": "516006",
        "website": "http://www.tcldisplay.com",
        "market_cap": "Micro Cap"
    },
    "1415.HK": {
        "short_name": "COWELL",
        "long_name": "Cowell e Holdings Inc.",
        "summary": "Cowell e Holdings Inc., an investment holding company, engages in the design, development, manufacture, and sale of camera modules for smartphones, multimedia tablets, and other mobile devices with camera functions in the People's Republic of China, the Republic of Korea, and internationally. It also designs, develops, manufactures, and sells optical components used in various consumer electronics products. It offers camera modules for mobile device manufacturers; and optical components to subsidiaries or affiliates of electronics companies. Cowell e Holdings Inc. was founded in 2006 and is headquartered in Dongguan, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": null,
        "website": "http://www.cowelleholdings.com",
        "market_cap": "Small Cap"
    },
    "1639.HK": {
        "short_name": "AKM INDUSTRIAL",
        "long_name": "AKM Industrial Company Limited",
        "summary": "AKM Industrial Company Limited, an investment holding company, manufactures and sells flexible printed circuits (FPC), flexible packaging substrates, and related components in the People's Republic of China, Hong Kong, and internationally. The company also sources and sells electronic components, raw materials, and equipment; trades in FPCs and related products; and develops new energy car electronics module products. It provides its products to manufacturers of wearable products, optical camera modules, and display modules. The company was incorporated in 1993 and is based in Guangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.akmcompany.com",
        "market_cap": "Micro Cap"
    },
    "200020.SZ": {
        "short_name": "S/Z ZHONGHENG HUAF",
        "long_name": "Shenzhen Zhongheng Huafa Co., Ltd.",
        "summary": "Shenzhen Zhongheng Huafa Co., Ltd. produces and sells injection molded parts, light packaging materials, and LCD whole machines primarily in Central and South China, and Hong Kong. It is also involved in property leasing and management operations. The company was formerly known as Shenzhen Huafa Electronics Co.,Ltd. and changed its name to Shenzhen Zhongheng Huafa Co., Ltd. in September 2007. Shenzhen Zhongheng Huafa Co., Ltd. was founded in 1981 and is headquartered in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518031",
        "website": "http://www.hwafa.com.cn",
        "market_cap": "Micro Cap"
    },
    "200413.SZ": {
        "short_name": "DONGXU OPTOELECTRO",
        "long_name": "Tunghsu Optoelectronic Technology Co., Ltd.",
        "summary": "Tunghsu Optoelectronic Technology Co., Ltd. engages in the development and sale of liquid crystal glass substrates and equipment in China. It also offers energy buses, and single-layer graphene and graphene-based lithium-ion battery related products; and purchases and sells memory chip products, peripherals and e-sports main computers, LCD screen modules, and whole machine products. In addition, the company is involved in the development and sale of real estate properties. The company was formerly known as Shijiazhuang Baoshi Electronic Glass Co., Ltd. Tunghsu Optoelectronic Technology Co., Ltd. was founded in 1992 and is based in Shijiazhuang, China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": "050035",
        "website": "http://www.dongxuguangdian.com.cn",
        "market_cap": "Small Cap"
    },
    "2382.HK": {
        "short_name": "SUNNY OPTICAL",
        "long_name": "Sunny Optical Technology (Group) Company Limited",
        "summary": "Sunny Optical Technology (Group) Company Limited, an investment holding company, engages in designing, researching, developing, manufacturing, and selling optical and optical related products, and scientific instruments. It operates through three segments: Optical Components, Optoelectronic Products, and Optical Instruments. The company's products include optical components, such as glass spherical and aspherical lenses, plane products, handset lens sets, vehicle lens sets, security surveillance lens sets, and other lens sets; optoelectronic products, such as handset camera modules, three dimensional optoelectronic products, vehicle modules, and other optoelectronic modules; and optical instruments comprising microscopes and intelligent equipment for testing. Its optoelectronic-related products are used in handsets, digital cameras, vehicle imaging and sensing systems, security surveillance systems, and virtual reality/augmented reality, which are combined with optical, electronic, software, and mechanical technologies. In addition, the company engages in the research and development of infrared technologies; trading of optical instruments and optoelectronics products; property leasing activities; and development, service, and consultation of technology, as well as provision of financing services. It operates primarily in the People's Republic of China, Vietnam, Korea, Japan, India, and the United States. The company was founded in 1984 and is headquartered in Yuyao, China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Yuyao",
        "zipcode": "315400",
        "website": "http://www.sunnyoptical.com",
        "market_cap": "Large Cap"
    },
    "300069.SZ": {
        "short_name": "ZHEJIANG JINLIHUA",
        "long_name": "Zhejiang Jinlihua Electric Co., Ltd.",
        "summary": "Zhejiang Jinlihua Electric Co., Ltd. engages in the research, development, manufacture, and supply of functional glass and insulation products for use in HV, UHV, and EHV transmission lines in China and internationally. It offers standard and pollution-resistant suspension insulators; aerodynamic glass insulators; and ground wire type suspension glass insulators. The company was formerly known as Zhejiang Jinlihua Electric Limited and changed its name to Zhejiang Jinlihua Electric Co., Ltd. Zhejiang Jinlihua Electric Co., Ltd. was founded in 2003 and is based in Jinhua, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinhua",
        "zipcode": "321037",
        "website": "http://www.jlhdq.com",
        "market_cap": "Micro Cap"
    },
    "300083.SZ": {
        "short_name": "GUANGDONG CREATE C",
        "long_name": "Guangdong Create Century Intelligent Equipment Group Corporation Limited",
        "summary": "Guangdong Create Century Intelligent Equipment Group Corporation Limited researches and develops, designs, manufactures, and sells consumer electronics precision structural products in the People's Republic of China. The company offers precision molds, optical glasses, magnesium alloys, antennas, and powder metallurgy products, as well as CNC products. It offers its products for mobile phones, tablets, smart wear equipment, and virtual reality VR. The company was formerly known as Guangdong Create Century Intelligent Equipment Corporation Limited and changed its name to Guangdong Create Century Intelligent Equipment Group Corporation Limited in December 2020. Guangdong Create Century Intelligent Equipment Group Corporation Limited was founded in 2003 and is based in Dongguan, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": "523878",
        "website": "http://www.januscn.com",
        "market_cap": "Mid Cap"
    },
    "300115.SZ": {
        "short_name": "SHENZHEN EVENWIN P",
        "long_name": "Shenzhen Everwin Precision Technology Co., Ltd.",
        "summary": "Shenzhen Everwin Precision Technology Co., Ltd. produces and sells mobile communication terminal, digital, and optoelectronic products in China and internationally. The company offers terminal components, such as metal bands, ceramic parts, components, stamping parts, connectors, and precision LED stents; energy components, including hydrogen fuel cells, power battery cover plates, busbars, precision automobile electronics, charging equipment, and HDC products; and industrial robot and system integration products. Shenzhen Everwin Precision Technology Co., Ltd. was founded in 2001 is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518103",
        "website": "http://www.ewpt.com",
        "market_cap": "Mid Cap"
    },
    "300127.SZ": {
        "short_name": "CHENGDU GALAXY MAG",
        "long_name": "Chengdu Galaxy Magnets Co.,Ltd.",
        "summary": "Chengdu Galaxy Magnets Co.,Ltd. engages in the research, development, production, and sale of magnets primarily in the People's Republic of China, Japan, Europe, the United States, South Korea, Taiwan, and other countries. The company offers bonded NdFeB magnets used in automotive motors, hard disk drives, stepper motors, water pumps, oil pumps, DC motors, brushless motors, starter motors, and sensors; and hot-pressed NdFeB magnets used in automotive motors, power tools, servo motors, and small precision brushless motors. It also provides samarium-cobalt magnets used in aviation, aerospace, military electronics, automobiles, sensors, petrochemicals, magnetic transmission, and other fields; injection molded magnets used in household appliances, automobiles, office equipment, 3C products, and other fields; and magnet assemblies used in adhesive components and injection molding components. The company was founded in 1993 and is based in Chengdu, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "611731",
        "website": "http://www.galaxymagnets.com",
        "market_cap": "Small Cap"
    },
    "300128.SZ": {
        "short_name": "SUZHOU JINFU TECHN",
        "long_name": "Suzhou Jinfu Technology Co., Ltd.",
        "summary": "Suzhou Jinfu Technology Co., Ltd. provides electronic manufacturing, Internet of Things cloud storage, and cloud computing services in China. It offers optoelectronic display thin film devices, LCD modules/machines, and automation equipment and fixtures. The company was formerly known as Suzhou Jinfu New Material Co., Ltd. and changed its name to Suzhou Jinfu Technology Co., Ltd. in February 2017. Suzhou Jinfu Technology Co., Ltd. was founded in 2004 and is headquartered in Suzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215123",
        "website": "http://www.jin-fu.cn",
        "market_cap": "Small Cap"
    },
    "300131.SZ": {
        "short_name": "SHENZHEN YITOA INT",
        "long_name": "Shenzhen Yitoa Intelligent Control Co.,Ltd.",
        "summary": "Shenzhen Yitoa Intelligent Control Co., Ltd. provides intelligent control products for appliances in China and internationally. It offers air cylinder, electric toothbrush, hair clamp, and foot tub controllers; lighting, fireplace, electric iron, aromatherapy machine, water dispenser, and purifier controllers; and micro refrigerator, steamer, oven, scones machine, mixer, and coffee maker controllers. The company also offers control products for smart home products, automotive electronics, consumer electronics, and home electronics. In addition, it provides management software and cloud services; and Android platform solution. The company was founded in 2001 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.yitoa.com",
        "market_cap": "Small Cap"
    },
    "300140.SZ": {
        "short_name": "CECEP ENVIRONMENTA",
        "long_name": "CECEP Environmental Protection Equipment Co., Ltd.",
        "summary": "CECEP Environmental Protection Equipment Co., Ltd. manufactures and sells energy-saving and environmental protection equipment worldwide. Its products comprise air pollution control equipment, environmental monitoring equipment, oil and petrochemical industry environmental treatment equipment, industrial waste heat utilization equipment, sewage treatment equipment, motor energy-saving high-end environmental protection equipment, automation systems, and indoor air equipment; transformer chip radiators for UHV and high-speed rail projects; flue gas purification equipment; environmental monitoring solutions, including water, gas, heavy metals, and other monitoring systems, as well as environmental monitoring platforms, emergency monitoring and early warning systems, and pollution source process monitoring systems; and big data services. The company was formerly known as Xi'an Qiyuan Mechanical and Electrical Equipment Co., Ltd. and changed its name to CECEP Environmental Protection Equipment Co., Ltd. in February 2017. CECEP Environmental Protection Equipment Co., Ltd. was founded in 1993 and is based in Xi'an, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710018",
        "website": "http://www.zhzb.cecep.cn",
        "market_cap": "Small Cap"
    },
    "300162.SZ": {
        "short_name": "LEDMAN OPTOELECTRO",
        "long_name": "Ledman Optoelectronic Co., Ltd.",
        "summary": "Ledman Optoelectronic Co., Ltd. develops, manufactures, and markets LED components, LED lighting products, and indoor and outdoor LED displays primarily in the People's Republic of China. The company offers rental, advertising, ED poster, perimeter, and small pixel LED displays. It also provides creative LED displays, such as sphere and cubic, ultra HD, logo, indoor and outdoor, spiral and can, stair, flexible, triangle, Christmas tree, circular, heave drum, platform, energy-saving, die-casting aluminum cabinet, CNC aluminum cabinet, light sculpture, linear light, and solar-powered LED displays, as well as funnel-shaped LED displays for basketball stadiums, advertising LED sidelights and backlights, and curtain-indoor and outdoor LED displays. In addition, the company offers LED components, including LED lamps, and color and white SMD products. Further, its products are used for security, monitoring, education, command centers, business centers, and conference centers. The company also exports its products in approximately 80 countries, such as the United States, Spain, Croatia, Bulgaria, Romania, Poland, Russia, Australia, Chile, Argentina, Brazil, Paraguay, Mexico, Singapore, Thailand, Malaysia, Indonesia, Vietnam, Saudi Arabia, Iran, South Korea, Hong Kong, Taiwan, and other countries. Ledman Optoelectronic Co., Ltd. was founded in 1993 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.ledman.cn",
        "market_cap": "Small Cap"
    },
    "300219.SZ": {
        "short_name": "HONGLI ZHIHUI GROU",
        "long_name": "Hongli Zhihui Group Co., Ltd.",
        "summary": "Hongli Zhihui Group Co., Ltd. develops, produces, and sells LED products in China and internationally. It offers lighting components and modules, including anti-vulcanizing EMC/PCT LEDs, COB LEDs, low/mid power LEDs, high power LEDs, LED filaments, and LED modules; and automotive LED solutions, head lamps, turn signals, stop lamps, DRL products, dashboard lamps, working lights, and atmosphere lamps. The company also provides backlight LED products comprising LED components and light bars; plant growth lighting LEDs; UVC and UVA LEDs; and lamp/infrared LEDs. Its products are used in the general lighting, TV backlight, 3C, automotive lighting, display, and other fields. The company was formerly known as Guangzhou Hongli Opto-Electronic Co., Ltd. and changed its name to Hongli Zhihui Group Co., Ltd. in July 2016. Hongli Zhihui Group Co., Ltd. was founded in 2004 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.honglitronic.com",
        "market_cap": "Small Cap"
    },
    "300224.SZ": {
        "short_name": "YANTAI ZHENGHAI",
        "long_name": "Yantai Zhenghai Magnetic Material Co., Ltd.",
        "summary": "Yantai Zhenghai Magnetic Material Co., Ltd. manufactures and markets neodymium-iron-boron permanent magnets and other magnetic assemblies in the People's Republic of China. Its products have applications in the fields of IT, automobile, petrochemical, mechanics, aerospace, mechanoelectronic, medical, etc. The company is based in Yantai, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yantai",
        "zipcode": "264006",
        "website": "http://www.zhmag.com",
        "market_cap": "Small Cap"
    },
    "300227.SZ": {
        "short_name": "SHENZHEN SUNSHINE",
        "long_name": "Shenzhen Sunshine Laser & Electronics Technology Co., Ltd.",
        "summary": "Shenzhen Sunshine Laser & Electronics Technology Co., Ltd. provides laser technology related products and application services for the manufacturing and processing industries worldwide. The company offers 3D printing products; precision laser stencils; and electronic manufacturing industry related products, including mobile sealing test, FCT test, laptop motherboard reflow, wave solder, automatic dispensing, and FPC magnetic fixtures, as well as anti-static inspection templates. It is also involved in the personalized design and manufacturing of precise metal and non-metal components. In addition, the company engages in the provision of laser structuring of flexible circuit boards, precision laser drilling, and 3D laser direct structuring activities. Shenzhen Sunshine Laser & Electronics Technology Co., Ltd. was founded in 1998 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518051",
        "website": "http://www.sunshine-laser.com",
        "market_cap": "Small Cap"
    },
    "300232.SZ": {
        "short_name": "UNILUMIN GROUP CO",
        "long_name": "Unilumin Group Co., Ltd.",
        "summary": "Unilumin Group Co., Ltd., together with its subsidiaries, designs, develops, manufactures, sells, and services LED display and lighting solutions in China and internationally. The company offers various industry solutions, including security monitoring, broadcasting room, video conference, control room, etc. It also provides LED display units, and plug and play LED TVs; rental LED displays; fixed LED display products, including LED signage solutions, outdoor SMD LED displays/products for DOOH market, and other LED display products; and surge arrestors. In addition, the company offers LED outdoor lighting solutions comprising street lighting, tunnel lighting, and canopy lighting, as well as energy management control solutions. Further, it produces and processes SMD patch, high-power lamp, and other LED products; and provides online and warranty services. Additionally, it provides creative displays for stage, architecture, TV studio, etc.; and LED displays for professional markets. The company operates electrical flagship stores under the Unilumin-HIWIN brand, as well as other online stores under the Tmall, JD, No.1 shop, and Suning brands. Unilumin Group Co., Ltd. was founded in 2004 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518103",
        "website": "http://www.unilumin.com",
        "market_cap": "Small Cap"
    },
    "300242.SZ": {
        "short_name": "KAISA JIAYUN TECHN",
        "long_name": "KAISA Jiayun Technology Inc.",
        "summary": "KAISA Jiayun Technology Inc. engages in the mobile Internet marketing business in China. The company's integrated marketing services, include SEM, application distribution, information flow advertising, and super APP brand marketing. It serves network service, e-commerce, finance, and other industries. The company was formerly known as MIG Unmobi Technology Inc. and changed its name to KAISA Jiayun Technology Inc. in May 2018. KAISA Jiayun Technology Inc. was founded in 2002 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "523475",
        "website": "http://www.kaisacloud.com",
        "market_cap": "Small Cap"
    },
    "300249.SZ": {
        "short_name": "YIMIKANG TECH GROU",
        "long_name": "Yimikang Tech.Group Co., Ltd.",
        "summary": "Yimikang Tech.Group Co., Ltd. manufactures and sells precision air conditioning solutions in China. It provides precision air conditioner, micro-module and smart cabinet, magnetic suspension integrated cold station, intelligent control, and diversified products; SHD modular operating room products for prefabricated modular inter-operators, ICUs, CSSDs, and laboratories; and square tower shadow less lamps. The company also offers dust removal, desulfurization, and denitration equipment for environment protection; and hardware, software, outdoor magnetic suspension mainframe, cold station, and data centre solutions, as well as designing, integrated packaging, and operation and maintenance services. It serves the government, military, communications, data centre, energy, power, transportation, medical, scientific research, school, and other industries. The company was formerly known as Sichuan Yimikang Environmental Tech. Co., Ltd. and changed its name to Yimikang Tech.Group Co., Ltd. in February 2018. Yimikang Tech.Group Co., Ltd. was founded in 2002 and is headquartered in Chengdu, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": null,
        "website": "http://www.ymk.com.cn",
        "market_cap": "Small Cap"
    },
    "300256.SZ": {
        "short_name": "ZHEJIANG FIRSTAR",
        "long_name": "Zhejiang Firstar Panel Technology Co., Ltd.",
        "summary": "Zhejiang Firstar Panel Technology Co., Ltd. develops, produces, and sells various sight glass protective screens, touch screens, touch display modules, display devices, and relevant materials and modules in China and internationally. It also offers covers, touch panels, fingerprint identification modules, and precision components. Zhejiang Firstar Panel Technology Co., Ltd. was founded in 2003 and is headquartered in Taizhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taizhou",
        "zipcode": "318015",
        "website": "http://www.first-panel.com",
        "market_cap": "Small Cap"
    },
    "300279.SZ": {
        "short_name": "WUXI HODGEN TECHNO",
        "long_name": "WUXI HODGEN TECHNOLOGY CO., LTD.",
        "summary": "Wuxi Hodgen Technology Co., Ltd. produces and sells intelligent controllers for white goods. It offers refrigeration, heating, washing, and small appliances controllers. The company is based in Wuxi, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214145",
        "website": "http://www.hodgen-china.com",
        "market_cap": "Small Cap"
    },
    "300296.SZ": {
        "short_name": "LEYARD OPTOELECTRO",
        "long_name": "Leyard Optoelectronic Co., Ltd.",
        "summary": "Leyard Optoelectronic Co., Ltd. designs, produces, distributes, and services digital displays, video walls, and visualization products worldwide. The company offers LED video walls, LCD video walls, large format LCD displays, processors and players, 4K LCD displays, rear projection video walls, touch displays, accessories, and custom displays, as well as LED display products for rental and staging applications. It serves control room, corporate, digital signage, hospitality, oil and gas, retail, broadcast, higher education, healthcare, museums, sports and entertainment, government, rental and staging, and house of worship markets. The company was formerly known as Beijing Leyard Electronics Technology Co Ltd. Leyard Optoelectronic Co., Ltd. has a strategic partnership with Lighthouse Technologies Ltd. for providing a range of sports venue display solutions. The company was founded in 1995 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100091",
        "website": "http://www.leyard.com",
        "market_cap": "Mid Cap"
    },
    "300303.SZ": {
        "short_name": "SHENZHEN JUFEI OPT",
        "long_name": "Shenzhen Jufei Optoelectronics Co., Ltd.",
        "summary": "Shenzhen Jufei Optoelectronics Co., Ltd. engages in the research and development, production, and sale of SMD LED devices in China, South Korea, Japan, India, Turkey, and internationally. The company offers backlight LED devices, lighting LED, display, automotive, and flash LED devices, as well as backlight LED modules, optical film, and TO-CAN products. Its products are used in various applications, such as mobile communications, liquid crystal display, lighting, automotive electronics and lighting, screen displays, Nixie tube, and other electrical appliances. The company was founded in 2005 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518111",
        "website": "http://www.jfled.com",
        "market_cap": "Small Cap"
    },
    "300306.SZ": {
        "short_name": "HANGZHOU EVERFINE",
        "long_name": "HangZhou Everfine Photo-e-info Co., Ltd.",
        "summary": "HangZhou Everfine Photo-e-info Co., Ltd. provides LED and lighting measurement instruments to institutes, laboratories, and corporations in China. It offers spectroradiometers, goniophotometers, LED aging-life test system, LED thermal analysis system, optical radiation safety system, start-time and flicker test, illuminance and UV irradiance meter, automotive and traffic light, test accessories, and automated online testing equipment. The company also provides smartphone and tablet, liquid crystal display, TV, OLED, LED display, vehicle and airborne display, backlight and LCM module, and projector measurement systems; optical instruments for luminance and color measurement; and standard luminance and chromaticity sources. In addition, it offers spectrophotometers, glossmeters, haze meters, test systems for transmittance and reflectance, and standard light source boxes. Further, the company provides ultraviolet irradiance meters, ultraviolet spectrometers, ultraviolet inspection devices, UV standard light sources, and ultraviolet radiant intensity distribution test systems. Additionally, it offers EMS and EMI test systems; shielded room and anechoic chambers; digital power meters; accurate power supply products; electronic ballast and components analyzers; and test and calibration services. The company also exports its products to the United States, Europe, Japan, and other countries and regions. HangZhou Everfine Photo-e-info Co., Ltd. is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310053",
        "website": "http://www.everfine.net",
        "market_cap": "Small Cap"
    },
    "300319.SZ": {
        "short_name": "SHENZHEN MICROGATE",
        "long_name": "Shenzhen Microgate Technology Co., Ltd.",
        "summary": "Shenzhen Microgate Technology Co., Ltd. operates in the multilayer passive component industry worldwide. The company engages in the research, development, manufacture, and sale of LTCC RF components, chip inductors, EMI/EMC components, power inductors, and NFC antennas, as well as chip circuit protect and coil components, molding products, wirewound power inductors, SAW filters and duplexers, and chip EMC components. Its products are used in DVD players, mobile phones, personal computers, flat panel displays, car carriers, MP3s and MP4s, GPS systems, and other consumptive manufactures, as well as wireless, digital product, LCD/LED TV and monitor, and other applications. The company was founded in 2001 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.szmicrogate.com",
        "market_cap": "Small Cap"
    },
    "300353.SZ": {
        "short_name": "KYLAND TECHNOLOGY",
        "long_name": "Kyland Technology Co., Ltd.",
        "summary": "Kyland Technology Co., Ltd. researches, develops, manufactures, and sells industrial Ethernet products in China and internationally. The company offers industrial Ethernet solutions, including layer 3 backbone, rackmount, DIN in rail, un-managed, EN50155, ITS, PoE, video surveillance, and intrinsic safety Ethernet switches; industrial Ethernet modules; network management software; serial device servers; optical fiber converters; SFP modules; accessories; multi-function switching platforms; and Profinet switches. It also provides industrial communication chips/bus chips; industrial Internet OS/cloud platforms; and edge computing servers, such as industrial, traffic, and power servers. In addition, the company offers intelligent terminals comprising intelligent gateways and switch all-in-one devices; redundant network solutions; timing solutions that include time servers, time distributors, time convertors, and time test analyzers; and smart city and energy Internet products. Its products are used in the power, rail, oil and gas, and automation markets. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100144",
        "website": "http://www.kyland.com",
        "market_cap": "Small Cap"
    },
    "300403.SZ": {
        "short_name": "HANYU GROUP JOINT-",
        "long_name": "Hanyu Group Joint-Stock Co., Ltd.",
        "summary": "Hanyu Group Joint-Stock Co., Ltd. manufactures and supplies washing machine and dishwasher core components, and drainage pumps for household appliances in China. It offers spa toilet, permanent magnet ferrite radial anisotropy rotor, and special engineering plastic products, as well as automotive core components and micro-charged products. The company was formerly known as Jiangmen iDear-Hanyu Electrical Joint-Stock Co., Ltd. and changed its name to Hanyu Group Joint-Stock Co., Ltd. in December 2019. Hanyu Group Joint-Stock Co., Ltd. was founded in 2002 and is based in Jiangmen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiangmen",
        "zipcode": "529040",
        "website": "http://www.idearhanyu.com",
        "market_cap": "Small Cap"
    },
    "300408.SZ": {
        "short_name": "CHAOZHOU THREE-CIR",
        "long_name": "Chaozhou Three-Circle (Group) Co.,Ltd.",
        "summary": "Chaozhou Three-Circle (Group) Co., Ltd. engages in the research and development, manufacture, and sale of electronic basic materials, electronic components, and communication devices in China and internationally. The company offers ceramic exterior parts for mobiles, ceramic covers for fingerprint modules, and ceramic parts for smart wearable devices; piezo micro dispensing systems; ceramic components for fiber optic communication products; ceramic metallizations; anode supported solid oxide fuel cell (SOFC) cells and SOFC electrolyte membranes; fixed resistors and multilayer ceramic chip capacitors; ceramic substrates; ceramic capillary products, fashion ceramics, ceramic knife sets, mechanical ceramics, and ceramic bearings; and lithium battery cover assembly products and hermetic terminals for compressors. Its products are used in optical communications, electronics, electrical, machinery, energy conservation and environmental protection, new energy, biological, and fashion applications. The company was founded in 1970 and is headquartered in Chaozhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chaozhou",
        "zipcode": null,
        "website": "http://www.cctc.cc",
        "market_cap": "Large Cap"
    },
    "300433.SZ": {
        "short_name": "LENS TECHNOLOGY CO",
        "long_name": "Lens Technology Co., Ltd.",
        "summary": "Lens Technology Co., Ltd. researches, develops, manufactures, and sells window touch protective glass panels, touch modules, and window touch protection new materials. It offers window protection glass, touch screen monomer, touch screen module, camera module, fingerprint module, and camera related products, as well as buttons, ceramics, metal parts, and other products. The company's products are used in mobile phones, tablet PCs, notebook computers, digital cameras, players, GPS navigators, automotive instrumentation, smart homes, medical equipment, and other areas. Lens Technology Co., Ltd. was founded in 2003 and is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": null,
        "website": "http://www.hnlens.com",
        "market_cap": "Large Cap"
    },
    "300460.SZ": {
        "short_name": "GUANGDONG FAILONG",
        "long_name": "Guangdong Failong Crystal Technology Co.,LTD.",
        "summary": "Guangdong Failong Crystal Technology Co.,Ltd. engages in the research and development, production, and marketing of frequency control and selection components in China. Its products include SMD glass, SMD seam sealing, DIP crystal resonators, and TCXO, as well as quartz crystal oscillators for use in electronics industries, such as computer network peripherals, wireless communication, mobile phone, vehicle, GPS, digital audiovisuals, and remote control devices, as well as medical equipment, laptops, TVs, PCs, smart meters, automotive electronics, and aerospace applications. The company also sells its products in Europe, the United States, Japan, Korea, Hong Kong, and Taiwan. Guangdong Failong Crystal Technology Co.,Ltd. was founded in 2002 and is based in Dongguan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "DongGuan",
        "zipcode": "523757",
        "website": "http://www.dgylec.com",
        "market_cap": "Small Cap"
    },
    "300566.SZ": {
        "short_name": "NINGBO EXCITON TEC",
        "long_name": "Ningbo Exciton Technology Co., Ltd.",
        "summary": "Ningbo Exciton Technology Co., Ltd. engages in the research and development, manufacture, and marketing of optical films and functional films in China. The company's products primarily include BritNit diffusion, brightness enhancement, reflection, LED, decorative, and protection films. It also provides laminated enhancement films, quantum dot films, laminated silvered reflectors, 3D grating films, and explosion-proof films for multimedia teaching machines. In addition, the company offers surface protection products for applications, such as photoelectricity automobiles, decorative materials, mobile phones, computers, and semiconductor wafer processing. Further, it provides reflective safety products for drivers and pedestrians; mobile phones; and composite films and bags for pharmaceuticals foodstuffs and daily chemical products. The company offers its products for application in new energy fields, including electro-optic display and LED lighting. Ningbo Exciton Technology Co., Ltd. was founded in 2007 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315040",
        "website": "http://www.excitontech.cn",
        "market_cap": "Small Cap"
    },
    "300582.SZ": {
        "short_name": "INVENTRONICS (HANG",
        "long_name": "Inventronics (Hangzhou), Inc.",
        "summary": "Inventronics (Hangzhou), Inc. engages in the design, manufacture, sale, and marketing of LED drivers worldwide. It also offers controls, surge protection products, programming tools, power supplies, and accessories. Inventronics (Hangzhou), Inc. was founded in 2007 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310052",
        "website": "http://www.inventronics-co.com",
        "market_cap": "Small Cap"
    },
    "300615.SZ": {
        "short_name": "XDC INDUSTRIES (SH",
        "long_name": "XDC Industries (Shenzhen) Limited",
        "summary": "XDC Industries (Shenzhen) Limited researches and develops, manufactures, and sells radio frequency metal components for the mobile communication industry worldwide. The company offers radio frequency internal components that are used for radio frequency signal transmission, resonance, frequency adjustment, signal filtration, restriction, coupling, and other electromagnetic field functions, as well as for use in filter, diplexer, tower amplifier, combiner, and other parts at mobile communication stations. It also provides light communication components that are used for transmitting light wave signals with optical fiber; precise spare parts; and RF structures primarily used to build an enclosed electromagnetic environment. The company was founded in 2005 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518055",
        "website": "http://www.xdc-industries.com",
        "market_cap": "Small Cap"
    },
    "300626.SZ": {
        "short_name": "HUARUI ELECTRICAL",
        "long_name": "Huarui Electrical Appliance Co.,Ltd.",
        "summary": "Huarui Electrical Appliance Co.,Ltd. researches and develops, manufactures, and sells commutators and other precision parts for motors in China and internationally. It offers riser type, hook type, shell type, and planar type commutators. Its products are used in automobile industry, power tools, household appliances, medical and office equipment, aerospace, other motors, etc. The company was founded in 1988 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": null,
        "website": "http://www.china-commutator.com",
        "market_cap": "Micro Cap"
    },
    "300657.SZ": {
        "short_name": "XIAMEN HONGXIN ELE",
        "long_name": "XiaMen HongXin Electron-tech Group Co.,Ltd",
        "summary": "XiaMen HongXin Electron-tech Group Co.,Ltd engages in the research and development, design, manufacture, and sale of flexible printed circuit boards (FPCs) in China. It offers thin double-sided, wearable, and fingerprint identification FPCs; rigid-flex, CCM module rigid-flex, and TP and LCD module multilayer boards; and automotive and other LCD modules. The company was founded in 2003 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361101",
        "website": "http://www.fpc98.com",
        "market_cap": "Small Cap"
    },
    "300691.SZ": {
        "short_name": "UNION OPTECH CO LT",
        "long_name": "Union Optech Co.,Ltd.",
        "summary": "Union Optech Co.,Ltd. engages in optical lens design and development, and precision manufacturing and sales in China. Its products are used in security video surveillance cameras, mobile phones, automotive imaging systems, video conferencing, digital cameras/camcorders, smart home, sports DV, aerial drone, VR VR, and laser projection products. The company was founded in 2005 and is based in Zhongshan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhongshan",
        "zipcode": "528437",
        "website": "http://www.union-optech.com",
        "market_cap": "Small Cap"
    },
    "300701.SZ": {
        "short_name": "SENBA SENSING TECH",
        "long_name": "Senba Sensing Technology Co.,Ltd.",
        "summary": "Senba Sensing Technology Co., Ltd. engages in the research and development, manufacture, and sale of photoelectric components in China. The company offers digital and analog PIR sensors, LDR photoresistors, analog optoisolators, linear light sensor, Fresnel lens, PIR sensor modules, and infrared bandpass fliters. Its components are used in toys, lighting, switches, household appliances, medical, industry, security, military, and other fields. The company was formerly known as Nan Yang Senba Optical and Electronic Co.,Ltd. and changed its name to Senba Sensing Technology Co., Ltd. in April 2018. Senba Sensing Technology Co., Ltd. was founded in 2005 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.nysenba.com",
        "market_cap": "Small Cap"
    },
    "300726.SZ": {
        "short_name": "ZHUZHOU HONGDA ELE",
        "long_name": "Zhuzhou Hongda Electronics Corp.,Ltd.",
        "summary": "Zhuzhou Hongda Electronics Corp.,Ltd. researches and develops, manufactures, sells, and services tantalum capacitors and other military electronic components in China. The company offers multilayer and single layer ceramic capacitors, film capacitors, polymer chip aluminum capacitors, and super capacitors; inductors, magnetic beads, transformers, resistors, microwave device components, circulators, and isolators; power modules; I/F converters; power management chips; ltcc filters, embedded computer boards, and ceramic thin film circuits; and other products. Its products are used in cover systems engineering and equipment, such as vehicles, aircraft, ships, radars, and electronic products. The company was founded in 1993 and is based in Zhuzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuzhou",
        "zipcode": "412000",
        "website": "http://www.zzhddz.com",
        "market_cap": "Mid Cap"
    },
    "300739.SZ": {
        "short_name": "SUNSHINE GLOBAL CI",
        "long_name": "Sunshine Global Circuits Co.,Ltd.",
        "summary": "Sunshine Global Circuits Co.,Ltd. manufactures and sells printed circuit boards (PCBs) in China. The company offers standard, high density interconnect, rigid-flexible, aluminum plated, and special PCBs. Its products are used in various applications, such as industrial control, medical electronics, automotive electronics, telecommunication equipment, LED lighting, and other applications. The company also exports its products to Europe, North America, and Asia. Sunshine Global Circuits Co.,Ltd. was founded in 2001 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518125",
        "website": "http://www.sunshinepcb.com",
        "market_cap": "Small Cap"
    },
    "300752.SZ": {
        "short_name": "SHENZHEN LONGLI TE",
        "long_name": "Shenzhen Longli Technology Co.,Ltd",
        "summary": "Shenzhen Longli Technology Co.,Ltd engages in the research and development, production, and sale of LED backlight display modules in China. Its products are used in communication, computer, industrial control, vehicle, medical display, and other fields. The company was founded in 2007 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518109",
        "website": "http://www.blbgy.com",
        "market_cap": "Small Cap"
    },
    "300802.SZ": {
        "short_name": "JUTZE INTELLIGENT",
        "long_name": "Jutze Intelligent Technology Co., Ltd.",
        "summary": "Jutze Intelligent Technology Co., Ltd. engages in the research, development, and manufacturing of automatic optical inspection equipment and laser marker stations in China and internationally. It offers inline and offline optical inspection equipment and related accessories; LED packaging cosmetic inspection equipment; and solder paste inspection equipment. The company also provides system integration services, including electro-mechanical assembly, box build, and sub-systems assembly through full system integration; and sheet metal fabrication services, as well as manufactures custom cable assemblies, wire harnesses, and custom specialty assemblies for communication, industrial, healthcare and medical, and automotive and financial markets. Jutze Intelligent Technology Co., Ltd. was founded in 2007 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201100",
        "website": "http://www.jutze.com.cn",
        "market_cap": "Small Cap"
    },
    "300827.SZ": {
        "short_name": "SINENG ELECTRIC CO",
        "long_name": "Sineng Electric Co.,Ltd.",
        "summary": "Sineng Electric Co.,Ltd. engages in the research and development, manufacture, and marketing of power and electronic products. The company provides power and electronic products, and solutions including grid-connected photovoltaic (PV) inverters; operation and maintenance of PV power plants; and development of PV power plant, power quality control, energy storage bidirectional converter, and energy automobiles charging. Its products include PV solutions, including utility PV, hilly terrain PV, water front PV, commercial PV, and residential PV solutions; power filters comprising active power filters, static Var generators, and smart power quality correction productions; and DC and AC energy storage products. The company offers solutions in power and related industries comprising power generation, power supply, and power distribution system. Sineng Electric Co.,Ltd. is based in Wuxi, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214174",
        "website": "http://www.si-neng.com",
        "market_cap": "Small Cap"
    },
    "300852.SZ": {
        "short_name": "SIHUI FUJI ELECTRO",
        "long_name": "Sihui Fuji Electronics Technology Co., Ltd.",
        "summary": "Sihui Fuji Electronics Technology Co., Ltd. manufactures printed circuit boards for FA, medical, power, communication, and automobile sectors worldwide. The company was founded in 2009 and is based in Zhaoqing City, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhaoqing",
        "zipcode": "526236",
        "website": "http://www.fujipcb.cn",
        "market_cap": "Small Cap"
    },
    "300903.SZ": {
        "short_name": "GUANGDONG KINGSHIN",
        "long_name": "Guangdong Kingshine Electronic Technology Co.,Ltd.",
        "summary": "Guangdong Kingshine Electronic Technology Co.,Ltd. researches and develops, produces, and sells printed circuit boards in China. Its products are primarily used in mobile terminal equipment, automotive electronics, network communication equipment, household appliances, office equipment, new energy equipment, industrial security, medical electronics, artificial intelligence, and other fields. The company also exports its products to the United States, Canada, Australia, Brazil, Poland, Italy, Spain, Africa, India, Singapore, Malaysia, South Korea, Japan, and other countries and regions. The company was founded in 2001 and is based in Huizhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huizhou",
        "zipcode": null,
        "website": "http://www.gdkxpcb.com",
        "market_cap": "Small Cap"
    },
    "300940.SZ": {
        "short_name": "SHEN ZHEN AUSTRALI",
        "long_name": "Shen Zhen Australis Electronic Technology Co.,Ltd.",
        "summary": "Antarctic Shenzhen Optoelectronic Technology Co., Ltd. engaged in the research, development, production, and sale of mobile phone components with backlight display modules. Its products are used in various display fields, such as smart phones and car monitors, medical displays, industrial control equipment displays, home appliance displays, and other consumer electronics displays. The company was founded in 2009 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518104",
        "website": "http://cnnjg.com",
        "market_cap": "Small Cap"
    },
    "5243.TW": {
        "short_name": "ESON PRECISION IND CO LTD",
        "long_name": "Eson Precision Ind. Co., Ltd.",
        "summary": "Eson Precision Ind. Co., Ltd. designs, develops, manufactures, and sells mechanical parts for consuming electrical products in Taiwan and internationally. The company also designs, manufactures, and sells precision molds, plastics, flat-panel displays, electronic components, and hardware products; and provides cosmetic treatment onto products, and whole set unit assembling services. Its products include TV, 3C, network, automotive, tooling, photoelectric, and PC products. The company was formerly known as Multiwin Precision Ind. Co., Ltd. and changed its name to Eson Precision Ind. Co., Ltd. Eson Precision Ind. Co., Ltd. was founded in 1987 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "China",
        "state": null,
        "city": "Kunshan",
        "zipcode": "KY1-1205",
        "website": "http://www.eson.com.cn",
        "market_cap": "Small Cap"
    },
    "600083.SS": {
        "short_name": "GUANGDONG BOXIN INVESTING & HOL",
        "long_name": "Jiangsu Boxin Investing&Holdings Co.,Ltd.",
        "summary": "Jiangsu Boxin Investing&Holdings Co.,Ltd. provides artificial intelligence and big data technology based products. It offers noise cancelling earphones, smart watches for children, smart speakers, earphone translators, etc. The company also provides sports headphones and wireless collar headsets; smart home products, such as electric toothbrushes, beauty instruments, air purifiers, smart door locks, wireless transparent landline products, and sweeping robots; eye meters; and Fusi education systems. In addition, it offers smart solutions for the government, office, buildings, security, airport, retail, and metro industries. The company was founded in 1993 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100022",
        "website": "http://www.toppers.com.cn",
        "market_cap": "Micro Cap"
    },
    "600152.SS": {
        "short_name": "VEKEN TECHNOLOGY CO LTD",
        "long_name": "Veken Technology Co., Ltd.",
        "summary": "Veken Technology Co., Ltd., together with its subsidiaries, engages in the research and development, manufacturing, and sale of lithium batteries. The company offers 3C digital batteries for use in electronic products, such as notebooks, laptops, education computers, and personable wearables; and power batteries, such as soft packaged and aluminum shell power batteries for passenger auto battery, special vehicle battery, home appliance battery, and energy storage battery applications. It serves cellphone brands and communication operators in China, Europe, and the United States. Veken Technology Co., Ltd. is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315010",
        "website": "http://www.veken-tech.com",
        "market_cap": "Small Cap"
    },
    "600183.SS": {
        "short_name": "SHENGYI TECHNOLOGY CO LTD",
        "long_name": "Shengyi Technology Co., Ltd.",
        "summary": "Shengyi Technology Co., Ltd., together with its subsidiaries, develops, manufactures, and sells laminates in China. It offers flame-retardant epoxy glass fabric reinforced laminates, composite epoxy materials, and flexible circuit materials, as well as prereg for multilayer circuit boards; and high-end electronic materials, including CCL, insulation boards, resin-coated copper, and coverlay materials. The company also provides electronic circuit base materials; FR-4 CCL, FCCL, aluminum base materials, HSD base materials, and RF base materials. Its products are primarily used for making single sided and double sided printed circuit boards, and multilayer boards, which are applied in home appliances, portable and consumable electronics, automobiles, computers, aerospace, communication networking, and other high-end electronic products. The company also exports its products to the United States, Europe, Korea, Japan, and Southeast Asia. The company was formerly known as Guangdong Shengyi Sci. Tech Co., Ltd. Shengyi Technology Co., Ltd. was founded in 1985 and is headquartered in Dongguan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": null,
        "website": "http://www.syst.com.cn",
        "market_cap": "Mid Cap"
    },
    "600203.SS": {
        "short_name": "FUJIAN FURI ELECTRONICS CO LTD",
        "long_name": "Fujian Furi Electronics Co.,Ltd",
        "summary": "Fujian Furi Electronics Co.,Ltd operates in the electronic information industry in China and internationally. The company manufactures and sells LED photo electricity products, such as LED packaging, lighting, and display products. It also provides green environmental protection products, including renewable energy applications and industrial energy efficiency products. In addition, the company offers LED optoelectronic products, including bulb, fluorescent, projection lamps, tunnel lights, etc.; and LED LCD color TVs, LED eye protection lamps, air conditioning, dehumidifiers, air purifiers, and other smart household appliances. Further, it engages in the research and development, design, production, and sale of mobile communication terminal products and Internet of Things products, as well as provision of ODM contract manufacturing services. The company is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": null,
        "website": "http://www.furielec.com",
        "market_cap": "Small Cap"
    },
    "600237.SS": {
        "short_name": "ANHUI TONGFENG ELECTRONIC CO",
        "long_name": "Anhui Tongfeng Electronics Company Limited",
        "summary": "Anhui Tongfeng Electronics Company Limited manufactures and markets electronic parts and materials in the People's Republic of China. The company's products include AC motor running capacitors, power electronic capacitors, polypropylene film for capacitors, polyester film for capacitors, metallized film for capacitors, crystal frequency slices, crystal oscillators, LED lead frames, battery separators, car seats, etc. Its solutions cover industries, such as household electrical appliances, rail transportation, clean energy, electricity, lighting electronics, electronic circuit, electronic display, modern printing, energy saving, automotive electronics, ship propulsion, and others. Anhui Tongfeng Electronics Company Limited was founded in 1952 and is based in Tongling, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tongling",
        "zipcode": null,
        "website": "http://www.tong-feng.com",
        "market_cap": "Small Cap"
    },
    "600330.SS": {
        "short_name": "TDG HOLDING CO LTD",
        "long_name": "TDG Holding Co., Ltd.",
        "summary": "TDG Holding Co., Ltd. engages in the research and development, manufacture, and marketing of electronic materials and components, and other equipment in China. The company offers electronic materials, such as ferrite sheets for NFC antennas; soft ferrite cores for wireless chargers and LED power supplies; soft magnetic cores for automotive electronics and EV wireless charging, and energy; cores for EMI suppression and consumer electronics; stress-insensitive, high bias, low core loss, EMI-suppression, and thermal shock resistance NiZn ferrites; metal powder cores; sapphire crystal products; and piezo-electric crystal materials. It also provides microwave components and modules, and EMS services; and photoelectric equipment, crystal material equipment, powder molding equipment, and environmental equipment. The company was founded in 1984 and is headquartered in Haining, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Haining",
        "zipcode": "314400",
        "website": "http://www.tdgcore.com",
        "market_cap": "Small Cap"
    },
    "600363.SS": {
        "short_name": "JIANGXI LIANCHUANG OPTOELECTRON",
        "long_name": "Jiangxi Lianchuang Opto-Electronic Science&Technology Co.,Ltd",
        "summary": "Jiangxi Lianchuang Opto-Electronic Science&Technology Co.,Ltd develops, manufactures, and sells LED photoelectric materials, LED optoelectronic devices, LED backlight products, LED lighting products, controllers, and wires and cables in China. It offers LED photoelectric materials, such as LED chips, SMD LEDs, IR epitaxial wafers, and IR chips; and LED optoelectronic devices, including infrared devices, LED digital tubes, LAMP light-emitting diodes, LED digital display modules, and LED FET package devices. The company also provides LED backlight products that include color, car, and industrial backlight products; and LED lighting products comprising outdoor and indoor screens, as well as landscape, indoor, and outdoor lighting products. In addition, it offers LED lighting, power supply, and appliance controllers, as well as remote control products; and wires and cables, including power and communication cables, as well as optical fiber and cables. The company was founded in 1999 and is based in Nanchang, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330096",
        "website": "http://www.lianovation.com.cn",
        "market_cap": "Small Cap"
    },
    "600382.SS": {
        "short_name": "GUANGDONG MINGZHU BALL VALVE GR",
        "long_name": "Guangdong Mingzhu Group Co.,Ltd",
        "summary": "Guangdong Mingzhu Group Co.,Ltd engages in trading and industrial investment activities in China. It is also involved in the real estate and land development businesses. The company was founded in 1971 and is headquartered in Xingning, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xingning",
        "zipcode": "514500",
        "website": "http://www.gdmzh.com",
        "market_cap": "Small Cap"
    },
    "600516.SS": {
        "short_name": "FANGDA CARBON NEW MATERIAL CO. ",
        "long_name": "Fangda Carbon New Material Technology Co., Ltd.",
        "summary": "Fangda Carbon New Material Technology Co., Ltd. manufactures and sells carbon products in China and internationally. It offers RP, HP, and UHP graphite electrodes; and ultra-thermal conductivity graphite blocks, high graphitic and graphitized cathode carbon blocks, carbon blocks for aluminum, paste products, micropore carbon blocks, blast furnace carbon block properties, carbon pastes for blast furnace, carbon mortars for blast furnace, high thermal conductivity carbon blocks, and half graphitic carbon blocks. The company also offers micropore carbon blocks, carbon block-graphite blocks, submerged arc furnace with carbon brick linings, spectrum carbon rods, solid carbon felts, high temperature carbon felts, flat carbon felts, tube carbon felts, super fine graphite powders, isotropy graphite, fluorine making carbon felts, and carbon ropes. Fangda Carbon New Material Technology Co., Ltd. is headquartered in Lanzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lanzhou",
        "zipcode": "730084",
        "website": "http://www.fdtsgs.com",
        "market_cap": "Mid Cap"
    },
    "600563.SS": {
        "short_name": "XIAMEN FARATRONIC CO.LTD.",
        "long_name": "Xiamen Faratronic Co., Ltd.",
        "summary": "Xiamen Faratronic Co., Ltd. manufactures and sells film capacitors and metallized coating materials in China and internationally. It provides film capacitors, such as SMD, polyethylene naphtalate, polyester, polypropylene, interference suppression, precision, and capacitive divider A.C. capacitors for PCB applications. The company also offers film capacitors for power electronics; AC motor capacitors; capacitors for lamps; and metalized polyester and polypropylene films. Xiamen Faratronic Co., Ltd. was founded in 1955 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": null,
        "website": "http://www.faratronic.com",
        "market_cap": "Mid Cap"
    },
    "600673.SS": {
        "short_name": "GUANGDONG HEC TECHNOLOGY HOLDIN",
        "long_name": "Guangdong Hec Technologyholding Co., Ltd",
        "summary": "Guangdong Hec Technologyholding Co., Ltd produces and sells aluminum products in China. The company offers chemical, hydrophilic, and electronic foils; capacitors; magnetic materials; electrochemical products; refrigerants; and chemical products, such as caustic soda, aluminum strips, PS sheets, etc., as well as brazing foils. The company was formerly known as Guangdong Dongyangguang Aluminum Co., Ltd. Guangdong Hec Technologyholding Co., Ltd was founded in 1993 and is based in Dongguan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": "523871",
        "website": "http://tech.hec.cn",
        "market_cap": "Mid Cap"
    },
    "600707.SS": {
        "short_name": "IRICO DISPLAY DEVICES",
        "long_name": "Caihong Display Devices Co.,Ltd.",
        "summary": "Caihong Display Devices Co.,Ltd. engages in the research, development, production, and sale of electronic glass products in China and internationally. It offers TFT-LCD crystal substrate glasses, flat panel display devices, liquid crystal display substrate glasses, liquid crystal substrate glasses, and OLED products. The company was founded in 1992 and is based in Xianyang, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xianyang",
        "zipcode": null,
        "website": "http://www.chgf.com.cn",
        "market_cap": "Mid Cap"
    },
    "603016.SS": {
        "short_name": "WUXI NEW HONGTAI ELECTRICAL TEC",
        "long_name": "Wuxi New Hongtai Electrical Technology Co.,Ltd",
        "summary": "Wuxi New Hongtai Electrical Technology Co.,Ltd engages in the research, development, production, and sale of components of circuit breakers, low-voltage circuit breakers, and knife-melt switches in China. It offers BMC/SMC molded insulation products for circuit breakers, motors and electric motors, low-voltage circuit breakers, and knife-fused switches; and molding articles and materials. The company was founded in 2008 and is based in Wuxi, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": null,
        "website": "http://www.newhongtai.com",
        "market_cap": "Small Cap"
    },
    "603050.SS": {
        "short_name": "SHIJIAZHUANG KELIN ELECTRIC CO ",
        "long_name": "Shijiazhuang Kelin Electric Co., Ltd.",
        "summary": "Shijiazhuang Kelin Electric Co., Ltd. designs, manufactures, and sells electrical power distribution and metering products in China. The company offers smart meters and metering infrastructure products; substation systems, power distribution monitoring products, switchgears, circuit breakers, and transformers; and electrical vehicle charging stations, line loss management products, fault location indicators, and simple meters. It also provides renewable energy products, such as photovoltaic information collection terminals and inverters. The company was founded in 2000 and is based in Shijiazhuang, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": "050222",
        "website": "http://www.sinokeelectric.com",
        "market_cap": "Small Cap"
    },
    "603068.SS": {
        "short_name": "BEKEN CORPORATION",
        "long_name": "Beken Corporation",
        "summary": "Beken Corporation, a fabless design company, provides IC solutions for wireless applications in China. It offers IC products in the areas of WiFi, Bluetooth BLE, Bluetooth HID, Bluetooth audio SOC, BluetoothHCI, wireless voice, general wireless, broadcast transceiver, and national standard highway toll collection. The company was founded in 2004 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.bekencorp.com",
        "market_cap": "Small Cap"
    },
    "603133.SS": {
        "short_name": "TANYUAN TECHNOLOGY CO LTD",
        "long_name": "Tanyuan Technology Co., Ltd.",
        "summary": "Tanyuan Technology Co., Ltd. engages in the research and development of high-heat graphite film and other related products for graphite heat dissipation in China. It offers single layer, multi-layer, and composite high thermal conductivity graphite films. The company is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": "213122",
        "website": "http://www.tanyuantech.com",
        "market_cap": "Small Cap"
    },
    "603186.SS": {
        "short_name": "ZHEJIANG HUAZHENG NEW MATERIAL ",
        "long_name": "Zhejiang Huazheng New Material Co., Ltd.",
        "summary": "ZheJiang Huazheng New Material Co., Ltd. engages in the research, development, production, and sale of epoxy resin copper clad laminates in China and internationally. The company also offers functional composites, thermoplastic honeycomb materials, and other new material products. The company was founded in 2003 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311121",
        "website": "http://www.wazam.com.cn",
        "market_cap": "Small Cap"
    },
    "603228.SS": {
        "short_name": "SHENZHEN KINWONG ELECTRONIC CO ",
        "long_name": "Shenzhen Kinwong Electronic Co., Ltd.",
        "summary": "Shenzhen Kinwong Electronic Co., Ltd. engages in research, development, production, and sale of printed circuit boards (PCB) and electronic materials in China and internationally. It provides conventional PCBs, including single-layer, double-layer, and multi-layer PCBs; metal-based PCBs that comprise copper, aluminum, stainless steel, and iron; flexible PCBs, such as single and double side, and multilayer PCBs; and high density interconnect, RF microwave, rigid-flex, and high layer count PCBs, as well as embedded copper inlays. The company also offers engineering and design services. It serves automotive, smart terminal, consumer, power supply, telecom, industrial and medical, and computing markets. The company was founded in 1993 and is headquartered in Shenzhen, China. Shenzhen Kinwong Electronic Co., Ltd. was formerly a subsidiary of Kinwong Group Limited.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.kinwong.com",
        "market_cap": "Mid Cap"
    },
    "603267.SS": {
        "short_name": "BEIJING YUANLIU HONGYUAN ELECTR",
        "long_name": "Beijing Yuanliu Hongyuan Electronic Technology Co., Ltd.",
        "summary": "Beijing Yuanliu Hongyuan Electronic Technology Co.,Ltd. engages in the research and development, production, and sale of electronic components in China and internationally. It offers chip, leaded, and metal bracket multilayer ceramic capacitors, as well as DC filters. The company also sells electronic components as agents of other manufacturers. Its products are used in civilian, aerospace, aviation, shipbuilding, weapons, electronic information, rail roads, alternative energy, and other industries. Beijing Yuanliu Hongyuan Electronic Technology Co.,Ltd. was founded in 2001 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102600",
        "website": "http://www.yldz.com.cn",
        "market_cap": "Mid Cap"
    },
    "603328.SS": {
        "short_name": "GUANGDONG ELLINGTON ELEC TECH C",
        "long_name": "Guangdong Ellington Electronics Technology Co., Ltd.",
        "summary": "Guangdong Ellington Electronics Technology Co., Ltd. manufactures and sells double-sided and multi-layered printed circuit boards in China. Its products are used in computers and computer peripherals, consumer electronics, communication products, industrial controls, automotive electronics, medical instructions, etc. The company was formerly known as Ellington Co., Ltd and changed its name to Guangdong Ellington Electronics Technology Co., Ltd. in November 2007. The company was founded in 2000 and is based in Zhongshan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhongshan",
        "zipcode": null,
        "website": "http://www.ellingtonpcb.com",
        "market_cap": "Small Cap"
    },
    "603380.SS": {
        "short_name": "SUZHOU ETRON TECHNOLOGIES CO LT",
        "long_name": "Suzhou Etron Technologies Co.,Ltd.",
        "summary": "Suzhou Etron Technologies Co.,Ltd. provides electronics manufacturing services worldwide. The company offers industrial products, such as power supplies, motor driver devices, smart meters, and test measurement products for service system, wind power generation, and intelligent instrument industries; telecommunication products comprising wireless filter and DDCS for use in antenna buildings, data centers, and enterprise networks; and health care products consisting of assembled PCBA of medical devices that are used for the analysis, diagnosis, and treatment applications. It also provides automotive products; and consumer products in cleaning machines, electronical tools, sanitary ware, and others. The company was founded in 2001 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215143",
        "website": "http://www.etron.cn",
        "market_cap": "Small Cap"
    },
    "603416.SS": {
        "short_name": "WUXI XINJE ELECTRIC CO LTD",
        "long_name": "WuXi Xinje Electric Co.,Ltd.",
        "summary": "WuXi Xinje Electric Co.,Ltd. engages in the development, production, and sale of industrial automation products in China. The company offers PLC, human-machine interface, integrated controller, special modules, and other products for industrial control; and server system, stepping system, inverter for sport control. It also provides WIFI modules, 4GBOX, and other wireless communication modules, as well as Ethernet-based communication modules; cloud platform and server deployment; and integrated smart cameras manipulators, robot controllers, and teaching pendants. The company's products are used in various fields of automation, including printing and packaging, food and drink, machining assembly, textile, electronics manufacturing, building materials, machine tool, and other related industries and fields. WuXi Xinje Electric Co.,Ltd. was founded in 2008 and is based in Wuxi, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214072",
        "website": "http://www.xinje.com",
        "market_cap": "Small Cap"
    },
    "603519.SS": {
        "short_name": "JIANGSU LIBA ENTERPRISE JOINT-S",
        "long_name": "Jiangsu Liba Enterprise Joint-Stock Co., Ltd.",
        "summary": "Jiangsu Liba Enterprise Joint-Stock Co., Ltd. produces composite materials for home appliances. Its products include vinyl-coated metal and pre-coated metal sheets that are applied in home appliances, such as refrigerators, washers, water heaters, microwave ovens, and air-conditioners. The company was founded in 1994 and is based in Yixing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yixing",
        "zipcode": "214205",
        "website": "http://www.jsliba.com",
        "market_cap": "Small Cap"
    },
    "603629.SS": {
        "short_name": "JIANGSU LETTALL ELECTRONIC CO L",
        "long_name": "Jiangsu Lettall Electronic Co.,Ltd",
        "summary": "Jiangsu Lettall Electronic Co.,Ltd produces and sells electronic components in China. The company offers wall plugs, switching power adapters, LCD-TV power plats, and chargers; switching power supply transformers, frequency power transformers, harmonic reactors, other special transformers and inductors, transformers and transformer driver focuses, power filters, line linear inductance products, SMD transformers, and green lighting special devices; and LCD TV brackets and stands. Its products are used in color TVs, LCD TVs, air conditioners, and other household electrical appliances. The company was founded in 1991 and is based in Yixing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yixing",
        "zipcode": "214241",
        "website": "http://www.lettall.com",
        "market_cap": "Small Cap"
    },
    "603633.SS": {
        "short_name": "SHANGHAI LAIMU ELECTRONICS CO L",
        "long_name": "Shanghai Laimu Electronics Co.,Ltd",
        "summary": "Shanghai Laimu Electronics Co.,Ltd researches and develops, produces, and sells precision electronic components in China. Its products include automotive electronics, such as injection and stamping parts, connectors, injection inserts, and wire harnesses; and mobile electronics, including T-cards, battery holders, combo decks, shields, hardware parts, nuts, shrapnel, and camera modules, as well as components for SIMs and USBs. The company was founded in 2003 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201619",
        "website": "http://www.laimu.com.cn",
        "market_cap": "Small Cap"
    },
    "603678.SS": {
        "short_name": "FUJIAN TORCH ELECTRON TECHNOLOG",
        "long_name": "Fujian Torch Electron Technology Co., Ltd.",
        "summary": "Fujian Torch Electron Technology Co., Ltd. engages in the research and development, production, sale, and servicing of ceramic capacitors in China. It offers chip multilayer, coated lead type multilayer, molded surface mount, chip polymer solid electrolyte tantalum, and high performance carbon-based electric double layer ceramic capacitors for use in various fields, such as communication equipment, industrial control equipment, precision instrumentation, medical equipment, petroleum exploration equipment, etc. The company was formerly known as Quanzhou Torch Electronic Component Factory. Fujian Torch Electron Technology Co., Ltd. was founded in 1988 and is based in Quanzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Quanzhou",
        "zipcode": "362000",
        "website": "http://www.torch.cn",
        "market_cap": "Mid Cap"
    },
    "603989.SS": {
        "short_name": "HUNAN AIHUA GROUP CO LTD",
        "long_name": "Hunan Aihua Group Co., Ltd",
        "summary": "Hunan Aihua Group Co., Ltd engages in the design, development, manufacture, and sale of aluminum electrolytic capacitors in the People's Republic of China and internationally. The company also manufactures aluminum foil and machines. It serves lighting, new energy, telecom, industrial, automotive, computer, home applications, and medical markets. Hunan Aihua Group Co., Ltd was founded in 1985 and is headquartered in Yiyang, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yiyang",
        "zipcode": "413000",
        "website": "http://www.aihuaglobal.com",
        "market_cap": "Small Cap"
    },
    "605066.SS": {
        "short_name": "ZHEJIANG TENGEN ELECTRICS CO LT",
        "long_name": "Zhejiang Tengen Electrics Co.,Ltd.",
        "summary": "Zhejiang Tengen Electrics Co.,Ltd. manufactures and sells low-voltage electronic products in China. It offers circuit breakers, motor controllers and protectors, surge protectors, contactors, automatic switches, and thermorelays. The company was founded in 1990 and is based in Yueqing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yueqing",
        "zipcode": "325604",
        "website": "http://www.tengen.com",
        "market_cap": "Small Cap"
    },
    "605218.SS": {
        "short_name": "WAYS ELECTRON CO LTD",
        "long_name": "Ways Electron Co.,Ltd.",
        "summary": "Ways Electron Co.,Ltd. engages in the research and development, design, manufacture, and sale of electronic components. It offers BL modules for auto application and consumer products, liquid crystal modules, touch screen products, hardware, rubber products, and IML products. The company formerly known as Kunshan Ways Electron Co.,Ltd and changed its name to Ways Electron Co.,Ltd. in June 2018. Ways Electron Co.,Ltd. was founded in 2003 and is based in Kunshan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunshan",
        "zipcode": "215300",
        "website": "http://www.ksways.com",
        "market_cap": "Small Cap"
    },
    "6431.TW": {
        "short_name": "KUANGLI PHOTOELECTRIC TECHNOLOG",
        "long_name": "Kuangli Photoelectric Technology Co., Ltd.",
        "summary": "Kuangli Photoelectric Technology Co., Ltd. manufactures and sells panels for cover lens used in various electronic products. The company's products are used in mobile phones and laptops protection panels, cameras, decorative parts, buttons, tablet PCs, I.com touch panels, tempered glasses, and other consumer electronics panels, as well as HD players, DVs, digital cameras, home appliances, MP3s, MP4s, car logs and lampshades, medical equipment, etc. Kuangli Photoelectric Technology Co., Ltd. was founded in 2002 and is based in Kunshan, China.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "China",
        "state": null,
        "city": "Kunshan",
        "zipcode": null,
        "website": "http://www.kskl.com.cn",
        "market_cap": "Micro Cap"
    },
    "688002.SS": {
        "short_name": "RAYTRON TECHNOLOGY CO LTD",
        "long_name": "Raytron Technology Co.,Ltd.",
        "summary": "Raytron Technology Co.,Ltd. engages in the research and development of uncooled infrared imagining and MEMS sensor technology in China. The company offers driving assistant devices, infrared imaging solutions, and vacuum packaging products; MEMS design services for sensors; and ASIC, analog, and Hybrid IP design services. Its products are used in industrial temperature measurement, night version driver assistance systems, security monitoring, forest fire prevention, building energy efficiency assessment, consumer electronic products, IOT, and other applications. The company was founded in 2009 and is based in Yantai, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yantai",
        "zipcode": "264006",
        "website": "http://www.raytrontek.com",
        "market_cap": "Mid Cap"
    },
    "688005.SS": {
        "short_name": "NINGBO RONBAY NEW ENERGY TECHNO",
        "long_name": "Ningbo Ronbay New Energy Technology Co., Ltd.",
        "summary": "Ningbo Ronbay New Energy Technology Co., Ltd. engages in the research, development, production, and sales of lithium battery cathode materials in China and internationally. The company is based in Yuyao, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yuyao",
        "zipcode": null,
        "website": "http://www.ronbaymat.com",
        "market_cap": "Mid Cap"
    },
    "688011.SS": {
        "short_name": "HARBIN XINGUANG OPTIC-ELECTRONI",
        "long_name": "Harbin Xinguang Optic-Electronics Technology Co., Ltd.",
        "summary": "Harbin Xinguang Optic-Electronics Technology Co., Ltd. engages in the research and development, design, manufacture, and installation of optical and mechanical integrated products. It offers optical equipment for use in the areas of petrochemicals, high-speed rail, power monitoring, and civil products, as well as in infrared thermal imaging intelligent early warning monitoring system and high-speed railway intelligent detection system. The company was founded in 2007 and is based in Harbin, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": null,
        "website": "http://www.xggdkj.com",
        "market_cap": "Small Cap"
    },
    "688020.SS": {
        "short_name": "GUANGZHOU FANGBANG ELECTRONICS ",
        "long_name": "Guangzhou Fangbang Electronics Co.,Ltd",
        "summary": "Guangzhou Fang Bang Electronics Co., Ltd. engages in the development, production, sale, and service of electronic materials in China. Its products include shielding films, conductive adhesive films, flexible copper clad laminates, and ultra-thin copper foils. The company was founded in 2010 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510663",
        "website": "http://www.fbflex.com",
        "market_cap": "Small Cap"
    },
    "688055.SS": {
        "short_name": "INFOVISION OPTOELECTRONICS(KUNS",
        "long_name": "InfoVision Optoelectronics (Kunshan) Co., Ltd.",
        "summary": "InfoVision Optoelectronics (Kunshan) Co., Ltd. manufactures and sells LCD display panels. Its products include mobile panels, desktop and laptop panels, tablet and industrial personal computer panels, notebook panels, vehicle displays, and automotive displays. The company was founded in 2005 and is based in Kunshan, China. InfoVision Optoelectronics (Kunshan) Co., Ltd. is a subsidiary of Kunshan Guochuang Investment Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunshan",
        "zipcode": "215300",
        "website": "http://www.ivo.com.cn",
        "market_cap": "Mid Cap"
    },
    "688099.SS": {
        "short_name": "AMLOGIC (SHANGHAI) CO LTD",
        "long_name": "Amlogic (Shanghai) Co.,Ltd.",
        "summary": "Amlogic (Shanghai) Co.,Ltd. distributes electronics parts. The company is based in Pudong, China. Amlogic (Shanghai) Co.,Ltd. operates as a subsidiary of Amlogic Inc.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Pudong",
        "zipcode": "200233",
        "website": "http://www.amlogic.com/",
        "market_cap": "Mid Cap"
    },
    "688116.SS": {
        "short_name": "JIANGSU CNANO TECHNOLOGY CO LTD",
        "long_name": "Jiangsu Cnano Technology Co., Ltd.",
        "summary": "Jiangsu Cnano Technology Co., Ltd. engages in the research and development, production, and sale of carbon nanotube materials and related products. Its products include carbon nanotube powder, carbon nanotube conductive paste, graphene composite conductive paste, carbon nanotube conductive masterbatch, and others. The company offers its products for the energy storage, structural, and electronics industries, primarily lithium-ion battery, conductive plastic, and anti-static paint. JiangSu Cnano Technology Co., Ltd. was founded in 2011 and is based in Zhenjiang, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhenjiang",
        "zipcode": "212000",
        "website": "http://cnanotechnology.com",
        "market_cap": "Mid Cap"
    },
    "688138.SS": {
        "short_name": "SHENZHEN QINGYI PHOTOMASK LTD",
        "long_name": "Shenzhen Qingyi Photomask Limited",
        "summary": "Shenzhen Qingyi Photomask Limited manufactures high precision masks that integrates the research, design, production, and sales activities in China. It offers TFT, color STN, STN, and TNLCD chrome plate masks; EL and OLED chrome plate masks; PDP and VFD chrome plate masks; IC capsulation, chrome plate, and dry masks; chrome plate masks for precision electronic components, such as MEMS, SENSOR, and ENCODZR; and LCD solid and liquid relief plates. The company also provides mask handling, cleaning, recycle, and pellicle remount services. Its products are primarily used in liquid crystal display, organic electron luminescence and other flat panel display, integrated circuit and related, printed circuit board, and precision component industrial applications. The company was founded in 1997 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.supermask.com",
        "market_cap": "Small Cap"
    },
    "688181.SS": {
        "short_name": "BEIJING BAYI SPACE LCD TECHNOLO",
        "long_name": "Beijing Bayi Space LCD Technology Co., Ltd.",
        "summary": "Beijing Bayi Space LCD Technology Co., Ltd. manufactures liquid crystal display (LCD) material, polymer dispersed liquid crystal (PDLC), and organic electroluminescent display (OLED) material. The company's products include single liquid crystal material, such as ester liquid crystals, alkyne liquid crystals, olefin liquid crystals, chiral liquid crystals, and acrylate liquid crystals; mixed liquid crystal material, such as twisted nematic (TN) LCD, super-twisted nematic (STN) LCD, thin-film-transistor (TFT) LCD, smart film, and liquid crystal monomers; and pharmaceutical intermediates. The company's products cover all kinds of liquid crystal material used in mobile phone, notebook and computer monitor, and LCD television (TV). The company serves crystal LCD panel makers. Beijing Bayi Space LCD Technology Co., Ltd. was founded in 2004 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102205",
        "website": "http://en.bayi.com.cn",
        "market_cap": "Small Cap"
    },
    "688390.SS": {
        "short_name": "JIANGSU GOODWE POWER SUPPLY TEC",
        "long_name": "Jiangsu Goodwe Power Supply Technology Co., Ltd",
        "summary": "Jiangsu Goodwe Power Supply Technology Co., Ltd. focuses on the research, manufacture, and sale of PV inverters and energy storage solutions. It offers residential, commercial rooftop, ground utility, and energy storage inverters, as well as monitoring systems. The company was founded in 2010 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215011",
        "website": "http://cn.goodwe.com",
        "market_cap": "Mid Cap"
    },
    "688551.SS": {
        "short_name": "HEFEI KEWELL POWER SYSTEM CO LT",
        "long_name": "Hefei Kewell Power System Co.,Ltd.",
        "summary": "Hefei Kewell Power System Co.,Ltd. manufactures and sells test power supplies and systems in China. It provides high precision DC power supply, high precision programmable and bidirectional DC power supply, battery simulator, fuel cell battery simulator, photovoltaic array I-V simulator, battery pack charging-discharging test power, and energy recycling DC electronic load systems. The company also offers AC energy recycling analog grid power supply, intermediate frequency power supply, e-motor emulator, and energy recycling AC electronic load systems; and photovoltaic inverter, DC charging pile, fuel cell DC-DC, fuel cell engine, fuel cell stack, fuse, and contactor/relay test systems, as well as PV array IV curve testers and customized power supply systems. Its products are used in industrial fields such as new energy power generation, electric vehicles, fuel cells, and power devices. The company was founded in 2011 and is headquartered in Hefei, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": null,
        "website": "http://www.kewell.com.cn",
        "market_cap": "Small Cap"
    },
    "8073.HK": {
        "short_name": "SINGYES NM",
        "long_name": "China Singyes New Materials Holdings Limited",
        "summary": "China Singyes New Materials Holdings Limited, an investment holding company, engages in the research and development, manufacture, sale, and installation of indium tin oxide films and related downstream products, principally in Mainland China and Hong Kong. It offers smart light-adjusting films, smart light-adjusting glasses, and smart light-adjusting projection systems. The company also manufactures and sells photovoltaic products. It serves touch-screen device manufacturers, construction companies, and commercial users, as well as contractors of developers. The company was incorporated in 2014 and is headquartered in Zhuhai, the People's Republic of China. China Singyes New Materials Holdings Limited is a subsidiary of Top Access Management Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": null,
        "website": "http://www.syeamt.com",
        "market_cap": "Nano Cap"
    },
    "8249.HK": {
        "short_name": "RUIYUAN IC TECH",
        "long_name": "Zhejiang RuiYuan Intelligent Control Technology Company Limited",
        "summary": "Zhejiang RuiYuan Intelligent Control Technology Company Limited designs, manufactures, and sells intelligent controller systems for consumer electrical and electronic appliances primarily in the People's Republic of China. It is also involved in the original equipment manufacturing and electronic subassembly activities; and trading of electronic components, industrial electronic intelligent control equipment, and electronic automation digital control systems. The company was formerly known as Ningbo WanHao Holdings Company Limited and changed its name to Zhejiang RuiYuan Intelligent Control Technology Company Limited in January 2017. The company is headquartered in Yuyao, China. Zhejiang RuiYuan Intelligent Control Technology Company Limited is a subsidiary of Zhejiang Ruiyuan Intelligent Robot Company Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Yuyao",
        "zipcode": null,
        "website": "http://www.ruiyuanhk.com",
        "market_cap": "Nano Cap"
    },
    "CPQQ": {
        "short_name": "CHINA POWER EQUIP INC",
        "long_name": "China Power Equipment, Inc.",
        "summary": "China Power Equipment, Inc., through its An Sen (Xi'an) Power Science & Technology Co., Ltd. subsidiary and its affiliated operating company, Xi'an Amorphous Alloy Zhongxi Transformer Co., Ltd., engages in the design, manufacture, and distribution of amorphous alloy transformer cores and amorphous alloy distribution transformers in the People's Republic of China. Its devices are used to step down voltage at the final phase of the distribution of electricity to consumers, businesses, and industries. The company offers its products to electricity generators and suppliers, suppliers of electrical equipment, and other electric power transformers manufacturers. China Power Equipment, Inc. was founded in 2004 and is headquartered in Jingyang, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Jingyang",
        "zipcode": "713702",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "CSGH": {
        "short_name": "CHINA SUN GROUP HIGH-TECH CO",
        "long_name": "China Sun Group High-Tech Co.",
        "summary": "China Sun Group High-Tech Co., through its subsidiary, Dalian Xinyang High-Tech Development Co. Ltd., engages in the production and sale of cobaltosic oxide and lithium cobalt oxide used in lithium ion rechargeable batteries in the People's Republic of China and internationally. It provides battery level cobaltosic oxide, a cathode material used in the manufacturing of lithium cobalt oxide; and lithium iron phosphate, a cathode material used in lithium iron phosphate batteries. The company also offers ternary cathode material, which is applied as the main cathodes of small-sized communication and power instruments, such as portable power tools, electronic apparatus, laptops, and video cameras, as well as electric autos and bicycles. It serves lithium ion battery manufacturers, end product users, and lithium series product manufacturers. The company was formerly known as Capital Resource Funding, Inc. and changed its name to China Sun Group High-Tech Co. in August 2007. China Sun Group High-Tech Co. is headquartered in Dalian, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116015",
        "website": "http://www.chinasungrouphightech.com",
        "market_cap": "Nano Cap"
    },
    "DGNG": {
        "short_name": "DIGUANG INTL DEV C",
        "long_name": "Diguang International Development Co., Ltd.",
        "summary": "Diguang International Development Co., Ltd. engages in the design, production, and distribution of small to medium-sized light emitting diode and cold cathode fluorescent lamp backlights primarily for large and medium sized companies. The company offers backlights for liquid crystal displays in various applications, such as color displays for cell phones, car televisions and navigation systems, digital cameras, televisions, computer displays, camcorders, PDAs, DVDs, CD and MP3/MP4 players, and appliance displays, as well as for indoor and outdoor lighting, and home and office use. It sells its products to customers primarily in Taiwan, Hong Kong, North America, Europe, Japan, Southeast Asia, and China Mainland. The company was founded in 2004 and is headquartered in Shenzhen, the People's Republic of China. Diguang International Development Co., Ltd. is a subsidiary of Sino Olympics Industrial Limited.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518026",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "DION": {
        "short_name": "DIONICS INC",
        "long_name": "Dionics, Inc.",
        "summary": "Dionics, Inc., through its subsidiaries, provides landscape services and nursery stock sales to residential, industrial, and commercial customers in Jiangxi and surrounding provinces in China. Its landscaping services include landscape design and engineering, construction, and landscape conservation, as well as planning and maintenance of trees, shrubs, and flowers. The company offers its services principally to real estate developers and urban planning departments. It also engages in harvesting, processing, and selling primeval trees; breeding, cultivating, and selling valuable and rare seedlings; and the cultivation and sale of high-grade ancient bonsai tree stump and wood carvings, as well as high-grade flowers. The company was founded in 2002 and is based in Shangrao, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shangrao",
        "zipcode": "334000",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "IINX": {
        "short_name": "IONIX TECHNOLOGY INC",
        "long_name": "Ionix Technology, Inc.",
        "summary": "Ionix Technology, Inc., through its subsidiaries, engages in the research and development, manufacture, and marketing of liquid crystal materials, displays, and modules in the United States, Hong Kong, and the People's Republic of China. It operates through three segments: Smart Energy, Photoelectric Display, and Service Contracts. The company provides electronic equipment, such as power banks for iphone, ipad, mp3/mp4 players, PSP gaming systems, and cameras; and liquid crystal module and liquid crystal display screens for video capable baby monitors, tablets and cell phones, and televisions or computer monitors. It also offers services and IT solutions for the electric vehicle charging pile energy industry. The company distributes its products to distributors and retailers. The company was formerly known as Cambridge Projects Inc. and changed its name to Ionix Technology, Inc. in February 2016. Ionix Technology, Inc. was founded in 2011 and is headquartered in Dalian, China. Ionix Technology, Inc. is a subsidiary of Shining Glory Investments Limited.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116000",
        "website": "http://en.iinx-tech.com",
        "market_cap": "Nano Cap"
    },
    "PJJ1.F": {
        "short_name": "CHINA DISPLAY O.T.H.HD-10",
        "long_name": "China Display Optoelectronics Technology Holdings Limited",
        "summary": "China Display Optoelectronics Technology Holdings Limited, an investment holding company, engages in the research, development, manufacture, distribution, and sale of liquid crystal display modules for mobile phones and tablets in Mainland China, Hong Kong, Turkey, Thailand, South Korea, and Taiwan. It is also involved in the development and sale of software, and provision of technical consultancy services. The company was formerly known as TCL Display Technology Holdings Limited and changed its name to China Display Optoelectronics Technology Holdings Limited in January 2017. The company was founded in 2004 and is headquartered in HuiZhou, the People's Republic of China. China Display Optoelectronics Technology Holdings Limited is a subsidiary of High Value Ventures Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Huizhou",
        "zipcode": "516006",
        "website": "http://www.tcldisplay.com",
        "market_cap": "Micro Cap"
    },
    "SNPTF": {
        "short_name": "SUNNY OPTICAL TECHNOLOGY GROUP",
        "long_name": "Sunny Optical Technology (Group) Company Limited",
        "summary": "Sunny Optical Technology (Group) Company Limited, an investment holding company, engages in designing, researching, developing, manufacturing, and selling optical and optical related products, and scientific instruments. It operates through three segments: Optical Components, Optoelectronic Products, and Optical Instruments. The company's products include optical components, such as glass spherical and aspherical lenses, plane products, handset lens sets, vehicle lens sets, security surveillance lens sets, and other lens sets; optoelectronic products, such as handset camera modules, three dimensional optoelectronic products, vehicle modules, and other optoelectronic modules; and optical instruments comprising microscopes and intelligent equipment for testing. Its optoelectronic-related products are used in handsets, digital cameras, vehicle imaging and sensing systems, security surveillance systems, and virtual reality/augmented reality, which are combined with optical, electronic, software, and mechanical technologies. In addition, the company engages in the research and development of infrared technologies; trading of optical instruments and optoelectronics products; property leasing activities; and development, service, and consultation of technology, as well as provision of financing services. It operates primarily in the People's Republic of China, Vietnam, Korea, Japan, India, and the United States. The company was founded in 1984 and is headquartered in Yuyao, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Yuyao",
        "zipcode": "315400",
        "website": "http://www.sunnyoptical.com",
        "market_cap": "Large Cap"
    },
    "SOTGY": {
        "short_name": "SUNNY OPTICAL TECHNOLOGY GROUP",
        "long_name": "Sunny Optical Technology (Group) Company Limited",
        "summary": "Sunny Optical Technology (Group) Company Limited, an investment holding company, engages in designing, researching, developing, manufacturing, and selling optical and optical related products, and scientific instruments. It operates through three segments: Optical Components, Optoelectronic Products, and Optical Instruments. The company's products include optical components, such as glass spherical and aspherical lenses, plane products, handset lens sets, vehicle lens sets, security surveillance lens sets, and other lens sets; optoelectronic products, such as handset camera modules, three dimensional optoelectronic products, vehicle modules, and other optoelectronic modules; and optical instruments comprising microscopes and intelligent equipment for testing. Its optoelectronic-related products are used in handsets, digital cameras, vehicle imaging and sensing systems, security surveillance systems, and virtual reality/augmented reality, which are combined with optical, electronic, software, and mechanical technologies. In addition, the company engages in the research and development of infrared technologies; trading of optical instruments and optoelectronics products; property leasing activities; and development, service, and consultation of technology, as well as provision of financing services. It operates primarily in the People's Republic of China, Vietnam, Korea, Japan, India, and the United States. The company was founded in 1984 and is headquartered in Yuyao, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Yuyao",
        "zipcode": "315400",
        "website": "http://www.sunnyoptical.com",
        "market_cap": "Large Cap"
    },
    "SXC.F": {
        "short_name": "SUNNY OPT.TECH.G.HD-,10",
        "long_name": "Sunny Optical Technology (Group) Company Limited",
        "summary": "Sunny Optical Technology (Group) Company Limited, an investment holding company, engages in designing, researching, developing, manufacturing, and selling optical and optical related products, and scientific instruments. It operates through three segments: Optical Components, Optoelectronic Products, and Optical Instruments. The company's products include optical components, such as glass spherical and aspherical lenses, plane products, handset lens sets, vehicle lens sets, security surveillance lens sets, and other lens sets; optoelectronic products, such as handset camera modules, three dimensional optoelectronic products, vehicle modules, and other optoelectronic modules; and optical instruments comprising microscopes and intelligent equipment for testing. Its optoelectronic-related products are used in handsets, digital cameras, vehicle imaging and sensing systems, security surveillance systems, and virtual reality/augmented reality, which are combined with optical, electronic, software, and mechanical technologies. In addition, the company engages in the research and development of infrared technologies; trading of optical instruments and optoelectronics products; property leasing activities; and development, service, and consultation of technology, as well as provision of financing services. It operates primarily in the People's Republic of China, Vietnam, Korea, Japan, India, and the United States. The company was founded in 1984 and is headquartered in Yuyao, China.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Yuyao",
        "zipcode": "315400",
        "website": "http://www.sunnyoptical.com",
        "market_cap": "Large Cap"
    }
}