{
    "000533.SZ": {
        "short_name": "GUANGDONG SHUNNA E",
        "long_name": "Guangdong Shunna Electric Co., Ltd",
        "summary": "Guangdong Shunna Electric Co., Ltd. provides power transmission and distribution equipment in China. The company was founded in 1992 and is based in Foshan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Foshan",
        "zipcode": "528333",
        "website": "http://www.gdwanjiale.com",
        "full_time_employees": 1270
    },
    "000541.SZ": {
        "short_name": "FOSHAN ELECTRICAL",
        "long_name": "Foshan Electrical and Lighting Co.,Ltd",
        "summary": "Foshan Electrical and Lighting Co., Ltd., designs, manufactures, and markets lighting products and electrical equipment in the People's Republic of China and internationally. Its products primarily include LED light sources and luminaries, automotive LED luminaries, traditional lighting products, and switches and sockets, as well as LED indoor and outdoor lighting products, electrical tapes, and switch panels. Foshan Electrical and Lighting Co., Ltd. was founded in 1958 and is headquartered in Foshan, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Foshan",
        "zipcode": "528000",
        "website": "http://www.chinafsl.com",
        "full_time_employees": 7916
    },
    "000988.SZ": {
        "short_name": "HUAGONG TECH CO",
        "long_name": "Huagong Tech Company Limited",
        "summary": "Huagong Tech Company Limited manufactures and sells laser equipment, optical communication devices, laser holographic anti-counterfeiting products, and sensors and information tracing in China and internationally. The company offers proton diagnosis and treatment equipment; and laser smart equipment, such as laser cutting systems, laser welding systems, laser marking products, laser texturing equipment, laser heat treatment systems, laser drilling machines, lasers and various supporting devices, laser processing equipment and plasma cutting equipment, etc. It also provides Laser holographic anti-counterfeiting products, including positioning / non-positioning laser bronzing film, universal version of laser bronzing film, laser anti-counterfeiting packaging materials and integrated encryption anti-counterfeiting mark, holographic two-dimensional code, positioning transfer paper, etc. In addition, the company offers sensor products, such as NTC and PTC series thermistors, and automotive electronics to provide multi-dimensional sensing and control solutions; and optical communication products, such as source optical devices, passive optical devices, intelligent terminals, optical components, etc. Additionally, it provides cloud computing, intelligent manufacturing service platform, license industry anti-counterfeiting, energy industry laser processing, aerospace application, 3C industry laser processing, and automotive industry application solutions. Its products are used in consumer electronics, mechanical manufacturing, communication networks, automobile, aviation, iron and steel metallurgy, shipbuilding and national military defense. Huagong Tech Company Limited was founded in 1999 and is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430223",
        "website": "http://www.hgtech.com.cn",
        "full_time_employees": 7352
    },
    "002028.SZ": {
        "short_name": "SIYUAN ELECTRIC CO",
        "long_name": "Sieyuan Electric Co., Ltd.",
        "summary": "Sieyuan Electric Co., Ltd. researches and develops, produces, sells, and services power transmission and distribution equipment in China and internationally. The company offers relay protection equipment and monitoring system for substations; circuit breakers and disconnectors; power capacitors; current and voltage transformers; and grounding devices, reactors, dynamic reactive power compensation products, active filtering devices, DGA and online monitoring systems, etc. Sieyuan Electric Co., Ltd. was founded in 1993 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.syec.com",
        "full_time_employees": 5602
    },
    "002058.SZ": {
        "short_name": "SHANGHAI WELLTECH",
        "long_name": "Shanghai Welltech Automation Co.,Ltd.",
        "summary": "Shanghai Welltech Automation Co., Ltd. manufactures and sells industrial automation instruments and meters in China. The company's industrial automation instruments and meters products consists pressure transmitters; home flowmeters that include ele flowmeters, vortex flowmeters, ele water meters, and ele heat meters; temperature measuring instruments; control valves; and electric actuators. It also provides system integration products; and thermal mass flowmeters, metal rotor flow meters, turbine flow meters, ultrasonic flow meters, throttling devices, ultrasonic liquids, and magnetic products. Shanghai Welltech Automation Co., Ltd. was founded in 1992 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201103",
        "website": "http://www.welltech.com.cn",
        "full_time_employees": 183
    },
    "002074.SZ": {
        "short_name": "GUOXUAN HIGH-TECH",
        "long_name": "Gotion High-Tech Co.,Ltd.",
        "summary": "Gotion High-Tech Co., Ltd. engages in the research and development, production, and operation of lithium-ion batteries and materials in China and internationally. The company also offers power transmission and transformation equipment. Its principal products include LFP and NCM materials and batteries, battery packs, BMS, and energy storage battery packs. The company was founded in 1998 and is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230012",
        "website": "http://www.gotion.com.cn",
        "full_time_employees": 7817
    },
    "002130.SZ": {
        "short_name": "SHENZHEN WOER HEAT",
        "long_name": "ShenZhen Woer Heat-Shrinkable Material Co.,Ltd.",
        "summary": "ShenZhen Woer Heat-Shrinkable Material Co.,Ltd. engages in the research and development, production, and sale of heat-shrinkable materials in China. The company offers heat shrinkable sleeves, busbar, and cable accessories; cold shrink cable accessories; cable branch boxes; ring network cabinets; high and low voltage switchgear; and WQFB fully insulated closed busbar, as well as high temperature silicone products, such as high temperature resistant PTFE casing, conductor connecting tubes, heat shrinkable composite double wall tubes, silicone rubber tubes, PTFE casing, civil non-slip pattern tubes, halogen-free environmental protection PE cross-linked wires, etc. It also provides dual and single wall products, separable connectors mated products, accessories, busbar connection systems, inner cone plug-in products, cables, wires, chargers, connectors, and other products. The company serves electronics, power, metallurgy, petrochemical, automotive, high-speed rail, coal mine, and aerospace sectors. It also exports its products to Europe, the United States, Southeast Asia, and internationally. The company was founded in 1998 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.woer.com",
        "full_time_employees": 5893
    },
    "002141.SZ": {
        "short_name": "INFUND HOLDING CO",
        "long_name": "Infund Holding Co., Ltd.",
        "summary": "Infund Holding Co., Ltd. develops, manufactures, and sells fine and special enameled wires for electronic information, automobile, household appliance, and defense technology industries primarily in China, Southeast Asia, and Europe. It offers polyurethane enameled copper round wires for use in small motors, small transformers, magnetic heads, telecommunication equipment coils, ignition coils, micro-motors, mini-transformers, and water valves, as well as in power, high frequency, time, automotive, telecom, and sealed relays. The company also offers polyester enameled copper round wires for use in general purpose motors, portable generators, heat-resistance transformers, contactors, electromagnetic valves, coils for electronical communications and illuminating apparatus, and hermetic diving motors. In addition, it provides polyester-imide enameled copper round wires for heat-resistance motors, automotive components, reversing valves, coils of induction cooker, motors for electric tools, magnetos, dry-type transformers, automotive relays, and heat-resistance transformers. Further, the company offers self-bonding enameled copper round wires comprising polyurethane enameled copper round wires with a bonding layer for use in speaker coils, driving motors for watch, vibrator motors, laser head and magnetic head coils, and other non-frame coils; and thermosetting type polyester or polyesterimide enameled copper round wires with a bonding layer for use in high output voice coils and motors, electrical tools, and heat-resistance motors. Additionally, it provides fine rectangular magnet wires. The company was formerly known as Guangdong Ronsen Super Micro-Wire Co., Ltd. and changed its name to Infund Holding Co., Ltd. in January 2017. Infund Holding Co., Ltd. was founded in 1985 and is headquartered in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": null,
        "website": "http://www.rosen.com.cn",
        "full_time_employees": 870
    },
    "002168.SZ": {
        "short_name": "SHENZHEN HIFUTURE",
        "long_name": "Shenzhen Hifuture Information Technology Co., Ltd.",
        "summary": "Shenzhen Hifuture Information Technology Co., Ltd. develops, produces, sells, installs, and distributes network integrated solutions of electrical equipment with insulation and miniaturization in China and internationally. The company offers electric distribution net products, such as medium pressure products, IA gas insulated ring network cabinets, IA solid insulating rings, intelligent switch on columns, Hdkf products, box type fixed switchgears, box type ring network switching equipment, Withdrawout metal clad and metal enclosed switchgears, outdoor high voltage AC drop type fuses, prefabricated substations, tube bus product information products, SMC products, and cable accessories, as well as system solutions. It also provides network traffic management services based on the marketing with data; and researches, develops, and distributes mobile games. The company was formerly known as Shenzhen Hifuture Electric Co., Ltd. Shenzhen Hifuture Information Technology Co., Ltd. was founded in 1999 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518118",
        "website": "http://www.hifuture.com",
        "full_time_employees": null
    },
    "002276.SZ": {
        "short_name": "ZHEJIANG WANMA CO",
        "long_name": "Zhejiang Wanma Co., Ltd.",
        "summary": "Zhejiang Wanma Co., Ltd. produces and sells power cables. The company offers 1-500kV XLPE, plastic, computer, low voltage, 1-35kV aerial, waterproof, underground, prefabricated branched power, and aerial insulation cables, as well as set cables for special conditions. It also provides wires and cables for electrical equipment; bare, aluminum stranded, and steel-cored aluminum stranded wires; copper and aluminum rods; special, mine, coaxial, silicon rubber, and fluorin plastic cables; and cable accessories, such as cable terminals and middle connectors. The company offers its products for use in electrical power, communication, petrochemistry, railway, metallurgy, and steel industries. It has operations in China, Southeast Asia, Japan, the United States, the European Union, and Russia. The company was founded in 1992 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311305",
        "website": "http://www.wanma-cable.com",
        "full_time_employees": null
    },
    "002298.SZ": {
        "short_name": "ANHUI SINONET AND",
        "long_name": "Anhui Sinonet & Xinlong Science & Technology Co., Ltd.",
        "summary": "Anhui Sinonet & Xinlong Science & Technology Co., Ltd. provides system integrator, equipment and integrated solution, and system operation services in China. The company offers smart city integrated management platform for security; and HD network cameras. It also provides energy storage and charging pile systems, high and low voltage power products, high and low voltage component products, automation products, transformers, power quality control products. The company offers its products under the iChinaE, SINONET, FIAMM, and other brands. The company was formerly known as Anhui Xinlong Electrical Co., Ltd. and changed its name to Anhui Sinonet & Xinlong Science & Technology Co., Ltd. in December 2015. The company was founded in 1998 and is based in Wuhu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhu",
        "zipcode": null,
        "website": "http://www.ah-zdxl.com",
        "full_time_employees": null
    },
    "002300.SZ": {
        "short_name": "FUJIAN NANPING SUN",
        "long_name": "Fujian Nanping Sun Cable Co., Ltd.",
        "summary": "Fujian Nanping Sun Cable Co., Ltd. researches, develops, produces, and sells wires and cables in China. It offers aluminum alloy conductor XLPE insulated power cables, mining rubber flexible cables, control cables, PVC insulated wires, PVC and XLPE insulated power cables, overhead insulated cables, and photovoltaic cables. The company was founded in 1958 and is based in Nanping, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanping",
        "zipcode": null,
        "website": "http://www.npcable.com",
        "full_time_employees": 1937
    },
    "002309.SZ": {
        "short_name": "JIANGSHU ZHONGLI G",
        "long_name": "Jiangsu Zhongli Group Co.,Ltd",
        "summary": "Jiangsu Zhongli Group Co.,Ltd manufactures and sells wires and cables in China and internationally. It provides power, wind, control, data, marine, mine, rail transit, photoelectric composite, electronic line of certification, automobile, board coaxial, communication, and aluminum alloy cables, as well as overhead conductors and steel core aluminum standard wires. The company also offers distribution, dielectric self-supported fiber optic, feeder, and home segment cable products, as well as outdoor central beam tubed optical fiber and outdoor self-supporting optical fiber cable products; polymer materials; solar products; and packaging products. In addition, it provides WLAN, smart grid, shipboard cable, high-speed railway cable, rail transit, new energy cable, and automobile cable solutions, as well as FTTX optical-fiber network integrated and solar roof solutions. Further, the company offers intelligent communication automatic net equipment; and operates photovoltaic power stations. It serves communication, equipment manufacturing, rail transit, power, mining, ship and ocean engineering, solar new energy, electric power transmission, architecture, aerospace device, photovoltaic and wind energy power station, and automobile industries. The company was formerly known as Zhongli Science and Technology Group Co., Ltd. and changed its name to Jiangsu Zhongli Group Co., Ltd. in February 2017. Jiangsu Zhongli Group Co.,Ltd was founded in 1988 and is based in Changshu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changshu",
        "zipcode": null,
        "website": "http://www.zhongli.com",
        "full_time_employees": null
    },
    "002335.SZ": {
        "short_name": "KEHUA DATA CO LTD",
        "long_name": "Kehua Data Co., Ltd.",
        "summary": "Kehua Data Co., Ltd. engages in the research, development, manufacture, and sale of renewable energy and data center products under the Kehua brand name worldwide. It offers central inverters, inverter containers, and central distribution systems; energy storage systems and converters, and storage batteries; grid-tied PV and string inverters; solar controllers, off grid inverters and chargers, single and three phase inverters, and 48V inverters; charging modules, and AC and DC chargers; combiner boxes and Pb-C batteries; and other customized products. The company also provides online transformer-based, online transformer less, modular, line interactive, offline, lithium, and DC UPS; telecom inverter, static transfer switch, and industry UPS systems; and customized products comprising voltage and frequency adjustable UPS systems. In addition, it offers accessories, including 3 phase ATS racks, 3 phase bypass maintenance racks, 3 phase input racks, 3 phase lightning protection racks, 3 phase UPS distribution racks, batter racks, lead-acid batteries, MMBMs, PDU modules, single phase composite racks, single phase lightning protection racks, SNMPs, 3 phase voltage regulators, AC distribution cabinets, active power filters, battery cabinets, chargers, distribution cabinets, outdoor cabinets, power distribution cabinets, rack battery cabinets, and wall-mounted lightning protection products. Further, the company provides data center systems; and SNMP adapters, data collection devices, data center monitoring and management systems, data acquisition modules, leakage sensor modules, contact monitor modules, and GSM modules. The company was formerly known as Kehua Hengsheng Co., Ltd. and changed its name to Kehua Data Co., Ltd. in January 2021. Kehua Data Co., Ltd. was founded in 1988 and is headquartered in Xiamen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": null,
        "website": "http://www.kehua.com",
        "full_time_employees": 3555
    },
    "002346.SZ": {
        "short_name": "SHANGHAI ZHEZHONGG",
        "long_name": "Shanghai Zhezhong Group Co., Ltd.",
        "summary": "Shanghai Zhezhong Group Co., Ltd. manufactures and sells sets of switching equipment in China. It operates through Industrial and Building Installation Industry segments. The company offers complete sets of switching equipment; spare parts; and PHC pipe piles. It also provides building installation services. The company was formerly known as Shanghai Zhezhong Construction Co., Ltd. and changed its name to Shanghai Zhezhong Group Co., Ltd. in March 2015. Shanghai Zhezhong Group Co., Ltd. is based in Shanghai, China. Shanghai Zhezhong Group Co., Ltd. is a subsidiary of Shanghai Kang Feng Investment Management Company Limited.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201424",
        "website": "http://www.ch-zzcc.com",
        "full_time_employees": 485
    },
    "002356.SZ": {
        "short_name": "SHENZHEN HEMEI GRO",
        "long_name": "Shenzhen Hemei Group Co.,LTD.",
        "summary": "Shenzhen Hemei Group Co.,LTD. engages in the tourism, finance, smart technology, and Internet technology businesses in Japan and internationally. It operates 200 boutique stores that provide jewelry, men's wear, women's wear, casual wear, sportswear, children's wear, and shoes primarily in France, Italy, Germany, Switzerland, and Spain. The company also offers products and services, such as consumer loans, industrial investment, financing, financial services, brand funds, etc. In addition, it provides smart home, intelligent hardware, and new energy products; and Internet technology products. The company was formerly known as Shenzhen Haoningda Meters Co., Ltd. and changed its name to Shenzhen Hemei Group Co.,LTD. in May 2016. Shenzhen Hemei Group Co.,LTD. was founded in 1994 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518053",
        "website": "http://www.hemei.cn",
        "full_time_employees": null
    },
    "002358.SZ": {
        "short_name": "HENAN SENYUAN ELEC",
        "long_name": "Henan Senyuan Electric Co., Ltd.",
        "summary": "Henan Senyuan Electric Co., Ltd. engages in the research and development, manufacture, and sales of high, medium, and low voltage power generation, transmission, and distribution equipment in China and internationally. It also researches and develops, designs, produces, constructs, installs, operates, and maintains energy power plants, port power supply facilities, energy saving, and emission reduction facilities. The company's products include charging station equipment; high and medium voltage switchgears; pre-installed transformer substation and switching station; switchgears for rail traction; medium voltage switch elements; medium/low voltage electric power quality correction equipment; microprocessor protection devices and systems; transformers; medium voltage mutual inductors and embedded poles; low voltage switch elements and switchgears; photovoltaic power generation systems; insulators; molding copper contact/rows; and intelligent independent power supply systems. Its products are used in national grid, energy, rail transit, petrochemical, building materials, municipal, medical and health, metallurgy, and other fields. Henan Senyuan Electric Co., Ltd. was founded in 1992 and is based in Changge, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changge",
        "zipcode": "461500",
        "website": "http://www.hnsyec.com",
        "full_time_employees": null
    },
    "002364.SZ": {
        "short_name": "HANGZHOU ZHONGHENG",
        "long_name": "Hangzhou Zhongheng Electric Co., Ltd",
        "summary": "Hangzhou Zhongheng Electric Co., Ltd. provides electric power information and electronics products in China, Asia, Africa, Europe, the United States, Oceania, and internationally. The company offers communication power supply, HVDC, electric power supply, electric vehicle charging piles, mobile charging vehicles, remote supply new energy, metro PSD power supply, and smart lighting drive power supply products, as well as electric power information technology and energy Internet products. It also provides communication power supply; electric operation power supply; new energy electric vehicle charging/swap system; smart lighting; energy storage products; and power supply integrated solutions. The company serves power grid enterprises, power generation companies, and industrial enterprises. Hangzhou Zhongheng Electric Co., Ltd. was founded in 1996 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310053",
        "website": "http://www.hzzh.com",
        "full_time_employees": 1911
    },
    "002388.SZ": {
        "short_name": "SHENZHEN SUNYES EL",
        "long_name": "Shenzhen Sunyes Electronic Manufacturing Holding Co., Ltd.",
        "summary": "Shenzhen Sunyes Electronic Manufacturing Holding Co., Ltd. engages in the research and development of electronic manufacturing solutions, and provision of services for electronic manufacturing systems in China and internationally. The company offers soldering equipment, such as soldering stations, lead-free solder bars/wires, rework stations, soldering pots, desoldering pumps, solder wire stands, smoke absorbers, electric irons, hot air guns, thermometers, and system testers. It also provides fastening technology products comprising electric screwdrivers, electric power supplies, torque meters, digital force gauges, automatic screw suppliers, torque screwdrivers, dispensing controllers, tape dispensers, and ceramic screwdrivers. In addition, the company offers antistatic technology products, including ionizing blowers and air guns, surface resistance testers, wrist strap testers, multi-functional testers, and body antistatic products, as well as antistatic wrist straps, brushes, tweezers, and racks. Further, it provides optical technology products consisting of magnifying lamps and magnifiers; moisture-proof cabinets; and hand tools and other products, such as pliers, counters, spring balances, alcohol bottles, and others. The company was founded in 1989 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518026",
        "website": "http://www.sunyes.cn",
        "full_time_employees": null
    },
    "002471.SZ": {
        "short_name": "JIANGSU ZHONGCHAO",
        "long_name": "Jiangsu Zhongchao Holding Co., Ltd.",
        "summary": "Jiangsu Zhongchao Holding Co., Ltd. manufactures and sells wires and cables in China. The company's products include power cables, wires and cables for electrical equipment, bare wires, flame-retardant ultra-high voltage cross-linked cables, aluminum alloy overhead lines, computer cables, control cables, frequency conversion cables, compensation wires and cables, overhead wires, universal rubber sheathed flexible cables, branch cables, and intrinsically safe cables. Its products are primarily used in the construction and reconstruction of urban and rural power grids. The company also exports its products to India, Vietnam, Australia, Oman, Sudan, Tanzania, Nigeria, Kenya, Sri Lanka, Mauritius, South Africa, Brazil, Cyprus, and other countries. The company was formerly was formerly known as Jiangsu Zhongchao Cable Corporation and changed its name to Jiangsu Zhongchao Holding Co., Ltd. in September 2015. Jiangsu Zhongchao Holding Co., Ltd. is based in Yixing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yixing",
        "zipcode": "214242",
        "website": "http://www.zckggf.com",
        "full_time_employees": 1997
    },
    "002484.SZ": {
        "short_name": "NANTONG JIANGHAI C",
        "long_name": "Nantong Jianghai Capacitor Co. Ltd.",
        "summary": "Nantong Jianghai Capacitor Co. Ltd. engages in the manufacture, sale, and service of capacitors, related materials, and accessories in the People's Republic of China. The company offers aluminum electrolytic capacitors, including screw type, snap-in, radial, and polymer capacitors; film capacitors, such as DC-link and snubber capacitors; and super capacitors comprising radial, snap-in, and coin type capacitors. Its products are used in various fields, including industrial automation, power supply, consumer electronics, lifting equipment, transportation, and new energy sectors. The company also exports its products. Nantong Jianghai Capacitor Co. Ltd. was founded in 1958 and is based in Nantong, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nantong",
        "zipcode": "226361",
        "website": "http://www.jianghai.com",
        "full_time_employees": 3563
    },
    "002491.SZ": {
        "short_name": "TONGDING INTERCONN",
        "long_name": "Tongding Interconnection Information Co., Ltd.",
        "summary": "Tongding Interconnection Information Co., Ltd. engages in the research and development, production, and sale of optical preform, fibers and cables, various types of communication cables, and communication devices in the People's Republic of China. It also provides network security equipment and services, big data analysis and operation services, etc. The company was formerly known as Jiangsu Tongding Optic-Electronic Co., Ltd. and changed its name to Tongding Interconnection Information Co., Ltd. in January 2015. The company is based in Wujiang, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wujiang",
        "zipcode": null,
        "website": "http://www.tdgd.com.cn",
        "full_time_employees": null
    },
    "002498.SZ": {
        "short_name": "QINGDAO HANHE CABL",
        "long_name": "Qingdao Hanhe Cable Co.,Ltd",
        "summary": "Qingdao Hanhe Cable Co.,Ltd researches and develops, manufactures, and supplies cables and wires primarily in the People's Republic of China. The company offers power cables, cable accessories, submarine cables, optical power composite cables, electrical equipment wires and cables, overhead conductors, communication cables, radio-frequency cables, bus bar and prefabricated branch cables, nuclear plant cables, fire-resistant cables, and DC series cables. It also provides shipboard and mining cables, heat-resistant and high-strength aluminum alloy wires, carbon fiber wires, data cables, oil platform cables, wind farm cables, and flame retardant cables, as well as services of laying, installation, and completion test for cables and cable accessories. In addition, the company offers high-voltage electrical equipment status monitoring products for smart transformer substations and cable fault testing systems; electrical equipment testing services for customers in power, metallurgy, chemical and petroleum industries; electric power design, engineering, and installation services; and operation maintenance services for transformer substations. Its products are used in the fields of power, metallurgy, telecommunication, railway, petroleum and chemical, coal mining, construction, etc. The company also exports its products to approximately 30 countries and regions. Qingdao Hanhe Cable Co.,Ltd was founded in 2007 and is headquartered in Qingdao, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": "266102",
        "website": "http://www.hanhe-cable.com",
        "full_time_employees": null
    },
    "002518.SZ": {
        "short_name": "SHENZHEN KSTAR SCI",
        "long_name": "Shenzhen KSTAR Science and Technology Co., Ltd.",
        "summary": "Shenzhen KSTAR Science and Technology Co., Ltd. manufactures and sells data center infrastructure products in the People's Republic of China. The company offers data center products, such as UPS, battery, and precision cooling products, as well as integrated solutions for use in finance, communication, government, enterprise, and data center construction fields. It also provides PV inverters, including string, energy storage, central, container, monitoring, and combiner box inverters, as well as residential and commercial PV, and utility PV inverter solutions. Shenzhen KSTAR Science and Technology Co., Ltd. also offers its products and services to approximately 90 countries worldwide. The company was founded in 1993 and is based in Shenzhen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.kstar.com",
        "full_time_employees": 2897
    },
    "002533.SZ": {
        "short_name": "GOLDCUP ELECTRIC A",
        "long_name": "Gold cup Electric Apparatus Co.,Ltd.",
        "summary": "Gold cup Electric Apparatus Co.,Ltd. researches, develops, manufactures, and sells wires and cables in Central, Southern, and Western China. It offers electrical equipment wire, including non-sheathed and sheathed cable, flexible cable and wire, screened cable, low smoke halogen free flame retardant wire, exquisite flame retardant wire, high-end easy home wire, radiated European standard wire, computer cable, plastics insulated and sheathed control cable products. The company also provides cable and conductor products comprising plastics insulated power cable, XLPE insulated cable, XLPE insulated power cable, areial insulated cable, and overhead conductor; and aluminum alloy and flexible MI fireproof cable products. In addition, it offers rubber flexible, mining, elevator, motor winding lead, waterproof rubber sheathed, silicon rubber insulated and sheathed flexible, butyronitrile compound insulation and sheathed power, internal connecting, rail transit, ship power, and PV cables, as well as copper core. The company offers its products for use in power projects, railways, construction machinery, minerals, aviation, buildings, electrical appliance, transformer companies, etc. It also exports its products to Europe, Australia, Kenya, Angola, Vietnam, Maldives, Malaysia, and Singapore. The company was founded in 1999 and is based in Changsha, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": "421007",
        "website": "http://www.gold-cup.cn",
        "full_time_employees": null
    },
    "002546.SZ": {
        "short_name": "NANJING XINLIAN EL",
        "long_name": "Nanjing Xinlian Electronics Co., Ltd.",
        "summary": "Nanjing Xinlian Electronics Co., Ltd. manufactures and markets electricity information collection systems for the power industry in China. The company provides intelligent power distribution equipment and systems, and distribution automation equipment. It also offers energy management systems, smart energy cloud platforms, power cabinet systems, low-voltage complete sets, and power communication detection systems. In addition, the company provides integrated energy services and solutions to grid enterprises and enterprise users. Nanjing Xinlian Electronics Co., Ltd. is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "211100",
        "website": "http://www.xldz.com",
        "full_time_employees": 927
    },
    "002580.SZ": {
        "short_name": "SHANDONG SACRED SU",
        "long_name": "Shandong Sacred Sun Power Sources Co., Ltd.",
        "summary": "Shandong Sacred Sun Power Sources Co., Ltd. designs, manufactures, and distributes reserve power and motive power batteries worldwide. Its reserve power batteries are used in the telecom and utility industries, uninterruptible power supplies, and various applications requiring stored energy solutions, including solar and wind renewable energy; and motive power batteries are used in electric forklifts and other commercial electric powered vehicles. The company was founded in 1991 and is headquartered in Qufu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qufu",
        "zipcode": "273100",
        "website": "http://www.sacredsun.com",
        "full_time_employees": 1923
    },
    "002606.SZ": {
        "short_name": "DALIAN INSULATOR",
        "long_name": "Dalian Insulator Group Co., Ltd",
        "summary": "Dalian Insulator Group Co.,Ltd, together with its subsidiaries, engages in the research, production, and sale of electrical porcelain and composite insulators, station post insulators, and porcelain hardware fittings in China. The company offers long rod suspension composite, disc suspension porcelain, ground wire, composite post and hollow, and ceramic hollow and post insulators. It also exports its products to approximately 40 countries. The company was founded in 1915 and is based in Dalian, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116600",
        "website": "http://www.insulators.cn",
        "full_time_employees": 1321
    },
    "002617.SZ": {
        "short_name": "ROSHOW TECHNOLOGY",
        "long_name": "Roshow Technology Co., Ltd.",
        "summary": "Roshow Technology Co., Ltd. primarily engages in the research, development, manufacture, sale of electromagnetic products in China. The company's principal products include composite enameled copper round wires, variable frequency enameled copper round wires, self-adhesive enameled copper round wires, corona enamelled copper round wires, enameled round aluminum wires, and various ultra-fine enameled wires. Its products are used in the home appliance, electric power, telecommunication, electronic, medical equipment, automobile, wind power generation, power supply equipment, and aerospace fields. The company also offers motors. In addition, it invests in, designs, constructs, operates, services, and distributes photovoltaic power plants. The company also exports its products to the United States, Brazil, Japan, Italy, Mexico, and Slovakia. Roshow Technology Co., Ltd. was founded in 1984 and is based in Zhuji, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuji",
        "zipcode": "311814",
        "website": "http://www.roshowtech.com",
        "full_time_employees": null
    },
    "002638.SZ": {
        "short_name": "DONGGUAN KINGSUN O",
        "long_name": "Dongguan Kingsun Optoelectronic Co.,Ltd.",
        "summary": "Dongguan Kingsun Optoelectronic Co., Ltd. manufactures and sells LED lighting products worldwide. The company offers street lights, tunnel lights, wall packs, garden lights, bollards, parking lot lights, and solar lights for roads and areas; high bay and low bay lights, and canopy lights for industrial applications; and flood, projection, wallwash, in-ground, linear, and pixel lights for architectural applications. It also provides smart lights, bulbs, tubes, battens, downlights, panel lights, spotlights, ceiling lights, pendant lights, table lamps, floor lights, and wall lights for residential and commercial applications. The company was founded in 1993 and is based in Dongguan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": "523565",
        "website": "http://www.kingsunlights.com",
        "full_time_employees": null
    },
    "002684.SZ": {
        "short_name": "DYNAVOLT REN ENERG",
        "long_name": "Guangdong Dynavolt Renewable Energy Technology Co., Ltd.",
        "summary": "Guangdong Dynavolt Renewable Energy Technology Co., Ltd. researches and develops, manufactures, and sells lead batteries and fittings, plastic products, and related products primarily in China. Its lead batteries comprise gel nanotechnology, sealed activated AGM, and factory activated maintenance free batteries; maintenance free batteries with acid packs; and high performance and conventional dry charge batteries. The company offers its products for motorcycles and vehicle starting, electric vehicles, back-up power, telecommunication and lightening, storage power, etc. It sells its products under the MENSHY, DYNAVOLT, etc. brands in approximately 90 countries. The company was formerly known as Dynavolt Renewable Power Technology Co., Ltd. and changed its name to Guangdong Dynavolt Renewable Energy Technology Co., Ltd. in June 2016. Guangdong Dynavolt Renewable Energy Technology Co., Ltd. was founded in 2001 and is headquartered in Shantou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shantou",
        "zipcode": null,
        "website": "http://en.dynavolt.net",
        "full_time_employees": null
    },
    "002706.SZ": {
        "short_name": "SHANGHAI LIANGXIN",
        "long_name": "Shanghai Liangxin Electrical Co., Ltd.",
        "summary": "Shanghai Liangxin Electrical Co., Ltd. researches, develops, and produces low-voltage electrical apparatus in China. The company offers frame breakers, molded case circuit breakers, dual power supply products, disconnectors, miniature circuit breakers, and electromagnetic circuit breakers. It also provides industrial products comprising contactors, contactor relays, switch capacitor contactors, starters, switches, thermal relays, and motor protection circuit breakers. It serves the energy, telecommunications, construction, electricity, industrial, and other industries. The company was founded in 1999 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201206",
        "website": "http://www.sh-liangxin.com",
        "full_time_employees": 2975
    },
    "002730.SZ": {
        "short_name": "DIANGUANG EXPLOSIO",
        "long_name": "Dianguang Explosion-Proof Technology Co., Ltd.",
        "summary": "Dianguang Explosion-proof Technology Co., Ltd. engages in the research and development, production, sale, and service of explosion protection electrical appliances in China. It offers H.V. vacuum breakers and LED laneway lamps; mining explosion-proof cap lamps, vacuum feeder switches, vacuum electromagnetic starters, dry type transformers, and movable substations; and explosion protection power distribution boxes, maintenance power socket boxes, manipulators, and connection chambers. The company also provides explosion protection luminescent lighting, floodlight, metal halide lamp, and exit signal lighting products, as well as LED explosion-proof lighting products; and weatherproof distribution boxes and manipulators. It has applications in various sectors, including coal and non-coal mining, electric power, oil refineries, chemical and petrochemical plants, onshore and offshore plants, low temperatures, fuel depots, and fuel tanker loading/unloading areas. The company was founded in 1998 and is based in Wenzhou, China. Dianguang Explosion-Proof Technology Co., Ltd. is a subsidiary of Dianguang Technology Co.,Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wenzhou",
        "zipcode": "325600",
        "website": "http://www.dianguang.com",
        "full_time_employees": null
    },
    "002782.SZ": {
        "short_name": "SHENZHEN CLICK TEC",
        "long_name": "Shenzhen Click Technology Co.,Ltd",
        "summary": "Shenzhen Click Technology Co., Ltd. designs, produces, sells, and services LED lighting power supplies, power battery chargers, communication power supplies, adapters, magnetic components, electric car chargers, charging piles, inverters, and others in the People's Republic of China. The company also exports its products to Europe, the United States, Australia, South America, and other Asian countries and regions. Shenzhen Click Technology Co., Ltd. was founded in 1995 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.clickele.com",
        "full_time_employees": 3910
    },
    "002845.SZ": {
        "short_name": "SHENZHEN TXD TECHN",
        "long_name": "Shenzhen TXD Technology Co., Ltd.",
        "summary": "Shenzhen TXD Technology Co., Ltd. engages in the research, design, development, production, and sale of liquid crystal display module products for private enterprises. It offers TFT liquid crystal display modules, touch display integrated modules, camera modules, AMOLED, full screen, and other products that are used in mobile phones, tablet computers, digital cameras, Medical equipment display, instrumentation, vehicle display, and other fields. The company sells its products in China, Hong Kong, Macau, and Taiwan. Shenzhen TXD Technology Co., Ltd. was founded in 2004 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.txdkj.com",
        "full_time_employees": 5832
    },
    "002849.SZ": {
        "short_name": "ZHEJIANG VIEWSHINE",
        "long_name": "Zhejiang Viewshine Intelligent Meter Co.,Ltd",
        "summary": "Zhejiang Viewshine Intelligent Meter Co.,Ltd develops and supplies smart metering technology and solutions for gas and water customers worldwide. The company offers basic and smart ultrasonic water meters; ultrasonic-residential, ultrasonic-C&I, and mechanical-residential gas meters; Enhanced Metering and Billing Cloud, a modularization-design software; and gateways, repeaters, and HHU devices. Its solutions include AMI, a solution that provides various options of communication, smart meters, and structures for residential, commercial, and industrial applications; Walk-by solution, which consists of wireless smart meter, HHU, converter, and management software; and Prepayment solutions. Zhejiang Viewshine Intelligent Meter Co.,Ltd is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310015",
        "website": "http://www.viewshine.cn",
        "full_time_employees": null
    },
    "002860.SZ": {
        "short_name": "HANGZHOU STAR SHUA",
        "long_name": "Hangzhou Star Shuaier Electric Appliance Co., Ltd.",
        "summary": "Hangzhou Star Shuaier Electric Appliance Co., Ltd. designs, researches, develops, produces, and markets overload protectors for compressors and starters in China and internationally. The Company was founded in 1997 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.hzstarshuaier.com",
        "full_time_employees": 1196
    },
    "002869.SZ": {
        "short_name": "SHENZHEN GENVICT T",
        "long_name": "Shenzhen Genvict Technologies Co., Ltd.",
        "summary": "Shenzhen Genvict Technologies Co., Ltd., together with its subsidiaries, provides equipment and solutions for intelligent transportation in China and internationally. It offers system integrator services for intelligent transportation and the Internet of vehicles; and highway intelligent transportation, urban intelligent transportation, public security traffic management, and V2X solutions. The company's products include ETC intelligent terminal and microwave roadside units, OBU classic and issue terminals, and IC card readers and writers; lane controllers and vehicle identification RSUs for urban parking; radio frequency identification (RFID) readers and writers, read-and-write antennas, and lane controllers, as well as ceramic RFID tags; and roadside and on board units, and communication modules. It serves government, operators, and end users. Shenzhen Genvict Technologies Co., Ltd. was founded in 2004 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518000",
        "website": "http://www.genvict.com",
        "full_time_employees": null
    },
    "002876.SZ": {
        "short_name": "SHENZHEN SUNNYPOL",
        "long_name": "Shenzhen Sunnypol Optoelectronics Co., Ltd.",
        "summary": "Shenzhen Sunnypol Optoelectronics Co., Ltd. engages in the research and development, production, and sale of LCD polarizers in China. It offers polarizers for LCDs and 3D glasses, protective films for FPD, and brightness enhancement polarizers. The company was founded in 2007 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518107",
        "website": "http://www.sunnypol.com",
        "full_time_employees": null
    },
    "002882.SZ": {
        "short_name": "JINLONGYU GROUP CO",
        "long_name": "Jinlongyu Group Co., Ltd.",
        "summary": "Jinlongyu Group Co., Ltd. engages in the research and development, production, sale, and service of wires and cables in China. The company offers low smoke halogen free, low smoke halogen free flame retardant, fire resistant low smoke halogen, fire resistant, flame retardant, and aluminum alloy wires and cables, as well as waterproof, anti-ant, branch cables, etc. It also provides PVC insulated and sheathed power cables; and XLPE insulated power cables. The company was founded in 1996 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518112",
        "website": "http://www.szjly.com",
        "full_time_employees": 1219
    },
    "002892.SZ": {
        "short_name": "KELI MOTOR GROUP C",
        "long_name": "Keli Motor Group Co., Ltd.",
        "summary": "Keli Motor Group Co., Ltd. manufactures and sells micro motors in China. The company offers single-phase shaded pole motors, single-phase universal motors, step motors, cross flow blowers, DC brushless motors, servo systems, reduction gear motors, and pumps. These motors are used in microwave oven, exhaust fan, oven, fan heater, electric fireplace, air conditioner, food processor, hair dryer, air pump, vacuum cleaner, paper shredder, air pump, water pump (dishwasher washer pump and draining pump), garden tools, electric tools, household appliances, printer, scanner, lighting, camera-control monitor, other IT lines, and industrial control equipment. Keli Motor Group Co., Ltd. also exports its products to the United States, Germany, Italy, Spain, Poland, Australia, Turkey, Syria, and internationally. The company was formerly known as Hunan Keli Motor Co.,Ltd. and changed its name to Keli Motor Group Co., Ltd. in May 2019. Keli Motor Group Co., Ltd. was founded in 2010 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.kelimotor.com",
        "full_time_employees": 3312
    },
    "002922.SZ": {
        "short_name": "EAGLERISE ELECTRIC",
        "long_name": "Eaglerise Electric & Electronic (China) Co., Ltd",
        "summary": "Eaglerise Electric & Electronic (China) Co., Ltd. manufactures and sells products and solutions of power supply and components in China and internationally. The company offers LED drivers, LED application products, switching power supply products, power supply transformers, inductors, special type transformers, reactors, and distribution transformers. Its products are used in applications, such as lighting, new energy, electricity utility, industrial control, etc. The company was formerly known as Eaglerise Electric & Electronic (Foshan) Co., Ltd. and changed its name to Eaglerise Electric & Electronic (China) Co., Ltd. in 2011. Eaglerise Electric & Electronic (China) Co., Ltd. was founded in 1999 and is headquartered in Foshan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Foshan",
        "zipcode": "528200",
        "website": "http://www.eaglerise.com",
        "full_time_employees": 2457
    },
    "002927.SZ": {
        "short_name": "GUIZHOU TAIYONG-CH",
        "long_name": "Guizhou Taiyong-Changzheng Technology Co.,Ltd.",
        "summary": "Guizhou Taiyong-Changzheng Technology Co., Ltd. manufactures and sells low-voltage circuit breakers in China. The company offers universal, plastic case, molded case leakage protection, and miniature circuit breakers; and medium and low voltage dual power conversion switch electrical appliances, industrial and fire pump controllers, electrical fire monitoring products, etc. It offers its products in railway, airport, hospital, highway, finance, petrochemical, power grid, telecommunication, energy, real estate construction, and other fields. The company was formerly known as Guizhou Changzheng Switch Manufacturing Co., Ltd. and changed its name to Guizhou Taiyong-Changzheng Technology Co., Ltd. in October 2015. Guizhou Taiyong-Changzheng Technology Co., Ltd. was founded in 2008 and is based in Zunyi, China. The company is a subsidiary of Shenzhen Yongtai Technology Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zunyi",
        "zipcode": "563000",
        "website": "http://www.taiyong.net",
        "full_time_employees": 1276
    },
    "002979.SZ": {
        "short_name": "CHINA LEADSHINE TE",
        "long_name": "China Leadshine Technology Co., Ltd.",
        "summary": "China Leadshine Technology Co., Ltd. designs, manufactures, and sells motion control products in the worldwide. The company's products include stepper drives and motors, integrated steppers, closed loop stepper drives and motors, integrated easy servo motors, integrated servo motors, brushless and brushed servo drives and motors, PC based and standalone motion controllers, power supplies, and companion accessories. Its products are used in OEM applications and industries, such as CNC machinery, semiconductor, electronics, inkjet printing, medical, packaging, lab automation, textile, etc. China Leadshine Technology Co., Ltd. markets its products through its global distribution network, which include local distributors. The company was founded in 1997 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518055",
        "website": "http://www.leadshine.com",
        "full_time_employees": 712
    },
    "002981.SZ": {
        "short_name": "RISUNTEK INC",
        "long_name": "Risuntek Inc.",
        "summary": "Risuntek Inc. researches, develops, manufactures, and sells electroacoustic products and components. The company was founded in 2005 and is based in Guangdong, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": "523508",
        "website": "http://www.risuntek.com",
        "full_time_employees": 2997
    },
    "002993.SZ": {
        "short_name": "DONGGUAN AOHAI TEC",
        "long_name": "Dongguan Aohai Technology Co., Ltd.",
        "summary": "Dongguan Aohai Technology Co., Ltd. engages in the research, development, production, and sale of consumer electronics products in China. The company operates in the fields of low-power smart charging, smart mobile power, wireless charging, and integration with power and PC power supplies. Its products include chargers, mobile power supplies, smart homes, and AI hardware, as well as energy products, such as personal energy packs and smart charging posts. The company was founded in 2003 and is based in Dongguan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": null,
        "website": "http://www.aohaichina.com",
        "full_time_employees": 4714
    },
    "003021.SZ": {
        "short_name": "SHENZHEN ZHAOWEI M",
        "long_name": "Shenzhen Zhaowei Machinery & Electronic Co., Ltd.",
        "summary": "Shenzhen Zhaowei Machinery & Electronic Co., Ltd. engages in the research, design, manufacture, assembly, and sale of the micro motor, gearbox, and other micro precision transmission systems. The company offers DC motors; DC, palnetary, brushless, brushed, 12V, 24V, stepper, and custom gear motors; planetary, miniature, speed reducer, plastic and metal planetary, electric motor, and custom gearboxes, as well as planetary gearheads; linear actuator motors; and customized products, such as smart home, consumer elecronics, communication, automobile, and intelligent robot drives. It serves automobiles, communication and medical technology, home automation, consumer electronics, intelligent robots, and industry equipment markets. The company was founded in 2001 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518127",
        "website": "http://www.szzhaowei.net",
        "full_time_employees": 1765
    },
    "003031.SZ": {
        "short_name": "HEBEI SINOPACK ELE",
        "long_name": "Hebei Sinopack Electronic Technology Co.,Ltd.",
        "summary": "Hebei Sinopack Electronic Technology Co.,Ltd. develops, produces, and sells multi-layer ceramic packaging products. The company offers electronic ceramic products for use in the areas of optical communication, industrial laser, infrared detector, microwave communication, automotive electronics, and consumer electronics. It also engages in the import and export business; and the provision of technical consulting services. The company was founded in 2009 and is based in Shijiazhuang, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": null,
        "website": "http://www.sinopack.com.cn",
        "full_time_employees": 307
    },
    "0580.HK": {
        "short_name": "SUN.KING TECH",
        "long_name": "Sun.King Technology Group Limited",
        "summary": "Sun.King Technology Group Limited, an investment holding company, manufactures and trades in power electronic components for use in power transmission and distribution, electrified transportation, industrial, and other sectors in the People's Republic of China. It also engages in the research, development, production, sale, installation, and after sale service of electrical/electronic components, including integrated gate bipolar transistors; and production of electrical capacitors and its devices, amorphous alloy transformers, DC current anode saturable dry-type reactors, and FM voltage AC traction devices. In addition, the company manufactures and sells pulsed power equipment, insulated gate bipolar transistor gate units, and other electronic parts. Further, it engages in the technology research of electronic power device railway equipment; distribution and sale of power electronic components; import and export of goods and technologies; and trading of various products and technologies. The company was formerly known as Sun.King Power Electronics Group Limited and changed its name to Sun.King Technology Group Limited in November 2020. Sun.King Technology Group Limited was founded in 2002 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101318",
        "website": "http://www.sunking-tech.com",
        "full_time_employees": 620
    },
    "0842.HK": {
        "short_name": "LEOCH INT'L",
        "long_name": "Leoch International Technology Limited",
        "summary": "Leoch International Technology Limited, an investment holding company, researches and develops, manufactures, and sells lead acid batteries under the LEOCH brand name in the People's Republic of China, Europe, the Middle East, Africa, the Americas, and Asia-Pacific region. The company primarily offers reserve power, SLI, and motive power batteries, such as AGM VRLA, VRLA-GEL, pure lead, UPS high rate, marine, railway, start-stop, automotive, motorcycle, golf cart, scrubber sweeper, and electric vehicle batteries, as well as OPzV, OPzS, PzS, PzV, and PzB tubular plate batteries. Its products are used in various areas, such as telecommunication, power system, radio and television system, railway, solar energy, UPS, emergency lights, security, alarm, gardening tool, car, motorcycle, golf cart, forklift truck, electric vehicle and baby carrier, etc. The company also leases properties. In addition, it engages in the recycle and remanufacture of lead from batteries disposed of. The company was founded in 1999 and is headquartered in Shenzhen, the People's Republic of China. Leoch International Technology Limited is a subsidiary of Master Alliance Investment Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518054",
        "website": "http://www.leoch.com",
        "full_time_employees": 14553
    },
    "0LT.F": {
        "short_name": "LEOCH INT.TECH.REGS HD-01",
        "long_name": "Leoch International Technology Limited",
        "summary": "Leoch International Technology Limited, an investment holding company, researches and develops, manufactures, and sells lead acid batteries under the LEOCH brand name in the People's Republic of China, Europe, the Middle East, Africa, the Americas, and Asia-Pacific region. The company primarily offers reserve power, SLI, and motive power batteries, such as AGM VRLA, VRLA-GEL, pure lead, UPS high rate, marine, railway, start-stop, automotive, motorcycle, golf cart, scrubber sweeper, and electric vehicle batteries, as well as OPzV, OPzS, PzS, PzV, and PzB tubular plate batteries. Its products are used in various areas, such as telecommunication, power system, radio and television system, railway, solar energy, UPS, emergency lights, security, alarm, gardening tool, car, motorcycle, golf cart, forklift truck, electric vehicle and baby carrier, etc. The company also leases properties. In addition, it engages in the recycle and remanufacture of lead from batteries disposed of. The company was founded in 1999 and is headquartered in Shenzhen, the People's Republic of China. Leoch International Technology Limited is a subsidiary of Master Alliance Investment Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518054",
        "website": "http://www.leoch.com",
        "full_time_employees": 14553
    },
    "1725.HK": {
        "short_name": "ETERNITYTEC-200",
        "long_name": "Eternity Technology Holdings Limited",
        "summary": "Eternity Technology Holdings Limited, an investment holding company, provides electronics manufacturing services in the People's Republic of China, Mexico, Brazil, South Korea, India, Hong Kong, the United States, Taiwan, the United Kingdom, and Austria. The company provides design enhancement and verification; technical advice and engineering solutions; raw materials selection and procurement; quality control; logistic and delivery; and after-sale services for assembling and production of printed circuit board assemblies and fully-assembled electronic products for banking and finance, telecommunication, and smart device industries. Its fully-assembled electronic products include mobile phones, digital projectors, mobile point-of-sale, photovoltaic inverters, tablets, and street lamp controllers. The company was founded in 2003 and is headquartered in Shenzhen, China. As of April 21, 2021, Eternity Technology Holdings Limited operates as a subsidiary of Hong Kong Aerospace Technology Group Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.szeternity.com",
        "full_time_employees": 546
    },
    "200541.SZ": {
        "short_name": "FOSHAN ELECTRICAL",
        "long_name": "Foshan Electrical and Lighting Co.,Ltd",
        "summary": "Foshan Electrical and Lighting Co., Ltd., designs, manufactures, and markets lighting products and electrical equipment in the People's Republic of China and internationally. Its products primarily include LED light sources and luminaries, automotive LED luminaries, traditional lighting products, and switches and sockets, as well as LED indoor and outdoor lighting products, electrical tapes, and switch panels. Foshan Electrical and Lighting Co., Ltd. was founded in 1958 and is headquartered in Foshan, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Foshan",
        "zipcode": "528000",
        "website": "http://www.chinafsl.com",
        "full_time_employees": 7916
    },
    "300001.SZ": {
        "short_name": "QINGDAO TGOOD ELEC",
        "long_name": "Qingdao TGOOD Electric Co., Ltd.",
        "summary": "Qingdao TGOOD Electric Co., Ltd. researches, designs, develops, and manufactures primary and secondary electric transformers and distribution substations in China. It is also involved in leasing power equipment; constructing and operating energy vehicle charging and discharging stations or points; the provision of financing leasing services; and solid thermal storage business. The company was founded in 2004 and is based in Qingdao, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": null,
        "website": "http://www.qdtgood.com",
        "full_time_employees": 6562
    },
    "300048.SZ": {
        "short_name": "HICONICS ECO-ENERG",
        "long_name": "Hiconics Eco-energy Technology Co., Ltd.",
        "summary": "Hiconics Eco-energy Technology Co., Ltd. produces and sells industrial automation control and energy equipment in China and internationally. The company offers medium voltage VFD products, low voltage VFD products, and servo motor drives; powertrain systems, motors, EV chargers, energy automobile products, and components; and energy conservation and environment protection products. The company was formerly known as Hiconics Drive Technology Co., Ltd. and changed its name to Hiconics Eco-energy Technology Co., Ltd. in December 2016. Hiconics Eco-energy Technology Co., Ltd. was founded in 2003 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100176",
        "website": "http://www.hiconics.com",
        "full_time_employees": 1224
    },
    "300068.SZ": {
        "short_name": "ZHEJIANG NARADA PO",
        "long_name": "Zhejiang Narada Power Source Co., Ltd.",
        "summary": "Zhejiang Narada Power Source Co., Ltd. develops, manufactures, sells, and services communication backup, motive power, and renewable energy storage batteries and accessories. The company offers VRLA type lead acid batteries, lithium-ion cells and batteries, and related components and subsystems, as well as energy hybrid, DG/battery hybrid, battery cabinet, battery racks and accessories, and home and commercial energy storage solutions. Its products are used in telecom, electric power, railway, and other infrastructure industries, as well as used to store renewable energy from photovoltaic energy and wind farms. The company was founded in 1994 and is headquartered in Hangzhou, China. Zhejiang Narada Power Source Co., Ltd. is a subsidiary of Narada Holdings Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310030",
        "website": "http://www.naradapower.com",
        "full_time_employees": 7469
    },
    "300073.SZ": {
        "short_name": "BEIJING EASPRING M",
        "long_name": "Beijing Easpring Material Technology CO.,LTD.",
        "summary": "Beijing Easpring Material Technology CO.,LTD. engages in the research, development, production, and sale of energy materials in China and internationally. The company offers cathode materials for lithium ion batteries; and NCM532, NCM622, and lithium cobalt oxide materials. It also provides NCA, LCO, LMO, and precursor materials, which are used in electric vehicle, consumer electronics, energy storage terminals, and other fields. The company was founded in 2001 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100160",
        "website": "http://www.easpring.com.cn",
        "full_time_employees": null
    },
    "300076.SZ": {
        "short_name": "NINGBO GQY VIDEO &",
        "long_name": "Ningbo GQY Video & Telecom Joint-Stock Co., Ltd.",
        "summary": "Ningbo GQY Video & Telecom Joint-Stock Co., Ltd. provides visual information system solutions in China. The company offers projection display screen, display unit cabinet, image processing system, interactive electronic blackboard LPD, application management software system, AR-VIS system platform, and cross platform applications, as well as DLP, LED, and LCD splicing display unit. It also provides various solutions, such as visual comprehensive display, public security system, traffic police system, fire system, rail transit, petroleum and petrochemical, power system, information and communication, financial system, water system, utility, 3d stereo mosaic display system, IP streaming media splicing display system, PGIS information system, and project performance, as well as solutions for the mining industry. Its products are used in various fields comprising national defense, government, public security, transport, water conservancy, education, public health, energy, etc. The company was founded in 1992 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315336",
        "website": "http://www.gqy.com.cn",
        "full_time_employees": null
    },
    "300112.SZ": {
        "short_name": "SHENZHEN MAXONIC A",
        "long_name": "Shenzhen Maxonic Automation Control Co., Ltd.",
        "summary": "Shenzhen Maxonic Automation Control Co., Ltd. engages in contracting and distribution of automation process control products worldwide. Its products include electric and pneumatic actuators, flow and level measuring instruments, positioners, signal conditioners, temperature controllers, and valves. The company also provides technical solutions. It serves power, chemical and petrochemical, iron and steel, paper making, and water treatment industries. Shenzhen Maxonic Automation Control Co., Ltd. was founded in 1994 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.maxonicauto.com",
        "full_time_employees": 1275
    },
    "300120.SZ": {
        "short_name": "TIANJIN JINGWEI HU",
        "long_name": "Tianjin Jingwei Huikai Optoelectronic Co., Ltd.",
        "summary": "Tianjin Jingwei Huikai Optoelectronic Co., Ltd. researches and develops, produces, and sells magnet wires under the JWHK brand primarily in China. The company provides aluminum magnet, enameled round copper, enameled rectangular copper/aluminum, film wrapped, glass-fiber wrapped, paper covered, twist aluminum, combined, and continuous transposed conductor wires. Its products are used in electric power, electrical and mechanical facility, electrical equipment, home appliances, electronics, communication and transportation, and other fields. The company also exports its products to Taiwan, Southeast Asia, the Middle East, Africa, Europe, and the United States. The company was formerly known as Tianjin Jing Wei Electric Wire Co., Ltd. Tianjin Jingwei Huikai Optoelectronic Co., Ltd. was founded in 1999 and is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": null,
        "website": "http://www.jwdc.cn",
        "full_time_employees": 2500
    },
    "300124.SZ": {
        "short_name": "SHENZHEN INOVANCE",
        "long_name": "Shenzhen Inovance Technology Co.,Ltd",
        "summary": "Shenzhen Inovance Technology Co.,Ltd engages in the research, development, manufacture, and sale of industrial automation control products for equipment manufacturers in China. The company offers standard industrial automation products, including standard drives, such as inverters and optional parts; motion controls comprising servo drives, servo motors, and optional parts; and automatic controls, such as digital instruments, PLC, HMI, and optional parts. It also provides control and drive systems, which comprise integrated drives for elevators and cranes; specialized inverters for cranes and elevators; and specialized servo drives and motors for injection molding machines. In addition, the company offers OEM industry solutions for the elevator, wire and cable, crane, digital control machine-tool, textile and printing, printing and package, and other industries; and reconstruction industry solutions. Shenzhen Inovance Technology Co.,Ltd was founded in 2003 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518110",
        "website": "http://www.inovance.cn",
        "full_time_employees": 12866
    },
    "300141.SZ": {
        "short_name": "SUZHOU INDSTRL PRK",
        "long_name": "Suzhou Industrial Park Heshun Electric Co., Ltd.",
        "summary": "Suzhou Industrial Park Heshun Electric Co., Ltd. engages in the research, development, manufacture, sale, and service of electric power and power quality equipment in China. The company offers high and low voltage power equipment, and power transformers; high and low voltage power quality equipment; energy metering devices, including centralized measuring boxes and monomer metering boxes; and electric car charging/changing station equipment, such as DC chargers and AC charging piles. It also provides power capacitors comprising high voltage shunt, collective, dry high voltage shunt, coupling, pulse, circuit breaker, and mica capacitors, as well as TYD capacitive voltage transformers and automatic switching controllers. The company was founded in 1998 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215122",
        "website": "http://www.cnheshun.com",
        "full_time_employees": 237
    },
    "300207.SZ": {
        "short_name": "SUNWODA ELECTRONIC",
        "long_name": "Sunwoda Electronic Co.,Ltd",
        "summary": "Sunwoda Electronic Co.,Ltd engages in the research, design, manufacture, and sale of lithium-ion battery modules worldwide. The company offers portable power batteries, automobile battery and powertrain products, and mobile phone and tablet PC cases, as well as lithium-ion cells, power management systems, and precision components; and systems and integrated energy, automation and intelligent manufacturing, and laboratory testing services. Its products are used in mobile phones, notebooks computers, electric vehicle powertrains, VR products, wearable devices, drones, smart hardware, energy storage and Internet products, power tools, electric bicycles, and other fields. The company was founded in 1997 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518108",
        "website": "http://www.sunwoda.com",
        "full_time_employees": null
    },
    "300208.SZ": {
        "short_name": "QINGDAO ZHONGZI ZH",
        "long_name": "Qingdao Zhongzi Zhongcheng Group Co.,Ltd.",
        "summary": "Qingdao Zhongzi Zhongcheng Group Co., Ltd. engages in the research and development of power equipment in China and internationally. It offers green power grid products, such as high voltage parallel connecting and filter capacitors, and magnetically-controlled static var compensation devices. The company also invests in the construction of power plants, and grid transmission and distribution facilities; acquires mining properties; and invests in, develops, and operates industrial parks. In addition, it develops and operates in various industries, such as tap water, natural gas, highways, ports, terminals, and fisheries through BOT, IBO, and PPP. Further, the company is involved in financial investment activities. The company was formerly known as Qingdao Hengshun Zhongsheng Group Co., Ltd. and changed its name to Qingdao Zhongzi Zhongcheng Group Co., Ltd. in February 2019. Qingdao Zhongzi Zhongcheng Group Co., Ltd. was founded in 1998 and is headquartered in Qingdao, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": null,
        "website": "http://www.qdhengshun.com",
        "full_time_employees": 433
    },
    "300259.SZ": {
        "short_name": "SUNTRONT TECHNOLOG",
        "long_name": "Suntront Technology Co., Ltd.",
        "summary": "Suntront Technology Co., Ltd. develops, manufactures, and sells smart meters in China and internationally. The company offers smart water, gas, heat, and energy meters; and remote devices and other products. It also provides prepayment, automatic meter reading, and technique related solutions, as well as smart management software with various functions, such as file creation, account opening, daily business dealing, sale and multi inquiry, report summary, read/write card, input/collect data, bill printing, blacklist checking, etc. Suntront Technology Co., Ltd. was founded in 2000 and is headquartered in Zhengzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": "450001",
        "website": "http://www.suntront.com",
        "full_time_employees": 1586
    },
    "300265.SZ": {
        "short_name": "JIANGSU TONGGUANG",
        "long_name": "Jiangsu Tongguang Electronic Wire & Cable Co., Ltd.",
        "summary": "Jiangsu Tongguang Electronic Wire & Cable Co., Ltd. produces and sells wires and cables in the People's Republic of China and internationally. The company offers fiber optic cables, transmission cables, and equipment cables that can be used in telecommunication, mobile, radio and television, power, railway, other communication, and overhead transmission lines, as well as power cables for architecture, urban lighting, wind power projects, transportation projects, etc. It also provides overhead conductors, including ordinary conductors and energy-saving conductors. The company was founded in 2000 and is headquartered in Haimen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Haimen",
        "zipcode": "226100",
        "website": "http://www.tgjt.cn",
        "full_time_employees": 1227
    },
    "300274.SZ": {
        "short_name": "SUNGROW POWER SUPP",
        "long_name": "Sungrow Power Supply Co., Ltd.",
        "summary": "Sungrow Power Supply Co., Ltd. researches, develops, produces, sells, and services solar, wind, and other energy storage equipment in China. The company offers photovoltaic inverters, such as concentrated, string, and household inverters for ground-mounted, distributed, and rooftop PV power plants; driving systems for new energy vehicles; and floating systems. It also provides iSolarCloud, a remote monitoring and O &M platform for the operation and management of multiple energies. Sungrow Power Supply Co., Ltd. was founded in 1997 and is headquartered in Hefei, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230088",
        "website": "http://www.sungrowpower.com",
        "full_time_employees": 4492
    },
    "300283.SZ": {
        "short_name": "WENZHOU HONGFENG E",
        "long_name": "Wenzhou Hongfeng Electrical Alloy Co., Ltd.",
        "summary": "Wenzhou Hongfeng Electrical Alloy Co., Ltd., together with its subsidiaries, researches, develops, manufactures, and supplies electrical contact materials in the People's Republic of China. It offers structured composite electrical contact materials and components; composite clad electrical contact materials and components, including composite button contact materials, profiled contact materials, composite rivet contact materials, clad strips and stamped parts, Cu/Fe/Cu and Cu/Al/Cu clad materials, and novel Cu/Ag/Cu clad materials; electrical contact assemblies comprising staked and welded contact assemblies; and welding and other accessories, such as solder pastes and brazing material systems. The company also provides thermostat bimetal products consisting of stamping parts and strips; and cemented carbide products, including coaling and geological mining products, road repair tools, carbide burrs and rods, tire studs, CNC cutting inserts, non-standard products, wear resistant parts, wood working knives and glass cutters, and tools of processing building materials. Its products are used in industrial electrical equipment, such as AC contactors, miniature circuit breakers, molded-case circuit breakers, intelligent air circuit breakers, relays, and fuses; construction apparatus, including wall mounted switches and socket outlets; automotive equipment, such as thermostats; and communications electronics, which include micro motors and touch switches. The company was founded in 1997 and is headquartered in Yueqing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yueqing",
        "zipcode": "325603",
        "website": "http://www.wzhf.com",
        "full_time_employees": null
    },
    "300286.SZ": {
        "short_name": "ACREL CO LTD",
        "long_name": "Acrel Co.,Ltd.",
        "summary": "Acrel Co.,Ltd. provides power monitoring and management, electrical safety, and other system solutions for grid customers in China. The company produces and sells medium voltage measurement and control devices, power monitoring and protection systems, energy metering devices, building electrical and mechanical energy saving controllers, power quality monitoring and governance systems, and power sensors. It also provides installation services. The company was founded in 2003 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.acrel.cn",
        "full_time_employees": null
    },
    "300301.SZ": {
        "short_name": "SHENZHEN CHANGFANG",
        "long_name": "Shenzhen Changfang Group Co., Ltd.",
        "summary": "Shenzhen Changfang Group Co., Ltd. researches, designs, develops, produces, and sells LED products in China and internationally. It primarily offers LED lamps for whole house, living room, bedding, and kitchen. The company was formerly known as Shenzhen Changfang Light Emitting Diode Lighting Co., LTD and changed its name to Shenzhen Changfang Group Co., Ltd. in March 2016. Shenzhen Changfang Group Co., Ltd. was founded in 2005 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518118",
        "website": "http://www.cfled.com",
        "full_time_employees": null
    },
    "300317.SZ": {
        "short_name": "JIAWEI RENEWABLE E",
        "long_name": "Jiawei Renewable Energy Co., Ltd.",
        "summary": "Jiawei Renewable Energy Co., Ltd. focuses on the research and development, production, and sale of lithium-ion batteries and systems. The company is also involved in the investment, construction, and operation of photovoltaic power stations. In addition, it provides solar landscape, low voltage landscape, and portable solar lights; retrofit, puff, and track lights; and smart security and camera floodlights. The company was formerly known as Shenzhen Jiawei Photovoltaic Lighting Co., Ltd. Jiawei Renewable Energy Co., Ltd. was founded in 1993 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.jiawei.com",
        "full_time_employees": null
    },
    "300341.SZ": {
        "short_name": "MOTIC (XIAMEN) ELE",
        "long_name": "Motic (Xiamen) Electric Group Co.,Ltd",
        "summary": "Motic (Xiamen) Electric Group Co.,Ltd designs, develops, manufactures, and supplies insulation components for electrical transmission and distribution networks, and the electrical power industry. The company offers standard insulators, such as IEC pole insulators, capacitive insulators, and wall and pin bushings; embedded poles; and medium voltage OEM products, such as spouts and embedded poles for insulated switchgear. It also provides high voltage products, including GIS insulators, cable terminations, and hybrid fiber reinforced epoxy composite products. Motic (Xiamen) Electric Group Co.,Ltd was founded in 1990 and is headquartered in Xiamen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361101",
        "website": "http://www.motic-electric.com",
        "full_time_employees": 2067
    },
    "300342.SZ": {
        "short_name": "CHANGSHU TIANYIN E",
        "long_name": "Changshu Tianyin Electromechanical Co.,Ltd",
        "summary": "Changshu Tianyin Electromechanical Co., Ltd. engages in the research and development, production, and sale of refrigerator compressor parts in China. It offers mold design centers; overheat and overload protectors; current start relays; PTC starter relays; no power electronic starters; plastic suction mufflers for various refrigerator compressors; plastic spring supports/spring stands; junction boxes for various refrigeration appliances/terminal boxes of appliances; and integrated low power PTC starters. The company offers its products under the TY brand name. Changshu Tianyin Electromechanical Co., Ltd. was founded in 2002 and is based in Changshu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changshu",
        "zipcode": null,
        "website": "http://www.tyjd.cc",
        "full_time_employees": 1215
    },
    "300351.SZ": {
        "short_name": "ZHEJIANG YONGGUI E",
        "long_name": "Zhejiang Yonggui Electric Equipment Co., Ltd.",
        "summary": "Zhejiang Yonggui Electric Equipment Co., Ltd. engages in the research and development, manufacture, and sale of connectors in China and internationally. The company offers rail transit connectors, such as EMU, city rail vehicle, traction, railway passenger, and special connectors, as well as axle equipment, accessories, and tools for railway vehicle systems; and new energy products, including high voltage high current, high voltage low current, signal, power, mating, photovoltaic system connectors, as well as charging interfaces, standard battery quick couplers, manual maintenance switches, wind power slip rings, accessories, and tools. It also provides communications connectors comprising D series high density type, D Series mixed type rectangular, D series power supply type rectangular, printed circuit, D series standard, RF coaxial, PWRBLADE power, M8 sensor, M12, YGC562 Goldfinger, LED round plastic waterproof, YGC565 series, PCB micro coaxial connectors, as well as AISG male plug terminals, accessories, and tools; and military anti-explosion connectors. The company was founded in 1973 and is headquartered in Tiantai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tiantai",
        "zipcode": null,
        "website": "http://www.yonggui.com",
        "full_time_employees": 2425
    },
    "300414.SZ": {
        "short_name": "SICHUAN ZHONGGUANG",
        "long_name": "Sichuan Zhongguang Lightning Protection Technologies Co., Ltd.",
        "summary": "Sichuan Zhongguang Lightning Protection Technologies Co., Ltd. provides various professional lightning protection solutions in the People's Republic of China and internationally. It offers lighting road, earthing products; and box type, power, signal, antenna feeder, combined, and smart SDP products, as well as provides lightning warning and monitoring systems. Its products are used in communication, buildings, wind power, photovoltaic, and LED luminaries sectors. The company was founded in 1987 and is headquartered in Chengdu, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "611731",
        "website": "http://www.zhongguang.com",
        "full_time_employees": null
    },
    "300423.SZ": {
        "short_name": "SUNFLY INTELLIGENT",
        "long_name": "Sunfly Intelligent Technology Co., LTD",
        "summary": "Sunfly Intelligent Technology Co., LTD engages in the research and development, production, and marketing of high and low voltage electrical equipment in China. It offers prefabricated substations, insulated busducts, cable bridges, etc.; and KYN-40.5, KYN28-12, MNS, L-GGD, L-GCS, L-GCK, XGN2-12, HXGN17-12, ZNYBW, and other series of products, as well as supplies CNPC and CNOOC materials. The company also exports its products to Russia, India, Malaysia, Iran, Angola, and internationally. The company was formerly known as Shandong Luyitong Intelligent Electric Plc. and changed its name to Sunfly Intelligent Technology Co., LTD in September 2020. Sunfly Intelligent Technology Co., LTD was founded in 2003 and is based in Laiyang, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Laiyang",
        "zipcode": "265215",
        "website": "http://www.luyitong.com",
        "full_time_employees": 1726
    },
    "300427.SZ": {
        "short_name": "RED PHASE INC",
        "long_name": "Red phase INC.",
        "summary": "Red phase INC. provides grid systems, power generation systems, and other products worldwide. The company was formerly known as Xiamen Red Phase Instruments Inc. and changed its name to Red phase INC. in February 2018. The company is headquartered in Xiamen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361008",
        "website": "http://www.redphase.com.cn",
        "full_time_employees": 1295
    },
    "300477.SZ": {
        "short_name": "BEIJING HEZONG SCI",
        "long_name": "Beijing Hezong Science & Technology Co., Ltd.",
        "summary": "Beijing Hezong Science & Technology Co., Ltd. provides power distribution solutions in China. The company offers gas insulated ring main units, MV/LV air insulated switchgears, prefabricated substations, pole-mounted switches, distribution automation terminals, transformers, cable branching switchgears, and cable junctions, as well as electrical accessories, such as fault passage indicators and premolded cable connectors. It also provides energy management system solutions and distribution network automation solutions, as well as mobile substations. The company was founded in 1997 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100085",
        "website": "http://www.chinahezong.com",
        "full_time_employees": null
    },
    "300490.SZ": {
        "short_name": "HNAC TECHNOLOGY CO",
        "long_name": "HNAC Technology Co., Ltd.",
        "summary": "HNAC Technology Co., Ltd. provides EPC services and automation solutions to hydropower stations, substations, pump station, and water treatment projects in China and internationally. Its products include hydropower automatic systems, pump station automatic systems, intelligent distribution automate systems, water treatment systems, industrial process control systems, DCS control systems, solar power systems, and computer monitoring and control systems. It also offers engineering services, such as pre project consultation, project construction, personnel training, financing plan management, debugging, project design, quality control and assurance, and quality service and warranty, as well as procurement, logistics, and installation of complete sets of equipment. HNAC Technology Co., Ltd. was founded in 1993 and is based in Changsha, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": "410205",
        "website": "http://www.cshnac.com",
        "full_time_employees": 1719
    },
    "300491.SZ": {
        "short_name": "SHIJIAZHUANG TONHE",
        "long_name": "Shijiazhuang Tonhe Electronics Technologies Co.,Ltd.",
        "summary": "Shijiazhuang Tonhe Electronics Technologies Co.,Ltd. engages in the research and development, manufacture, sale, and service of high frequency switch mode power supply and related products in China and internationally. The company offers modular switch mode rectifiers, controller systems, and DC power supply systems; EV charging stations, including compact and separated DC fast chargers, AC chargers, and charger modules; on-board chargers and DC converters; and railway signal power supply, special power supply, and EPS products, as well as PV grid-connected inverters. Shijiazhuang Tonhe Electronics Technologies Co.,Ltd. was founded in 1998 and is based in Shijiazhuang, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": "050035",
        "website": "http://www.sjzthdz.com",
        "full_time_employees": 652
    },
    "300506.SZ": {
        "short_name": "SHENZHEN MINKAVE T",
        "long_name": "Shenzhen Minkave Technology Co., Ltd.",
        "summary": "Shenzhen Minkave Technology Co., Ltd. engages in undertaking lighting engineering projects in China. It undertakes projects in the areas of urban night planning, cultural tourism scenic spot, smart street light systems, and light shows. The company was formerly known as Shenzhen Minkave City Lighting Technology Co., Ltd. Shenzhen Minkave Technology Co., Ltd. was founded in 2001 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.minkave.com",
        "full_time_employees": null
    },
    "300543.SZ": {
        "short_name": "SHENZHEN LONGOOD I",
        "long_name": "Shenzhen Longood Intelligent Electric Co.,LTD",
        "summary": "Shenzhen Longood Intelligent Electric Co.,LTD designs, manufactures, sells, and services electronic products in China and internationally. The company offers intelligent controllers and power supply products, battery management system (BMS) and battery packs, motors, and OEM assembly products. Its products are used in smart home appliances, power tools, lithium-ion battery BMS, LED and HID lighting, electrical motor systems, energy products, and other fields. The company was founded in 2001 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518108",
        "website": "http://www.longood.com",
        "full_time_employees": 1993
    },
    "300545.SZ": {
        "short_name": "SHENZHEN LIANDE AU",
        "long_name": "Shenzhen Liande Automation Equipment co.,ltd.",
        "summary": "Shenzhen Liande Automation Equipment co.,ltd. researches, develops, manufactures, and sells industrial automatic equipment in China and intentionally. It offers production supporting equipment and non-standard automation equipment for LCMs, OLEDs, and CTPs. The company was founded in 1998 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.liande-china.com",
        "full_time_employees": null
    },
    "300548.SZ": {
        "short_name": "BROADEX TECHNOLOGI",
        "long_name": "Broadex Technologies Co., Ltd.",
        "summary": "Broadex Technologies Co., Ltd. researches and develops, manufactures, and sells integrated optoelectronic devices in the field of optical communications worldwide. The company offers built-in and external temperature-controlled array waveguide grating; fiber array; adjustable optical power wavelength division multiplexer; reflective and light blocking MEMS VOA; silicon-based dimmable attenuator; chassis, box, and bare fiber optical splitter; cabinet and box type PLC splitter; optical splitter with branch; dense fiber array; and optical fiber accessories. It also provides active optical cable, and optical transceiver module. In addition, the company provides wavelength management devices, such as optical power splitters and dense wavelength division multiplexing for fiber-to-the-home access networks and the Internet data center markets. Broadex Technologies Co., Ltd. was founded in 2003 and is based in Jiaxing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiaxing",
        "zipcode": "314006",
        "website": "http://www.broadex-tech.com",
        "full_time_employees": 1160
    },
    "300557.SZ": {
        "short_name": "WUHAN LIGONG GUANG",
        "long_name": "Wuhan Ligong Guangke Co., Ltd.",
        "summary": "Wuhan Ligong Guangke Co., Ltd. provides optical fiber sensing safety monitoring equipment and IoT application solutions in China. The company offers sensors, demodulators and processors, and operating systems, as well as technical support services. It serves the petroleum, petrochemical, traffic tunnel, perimeter security, electricity, bridge, railway, and security monitoring and information integration sectors. The company was formerly known as WIT Optical Fiber Sensing Technology Co., Ltd. and changed its name to Wuhan Ligong Guangke Co., Ltd. in August 2002. The company was founded in 2000 and is based in Wuhan, China. Wuhan Ligong Guangke Co., Ltd. is a subsidiary of FiberHome Technologies Group.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430223",
        "website": "http://www.wutos.com",
        "full_time_employees": 354
    },
    "300593.SZ": {
        "short_name": "SUPLET POWER CO LT",
        "long_name": "Beijing Xinleineng Technology Co., Ltd",
        "summary": "Beijing Xinleineng Technology Co., Ltd. manufactures and sells power supply products in China and internationally. The company primarily offers DC-DC converters, AC-DC converters, DC-AC converters, rectifiers and high-power supply products, custom power supply products, primary and embedded power products, filters, etc. It provides power devices and power systems primarily for communication, railway, electric, industrial control, new energy resources fields, etc. The company was founded in 1997 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.xinleineng.com/index/index/index.html",
        "full_time_employees": 1780
    },
    "300600.SZ": {
        "short_name": "CHANGSHU GUORUI TE",
        "long_name": "Changshu Guorui Technology Co., Ltd.",
        "summary": "Changshu Guorui Technology Co., Ltd. researches, develops, produces, and sells marine and offshore engineering electrical/automation equipment. The company offers MV switchboards, marine circuit-breakers, LV controls and switchboards, ship monitoring, power electronicsts, ship handlings, and lighting monitoring. It also provides marine electricity systems and integrated technical services. The company was formerly known as Changshu Ruite Electric Co.,Ltd and changed its name to Changshu Guorui Technology Co., Ltd. in October 2020. Changshu Guorui Technology Co., Ltd. was founded in 1993 and is based in Changshu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changshu",
        "zipcode": "215500",
        "website": "http://www.cn-ruite.com",
        "full_time_employees": 480
    },
    "300617.SZ": {
        "short_name": "JIANGSU AUKURA SMA",
        "long_name": "Jiangsu Ankura Smart Transmission Engineering Technology Co.Ltd",
        "summary": "Jiangsu Ankura Smart Transmission Engineering Technology Co.Ltd engages in the research and development, manufacture, and sale of equipment for ultra-high voltage cable transmission lines and ultra-high voltage cable connectors in China. It offers porcelain sleeve terminals, composite terminals, GIS/transformer terminals, intermediate joints, and branch connectors, as well as smart grids. The company also provides gas pipeline bus, GIL casing, and GIL monitoring systems. In addition, it engages in laying materials, and monitoring and control of equipment; provision of design, construction, and equipment comprehensive professional services, including testing, operation, and maintenance; and developing gas pipeline busbar for large-capacity underground transmission. The company was founded in 2006 and is based in Liyang, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Liyang",
        "zipcode": null,
        "website": "http://www.ankura.com.cn",
        "full_time_employees": 688
    },
    "300648.SZ": {
        "short_name": "FUJIAN NEBULA ELEC",
        "long_name": "Fujian Nebula Electronics Co., Ltd.",
        "summary": "Fujian Nebula Electronics Co., Ltd. manufactures and sells battery test equipment and solutions in China. Its product portfolio includes Li-ion battery pack PCM testers, Li-ion battery pack semi-product/end product testers, Li-ion battery pack cycle testers, power battery pack BMS testers, power battery pack EOL testers, power battery pack working condition simulators, ES inverters, wind-solar- charging-ESS control systems, automatic cell sorting machines, automatic cell and spot welding machines, Li-ion battery intelligent manufacture solution and MES, etc. The company also offers bidirectional inverters, charging piles, plasma cleaning machines, Li-on cell distance detection machines, polarity detect machines, cell holders uploading machines, and cell tidying machines, as well as laser welding and dispensing machines. Fujian Nebula Electronics Co., Ltd. was founded in 2005 and is headquartered in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": null,
        "website": "http://www.e-nebula.com",
        "full_time_employees": 1239
    },
    "300650.SZ": {
        "short_name": "TECNON (FUJIAN) CO",
        "long_name": "Tecnon (Fujian) Commercial Lighting Co., Ltd",
        "summary": "Tecnon (Fujian) Commercial Lighting Co., Ltd researches, designs, develops, produces, sells, and services commercial lighting products in China. The company offers light fixtures, including track spotlight, recessed spotlight, downlight, linear light, wall light, and decorative light products. It also provides LED signage products; standard and customized LED display products; and rental LED display products. The company offers its products for use in retail shops, hotel chains, supermarkets, business spaces, and offices, as well as in the educational, jewelry, photoelectric, residential, urban landscape, and other industries. The company was founded in 2002 and is based in Zhangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhangzhou",
        "zipcode": "363107",
        "website": "http://www.tecnon.net",
        "full_time_employees": 944
    },
    "300660.SZ": {
        "short_name": "JIANGSU LEILI MOTO",
        "long_name": "Jiangsu Leili Motor Co., Ltd",
        "summary": "Jiangsu Leili Motor Co., Ltd researches and develops, manufactures, and supplies micro-motors in China. The company offers micro-motors, such as micro stepping, synchronous, DC brush and brushless, HM hysteresis synchronous, U series, and stepper motors; and drain pumps, peristaltic pumps, electronic water pumps, and pump solution components. It also provides precision stamping parts, metal components, and automotive precision stamping parts; and electronic controllers and drives. In addition, the company is involved in equity investment, management consulting, and import and export trade activities. Jiangsu Leili Motor Co., Ltd was founded in 1993 and is headquartered in Changzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": "213011",
        "website": "http://www.czleili.com",
        "full_time_employees": 3815
    },
    "300667.SZ": {
        "short_name": "BEIJING BEETECH IN",
        "long_name": "Beijing Beetech Inc.",
        "summary": "Beijing Beetech Inc. develops, produces, and sells wireless sensor network related products in China. It offers industrial process wireless monitoring system solutions for use in the areas of smart industry, digital oil fields, smart grids, etc.; mechanical parameters wireless detection systems for use in the areas of equipment manufacturing, research and testing, teaching and experimentation, and defense research; and MEMS pressure sensor chip and module products for use in automotive and consumer electronics. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100085",
        "website": "http://www.beetech.cn",
        "full_time_employees": null
    },
    "300670.SZ": {
        "short_name": "JIANGSU DAYBRIGHT",
        "long_name": "Jiangsu Daybright Intelligent Electric Co.,LTD.",
        "summary": "Jiangsu Daybright Intelligent Electric Co.,LTD. engages in the research and development, production, and sale of distribution network automation products in China. It offers pole-mounted switch controllers, feeder automation terminals, and distribution automation terminals; digital circuit, voltage, motor, and distribution transformer protection, measurement, and control devices; communication management devices; digital standby power supply auto-input devices; outdoor high-voltage AC load switches and circuit breakers; and power transformation and distribution boxes, electric energy metering boxes, low-voltage cable branch boxes, metal-clad enclosed switch gears, low-voltage draw-out type switch cabinets, box type switching stations, and metal closed box and indoor AC high-voltage looped network switch gears. The company also provides maintenance and repair, consulting, and door-to-door services. It serves customers through sales outlets. The company is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "211100",
        "website": "http://www.daybright.cn",
        "full_time_employees": null
    },
    "300693.SZ": {
        "short_name": "SHENZHEN SINEXCEL",
        "long_name": "Shenzhen Sinexcel Electric Co.,Ltd.",
        "summary": "Shenzhen Sinexcel Electric Co.,Ltd. provides smart electric power solutions in China, rest of Asia, Australia, Europe, and North America. The company offers power quality products, such as active voltage conditioners, active harmonic filters, static var generators, ASVG products, SPC solutions, theta APF systems, Scada systems, and management systems, as well as SVG compensation technology. It also provides EV chargers modules for electric buses and vehicles, AC EV chargers, and DC fast chargers; hybrid and customized energy storage solutions; container type and centralized PV inverters; and lithium and lead acid battery packs. Shenzhen Sinexcel Electric Co.,Ltd. is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.sinexcel.com",
        "full_time_employees": null
    },
    "300700.SZ": {
        "short_name": "CHANGSHA DIALINE N",
        "long_name": "Changsha DIALINE New Material Sci.&Tech. Co., Ltd.",
        "summary": "Changsha DIALINE New Material Sci.&Tech. Co., Ltd. manufactures and sells electroplated diamond wires in China. It offers diamond wires for silicon squaring and slicing, cropping, and silicon filament cutting; and diamond wires for sapphire and magnetic materials slicing, as well as diamond wire loops. The company was founded in 2009 and is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": "410205",
        "website": "http://www.diamsaw.com",
        "full_time_employees": null
    },
    "300708.SZ": {
        "short_name": "FOCUS LIGHTINGS TE",
        "long_name": "Focus Lightings Tech Co., Ltd.",
        "summary": "Focus Lightings Tech Co., Ltd. engages in the research and development, production, and sale of LED epitaxial wafers and chips in China. It offers white light chips for LED lighting applications, as well as provides contract energy management services. The company was formerly known as Jucan Optoelectronics Technology (Suzhou) Co., Ltd. Focus Lightings Tech Co., Ltd. was founded in 2010 and is headquartered in Suzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": null,
        "website": "http://www.focuslightings.com",
        "full_time_employees": 1161
    },
    "300713.SZ": {
        "short_name": "SHENZHEN INCREASE",
        "long_name": "Shenzhen Increase Technology Co., Ltd.",
        "summary": "Shenzhen Increase Technology Co., Ltd. engages in the research and development, production, and sale of power electronic products. It offers automotive charging power, power supply, communication power, industrial power supply, and other products. The company's products are used in automotive, electric power, railways, urban transport, metallurgy, energy, communication, and other industries. Shenzhen Increase Technology Shares Co., Ltd. was founded in 2002 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.szincrease.com",
        "full_time_employees": null
    },
    "300750.SZ": {
        "short_name": "CONTEMPORARY AMPER",
        "long_name": "Contemporary Amperex Technology Co., Limited",
        "summary": "Contemporary Amperex Technology Co., Limited engages in research and development, production, and sale of electric vehicle and energy storage battery systems in China and internationally. The company's Li-ion batteries are used in electric passenger vehicles, electric buses, electric trucks, and other special vehicles; and energy storage systems are used in renewable energy, grid frequency modulation, communication base station, commercial and industrial building, and household energy storage. Contemporary Amperex Technology Co., Limited was founded in 2011 and is headquartered in Ningde, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningde",
        "zipcode": "352100",
        "website": "http://www.catlbattery.com",
        "full_time_employees": 33078
    },
    "300763.SZ": {
        "short_name": "GINLONG TECHNOLOGI",
        "long_name": "Ginlong Technologies Co., Ltd.",
        "summary": "Ginlong Technologies Co., Ltd. manufactures and sells string inverters worldwide. The company provides single and three phase inverters; data logging sticks and boxes; rapid shutdown devices; and module level rapid shutdown devices, as well as after-sales services. It sells its products for home owners, business owners, utilities, solar developers, and investors in the residential, commercial, and utility scale solar markets under the Ginlong Solis brand. The company was founded in 2005 and is headquartered in Ningbo, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315712",
        "website": "http://www.ginlong.com",
        "full_time_employees": 1571
    },
    "300800.SZ": {
        "short_name": "LIHE TECHNOLOGY (H",
        "long_name": "Lihe Technology (Hunan) Co., Ltd.",
        "summary": "Lihe Technology (Hunan) Co., Ltd. manufactures monitoring instruments for environmental automation. The company offers automatic water quality monitoring systems, air/smoke automatic monitoring systems, emergency testing products, and automated laboratory equipment, as well as an integrated information management platform for environmental monitoring. It also provides system integration and operational services. The company was founded in 1997 and is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": "410205",
        "website": "http://www.lihero.com",
        "full_time_employees": 949
    },
    "300820.SZ": {
        "short_name": "SICHUAN INJET ELEC",
        "long_name": "Sichuan Injet Electric Stock Co.,Ltd.",
        "summary": "Sichuan Injet Electric Stock Co.,Ltd. engages in research and development, production, and sale of electronics, microelectronics and power electronics, and other control equipment. Its products include AC DC power supply modules, induction heisting, polysilicon CVD reactor power system, polysilicon ingot furnace power supply, single crystal furnace power supply, sapphire furnace power supply, special power supply, power controller and system, active power filter, and other power products, as well as industrial power system solutions. The company sells its products in the United States, Japan, South Korea, Russia, India, Turkey, Mexico, Thailand, Kazakhstan, and other countries and regions. The company was founded in 1996 and is based in Deyang, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Deyang",
        "zipcode": "618000",
        "website": "http://www.injet.cn",
        "full_time_employees": 569
    },
    "300822.SZ": {
        "short_name": "SHENZHEN BESTEK TE",
        "long_name": "Shenzhen Bestek Technology Co., Ltd.",
        "summary": "Shenzhen Bestek Technology Co., Ltd. engages in the development, manufacture, and sale of smart controllers and smart products. Its products include lithium battery intelligent control protection devices and motor controllers; and smart induction lamps. The company was founded in 2010 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.szbtk.com",
        "full_time_employees": 1812
    },
    "300833.SZ": {
        "short_name": "GUANGZHOU HAOYANG",
        "long_name": "Guangzhou Haoyang Electronic Co.,Ltd.",
        "summary": "Guangzhou Haoyang Electronic Co.,Ltd. engages in the research and development, production engineering, manufacture, sale, and service of professional stage, TV, concert, theatre and architectural lighting products worldwide. It offers entertainment HID products, such as moving heads, follow spots, EOLs, and accessories; Entertainment LED products comprising moving heads, theatre fixtures, static fixtures, and EOLs; and indoor and outdoor architainment products, as well as LED displays, including indoor and outdoor, and EOL displays. The company markets its products under the TERBLY brand name. Guangzhou Haoyang Electronic Co.,Ltd. is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.terbly.com",
        "full_time_employees": null
    },
    "300835.SZ": {
        "short_name": "SINOMAG TECHNOLOGY",
        "long_name": "Sinomag Technology Co., Ltd.",
        "summary": "Sinomag Technology Co., Ltd. engages in the research and development, production, and sale of permanent ferrite and commutator products. Its products are used in the automobile, transportation, home appliance, electric tool, fitness equipment, and other markets. The company was founded in 1998 and is headquartered in Hefei, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230011",
        "website": "http://www.sinomagtech.com",
        "full_time_employees": 1587
    },
    "300843.SZ": {
        "short_name": "SHENGLAN TECHNOLOG",
        "long_name": "Shenglan Technology Co., Ltd.",
        "summary": "Shenglan Technology Co., Ltd. researches and develops, manufactures, and sells electronic connectors and precision components. The company offers Type-C series, USB connector, FFC/FPC, connector assembly, WAFER connector, and wiring harness products; new energy products; and TV lens. Its products are used in the consumer electronics, new energy vehicles, and other fields. The company was founded in 2007 and is based in Dongguan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": "523863",
        "website": "http://www.jctc.com.cn",
        "full_time_employees": null
    },
    "300870.SZ": {
        "short_name": "SHENZHEN HONOR ELE",
        "long_name": "Shenzhen Honor Electronic Co., Ltd.",
        "summary": "Shenzhen Honor Electronic Co., Ltd. manufactures switching power adapters and provides IPC power solutions worldwide. It offers quick chargers, type-C chargers, PD power supply devices, and intelligent home devices under the HONOTO and ASPOWER brands. The company was founded in 1996 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.honor-cn.com",
        "full_time_employees": 4372
    },
    "300884.SZ": {
        "short_name": "DNAKE (XIAMEN) INT",
        "long_name": "Dnake (Xiamen) Intelligent Technology Co., Ltd.",
        "summary": "Dnake (Xiamen) Intelligent Technology Co., Ltd. researches, develops, manufactures, and sells video intercom products and smart community systems to the customers worldwide. It offers a range of intercom products, such as SIP and android video door phone, analogue video door phone, smart home product, and wireless video doorbell. The company was founded in 2005 and is based in Xiamen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361006",
        "website": "http://www.dnake-global.com",
        "full_time_employees": null
    },
    "300907.SZ": {
        "short_name": "KANGPING TECHNOLOG",
        "long_name": "Kangping Technology (Suzhou) Co., Ltd.",
        "summary": "Kangping Technology (Suzhou) Co., Ltd. engages in the research and development, design, production, and sale of electric tool motors, electric tool complete machines, and related parts and accessories. The company is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": null,
        "website": null,
        "full_time_employees": 2065
    },
    "300913.SZ": {
        "short_name": "ZHEJIANG ZHAOLONG",
        "long_name": "Zhejiang Zhaolong Interconnect Technology Co., Limited",
        "summary": "Zhejiang Zhaolong Interconnect Technology Co., Limited manufactures and sells data communication cables and components in China and internationally. The company offers internal and external high-speed cables and solutions for cloud computing big data center switching and storage products; communication and data center cables; industrial and medical cables; and data, audio-visual, and control signal transmission and connection solutions for high-definition multimedia devices, VR wearable devices, PCs, drones, and other consumer products. Its products are used in communications and data centers, industrial and medical, high-end consumer electronics, and smart home and other fields. The company was founded in 1993 and is headquartered in Deqing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Deqing",
        "zipcode": "313200",
        "website": "http://web.zhaolong.com.cn/zhaolong/index",
        "full_time_employees": 1085
    },
    "300916.SZ": {
        "short_name": "SHENZHEN LONGTECH",
        "long_name": "Shenzhen Longtech Smart Control Co., Ltd.",
        "summary": "Shenzhen Longtech Smart Control Co., Ltd engages in the research and development of printed circuit boards for intelligent controllers. The company was founded in 2003 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518125",
        "website": "http://longtech.cc",
        "full_time_employees": 1244
    },
    "300932.SZ": {
        "short_name": "SANYOU CORPORATION",
        "long_name": "Sanyou Corporation Limited",
        "summary": "Sanyou Corporation Limited engages in the research and development, manufacture, and sale of relays in China. It produces various types of relays, such as magnetic latching relays, general power relays, automotive relays, and communication relays that are used in home appliances, traffic, industry, energy, information, medical treatment, and other fields. The company was incorporated in 1997 and is headquartered in Dongguan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": "523719",
        "website": "http://www.sanyourelay.com",
        "full_time_employees": null
    },
    "300933.SZ": {
        "short_name": "SINOSTAR CABLE CO",
        "long_name": "Sinostar Cable Co., Ltd.",
        "summary": "Sinostar Cable Co., Ltd. designs, manufactures, and sells wires and cables, and its accessories. The company's products include power cables, electrical equipment wires and cables, bare wires, special cables, and cable accessories. Its products are used in electric power, energy, coal, transportation, petroleum, petrochemical, national defense, urban construction, and other fields. Sinostar Cable Co., Ltd. was founded in 2003 and is based in Yixing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yixing",
        "zipcode": "241000",
        "website": "http://www.sinostar-cable.com",
        "full_time_employees": null
    },
    "300936.SZ": {
        "short_name": "CHANGZHOU ZHONGYIN",
        "long_name": "Changzhou Zhongying Science & Technology Co., Ltd",
        "summary": "Changzhou Zhongying Science & Technology Co., Ltd manufactures electronic components. The company is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": "213012",
        "website": "http://www.czzyst.gmc.globalmarket.com",
        "full_time_employees": 131
    },
    "46H.F": {
        "short_name": "HOLLYSYS AU.TECH.DL-,0001",
        "long_name": "Hollysys Automation Technologies Ltd.",
        "summary": "Hollysys Automation Technologies Ltd. provides automation solutions in the People's Republic of China, Southeast Asia, India, and the Middle East. The company offers a suite of industrial automation systems, including third-party hardware-centric products, such as instrumentation and actuators; proprietary software-centric distributed control systems/programmable logic controllers; and valued-added software packages comprising real-time management information system, HolliAS asset management system, operator training system, HolliAS batch application package, HolliAS advanced process control package, and safety instrumentation system, as well as HOLLiAS MACS-N DCS, a proprietary nuclear power non-safety automation and control system. It also provides train control center that monitors route condition, track status, train schedules, distance between trains, and the working status of other function devices, as well as generates control instructions and commands. In addition, the company offers automation train protection that operates as a train over-speed protection mechanism; and supervisory control and data acquisition system, an open software platform. Further, it offers research and development services; and provides integrated automation systems and services, mechanical and electrical solution services, and installation services. The company serves customers in the industrial, railway, subway, nuclear power, and mechanical and electronic industries. The company was formerly known as HLS Systems International Ltd. and changed its name to Hollysys Automation Technologies Ltd. in July 2009. Hollysys Automation Technologies Ltd. was founded in 1993 and is headquartered in Beijing, the People's Republic China.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100176",
        "website": "http://www.hollysys.com",
        "full_time_employees": 3598
    },
    "600067.SS": {
        "short_name": "CITYCHAMP DARTONG CO LTD",
        "long_name": "Citychamp Dartong Co., Ltd.",
        "summary": "Citychamp Dartong Co., Ltd. engages in real estate development and special enameled wire businesses in China and internationally. The company also researches, develops, produces, and sells enameled wires under the Wuyi brand; develops, produces, and sells lithium-ion battery electrolyte additives; and operates Le Mirador Resort & Spa, a five-star luxury hotel that consists of 61 rooms, Mirador medical center, Givenchy seven-star spa center, restaurant, conference room, gymnasium, indoor heated pool, and other facilities. In addition, it provides financial services. Citychamp Dartong Co., Ltd. was founded in 1956 and is headquartered in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350005",
        "website": "http://www.gcdt.net",
        "full_time_employees": 1186
    },
    "600089.SS": {
        "short_name": "TEBIAN ELECTRIC APPARATUS STOCK",
        "long_name": "TBEA Co., Ltd.",
        "summary": "TBEA Co., Ltd. provides power energy, power transmission, renewable energy, new material, and energy solutions worldwide. The company manufactures and sells transformers, switches, electric wires and cables, cable accessories, integrated substation automation products, smart distribution grids, and charging facilities. It also provides power control systems, photovoltaic products, polycrystalline silicon, flexible equipment for power transmission and distribution, white carbon black, silicon ships, and inverters. In addition, the company offers alloy materials, including alloy rods, aluminum alloy rod products, aluminum alloy ingots, re-smelting aluminum ingots, and slab ingot products; electron and electronic aluminum foils; etched and formed electrode foils; heat-insulated aluminum profiles for windows and doors, curtain wall aluminum profiles, and industry profiles; aluminum substrate plate strips; target rods, wires, and ingots; and high-purity aluminum materials, such as refined aluminum ingots for re-smelting, high-purity aluminum rods, ure aluminum round rods, and refined aluminum wires. Further, it is involved in mining and selling coal products; supplying power transmission and transformation equipment; UHV DC and AC engineering construction activities; and the provision of survey, design, construction, installation, commissioning, operation, maintenance, training, and system integration solutions, as well as charging solutions in public places. The company was founded in 1993 and is based in Changji, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changji",
        "zipcode": "831100",
        "website": "http://www.tbea.com",
        "full_time_employees": 16845
    },
    "600110.SS": {
        "short_name": "NUODE INVESTMENT CO LTD",
        "long_name": "Nuode Investment Co.,Ltd",
        "summary": "Nuode Investment Co.,Ltd engages in the production and sale of lithium-ion battery materials and electrolytic copper foils in China. It also offers power battery materials. The company was formerly known as HINA-KINWA HIGH TECHNOLOGY CO.,LTD. and changed its name to Nuode Investment Co.,Ltd in February 2016. Nuode Investment Co.,Ltd was founded in 1987 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.ndgf.net",
        "full_time_employees": 1650
    },
    "600112.SS": {
        "short_name": "GUIZHOU CHANGZHENG TIANCHENG HO",
        "long_name": "Guizhou Changzheng Tiancheng Holding Co.,Ltd.",
        "summary": "Guizhou Changzheng Tiancheng Holding Co.,Ltd. engages in the research, development, manufacture, sale, and service of transformer on load tap-changers and off-circuit tap-changers in China. It also provides motor driver mechanism products, intelligent controllers, and oil filters, as well as pre-sale, consultation, rapid response, and after-sale services. The company's products are used in electric power, petroleum, chemical, metallurgy, railway, light, and real estate industries. It also exports its products to approximately 30 countries and regions. The company is based in Zunyi, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zunyi",
        "zipcode": null,
        "website": "http://www.czdq.cn",
        "full_time_employees": 367
    },
    "600192.SS": {
        "short_name": "LANZHOU GREAT WALL ELECTRICAL C",
        "long_name": "Lanzhou GreatWall Electrical Co., Ltd",
        "summary": "Lanzhou GreatWall Electrical Co., Ltd researches, develops, manufactures, sells, and services high and medium voltage switchgear equipment in China. The company offers high and low voltage electrical components and key components, electric drive automation and new energy control systems, low voltage complete power distribution devices, bus bars, charging base station and system integration devices, and other electrical and electronic products. It also provides hydropower operation management and new energy batteries; and fruit and vegetable juices. Its products are used in power generation, transmission and distribution, nonferrous metals, metallurgy, petrochemical, coal, transportation, construction, and other industries. The company also exports its products to approximately 62 countries and regions in Europe, Asia, Africa, and Australia. Lanzhou GreatWall Electrical Co., Ltd was founded in 1998 and is based in Lanzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lanzhou",
        "zipcode": "730000",
        "website": "http://www.chinagwe.com",
        "full_time_employees": 3643
    },
    "600261.SS": {
        "short_name": "ZHEJIANG YANKON GROUP CO.LTD",
        "long_name": "Zhejiang Yankon Group Co., Ltd.",
        "summary": "Zhejiang Yankon Group Co., Ltd. researches and develops, produces, and sells energy-saving lighting fixtures in China. Its products include LED-based, commercial, home, office, and outdoor lighting products; and electronic lamps and compact fluorescent lamps. The company was founded in 1975 and is based in Shaoxing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shaoxing",
        "zipcode": "312300",
        "website": "http://www.yankon.com",
        "full_time_employees": 7125
    },
    "600288.SS": {
        "short_name": "DAHENG NEW EPOCH TECHNOLOGY INC",
        "long_name": "Daheng New Epoch Technology Inc.",
        "summary": "Daheng New Epoch Technology Inc. engages in the research, design, development, manufacture, sale, and servicing of electrical and optical-electro-mechanical products in China. Its principal products include general/special laser processing equipment; optoelectronic components, and precise machines and equipment; precise coatings for optics and optical communication products; holographic anti-counterfeiting packaging products; medical equipment; image graphic analyzing systems; digital television broadcasting devices; semiconductor components; automatic control equipment; computer hardware, software, and peripherals; computer network systems; and multimedia and digital publications. The company is also involved in the research and development of satellite position monitoring, commanding, and dispatching systems, as well as new drugs, special drugs, etc. Daheng New Epoch Technology Inc. was founded in 1998 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100080",
        "website": "http://www.dhxjy.com.cn",
        "full_time_employees": 2430
    },
    "600312.SS": {
        "short_name": "HENAN PINGGAO ELECTRIC CO LTD",
        "long_name": "Henan Pinggao Electric Co.,Ltd.",
        "summary": "Henan Pinggao Electric Co.,Ltd. researches and develops, manufactures, sells, and services high voltage, super-high voltage, and ultra-high voltage AC/DC switchgear in China. Its products include SF6 gas insulated enclosed combination electric appliances, sulfur hexafluoride tank circuit breaker switchgears, open wide type SF6 circuit breakers, disconnectors and earthing switches, hydraulic/spring mechanism, composite insulators, SF6 gas recycling devices, vacuum arcing chambers, and other spare parts of switchgear. The company is based in Pingdingshan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Pingdingshan",
        "zipcode": "600312",
        "website": "http://www.pinggao.com",
        "full_time_employees": 4766
    },
    "600353.SS": {
        "short_name": "CHENGDU XUGUANG ELECTRONICS CO ",
        "long_name": "Chengdu Xuguang Electronics Co., Ltd.",
        "summary": "Chengdu Xuguang Electronics Co., Ltd. manufactures and sells ceramic-metal electro-vacuum devices in China. The company offers ceramic-metal transmitting tubes, such as high power broadcasting transmitting tubes, VHF/UHF TV transmitting tubes, microwave communication triodes and tetrodes, and transmitting tubes for lasers, as well as driving and vibration, and industry heating tubes. It also provides ceramic-metal vacuum interrupters for vacuum circuit-breakers, vacuum load-breaking switches, and vacuum contactors; and switchgears equipped with vacuum interrupters for use in the field of electric power distribution and transmission, metallurgy, and mining industries. In addition, the company offers high and low-voltage assemblies of distribution apparatus and electrical appliance elements. Further, it provides vacuum interrupters, electron tubes, and switchgears. The company also exports its products to Germany, the United States, Turkey, Taiwan, and internationally. Chengdu Xuguang Electronics Co., Ltd. was founded in 1965 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610500",
        "website": "http://www.xuguang.com.cn",
        "full_time_employees": 1311
    },
    "600379.SS": {
        "short_name": "SHAANXI BAOGUANG VACUUM ELEC AP",
        "long_name": "Shaanxi Baoguang Vacuum Electric Device Co., Ltd.",
        "summary": "Shaanxi Baoguang Vacuum Electric Device Co., Ltd. produces and sells vacuum interrupters and vacuum switch equipment in China. The company offers vacuum interrupters, embedded poles, electro-vacuum ceramic products, solar collectors, accessories for high-voltage electrical apparatus, and electric products under the Baoguang brand name. It also exports its products to the United Arab Emirates, India, Thailand, Malaysia, Italy, Turkey, Russia, South Korea, the United States, etc. The company was founded in 1970 and is based in Baoji, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Baoji",
        "zipcode": "721016",
        "website": "http://www.baoguang.com.cn",
        "full_time_employees": 1113
    },
    "600468.SS": {
        "short_name": "TIANJIN BENEFO TEJING ELECTRIC ",
        "long_name": "Tianjin Benefo Tejing Electric Co.,Ltd.",
        "summary": "Tianjin Benefo Tejing Electric Co.,Ltd. operates in the power equipment industry. The company offers electronically controlled power distribution accessories and molds, such as terminal blocks, switches, heavy duty connectors, isolators, transmitters, switching power supplies, and relays; medium voltage epoxy resin vacuum casting transformers; and electromagnetic wires, copper rows, and coils. It also provides low-voltage electrical products comprising plastic case, miniature, intelligent universal circuit breakers, as well as automatic transfer switches; and DTV series solid insulated vacuum circuit breakers, DAW outdoor ring network cabinet, DAM intelligent center console, DTG series inflatable cabinets, Denork intelligent low voltage switchgears, and DAXB box substations. In addition, the company offers indoor metal armored pull-out and removable switchgears, VEBL high voltage vacuum and high pressure sulphur hexafluoride circuit breakers, box stations, and low voltage withdrawable switchgears. Further, it provides high temperature superconducting materials and their application products comprising high temperature superconducting wires, coils, magnets, and demonstration and experimental devices, as well as low leakage heat high temperature superconducting current leads. Additionally, the company offers centrifugal, gear, and jet, as well as single, twin, and three screw pumps. It also provides superconducting device designing, superconducting materials and superconducting device testing, superconducting wire insulation coating, and superconducting wire reinforcement services; pump application and intelligent power distribution integration solutions; and electric connecting parts supporting services. Its products are used in electric power, construction, industrial and mining, defense, shipbuilding, energy, petrochemical, and various other industries. The company was founded in 1999 and is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300385",
        "website": "http://www.benefo.tj.cn",
        "full_time_employees": 2049
    },
    "600478.SS": {
        "short_name": "HUNAN CORUN NEW ENERGY CO LTD",
        "long_name": "Hunan Corun New Energy Co., Ltd.",
        "summary": "Hunan Corun New Energy Co., Ltd. operates in the energy storage industry in China. The company manufactures battery materials, including continuous band-shaped nickel foam and punched nickel-plated steel band; battery components, such as positive and negative electrode plates of Ni-MH batteries; batteries for civil use; automotive batteries; and hybrid assembly systems. Hunan Corun New Energy Co., Ltd. was founded in 1998 and is headquartered in Changsha, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": "410205",
        "website": "http://www.corun.com",
        "full_time_employees": 2930
    },
    "600517.SS": {
        "short_name": "STATE GRID YINGDA CO LTD",
        "long_name": "State Grid Yingda Co.,Ltd.",
        "summary": "State Grid Yingda Co., Ltd. manufactures and sells transformers in China. It offers wind farm amorphous alloy transformers, silicon steel distribution transformers, prefabricated substations, amorphous alloy combination transformers, and amorphous alloy distribution transformers. The company was formerly known as Shanghai Zhixin Electric Co., Ltd. and changed its name to State Grid Yingda Co., Ltd. in April 2020. State Grid Yingda Co., Ltd. was founded in 1997 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200335",
        "website": "http://www.zhixindianqi.com",
        "full_time_employees": 2972
    },
    "600522.SS": {
        "short_name": "JIANGSU ZHONG TIAN TECH",
        "long_name": "Jiangsu Zhongtian Technology Co., Ltd.",
        "summary": "Jiangsu Zhongtian Technology Co., Ltd. engages in the research, development, design, production, supply, and installation of cable system worldwide. Its products include power cables, fittings, insulators, arresters, OPGWs, conductors, aluminum-clad steel wires, transformers, and power switch gears; optical fiber cables, FTTx cables, coaxial cables, and antennas; and submarine composite and FO cables, submarine cable accessories, and ROV cables. The company also offers marine and offshore cables; lithium ion batteries, solar cell backsheets, and photovoltaic technology products; alloy materials; and optical fiber and optical cable machines. In addition, it offers underwater cables, self supporting cables, air blowing cables, directly buried cables, fire resistance cables, ribbon cables, duct cables, micro bundle cables, anti-rodent and termite cables, occ cabinets, optical distribution boxes, field assembly connectors, drop cables, indoor cables, and hybrid cables. Further, the company offers RF jumpers, UG cables, integrative gather frames, joint closures, user control rooms, substations, inverters, flexible canbus cables, flexible data cables, flexible control cables, conductors, insulators, conductor and link fittings, ACS wires, arresters, joint boxes, environmental earthing cables, railway signal cables, and leaky cables. Additionally, it provides engineering, procurement, and construction services. The company serves telecom, power, renewable energy, and oil and gas industries. Jiangsu Zhongtian Technology Co., Ltd. was founded in 1992 and is based in Nantong, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nantong",
        "zipcode": "226009",
        "website": "http://www.chinaztt.com",
        "full_time_employees": 12495
    },
    "600560.SS": {
        "short_name": "BEIJING AIRTIME INTELLIGENT CON",
        "long_name": "Beijing AriTime Intelligent Control Co., Ltd.",
        "summary": "Beijing AriTime Intelligent Control Co., Ltd. engages in the research and development, production, and sale of industrial automation products in China. Its principal products include AriCon, an open distributed control system; AriDrive electric drive series products; AriMeter industrial testing instrument series products; AriMes process industrial manufacturing execution system software products; and metallurgical process control systems. The company's products have applications in metallurgy, mining, chemical, petroleum, machinery, electricity, energy, environmental protection, and other industries. It also undertakes automation engineering and technical service projects of industrial automation products. The company was founded in 1999 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100070",
        "website": "http://www.aritime.com",
        "full_time_employees": null
    },
    "600577.SS": {
        "short_name": "TONGLING JINGDA SPECIAL MAGNET ",
        "long_name": "Tongling Jingda Special Magnet Wire Co., Ltd.",
        "summary": "Tongling Jingda Special Magnet Wire Co., Ltd. manufactures and sells special magnet wires in China. The company provides round polyimide, polyamide-imide, self-lubricated multi-layer composite, solderable polyester, and polyvinyl formal (PVF) enameled copper wires; round enameled copper wires for DC inverter compressors; round multi-layer composite enameled copper wires for compressor of HFC air-conditioners; round composite enameled copper wires for R134a compressors; round polyurethane enameled aluminum wires; round enameled aluminum wires for HFC 134a refrigerating compressors; round polyesterimide-polyamideimide composite, polyesterimide, and polyester enameled copper and aluminum wires; and round corona resistant enameled copper and aluminum wires for inverter motors. It also offers automobile and electronic wires, such as single line tinned wires, multi-line bare and tinned copper wires, and bunched bare copper wires; and special conductors, including multi-line silver plated copper wires, heating conductors, and alloy conductors, as well as bunched tinned, silver plated, and nickel plated copper wires. In addition, the company provides various rod materials comprising oxygen free copper rods, electrical round aluminum rods, bare copper wires, and aluminum wires; and natural diamond/polycrystal drawing dies and polycrystal enameling dies. Its products are used in household appliances, electronics, automobiles, electric power, communication, and power tools industries. The company also exports its products to Europe and South Asia. Tongling Jingda Special Magnet Wire Co., Ltd. was founded in 1990 and is based in Tongling, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tongling",
        "zipcode": null,
        "website": "http://www.jingda.cn",
        "full_time_employees": 3188
    },
    "600580.SS": {
        "short_name": "WOLONG ELECTRIC GROUP CO LTD",
        "long_name": "Wolong Electric Drive Group Co., Ltd.",
        "summary": "Wolong Electric Drive Group Co., Ltd. manufactures and sells motors and control devices, power transmission and supply equipment, and power batteries worldwide. The company offers low voltage IEC and NEMA motors; medium/high voltage motors, including rib and tube cooled, modular, special, and synchronous motors; and home appliance motors, such as air conditioner, washing machine, garden machine, and kitchen motors. It also provides low and high voltage variable speed drives; synchronous and asynchronous generators; and industrial automation products comprising, servo motors, and spindles, as well as motors for electric vehicles. The company serves various industries, including automotive, chemical, home appliance, marine, mining, oil and gas, power generation, water and waste water, infrastructure, pulp and paper, and rail, as well as heating, ventilation, and air conditioning. The company was formerly known as Wolong Electric Group Co., Ltd. and changed its name to Wolong Electric Drive Group Co., Ltd. in February 2019. Wolong Electric Drive Group Co., Ltd. was founded in 1984 and is based in Shangyu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shangyu",
        "zipcode": null,
        "website": "http://www.wolong.com.cn",
        "full_time_employees": 14470
    },
    "600847.SS": {
        "short_name": "CHONGQING WANLI NEW ENERGY CO L",
        "long_name": "Chongqing Wanli New Energy Co., Ltd.",
        "summary": "Chongqing Wanli New Energy Co., Ltd. engages in the manufacture and sale of lead-acid batteries in China. It offers power, maintenance free, and low maintenance batteries for use in transportation, energy, post and telecommunication, electric power system, national defense, scientific research, and other fields. The company was formerly known as Wanli Group Co., Ltd. and changed its name to Chongqing Wanli New Energy Co., Ltd. in January 2013. Chongqing Wanli New Energy Co., Ltd. was founded in 1943 and is based in Chongqing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": null,
        "website": "http://www.cqwanli.com",
        "full_time_employees": 499
    },
    "600869.SS": {
        "short_name": "FAR EAST SMARTER ENERGY CO LTD",
        "long_name": "Far East Smarter Energy Co., Ltd.",
        "summary": "Far East Smarter Energy Co., Ltd. provides smart energy and smart city services in China and internationally. It offers aluminum alloy conductors, optical fiber composite power cables, power cables for DC transmission systems, power cables for power transmission, low-smoke halogen-free thin-walled cables for EMUs, aluminum alloy conductor industrial cables, and other intelligent wire and cable products used in smart grid, green building, clean energy, high-end equipment, and smart transportation fields. The company also provides clean energy engineering, power engineering consulting, planning and design, and general contracting services; and ternary material lithium-ion batteries. In addition, it operates MMBao, an e-commerce platform for electrical and electronics industry; and Cableabc.com, a Website for electrical and electronics industry, as well as offers commodity trading services. The company was founded in 1990 and is based in Yixing, China. Far East Smarter Energy Co., Ltd. is a subsidiary of Far East Holding Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yixing",
        "zipcode": null,
        "website": "http://www.600869.com",
        "full_time_employees": 8387
    },
    "600885.SS": {
        "short_name": "HONGFA TECHNOLOGY CO LTD",
        "long_name": "Hongfa Technology Co., Ltd.",
        "summary": "Hongfa Technology Co., Ltd. manufactures and supplies relays, low-voltage devices, contactors, precise components, automatic production lines, etc. It offers a range of relays, including signal relays, automotive relays and modules, power relays, industrial relays, latching relays, solid-state relays and power modules, and hermetically-sealed relays, as well as relay sockets. The company's low-voltage devices comprise intelligent air circuit breakers, molded case circuit breakers, automatic transfer switching, and terminal circuit breakers. It serves customers worldwide. Hongfa Technology Co., Ltd. was formerly known as WuHan LiNuo Solar Energy Group Co., Ltd. and changed its name to Hongfa Technology Co., Ltd. in December 2012. The company was founded in 1984 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361021",
        "website": "http://www.hongfa.com",
        "full_time_employees": 14235
    },
    "600973.SS": {
        "short_name": "BAOSHENG SCIENCE&TECHNOLOGY INN",
        "long_name": "Baosheng Science and Technology Innovation Co.,Ltd.",
        "summary": "Baosheng Science and Technology Innovation Co.,Ltd., together with its subsidiaries, produces and sells wire and cable products in China. It offers power, electrical equipment, and communication cables; and cable system. The company also provides control and instrumentation cables, high-frequency data and network cables, signal cables, magnet wires overhead lines, building wires, precision conductors, and polymers. Its products are used in various high-end equipment fields, including aerospace, nuclear power, marine engineering, shipbuilding, military, superconducting, intelligent equipment, high-speed rail locomotives, etc. In addition, the company offers EPC project general contracting services for electrical engineering design and installation, intelligent equipment, and photovoltaic power station construction. It has operations in Hong Kong, Macao, and Taiwan. The company also exports its products to approximately 40 countries and regions, including Southeast Asia, the Middle East, South America, Europe, Australia, etc. Baosheng Science and Technology Innovation Co.,Ltd. was founded in 1985 and is based in Yangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yangzhou",
        "zipcode": "225800",
        "website": "http://www.baoshengcable.com",
        "full_time_employees": 6010
    },
    "601126.SS": {
        "short_name": "BEIJING SIFANG AUTOMATION CO LT",
        "long_name": "Beijing Sifang Automation Co.,Ltd",
        "summary": "Beijing Sifang Automation Co.,Ltd supplies products, solutions, and services in the fields of protection, monitoring, control, and automation of electric power systems in China and internationally. It provides generation systems, including IEDs for power plant automation, protection IEDs, automation systems for power plants, torsional stress protection and control systems, simulation and training systems, and generator excitation automation systems; and transmission systems, such as substation and digital substation automation solutions, wide area protection and control systems, fault information management systems, power system stability and security control systems, wide area measurement systems, and energy management systems. The company also offers distribution systems comprising multifunction protection and control IEDs and distribution automation solutions; and transportation systems consisting of substation automation systems, and AC and DC protection IEDs for railway and subway applications. In addition, it provides renewable energy solutions, including hydro plant, micro grid, wind power plant, and PV station automation, as well as battery energy storage solutions; and industry solutions, such as electric and electronic applications, and integrated substations. Further, the company offers engineering design and training services. Beijing Sifang Automation Co.,Ltd was founded in 1994 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100085",
        "website": "http://www.sifang-electric.com",
        "full_time_employees": 3144
    },
    "601222.SS": {
        "short_name": "JIANGSU LINYANG ENERGY CO LTD",
        "long_name": "Jiangsu Linyang Energy Co., Ltd.",
        "summary": "Jiangsu Linyang Energy Co., Ltd. manufactures and supplies electronic energy meters and electricity management information systems worldwide. The company offers conventional meters, AMR meters, AMI smart meters, prepayment meters, C&I meters, balance meters, data concentrators, meter boxes, communication modules, and software products. It also provides indoor and outdoor LED lighting products, and intelligent control systems. The company was formerly known as Jiangsu Linyang Electronics Co., Ltd. and changed its name to Jiangsu Linyang Energy Co., Ltd. in December 2015. Jiangsu Linyang Energy Co., Ltd. was founded in 1995 and is based in Qidong, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qidong",
        "zipcode": "226200",
        "website": "http://www.linyang.com.cn",
        "full_time_employees": 3303
    },
    "601311.SS": {
        "short_name": "CAMEL GROUP CO. LTD.",
        "long_name": "Camel Group Co., Ltd.",
        "summary": "Camel Group Co., Ltd. engages in the research and development, production, sale, and recycling of lead acid batteries in Asia. The company produces AGM, traction, and winding batteries series products. Its products are used in automobiles, agricultural vehicles, ships, forklifts, golf carts, electric vehicles, electric motorcycles, electric bicycles, industrial, and various special purposes vehicles. The company was founded in 1980 and is headquartered in Xiangyang, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiangyang",
        "zipcode": "441057",
        "website": "http://www.chinacamel.com",
        "full_time_employees": 6907
    },
    "601567.SS": {
        "short_name": "NINGBO SANXING MEDICAL ELECTRIC",
        "long_name": "Ningbo Sanxing Medical Electric Co.,Ltd.",
        "summary": "Ningbo Sanxing Medical Electric Co.,Ltd. manufactures and sells power distribution and utilization systems in China and internationally. The company offers smart metering products, including single-phase and three-phase conventional, multi-function, prepayment, and smart meters; smart substation products comprising pad-mounted, dry type, and oil-immersed transformers, as well as pole-mounted distribution transformers; meter boxes; charge stations; and AMI and smart prepayment solutions, as well as switchgears, electric vehicle chargers, and other power equipment. It also engages in the financial leasing and commercial factoring businesses, as well as in the hospital activities. The company was formerly known as Ningbo Sanxing Electric Co., Ltd. and changed its name to Ningbo Sanxing Medical Electric Co.,Ltd. in October 2015. Ningbo Sanxing Medical Electric Co.,Ltd. was founded in 1986 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315034",
        "website": "http://www.sanxing.com",
        "full_time_employees": 5840
    },
    "601877.SS": {
        "short_name": "ZHEJIANG CHINT ELECTRICS CO LTD",
        "long_name": "Zhejiang Chint Electrics Co., Ltd.",
        "summary": "Zhejiang Chint Electrics Co., Ltd., through its subsidiaries, develops and sells low-voltage electrical products in China. It offers modular DIN rail products, molded case circuit breaker, air circuit breakers, contactors, thermal relays, starters, pilot devices, inverters and soft-starters, relays, LV capacitors, switch disconnectors, fuse-switch disconnectors, changeover switches, travel switches, universal changeover switches, and connection terminals, as well as low voltage VT, AVR, CT, and PT products. The company also provides power transformers, gas insulated switchgears, HV air-insulated switchgears, prefabricated substations, MV and LV switchgears, MV apparatus, power protection devices, HV and LV busways, surge arresters, capacitors, insulators, CT and PT products, and cables; monitoring, gas, and electricity meters; wall switches and LED lights; PV modules, grid-tied PV inverters, system products, and monitoring systems; and electronic parts, horns, and distributed control systems. In addition, it offers solar and metering solutions. The company was founded in 1984 and is based in Yueqing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yueqing",
        "zipcode": "325603",
        "website": "http://www.chint.com/zh",
        "full_time_employees": 28127
    },
    "603045.SS": {
        "short_name": "FUDA ALLOY MATERIALS CO LTD",
        "long_name": "Fuda Alloy Materials Co., Ltd.",
        "summary": "Fuda Alloy Materials Co., Ltd. engages in the research and development, production, sale, technical consultation, and service of electrical contact materials. Its products include contact rivets, contact tips, powder metallurgy contact, brazing materials, silver alloy wires, profiles, contact assemblies, and other series. The company was founded in 1994 and is headquartered in Wenzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wenzhou",
        "zipcode": "325025",
        "website": "http://www.china-fuda.com",
        "full_time_employees": 1387
    },
    "603115.SS": {
        "short_name": "NANTONG HAIXING ELECTRONICS CO ",
        "long_name": "Nantong Haixing Electronics Co., Ltd.",
        "summary": "Nantong Haixing Electronics Co., Ltd. manufacturers and sells of electrode foils for aluminum electrolytic capacitors in the People's Republic of China. Its products include medium and high voltage etched and formed foils; and low voltage etched and formed foils. The company was founded in 1977 and is headquartered in Nantong, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nantong",
        "zipcode": null,
        "website": "http://www.haistar.com.cn",
        "full_time_employees": 736
    },
    "603195.SS": {
        "short_name": "GONGNIU GROUP CO LTD",
        "long_name": "Gongniu Group Co., Ltd.",
        "summary": "Gongniu Group Co., Ltd. engages in the research, development, manufacture, and sale of civil electrical products. It offers standard, high-end surge protector, and USB power strips, as well as smart WiFi sockets, USB travel power adapters, digital timers, and power transformers; digital accessories, such as car chargers, USB cables, and power banks; decorative switches and sockets; and eye-care LED lights. The company was founded in 1995 and is based in Cixi, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Cixi",
        "zipcode": "315314",
        "website": "http://www.gongniu.cn",
        "full_time_employees": 12245
    },
    "603303.SS": {
        "short_name": "HENGDIAN GROUP TOSPO LIGHTING C",
        "long_name": "Hengdian Group Tospo Lighting Co., Ltd.",
        "summary": "Hengdian Group Tospo Lighting Co., Ltd. researches and develops, manufactures, and sells light source products, Indoor lightings, professional lightings, lighting control products, structural components, and engineering plastics. Its products include LED bulbs, spotlights, decorative lights, straight tubes and pipes, energy-saving lamps, LED indoor lighting products, panel lights, downlights, bracket lights, grille lights, intelligent lamps, street lamps, floodlights, mining lamps, wall lamps, security lamps, and other products. The company was founded in 1996 and is headquartered in Dongyang, China. Hengdian Group Tospo Lighting Co., Ltd. is a subsidiary of Hengdian Group Holdings Limited.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongyang",
        "zipcode": "322118",
        "website": "http://www.tospolighting.com",
        "full_time_employees": 4093
    },
    "603333.SS": {
        "short_name": "SUNWAY CO LTD",
        "long_name": "Sunway Co., Ltd.",
        "summary": "Sunway Co., Ltd. designs, manufactures, and sells cable products for nuclear power stations. The company was formerly known as Sichuan Star Cable Co., Ltd. Sunway Co., Ltd. was founded in 2003 and is based in Leshan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Leshan",
        "zipcode": null,
        "website": "http://www.sunwayint.com",
        "full_time_employees": 1374
    },
    "603530.SS": {
        "short_name": "JIANGSU SHEMAR ELECTRIC CO LTD",
        "long_name": "Jiangsu Shemar Electric Co.,Ltd",
        "summary": "Jiangsu Shemar Electric Co.,Ltd produces and sells transmission products and services in China. Its transmission products and services include line composite insulators and transmission line composite cross-arm towers. The company also offers substation products and services comprising substation composite insulators, polyacrylate rubber seals, anti-flashover solutions, and oil-impregnated paper capacitor composite bushings, as well as seal maintenance services; and devices and parts. Jiangsu Shemar Electric Co.,Ltd was founded in 1996 and is based in Rugao, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Rugao",
        "zipcode": "226500",
        "website": "http://www.shemar.com.cn",
        "full_time_employees": 1198
    },
    "603556.SS": {
        "short_name": "HEXING ELECTRICAL CO LTD",
        "long_name": "Hexing Electrical Co.,Ltd",
        "summary": "Hexing Electrical Co., Ltd. provides electricity equipment and related solutions to power utilities worldwide. It offers IEC, AMI, smart prepayment, grid, ANSI, recloser, and switch meter products; ring main units; solid and air insulated RMU products, RMU enclosures, and cable junction boxes. The company also offers a range of solutions, such as ATC&C/boundary metering; CIS/billing; transaction platform; outage management system; integrated distribution management system; commercial and industrial; transformer monitoring system; vending; standalone smart platform; substation automation system; and prefabricated substation solutions. The company was founded in 1992 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310011",
        "website": "http://www.hxgroup.cn",
        "full_time_employees": 3376
    },
    "603595.SS": {
        "short_name": "ZHEJIANG TONY ELECTRONIC CO LTD",
        "long_name": "Zhejiang Tony Electronic Co., Ltd",
        "summary": "Zhejiang Tony Electronic Co., Ltd researches, manufactures, and markets ultra-fine alloy wires and other metal matrix composites. The company offers ultra-fine conductors and laminating wires for use in electronic, new energy automobile, medical apparatus, and intelligent robot fields. It also provides diamond cutting lines for cutting crisp and hard materials, such as silicon and sapphire; and plate lugs that are used in the power battery of new energy automobiles. The company was founded in 2008 and is based in Huzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huzhou",
        "zipcode": null,
        "website": "http://www.tony-tech.com",
        "full_time_employees": 1470
    },
    "603606.SS": {
        "short_name": "NINGBO ORIENT WIRES AND CABLES ",
        "long_name": "Ningbo Orient Wires & Cables Co.,Ltd.",
        "summary": "Ningbo Orient Wires & Cables Co.,Ltd. designs, manufactures, installs, and services land and subsea cables worldwide. The company offers AC and DC subsea power cables, subsea equipment umbilical cables, subsea dynamic cables, subsea production umbilical cables, and intervention workover control systems, as well as aftermarket, installation, and maintenance services. It also provides land and power cables, electric equipment wires and cables, cables for special purpose, aerial cables, and optical communication cables. The company serves energy companies and subsea service providers in the onshore and offshore environments. Ningbo Orient Wires & Cables Co.,Ltd. is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315800",
        "website": "http://www.orientcable.com",
        "full_time_employees": 1138
    },
    "603662.SS": {
        "short_name": "KELI SENSING TECHNOLOGY (NINGBO",
        "long_name": "Keli Sensing Technology (Ningbo) Co.,Ltd.",
        "summary": "Keli Sensing Technology (Ningbo) Co.,Ltd., together with its subsidiaries, engages in the research and development, manufacture, and sale of various types of sensors, weighing indicators, electronic weighing systems, system integration and health scales in China and internationally. It offers beam, single point, S-type, canister, tension, digital, and other load cells, as well as weigh modules; force transducers; and digital, analog signal, bench and floor scale, and control indicators, as well as remote displays and amplifiers, as well as junction boxes, pressure transducers, Internet of Things, flow meters, and balances. The company is headquartered in Ningbo, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315033",
        "website": "http://www.kelichina.com",
        "full_time_employees": null
    },
    "603679.SS": {
        "short_name": "SICHUAN HUATI LIGHTING TECHNOLO",
        "long_name": "Sichuan Huati Lighting Technology Co.,Ltd.",
        "summary": "Sichuan Huati Lighting Technology Co.,Ltd. provides a range of architectural lighting design services, and street and landscape lighting products and accessories in China. The company offers designer and smart lighting products, as well as fixtures and poles for outdoor environments and interior spaces. Sichuan Huati Lighting Technology Co.,Ltd. was founded in 2004 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610207",
        "website": "http://www.huaticn.com",
        "full_time_employees": 791
    },
    "603685.SS": {
        "short_name": "ZHEJIANG CHENFENG SCIENCE & TEC",
        "long_name": "Zhejiang Chenfeng Technology Co., Ltd.",
        "summary": "Zhejiang Chenfeng Technology Co., Ltd. manufactures and sells lighting products in China. It offers LED bulb light radiators, lamp holders, lamp fittings, LED bulb PC covers, downlights, spotlights, and aluminum substrates. It also exports its products to Germany, France, the United States, India, and other countries. The company was founded in 2001 and is headquartered in Haining, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Haining",
        "zipcode": "314411",
        "website": "http://www.cnlampholder.com",
        "full_time_employees": 1572
    },
    "603700.SS": {
        "short_name": "NINGBO WATER METER GROUP CO LTD",
        "long_name": "Ningbo Water Meter (Group) Co., LTD.",
        "summary": "Ningbo Water Meter (Group) Co., LTD. manufactures and sells water meters in China and internationally. The company offers multi and single-jet, volumetric rotary piston, woltmann, ultrasonic, AWWA standard, and batch control water meters; heat, oscillating, pre-payment, and electronic magnetic flow meters; test bench products; and water meter boxes, as well as spare parts for water meters. It also provides water management solutions for domestic, industrial, and irrigative uses. The company was founded in 1958 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315032",
        "website": "http://www.nwmwatermeters.com",
        "full_time_employees": 1190
    },
    "603829.SS": {
        "short_name": "JIANGSU LUOKAI MECHANICAL AND E",
        "long_name": "Jiangsu Luokai Mechanical &Electrical Co., Ltd.",
        "summary": "Jiangsu Luokai Mechanical & Electrical Co., Ltd. engages in the research, development, production, and sale of key apparatus on high and low voltage electrical distribution equipment in China. The company offers low and medium voltage mechanisms, cassettes, main shafts, and load switches; and electromagnets, auxiliary and transfer switches, auxiliary alarms, release products, motor operators, and mid voltage contact products. It also exports its products to the United States, France, Italy, Holland, India, and other countries. The company was founded in 1970 and is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": "213104",
        "website": "http://www.lk-jd.com",
        "full_time_employees": 965
    },
    "603855.SS": {
        "short_name": "WAROM TECHNOLOGY INCORPORATED C",
        "long_name": "Warom Technology Incorporated Company",
        "summary": "Warom Technology Incorporated Company manufactures and supplies explosion proof lighting fixtures and electrical apparatus in China. The company provides light fittings for fluorescent lamps; LED light fittings; pendant light fittings; floodlights; street lamps/ballasts/hand lamps; and spotlight fittings, as well as installation equipment, such as installation switches, junction boxes, terminal boxes, and plugs and sockets. It also offers control equipment, including position switches, control stations, components for control stations, control unit systems; motor starters and switches; distribution boxes, components for distribution boxes, and empty enclosures; cable glands and bushings, such as accessories for installation, flexible conduits, cable glands, and accessories; and air conditioners, pressurized products, and engineering cabins. In addition, the company provides weatherproof products, such as weatherproof light fittings, office light fittings, street lamps and plaza lights, weatherproof electrical appliances, and weatherproof pipe fittings. Its products are used in various industries, such as oil and gas, chemical, aerospace, coal, electric power, railway, metallurgy, marine, security, fire protection, irrigation, city planning, telecom, mining, offshore, and diving rescue. The company offers its products through a network of agents and distributors in approximately 50 countries comprising Russia, Spain, Turkey, South Africa, Dubai, Vietnam, Thailand, Brazil, and internationally. Warom Technology Incorporated Company was founded in 1987 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201808",
        "website": "http://www.waromgroup.com",
        "full_time_employees": 2026
    },
    "603859.SS": {
        "short_name": "NANCAL TECHNOLOGY CO LTD",
        "long_name": "Nancal Technology Co.,Ltd",
        "summary": "Nancal Technology Co.,Ltd provides smart manufacturing and smart electrical technology products in China. The company offers medium voltage AC drives, low voltage industrial AC drives, medium voltage soft starters, and shore power products; and Power Quality Products, such as active power filters, hybrid static var generators, static var generators, and smart power quality correct devices. It serves air defense, oil and gas, metallurgy, marine and port, mining, power, rail traffic, cement, and other industries. The company was founded in 2006 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100193",
        "website": "http://www.nancal.com",
        "full_time_employees": 849
    },
    "603897.SS": {
        "short_name": "ZHEJIANG GRANDWALL ELECTRIC SCI",
        "long_name": "Zhejiang grandwall electric science&technology co.,ltd.",
        "summary": "Zhejiang Grandwall Electric Science&Technology Co.,Ltd. develops, produces, and sells electromagnetic wire products in China and internationally. Its products are used in various industries, including new energy power generation, automotive drive motors, household appliances, industrial motors, automotive motors, power tools, instrumentation and lighting appliances, and others. The company is headquartered in Huzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huzhou",
        "zipcode": "313013",
        "website": "http://www.grandwall.com.cn",
        "full_time_employees": 818
    },
    "605222.SS": {
        "short_name": "SHANGHAI QIFAN CABLE CO LTD",
        "long_name": "Shanghai QiFan Cable Co., Ltd",
        "summary": "Shanghai QiFan Cable Co., Ltd manufactures and sells wires and cables worldwide. The company also offers low, medium, and extra high voltage power cables; control cables; instrumentation cables; building wires; flexible rubber cables; fire rated cables; renewable cables; industrial and LAN cables; and coaxial cables, etc. The company also exports its products. The company was founded in 1994 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.qifancable.com",
        "full_time_employees": 3048
    },
    "605277.SS": {
        "short_name": "XINYA ELECTRONIC CO LTD",
        "long_name": "Xinya Electronic Co., Ltd.",
        "summary": "Xinya Electronic Co., Ltd. manufactures and sells wires and cables in China and internationally. It offers PVC wires, halogen free wires, power cord cables, teflon wires, automotive wires, flat cables, solar cables, medical cables, industrial cables, robot cables, etc. The company's products are used in the area of household appliances, telecommunication, automotive, medical, OA system, industrial control system, and other new energy industry. Xinya Electronic Co., Ltd. was founded in 1992 and is headquartered in Yueqing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yueqing",
        "zipcode": "325603",
        "website": "http://www.xinya-cn.com",
        "full_time_employees": 685
    },
    "605288.SS": {
        "short_name": "CHANGZHOU KAIDI ELECTRICAL INC",
        "long_name": "Changzhou Kaidi Electrical Inc.",
        "summary": "Changzhou Kaidi Electrical Co.,Ltd. researches, develops, manufactures, and sells linear drive systems in China and internationally. Its principal products include linear drive system products consisting of electric actuators, hand controllers, electrical boxes, and other supporting parts. Its products are primarily used in smart homes, smart offices, medical care, automobiles, and other fields. The company was founded in 1992 and is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": "213161",
        "website": "http://www.czkaidi.cn",
        "full_time_employees": 2622
    },
    "688006.SS": {
        "short_name": "ZHEJIANG HANGKE TECHNOLOGY INCO",
        "long_name": "Zhejiang HangKe Technology Incorporated Company",
        "summary": "Zhejiang Hangke Technologies Co., Ltd. engages in the research and development, manufacturing, and marketing of Li-battery test equipment. It offers consumption type Li-battery formation test equipment, power Li-battery formation and test equipment, high-end traction battery post-processing systems, and column type Li-battery formation test equipment. The company was founded in 1948 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311215",
        "website": "http://www.chr-group.net",
        "full_time_employees": 1819
    },
    "688077.SS": {
        "short_name": "EARTH-PANDA ADVANCED MAGNETIC M",
        "long_name": "Earth-Panda Advanced Magnetic Material Co.,Ltd.",
        "summary": "Earth-Panda Advance Magnetic Material Co., Ltd. engages in the production and operation of rare-earth permanent magnetic materials. It offers sintered NdFeB, bonded NdFeB, rubber, and SmCo magnets. Its products are used in various applications in information technology, national defense, automobile, wind power, various electric motors, instruments, medical and magnetic machinery, and other sectors in Europe, the Americas, and Southeast Asia. The company is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": null,
        "website": "http://earth-panda.com",
        "full_time_employees": 1232
    },
    "688128.SS": {
        "short_name": "CHINA NATIONAL ELECTRIC APPARAT",
        "long_name": "China National Electric Apparatus Research Institute Co., Ltd.",
        "summary": "China National Electric Apparatus Research Institute Co., Ltd. operates as a science and technology company that specializes in the scientific research and development, science and technology service, and science and technological industry development activities. It offers science and technology services in the areas of energy, materials, engineering, intelligence, evaluation, and environment. The company also provides testing and evaluation services for household appliances, electrical accessories, lighting products, toys and children's products, motor vehicles and related components, batteries, materials, compressors, electrical machines, electric welding machines, internal combustion engines, and others. In addition, it offers excitation devices, high power supplies, battery and equipment test products, and household appliances and related components, as well as fine chemical and electrical insulation materials, such as polyester resins, powder coatings, and oil paints. Further, it provides equipment testing and technical services for household appliances plants; coating production line services by powder and paint; plating, processing production line by electroplate, and aluminum oxidation coloring surfaces; and waste water and waste gas processing equipment. Additionally, the company offers industrial products, including energy equipment, test equipment, production line, surface preparation, and chemical painting products. The company was founded in 1958 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510300",
        "website": "http://www.cei1958.com",
        "full_time_employees": 2513
    },
    "688680.SS": {
        "short_name": "SHANGHAI HIUV NEW MATERIALS CO ",
        "long_name": "Shanghai HIUV New Materials Co.,Ltd",
        "summary": "Shanghai HIUV New Materials Co.,Ltd engages in the research and development, manufacture, and sale of film materials and products in China. It provides ethylene-vinyl acetate copolymer, electronic industry, and medical films, as well as POE and PVDF films. The company also offers technical support and solutions for customers in various fields. Its products are used primarily by power generation group and first-line PV module manufacturers. The company was founded in 2005 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.hiuv.net",
        "full_time_employees": 565
    },
    "6908.HK": {
        "short_name": "HONGGUANG LIGHT",
        "long_name": "HongGuang Lighting Holdings Company Limited",
        "summary": "HongGuang Lighting Holdings Company Limited, an investment holding company, designs, develops, manufactures, and sells light-emitting diode (LED) beads and LED lighting products in the People's Republic of China. It offers candle, flood, bulb, spot, down, oyster, and panel lights, as well as tube and torch. The company also provides subcontracting services. It serves manufacturers of backlight LED modules/panels, LCD panels, and other electronic products, as well as a trading company. The company was founded in 2010 and is headquartered in Zhuhai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": null,
        "website": "http://www.lighting-hg.com",
        "full_time_employees": 143
    },
    "8623.HK": {
        "short_name": "CHINA SAFTOWER",
        "long_name": "China Saftower International Holding Group Limited",
        "summary": "China Saftower International Holding Group Limited manufactures and sells wires and cables in the People's Republic of China. The company offers copper and aluminium wires and cables for electrical equipment, steel reinforced aluminium bare cables, bare copper wires, and aluminium rods. It also engages in trading aluminum products, such as aluminum strips and ingots; and selling cable accessories. The company serves power companies, manufacturing enterprises, construction and renovation companies, and trading companies, as well as walk-in customers. China Saftower International Holding Group Limited was founded in 2004 and is headquartered in Chengdu, China. China Saftower International Holding Group Limited operates as a subsidiary of Red Fly Investments Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "611730",
        "website": "http://www.saftower.cn",
        "full_time_employees": 212
    },
    "9S9.F": {
        "short_name": "SUN.KING TECHN.REGS HD-10",
        "long_name": "Sun.King Technology Group Limited",
        "summary": "Sun.King Technology Group Limited, an investment holding company, manufactures and trades in power electronic components for use in power transmission and distribution, electrified transportation, industrial, and other sectors in the People's Republic of China. It also engages in the research, development, production, sale, installation, and after sale service of electrical/electronic components, including integrated gate bipolar transistors; and production of electrical capacitors and its devices, amorphous alloy transformers, DC current anode saturable dry-type reactors, and FM voltage AC traction devices. In addition, the company manufactures and sells pulsed power equipment, insulated gate bipolar transistor gate units, and other electronic parts. Further, it engages in the technology research of electronic power device railway equipment; distribution and sale of power electronic components; import and export of goods and technologies; and trading of various products and technologies. The company was formerly known as Sun.King Power Electronics Group Limited and changed its name to Sun.King Technology Group Limited in November 2020. Sun.King Technology Group Limited was founded in 2002 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101318",
        "website": "http://www.sunking-tech.com",
        "full_time_employees": 620
    },
    "B6JA.F": {
        "short_name": "CBAK ENERGY TECH. NEW",
        "long_name": "CBAK Energy Technology, Inc.",
        "summary": "CBAK Energy Technology, Inc., together with its subsidiaries, develops, manufactures, and sells lithium batteries in Mainland China, the United States, Israel, and internationally. Its products are used in various applications, including electric vehicles, such as electric cars, electric buses, and hybrid electric cars and buses; light electric vehicles that include electric bicycles, electric motors, and sight-seeing cars; and electric tools, energy storage, uninterruptible power supply, and other high power applications, as well as cordless power tools. The company was formerly known as China BAK Battery, Inc. and changed its name to CBAK Energy Technology, Inc. in January 2017. CBAK Energy Technology, Inc. was incorporated in 1999 and is based in Dalian, China.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116450",
        "website": "http://www.cbak.com.cn",
        "full_time_employees": 537
    },
    "CBAT": {
        "short_name": "CBAK Energy Technology, Inc.",
        "long_name": "CBAK Energy Technology, Inc.",
        "summary": "CBAK Energy Technology, Inc., together with its subsidiaries, develops, manufactures, and sells lithium batteries in Mainland China, the United States, Israel, and internationally. Its products are used in various applications, including electric vehicles, such as electric cars, electric buses, and hybrid electric cars and buses; light electric vehicles that include electric bicycles, electric motors, and sight-seeing cars; and electric tools, energy storage, uninterruptible power supply, and other high power applications, as well as cordless power tools. The company was formerly known as China BAK Battery, Inc. and changed its name to CBAK Energy Technology, Inc. in January 2017. CBAK Energy Technology, Inc. was incorporated in 1999 and is based in Dalian, China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116450",
        "website": "http://www.cbak.com.cn",
        "full_time_employees": 537
    },
    "DFEL": {
        "short_name": "CHINA TMK BATTERY SYS INC",
        "long_name": "China TMK Battery Systems Inc.",
        "summary": "China TMK Battery Systems Inc. provides nickel-metal hydride cell rechargeable batteries in the People's Republic of China and internationally. It offers batteries for use in vacuum cleaners and wireless home appliances, power tools, medical devices, electric bicycles, and battery-operated toys, as well as portable consumer electronics products, such as digital cameras and portable gaming systems, cordless phones, and solar light products. The company sells its products to brand owners and pack manufacturers. China TMK Battery Systems Inc. was founded in 1999 and is based in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518109",
        "website": null,
        "full_time_employees": 30
    },
    "HOLI": {
        "short_name": "Hollysys Automation Technologie",
        "long_name": "Hollysys Automation Technologies Ltd.",
        "summary": "Hollysys Automation Technologies Ltd. provides automation solutions in the People's Republic of China, Southeast Asia, India, and the Middle East. The company offers a suite of industrial automation systems, including third-party hardware-centric products, such as instrumentation and actuators; proprietary software-centric distributed control systems/programmable logic controllers; and valued-added software packages comprising real-time management information system, HolliAS asset management system, operator training system, HolliAS batch application package, HolliAS advanced process control package, and safety instrumentation system, as well as HOLLiAS MACS-N DCS, a proprietary nuclear power non-safety automation and control system. It also provides train control center that monitors route condition, track status, train schedules, distance between trains, and the working status of other function devices, as well as generates control instructions and commands. In addition, the company offers automation train protection that operates as a train over-speed protection mechanism; and supervisory control and data acquisition system, an open software platform. Further, it offers research and development services; and provides integrated automation systems and services, mechanical and electrical solution services, and installation services. The company serves customers in the industrial, railway, subway, nuclear power, and mechanical and electronic industries. The company was formerly known as HLS Systems International Ltd. and changed its name to Hollysys Automation Technologies Ltd. in July 2009. Hollysys Automation Technologies Ltd. was founded in 1993 and is headquartered in Beijing, the People's Republic China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100176",
        "website": "http://www.hollysys.com",
        "full_time_employees": 3598
    },
    "ITE.F": {
        "short_name": "CN TIT.EN.TECH.GR. HD-,01",
        "long_name": "China Titans Energy Technology Group Co., Limited",
        "summary": "China Titans Energy Technology Group Co., Limited, an investment holding company, engages in the research, development, manufacture, and sale of power electric products and equipment in the People's Republic of China. The company operates through DC Power System, Charging Equipment, Charging Services and Construction, and Others segments. It offers power supply products, including GZDW high frequency switch DC power supply systems, intelligent LV AC power supply distribution systems, integration power supply systems, and test power supply systems. The company also provides EV charging products comprising AC EV charging poles, binning chargers, charging modulars, and battery maintenance and management systems; and storage power and microgrid products consisting of PV converters, energy storage chargers and dischargers, TPCS converters, controllers, and software products. In addition, it offers wind and solar power generation balancing control and other products, charging equipment for electrical vehicles, power grid monitoring and management products, and electrical direct current products; sells and leases electric vehicles; and provides charging services for electric vehicles, as well as construction services of charging poles for electric vehicles. The company was founded in 1992 and is headquartered in Zhuhai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": "519015",
        "website": "http://www.titans.com.cn",
        "full_time_employees": 410
    },
    "XTEG": {
        "short_name": "XT ENERGY GROUP INC",
        "long_name": "XT Energy Group, Inc.",
        "summary": "XT Energy Group, Inc. engages in the compressed air energy storage field primarily in China. It offers air compression power generation systems with a photovoltaic (PV) installation for industrial users, such as factories and power plants; and PV systems without the air compression generation technology. The company also provides air source heat pump systems that transfers heat from outside to inside of a building, or vice versa; PV panels; synthetic fuel and related products, including fuel additives, engine lubricants, and engine cleaners; and hydraulic parts comprising hydraulic cylinders, diesel pumps, motor oil pumps, and hydraulic valves, as well as designs and manufactures hydraulic pump stations, cylinders, and high-pressure valves. In addition, it is involved in the production and sale of wine and herbal wine products. The company was formerly known as Xiangtian (USA) Air Power Co., Ltd. and changed its name to XT Energy Group, Inc. in November 2018. XT Energy Group, Inc. was founded in 2008 and is headquartered in Xianning, China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Xianning",
        "zipcode": "437012",
        "website": null,
        "full_time_employees": 418
    }
}