{
  "000157.SZ": {
    "city": "Changsha",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Zoomlion Heavy Industry Science and Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "ZOOMLION HVY IND S",
    "state": null,
    "summary": "Zoomlion Heavy Industry Science and Technology Co., Ltd., together with its subsidiaries, engages in the research, development, manufacture, and sale of construction and agricultural machinery in the People's Republic of China and internationally. The company operates through Construction Machinery, Agricultural Machinery, and Financial Services segments. It offers concrete machineries, including truck and trailer mounted concrete pumps, dry mortar products, concrete placing booms, concrete mixing plants, truck-mounted concrete mixers, truck-mounted line concrete pumps, and self-propelled boom concrete pumps; and truck, all-terrain truck, and crawler cranes, as well as various tower cranes. The company also provides road construction and pile foundation machineries, earth working machineries, material handling machineries and systems, specialized vehicles, and vehicle axles; road building and maintenance machineries; hoisting machineries; and forklift trucks and other products for infrastructure and real estate construction. In addition, it offers various agricultural machineries, such as tractors, grain harvesters, and drying machines. Further, it provides finance leasing, commercial factoring, and bond issuance services. Additionally, the company leases and trades in equipment and machineries; researches and manufactures machine software; manages tourism resource; and offers hydraulic products. The company was formerly known as Changsha Zoomlion Heavy Industry Science and Technology Development Co., Ltd. and changed its name to Zoomlion Heavy Industry Science and Technology Co., Ltd. in October 2011. Zoomlion Heavy Industry Science and Technology Co., Ltd. was founded in 1992 and is based in Changsha, the People's Republic of China.",
    "website": "http://www.zoomlion.com",
    "zipcode": "410013"
  },
  "000425.SZ": {
    "city": "Xuzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "XCMG Construction Machinery Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "XCMG CONSTRUCTION",
    "state": null,
    "summary": "XCMG Construction Machinery Co., Ltd. engages in the research and development, manufacturing, and sale of construction machinery in China. It provides subsurface excavation bogies, bridge construction equipment, dredgers, and drills; hoisting, road, concrete, pilling, firefighting, sanitation, mining, trenchless, boring, and other construction machineries; and loaders, excavators, heavy-duty and forklift trucks, and aerial working equipment. The company also exports its products. The company has a strategic cooperation agreement with Cummins Inc. to develop digital and networked technologies and applications. XCMG Construction Machinery Co., Ltd. was founded in 1993 and is based in Xuzhou, China.",
    "website": "http://www.xcmg.com",
    "zipcode": "221004"
  },
  "000528.SZ": {
    "city": "Liuzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Guangxi Liugong Machinery Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "GUANGXI LIUGONG MA",
    "state": null,
    "summary": "Guangxi Liugong Machinery Co., Ltd. manufactures and sells construction machinery. The company offers excavators, wheel loaders, skid steer loaders, backhoe loaders, dozers, motor graders, rollers, pavers, cold planers, cranes, mining trucks, crushers, drilling rigs, diaphragm wall rigs, trench cutters, and material handling equipment, as well as parts and maintenance services. It serves agriculture, demolition, forestry, general construction, landscaping, material handling, mining, oil and gas, port, quarry and aggregate, road construction, and utility industries. The company was founded in 1958 and is headquartered in Liuzhou, China.",
    "website": "http://www.liugong.com",
    "zipcode": "545007"
  },
  "000680.SZ": {
    "city": "Jining",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Shantui Construction Machinery Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "SHANTUI CONSTRUCTI",
    "state": null,
    "summary": "Shantui Construction Machinery Co., Ltd. researches and develops, produces, and sells engine products and components of earth moving, pavement construction and compaction, building, hoisting, and other construction machinery products in China and internationally. The company offers bulldozers, excavators, road machinery, wheel loaders, and concrete machinery, as well as fire vehicles, aerial platform vehicles, and cranes. It also provides construction machinery spare parts comprising chassis parts, drive parts, structural parts, casting parts, and hydraulic oil cylinders; and after-sales and technical services. Shantui Construction Machinery Co., Ltd. was founded in 1980 and is headquartered in Jining, China.",
    "website": "http://www.shantui.com",
    "zipcode": "272073"
  },
  "000816.SZ": {
    "city": "Yancheng",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Jiangsu Nonghua Intelligent Agriculture Technology Co.ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "JIANGSU NONGHUA IN",
    "state": null,
    "summary": "Jiangsu Nonghua Intelligent Agriculture Technology Co.ltd, a power equipment company, researches, develops, produces, and sells agricultural machinery. The company's agricultural machinery includes full feed harvesters, rice transplanters, and wheel tractors. It also provides single-cylinder diesel engines; multi-cylinder diesel engines, such as two, three, and four cylinder diesel engines; precision castings; and gasoline engine and multifunctional garden machineries, as well as various parts and components. In addition, the company offers forestry equipment comprising lawn mowers and washing machines; and pump units and generator sets. It sells its products to approximately 70 countries and regions worldwide. The company was formerly known as Jiangsu Jianghuai Engine Co., Ltd. and changed its name to Jiangsu Nonghua Intelligent Agriculture Technology Co.ltd in June 2015. The company is based in Yancheng, China.",
    "website": "http://www.jd.dongyin.com",
    "zipcode": "224003"
  },
  "000923.SZ": {
    "city": "Zhangjiakou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "HBIS Resources Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "HBIS RESOURCES CO",
    "state": null,
    "summary": "HBIS Resources Co., Ltd. manufactures and sells a range of bulldozers in China. It also offers wheel loaders, rollers, excavators, pipe layers, etc. The company also exports its products to approximately 90 countries and regions. The company was formerly known as XuanHua Construction Machinery Co.,Ltd. and changed its name to HBIS Resources Co., Ltd. in December 2019. HBIS Resources Co., Ltd. was founded in 1950 and is based in Zhangjiakou, China.",
    "website": "http://www.hbxg.com",
    "zipcode": "075105"
  },
  "000951.SZ": {
    "city": "Jinan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Sinotruk Jinan Truck Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "CNHTC JINAN TRUCK",
    "state": null,
    "summary": "Sinotruk Jinan Truck Co., Ltd. manufactures and sells heavy-duty trucks, special vehicles, heavy-duty special vehicle chassis, passenger car chassis, and auto parts in China and internationally. The company was formerly known as CNHTC Jinan Truck Co., Ltd. Sinotruk Jinan Truck Co., Ltd. was founded in 2003 and is based in Jinan, China. Sinotruk Jinan Truck Co., Ltd. is a subsidiary of Sinotruck (Hong Kong) Limited.",
    "website": "http://www.sinotruk.com",
    "zipcode": "250116"
  },
  "002097.SZ": {
    "city": "Changsha",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Sunward Intelligent Equipment Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "SUNWARD INTELLIGEN",
    "state": null,
    "summary": "Sunward Intelligent Equipment Co., Ltd. manufactures and sells construction and engineering machineries worldwide. The company offers excavators, including mini, small, medium, and large excavators; rotary drilling rigs, multi-function rigs with dual power head, and hydraulic static pile drivers; and down-the-hole drills, cutting drill rigs, full hydraulic open-pit drills, hydraulic rock drills, augered pile rigs, and full hydraulic driving drills. It also provides telescopic crawler cranes and rough terrain wheel cranes; wheeled and crawler skid steer loaders; and military and aviation equipment. The company was formerly known as Hunan Sunward Intelligent Machinery Co., Ltd. and changed its name to Sunward Intelligent Equipment Co., Ltd. in 2011. Sunward Intelligent Equipment Co., Ltd. was founded in 1999 and is headquartered in Changsha, China.",
    "website": "http://www.sunward.com.cn",
    "zipcode": "410100"
  },
  "002111.SZ": {
    "city": "Weihai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Weihai Guangtai Airport Equipment Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "WEIHAI GUANGTAI AI",
    "state": null,
    "summary": "Weihai Guangtai Airport Equipment Co.,Ltd manufactures and sells ground support equipment and fire-fighting equipment in China and internationally. The ground support equipment segment offers aircraft service, ground handling, air cargo, runway maintenance, aircraft refueling, and passenger cabin service to airline companies, airports, aircraft manufacturing companies, and flight test institutes. The fire-fighting equipment segment provides fire-fighting vehicles, aerial platform, aerial ladder, water tanker, and emergency rescue products; and automatic fire alarm system, large space fire monitor system, electrical fire monitoring system, intelligent emergency lighting and evacuation indicating system, special detectors, and S-type aerosol. It also offers special vehicle and industrial drone; and after-sale services. The company was founded in 1991 and is based in Weihai, China.",
    "website": "http://www.guangtai.com.cn",
    "zipcode": "264200"
  },
  "002480.SZ": {
    "city": "Chengdu",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Chengdu Xinzhu Road&Bridge Machinery Co.,LTD",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "CHENGDU XINZHU ROA",
    "state": null,
    "summary": "Chengdu Xinzhu Road&Bridge Machinery Co.,LTD provides system integration products and services to the public transportation and civil construction fields. The company offers rail transit systems; energy vehicles, including electric fast-charging city buses and logistics vehicles; and bridge functional components, such as bridge bearings, bridge expansion devices, pre-stressed anchors, and other products. It also provides traffic environment governance products comprising metal and non-metallic sound barriers, transparent sound insulation boards, wind barriers, light barriers, and other products; and solutions for land traffic safety operations and management of geological disasters. The company also exports its bridge functional components to Europe, Asia, Africa, and the Middle East. Chengdu Xinzhu Road&Bridge Machinery Co.,LTD was founded in 2001 and is headquartered in Chengdu, China.",
    "website": "http://www.xinzhu.com",
    "zipcode": "611430"
  },
  "002523.SZ": {
    "city": "Zhuzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Zhuzhou Tianqiao Crane Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "ZHUZHOU TIANQIAO C",
    "state": null,
    "summary": "Zhuzhou Tianqiao Crane Co., Ltd. manufactures and supplies various special use cranes for steel, aluminum smelting, power, nuclear, and other industries in China and internationally. The company primarily offers transfer gantry systems, pot tending machines, baking furnace tending machines, beam lifting machines, bridge erecting machines, casting cranes, electric magnetic cranes, gantry cranes, portal harbor cranes, slab clamping cranes, EOT cranes, and other products, as well as special purposed cranes for copper and lead melting. It also provides technical assistance, erection and commissioning, training, and availability confirmation services, as well as refurbishment, retrofit, and upgradation services; and supplies and stores spare parts. The company was founded in 1958 and is based in Zhuzhou, China.",
    "website": "http://www.tqcc.cn",
    "zipcode": "412001"
  },
  "002532.SZ": {
    "city": "Shihezi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Tianshan Aluminum Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "TIANSHAN ALUMINUM",
    "state": null,
    "summary": "Tianshan Aluminum Group Co., Ltd. engages in the production and sale of aluminum deep-processed products and materials, prebaked anodes, high-purity aluminum, and alumina. It sells self-produced and purchased aluminum ingots that are used as raw materials for downstream aluminum processing; aluminum sheets and foils; and aluminum alloy materials for use in production and manufacturing applications. The company was founded in 2010 and is based in Shihezi, China.",
    "website": "http://www.xjtslygf.com",
    "zipcode": "832014"
  },
  "002667.SZ": {
    "city": "Anshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Anshan Heavy Duty Mining Machinery Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "ANSHAN HEAVY DUTY",
    "state": null,
    "summary": "Anshan Heavy Duty Mining Machinery Co., Ltd. operates in the vibrating screen industry in China and internationally. The company manufactures and sells vibrating screens and feeders, crushers, asphalt and stabilized soil mixing plants, crushing and screening systems, garbage sorting and disposal systems, construction industrialization systems, and dry tailing systems, as well as equipment for manufacturing precast concrete components. The company was founded in 1994 and is based in Anshan, China.",
    "website": "http://www.anheavy.com",
    "zipcode": "114051"
  },
  "002685.SZ": {
    "city": "Wuxi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Wuxi Huadong Heavy Machinery Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "WUXI HUADONG HEAVY",
    "state": null,
    "summary": "Wuxi Huadong Heavy Machinery Co., Ltd. researches, develops, manufactures, markets, and installs container handling equipment in the People's Republic of China. The company offers ship-to-shore container cranes, rail-mounted container gantry cranes, rubber-tired container gantry cranes, general gantry cranes, portal cranes, and other cranes for use in the port container handling operations, railway container handling operations, container yard storage, trailer handling operations, forklift handling operations, etc. It also researches, develops, manufactures, markets, and services automated and intelligent precision processing equipment; and processes and trades in stainless steel products. Wuxi Huadong Heavy Machinery Co., Ltd. was founded in 2004 and is based in Wuxi, the People's Republic of China.",
    "website": "http://www.hdhm.com",
    "zipcode": "214131"
  },
  "002691.SZ": {
    "city": "Shijiazhuang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Jikai Equipment Manufacturing Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "JIKAI EQUIPMENT MA",
    "state": null,
    "summary": "Jikai Equipment Manufacturing Co., Ltd. develops, manufactures, distributes, and services underground mining machinery in China. The company provides specialized solutions in underground mining industry for tunneling, tunnel supporting, transportation, etc. Its products include transport machinery, such as heavy duty scraper conveyors, durable alloy whole founded AFC pans, man transporters, reducers for coal mine scraper conveyors, and diesel crawler carriers; and mining and tunneling machinery accessory tools, including road headers and shearers, as well as picks for use in coal shearers and road headers. The company also offers safety drill machines comprising deep hole hydraulic jumbos, hydraulic drilling rigs, hydraulic coal mine tunnel drilling machines, coal mine pneumatic deep hole drilling jumbos, pneumatic bracket drilling rigs and machines, and slurry pumps. In addition, it provides supporting equipment and tools consisting of pneumatic and hydraulic series products, hydraulic props, and tensioning and auxiliary equipment. Jikai Equipment Manufacturing Co., Ltd. is based in Shijiazhuang, China.",
    "website": "http://www.sjzzm.com",
    "zipcode": "050035"
  },
  "002890.SZ": {
    "city": "Laizhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Shandong Hongyu Agricultural Machinery Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "SHANDONG HONGYU AG",
    "state": null,
    "summary": "Shandong Hongyu Agricultural Machinery Co., Ltd. engages in the research and development, manufacture, sale, service, and integration of agricultural machinery parts and components in China. The company offers downforce type with separated control value products; no-feedback type with simple control value products; separated oil type and common oil type position and draft controls; common oil type composite controls; and distributors and cylinders. It also sells its products in approximately 30 countries and regions internationally. The company is based in Laizhou, China.",
    "website": "http://en.sdhynj.net",
    "zipcode": null
  },
  "0038.HK": {
    "city": "Luoyang",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "First Tractor Company Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "FIRST TRACTOR",
    "state": null,
    "summary": "First Tractor Company Limited engages in the research and development, manufacture, and sale of agricultural and power machinery, and related spare parts worldwide. It operates through three divisions: Agricultural Machinery, Power Machinery, and Finance. The company offers wheeled and crawler tractors, and its components, such as castings, gears, gear boxes, and covers; and off-road diesel engines, as well as accessory parts, including fuel injection pumps and fuel injectors. It also engages in fund settlement, fund raising, financing, and other financial activities; and the processing and sale of rough and semi-finished, and finished products of castings and forging products. In addition, the company accepts deposits; and provides loans, finance lease, bill acceptance and discounting, entrusting loans, and investments to member companies, as well as equity and portfolio investment in financial institutions as approved; and consumer credit service, buyer's credit, and finance lease for products of member companies and inter-bank borrowing and lending. First Tractor Company Limited markets its products to approximately 140 countries and regions. The company was formerly known as First Tractor Works of China. The company was founded in 1955 and is based in Luoyang, China.",
    "website": "http://www.first-tractor.com.cn",
    "zipcode": "471004"
  },
  "0631.HK": {
    "city": "Shenyang",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Sany Heavy Equipment International Holdings Company Limited",
    "market": "hk_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "SANY INT'L",
    "state": null,
    "summary": "Sany Heavy Equipment International Holdings Company Limited, an investment holding company, engages in the research, development, manufacture, and sale of integrated excavation machinery, integrated coal mining equipment, and coal mine transportation equipment. It operates in two segments, Mining Equipment and Logistics Equipment. The Mining Equipment segment provides coal mining machinery products, including roadheaders, such as soft rock and hard rock roadheaders, integrated excavation, bolting, and self-protection machinery; mining equipment consisting of coal mining machines (shearer), hydraulic support system, scraper conveyors (armored-face conveyer), etc.; non-coal mining machinery products comprising tunnel roadheaders and mining machines; mining transport equipment, including mechanical drive off-highway and electric drive off-highway dump trucks, widebody vehicles, and other relevant products; spare parts; robotic products, such as robotic system integration, mobile robots, and electric forklifts; and smart mine products, including unmanned driving, automated integrated mining, and smart mine operation systems. The Logistic Equipment segment offers container equipment, such as front loaders, stacking machines and quayside gantry cranes, etc.; bulk material equipment, which comprise grippers, elevated hoisting arms, etc.; and general equipment, including heavy-weight forklifts, telehandlers, etc. In addition, the company provides maintenance and property development services. It operates in Mainland China, rest of Asia, the European Union, the United States, and internationally. The company was founded in 2004 and is headquartered in Shenyang, the People's Republic of China. Sany Heavy Equipment International Holdings Company Limited is a subsidiary of Sany Hongkong Group Limited.",
    "website": "http://www.sanyhe.com",
    "zipcode": "111117"
  },
  "0840.HK": {
    "city": "Shihezi",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Xinjiang Tianye Water Saving Irrigation System Company Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "TIANYE WATER",
    "state": null,
    "summary": "Xinjiang Tianye Water Saving Irrigation System Company Limited designs, manufactures, and sells drip tapes, PVC/PE pipelines, and drip assemblies for use in water saving irrigation systems in the People's Republic of China. It also offers installation services for water saving irrigation systems. In addition, the company engages in land circulation and engineering business; and strategic developing digital agriculture and agriculture service business. The company was founded in 1999 and is headquartered in Shihezi, the People's Republic of China.",
    "website": "http://www.tianyejieshui.com.cn",
    "zipcode": null
  },
  "1122.HK": {
    "city": "Chongqing",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Qingling Motors Co., Ltd.",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "QINGLING MOTORS",
    "state": null,
    "summary": "Qingling Motors Co., Ltd., together with its subsidiaries, produces and sells Isuzu trucks in the People's Republic of China. The company offers light, medium, and heavy-duty trucks; pick-up trucks; and multi-purpose vehicles, as well as chassis and automobile parts, engines, accessories, and others. It is also involved in the production of moulds for the manufacture of automobile parts; and automobile retailing and after-sales services. Qingling Motors Co., Ltd. also exports its products. The company was founded in 1946 and is based in Chongqing, the People's Republic of China. Qingling Motors Co., Ltd. is a subsidiary of Qingling Motors (Group) Company Limited.",
    "website": "http://www.qingling.com.cn",
    "zipcode": "400052"
  },
  "1157.HK": {
    "city": "Changsha",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Zoomlion Heavy Industry Science and Technology Co., Ltd.",
    "market": "hk_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "ZOOMLION",
    "state": null,
    "summary": "Zoomlion Heavy Industry Science and Technology Co., Ltd., together with its subsidiaries, engages in the research, development, manufacture, and sale of construction and agricultural machinery in the People's Republic of China and internationally. The company operates through Construction Machinery, Agricultural Machinery, and Financial Services segments. It offers concrete machineries, including truck and trailer mounted concrete pumps, dry mortar products, concrete placing booms, concrete mixing plants, truck-mounted concrete mixers, truck-mounted line concrete pumps, and self-propelled boom concrete pumps; and truck, all-terrain truck, and crawler cranes, as well as various tower cranes. The company also provides road construction and pile foundation machineries, earth working machineries, material handling machineries and systems, specialized vehicles, and vehicle axles; road building and maintenance machineries; hoisting machineries; and forklift trucks and other products for infrastructure and real estate construction. In addition, it offers various agricultural machineries, such as tractors, grain harvesters, and drying machines. Further, it provides finance leasing, commercial factoring, and bond issuance services. Additionally, the company leases and trades in equipment and machineries; researches and manufactures machine software; manages tourism resource; and offers hydraulic products. The company was formerly known as Changsha Zoomlion Heavy Industry Science and Technology Development Co., Ltd. and changed its name to Zoomlion Heavy Industry Science and Technology Co., Ltd. in October 2011. Zoomlion Heavy Industry Science and Technology Co., Ltd. was founded in 1992 and is based in Changsha, the People's Republic of China.",
    "website": "http://www.zoomlion.com",
    "zipcode": "410013"
  },
  "1839.HK": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "CIMC Vehicles (Group) Co., Ltd.",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "CIMC VEHICLES",
    "state": null,
    "summary": "CIMC Vehicles (Group) Co., Ltd. engages in the design, manufacture, and sale of semi-trailers and truck bodies for specialty vehicles in China, North America, Europe, and internationally. The company offers container chassis, flatbed, side-wall, and stake trailers; curtain-side, van, and refrigerated trailers; liquid and dry bulk tank trailers; and center-axle car carriers and terminal trailers. It also provides truck bodies for urban dump trucks and fully-assembled vehicles of cement mixers. In addition, the company develops, produces, and sells various special vehicles, mechanical products, and metal structure parts, as well as passenger and tank transport vehicles; processes machines; and operates in the import and export business. Further, it engages sales of cars, auto parts, metal materials, hardware and electrical equipment, electromechanical equipment, and components; wholesale and retail of products; import and export of technologies and trade agency; and provision of information and trade consulting services. Additionally, the company leases logistics equipment and provides storage services. It markets and sells its products under the Tonghua, Huajun, SCVC SAILING, Ruijiang Vehicles, Lingyu Vehicles, and Liangshan Dongyue brands in China; and Vanguard, CIE, SDC, and LAG brands internationally. The company was formerly known as Shenzhen Tianda Heavy Industries Ltd. and changed its name to CIMC Vehicles (Group) Co., Ltd. in May 2005. The company was incorporated in 1996 and is headquartered in Shenzhen, the People's Republic of China. CIMC Vehicles (Group) Co., Ltd. is a subsidiary of China International Marine Containers (Group) Co., Ltd.",
    "website": "http://www.cimcvehiclesgroup.com",
    "zipcode": "518067"
  },
  "2153.HK": {
    "city": "Shanghai",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Tat Hong Equipment Service Co., Ltd.",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "TAT HONG EQUIP",
    "state": null,
    "summary": "Tat Hong Equipment Service Co., Ltd. provides tower crane services in the People's Republic of China. It offers consultation, technical design, commissioning, construction, and after-sales services to construction contractors in infrastructure, energy, commercial, and residential sectors. As of December 20, 2020, the company owned a fleet of 1,008 tower cranes. The company was founded in 2007 and is headquartered in Shanghai, China. Tat Hong Equipment Service Co., Ltd. is a subsidiary of Tat Hong Equipment (China) Pte. Ltd.",
    "website": "http://www.tathongchina.com",
    "zipcode": "200335"
  },
  "300022.SZ": {
    "city": "Chengdu",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Gifore Agricultural Science & Technology Service Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "GIFORE AGRICULTURA",
    "state": null,
    "summary": "Gifore Agricultural Science & Technology Service Co., Ltd. offers agricultural machines in Asia. It also operates a professional market platform for the promotion of agriculture, rural areas, and farmers, as well as a service platform for agricultural and agricultural resources. The company was formerly known as Gifore Agricultural Machinery Chain Co., Ltd. and changed its name to Gifore Agricultural Science & Technology Service Co., Ltd. in September 2018. Gifore Agricultural Science & Technology Service Co., Ltd. was founded in 1994 and is headquartered in Chengdu, China.",
    "website": "http://www.gifore.com",
    "zipcode": "611743"
  },
  "300103.SZ": {
    "city": "Xi'an",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Dagang Holding Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "DAGANG HOLDING GRO",
    "state": null,
    "summary": "Dagang Holding Group Co., Ltd. engages in the research and development, manufacture, sale, and servicing of road construction and maintenance machineries and equipment in China. The company offers pavement maintenance machines, including asphalt pavement maintenance trucks, pavement maintenance vehicles, binding agent spreaders, self-propelled road widening machines, ultrathin asphalt pavers, crack sealing machines, asphalt crack sealing and spraying machines, and asphalt pavement cold in-place recyclers. It also provides asphalt distributors; synchronous chip sealers; and self-propelled, lift-type, and pull-type chip spreaders. In addition, the company offers micro-surfacing/slurry seal trucks and fiber micro-surfacing/slurry seal trucks; and semi-trailer and truck mounted liquid asphalt tankers. Further, it provides asphalt material production equipment, such as asphalt emulsion, continuous rubber modified asphalt, emulsified asphalt, rubber modified asphalt, and multifunction asphalt modified equipment, as well as drummed asphalt melters. Additionally, the company undertakes general contracting of domestic and overseas projects. It also sells its products to approximately 50 countries comprising South Africa, Angola, Nigeria, Zambia, Russia, India, Brazil, and Portugal. The company was founded in 2002 and is based in Xi'an, China.",
    "website": "http://www.sxdagang.com",
    "zipcode": "710065"
  },
  "300276.SZ": {
    "city": "Huangshi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "SanFeng Intelligent Equipment Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "SANFENG INTELLIGEN",
    "state": null,
    "summary": "SanFeng Intelligent Equipment Group Co., Ltd. engages in the research, development, design, production, installation, commissioning, and service of conveying equipment in China. The company offers logistics conveying systems, including electric monorail and dualrail systems, P&F chains, friction drivers, skid conveying systems, AGV products, warehousing and logistic systems, AD pan material conveying systems, tumover machines, roller conveyor systems, lifters, off-gas discharging systems, and other products, as well as floor chain conveying systems comprising slate chains and towline products. It also provides environmental protecting and energy products, which include coating transmission line products; pre-treatment, electrophoresis, and spray and dusting equipment; oven and cooling products; auxiliary equipment, such as light inspection booth, shower test and blowing, and water treatment equipment; and electric control equipment. In addition, the company offers intelligent and precise weld, including welding jigs and reciprocating rod conveyors; and after-sale services. Its products are used in various industries, such as automotive, construction machinery, agricultural machinery, storage and logistics, light, food, metallurgy, building material, etc. SanFeng Intelligent Equipment Group Co., Ltd. was founded in 1999 and is based in Huangshi, China.",
    "website": "http://www.cnsanf.com",
    "zipcode": "435000"
  },
  "300818.SZ": {
    "city": "Shangrao",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Naipu Mining Machinery Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "JIANGXI NAIPU MINI",
    "state": null,
    "summary": "Naipu Mining Machinery Co., Ltd. develops, manufactures, distributes, and services mining equipment and spares in China and internationally. It offers slurry pumps and rubber wet ends, hydrocyclones, rubber mill liners and trommels, rubber stators and impellers for flotation machines, rubber and polyurethane screen panels and plates, steel and rubber composite pipes, and hard-wall mining hoses for use in the mine, metallurgy, iron and steel, and other industries. The company was formerly known as Jiangxi Naipu Mining Machinery and New Materials Co.,Ltd and changed its name to Naipu Mining Machinery Co., Ltd. in August 2020. Naipu Mining Machinery Co., Ltd. was founded in 2005 and is headquartered in Shangrao, China.",
    "website": "http://www.naipu.com.cn",
    "zipcode": "334100"
  },
  "300865.SZ": {
    "city": "Chengdu",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Chengdu Dahongli Machinery Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "CHENGDU DAHONGLI M",
    "state": null,
    "summary": "Chengdu Dahongli Machinery Co.,Ltd. manufactures and sells sand, gravel, and mining equipment in the People's Republic of China and internationally. It offers crushing, sieving, washing, and conveying equipment, as well as accessories for use in the areas of construction aggregates, mining, cement, and green crush. The company is headquartered in Chengdu, the People's Republic of China.",
    "website": "http://www.dhljqchina.com",
    "zipcode": null
  },
  "3339.HK": {
    "city": "Shanghai",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Lonking Holdings Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "LONKING",
    "state": null,
    "summary": "Lonking Holdings Limited, an investment holding company, manufactures and distributes wheel loaders, road rollers, excavators, forklifts, and other construction machinery in Mainland China. The company also provides hydraulic excavators and skid steer loaders; and diesel, electric, and LPG forklifts. In addition, it offers components, such as axles, gear boxes, cylinders, gears, castings, and high-end hydraulic pumps and valves; and main valves, parts, pilot oil valves, radial plunger motors, swing motors and reducer assemblies, and variable plunger pumps. Further, the company provides finance leasing for wheel loaders and other machinery. It also sells its products to approximately 40 countries in Mid and South America, Russia, Asia and Pacific area, Mid-East countries and Africa, etc. The company was founded in 1993 and is headquartered in Shanghai, the People's Republic of China.",
    "website": "http://www.lonking.cn",
    "zipcode": "201612"
  },
  "3808.HK": {
    "city": "Jinan",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Sinotruk (Hong Kong) Limited",
    "market": "hk_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "SINOTRUK",
    "state": null,
    "summary": "Sinotruk (Hong Kong) Limited, an investment holding company, engages in the research, development, manufacture, and sale of heavy duty trucks (HDTs), medium-heavy duty trucks, light duty trucks (LDTs), buses, and related parts and components in Mainland China and internationally. The company operates through four segments: Heavy Duty Trucks, Light Duty Trucks, Engines, and Finance. It offers specialty vehicles; pure electric power, hybrid power, hydrogen fuel, dual-source trolley, diesel, and natural gas buses; industrial and construction machinery engines; HDT and LDT engines; and HDT key parts and components, such as gearboxes and various types of casting and forging, as well as cabins, axles, and steel frames. The company also provides axle and transmission parts and truck refitting services; deposit taking, borrowings, commercial notes and bank bills discounting, auto and supply chain financing, and entrusted investment and customer credit services; and consultation and strategic planning services. In addition, it imports and exports trucks and spare parts; manufactures and reproduces engines; and researches, develops, manufactures, and sells commercial vehicles. Sinotruk (Hong Kong) Limited serves infrastructure, construction, container transportation, logistic, mining, steel, chemical, and other industries. The company was incorporated in 2007 and is headquartered in Jinan, China. Sinotruk (Hong Kong) Limited is a subsidiary of China National Heavy Duty Truck Group Company Limited.",
    "website": "http://www.sinotruk.com",
    "zipcode": "250101"
  },
  "4SK.F": {
    "city": "Jinan",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Sinotruk (Hong Kong) Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "SINOTRUK HONG KONG",
    "state": null,
    "summary": "Sinotruk (Hong Kong) Limited, an investment holding company, engages in the research, development, manufacture, and sale of heavy duty trucks (HDTs), medium-heavy duty trucks, light duty trucks (LDTs), buses, and related parts and components in Mainland China and internationally. The company operates through four segments: Heavy Duty Trucks, Light Duty Trucks, Engines, and Finance. It offers specialty vehicles; pure electric power, hybrid power, hydrogen fuel, dual-source trolley, diesel, and natural gas buses; industrial and construction machinery engines; HDT and LDT engines; and HDT key parts and components, such as gearboxes and various types of casting and forging, as well as cabins, axles, and steel frames. The company also provides axle and transmission parts and truck refitting services; deposit taking, borrowings, commercial notes and bank bills discounting, auto and supply chain financing, and entrusted investment and customer credit services; and consultation and strategic planning services. In addition, it imports and exports trucks and spare parts; manufactures and reproduces engines; and researches, develops, manufactures, and sells commercial vehicles. Sinotruk (Hong Kong) Limited serves infrastructure, construction, container transportation, logistic, mining, steel, chemical, and other industries. The company was incorporated in 2007 and is headquartered in Jinan, China. Sinotruk (Hong Kong) Limited is a subsidiary of China National Heavy Duty Truck Group Company Limited.",
    "website": "http://www.sinotruk.com",
    "zipcode": "250101"
  },
  "600031.SS": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Sany Heavy Industry Co., Ltd",
    "market": "cn_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "SANY HEAVY INDUSTRY CO",
    "state": null,
    "summary": "Sany Heavy Industry Co., Ltd. engages in the research and development, manufacture, and sale of concrete machinery, excavators, hoisting machinery, pile driving machinery, and road construction machinery worldwide. It offers truck mounted and stationary concrete pumps, concrete batching plants, asphalt batching plants, crawler cranes, truck cranes, rotary drilling rigs, compactors, pavers, graders, and other products, as well as services and parts. The company was founded in 1994 and is headquartered in Beijing, China.",
    "website": "http://www.sanyhi.com",
    "zipcode": "102206"
  },
  "600169.SS": {
    "city": "Taiyuan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Taiyuan Heavy Industry Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "TAIYUAN HEAVY INDUSTRY",
    "state": null,
    "summary": "Taiyuan Heavy Industry Co., Ltd. manufactures and sells heavy-duty machinery in China. It offers railway wheels, axles, gearboxes, wheelsets, and tunnel boring machines; mining shovels and hydraulic excavators, semi-mobile crushing stations, self-mobile crushing stations, spreaders, discharging cars, crawler transporters, and belt conveyors; heavy duty and special cranes, and dry quenching lifters; seamless steel pipe rolling, plate and strip rolling mill and finishing, plate correcting, and steel pipe welding equipment; and extrusion, forging hydraulic, punching hydraulic, and special hydraulic presses. The company also provides wind turbines; coke oven machinery; pressure vessels and related products; jack-up drilling platforms, lift-boats, wind-turbine installation vessels, hydraulic pile driving hammers, rock-embedded drilling machines, whole package of drilling equipment, jacking and locking systems, and single point mooring systems; gear transmission and other standard gearbox products; and steel castings and various kinds of forgings. In addition, it offers jib cranes, ship-to-shore container cranes, ship loaders, bridge type grab ship unloaders, rail mounted container gantry cranes, rubber tried container gantry cranes, goliath cranes, bucket wheel stacker-reclaimers, etc.; construction machinery, such as cranes; oil film bearings, chocks, and lubrication systems; and space launch towers, stage equipment, nuclear vessels, and electric control equipment. The company also exports its products to approximately 50 countries. Its products are used in the fields of metallurgy, mining, energy, transportation, offshore, aerospace, chemical, railway, shipbuilding, environmental protection, etc. The company was founded in 1950 and is headquartered in Taiyuan, China.",
    "website": "http://www.tyhi.com",
    "zipcode": "030024"
  },
  "600262.SS": {
    "city": "Baotou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Inner Mongolia North Hauler Joint Stock Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "INNER MONGOLIA NTH HAULER JOINT",
    "state": null,
    "summary": "Inner Mongolia North Hauler Joint Stock Co., Ltd. operates as a mining truck manufacturer in China and internationally. It offers mechanical drive, electric drive mining, articulated dump, explosion proof engineering coal mine dump, and dropside concrete trucks; and hydraulic excavators and rotary drilling rigs, as well as spare parts, including hydraulic cylinders. The company was formerly known as North Hauler Co., Ltd. and changed its name to Inner Mongolia North Hauler Joint Stock Co., Ltd. in July 2000. Inner Mongolia North Hauler Joint Stock Co., Ltd. was founded in 1988 and is based in Baotou, China.",
    "website": "http://www.chinanhl.com",
    "zipcode": "014030"
  },
  "600335.SS": {
    "city": "Tianjin",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Sinomach Automobile Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "SINOMACH AUTOMOBILE CO. LTD.",
    "state": null,
    "summary": "Sinomach Automobile Co., Ltd. provides automotive trade and retail services in China. It trades cars under the import brands comprising Chrysler, Volkswagen, GM, Ford, Jaguar Land Rover, and Renault; and retails cars under import brands, including Jaguar Land Rover, BMW, Audi, Lexus, Infiniti, import Volkswagen, Chrysler, Jeep, Dodge, Mitsubishi, Renault, Ford, Honda, Toyota, and others. The company also exports vehicle parts, such as engines, chassis and body parts, and accessories. In addition, it provides car rental services. The company has a strategic cooperation agreement with China South Industries Group Corporation. Sinomach Automobile Co., Ltd. was founded in 1993 and is based in Tianjin, China.",
    "website": "http://www.sinomach-auto.com",
    "zipcode": null
  },
  "600375.SS": {
    "city": "Maanshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Hanma Technology Group Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "HANMA TECHNOLOGY GROUP CO LTD",
    "state": null,
    "summary": "Hanma Technology Group Co.,Ltd. researches and produces heavy trucks, heavy-duty special vehicles, and components in the People's Republic of China. The company offers heavy-duty vehicle chassis, as well as automobile engines, passenger cars, powertrains, axles, automobile parts, assembly parts, and other products. It also exports its products to approximately 60 countries in Eastern Europe, North Africa, Southeast Asia, South America, and internationally. The company was formerly known as Hualing Xingma Automobile (Group) Co., Ltd. and changed its name to Hanma Technology Group Co.,Ltd. in December 2020. Hanma Technology Group Co.,Ltd. is based in Maanshan, the People's Republic of China.",
    "website": "http://www.camc.cc",
    "zipcode": null
  },
  "600582.SS": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Tiandi Science & Technology Co.Ltd",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "TIAN DI SCIENCE & TECHNOLOGY",
    "state": null,
    "summary": "Tiandi Science & Technology Co.,Ltd engages in the mine production process automation, mechanization, information equipment development, manufacturing and system integration activities in China and internationally. It is also involved in the coal washing equipment development; manufacturing and general contracting of coal preparation plant engineering; storage and shipping loading equipment and engineering general contracting; underground special construction technology development and underground special engineering construction contracting; and provision of technical consultation and services, and coal mine management businesses. The company was founded in 2000 and is based in Beijing, China.",
    "website": "http://www.tdtec.com",
    "zipcode": "100013"
  },
  "600710.SS": {
    "city": "Changzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Sumec Corporation Limited",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "SUMEC CORPORATION LIMITED",
    "state": null,
    "summary": "Sumec Corporation Limited distributes construction machinery and equipment in China. The company offers wheel loaders, excavators, motor graders, backhoe loaders, skid steer loaders, road rollers, landfill compactors, bulldozers, forklifts, truck cranes, truck mounted cranes, mining trucks, pavers, road headers, and structural parts for heavy equipment, as well as solar home lighting systems. It also exports its products to the Philippines, Vietnam, Indonesia, and other Southeast Asian countries; Saudi Arabia, Oman, Iran, and other West Asian countries; Kazakhstan, Russia, Belarus, and other CIS countries; Togo, South Africa, and other South African countries; and Argentina, Mexico, and other South American countries. The company was formerly known as Changlin Company Limited and changed its name to Sumec Corporation Limited in October 2017. Sumec Corporation Limited was founded in 1961 and is based in Changzhou, China.",
    "website": "http://www.changlin.com.cn",
    "zipcode": "213136"
  },
  "600815.SS": {
    "city": "Xiamen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Xiamen XGMA Machinery Company Limited",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "XIAMEN XGMA MACHINERY CO LTD",
    "state": null,
    "summary": "Xiamen XGMA Machinery Company Limited manufactures and sells engineering machinery products in China. It offers wheel loaders, including backhoe, mini wheel, and skid steer loaders; hydraulic crawler excavators; road construction machinery, such as tandem vibratory rollers, walk behind vibratory rollers, hydraulic vibratory rollers, pneumatic rollers, single drum vibratory rollers, motor graders, bulldozers, milling machine, and asphalt pavers; and industrial machinery, including diesel and electric forklift trucks, electric pallet stackers, and side loading forklifts. The company also provides landfill compactors; and concrete machinery that consists of pump trucks, concrete and hydraulic concrete placing booms, truck mounted concrete pumps, concrete trailers, concrete mixer transport trucks, concrete batching plants, and stabilized soil mixing plants. In addition, it offers pile driving machinery; and truck cranes, transportation equipment, ore crushing equipment, dump trucks, asphalt mixing plant, stone cutting and grinding machines, edge cutting machines, generator sets, and undercarriage parts of excavators and bulldozers. Its products are used in construction sites, mines, factories, ports, warehouses, agriculture and forestry, water conservancy, metros, tunnels, pipe racks, and underground space development activities. The company also exports its products to Central and South America, Central Asia, the Middle East, Africa, Southeast Asia, Europe, the United States, and internationally. Xiamen XGMA Machinery Company Limited was founded in 1951 and is based in Xiamen, China.",
    "website": "http://www.xiagong.com",
    "zipcode": "361023"
  },
  "600841.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Shanghai Diesel Engine Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "SHANGHAI DIESEL ENGINE",
    "state": null,
    "summary": "Shanghai Diesel Engine Co., Ltd. manufactures and sells diesel engines in China. The company provides natural gas engines, diesel engines for gensets, engines for construction machinery, truck engines, marine engines, and bus and coach diesel engines. Its products are primarily used in heavy-duty vehicles, passenger cars, engineering machinery, ships, and mobile power stations. The company was founded in 1947 and is based in Shanghai, China.",
    "website": "http://www.sdeciepower.com",
    "zipcode": "200438"
  },
  "603298.SS": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Hangcha Group Co., Ltd",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "HANGCHA GROUP CO LTD",
    "state": null,
    "summary": "Hangcha Group Co., Ltd manufactures and sells forklift trucks in China. The company's material handling equipment include internal combustion (IC) forklift trucks, electric forklift trucks, warehouse equipment, tow tractors, side loading forklifts, explosion proof forklifts, empty container handlers, reach stacker, lifting platforms, and pallet truck forks for roll goods, as well as OEM components and parts, spare parts, and after-services internationally. It is also involved in the import and export activities. The company was founded in 1956 and is headquartered in Hangzhou, China.",
    "website": "http://www.hcforklift.com",
    "zipcode": "311123"
  },
  "603338.SS": {
    "city": "Deqing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Zhejiang Dingli Machinery Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "ZHEJIANG DINGLI MACHINERY CO LT",
    "state": null,
    "summary": "Zhejiang Dingli Machinery Co.,Ltd develops, manufactures, and sells various aerial working platforms in China, Europe, the United States, Asia, and Africa. It offers self-propelled telescopic and articulating boom lifts; scissor lifts; self-propelled vertical lifts and mobile vertical lifts; self-propelled aerial stock pickers and mobile aerial stock pickers; and mast climbers. The company's products are used in construction, commercial and industrial, and national defense and military fields. Zhejiang Dingli Machinery Co.,Ltd was founded in 2005 and is headquartered in Deqing, China.",
    "website": "http://www.cndingli.com",
    "zipcode": null
  },
  "603611.SS": {
    "city": "Changxing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Noblelift Intelligent Equipment Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "NOBLELIFT INTELLIGENT EQUIPMENT",
    "state": null,
    "summary": "Noblelift Intelligent Equipment Co.,Ltd. manufactures and sells material handling equipment in China. The company offers material handling equipment, such as pallet trucks; electric stackers; and electric forklifts. It also provides reach trucks/ tow tractors; hand pallet trucks consist of scale pallet trucks, pallent trucks, and manual and electric scissor lifts; and other products include table lifters, manual and mini stackers, and semi-electric stackers, as well as lifting platforms. Additionally, the company offers system integration solutions for automated warehouse, automated guided vehicles, management software systems, and conveying equipment. Further, it provides automatic walking, vertical lift, and platform extension functions for electric power, petrochemical, and manufacturing equipment installation and maintenance sectors. The company also offers logistic solutions. Noblelift Intelligent Equipment Co.,Ltd. is headquartered in Changxing, China.",
    "website": "http://www.noblelift.com",
    "zipcode": "313100"
  },
  "603789.SS": {
    "city": "Huzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Thinker Agricultural Machinery Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "THINKER AGRICULTURAL MACHINERY ",
    "state": null,
    "summary": "Thinker Agricultural Machinery Co., Ltd. engages in the research and development, manufacture, sale, and service of agricultural machinery in China. Its products include grain harvesting, grain crop harvesting, tillage, arable land power, and forage harvesting machinery. The company also exports its products to Indonesia, Vietnam, Sri Lanka, Iran, Peru, El Salvador, Ecuador, Myanmar, South Korea, the Philippines, North Korea, South Africa, and internationally. Thinker Agricultural Machinery Co., Ltd. was founded in 2004 and is based in Huzhou, China.",
    "website": "http://www.xg1688.com",
    "zipcode": null
  },
  "8CZ.F": {
    "city": "Changsha",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Zoomlion Heavy Industry Science and Technology Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "ZOOMLION HEA.I.S.+T.H YC1",
    "state": null,
    "summary": "Zoomlion Heavy Industry Science and Technology Co., Ltd., together with its subsidiaries, engages in the research, development, manufacture, and sale of construction and agricultural machinery in the People's Republic of China and internationally. The company operates through Construction Machinery, Agricultural Machinery, and Financial Services segments. It offers concrete machineries, including truck and trailer mounted concrete pumps, dry mortar products, concrete placing booms, concrete mixing plants, truck-mounted concrete mixers, truck-mounted line concrete pumps, and self-propelled boom concrete pumps; and truck, all-terrain truck, and crawler cranes, as well as various tower cranes. The company also provides road construction and pile foundation machineries, earth working machineries, material handling machineries and systems, specialized vehicles, and vehicle axles; road building and maintenance machineries; hoisting machineries; and forklift trucks and other products for infrastructure and real estate construction. In addition, it offers various agricultural machineries, such as tractors, grain harvesters, and drying machines. Further, it provides finance leasing, commercial factoring, and bond issuance services. Additionally, the company leases and trades in equipment and machineries; researches and manufactures machine software; manages tourism resource; and offers hydraulic products. The company was formerly known as Changsha Zoomlion Heavy Industry Science and Technology Development Co., Ltd. and changed its name to Zoomlion Heavy Industry Science and Technology Co., Ltd. in October 2011. Zoomlion Heavy Industry Science and Technology Co., Ltd. was founded in 1992 and is based in Changsha, the People's Republic of China.",
    "website": "http://www.zoomlion.com",
    "zipcode": "410013"
  },
  "900920.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "USD",
    "exchange": "SHH",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Shanghai Diesel Engine Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "SHANGHAI DIESEL ENGINE",
    "state": null,
    "summary": "Shanghai Diesel Engine Co., Ltd. manufactures and sells diesel engines in China. The company provides natural gas engines, diesel engines for gensets, engines for construction machinery, truck engines, marine engines, and bus and coach diesel engines. Its products are primarily used in heavy-duty vehicles, passenger cars, engineering machinery, ships, and mobile power stations. The company was founded in 1947 and is based in Shanghai, China.",
    "website": "http://www.sdeciepower.com",
    "zipcode": "200438"
  },
  "BWOWF": {
    "city": "Beijing",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Wowjoint Holdings Limited",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "WOWJOINT HOLDINGS LIMITED",
    "state": null,
    "summary": "Wowjoint Holdings Limited provides infrastructure solutions for customized heavy duty lifting and carrying machinery used in various projects worldwide. The company's machine supply products include bridge erection machines, such as launching machines, and MSS and molds; material handling products comprising special carriers, straddle carriers, slab mobilift with double cantilevers, wind power handling equipment, and gantry cranes; and trollies that include tire, flat, and low frame trollies, as well as trollies for transporting railway panels. Its machine supply products also comprise bridge replacement gantries for highway and railway bridges; and marine hoists. In addition, the company offers rental services for equipment, including T-beam launching machines, segment lifters, special launching carriers, special carriers, tire trollies, and mobilift with double cantilevers. Further, it provides various construction and engineering services related to bridge construction and rail services, such as solutions on erection of prefabricated bridge/viaduct and rebuilding replacement of old bridges. Additionally, the company offers subcontracting services comprising job sit services through operating machines for bridge erection, bridge rebuilding, lifting, and transporting at prefabrication yards, as well as equipment move commissioning. The company was founded in 1996 and is based in Beijing, China.",
    "website": "http://www.wowjoint.com",
    "zipcode": "101118"
  },
  "C9IB.F": {
    "city": "Shanghai",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Lonking Holdings Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "LONKING HOLDINGS LTD. NEW",
    "state": null,
    "summary": "Lonking Holdings Limited, an investment holding company, manufactures and distributes wheel loaders, road rollers, excavators, forklifts, and other construction machinery in Mainland China. The company also provides hydraulic excavators and skid steer loaders; and diesel, electric, and LPG forklifts. In addition, it offers components, such as axles, gear boxes, cylinders, gears, castings, and high-end hydraulic pumps and valves; and main valves, parts, pilot oil valves, radial plunger motors, swing motors and reducer assemblies, and variable plunger pumps. Further, the company provides finance leasing for wheel loaders and other machinery. It also sells its products to approximately 40 countries in Mid and South America, Russia, Asia and Pacific area, Mid-East countries and Africa, etc. The company was founded in 1993 and is headquartered in Shanghai, the People's Republic of China.",
    "website": "http://www.lonking.cn",
    "zipcode": "201612"
  },
  "FIRRF": {
    "city": "Luoyang",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "First Tractor Company Limited",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "FIRST TRACTOR COMPANY LIMITED",
    "state": null,
    "summary": "First Tractor Company Limited engages in the research and development, manufacture, and sale of agricultural and power machinery, and related spare parts worldwide. It operates through three divisions: Agricultural Machinery, Power Machinery, and Finance. The company offers wheeled and crawler tractors, and its components, such as castings, gears, gear boxes, and covers; and off-road diesel engines, as well as accessory parts, including fuel injection pumps and fuel injectors. It also engages in fund settlement, fund raising, financing, and other financial activities; and the processing and sale of rough and semi-finished, and finished products of castings and forging products. In addition, the company accepts deposits; and provides loans, finance lease, bill acceptance and discounting, entrusting loans, and investments to member companies, as well as equity and portfolio investment in financial institutions as approved; and consumer credit service, buyer's credit, and finance lease for products of member companies and inter-bank borrowing and lending. First Tractor Company Limited markets its products to approximately 140 countries and regions. The company was formerly known as First Tractor Works of China. The company was founded in 1955 and is based in Luoyang, China.",
    "website": "http://www.first-tractor.com.cn",
    "zipcode": "471004"
  },
  "FIRRY": {
    "city": "Luoyang",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "First Tractor Company Limited",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "FIRST TRACTOR COMPANY LIMITED",
    "state": null,
    "summary": "First Tractor Company Limited engages in the research and development, manufacture, and sale of agricultural and power machinery, and related spare parts worldwide. It operates through three divisions: Agricultural Machinery, Power Machinery, and Finance. The company offers wheeled and crawler tractors, and its components, such as castings, gears, gear boxes, and covers; and off-road diesel engines, as well as accessory parts, including fuel injection pumps and fuel injectors. It also engages in fund settlement, fund raising, financing, and other financial activities; and the processing and sale of rough and semi-finished, and finished products of castings and forging products. In addition, the company accepts deposits; and provides loans, finance lease, bill acceptance and discounting, entrusting loans, and investments to member companies, as well as equity and portfolio investment in financial institutions as approved; and consumer credit service, buyer's credit, and finance lease for products of member companies and inter-bank borrowing and lending. First Tractor Company Limited markets its products to approximately 140 countries and regions. The company was formerly known as First Tractor Works of China. The company was founded in 1955 and is based in Luoyang, China.",
    "website": "http://www.first-tractor.com.cn",
    "zipcode": "471004"
  },
  "FTP.F": {
    "city": "Luoyang",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "First Tractor Company Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "FIRST TRACTOR CO.  H YC1",
    "state": null,
    "summary": "First Tractor Company Limited engages in the research and development, manufacture, and sale of agricultural and power machinery, and related spare parts worldwide. It operates through three divisions: Agricultural Machinery, Power Machinery, and Finance. The company offers wheeled and crawler tractors, and its components, such as castings, gears, gear boxes, and covers; and off-road diesel engines, as well as accessory parts, including fuel injection pumps and fuel injectors. It also engages in fund settlement, fund raising, financing, and other financial activities; and the processing and sale of rough and semi-finished, and finished products of castings and forging products. In addition, the company accepts deposits; and provides loans, finance lease, bill acceptance and discounting, entrusting loans, and investments to member companies, as well as equity and portfolio investment in financial institutions as approved; and consumer credit service, buyer's credit, and finance lease for products of member companies and inter-bank borrowing and lending. First Tractor Company Limited markets its products to approximately 140 countries and regions. The company was formerly known as First Tractor Works of China. The company was founded in 1955 and is based in Luoyang, China.",
    "website": "http://www.first-tractor.com.cn",
    "zipcode": "471004"
  },
  "LKHLY": {
    "city": "Shanghai",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Lonking Holdings Limited",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "LONKING HOLDINGS LTD",
    "state": null,
    "summary": "Lonking Holdings Limited, an investment holding company, manufactures and distributes wheel loaders, road rollers, excavators, forklifts, and other construction machinery in Mainland China. The company also provides hydraulic excavators and skid steer loaders; and diesel, electric, and LPG forklifts. In addition, it offers components, such as axles, gear boxes, cylinders, gears, castings, and high-end hydraulic pumps and valves; and main valves, parts, pilot oil valves, radial plunger motors, swing motors and reducer assemblies, and variable plunger pumps. Further, the company provides finance leasing for wheel loaders and other machinery. It also sells its products to approximately 40 countries in Mid and South America, Russia, Asia and Pacific area, Mid-East countries and Africa, etc. The company was founded in 1993 and is headquartered in Shanghai, the People's Republic of China.",
    "website": "http://www.lonking.cn",
    "zipcode": "201612"
  },
  "QIN.F": {
    "city": "Chongqing",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Qingling Motors Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "QINGLING MOTORS CO. H YC1",
    "state": null,
    "summary": "Qingling Motors Co., Ltd., together with its subsidiaries, produces and sells Isuzu trucks in the People's Republic of China. The company offers light, medium, and heavy-duty trucks; pick-up trucks; and multi-purpose vehicles, as well as chassis and automobile parts, engines, accessories, and others. It is also involved in the production of moulds for the manufacture of automobile parts; and automobile retailing and after-sales services. Qingling Motors Co., Ltd. also exports its products. The company was founded in 1946 and is based in Chongqing, the People's Republic of China. Qingling Motors Co., Ltd. is a subsidiary of Qingling Motors (Group) Company Limited.",
    "website": "http://www.qingling.com.cn",
    "zipcode": "400052"
  },
  "SNYYF": {
    "city": "Shenyang",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Sany Heavy Equipment International Holdings Company Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "SANY HEAVY EQUIPMENT INTL HLDG ",
    "state": null,
    "summary": "Sany Heavy Equipment International Holdings Company Limited, an investment holding company, engages in the research, development, manufacture, and sale of integrated excavation machinery, integrated coal mining equipment, and coal mine transportation equipment. It operates in two segments, Mining Equipment and Logistics Equipment. The Mining Equipment segment provides coal mining machinery products, including roadheaders, such as soft rock and hard rock roadheaders, integrated excavation, bolting, and self-protection machinery; mining equipment consisting of coal mining machines (shearer), hydraulic support system, scraper conveyors (armored-face conveyer), etc.; non-coal mining machinery products comprising tunnel roadheaders and mining machines; mining transport equipment, including mechanical drive off-highway and electric drive off-highway dump trucks, widebody vehicles, and other relevant products; spare parts; robotic products, such as robotic system integration, mobile robots, and electric forklifts; and smart mine products, including unmanned driving, automated integrated mining, and smart mine operation systems. The Logistic Equipment segment offers container equipment, such as front loaders, stacking machines and quayside gantry cranes, etc.; bulk material equipment, which comprise grippers, elevated hoisting arms, etc.; and general equipment, including heavy-weight forklifts, telehandlers, etc. In addition, the company provides maintenance and property development services. It operates in Mainland China, rest of Asia, the European Union, the United States, and internationally. The company was founded in 2004 and is headquartered in Shenyang, the People's Republic of China. Sany Heavy Equipment International Holdings Company Limited is a subsidiary of Sany Hongkong Group Limited.",
    "website": "http://www.sanyhe.com",
    "zipcode": "111117"
  },
  "YXS.F": {
    "city": "Shenyang",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Sany Heavy Equipment International Holdings Company Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "SANY HEAVY EQP.HL.CO.REGS",
    "state": null,
    "summary": "Sany Heavy Equipment International Holdings Company Limited, an investment holding company, engages in the research, development, manufacture, and sale of integrated excavation machinery, integrated coal mining equipment, and coal mine transportation equipment. It operates in two segments, Mining Equipment and Logistics Equipment. The Mining Equipment segment provides coal mining machinery products, including roadheaders, such as soft rock and hard rock roadheaders, integrated excavation, bolting, and self-protection machinery; mining equipment consisting of coal mining machines (shearer), hydraulic support system, scraper conveyors (armored-face conveyer), etc.; non-coal mining machinery products comprising tunnel roadheaders and mining machines; mining transport equipment, including mechanical drive off-highway and electric drive off-highway dump trucks, widebody vehicles, and other relevant products; spare parts; robotic products, such as robotic system integration, mobile robots, and electric forklifts; and smart mine products, including unmanned driving, automated integrated mining, and smart mine operation systems. The Logistic Equipment segment offers container equipment, such as front loaders, stacking machines and quayside gantry cranes, etc.; bulk material equipment, which comprise grippers, elevated hoisting arms, etc.; and general equipment, including heavy-weight forklifts, telehandlers, etc. In addition, the company provides maintenance and property development services. It operates in Mainland China, rest of Asia, the European Union, the United States, and internationally. The company was founded in 2004 and is headquartered in Shenyang, the People's Republic of China. Sany Heavy Equipment International Holdings Company Limited is a subsidiary of Sany Hongkong Group Limited.",
    "website": "http://www.sanyhe.com",
    "zipcode": "111117"
  },
  "ZLIOF": {
    "city": "Changsha",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Zoomlion Heavy Industry Science and Technology Co., Ltd.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "ZOOMLION HEAVY IND SC&TH CO LTD",
    "state": null,
    "summary": "Zoomlion Heavy Industry Science and Technology Co., Ltd., together with its subsidiaries, engages in the research, development, manufacture, and sale of construction and agricultural machinery in the People's Republic of China and internationally. The company operates through Construction Machinery, Agricultural Machinery, and Financial Services segments. It offers concrete machineries, including truck and trailer mounted concrete pumps, dry mortar products, concrete placing booms, concrete mixing plants, truck-mounted concrete mixers, truck-mounted line concrete pumps, and self-propelled boom concrete pumps; and truck, all-terrain truck, and crawler cranes, as well as various tower cranes. The company also provides road construction and pile foundation machineries, earth working machineries, material handling machineries and systems, specialized vehicles, and vehicle axles; road building and maintenance machineries; hoisting machineries; and forklift trucks and other products for infrastructure and real estate construction. In addition, it offers various agricultural machineries, such as tractors, grain harvesters, and drying machines. Further, it provides finance leasing, commercial factoring, and bond issuance services. Additionally, the company leases and trades in equipment and machineries; researches and manufactures machine software; manages tourism resource; and offers hydraulic products. The company was formerly known as Changsha Zoomlion Heavy Industry Science and Technology Development Co., Ltd. and changed its name to Zoomlion Heavy Industry Science and Technology Co., Ltd. in October 2011. Zoomlion Heavy Industry Science and Technology Co., Ltd. was founded in 1992 and is based in Changsha, the People's Republic of China.",
    "website": "http://www.zoomlion.com",
    "zipcode": "410013"
  },
  "ZLIOY": {
    "city": "Changsha",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Zoomlion Heavy Industry Science and Technology Co., Ltd.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Industrials",
    "short_name": "ZOOMLION HEAVY IND SC&TH CO LTD",
    "state": null,
    "summary": "Zoomlion Heavy Industry Science and Technology Co., Ltd., together with its subsidiaries, engages in the research, development, manufacture, and sale of construction and agricultural machinery in the People's Republic of China and internationally. The company operates through Construction Machinery, Agricultural Machinery, and Financial Services segments. It offers concrete machineries, including truck and trailer mounted concrete pumps, dry mortar products, concrete placing booms, concrete mixing plants, truck-mounted concrete mixers, truck-mounted line concrete pumps, and self-propelled boom concrete pumps; and truck, all-terrain truck, and crawler cranes, as well as various tower cranes. The company also provides road construction and pile foundation machineries, earth working machineries, material handling machineries and systems, specialized vehicles, and vehicle axles; road building and maintenance machineries; hoisting machineries; and forklift trucks and other products for infrastructure and real estate construction. In addition, it offers various agricultural machineries, such as tractors, grain harvesters, and drying machines. Further, it provides finance leasing, commercial factoring, and bond issuance services. Additionally, the company leases and trades in equipment and machineries; researches and manufactures machine software; manages tourism resource; and offers hydraulic products. The company was formerly known as Changsha Zoomlion Heavy Industry Science and Technology Development Co., Ltd. and changed its name to Zoomlion Heavy Industry Science and Technology Co., Ltd. in October 2011. Zoomlion Heavy Industry Science and Technology Co., Ltd. was founded in 1992 and is based in Changsha, the People's Republic of China.",
    "website": "http://www.zoomlion.com",
    "zipcode": "410013"
  }
}
