{
  "000617.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Financial Conglomerates",
    "long_name": "CNPC Capital Company Limited",
    "market": "cn_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "CNPC CAPITAL COMPA",
    "state": null,
    "summary": "CNPC Capital Company Limited operates as a financial company in China. It is involved in the banking, financial leasing, trust, insurance, insurance brokerage, securities, and other financial activities. The company was formerly known as Jinan Diesel Engine Co., Ltd. and changed its name to CNPC Capital Company Limited in February 2017. The company was founded in 1996 and is based in Beijing, China. CNPC Capital Company Limited is a subsidiary of China National Petroleum Corporation.",
    "website": "http://www.cnpccapital.cn",
    "zipcode": "100032"
  },
  "002423.SZ": {
    "city": "Jiyuan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Financial Conglomerates",
    "long_name": "COFCO Capital Holdings Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "COFCO CAPITAL HOLD",
    "state": null,
    "summary": "Zhongyuan Special Steel Co., Ltd. engages in the research, development, production, sale, and servicing of industrial special equipment and special steel precision forgings in China. Its industrial special equipment products include oil drilling tools, dynamic mandrels, fan main shafts, cast pipe molds, ultra high pressure containers, forged steel cold rolls, hydraulic cylinders, etc.; and special steel precision forgings comprise mold steel, stainless steel, bearing steel, and special products. The company's products are used in petroleum, electric power, chemical, shipbuilding, metallurgy, machinery, military, and other equipment manufacturing industries. It also exports its products to Europe, the United States, Japan, South Korea, Africa, South Asia, and Southeast Asia countries and regions. The company is based in Jiyuan, China. COFCO Capital Holdings Co., Ltd. operates as a subsidiary of COFCO Corporation",
    "website": "http://zssw.com",
    "zipcode": null
  },
  "002647.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Financial Conglomerates",
    "long_name": "Rendong Holdings Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "RENDONG HOLDINGS C",
    "state": null,
    "summary": "Rendong Holdings Co., Ltd. provides financial services. It offers third-party payment, credit information, big data, inclusive finance, supply chain, factoring, asset management, etc. The company is also involved in traditional financial services, such as banking, trust, securities, insurance, etc.; and supply chain finance, factoring, micro finance, and leasing businesses. The company was formerly known as Meson Fintech Co., Ltd. and changed its name to Rendong Holdings Co., Ltd. in August 2018. Rendong Holdings Co., Ltd. was founded in 1998 and is headquartered in Beijing, China.",
    "website": "http://www.rendongholdings.com",
    "zipcode": null
  },
  "002670.SZ": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Financial Conglomerates",
    "long_name": "Guosheng Financial Holding Inc.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "GUOSHENG FINANCIAL",
    "state": null,
    "summary": "Guosheng Financial Holding Inc. together with its subsidiaries, provides diversified financial services in China. It engages in the securities business through 200 branches in 30 provinces and autonomous regions, as well as operates a financial platform; and investment business, including funds, management, and business cooperation services to various enterprises. The company is also involved in the financial technology business comprising big data, cloud computing, artificial intelligence, blockchain, and other technologies; and development of financial industry information collaboration solutions, regulatory technologies, intelligent data services, and digital currency platforms. Guosheng Financial Holding Inc. was founded in 1995 and is based in Shenzhen, China.",
    "website": "http://www.gsfins.com",
    "zipcode": null
  },
  "1945.HK": {
    "city": "Beijing",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Financial Conglomerates",
    "long_name": "Zero2IPO Holdings Inc.",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "ZERO2IPO",
    "state": null,
    "summary": "Zero2IPO Holdings Inc., an investment holding company, provides integrated equity investment services in the People's Republic of China. It operates an integrated service platform that offers data, consulting, marketing, and training services to participants in the equity investment industry. The company provides PEdata Database and research report services that enable convenient and easy-to-navigate access to industry data and informed decision-making. It also offers omni-channel marketing services through its online information platforms, such as PEdaily; and offline industry events, which track industry trends and facilitate intra- and inter-industry networking. In addition, the company connects entrepreneurs and growth enterprises with investors through its online investor-entrepreneur matching platform and offline consulting services. Further, it provides various equity investment-related online and offline training courses through SandHill University, SandHill College, and Investment College. The company provides its services through online and offline channels for participants in the equity investment industry, including investors, entrepreneurs, growth enterprises, and government agencies. Zero2IPO Holdings Inc. was founded in 2001 and is headquartered in Beijing, the People's Republic of China.",
    "website": "http://www.zero2ipo.cn",
    "zipcode": "100600"
  },
  "600390.SS": {
    "city": "Changsha",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Financial Conglomerates",
    "long_name": "Minmetals Capital Company Limited",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "MINMETALS CAPITAL COMPANY LIMIT",
    "state": null,
    "summary": "Minmetals Capital Company Limited engages in the investment, finance, leasing, trusts, securities, futures, and insurance and other businesses in China. The company offers trust, investment fund, investment banking, wealth management, an others services. It also provides direct finance, after-sale, vendor, and operating leasing services; and a range of brokerage, fixed income, asset management, and securities brokerage and investment advisory services. In addition, the company offers derivatives integrated service platform and futures brokerage services; and commercial banking services. It operates 68 business outlets in Mianyang City. The company was formerly known as Kingray New Materials Science & Technology Co., Ltd and changed its name to Minmetals Capital Company Limited in March 2017. Minmetals Capital Company Limited was incorporated in 1999 and is based in Changsha, China.",
    "website": "http://www.minfinance.com.cn",
    "zipcode": "410012"
  },
  "600621.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Financial Conglomerates",
    "long_name": "Shanghai Chinafortune Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "SHANGHAI CHINAFORTUNE CO LTD",
    "state": null,
    "summary": "Shanghai Chinafortune Co., Ltd., through its subsidiaries, operates in the financial services industry. It engages in securities, funds, and futures; and financial leasing businesses. The company was formerly known as Shanghai Jinling Co., Ltd. and changed its name to Shanghai Chinafortune Co., Ltd. in January 2013. Shanghai Chinafortune Co., Ltd. was founded in 1952 and is based in Shanghai, China.",
    "website": "http://www.shchinafortune.com",
    "zipcode": "200030"
  }
}
