{
    "002515.SZ": {
        "short_name": "JINZI HAM CO LTD",
        "long_name": "Jinzi Ham Co.,Ltd.",
        "summary": "Jinzi Ham Co.,Ltd. engages in the research and development, production, and sale of fermented meat products in China, Southeast Asia, Hong Kong, Macao, and Taiwan. The company offers Jinhua ham, low-salt ham, Bama fermented ham, ham broth, and other ham products, as well as Jinhua sausage, bacon, and other related meat products. It primarily serves catering hotels and food processing companies. The company is headquartered in Jinhua, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinhua",
        "zipcode": "321016",
        "website": "http://www.jinzichina.com",
        "market_cap": "Small Cap"
    },
    "002567.SZ": {
        "short_name": "TANGRENSHEN GROUP",
        "long_name": "Tangrenshen Group Co., Ltd",
        "summary": "Tangrenshen Group Co., Ltd produces, processes, and sells pig meat and feed products in China. The company sells its products under the TRS and Camel brand names. It operates approximately 40 branches. The company is headquartered in Zhuzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuzhou",
        "zipcode": "412000",
        "website": "http://www.trsgroup.com.cn",
        "market_cap": "Small Cap"
    },
    "002719.SZ": {
        "short_name": "MAIQUER GROUP CO L",
        "long_name": "Maiquer Group Co.,Ltd",
        "summary": "Maiquer Group Co., Ltd. engages in the production and sale of dairy products, beverages, frozen drinks, mineral water, and quick-frozen foods in China. The company's principal products include sterilized milk, yogurt, protein drinks, ice cream, and popsicles. It also provides agricultural products; livestock breeding and agricultural cultivation services; and bakery and festival products. The company is based in Changji, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changji",
        "zipcode": "831100",
        "website": "http://www.maiquer.com",
        "market_cap": "Small Cap"
    },
    "1587.HK": {
        "short_name": "SHINEROAD INTL",
        "long_name": "Shineroad International Holdings Limited",
        "summary": "Shineroad International Holdings Limited, an investment holding company, distributes food ingredients, food additives, and packaging materials in Mainland China. It serves food ingredients and additives processing companies, manufacturers, and trading companies. The company was founded in 1996 and is headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.shineroad.com",
        "market_cap": "Small Cap"
    },
    "300892.SZ": {
        "short_name": "PINLIVE FOODS CO L",
        "long_name": "Pinlive Foods Co., Ltd.",
        "summary": "Pinlive Foods Co., Ltd. imports and distributes food products in China, Germany, Spain, Thailand, Malaysia, Korea, Ukraine, and Australia. It offers milk under Deya brand; beer under Valentin brand; olive oil under Pinelli brand; breakfast grains under Hannrae brand; butterfly crisps under Yane brand; biscuits under Guyou brand; and pats under Rooster brand. The company was founded in 1997 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.pinlive.com",
        "market_cap": "Small Cap"
    },
    "ENHD": {
        "short_name": "ENERGROUP HOLDINGS CORPORATION",
        "long_name": "Energroup Holdings Corp.",
        "summary": "Energroup Holdings Corporation, through its subsidiaries, produces, packs, sells, markets, and distributes fresh pork and processed meat products in the People's Republic of China and the Russian Federation. Its activities include acquiring, slaughtering, and packaging of pork; and processing of raw and cooked meat products. The company's products comprise fresh pork meat; frozen fresh meat, including smoked pork, ham, and roasts; and frozen fresh byproducts, such as pig's liver, stomach, intestine, head, and hoof products. It also offers prepared seafood products, such as fish sausage and shellfish sausage, which are made from fish, shrimp, and other varieties of seafood. Energroup Holdings Corporation serves city and town households, canteens and restaurants, and food processing companies. It offers its products under the Chuming name through its dealership distribution network, sales force, and resellers. The company was founded in 1999 and is headquartered in Dalian City, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Dalian City",
        "zipcode": "116039",
        "website": null,
        "market_cap": "Small Cap"
    },
    "GLCC": {
        "short_name": "GOOD LIFE CHINA CORPORATION",
        "long_name": "Good Life China Corporation",
        "summary": "Good Life China Corporation operates a chain of franchised convenience stores in Hebei Province, the People's Republic of China. The company employs retail concepts, such as e-commerce enabled POS/back office systems. Its stores offer various products, such as fast food and snacks, groceries, alcoholic beverages, health and beauty aids, kitchen appliances, clothing and footwear, toys, newspapers and magazines, hardware, and specialty regional products. It also provides warehousing and distribution services for farm input products, as well as sells commodity crops on behalf of local farmers. In addition, the company, through its subsidiary, Miluga Corp, provides baking birthday and exquisite cakes, and bread and croissants, as well as offers flower delivery services. As of March 31, 2009 it operated approximately 2,000 stores. The company was founded in 2008 and is based in Beijing, China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100085",
        "website": null,
        "market_cap": "Small Cap"
    }
}