{
  "002336.SZ": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Grocery Stores",
    "long_name": "Renrenle Commercial Group Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "RENRENLE COMMERCIA",
    "state": null,
    "summary": "Renrenle Commercial Group Co.,Ltd. operates hypermarkets, boutique supermarkets, boutiques, department stores, and online shopping supermarkets in China. It operates 128 stores in Guangdong, Shaanxi, Sichuan, Tianjin, Chongqing, Guangxi, Fujian, Hunan, Jiangxi, and other provinces. The company was founded in 1996 and is based in Shenzhen, China.",
    "website": "http://www.renrenle.cn",
    "zipcode": null
  },
  "1210.HK": {
    "city": "Shanghai",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Grocery Stores",
    "long_name": "Christine International Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "CHRISTINE",
    "state": null,
    "summary": "Christine International Holdings Limited, an investment holding company, operates a chain of bakeries in the People's Republic of China. The company produces and sells bakery products, including breads and cakes, moon cakes, pastries, and other products. It operates a multi-channel retail network that comprises neighbor stores, subway stores, flagship stores, and European style fresh-bake stores. The company was founded in 1993 and is headquartered in Shanghai, the People's Republic of China.",
    "website": "http://www.christine.com.cn",
    "zipcode": "200062"
  },
  "3686.HK": {
    "city": "Guangzhou",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Grocery Stores",
    "long_name": "Clifford Modern Living Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "CLIFFORDML",
    "state": null,
    "summary": "Clifford Modern Living Holdings Limited, an investment holding company, provides retail services in the People's Republic of China. The company operates through six segments: Property Management Services, Renovation and Fitting-Out Services, Retail Services, Off-Campus Training Services, Information Technology Services, and Ancillary Living Services. It operates 18 retail outlets, which include two supermarkets, one wet market, and 15 convenience stores. The company also offers general property management and resident support services to residential communities and commercial properties; renovation and fitting-out services to residents, tenants or owners, and third-party sub-contractors; and off-campus training services, including tutoring courses and language learning classes. In addition, it provides information technology and related engineering services; security systems, and hardware and software integration services, as well as telecommunication sales outlet services; and catering consultancy, property agency, employment placement, and laundry services. The company offers its services to residents under the Clifford brand. Clifford Modern Living Holdings Limited was founded in 1998 and is headquartered in Guangzhou, the People's Republic of China.",
    "website": "http://www.cliffordmodernliving.com",
    "zipcode": "511496"
  },
  "600361.SS": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Grocery Stores",
    "long_name": "Beijing Hualian Hypermarket Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "BEIJING HUALIAN HYPERMARKET CO.",
    "state": null,
    "summary": "Beijing Hualian Hypermarket Co., Ltd. sells food and non-food items through department stores in China. The company's stores offer knitted products, daily sundries, fruits and vegetables, grains and oil foods, non-staple foods, and other products. It also leases commercial facilities and operating sites. The company was founded in 1996 and is based in Beijing, China.",
    "website": "http://zc.beijing-hualian.com",
    "zipcode": "100037"
  },
  "601116.SS": {
    "city": "Ningbo",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Grocery Stores",
    "long_name": "Sanjiang Shopping Club Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "SANJIANG SHOPPING CLUB CO LTD",
    "state": null,
    "summary": "Sanjiang Shopping Club Co., Ltd. operates a chain of supermarkets in Zhejiang province, the People's Republic of China. It also provides online shopping services. The company was founded in 1995 and is based in Ningbo, the People's Republic of China.",
    "website": "http://home.sanjiang.com",
    "zipcode": null
  },
  "603777.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Grocery Stores",
    "long_name": "Shanghai Laiyifen Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "SHANGHAI LIYIFEN CO LTD",
    "state": null,
    "summary": "Shanghai Laiyifen Co.,Ltd operates a chain of snack food stores in China. Its stores offer snack food nuts, meat products, soy products, seafood products, dried fruits, vegetables, chocolate confectioneries, cakes, and puffed products; grains and oil products; and fresh food products, as well as water bars, daily gifts, and other goods. As of November 8, 2019, the company has approximately 2,800 stores. It also provides its products through its online store. The company was founded in 1999 and is based in Shanghai, China. Shanghai Laiyifen Co.,Ltd is a subsidiary of Shanghai Aiwu Business Management Co., Ltd.",
    "website": "http://www.lyfen.com",
    "zipcode": "201615"
  },
  "603866.SS": {
    "city": "Shenyang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Grocery Stores",
    "long_name": "Toly Bread Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "TOLY BREAD CO LTD",
    "state": null,
    "summary": "Toly Bread Co., Ltd. engages in producing, processing, and marketing bakery products in China. It offers bread, cakes, and moon cakes. The company was formerly known as Shenyang Toly Bread Co., Ltd. and changed its name to Toly Bread Co., Ltd. in March 2017. Toly Bread Co., Ltd. was founded in 1997 and is based in Shenyang, China.",
    "website": "http://www.tolybread.cn",
    "zipcode": null
  },
  "603886.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Grocery Stores",
    "long_name": "Ganso Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "GANSO CO LTD",
    "state": null,
    "summary": "Ganso Co., Ltd. engages in the research and development, production, and sale of baked foods in China. It offers special, fresh milk, mousse, ice cream, chocolate, new year, rabbit lantern festival, nut, moon, date, sesame, tabletop, pineapple, egg yolk, mung bean, walnut, and egg cakes; dumplings; dried pork; pastries; and fruit gift boxes. The company offers its products directly through a chain of stores and online e-commerce channels. Ganso Co., Ltd. was founded in 2002 and is based in Shanghai, China.",
    "website": "http://www.ganso.com.cn",
    "zipcode": "201703"
  },
  "QKLS": {
    "city": "Daqing",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Grocery Stores",
    "long_name": "QKL Stores Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "QKL STORES INC",
    "state": null,
    "summary": "QKL Stores Inc., together with its subsidiaries, operates supermarket chains in northeastern China and Inner Mongolia. Its supermarkets and hypermarkets sell grocery items, such as instant foods, canned foods, packaged rice and wheat powder, crackers and chips, rice and ground wheat, bottled water and beverages, and cigarettes, as well as non-food items, including cleaning products, cosmetics, and disposable razors. The company also sells fresh-food items comprising raw meat, cooked meats, seafood, noodles and pastas, milk, yogurt, eggs, and packaged dumplings, as well as bakery items comprising breads, buns, and other self-prepared foods. In addition, it offers other non-food items, such as clothing and shoes, books and stationery, bedding and home furnishings, office supplies, toys, sporting goods, and other items, as well as electronics and household use items, such as irons, electric shavers, hair dryers, and massage machines. Further, the company operates department stores that sell brand-name and luxury clothing and accessories, cosmetics, small electronics, jewelry, books, home furnishings, and bedding, as well as have a movie theater and a traditional beauty salon. As of December 31, 2015, the company operated 25 supermarkets, 16 hypermarkets, and 4 department stores. QKL Stores Inc. is headquartered in Daqing, the People's Republic of China.",
    "website": "http://www.qklstoresinc.com",
    "zipcode": "163300"
  }
}
