{
    "000606.SZ": {
        "short_name": "SHUNLIBAN INFORMAT",
        "long_name": "Shunliban Information Service Co.,Ltd",
        "summary": "Shunliban Information Service Co.,Ltd engages in the enterprise Internet service business in China. It provides enterprise registration, finance and taxation, intellectual property, investment and financing, and problem solving services in the process of enterprise development. The company also provides modern enterprise services, such as standard and customized advisory services; and user services, professional service factory, cooperative services, service station outlets, and offline service support systems. In addition, it operates online service platform that provides knowledge, application, e-commerce, service, resource, and data cloud services combined with offline service system, as well as open cloud and cloud computing services; and provides smart enterprise services, such as enterprise insurance, procurement, and marketing, as well as service insurance and corporate finance services. The company was formerly known as Shenzhou Yiqiao Information Service Co., Ltd. and changed its name to Shunliban Information Service Co.,Ltd in June 2018. Shunliban Information Service Co.,Ltd was founded in 1996 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "000676.SZ": {
        "short_name": "GENIMOUS TECHNOLOG",
        "long_name": "Genimous Technology Co., Ltd.",
        "summary": "Genimous Technology Co., Ltd. engages in Internet media and digital marketing businesses in China and internationally. It offers mobile advertising trading platform; and integrated digital marketing, media strategy, communication strategy, media buying, socialized marketing, search engine marketing, traffic docking, and entertainment marketing services. The company also develops App China, a local android-based application store, which connects users with developers; and cross-platform solutions that connects advertisers and software developers. In addition, it engages in Internet games and Internet finance businesses. The company was formerly known as Genimous Investment Co., Ltd. and changed its name to Genimous Technology Co., Ltd. in August 2016. Genimous Technology Co., Ltd. was founded in 1996 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "000948.SZ": {
        "short_name": "YUNNAN NANTIAN ELE",
        "long_name": "Yunnan Nantian Electronics Information Co.,Ltd.",
        "summary": "Yunnan Nantian Electronics Information Co.,Ltd., an IT company, provides hardware and software products and solutions to banking/financial industry in China. It offers dot matrix printers; card readers, information interactive terminals, camera scanners, and other smart banking solutions; ribbon cartridges; mobile banking tablets, video teller machines, cashless ATMs, kiosk modules, card dispenser kiosks, and other self-services kiosks; thermal printers and modules; and spare parts. The company also provides data center services and integrated solutions; payment products and solutions to telecom operators, third-party payment providers, and financial institutions; software development and system integration services in the areas of utilities, water reservation system, telecommunications, scientific studies, government, authorities, and national defense; and consultancy and outsourcing services. Yunnan Nantian Electronics Information Co.,Ltd. is headquartered in Kunming, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Kunming"
    },
    "000971.SZ": {
        "short_name": "GOSUN HOLDING CO",
        "long_name": "Gosun Holding Co., Ltd.",
        "summary": "Gosun Holding Co., Ltd. provides integrated cloud infrastructure solutions and services for the government and enterprise industries, and Internet customers in China and internationally. It offers Internet data center services, static Website acceleration services, download acceleration services, streaming acceleration services, cloud assessment, cloud monitoring, and cloud acceleration services. The company also provides online game, online software, and online video industry solutions, as well as e-commerce Website solutions. It serves various customers, including finance, insurance, radio and television, Internet service providers, electricity providers, portals, streaming media, cloud computing, and government agencies. The company was formerly known as Hubei Landing Holding Co., Ltd. and changed its name to Gosun Holding Co., Ltd. in November 2015. Gosun Holding Co., Ltd. was founded in 1993 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "002093.SZ": {
        "short_name": "GUOMAI TECHNOLOGIE",
        "long_name": "Guomai Technologies, Inc.",
        "summary": "Guomai Technologies, Inc. provides telecommunications outsourcing services in China. The company offers network operation and maintenance services, including network health checks, routine maintenance technical support, network monitoring, network quality analysis and evaluation, network adjustment optimization and upgrade, network construction and rectification, network signal distribution and coverage, network equipment maintenance, spare parts, update and emergency communications support, data storage backup and analysis, traffic model statistical analysis, and other services. It also provides design consulting services, such as telecom market research, business development strategy, network status analysis, business needs analysis, network development planning, network evolution strategy, network engineering survey and design, and investment and benefit assessment services, as well as 2G/3G mobile core network, wireless network, IP bearer network, optical transmission network, and IT systems services. In addition, the company offers business process and human resource outsourcing services. Further, it provides telecom network integration services comprising network integration, integrated supervision, renewal, network generation and optimization, technical support, application development, channel construction, brand promotion, and certification training services. Additionally, the company offers education and training services consisting of telecom business operations, project management, technical, certification, and other training services. Guomai Technologies, Inc. was founded in 1996 and is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Fuzhou"
    },
    "002368.SZ": {
        "short_name": "TAIJI COMPUTER COR",
        "long_name": "Taiji Computer Corporation Limited",
        "summary": "Taiji Computer Corporation Limited provides information technology services primarily in China. The company designs and constructs information systems; and provides consulting, infrastructure, strategic planning, system design, software development, system integration, operation and maintenance outsourcing, and other value added services, as well as industry solutions for integrated IT service systems. It also offers smart city integration, public safety, intelligent building management, data center, and information security solutions. The company serves various industries, such as government, finance, energy, manufacturing, and public utilities. Taiji Computer Corporation Limited was founded in 1987 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "002642.SZ": {
        "short_name": "RONGLIAN GROUP LTD",
        "long_name": "Ronglian Group Ltd.",
        "summary": "Ronglian Group Ltd. provides IT solutions in China and internationally. It provides infrastructure and data center solutions, such as IT planning, application and system integration, professional operation and maintenance, and specialized services; virtualization, and private and hybrid cloud services; and B2B, smart city, and operation services. The company also offers enterprise cloud services, such as cloud planning and design, service migration, resource management, integration development, and operation monitoring services, as well as industry cloud solutions, such as insurance, exploration, and education. In addition, it provides Internet of Vehicles ecosystem through specialized hardware and software products, business platforms, and data services; Internet of Water solution to control leakage and venting, and ensure water quality safety; big data storage, data visualization, and data application solutions; and smart news solutions. Further, the company offers bio-data platform and biological cloud, and hospital and healthcare management solutions. It serves the energy, transportation, telecom, media, finance, insurance, government, education, manufacturing, biological, and healthcare industries. The company was formerly known as UEC Group Ltd. Ronglian Group Ltd. was founded in 2001 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "002912.SZ": {
        "short_name": "SHENZHEN SINOVATIO",
        "long_name": "Shenzhen Sinovatio Technology Co., Ltd.",
        "summary": "Shenzhen Sinovatio Technology Co., Ltd. provides intelligent management and security protection solutions for communication and information networks worldwide. The company offers network and machine data visualization products, such as data aggregation and distribution management products for broadband Internet; data collection and data analysis products for mobile access networks; machine data collection products; network content security products for international markets; big data operation platform, etc., as well as DPI products and business intelligence enterprise solutions. It also provides technical solution consulting services; project implementation supporting services; remote technical support services; onsite fault handling technical services; technical material services; software upgrade services; network regular inspection services; onsite duty support services; and technical training services. The company serves government, operators, and industry customers. The company was formerly known as Shenzhen Sinovatio Technology Ltd. and changed its name to Shenzhen Sinovatio Technology Co., Ltd. in March 2015. Shenzhen Sinovatio Technology Co., Ltd. was founded in 2003 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "003005.SZ": {
        "short_name": "BEIJING JINGYEDA T",
        "long_name": "Beijing Jingyeda Technology Co.,Ltd.",
        "summary": "Beijing Jingyeda Technology Co.,Ltd. provides system integration services. The company engages in the development, application, and service of industry information systems. It offers IT information consulting services in the areas of business design, system planning, solutions, engineering implementation, custom development, operation and maintenance, etc.; and educational training services. The company was founded in 1997 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "0465.HK": {
        "short_name": "FUTONG TECH",
        "long_name": "Futong Technology Development Holdings Limited",
        "summary": "Futong Technology Development Holdings Limited, an investment holding company, provides enterprise information technology (IT) infrastructure products, services, and solutions; cloud computing products; and intelligent digitalized application products in the People's Republic of China and Hong Kong. It also distributes traditional enterprise-grade IT products; and offers system integration services. The company was founded in 1996 and is headquartered in Beijing, the People's Republic of China. Futong Technology Development Holdings Limited is a subsidiary of China Group Associates Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "1075.HK": {
        "short_name": "CAPINFO",
        "long_name": "Capinfo Company Limited",
        "summary": "Capinfo Company Limited provides information technology (IT) services in the People's Republic of China. It offers online application and system integration, software development, data processing, information professional, IT planning and consultancy, IT construction implementation, IT operation and maintenance, IT outsourcing, and other services. The company also provides various industry solutions, including e-government, health care, community service, urban transportation, housing fund, public security, and cloud service solutions. Capinfo Company Limited was founded in 1998 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "1147.HK": {
        "short_name": "EDENSOFT",
        "long_name": "Edensoft Holdings Limited",
        "summary": "Edensoft Holdings Limited operates as an integrated IT solution and cloud services provider in the People's Republic of China. It provides IT infrastructure, IT implementation and supporting, and cloud services, as well as maintenance services. The company was founded in 2002 and is headquartered in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "300010.SZ": {
        "short_name": "DOUSHEN(BEIJING) E",
        "long_name": "Doushen (Beijing) Education & Technology INC.",
        "summary": "Doushen (Beijing) Education & Technology INC. provides education and information security services in China. It offers education cloud platforms, smart campus solutions and disciplinary application products in the field of K12 that target B-end users; and college entrance exam consulting services, overseas education consulting services, and online tutoring that target C-end users. The company's information security business include data security solutions, such as full data lifecycle, and industrial control security products and solutions, as well as autonomous and controllable products and solutions targeting various industries. It also provides education services for schools and educational institutions at various levels, including top-level design, consulting planning, curriculum construction, big data analysis, software development, educational resources and model research, and education; and space development, hardware support, system integration, and operation and maintenance outsourcing services. In addition, the company offers artificial intelligence technology solutions consisting of emotion calculation, identity recognition, natural language understanding, and other intelligent classroom teaching analysis; various solutions and technical services for offline classroom teaching, online one-to-one teaching, and professional scenes. The company was formerly known as Beijing Lanxum Technology Co., Ltd. and changed its name to Doushen (Beijing) Education & Technology INC. in August 2020. Doushen (Beijing) Education & Technology INC. was founded in 1999 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "300182.SZ": {
        "short_name": "BEIJING JETSEN TEC",
        "long_name": "Beijing Jetsen Technology Co., Ltd.",
        "summary": "Beijing Jetsen Technology Co., Ltd. provides audio and video technology, and film and TV content production and copyright operation services. It offers copyright operation, as well as digital culture, education, and technology products. The company provides audio and video technology solutions in the domestic radio and television, press and publication, new media, and relevant industry applications; and technology, media asset management, information security, intelligent monitoring, and media central kitchen systems. It serves TV stations, cable operators, video Websites, teleco companies, and other institutions. The company was founded in 2006 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "300271.SZ": {
        "short_name": "BEIJING THUNISOFT",
        "long_name": "Beijing Thunisoft Co., Ltd.",
        "summary": "Beijing Thunisoft Co., Ltd. provides software and information services to the government and enterprise customers in China. It provides consulting services for clients in various industries, such as courts, procuratorates, the judiciary, government, political and legal committees, taxation, etc. The company also offers products for courts, procuratorates, prisons, fiscal tax, market supervision, financial and health, general office, foundation support, and business intelligence. In addition, it provides consulting planning, project management, system integration, software development, professional training, application promotion, project quality assurance, and operation and maintenance services. The company was founded in 2001 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "300277.SZ": {
        "short_name": "SHENZHEN HIRISUN T",
        "long_name": "Shenzhen Hirisun Technology Incorporated",
        "summary": "Shenzhen Hirisun Technology Incorporated engages in power information system integration business in China. It offers electric power production information systems for production, dispatching, design, planning, and infrastructure applications; drawing management systems; production conference systems; power communication production management systems; content management platforms; network political systems; and administrative logistics systems. The company also offers communication products, including integrate voice, video, and data communications; and communication solutions, such as optical transmission network, power distribution communication network, local access network, IP routing switching network, local area network, and other networks; application integration solutions. Its products and services are used in the power industry, chain power generation, transmission, transformation, distribution, power consumption and dispatching, etc. The company was founded in 2000 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "300290.SZ": {
        "short_name": "BRINGSPRING SCIENC",
        "long_name": "Bringspring Science and Technology Co., Ltd.",
        "summary": "Bringspring Science and Technology Co., Ltd. focuses on health data and cloud services in China. It provides cloud computing, big data, Internet of Things, and artificial intelligence services. The company was founded in 2005 and is based in Shenyang, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenyang"
    },
    "300297.SZ": {
        "short_name": "BLUEDON INFORMATIO",
        "long_name": "Bluedon Information Security Technologies Co.,Ltd.",
        "summary": "Bluedon Information Security Technologies Co.,Ltd. provides information security solutions in China. The company offers physical and industrial control, network and application, cloud computing and big data, mobile, risk monitor and security management, e-commerce and individual, urban emergency and production emergency, and secrecy security products. It serves government, education, military, emergency response, telecommunication, finance, energy, transportation, health care, and manufacturing sectors. Bluedon Information Security Technologies Co.,Ltd. was founded in 1999 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "300348.SZ": {
        "short_name": "SHENZHEN SUNLINE T",
        "long_name": "Shenzhen Sunline Tech Co., Ltd.",
        "summary": "Shenzhen Sunline Tech Co., Ltd. operates as a banking software and technology services company worldwide. It offers core banking, digital banking, credit risk management, and bank card business solutions, as well as financial big data analytics and total value management systems. The company also provides a range of services, such as IT planning and consultation, IT operations and maintenance, banking system tests, hardware installation and migration, and training services. It offers its solutions to banks, insurance companies, and unit trusts. The company was founded in 2002 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "300468.SZ": {
        "short_name": "SHENZHEN FORMS SYN",
        "long_name": "Shenzhen Forms Syntron Information Co., Ltd.",
        "summary": "Shenzhen Forms Syntron Information Co., Ltd. provides enterprise-class software products and solutions to financial institutions in China and internationally. It primarily offers products and solutions for blockchain and platform universe, as well as Lego banking products, such as iLoan, iSaving, and iWealth. The company also provides consumer finance loan core and credit approval systems, and Internet retail credit platform; and channel products and solutions comprising unified payment gateway, branch sales, personal online banking, mobile banking, faster payment systems, corporate Internet banking, mobile account opening, and smart branch terminal. In addition, it offers management products and solutions, including decision support, risk management, financial management, management accounting system, process monitoring, abnormal transaction monitoring, customer management, and customer transaction management. The company was founded in 2003 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "300513.SZ": {
        "short_name": "BEIJING E-TECHSTAR",
        "long_name": "Beijing E-Techstar Co.,Ltd.",
        "summary": "Beijing E-Techstar Co.,Ltd. provides big data integrated solutions in China. The company offers integrated monitoring solutions and software products in the fields of data acquisition; communication planning and design, and broadband power line carrier chip products in the field of data transmission; and intelligent control center solutions and comprehensive data in the field of data storage, management, and processing. It also provides big data visualization intelligent analysis platforms, such as VBI and Zhili V3C in the field of data analysis and application; real-time database platforms; and energy and intelligence services for big data value conversion, as well as power safety products, financial payment products, V3C, IcsBOX, screenmate, and environmental monitoring products. The company's solutions comprise industry based applications, such as power, communication, and big data intelligence industries, as well as smart centers, integrated energy management, and intelligent environment management sectors. The company was founded in 2000 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "300605.SZ": {
        "short_name": "HENGFENG INFORMATI",
        "long_name": "Hengfeng Information Technology Co., Ltd.",
        "summary": "Hengfeng Information Technology Co., Ltd. operates as a smart city information technology service provider in China. The company provides smart city industry solutions for customers in the fields of urban services, public safety, and people's livelihood. It offers design consultation, software development, system integration and management, and operation and maintenance services. The company also provides smart government software, smart building software, industry software, IOT products, smart city operation management platform, and smart retirement solutions. Hengfeng Information Technology Co., Ltd. was founded in 1994 and is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Fuzhou"
    },
    "300608.SZ": {
        "short_name": "SI-TECH INFORMATIO",
        "long_name": "Beijing Si-Tech Information Technology Co., Ltd.",
        "summary": "Beijing Si-Tech Information Technology Co., Ltd. provides telecom products and solutions, cloud computing and big data technologies, and mobile Internet solutions in China. It serves telecom companies, governments, and SME customers. The company was founded in 1995 and is based in Beijing, China. Beijing Si-Tech Information Technology Co., Ltd. is a subsidiary of Digital China Software Limited.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "300674.SZ": {
        "short_name": "YUSYS TECHNOLOGIES",
        "long_name": "Yusys Technologies Co., Ltd.",
        "summary": "Yusys Technologies Co., Ltd. provides IT solutions to banking-based financial institutions in China. It offers consulting, software products, user experience design, software development and implementation, operation and maintenance, test, and system integration services. The company provides business products for core banking system, financial intermediations, and credit operation systems; channel products for channel management systems, counter systems, mobile banking, direct banking, telephone bank/call center, and self-service banking; and management products for back-office management solutions, business intelligence, and customer relationship management. Yusys Technologies Co., Ltd. was founded in 1999 is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "300738.SZ": {
        "short_name": "GUANGDONG AOFEI DA",
        "long_name": "Guangdong Aofei Data Technology Co., Ltd.",
        "summary": "Guangdong Aofei Data Technology Co., Ltd. engages in the data center and communication integrated operation businesses in China. It offers server hosting and rental, professional cloud computing and big data application, and BGP interconnection services. The company is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "300872.SZ": {
        "short_name": "TANSUN TECHNOLOGY",
        "long_name": "Tansun Technology Co., Ltd.",
        "summary": "Tansun Technology Co., Ltd. provides long-term information technology (IT) solutions and services for financial industry customers in China and internationally. It offers supply chain finance consulting services, transaction banking solutions, integrated risk management systems, retail bank IT architecture consulting services, retail credit product delivery systems, business consulting and joint operating platforms, performance management consulting solutions, business intelligence and big data applications, micro service container cloud platforms, and workflow engines. The company also provides TREE, a financial business application; professional IT planning consultation and project implementation services; and wind control models for retail credit business, such as credit granting, lending, and post-lending. In addition, it offers risk control, open banking, and data governance solutions, as well as industrial financial platforms; automated testing, non-functional testing, big data platform testing, data migration validation, and demand labeling solutions, as well as testing consultation services. It serves central banks, political banks, state-owned banks, joint-stock banks, local commercial banks, and non-banking financial institutions. Tansun Technology Co., Ltd. was founded in 2003 and is based in Lhasa, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Lhasa"
    },
    "3680.HK": {
        "short_name": "SUOXINDA",
        "long_name": "Suoxinda Holdings Limited",
        "summary": "Suoxinda Holdings Limited develops and delivers data and artificial intelligence solutions to the banks and financial institutions in the People's Republic of China and Hong Kong. Its data solutions include software development, data analysis, and system integration and customization services, as well as data integration, storage, cleaning, and processing services. The company also provides Suoxinda precision marketing solution, risk management solution, intelligent label solution, customer voice solution, and supply chain management solution, as well as portrait solution. In addition, it operates marketing management platform, anti-fraud platform, and label management platform; and offers decision engine product, a component embedded in the application program. Further, the company provides consulting services for deep learning, natural language processing, image recognition, data modeling and analysis, data governance, and data visualization technology. Additionally, it sells software and hardware products; offers installation of equipment and software; and provides information technology maintenance and support services. The company was founded in 2004 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "600728.SS": {
        "short_name": "PCI-SUNTEK TECHNOLOGY CO LTD",
        "long_name": "PCI-Suntek Technology Co.,Ltd.",
        "summary": "PCI-Suntek Technology Co.,Ltd. provides artificial intelligence technology and products in China. The company offers video and image cloud plus application platform; face cloud platform; vehicle cloud platform; video networking monitoring, operation, and maintenance platform; one camera one file system; integrated platform of gridded social governance; video structure analysis platform; smart police integrated application platform; video structure information database; and integrated platform of video, data, and map application for use in urban public safety and urban traffic management. It also offers intelligent public security and rail transportation solutions; and intelligent transportation systems. In addition, the company provides value-added services, such as networking and cloud computing products and services, basic framework outsourcing services, operational services, and other services; and services related to IT products, sales, system integration, training, consulting, and after-sales for customers in areas, such as government, finance, telecommunication, manufacturing, education, and IT. Further, it offers commercial intelligent products, intelligent multi-payment solutions, and Internet plus information services. The company was formerly known as Suntek Technology Co., Ltd. PCI-Suntek Technology Co.,Ltd. was founded in 1986 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "600751.SS": {
        "short_name": "HNA TECHNOLOGY CO LTD",
        "long_name": "HNA Technology Co., Ltd.",
        "summary": "HNA Technology Co., Ltd., through its subsidiaries, provides IT distribution and supply chain services. It provides HNA cloud and artificial intelligence platform, as well as technology solutions. The company was formerly known as Tianjin Tianhai Investment Co., Ltd and changed its name to HNA Technology Co., Ltd. in April 2018. HNA Technology Co., Ltd. was founded in 1992 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "603138.SS": {
        "short_name": "BEIJING VASTDATA TECHNOLOGY CO ",
        "long_name": "Beijing Vastdata Technology Co., Ltd.",
        "summary": "Beijing Vastdata Technology Co., Ltd. provides data technology services in China. It offers data storage and security, database and data management, data audit, database machine, cloud integration, and other related services, as well as database as a service cloud platform. The company was founded in 2007 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "603559.SS": {
        "short_name": "ZHONGTONGGUOMAI COMMUNICATION C",
        "long_name": "Zhongtong Guomai Communication Co., Ltd.",
        "summary": "Zhongtong Guomai Communication Co., Ltd. primarily provides communications network engineering consulting services. The company also involved in the construction of intelligent building projects, and installation and service of cable television projects, as well as survey, design and construction, and communication network system activities. The company was founded in 1947 and is based in Changchun, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Changchun"
    },
    "603881.SS": {
        "short_name": "SHANGHAI ATHUB CO LTD",
        "long_name": "Shanghai AtHub Co., Ltd.",
        "summary": "Shanghai AtHub Co., Ltd. provides Internet infrastructure services in China and internationally. It offers wholesale data center services that are primarily based on the complex and diverse application deployment requirements of large data center users, such as large Internet companies or financial institutions; and customized planning, design, system integration, and operations management services to end users. The company was founded in 2009 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "688080.SS": {
        "short_name": "BEIJING INHAND NETWORKS TECHNOL",
        "long_name": "Beijing InHand Networks Technology Co., Ltd.",
        "summary": "Beijing InHand Networks Technology Co., Ltd. provides industrial Internet of things (IoT) systems and solutions. The company provides IoT edge computing gateways, industrial LTE routers, vehicle gateways, industrial modems, industrial computers, industrial Ethernet switches, and IoT management platforms, as well as inconnect secure remote connection cloud services. It offers IoT solutions for smart grid, smart manufacturing, transportation, healthcare, Retail, environment, smart city, remote machine monitoring, smart vending, and energy markets. The company was founded in 2001 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "688088.SS": {
        "short_name": "ARCSOFT CORPORATION LTD",
        "long_name": "ArcSoft Corporation Limited",
        "summary": "ArcSoft Corporation Limited operates as an algorithm and software solution provider in the computer vision industry worldwide. It offers image and video solutions for front and rear-facing smartphone cameras to assist phone manufacturers; camera solutions, including performance optimizations, network SDKs, and full customizable applications for various platforms; motion sensing controller solutions; refrigerator software; automobile digital video recorders solutions; projector solutions; and live video broadcasting apps. The company is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "688100.SS": {
        "short_name": "WILLFAR INFORMATION TECHNOLOGY ",
        "long_name": "Willfar Information Technology Co., Ltd.",
        "summary": "Willfar Information Technology Co., Ltd. researches, develops, produces, and sells utility measurement equipment. The company offers meter data management terminals, smart water meters, smart gas meters, electric power distribution indicator, and electrical energy efficiency management, as well as energy saving products, such as solar powered lights. Willfar Information Technology Co., Ltd. was founded in 2004 and is based in Changsha, China. Willfar Information Technology Co., Ltd. is a subsidiary of Wasion Group Holdings.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Changsha"
    },
    "688500.SS": {
        "short_name": "HCR CO LTD",
        "long_name": "HCR Co., Ltd",
        "summary": "HCR Co., Ltd. provides various data intelligence solutions in China. It offers solutions in field of data insight and focusing on the essence of business. The company assists the government to enhance the efficiency of management; and help enterprises to enhance efficiency and increase the revenue, make accurate decision, and reshape their business with the whole data driven and the artificial intelligence. It serves automobile, internet technology, consumer durable, healthcare, industrial sector, tourism, public affairs, telecom, retail, FMCG, finance, tobacco, environmental protection, and education industries. The company was founded in 2008 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "8235.HK": {
        "short_name": "CCID CONSULTING",
        "long_name": "CCID Consulting Company Limited",
        "summary": "CCID Consulting Company Limited provides consulting services in the People's Republic of China. The company operates through Management and Strategic Consultancy Services, Market Consultancy Services, Information Engineering Supervision Services, and Other segments. The Management and Strategic Consultancy Services segment offers services, which include the application and implementation of enterprise management information digitalization, which incorporates the functions of business process re-engineering, enterprise resource planning, customer relationship management, supply chain management, call center and other electronic business pattern designs, marketing, brand name promotion, public relationship, and advertising. The Market Consultancy Services segment provides standard research on specific sectors and tailor-made research services. The Information Engineering Supervision Services segment offers information engineering supervision services to the undertaken projects. The Other segment provides data information management and training services. It also offers investment and economic consultancy services. CCID Consulting Company Limited was founded in 2000 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "900938.SS": {
        "short_name": "HNA TECHNOLOGY CO LTD",
        "long_name": "HNA Technology Co., Ltd.",
        "summary": "HNA Technology Co., Ltd., through its subsidiaries, provides IT distribution and supply chain services. It provides HNA cloud and artificial intelligence platform, as well as technology solutions. The company was formerly known as Tianjin Tianhai Investment Co., Ltd and changed its name to HNA Technology Co., Ltd. in April 2018. HNA Technology Co., Ltd. was founded in 1992 and is headquartered in Shanghai, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "CCRC": {
        "short_name": "China Customer Relations Center",
        "long_name": "China Customer Relations Centers, Inc.",
        "summary": "China Customer Relations Centers, Inc. provides business process outsourcing services for transportation, e-commerce, banks and insurance, and telecommunications companies in the People's Republic of China. It offers voice-based and online-based customer care services, including customer relationship management, technical support, sales, customer retention, marketing surveys, and research. China Customer Relations Centers, Inc. was incorporated in 2014 and is headquartered in Taian, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Taian"
    },
    "CD": {
        "short_name": "Chindata Group Holdings Limited",
        "long_name": "Chindata Group Holdings Limited",
        "summary": "Chindata Group Holdings Limited provides carrier-neutral hyper scale data center solutions in China, India, and Southeast Asia markets. It offers colocation and managed, energy procurement and transmission, infrastructure, and IT and network services. The company was formerly known as BCPE Bridge Stack Limited and changed its name to Chindata Group Holdings Limited in April 2020. Chindata Group Holdings Limited was founded in 2015 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "CFTLF": {
        "short_name": "CHINASOFT INTERNATIONAL LIMITED",
        "long_name": "Chinasoft International Limited",
        "summary": "Chinasoft International Limited, together with its subsidiaries, develops and provides information technology (IT) solutions, IT outsourcing, and training services. It operates through Technical Professional Services Group and Internet IT Services Group segments. The company offers ResourceOne and TopLink/TSA+ software, and Ark big data middleware platforms. It also provides software platform, strategy, business and IT consulting, big data products and services, industry and general application software and solution development, mobile Internet and terminal product development services, product engineering, and application development and management services, as well as enterprise application, system integration, outsourcing, business process outsourcing, and other IT services. In addition, the company offers Internet IT services comprising IT crowdsourcing, cloud, Solution as a Service, and business services. It serves financial services and banking, insurance and securities, telecommunications and Internet, high-technology business, manufacturing logistics, public utilities, and training industries, as well as to the government in the People's Republic of China, the United States, Japan, Malaysia, India, and internationally. The company was founded in 2000 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "DRGV": {
        "short_name": "DRAGON CAPITAL GROUP CORPORATIO",
        "long_name": "Dragon Capital Group, Corp.",
        "summary": "Dragon Capital Group, Corp., through its subsidiaries, provides software solutions for businesses primarily in the People's Republic of China and the United States. It offers various software applications, including network software, gas pipeline risk assessment system, e-business software development, financial and enterprise information management systems, and computerized automation control applications for commercial and residential buildings, commercial third-generation wireless applications, and mobile business solutions, and multi imaging applications. The company develops commercial 3G wireless applications and mobile business solutions for the human resources, mobile banking, food, beverage, and entertainment industries. In addition, it provides an ERS software system for enterprises to manage accounting, distribution, inventory, and sales; and sells and distributes electronic equipments and devices, and technology solutions to financial institutions, telecommunication companies, hospitals, supermarkets, airports, railway stations, and various government agencies. Additionally, it provides support services in general business consulting, formation of joint ventures, access to capital markets, merger and acquisition transactions consulting, business valuation, and revenue growth strategies. The company was formerly known as Dragon Venture and changed its name to Dragon Capital Group, Corp. in March 2005. Dragon Capital Group, Corp. was incorporated in 1977 and is headquartered in Shanghai, China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    },
    "GDS": {
        "short_name": "GDS Holdings Limited",
        "long_name": "GDS Holdings Limited",
        "summary": "GDS Holdings Limited, together with its subsidiaries, develops and operates data centers in the People's Republic of China. The company provides colocation, managed hosting, and managed cloud services, as well as consulting services to the cloud, internet and banking industries. The company serves cloud service providers, Internet companies, financial institutions, telecommunications and IT service providers, and large domestic private sector and multinational corporations. It has a strategic partnership with GIC Private Limited to develop and operate hyperscale build-to-suit data centers in China. The company was founded in 2001 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    },
    "GLG": {
        "short_name": "TD Holdings, Inc.",
        "long_name": "TD Holdings, Inc.",
        "summary": "TD Holdings, Inc. focuses on the new commodities trading business. The company was formerly known as Bat Group, Inc. and changed its name to TD Holdings, Inc. in March 2020. TD Holdings, Inc. is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "TSYHF": {
        "short_name": "TRAVELSKY TECHNOLOGY",
        "long_name": "TravelSky Technology Limited",
        "summary": "TravelSky Technology Limited provides information technology solutions for aviation and travel industry in the People's Republic of China. It primarily offers aviation information technology (AIT), distribution information technology, clearing, and accounting and settlement services. The company's AIT services consist of electronic travel distribution services, including inventory control system, computer reservation system, and airport passenger processing system services, as well as other related information technology solutions. It also provides cargo management services, and sells and installs related information systems; computer hardware and software development, and data network services; and Internet exchange platform services. In addition, the company is involved in the research, development, marketing, and sale of travel distribution software to travel industry. TravelSky Technology Limited was incorporated in 2000 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "TSYHY": {
        "short_name": "TRAVELSKY TECHNOLOGY",
        "long_name": "TravelSky Technology Limited",
        "summary": "TravelSky Technology Limited provides information technology solutions for aviation and travel industry in the People's Republic of China. It primarily offers aviation information technology (AIT), distribution information technology, clearing, and accounting and settlement services. The company's AIT services consist of electronic travel distribution services, including inventory control system, computer reservation system, and airport passenger processing system services, as well as other related information technology solutions. It also provides cargo management services, and sells and installs related information systems; computer hardware and software development, and data network services; and Internet exchange platform services. In addition, the company is involved in the research, development, marketing, and sale of travel distribution software to travel industry. TravelSky Technology Limited was incorporated in 2000 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "TVL.F": {
        "short_name": "TRAVELSKY TECHNOLOGY HYC1",
        "long_name": "TravelSky Technology Limited",
        "summary": "TravelSky Technology Limited provides information technology solutions for aviation and travel industry in the People's Republic of China. It primarily offers aviation information technology (AIT), distribution information technology, clearing, and accounting and settlement services. The company's AIT services consist of electronic travel distribution services, including inventory control system, computer reservation system, and airport passenger processing system services, as well as other related information technology solutions. It also provides cargo management services, and sells and installs related information systems; computer hardware and software development, and data network services; and Internet exchange platform services. In addition, the company is involved in the research, development, marketing, and sale of travel distribution software to travel industry. TravelSky Technology Limited was incorporated in 2000 and is based in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "VNET": {
        "short_name": "21Vianet Group, Inc.",
        "long_name": "21Vianet Group, Inc.",
        "summary": "21Vianet Group, Inc. provides carrier and cloud-neutral Internet data center services to Internet companies, government entities, blue-chip enterprises, and small-to mid-sized enterprises in the People's Republic of China. The company operates in two segments, Hosting and Related Services, and Managed Network Services. It offers hosting and related services to house servers and networking equipment in its data centers, and connects them through a data transmission network. The company's hosting and related services include managed hosting services that offer data center space to house its customers' servers and networking equipment, and provide tailored server administration services; and interconnectivity services that enable customers to connect their servers with Internet backbones and other networks through its border gateway protocol network or single-line, dual-line, or multiple-line network. Its hosting and related services also comprise cloud services that enable businesses to run their applications over the Internet using its IT infrastructure; virtual private network services; Hybrid IT Services, which provide customers with a complete package of infrastructure service offerings; and other value-added services, such as firewall, server load balancing, data backup and recovery, data center management, server management, and backup server services. In addition, the company provides traffic charts and analysis, gateway monitoring for servers, domain name system setup, defense mechanism against distributed denial of service attacks, basic setting of switches and routers, and virus protections; and managed network service. As of December 31, 2019, it operated 26 self-built and 51 partnered data centers located in approximately 20 cities with 36,291 cabinets. It has a strategic partnership with Microsoft Corporation. 21Vianet Group, Inc. was founded in 1999 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "WETG": {
        "short_name": "WETRADE GRP INC",
        "long_name": "WeTrade Group Inc.",
        "summary": "WeTrade Group Inc. provides an online membership-based e-commerce platform services in the People Republic of China. Its platform provides information and bookings related to hotels, flights, travelling packages, and other travelling products. The company was founded in 2019 and is based in Beijing, the People Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    }
}