{
    "C53.F": {
        "short_name": "CHINA REINSU.GROUP.H YC 1",
        "long_name": "China Reinsurance (Group) Corporation",
        "summary": "China Reinsurance (Group) Corporation, together with its subsidiaries, operates as a reinsurance company in the People's Republic of China and internationally. It operates through Property and Casualty Reinsurance, Life and Health Reinsurance, Primary Property and Casualty Insurance, Asset Management, and Others segments. The company offers reinsurance products, including motor, commercial and household property, engineering, marine hull, cargo, liability, credit and guarantee, personal accident, health, agriculture, life and annuity, space and aviation, energy, nuclear, etc. It also provides asset management, insurance brokerage, risk evaluation and management, underwriting agency, risk advisory, management consulting, and investment management services; invests in private equities, debts/debt investment plans/trusts, and loans; and issues bonds. In addition, the company is involved in the e-commerce business; and offers consulting services. It offers its insurance products for individual and corporate customers. The company was founded in 1949 and is headquartered in Beijing, the People's Republic of China. China Reinsurance (Group) Corporation is a subsidiary of Central Huijin Investment Ltd.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Insurance - Reinsurance",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "SNAS": {
        "short_name": "SINO ASSURANCE INC",
        "long_name": "Sino Assurance, Inc.",
        "summary": "Sino Assurance, Inc. provides surety and tendering guarantees, and financial services to government agencies, commercial companies, and individuals in the People's Republic of China. It offers construction guarantees, such as bid guarantees, performance guarantees, payment guarantees, advance payment guarantees, performance guarantees of sub-contract, performance bond guarantees, bank guarantees, quality warranty guarantees, and guarantees for credit certification, as well as employee guarantees. The company is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance - Reinsurance",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Shenzhen"
    }
}