{
    "000017.SZ": {
        "short_name": "SHENZHEN CHINA BIC",
        "long_name": "Shenzhen China Bicycle Company (Holdings) Limited",
        "summary": "Shenzhen China Bicycle Company (Holdings) Limited engages in the production, assembly, purchase, and sale of bicycles and electric bicycles. It offers bicycles under the EMMELLE brand. The company also engages in the lithium battery material, and jewelry and gold businesses. It offers its products through various e-commerce platforms. Shenzhen China Bicycle Company (Holdings) Limited is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518023",
        "website": "http://cbcbicycle.diytrade.com/sdp/628227/4/home/0.html",
        "market_cap": "Micro Cap"
    },
    "002502.SZ": {
        "short_name": "DINGLONG CULTURE C",
        "long_name": "Huawei Culture Co.,Ltd.",
        "summary": "Huawei Culture Co.,Ltd. engages in the TV and animation businesses in the People's Republic of China and internationally. It is also involved in the production and releasing of teleplay, supplemented by online teleplays; and research and development, and operation of mobile online games. In addition, the company develops IP derivative products; and manufactures toy products. Further, it invests in the culture, film, Internet, industry fund, financial services, and high and new technology industries; and researches and develops animations. The company was formerly known as Huawei Technology Co., Ltd. and changed its name to Huawei Culture Co.,Ltd. in May 2016. Huawei Culture Co.,Ltd. was founded in 1997 and is headquartered in Shantou, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shantou",
        "zipcode": "515800",
        "website": "http://www.huawei-stock.com",
        "market_cap": "Small Cap"
    },
    "002575.SZ": {
        "short_name": "GUANGDONG QUNXING",
        "long_name": "Guangdong Qunxing Toys Joint-Stock Co., Ltd.",
        "summary": "Guangdong Qunxing Toys Joint-Stock Co., Ltd. engages in the professional design, research and development, production, and sale of plastic electronic toys in China. It offers electric buggies, cartoon cars, and tricycles; computer learning machines; electric cars; infant child toys; toy phones; and other products. The company was founded in 1991 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.qunxingtoys.net",
        "market_cap": "Small Cap"
    },
    "002605.SZ": {
        "short_name": "SHANGHAI YAOJI TEC",
        "long_name": "Shanghai Yaoji Technology Co., Ltd.",
        "summary": "Shanghai Yaoji Technology Co., Ltd. produces and markets playing cards in China and internationally. It also produces and prints books. The company was founded in 1994 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201804",
        "website": "http://www.yaojipoker.com",
        "market_cap": "Small Cap"
    },
    "002614.SZ": {
        "short_name": "XIAMEN COMFORT SCI",
        "long_name": "Ogawa Smart Healthcare Technology Group Co., Ltd.",
        "summary": "Ogawa Smart Healthcare Technology Group Co., Ltd. researches, develops, manufactures, and sells health massage appliances in China and internationally. It provides massage chairs and apparatuses, air purifiers, fresh air ventilators, blood pressure monitors, glucose meters, oximeters, etc. The company offers its products primarily under the OGAWA, FUJI, FUJIMEDIC, COZZIA, and MEDISANA brand names. The company was formerly known as Xiamen Comfort Science&Technology Group Co., Ltd. and changed its name to Ogawa Smart Healthcare Technology Group Co., Ltd. in May 2017. The company was founded in 1996 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": null,
        "website": "http://www.easepal.com.cn",
        "market_cap": "Small Cap"
    },
    "002678.SZ": {
        "short_name": "GUANGZHOU PEARL R.",
        "long_name": "Guangzhou Pearl River Piano Group Co.,Ltd",
        "summary": "Guangzhou Pearl River Piano Group Co.,Ltd. manufactures and sells pianos in China. The company also exports its products to approximately 100 countries and regions. It offers pianos under the Kayserburg, Ritmuller, Jingzhu, and Pearl River brand names. The company was founded in 1967 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510388",
        "website": "http://www.pearlriverpiano.com",
        "market_cap": "Small Cap"
    },
    "002862.SZ": {
        "short_name": "SHIFENG CULTURAL D",
        "long_name": "Shifeng Cultural Development Co., Ltd.",
        "summary": "Shifeng Cultural Development Co., Ltd. manufactures and sells toys in China and internationally. The company offers its products in various categories, such as animation IP derivative, smart series, remote control series, car model, baby series, and others. Shifeng Cultural Development Co., Ltd. was founded in 1992 and is based in Shantou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shantou",
        "zipcode": "515800",
        "website": "http://www.sunfuntoys.com",
        "market_cap": "Micro Cap"
    },
    "002899.SZ": {
        "short_name": "IMPULSE (QINGDAO)",
        "long_name": "Impulse (Qingdao) Health Tech Co.,Ltd.",
        "summary": "Impulse (Qingdao) Health Tech Co.,Ltd. manufactures and sells fitness equipment worldwide. It offers treadmills, upright and recumbent bikes, and indoor cycles; and elliptical, strength, group training, and outdoor fitness equipment. The company also provides after-sales services. It serves fitness clubs, hotels, military and police units, enterprises, institutions, and families. The company is based in Qingdao, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": null,
        "website": "http://www.impulsefitness.com",
        "market_cap": "Micro Cap"
    },
    "0HO.F": {
        "short_name": "HAICHANG OCEA.P.H.DL-0001",
        "long_name": "Haichang Ocean Park Holdings Ltd.",
        "summary": "Haichang Ocean Park Holdings Ltd., together with its subsidiaries, develops, constructs, and operates theme parks and ancillary commercial properties in the People's Republic of China. The company operates in two segments, Park Operations and Property Development. The company operates 10 theme parks located in Shanghai, Sanya, Dalian, Tianjin, Qingdao, Chengdu, Wuhan, Chongqing, and Yantai. It also develops and invests in properties; and operates hotels and a small size playground. In addition, the company provides tourism consulting, and construction project design and consulting services. Further, it is involved in goods and technology import and export, marine biotechnology development, financing lease, and property management business; and the provision of technical support services relating to aquarium. The company was formerly known as Haichang Holdings Ltd. and changed its name to Haichang Ocean Park Holdings Ltd. in July 2015. Haichang Ocean Park Holdings Ltd. was founded in 2001 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.haichangoceanpark.com",
        "market_cap": "Micro Cap"
    },
    "1086.HK": {
        "short_name": "GOODBABY INTL",
        "long_name": "Goodbaby International Holdings Limited",
        "summary": "Goodbaby International Holdings Limited, an investment holding company, researches, designs, develops, manufactures, markets, and sells durable juvenile products in Europe, North America, Mainland China, and internationally. It offers children's car safety seats, strollers, apparels and home textile products, feeding products, nursing and personal care products, cribs, bicycles and tricycles, and other children products. The company also provides safety belts, cloth sets, and car components for children; child cloth beds; bath chairs for children; stadium chairs; sports utilities, e-cars, and wooden products; and child carrying systems, pushchairs, high chairs, and other products for children. In addition, it offers IT services and a share service center; testing services for children's products, tools, and electronic products; and advisory services for the risk valuation of product quality. Further, the company is involved in the distribution and sale of car safety seats, infant strollers, and other parenting products; and wholesale and retail of children's products. It also operates flagship stores. The company provides its products under the CYBEX, gb, Evenflo, RollPlay, CBX, Exer Saucer, Urbini, and Happy Dino brands. The company was founded in 1989 and is headquartered in Kunshan, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Kunshan",
        "zipcode": "215331",
        "website": "http://www.gbinternational.com.hk",
        "market_cap": "Small Cap"
    },
    "1361.HK": {
        "short_name": "361 DEGREES",
        "long_name": "361 Degrees International Limited",
        "summary": "361 Degrees International Limited, an investment holding company, manufactures and trades in sporting goods in the People's Republic of China. The company operates in two segments, Adults and Kids. It offers adult and children footwear, apparels, and accessories for sports and casual life under the 361 core and 361 Kids brands; and ski and outdoor sportswear products under the ONE WAY brand. The company also manufactures and trades in shoes soles; trades in children sporting goods; and operates a gas station. As of December 31, 2020, it operated a network of 5,165 stores under the 361 core brand name. The company also sells products through its 361sport.com Website; other e-commerce platforms, including Tmall, Taobao, and JD; and authorized retailers and distributors. 361 Degrees International Limited was founded in 2003 and is headquartered in Xiamen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361009",
        "website": "http://www.361sport.com",
        "market_cap": "Small Cap"
    },
    "200017.SZ": {
        "short_name": "SHENZHEN CHINA BIC",
        "long_name": "Shenzhen China Bicycle Company (Holdings) Limited",
        "summary": "Shenzhen China Bicycle Company (Holdings) Limited engages in the production, assembly, purchase, and sale of bicycles and electric bicycles. It offers bicycles under the EMMELLE brand. The company also engages in the lithium battery material, and jewelry and gold businesses. It offers its products through various e-commerce platforms. Shenzhen China Bicycle Company (Holdings) Limited is based in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518023",
        "website": "http://cbcbicycle.diytrade.com/sdp/628227/4/home/0.html",
        "market_cap": "Micro Cap"
    },
    "2020.HK": {
        "short_name": "ANTA SPORTS",
        "long_name": "ANTA Sports Products Limited",
        "summary": "ANTA Sports Products Limited designs, develops, manufactures, and markets sporting footwear, apparel, and accessories worldwide. The company offers sportswear, including running, cross-training, basketball, soccer, boxing, winter sports, boxing, taekwondo, gymnastics, weightlifting, wrestling, outdoor sports, women's fitness, and skiing products, as well as sports fashion clothing, kid's sports fashion clothing and sportswear, and leisure footwear products under the FILA, FILA KIDS, FILA FUSION, KINGKOW, KOLON SPORT, SPRANDI, FILA FUSION, ANTA, DESCENTE, and ANTA KIDS brands. It also provides management, product design, logistics, and information technology services; manufactures shoe soles; holds trademarks; and develops and manages properties. The company offers its products through street stores, shopping malls, department stores, outlet stores, and e-commerce platforms, as well as online. As of December 31, 2020, it operated 9,922 ANTA stores; 2,006 FILA stores; 175 DESCENTE stores; and 157 KOLON SPORT stores. The company also exports and imports sporting shoes. The company was founded in 1994 and is headquartered in Jinjiang, the People's Republic of China. ANTA Sports Products Limited is a subsidiary of Anta International Group Holdings Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Jinjiang",
        "zipcode": "362212",
        "website": "http://www.anta.com",
        "market_cap": "Large Cap"
    },
    "2255.HK": {
        "short_name": "HAICHANG HLDG",
        "long_name": "Haichang Ocean Park Holdings Ltd.",
        "summary": "Haichang Ocean Park Holdings Ltd., together with its subsidiaries, develops, constructs, and operates theme parks and ancillary commercial properties in the People's Republic of China. The company operates in two segments, Park Operations and Property Development. The company operates 10 theme parks located in Shanghai, Sanya, Dalian, Tianjin, Qingdao, Chengdu, Wuhan, Chongqing, and Yantai. It also develops and invests in properties; and operates hotels and a small size playground. In addition, the company provides tourism consulting, and construction project design and consulting services. Further, it is involved in goods and technology import and export, marine biotechnology development, financing lease, and property management business; and the provision of technical support services relating to aquarium. The company was formerly known as Haichang Holdings Ltd. and changed its name to Haichang Ocean Park Holdings Ltd. in July 2015. Haichang Ocean Park Holdings Ltd. was founded in 2001 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.haichangoceanpark.com",
        "market_cap": "Small Cap"
    },
    "2331.HK": {
        "short_name": "LI NING",
        "long_name": "Li Ning Company Limited",
        "summary": "Li Ning Company Limited engages in the research and development, design, manufacture, marketing, distribution, and retail of sporting goods in the People's Republic of China. The company offers sporting goods, including footwear, apparel, equipment, and accessories for professional and leisure purposes primarily under the LI-NING brand. It also develops, manufactures, markets, distributes, and/or sells outdoor sports products under the AIGLE brand; table tennis under the Double Happiness brand name; fashionable fitness products for dance and yoga under the Danskin brand; and badminton under the Kason brand name. As of December 31, 2020, the company operated 6,933 conventional stores, flagship stores, China LI-NING stores, factory outlets, and discount stores under the LI-NING brand. Li Ning Company Limited was founded in 1990 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101111",
        "website": "http://www.lining.com",
        "market_cap": "Large Cap"
    },
    "300005.SZ": {
        "short_name": "TOREAD HOLDINGS GR",
        "long_name": "Toread Holdings Group Co., Ltd.",
        "summary": "Toread Holdings Group Co., Ltd. provides outdoor products in China. It offers children's outdoor equipment, waterproof walking shoes, jackets, ski caps, windproof and splash proof down jackets, polar camp down jackets, outdoor running T-shirts, running and trekking pants, hiking shoes, windproof ski gloves, snowboard suits, trousers, backpacks, moisture pads, tents, folding table and chair sets, and canvas hammock and outdoor sports shoes. The company was formerly known as Beijing Toread Outdoor Products Co., Ltd. and changed its name to Toread Holdings Group Co., Ltd. in July 2015. Toread Holdings Group Co., Ltd. was founded in 1999 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.toread.com.cn",
        "market_cap": "Small Cap"
    },
    "300043.SZ": {
        "short_name": "RASTAR GROUP",
        "long_name": "Rastar Group",
        "summary": "Rastar Group manufactures and sells licensed model cars in China. It provides RC and die cast cars, ride-on bikes, and baby safety car seats under the RASTAR and Rastar Baby brands. The company exports its products to approximately 47 countries, primarily Europe, Japan, the United States, Australia, Singapore, South Korea, and Hong Kong. Rastar Group was founded in 2000 and is based in Shantou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shantou",
        "zipcode": null,
        "website": "http://www.rastar.cn",
        "market_cap": "Small Cap"
    },
    "300123.SZ": {
        "short_name": "YAGUANG TECHNOLOGY",
        "long_name": "YaGuang Technology Group Company Limited",
        "summary": "YaGuang Technology Group Company Limited engages in the design, research, development, manufacture, sale, and service of composite and steel-FRP boats and yachts primarily in china. The company provides business yachts, special boats, commercial vessels, government boats, and super yachts. It also offers plan design, manufacture, and maintenance services. The company was formerly known as Sunbird Yacht Co., Ltd. and changed its name to YaGuang Technology Group Company Limited in January 2018. YaGuang Technology Group Company Limited was founded in 2003 and is based in Yuanjiang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yuanjiang",
        "zipcode": "413100",
        "website": "http://www.cnsunbird.com",
        "market_cap": "Small Cap"
    },
    "300144.SZ": {
        "short_name": "SONGCHENG PERFORMA",
        "long_name": "Songcheng Performance Development Co.,Ltd",
        "summary": "Songcheng Performance Development Co.,Ltd operates in the performing arts industry in China. The company operates tourism resorts and theme parks; and performs art shows under Songcheng and the Romance Show Series brand names. It also provides leisure tourism, live entertainment, and online entertainment services. Songcheng Performance Development Co.,Ltd operates 10 tourism resorts and 30 theme parks in Hangzhou, Sanya, Lijiang, Jiuzhai, Shanghai, Guilin, Zhangjiajie, Xian, Shanghai, Foshan, Australia, etc. The company was formerly known as Hangzhou Songcheng Tourism Development Co.,Ltd. and changed its name to Songcheng Performance Development Co.,Ltd in April 2014. Songcheng Performance Development Co.,Ltd is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310008",
        "website": "http://www.songcn.com",
        "market_cap": "Mid Cap"
    },
    "300329.SZ": {
        "short_name": "HAILUN PIANO CO LT",
        "long_name": "Hailun Piano Co.,Ltd.",
        "summary": "Hailun Piano Co., Ltd. engages in the development, production, and sale of pianos in China and internationally. It offers upright, grand, and intelligent digital electric pianos, as well as guitars and electric jazz drums. The company is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": null,
        "website": "http://www.hailunpiano.com",
        "market_cap": "Micro Cap"
    },
    "300651.SZ": {
        "short_name": "JIANGSU JINLING SP",
        "long_name": "Jiangsu Jinling Sports Equipment Co.,Ltd.",
        "summary": "Jiangsu Jinling Sports Equipment Co.,Ltd. researches, develops, manufactures, and sells sports equipment worldwide. It offers equipment for various kinds of sports events, including basketball, football, volleyball, track and field, gymnastic, weightlifting, wrestling and judo, tennis, billiards, swimming, badminton, table tennis, handball and hockey, fitness, and fencing and boxing equipment, as well as equipment for disabled and optoelectronic products. The company also provides stadium construction, fitness, event security, and sports facility integration services. The company was founded in 1985 and is based in Zhangjiagang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhangjiagang",
        "zipcode": "215600",
        "website": "http://www.jlsports.com",
        "market_cap": "Small Cap"
    },
    "300756.SZ": {
        "short_name": "GUANGDONG JINMA EN",
        "long_name": "Guangdong Jinma Entertainment Corporation Limited",
        "summary": "Guangdong Jinma Entertainment Corporation Limited designs, manufactures, installs, and manages amusement rides in China and internationally. It offers roller coasters, tower rides, water rides, giant wheels, classic rides, carousels, family rides, scenery trains, and dark rides. The company was formerly known as Golden Horse Technology Entertainment Corporation Limited and changed its name to Guangdong Jinma Entertainment Corporation Limited in February 2021. Guangdong Jinma Entertainment Corporation Limited was founded in 2007 and is based in Zhongshan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhongshan",
        "zipcode": "528437",
        "website": "http://www.jinmabrand.com",
        "market_cap": "Small Cap"
    },
    "300793.SZ": {
        "short_name": "COSONIC INTELLIGEN",
        "long_name": "Cosonic Intelligent Technologies Co., Ltd.",
        "summary": "Cosonic Intelligent Technologies Co., Ltd. is engaged in the research and development, production, and sale of professional headphones. It offers touch panel Bluetooth headphones, gaming headsets, bone conduction headsets, sports headsets, in-ear earphones, and noise cancelling headphones. The company s products are widely applicable in the fields of communications, mobile video, personal audio, Internet, gaming and health and sports, etc. It provides the OEM/ODM services for clients in China and internationally. The company was founded in 2013 and is based in Dongguan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": null,
        "website": "http://www.cosonic.cc",
        "market_cap": "Small Cap"
    },
    "3358.HK": {
        "short_name": "BESTWAY GLOBAL",
        "long_name": "Bestway Global Holding Inc.",
        "summary": "Bestway Global Holding Inc., an investment holding company, designs, develops, manufactures, and sells a range of outdoor leisure products primarily under the BESTWAY brand in Mainland China, Europe, North America, the Asia-Pacific, and internationally. It offers portable spas and accessories; range of inflatable water sports items under the Hydro-Force brand; inflatable tubes and sleds under the H2OGO brand name; baby boats, armbands, swim vests and jackets, and kickboards for newborns and toddlers under the SwimSafe ABC and Fisher-Price brands; and above ground pools comprising inflatable top ring, steel frame, and steel wall pools, as well as swim fitness and pool accessories. The company also provides swim gears, such as goggles, diving masks, mask sets, fins, dive toys, and accessories under Hydro-Swim and Hydro-Pro brand names; recreational toys for water, grass, and indoor use; portable sleep solutions, which includes airbeds and air furniture; and outdoor camping gear, such as airbeds, backpacks, tents, sleeping bags, and accessories under Pavillo brand. In addition, it produces and sells polymer films; and engages in the investment management, as well as trades in inflatable products. The company was founded in 1994 and is headquartered in Shanghai, the People's Republic of China. Bestway Global Holding Inc. is a subsidiary of Great Success Enterprises Holdings Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201812",
        "website": "http://www.bestwaycorp.com",
        "market_cap": "Small Cap"
    },
    "36L.F": {
        "short_name": "361 DEG. INTERNAT. HK-,01",
        "long_name": "361 Degrees International Limited",
        "summary": "361 Degrees International Limited, an investment holding company, manufactures and trades in sporting goods in the People's Republic of China. The company operates in two segments, Adults and Kids. It offers adult and children footwear, apparels, and accessories for sports and casual life under the 361 core and 361 Kids brands; and ski and outdoor sportswear products under the ONE WAY brand. The company also manufactures and trades in shoes soles; trades in children sporting goods; and operates a gas station. As of December 31, 2020, it operated a network of 5,165 stores under the 361 core brand name. The company also sells products through its 361sport.com Website; other e-commerce platforms, including Tmall, Taobao, and JD; and authorized retailers and distributors. 361 Degrees International Limited was founded in 2003 and is headquartered in Xiamen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361009",
        "website": "http://www.361sport.com",
        "market_cap": "Small Cap"
    },
    "600071.SS": {
        "short_name": "PHENIX OPTICAL CO LTD",
        "long_name": "Phenix Optical Company Limited",
        "summary": "Phenix Optical Company Limited produces and sells optical instruments in China and internationally. The company offers optical lens elements, photoelectric modules, and scientific instruments. It offers optical lenses, including BI, FA, ITS, automotive, infrared, and smart hardware/home lens; biological, industry, fluorescence, polarized light, metallographic, electric, and digital microscopes; optoelectronic modules, such as security cameras, endoscopes, industrial cameras, car cameras, smart equipment, smart home, and other modules; optical and metal parts; polymer, aluminum shell, and storage lithium-ion batteries; and other products, such as camcorder camera parts, dish washing machines, disinfection cabinets, and water heaters. Phenix Optical Company Limited was founded in 1997 and is based in Shangrao, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shangrao",
        "zipcode": null,
        "website": "http://www.phenixoptics.com.cn",
        "market_cap": "Small Cap"
    },
    "600555.SS": {
        "short_name": "HNA INNOVATION CO LTD",
        "long_name": "HNA Innovation Co., Ltd.",
        "summary": "HNA Innovation Co., Ltd. provides tourism catering services in China. It engages in the development, construction, and operation of scenic spots in tourist resorts. The company also engages in the real estate business; management of tourist attractions and hotels; and yacht sales business. In addition, it provides investment management, marketing planning, exhibition, conference service, and business management consulting services; business information consulting services; sports activity organizations planning services; energy-saving services; and software development and information technology consulting services. The company was formerly known as HNA Innovation (Hainan) Co., Ltd. and changed its name to HNA Innovation Co., Ltd. in April 2017. HNA Innovation Co., Ltd. was incorporated in 1999 and is based in Sanya, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Sanya",
        "zipcode": "572000",
        "website": "http://www.ninedragon.com.cn",
        "market_cap": "Micro Cap"
    },
    "600593.SS": {
        "short_name": "DALIAN SUNASIA TOURISM HOLDING ",
        "long_name": "Dalian Sunasia Tourism Holding CO.,LTD",
        "summary": "Dalian Sunasia Tourism Holding CO.,LTD operates theme parks in China. The company was founded in 1994 and is based in Dalian, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116023",
        "website": "http://www.sunasia.com",
        "market_cap": "Small Cap"
    },
    "600818.SS": {
        "short_name": "ZHONGLU CO. LTD.",
        "long_name": "Zhonglu.Co.,Ltd",
        "summary": "Zhonglu.Co.,Ltd manufactures and sells bicycles in the People's Republic of China. It offers bicycles and electric bicycles under the Forever brand; wheelchairs; and bowling equipment; natural latex products; plastic paving materials; and automatic chess and card equipment, as well as public bicycle rental service systems. The company also exports its products to Europe, Asia, and Africa. Zhonglu.Co.,Ltd was founded in 1940 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.600818.cn",
        "market_cap": "Small Cap"
    },
    "603398.SS": {
        "short_name": "BANBAO CO LTD",
        "long_name": "BanBao Co., Ltd.",
        "summary": "BanBao Co., Ltd. researches, develops, produces, and sells educational plastic block and infant preschool block toys in China. The company was founded in 2003 and is based in Shantou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shantou",
        "zipcode": "515021",
        "website": "http://www.banbao.com",
        "market_cap": "Small Cap"
    },
    "603579.SS": {
        "short_name": "SHANGHAI RONGTAI HEALTH TECHNOL",
        "long_name": "Shanghai Rongtai Health Technology Corporation Limited",
        "summary": "Shanghai Rongtai Health Technology Corporation Limited provides massage chairs, mini massage series products, and massage accessories in China and internationally. The company was founded in 1997 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201714",
        "website": "http://www.aront.cn",
        "market_cap": "Small Cap"
    },
    "688010.SS": {
        "short_name": "FUJIAN FORECAM OPTICS CO LTD",
        "long_name": "Fujian Forecam Optics Co., Ltd.",
        "summary": "Fujian Forecam Optics Co., Ltd. manufactures and sells optical lenses for civilian applications in the People's Republic of China. It offers board mount, CS mount, and special photoelectric lenses, as well as pan-tilt systems for use in optical glasses, CCTV lenses, DSC lenses, and FA machine vision lenses. The company is based in Fuzhou, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350015",
        "website": "http://www.forecam.com",
        "market_cap": "Small Cap"
    },
    "6918.HK": {
        "short_name": "KIDZTECH",
        "long_name": "Kidztech Holdings Limited",
        "summary": "Kidztech Holdings Limited, together with its subsidiaries, designs, develops, manufactures, and sells smart toy vehicles, smart interactive toys, traditional toys, and hardware products in Mainland China and internationally. It also manufactures products under international customers' brands on original equipment manufacturing and original design manufacturing bases. The company sells its products to customers primarily comprising retailers, such as multinational and national retailers operating mass market retail chain stores; multinational and national toy products retailers operating toy store chains; internet store operators; international wholesalers; export-oriented wholesalers; and domestic-sale-oriented wholesalers, as well as through e-commerce channels. The company offers its products under the kidztech, TOPMAZ, TOPMAZ RACING, GEARMAZ, and ROLLERMAZ brands brand names. It also exports its products. Kidztech Holdings Limited was founded in 2009 and is headquartered in Shantou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shantou",
        "zipcode": null,
        "website": "http://kidztech.net",
        "market_cap": "Micro Cap"
    },
    "900915.SS": {
        "short_name": "ZHONGLU CO. LTD.",
        "long_name": "Zhonglu.Co.,Ltd",
        "summary": "Zhonglu.Co.,Ltd manufactures and sells bicycles in the People's Republic of China. It offers bicycles and electric bicycles under the Forever brand; wheelchairs; and bowling equipment; natural latex products; plastic paving materials; and automatic chess and card equipment, as well as public bicycle rental service systems. The company also exports its products to Europe, Asia, and Africa. Zhonglu.Co.,Ltd was founded in 1940 and is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.600818.cn",
        "market_cap": "Mid Cap"
    },
    "9992.HK": {
        "short_name": "POP MART",
        "long_name": "Pop Mart International Group Limited",
        "summary": "Pop Mart International Group Limited engages in the design, development, and sale of pop toys in China. It offers a range of original and entertaining pop toy products based on its intellectual properties under the Pop Mart brand. The company's products are primarily categorized into blind boxes, action figures, ball jointed dolls, and accessories. Its customers primarily consist of its fans and distributors, as well as bulk purchase corporate customers. As of June 30, 2020, the company's sales and distribution network consisted of 136 retail stores in 33 cities in China, primarily located at commercial districts in first-tier and second-tier cities; 1,001 roboshops in 62 cities in China; online channels, including its Tmall flagship store, Pop Draw, and Paqu, as well as self-developed online pop toy community mobile application, and other mainstream e-commerce platforms; Beijing Toy Shop and Shanghai Toy Show conventions; and wholesale channels, principally consisting of 25 distributors in China and 22 distributors in 21 countries and regions internationally, such as Korea, Japan, Singapore, and the United States. It also provides internet technology services. The company was founded in 2010 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100020",
        "website": "http://global.popmart.com",
        "market_cap": "Large Cap"
    },
    "ANPDF": {
        "short_name": "ANTA SPORTS PRODUCTS",
        "long_name": "ANTA Sports Products Limited",
        "summary": "ANTA Sports Products Limited designs, develops, manufactures, and markets sporting footwear, apparel, and accessories worldwide. The company offers sportswear, including running, cross-training, basketball, soccer, boxing, winter sports, boxing, taekwondo, gymnastics, weightlifting, wrestling, outdoor sports, women's fitness, and skiing products, as well as sports fashion clothing, kid's sports fashion clothing and sportswear, and leisure footwear products under the FILA, FILA KIDS, FILA FUSION, KINGKOW, KOLON SPORT, SPRANDI, FILA FUSION, ANTA, DESCENTE, and ANTA KIDS brands. It also provides management, product design, logistics, and information technology services; manufactures shoe soles; holds trademarks; and develops and manages properties. The company offers its products through street stores, shopping malls, department stores, outlet stores, and e-commerce platforms, as well as online. As of December 31, 2020, it operated 9,922 ANTA stores; 2,006 FILA stores; 175 DESCENTE stores; and 157 KOLON SPORT stores. The company also exports and imports sporting shoes. The company was founded in 1994 and is headquartered in Jinjiang, the People's Republic of China. ANTA Sports Products Limited is a subsidiary of Anta International Group Holdings Limited.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Jinjiang",
        "zipcode": "362212",
        "website": "http://www.anta.com",
        "market_cap": "Large Cap"
    },
    "ANPDY": {
        "short_name": "ANTA SPORTS PRODUCTS",
        "long_name": "ANTA Sports Products Limited",
        "summary": "ANTA Sports Products Limited designs, develops, manufactures, and markets sporting footwear, apparel, and accessories worldwide. The company offers sportswear, including running, cross-training, basketball, soccer, boxing, winter sports, boxing, taekwondo, gymnastics, weightlifting, wrestling, outdoor sports, women's fitness, and skiing products, as well as sports fashion clothing, kid's sports fashion clothing and sportswear, and leisure footwear products under the FILA, FILA KIDS, FILA FUSION, KINGKOW, KOLON SPORT, SPRANDI, FILA FUSION, ANTA, DESCENTE, and ANTA KIDS brands. It also provides management, product design, logistics, and information technology services; manufactures shoe soles; holds trademarks; and develops and manages properties. The company offers its products through street stores, shopping malls, department stores, outlet stores, and e-commerce platforms, as well as online. As of December 31, 2020, it operated 9,922 ANTA stores; 2,006 FILA stores; 175 DESCENTE stores; and 157 KOLON SPORT stores. The company also exports and imports sporting shoes. The company was founded in 1994 and is headquartered in Jinjiang, the People's Republic of China. ANTA Sports Products Limited is a subsidiary of Anta International Group Holdings Limited.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Jinjiang",
        "zipcode": "362212",
        "website": "http://www.anta.com",
        "market_cap": "Large Cap"
    },
    "AS7.F": {
        "short_name": "ANTA SPORTS PROD.  HD-,10",
        "long_name": "ANTA Sports Products Limited",
        "summary": "ANTA Sports Products Limited designs, develops, manufactures, and markets sporting footwear, apparel, and accessories worldwide. The company offers sportswear, including running, cross-training, basketball, soccer, boxing, winter sports, boxing, taekwondo, gymnastics, weightlifting, wrestling, outdoor sports, women's fitness, and skiing products, as well as sports fashion clothing, kid's sports fashion clothing and sportswear, and leisure footwear products under the FILA, FILA KIDS, FILA FUSION, KINGKOW, KOLON SPORT, SPRANDI, FILA FUSION, ANTA, DESCENTE, and ANTA KIDS brands. It also provides management, product design, logistics, and information technology services; manufactures shoe soles; holds trademarks; and develops and manages properties. The company offers its products through street stores, shopping malls, department stores, outlet stores, and e-commerce platforms, as well as online. As of December 31, 2020, it operated 9,922 ANTA stores; 2,006 FILA stores; 175 DESCENTE stores; and 157 KOLON SPORT stores. The company also exports and imports sporting shoes. The company was founded in 1994 and is headquartered in Jinjiang, the People's Republic of China. ANTA Sports Products Limited is a subsidiary of Anta International Group Holdings Limited.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Jinjiang",
        "zipcode": "362212",
        "website": "http://www.anta.com",
        "market_cap": "Large Cap"
    },
    "GBH.F": {
        "short_name": "GOODBABY INTL HLDGS HD-01",
        "long_name": "Goodbaby International Holdings Limited",
        "summary": "Goodbaby International Holdings Limited, an investment holding company, researches, designs, develops, manufactures, markets, and sells durable juvenile products in Europe, North America, Mainland China, and internationally. It offers children's car safety seats, strollers, apparels and home textile products, feeding products, nursing and personal care products, cribs, bicycles and tricycles, and other children products. The company also provides safety belts, cloth sets, and car components for children; child cloth beds; bath chairs for children; stadium chairs; sports utilities, e-cars, and wooden products; and child carrying systems, pushchairs, high chairs, and other products for children. In addition, it offers IT services and a share service center; testing services for children's products, tools, and electronic products; and advisory services for the risk valuation of product quality. Further, the company is involved in the distribution and sale of car safety seats, infant strollers, and other parenting products; and wholesale and retail of children's products. It also operates flagship stores. The company provides its products under the CYBEX, gb, Evenflo, RollPlay, CBX, Exer Saucer, Urbini, and Happy Dino brands. The company was founded in 1989 and is headquartered in Kunshan, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Kunshan",
        "zipcode": "215331",
        "website": "http://www.gbinternational.com.hk",
        "market_cap": "Small Cap"
    },
    "LNLB.F": {
        "short_name": "LI NING CO.LTD NEW HD-,10",
        "long_name": "Li Ning Company Limited",
        "summary": "Li Ning Company Limited engages in the research and development, design, manufacture, marketing, distribution, and retail of sporting goods in the People's Republic of China. The company offers sporting goods, including footwear, apparel, equipment, and accessories for professional and leisure purposes primarily under the LI-NING brand. It also develops, manufactures, markets, distributes, and/or sells outdoor sports products under the AIGLE brand; table tennis under the Double Happiness brand name; fashionable fitness products for dance and yoga under the Danskin brand; and badminton under the Kason brand name. As of December 31, 2020, the company operated 6,933 conventional stores, flagship stores, China LI-NING stores, factory outlets, and discount stores under the LI-NING brand. Li Ning Company Limited was founded in 1990 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101111",
        "website": "http://www.lining.com",
        "market_cap": "Large Cap"
    },
    "LNNGF": {
        "short_name": "LI NING CO LTD",
        "long_name": "Li Ning Company Limited",
        "summary": "Li Ning Company Limited engages in the research and development, design, manufacture, marketing, distribution, and retail of sporting goods in the People's Republic of China. The company offers sporting goods, including footwear, apparel, equipment, and accessories for professional and leisure purposes primarily under the LI-NING brand. It also develops, manufactures, markets, distributes, and/or sells outdoor sports products under the AIGLE brand; table tennis under the Double Happiness brand name; fashionable fitness products for dance and yoga under the Danskin brand; and badminton under the Kason brand name. As of December 31, 2020, the company operated 6,933 conventional stores, flagship stores, China LI-NING stores, factory outlets, and discount stores under the LI-NING brand. Li Ning Company Limited was founded in 1990 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101111",
        "website": "http://www.lining.com",
        "market_cap": "Large Cap"
    },
    "LNNGY": {
        "short_name": "LI NING CO LTD",
        "long_name": "Li Ning Company Limited",
        "summary": "Li Ning Company Limited engages in the research and development, design, manufacture, marketing, distribution, and retail of sporting goods in the People's Republic of China. The company offers sporting goods, including footwear, apparel, equipment, and accessories for professional and leisure purposes primarily under the LI-NING brand. It also develops, manufactures, markets, distributes, and/or sells outdoor sports products under the AIGLE brand; table tennis under the Double Happiness brand name; fashionable fitness products for dance and yoga under the Danskin brand; and badminton under the Kason brand name. As of December 31, 2020, the company operated 6,933 conventional stores, flagship stores, China LI-NING stores, factory outlets, and discount stores under the LI-NING brand. Li Ning Company Limited was founded in 1990 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101111",
        "website": "http://www.lining.com",
        "market_cap": "Large Cap"
    },
    "N0Z.SI": {
        "short_name": "Combine Will",
        "long_name": "Combine Will International Holdings Limited",
        "summary": "Combine Will International Holdings Limited, an investment holding company, operates as an original design manufacturer (ODM)/original equipment manufacturer (OEM) of corporate premiums, toys, and consumer products. The company operates through three divisions: ODM/OEM; Moulds and Tooling; and Trading. It also manufactures plastic injection and die-casting molds; and molds and tooling, as well as fixtures for the automobile, and consumer and household products industries. In addition, the company distributes machinery and precision tools for the manufacture of molds, die-cast, and automobile products; and manufactures electronics parts. Combine Will International Holdings Limited operates in Asia, the Middle East, the United States, and Europe. The company was founded in 1992 and is based in Dongguan, the People's Republic of China. Combine Will International Holdings Limited is a subsidiary of HL Bank Nominees (Singapore) Pte Ltd.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": null,
        "website": "http://www.combinewill.com",
        "market_cap": "Nano Cap"
    },
    "TSIOF": {
        "short_name": "361 DEGREES INTERNATIONAL LIMIT",
        "long_name": "361 Degrees International Limited",
        "summary": "361 Degrees International Limited, an investment holding company, manufactures and trades in sporting goods in the People's Republic of China. The company operates in two segments, Adults and Kids. It offers adult and children footwear, apparels, and accessories for sports and casual life under the 361 core and 361 Kids brands; and ski and outdoor sportswear products under the ONE WAY brand. The company also manufactures and trades in shoes soles; trades in children sporting goods; and operates a gas station. As of December 31, 2020, it operated a network of 5,165 stores under the 361 core brand name. The company also sells products through its 361sport.com Website; other e-commerce platforms, including Tmall, Taobao, and JD; and authorized retailers and distributors. 361 Degrees International Limited was founded in 2003 and is headquartered in Xiamen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361009",
        "website": "http://www.361sport.com",
        "market_cap": "Small Cap"
    }
}