{
    "000592.SZ": {
        "short_name": "ZHONGFU STRAITS (P",
        "long_name": "Zhongfu Straits (Pingtan) Development Company Limited",
        "summary": "Zhongfu Straits (Pingtan) Development Company Limited provides wood products under the Zhongfu brand in China and internationally. The company offers fir products, wet pine, cold-tolerant eucalyptus, golden lotus, etc.; fiberboards, laminated timber, finger jointed boards, and fine wood board products for use in furniture, household appliances, audio housings, pianos, sports equipment, handicrafts, vehicles, and ships; and financin and pledge financing services for corporate legal persons and individuals. It is also involved in the processing and sale of forest products; cultivation of seedlings; tree planting; and garden landscape design and construction activities. In addition, the company engages in the investment, construction, and operation management of sewage treatment and water plants; and concrete mixing franchise business. The company was formerly known as Fujian Zhongfu Industries Co., Ltd and changed its name to Zhongfu Straits (Pingtan) Development Company Limited in May 2014. Zhongfu Straits (Pingtan) Development Company Limited is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350001",
        "website": "http://www.000592.com",
        "market_cap": "Small Cap"
    },
    "000663.SZ": {
        "short_name": "FUJIAN YONGAN FRST",
        "long_name": "Fujian Yongan Forestry (Group) Joint-Stock Co., Ltd.",
        "summary": "Fujian Yongan Forestry (Group) Joint-Stock Co., Ltd. provides various forest products in China. Its products include fir, pine, eucalyptus, hardwood, and other wood products; medium-density fiberboards; furniture; laminate flooring; formaldehyde; adhesives; and seedlings. The company was founded in 1994 and is based in Yong'an, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yong'an",
        "zipcode": "366000",
        "website": "http://www.yonglin.com",
        "market_cap": "Small Cap"
    },
    "000910.SZ": {
        "short_name": "DARE POWER DEKOR H",
        "long_name": "Dare Power Dekor Home Co.,Ltd.",
        "summary": "Dare Power Dekor Home Co.,Ltd. engages in the wood-based panel and flooring businesses. The company offers Shengxiang branded flooring and Daya branded wood-based panels. The company was formerly known as Dare Technology Co., Ltd. and changed its name to Dare Power Dekor Home Co.,Ltd. in October 2016. Dare Power Dekor Home Co.,Ltd. was founded in 1999 and is based in Danyang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Danyang",
        "zipcode": null,
        "website": "http://www.dareglobal.com.cn",
        "market_cap": "Small Cap"
    },
    "002043.SZ": {
        "short_name": "DEHUA TB NEW DECOR",
        "long_name": "DeHua TB New Decoration Material Co.,Ltd",
        "summary": "DeHua TB New Decoration Material Co.,Ltd produces and markets decorative plywood in China. The company offers plywood, flooring, and veneer products, as well as wooden doors. It operates 753 franchised stores. The company also exports its products to the Americas, Europe, Australia, the Middle East, and internationally. DeHua TB New Decoration Material Co.,Ltd was founded in 1993 and is based in Deqing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Deqing",
        "zipcode": "313200",
        "website": "http://www.dhwooden.com",
        "market_cap": "Small Cap"
    },
    "002240.SZ": {
        "short_name": "SHENZHEN CHENGXIN",
        "long_name": "Shenzhen Chengxin Lithium Group Co.,Ltd.",
        "summary": "Shenzhen Chengxin Lithium Group Co.,Ltd. manufactures and sells fiberboard products in China. The company provides medium (high) density fiberboards used in furniture, door, and reinforcement Wood flooring, and decoration industries. It is also involved in forest planting and sales activities. The company was founded in 1997 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.gdweihua.cn",
        "market_cap": "Mid Cap"
    },
    "002679.SZ": {
        "short_name": "FUJIAN JINSEN FORE",
        "long_name": "Fujian Jinsen Forestry Co.,Ltd",
        "summary": "Fujian Jinsen Forestry Co.,Ltd engages in the afforestation activities in China. The company manages forests; and engages in the green seedlings, sale of wood, and Chinese herbal medicine fields. It also provides bamboo and primary agriculture products; and invests in forestry and agriculture projects. The company was founded in 2007 and is based in Sanming, China. Fujian Jinsen Forestry Co.,Ltd is a subsidiary of Fujian Jiangle Forestry Corporation.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Sanming",
        "zipcode": null,
        "website": "http://www.jinsenforestry.com",
        "market_cap": "Small Cap"
    },
    "1069.HK": {
        "short_name": "BOZZA DEVELOP",
        "long_name": "China Bozza Development Holdings Limited",
        "summary": "China Bozza Development Holdings Limited, an investment holding company, engages in forestry management, container house, and money lending businesses in the People's Republic of China and Hong Kong. As of December 31, 2019, the company owned approximately 1,403 hectares in Muma Town of Jiange County; 642 hectares in Zhengxing Town of Jiange County; 881 hectares in Yixing Town of Jiange County; and 2,044 hectares in Longyuanzhen, Houshiziang, and Dianzixiang towns of Jiange County, Sichuan Province, as well as 2,854 hectares in Kaifeng Town, Yingshui village, Guangping village, and Zheba village of Jiange County of Sichuan Province. It also harvests timber logs; and manages, leases, sells, and installs container houses. The company was formerly known as China Agroforestry Low-Carbon Holdings Limited and changed its name to China Bozza Development Holdings Limited in January 2020. China Bozza Development Holdings Limited was incorporated in 2009 and is headquartered in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.chinacaflc.com",
        "market_cap": "Small Cap"
    },
    "600076.SS": {
        "short_name": "KANGXIN NEW MATERIALS CO LTD",
        "long_name": "Kangxin New Materials Co., Ltd.",
        "summary": "Kangxin New Materials Co., Ltd. engages in the afforestation, processing, design, and production of construction structural lumber products in China. Its principal products include poplar wood products, mountain forest woods, and COSB oriented structural boards, as well as series of solid wood composite boards for container floors, EP decorative boards, construction plywood, etc.; and poplar and urban landscape seedlings. The company also produces wooden houses. Kangxin New Materials Co., Ltd. was founded in 1998 and is headquartered in Xiaogan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiaogan",
        "zipcode": null,
        "website": "http://www.hbkangxin.com.cn",
        "market_cap": "Small Cap"
    },
    "600265.SS": {
        "short_name": "YUNNAN JINGU FORESTRY",
        "long_name": "Yunnan Jinggu Forestry Co.,Ltd",
        "summary": "Yunnan Jinggu Forestry Co.,Ltd engages in timber processing business in China and internationally. The company also manufactures and distributes forest chemical products. It offers gum rosin, gum turpentine oil, alpha-pinene, beta-pinene, wood boards, and other products. The company is also involved in forest cultivation, cutting, transportation, and processing of timbers, as well as the research and development of forest technology. Yunnan Jinggu Forestry Co.,Ltd is based in Puer, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Puer",
        "zipcode": "666499",
        "website": "http://www.jgly.cn",
        "market_cap": "Small Cap"
    },
    "601996.SS": {
        "short_name": "GUANGXI FENGLIN WOOD INDUSTRY G",
        "long_name": "Guangxi Fenglin Wood Industry Group Co.,Ltd",
        "summary": "Guangxi Fenglin Wood Industry Group Co.,Ltd manufactures and sells engineering boards in China and internationally. It offers medium density fiber boards and particle boards primarily for use in furniture, doors, flooring, and car, as well as construction and decoration, and electronic industries. The company was founded in 2000 and is based in Nanning, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanning",
        "zipcode": "530031",
        "website": "http://www.fenglingroup.com",
        "market_cap": "Small Cap"
    }
}