{
    "002223.SZ": {
        "short_name": "JIANGSU YUYUE MEDI",
        "long_name": "Jiangsu Yuyue Medical Equipment & Supply Co., Ltd.",
        "summary": "Jiangsu Yuyue Medical Equipment & Supply Co., Ltd. researches, develops, manufactures, and markets medical equipment in China and internationally. The company provides respiratory products, such as oxygen concentrators, nebulizers, oxygen regulators, oxygen intake devices, and BreathCare CPAP products; homecare products, including electronic blood pressure monitors, sphygmomanometers, stethoscopes, thermometers, and pulse oximeters; and blood glucose meters. It also offers hospital instruments comprising oxygen generators, medical diagnostic equipment, suction apparatus, and medical disposable products; and rehabilitation products consisting of rehabilitation care series, anti-decubitus mattress, and tracks for neck ache. The company was formerly known as Yuwell medical. Jiangsu Yuyue Medical Equipment & Supply Co., Ltd. was founded in 1998 and is based in Danyang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Danyang"
    },
    "002294.SZ": {
        "short_name": "SHENZHEN SALUBRIS",
        "long_name": "Shenzhen Salubris Pharmaceuticals Co., Ltd.",
        "summary": "Shenzhen Salubris Pharmaceuticals Co., Ltd. engages in the research, development, production, and sale of medicines for cardiovascular, anti-diabetic, antineoplastic, and orthopedic therapeutic in China. It offers cardiovascular and cerebrovascular products, such as allisartan isoproxil, benazepril hydrochloride, and clopidogrel bisulfate tablets, as well as bivalirudin and pamidronate disodium injections; recombinant SeV-hFGF2/dF Injection for treatment of diabetic foot disease; and anti-tumor and orthopedics medicines. The company also provides anti-infection products comprising cefonicid sodium, ceftazidime, ceftriaxone sodium, cefminox sodium, cefuroxime sodium, cefepime hydrochloride, and cefodizime sodium injections, as well as azithromycin dispersible and levetiracetam tablets. In addition, it offers biotechnological drugs, such as recombinant protein and monoclonal antibody drugs. Further, the company is involved in import, licensing-in, and licensing-out medicines for Europe markets. The company was founded in 1998 and is headquartered in Shenzhen, China. Shenzhen Salubris Pharmaceuticals Co., Ltd. is a subsidiary of Shenzhen Xinlitai Pharmaceutical Co., Ltd.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "002432.SZ": {
        "short_name": "ANDON HEALTH CO LT",
        "long_name": "Andon Health Co., Ltd.",
        "summary": "Andon Health Co., Ltd. develops, manufactures, and sells health electronics and intelligent hardware products. It offers sphygmomanometers, nebulizers, blood glucose meters, thermometers, fetal heart rate instruments, electrocardiographs, oximeters, smart watches, and body weight scales. The company was founded in 1995 and is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Tianjin"
    },
    "002950.SZ": {
        "short_name": "ALLMED MEDICAL PRO",
        "long_name": "Allmed Medical Products Co., Ltd",
        "summary": "Allmed Medical Products Co., Ltd engages in the research and development, manufacture, and distribution of medical dressings and other disposable medical supplies in the People's Republic of China. The company offers general wound care products, such as elastic and adhesive bandage, oil emulsion, xeroform gauze, woven gauze swabs, fluffy bandages/sponges, abdominal pads, gauze/non-woven drain sponges, post-op sponges, eye pads, cotton filled exodontia sponges, non-stick pads, and petrolatum gauze dressing. It also provides OR/surgery products, including X-ray non-woven swabs, OR towels, laparotomy and neuro sponges, and X-ray detectable gauze balls and nonwoven balls; various kits; and patient care products comprising disposable nursing pads and disposable drapes. In addition, the company exports its products to the United States, Canada, Germany, Japan, the Middle East, and internationally. Allmed Medical Products Co., Ltd was founded in 1997 and is based in Shenzhen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "1066.HK": {
        "short_name": "WEIGAO GROUP",
        "long_name": "Shandong Weigao Group Medical Polymer Company Limited",
        "summary": "Shandong Weigao Group Medical Polymer Company Limited engages in the research and development, production, and sale of single-use medical devices in the People's Republic of China. The company operates through Medical Device Products, Orthopaedic Products, Interventional Products, Pharma Packaging Products, Blood Management Products, and Others segments. It offers vascular and non-vascular access infusion devices, infusion sets, syringes, puncture needles, and specialized single-use clinical collection kits; wound healing dressings, wound sutures, and wound cleaning and nonvascular catheter supporting extracorporeal devices; and blood collection, storage, separation, and sterilization equipment. The company also provides prefilled syringes and pre-filled flush syringes; blood collection and blood glucose testing devices; and general anesthesia consumables, local anesthesia consumables, anesthesia auxiliary consumables, ICU equipment, and open and minimally invasive surgical equipment. In addition, it engages in the production and sale of orthopedic products; tumor and blood vessel interventional instruments; implantation materials and artificial organs; medical PVC granules, plastic packing bags, and carton boxes; industrial automatic equipment and parts; molds; hemo-dialysis equipment; and type I, type II, and type III medical devices. Further, the company is involved in the finance leasing and factoring business; wholesale of type I medical devices, surgical devices, and other disposal medical products; and provision of asset management and enterprise consulting services, as well as logistics and storage services. The company offers its products under the Jierui, Wego Ortho, Yahua, Bangde, and Hai Xing brands. The company also export its products. It serves hospitals, blood stations, and other medical units; and distributors. The company was founded in 2000 and is based in Weihai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Weihai"
    },
    "1358.HK": {
        "short_name": "PW MEDTECH",
        "long_name": "PW Medtech Group Limited",
        "summary": "PW Medtech Group Limited, an investment holding company, operates as a medical device company in the People's Republic of China. It manufactures and sells infusion sets, such as non-PVC-based infusion sets, precision filter infusion sets, light resistant infusion sets, and intravenous cannula products, as well as human plasma-based biopharmaceutical products. The company was formerly known as Pyholding Limited. PW Medtech Group Limited was founded in 1997 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "1501.HK": {
        "short_name": "KDL MEDICAL",
        "long_name": "Shanghai Kindly Medical Instruments Co., Ltd.",
        "summary": "Shanghai Kindly Medical Instruments Co., Ltd. engages in the research and development, manufacture, and sale of cardiovascular interventional medical devices in Mainland China, Europe, the United States, and internationally. It offers interventions products, which includes guiding catheter used to provide a channel for introducing balloon catheter, guidewire or other treatment devices; microcatheter to support the placement of guide wires; guidewire used in percutaneous transluminal angioplasty (PTA) surgical procedures; angiography catheter used to inject and infuse contrast media and fluid; Y-connector pack used in PTCA surgery; inflation device used to inflate the balloon of dilating the vessel or placing the stent in the vessel; manifold for single use; manifold kit; pressure bandage used to assist compression hemostasis; angiography syringe for single use; stopcocks used for pressure monitoring tubing during surgery; sterile seldinger needle used to puncture into the artery; introducer set; pressure transducer for single use; extension tube for pressure monitoring; and introducer tool kit used in percutaneous vertebroplasty. The company also provides medical accessories, such as check value, needle free connector, male Luer locks, bi-stopper, Heparian cap, flush device, and flow regulator; other products, including vaginal dilator used during a vaginal examination, foley catheter, infusion pumps, disposable automatic umbilical cord clamps, infusion connector and accessory for single use, and burette infusion sets without a needle. It serves medical device manufacturers and other customers. The company was founded in 2006 and is headquartered in Shanghai, China. Shanghai Kindly Medical Instruments Co., Ltd. is a subsidiary of Shanghai Kindly Enterprise Development Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "300061.SZ": {
        "short_name": "SHANGHAI CONANT MA",
        "long_name": "Shanghai Conant Macroflag Group Co., Ltd.",
        "summary": "Shanghai Conant Macroflag Group Co., Ltd. manufactures and supplies optical lenses in China. Its products include hard resin, stock, Rx free form, UV++, single vision, bi-focal, trifocal, high index, polarized, photochromic, sunfilter, infra-red, and custom hybrid monomer lenses. The company was formerly known as Shanghai Conant Optics Co., Ltd. and changed its name to Shanghai Conant Macroflag Group Co., Ltd. in July 2017. Shanghai Conant Macroflag Group Co., Ltd. was founded in 1996 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "300171.SZ": {
        "short_name": "SHANGHAI TOFFLON S",
        "long_name": "Shanghai Tofflon Science and Technology Co., Ltd.",
        "summary": "Shanghai Tofflon Science and Technology Co., Ltd. operates as a pharmaceutical equipment supplier for the pharma and biotech industries worldwide. It offers injectables, such as auto solution preparation systems, aseptic filling lines for ampoule, vials, syringes and powders, freeze dryer and auto loading systems, barrier systems, and plastic packaging machines. The company also provides active pharmaceutical ingredients; and visual inspection, leak detection, and combination systems, as well as focuses on providing bio-process equipment and integrated systems, including medium preparation, cell/microbial cultivation, harvesting, DF/UF, purification, buffer preparation, and finished filling systems. In addition, it offers lyophilization injectable lab services. The company was founded in 1993 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "300358.SZ": {
        "short_name": "TRUKING TECHNOLOGY",
        "long_name": "Truking Technology Limited",
        "summary": "Truking Technology Limited researches and develops pharmaceutical and medical equipment in China. The company offers solutions for sterile products lyophilization, ampoule injectable products, vial injectable products, vial(powder) products, pre-filling and sealing products, plastic bottle blow-fill-seal, cartridge, non-PVC soft bag, and glass infusion bottle production, as well as fluid processing systems. It also offers isolating systems and lyophilization laboratory. In addition, the company exports its products to approximately 30 countries and areas in Asia, Europe, South America, the former Soviet Union, and internationally. Truking Technology Limited was founded in 2000 and is headquartered in Changsha, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Changsha"
    },
    "300453.SZ": {
        "short_name": "JIANG XI SANXIN ME",
        "long_name": "Jiangxi Sanxin Medtec Co.,Ltd.",
        "summary": "Jiangxi Sanxin Medtec Co., Ltd. engages in the research and development, manufacture, and marketing of medical devices in China and internationally. It offers blood purification products, such as hollow fiber dialyzers, hemodialysis pipelines, blood dialysis concentrates, powder for haemodialysis solution, disposable A.V.fistula needle, blood purification fluid infusion line, central venous catheter sets, disposable sterile nursing kits for dialysis, and disposable drainage bags. The company also provides infusion and transfusion products, including disposable sterile TPE infusion set with ultrafilter, automatic infusion check and precision filter infusion sets, disposable sterile precision filter infusion sets, disposable sterile light-resistant infusion sets, pediatric type none steel needle infusion sets, burette type infusion sets, infusion bags, disposable sterile anti puncture infusion sets, disposable sterile blood transfusion sets, disposable sterile infusion sets, and disposable intravenous infusion needles. In addition, it offers catheter tubing products comprising positive pressure intravenous catheters, intravenous catheters, central venous drainage bags, extension tubes with three-way stopcock, IV catheter pasters, and heparin caps; syringes consisting of syringes with the needle; and hypodermic needles, dissolving syringes, insulin syringes, safety syringes, and AD syringes. Further, the company offers other medical equipment, including ultrasound coupling gels, vaginal dilators, anesthesia puncture bags, suction catheters, vaginal douches, Vaccum blood collection tubes, invasive pressure transduction products, air compressed atomizers, venous blood collection needles, and connecting tubing products. Jiangxi Sanxin Medtec Co., Ltd. was founded in 1997 and is based in Nanchang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Nanchang"
    },
    "300573.SZ": {
        "short_name": "SHENYANG XINGQI PH",
        "long_name": "Shenyang Xingqi Pharmaceutical Co., Ltd.",
        "summary": "Shenyang Xingqi Pharmaceutical Co., Ltd engages in the research and development, production, and sale of ophthalmic products in China. It offers corneal, anti-bacteria, artificial tears, anti-inflammation, surgical perfusate, mydriactics, anti-fatigue, and pre dry and over dry eye treatment products. The company is based in Shenyang, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenyang"
    },
    "300595.SZ": {
        "short_name": "AUTEK CHINA INC",
        "long_name": "Autek China Inc.",
        "summary": "Autek China Inc., an eye-vision technology company, engages in the research, development, production, and sale of various eye-optic products. It also offers mirror squirting solution, cleansing liquid, and contact lens lubricant products. The company was founded in 2001 and is headquartered in Hefei, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Hefei"
    },
    "300677.SZ": {
        "short_name": "INTCO MEDICAL TECH",
        "long_name": "Intco Medical Technology Co., Ltd.",
        "summary": "Intco Medical Technology Co., Ltd. engages in the research and development, production, and sale of medical disposable products and durable medical equipment in China and internationally. The company offers disposable gloves; durable medical equipment, such as canes and walkers, shower chairs, commode chairs, buggies, rollators, power and manual wheel chairs, and over bed tables; and nonwoven disposables, including face masks, isolation gowns, shoe covers, and caps. It also provides hot/cold therapy products comprising pet, beauty, cold chain, daily warmer, household, medical care, and home care products; ECG accessories consisting of disposable electrodes, tab electrodes, electrosurgical pencils, ECG papers, electrosurgical disposable grounding pads, and other accessories; and patient lifts. The company was formerly known as Intco Medical Technology Co., Ltd. and changed its name to Intco Medical Technology Co., Ltd. in January 2020. Intco Medical Technology Co., Ltd. was founded in 2009 and is based in Zibo, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Zibo"
    },
    "300753.SZ": {
        "short_name": "JIANGSU APON MEDIC",
        "long_name": "Jiangsu Apon Medical Technology Co., Ltd.",
        "summary": "Jiangsu Apon Medical Technology Co., Ltd. engages in the research and development, production, and sale of medical devices in China. Its principal products include microcomputer injection pumps, disposable injection pumps, wireless analgesia management systems, and pulse oximeters, as well as medical devices, such as sensors in the field of pain management and nasal care sprayers in the field of nasal care. The company was founded in 2001 and is based in Nantong, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Nantong"
    },
    "300896.SZ": {
        "short_name": "IMEIK TECHNOLOGY D",
        "long_name": "Imeik Technology Development Co.,Ltd.",
        "summary": "Imeik Technology Development Co.,Ltd focuses on the research and development, manufacture, and sale of biomedical materials. It offers EME and Bonita that are indicated for injection into the deep dermis to the subcutaneous shallow for the correction of moderate to severe wrinkles of forehead and nasolabial area; IFRESH, which is indicated for injection into mid to deep dermis for the correction of moderate to severe nasolabial folds; Hearty that is indicated for injection into dermis for the correction of moderate to severe neck wrinkles; masks for various skin types; and syringe gun for intradermal injection indication. The company was founded in 2004 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "603222.SS": {
        "short_name": "CHIMIN HEALTH MANAGEMENT CO LTD",
        "long_name": "Chimin Health Management Co., Ltd.",
        "summary": "Chimin Health Management Co., Ltd. develops, produces, and sells human drugs and medical devices in China. The company offers non-PVC soft bag double tube double valves, single valves, and single-tube double valves; plastic bottles; and other packaging forms. It also provides safe self-destruct syringes, disposable sterile infusion equipment, disposable and precision infusion sets, multi-layer PP co-extruded hoses, and other syringes; peritoneal dialysis solutions; and hemodialysis supplies, as well as medical services. The company was formerly known as Zhejiang Chimin Pharmaceutical Co.,Ltd. Chimin Health Management Co., Ltd. was founded in 1996 and is based in Huangyan, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Huangyan"
    },
    "603880.SS": {
        "short_name": "JIANGSU NANFANG MEDICAL CO LTD",
        "long_name": "Jiangsu Nanfang Medical Co., Ltd.",
        "summary": "Jiangsu Nanfang Medical Co., Ltd. engages in the research and development, production, and sale of transdermal products, medical proof fabrics, adhesive tapes, bandages, sports protection products, first-aid kits, and care products in China and internationally. It offers medical adhesive tapes, medical wound dressings, capsicum plasters, physical therapy tapes, pain relief sleeves, rigid sports tapes, wound plaster dressings, medical eye pads, elastic stretch tapes, corn removal plasters, waterproof adhesive tapes, pain relief patches, kinesiology tapes, surgical tapes, and zinc oxide adhesive plasters, as well as customized products. The company is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Changzhou"
    },
    "603987.SS": {
        "short_name": "SHANGHAI KINDLY ENTERPRISE DEVE",
        "long_name": "Shanghai Kindly Enterprise Development Group Co.,LTD.",
        "summary": "Shanghai Kindly Enterprise Development Group Co.,LTD. produces and sells disposable medical polymer devices worldwide. It offers syringes, infusion sets, transfusion sets, medical tubes, needles and cannulas, and medical bags. The company also provides medical package materials, including PPPE composite films, medical packing films, sterilization indicator strips and Bowie Dick test packs, sterilization indicator tapes, medical wrapping papers, paper bags, and sterilization reels; and intervention accessories, such as guide wire, Y-connectors, inflation device, mainfold kit, pressure bandages, angiography syringes, stopcocks, sterile seldinger needle, introducer sets and tool kits, pressure transducer, extension tube, seldinger needles, hemostasis balloons, extension lines with needle free valves, pressure monitoring tubing products, and spine tool kits, as well as guiding, micro, and angiography catheters. In addition, it offers self-sealing pouches, tyverk reels, mini-spikes, PE extension tubes, suction catheter kits, irrigation kits, heparin caps, and umbilical cord clamps. Further, the company provides accessories, such as umbilical cord clamps, safety box, and stopcocks; and medical kits includes suction catheter and irrigation kits, and puncture sets. The company was founded in 1987 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "605369.SS": {
        "short_name": "ZHEJIANG GONGDONG MEDICAL TECHN",
        "long_name": "Zhejiang Gongdong Medical Technology Co.,Ltd.",
        "summary": "Zhejiang Gongdong Medical Technology Co.,Ltd. develops, produces, and sells medical devices and medical testing supplies in China. Its products include lab consumables, vacuum blood collection systems, specimen collection systems, medical nursing wares, medicine package wares, nd mold customization products. Zhejiang Gongdong Medical Technology Co.,Ltd.was founded in 1985 and is based in Taizhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Taizhou"
    },
    "688026.SS": {
        "short_name": "GUANGZHOU JET BIOFILTRATION CO ",
        "long_name": "Guangzhou Jet Bio-Filtration Co., Ltd.",
        "summary": "Guangzhou Jet Bio-Filtration Co., Ltd. researches, develops, manufactures, and sells laboratory consumable products. The company's principal products include laboratory consumables, such as pipettes, tissue culture products, centrifuge tubes, filtration products etc.; and analyzers, lab equipment, reagents, gloves, and other products. It provides its products to approximately 50 countries, including the United States, Japan, Canada, Germany, Australia, and South Korea. The company was founded in 2001 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "688050.SS": {
        "short_name": "EYEBRIGHT MEDICAL TECHNOLOGY (B",
        "long_name": "Eyebright Medical Technology (Beijing) Co., Ltd.",
        "summary": "Eye Bright Medical Technology Co., Ltd. develops a range of ophthalmic medical products. Its products include surgical implants and instruments, equipment, optometric lenses, eye drops, etc. for the treatment of ophthalmic diseases and vision problems, such as cataract, glaucoma, refractive errors, and other ophthalmic diseases. The company was founded in 2010 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "688277.SS": {
        "short_name": "TINAVI MEDICAL TECHNOLOGIES CO ",
        "long_name": "TINAVI Medical Technologies Co., Ltd.",
        "summary": "TINAVI Medical Technologies Co., Ltd. engages in the research and development, production, and clinical application of orthopedic robotic systems. It offers TiRobot, an orthopedic robotic system used in orthopedic surgeries for spine and trauma. The company was founded in 2010 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "688289.SS": {
        "short_name": "SANSURE BIOTECH INC",
        "long_name": "Sansure Biotech Inc.",
        "summary": "Sansure Biotech Inc. develops and sells upstream nucleic acid extraction kits, real time PCR diagnostic and research kits, and fluorescence systems in China and internationally. The company offers novel coronavirus nucleic acid diagnostic kits; viral hepatitis and AIDS, blood screening, and extraction kits; cancer-related biomarkers; and kits for respiratory tract diseases, STDs, digestive tract diseases, prenatal and postnatal care, and genetic diseases, as well as instruments and other consumables. It serves hospitals and laboratories. The company was founded in 2008 and is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Changsha"
    },
    "688301.SS": {
        "short_name": "IRAY TECHNOLOGY COMPANY LTD",
        "long_name": "iRay Technology Company Limited",
        "summary": "iRay Technology Company Limited develops, manufactures, and sells flat panel X-ray detectors for use in medical, dental, oncology, veterinary, security, and industrial imaging applications in China and internationally. It offers wireless radiography, tethered radiography, mammography, dynamic/real-time, and linear detector array products, as well as related software. The company was founded in 2011 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "9997.HK": {
        "short_name": "KANGJI MEDICAL",
        "long_name": "Kangji Medical Holdings Limited",
        "summary": "Kangji Medical Holdings Limited, through its subsidiaries, engages in the research, development, manufacture, and sale of minimally invasive surgical instruments and accessories in China. It offers disposable trocars, polymer ligation clips, disposable electrocoagulation forceps, and other types of disposable hand-held instruments; and reusable trocars, reusable forceps, and other reusable products, including veress needles, monopolar grasping forceps, and myomectomy surgical instrument sets. The company's products are used in obstetrics and gynecology, general surgery, urology, and thoracic surgery specialties. It primarily sells products to a network of distributors. The company was founded in 2004 and is headquartered in Hangzhou, China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "PWE.F": {
        "short_name": "PW MEDTECH GROUP DL-,0001",
        "long_name": "PW Medtech Group Limited",
        "summary": "PW Medtech Group Limited, an investment holding company, operates as a medical device company in the People's Republic of China. It manufactures and sells infusion sets, such as non-PVC-based infusion sets, precision filter infusion sets, light resistant infusion sets, and intravenous cannula products, as well as human plasma-based biopharmaceutical products. The company was formerly known as Pyholding Limited. PW Medtech Group Limited was founded in 1997 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "SHWGF": {
        "short_name": "SHANDONG WEIGAO GROUP MEDICAL",
        "long_name": "Shandong Weigao Group Medical Polymer Company Limited",
        "summary": "Shandong Weigao Group Medical Polymer Company Limited engages in the research and development, production, and sale of single-use medical devices in the People's Republic of China. The company operates through Medical Device Products, Orthopaedic Products, Interventional Products, Pharma Packaging Products, Blood Management Products, and Others segments. It offers vascular and non-vascular access infusion devices, infusion sets, syringes, puncture needles, and specialized single-use clinical collection kits; wound healing dressings, wound sutures, and wound cleaning and nonvascular catheter supporting extracorporeal devices; and blood collection, storage, separation, and sterilization equipment. The company also provides prefilled syringes and pre-filled flush syringes; blood collection and blood glucose testing devices; and general anesthesia consumables, local anesthesia consumables, anesthesia auxiliary consumables, ICU equipment, and open and minimally invasive surgical equipment. In addition, it engages in the production and sale of orthopedic products; tumor and blood vessel interventional instruments; implantation materials and artificial organs; medical PVC granules, plastic packing bags, and carton boxes; industrial automatic equipment and parts; molds; hemo-dialysis equipment; and type I, type II, and type III medical devices. Further, the company is involved in the finance leasing and factoring business; wholesale of type I medical devices, surgical devices, and other disposal medical products; and provision of asset management and enterprise consulting services, as well as logistics and storage services. The company offers its products under the Jierui, Wego Ortho, Yahua, Bangde, and Hai Xing brands. The company also export its products. It serves hospitals, blood stations, and other medical units; and distributors. The company was founded in 2000 and is based in Weihai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Weihai"
    },
    "SHWGY": {
        "short_name": "SHANDONG WEIGAO GROUP MEDICAL",
        "long_name": "Shandong Weigao Group Medical Polymer Company Limited",
        "summary": "Shandong Weigao Group Medical Polymer Company Limited engages in the research and development, production, and sale of single-use medical devices in the People's Republic of China. The company operates through Medical Device Products, Orthopaedic Products, Interventional Products, Pharma Packaging Products, Blood Management Products, and Others segments. It offers vascular and non-vascular access infusion devices, infusion sets, syringes, puncture needles, and specialized single-use clinical collection kits; wound healing dressings, wound sutures, and wound cleaning and nonvascular catheter supporting extracorporeal devices; and blood collection, storage, separation, and sterilization equipment. The company also provides prefilled syringes and pre-filled flush syringes; blood collection and blood glucose testing devices; and general anesthesia consumables, local anesthesia consumables, anesthesia auxiliary consumables, ICU equipment, and open and minimally invasive surgical equipment. In addition, it engages in the production and sale of orthopedic products; tumor and blood vessel interventional instruments; implantation materials and artificial organs; medical PVC granules, plastic packing bags, and carton boxes; industrial automatic equipment and parts; molds; hemo-dialysis equipment; and type I, type II, and type III medical devices. Further, the company is involved in the finance leasing and factoring business; wholesale of type I medical devices, surgical devices, and other disposal medical products; and provision of asset management and enterprise consulting services, as well as logistics and storage services. The company offers its products under the Jierui, Wego Ortho, Yahua, Bangde, and Hai Xing brands. The company also export its products. It serves hospitals, blood stations, and other medical units; and distributors. The company was founded in 2000 and is based in Weihai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Weihai"
    },
    "UK2.F": {
        "short_name": "SHANDONG WEIGAO H  YC-,10",
        "long_name": "Shandong Weigao Group Medical Polymer Company Limited",
        "summary": "Shandong Weigao Group Medical Polymer Company Limited engages in the research and development, production, and sale of single-use medical devices in the People's Republic of China. The company operates through Medical Device Products, Orthopaedic Products, Interventional Products, Pharma Packaging Products, Blood Management Products, and Others segments. It offers vascular and non-vascular access infusion devices, infusion sets, syringes, puncture needles, and specialized single-use clinical collection kits; wound healing dressings, wound sutures, and wound cleaning and nonvascular catheter supporting extracorporeal devices; and blood collection, storage, separation, and sterilization equipment. The company also provides prefilled syringes and pre-filled flush syringes; blood collection and blood glucose testing devices; and general anesthesia consumables, local anesthesia consumables, anesthesia auxiliary consumables, ICU equipment, and open and minimally invasive surgical equipment. In addition, it engages in the production and sale of orthopedic products; tumor and blood vessel interventional instruments; implantation materials and artificial organs; medical PVC granules, plastic packing bags, and carton boxes; industrial automatic equipment and parts; molds; hemo-dialysis equipment; and type I, type II, and type III medical devices. Further, the company is involved in the finance leasing and factoring business; wholesale of type I medical devices, surgical devices, and other disposal medical products; and provision of asset management and enterprise consulting services, as well as logistics and storage services. The company offers its products under the Jierui, Wego Ortho, Yahua, Bangde, and Hai Xing brands. The company also export its products. It serves hospitals, blood stations, and other medical units; and distributors. The company was founded in 2000 and is based in Weihai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Weihai"
    }
}