{
    "000028.SZ": {
        "short_name": "CN ACCORD MEDICINE",
        "long_name": "China National Accord Medicines Corporation Ltd.",
        "summary": "China National Accord Medicines Corporation Ltd. engages in the distribution of medicine and pharmaceutical products. The company offers Chinese traditional patent, bio-chemical, biological, and diagnosis medicines, as well as antibiotics; chemical preparations; shaped packing food products; chemical products; and various commodities and techniques. It also engages in the sale of drugs, medical apparatus, and instruments; offers freight transportation, storage, loading and unloading, other business, and professional consultation services; provides glass wares, cosmetics, and daily merchandise, as well as goods agency services; import and export of technology; leasing of house properties; and wholesaling and retailing of health products. As of December 30, 2019, the company operated a network of 5,021 drugstores, including 3,744 direct-operated stores and 1,277 franchised stores covering 20 provinces, autonomous regions, and municipalities in China. The company is based in Shenzhen, China. China National Accord Medicines Corporation Ltd. is a subsidiary of Sinopharm Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518029",
        "website": "http://www.szaccord.com.cn",
        "market_cap": 15474434048
    },
    "002551.SZ": {
        "short_name": "SHENZHEN GLORY MED",
        "long_name": "Shenzhen Glory Medical Co., Ltd.",
        "summary": "Shenzhen Glory Medical Co., Ltd. provides hospital building integrated solutions in China. The company is involved in the hospital construction system analysis and planning, and medical engineering activities. It also sells medical equipment and medical consumables. In addition, the company provides hospital management professional medical logistic, smart medical, and park development services. Shenzhen Glory Medical Co., Ltd. was founded in 1998 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.glory-medical.com.cn",
        "market_cap": 4618215936
    },
    "002589.SZ": {
        "short_name": "REALCAN PHARMAC.GR",
        "long_name": "Realcan Pharmaceutical Group Co., Ltd.",
        "summary": "Realcan Pharmaceutical Group Co., Ltd. supplies medicines and medical equipment in China. It sells drugs, vaccines, and medical devices. The company also provides direct selling services to medical institutions and pharmacies; medical logistics services; third-party logistics services; and mobile medical information services. In addition, it provides clothing washing, disinfection and sterilization, lease, and hospital logistics services for medical institutions. The company was formerly known as Realcan Pharmaceutical Co., Ltd. and changed its name to Realcan Pharmaceutical Group Co., Ltd. in December 2018. Realcan Pharmaceutical Group Co., Ltd. was founded in 2004 and is based in Yantai, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yantai",
        "zipcode": "264004",
        "website": "http://www.realcan.cn",
        "market_cap": 6966807552
    },
    "1099.HK": {
        "short_name": "SINOPHARM",
        "long_name": "Sinopharm Group Co., Ltd.",
        "summary": "Sinopharm Group Co. Ltd., together with its subsidiaries, engages in the wholesale and retail of pharmaceutical and medical devices and healthcare products in the People's Republic of China. The company operates through four segments: Pharmaceutical Distribution, Medical Devices, Retail Pharmacy, and Other Business. The Pharmaceutical Distribution segment distributes pharmaceutical products to hospitals, other distributors, retail drug stores, and clinics. This segment also offers distribution, logistics, and other value-added services for domestic and international pharmaceutical and healthcare products manufacturers, and other suppliers. The Medical Devices segment distributes medical devices. The Retail Pharmacy segment operates and franchises a network of retail drug stores. As of December 31, 2020, this segment had 8,977 retail pharmacies. The Other Business segment engages in the production and sale of pharmaceutical products, chemical reagents, and laboratory supplies. The company also rents and manages properties; distributes medical instruments, Chinese herbal medicines, antibiotics, and biological products; and offers information technology development and medicine consultation, investment, goods and technology import and export, business consultation, health consultation, medical consultation, market information consultation and investigation, and convention and exhibition services. In addition, it manages medical project investment, consulting, and technology training activities. The company was founded in 2003 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200023",
        "website": "http://www.sinopharmgroup.com.cn",
        "market_cap": 83321626624
    },
    "200028.SZ": {
        "short_name": "CN ACCORD MEDICINE",
        "long_name": "China National Accord Medicines Corporation Ltd.",
        "summary": "China National Accord Medicines Corporation Ltd. engages in the distribution of medicine and pharmaceutical products. The company offers Chinese traditional patent, bio-chemical, biological, and diagnosis medicines, as well as antibiotics; chemical preparations; shaped packing food products; chemical products; and various commodities and techniques. It also engages in the sale of drugs, medical apparatus, and instruments; offers freight transportation, storage, loading and unloading, other business, and professional consultation services; provides glass wares, cosmetics, and daily merchandise, as well as goods agency services; import and export of technology; leasing of house properties; and wholesaling and retailing of health products. As of December 30, 2019, the company operated a network of 5,021 drugstores, including 3,744 direct-operated stores and 1,277 franchised stores covering 20 provinces, autonomous regions, and municipalities in China. The company is based in Shenzhen, China. China National Accord Medicines Corporation Ltd. is a subsidiary of Sinopharm Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518029",
        "website": "http://www.szaccord.com.cn",
        "market_cap": 20315363328
    },
    "2289.HK": {
        "short_name": "CHARMACY PHAR",
        "long_name": "Charmacy Pharmaceutical Co., Ltd.",
        "summary": "Charmacy Pharmaceutical Co., Ltd. engages in the trading of pharmaceutical products in the People's Republic of China. The company offers western medicines, Chinese patent medicines, and healthcare products to downstream distributors and terminal chemists, as well as related consulting services. It also operates Charmacy e-Medicine, a B2B e-commerce platform to place orders and make inquiries and payments. The company was formerly known as Chuangmei Pharmaceutical Co., Ltd. and changed its name to Charmacy Pharmaceutical Co., Ltd. in July 2016. Charmacy Pharmaceutical Co., Ltd. was incorporated in 1984 and is headquartered in Shantou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shantou",
        "zipcode": "515041",
        "website": "http://www.chmyy.com",
        "market_cap": 702000000
    },
    "600056.SS": {
        "short_name": "CHINA MEHECO CO LTD",
        "long_name": "China Meheco Group Co., Ltd.",
        "summary": "China Meheco Group Co., Ltd. engages in pharmaceutical business in China and internationally. The company imports and exports China national medicines and health products; produces and distributes pharmaceutical and health care products; and operates retail chain pharmacies. Its products include bulk pharmaceutical chemicals antibiotic fermentation and chemical synthesis tablets, injections, capsules, etc.; antibiotics; medicines for the treatment of cardio-cerebrovascular diseases, chronic diseases, and diabetes; antiviral drugs; anti-infectious agents; gastrointestinal drugs; non-steroidal anti-inflammatory drugs; anti-allergic agents; specialty botanicals; western medicine preparations; Chinese patent medicines and herbal pieces; medical equipment and supplies; biological products and raw materials; chemical raw materials; and nutritional and other healthcare products. The company also plants, processes, warehouses, and transports ginseng, licorice, ephedra, rhubarb, fennel, and other herbs. China Meheco Group Co., Ltd. was founded in 1984 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100061",
        "website": "http://www.meheco.com",
        "market_cap": 13698040832
    },
    "600739.SS": {
        "short_name": "LIAONING CHENGDA",
        "long_name": "Liaoning Cheng Da Co., Ltd.",
        "summary": "Liaoning Cheng Da Co., Ltd. engages in trading, pharmaceutical and medical treatment, financial investment, and energy development businesses in China and internationally. The company trades in textile and apparel, chemical products, coal, aquatic products, timber and board materials, flooring, and furniture and components, and steel; and offers medical insurance. It is also involved in research, development, production, and marketing human and veterinary vaccines; pharmaceutical retail, and wholesale and logistics distribution activities; and the provision of medical enterprise management consulting; and medical industry investment and medical equipment sales businesses. In addition, the company offers medical technology, computer hardware and software technology development, technology consulting and transfer, and technical services; and operates gastroenterology and thoracic specialist hospital, as well as medical examination and pathology imaging center. Further, it engages in securities, insurance, and fund activities; and the development of oil shale projects. Liaoning Cheng Da Co., Ltd. was founded in 1991 and is headquartered in Dalian, China.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": null,
        "website": "http://www.chengda.com.cn",
        "market_cap": 34219612160
    },
    "603368.SS": {
        "short_name": "GUANGXI LIUZHOU PHARMACEUTICAL ",
        "long_name": "Guangxi Liuzhou Pharmaceutical Co., Ltd.",
        "summary": "Guangxi Liuzhou Pharmaceutical Co., Ltd. engages in the distribution and retail of pharmaceutical products in China. The company was founded in 1981 and is based in Liuzhou, China. Guangxi Liuzhou Pharmaceutical Co., Ltd. is a subsidiary of Liuzhou Liangmianzhen Co., Ltd.",
        "currency": "CNY",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Liuzhou",
        "zipcode": "545001",
        "website": "http://www.lzyy.cn",
        "market_cap": 7118360576
    },
    "CHME": {
        "short_name": "CHINA MEDICINE CORP",
        "long_name": "China Medicine Corporation",
        "summary": "China Medicine Corporation produces and distributes prescription and over the counter drugs, traditional Chinese medicine products, herbs and dietary-supplements, medical devices, and medical formulations in China. The company offers various products for applications, including oncology, high blood pressure, and removal of toxins from food and animal feeds. It provides products that treat stagnation of the heart blood, obstruction of qi in the chest, cardiodynia, headache, and dysmenorrhea; upper respiratory tract infection, acute faucitis, acute tonsillitis, acute gastroenteritis, etc.; acute and chronic hepatitis, deferment hepatitis, cholecystitis, etc.; irregular menstruation, dysmenorrhea, and amenorrhea; anemia and deficiency of vital energy; palpitation, dizziness, and fatigue; and cerebral arteriosclerosis and ischemic stroke. The company distributes its products through a sales network in China. The company was formerly known as Lounsberry Holdings III, Inc. and changed its name to China Medicine Corporation in May 2006. China Medicine Corporation was founded in 2005 and is based in Guangzhou, China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510006",
        "website": "http://www.cmc621.com/cmc/index.php",
        "market_cap": 2464425
    },
    "S1R.F": {
        "short_name": "SHANGHAI PHARM.HLDG H YC1",
        "long_name": "Shanghai Pharmaceuticals Holding Co., Ltd",
        "summary": "Shanghai Pharmaceuticals Holding Co., Ltd., an investment holding company, researches, develops, manufactures, distributes, and retails pharmaceutical and healthcare products in the People's Republic of China. It operates through Production, Distribution, Retail, and Others segments. The company offers chemicals and biochemicals, Chinese medicines, healthcare products, and medical devices in various therapeutic areas, including digestion and immune system, cardiovascular, anti-infection, nervous system and mental disorder, and oncology. It provides approximately 700 varieties of drugs. The company also engages in the provision of pharmaceutical distribution, warehousing, logistics, and other value-added pharmaceutical supply chain solutions and related services to pharmaceutical manufacturers and dispensers, such as hospitals, distributors, and retail pharmacies. In addition, it engages in the operation of a network of retail pharmacy stores; online drug retail business; and provision of consulting services, as well as in the assets management operations, etc. Further, the company manufactures and trades in medicines. It operates approximately 2,000 retail chain pharmacies in 16 provinces. The company was incorporated in 1994 and is headquartered in Shanghai, the People's Republic of China. Shanghai Pharmaceuticals Holding Co., Ltd. is a subsidiary of Shanghai Pharmaceutical (Group) Co., Ltd.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200020",
        "website": "http://www.sphchina.com",
        "market_cap": 6927394816
    },
    "SHPMF": {
        "short_name": "SHANGHAI PHARMACEUTICALS HOLDIN",
        "long_name": "Shanghai Pharmaceuticals Holding Co., Ltd",
        "summary": "Shanghai Pharmaceuticals Holding Co., Ltd., an investment holding company, researches, develops, manufactures, distributes, and retails pharmaceutical and healthcare products in the People's Republic of China. It operates through Production, Distribution, Retail, and Others segments. The company offers chemicals and biochemicals, Chinese medicines, healthcare products, and medical devices in various therapeutic areas, including digestion and immune system, cardiovascular, anti-infection, nervous system and mental disorder, and oncology. It provides approximately 700 varieties of drugs. The company also engages in the provision of pharmaceutical distribution, warehousing, logistics, and other value-added pharmaceutical supply chain solutions and related services to pharmaceutical manufacturers and dispensers, such as hospitals, distributors, and retail pharmacies. In addition, it engages in the operation of a network of retail pharmacy stores; online drug retail business; and provision of consulting services, as well as in the assets management operations, etc. Further, the company manufactures and trades in medicines. It operates approximately 2,000 retail chain pharmacies in 16 provinces. The company was incorporated in 1994 and is headquartered in Shanghai, the People's Republic of China. Shanghai Pharmaceuticals Holding Co., Ltd. is a subsidiary of Shanghai Pharmaceutical (Group) Co., Ltd.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200020",
        "website": "http://www.sphchina.com",
        "market_cap": 8262042112
    },
    "SHPMY": {
        "short_name": "SHANGHAI PHARMACEUTICALS HOLDIN",
        "long_name": "Shanghai Pharmaceuticals Holding Co., Ltd",
        "summary": "Shanghai Pharmaceuticals Holding Co., Ltd., an investment holding company, researches, develops, manufactures, distributes, and retails pharmaceutical and healthcare products in the People's Republic of China. It operates through Production, Distribution, Retail, and Others segments. The company offers chemicals and biochemicals, Chinese medicines, healthcare products, and medical devices in various therapeutic areas, including digestion and immune system, cardiovascular, anti-infection, nervous system and mental disorder, and oncology. It provides approximately 700 varieties of drugs. The company also engages in the provision of pharmaceutical distribution, warehousing, logistics, and other value-added pharmaceutical supply chain solutions and related services to pharmaceutical manufacturers and dispensers, such as hospitals, distributors, and retail pharmacies. In addition, it engages in the operation of a network of retail pharmacy stores; online drug retail business; and provision of consulting services, as well as in the assets management operations, etc. Further, the company manufactures and trades in medicines. It operates approximately 2,000 retail chain pharmacies in 16 provinces. The company was incorporated in 1994 and is headquartered in Shanghai, the People's Republic of China. Shanghai Pharmaceuticals Holding Co., Ltd. is a subsidiary of Shanghai Pharmaceutical (Group) Co., Ltd.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200020",
        "website": "http://www.sphchina.com",
        "market_cap": 8651726848
    },
    "SHTDF": {
        "short_name": "SINOPHARM GROUP CO. LTD.",
        "long_name": "Sinopharm Group Co., Ltd.",
        "summary": "Sinopharm Group Co. Ltd., together with its subsidiaries, engages in the wholesale and retail of pharmaceutical and medical devices and healthcare products in the People's Republic of China. The company operates through four segments: Pharmaceutical Distribution, Medical Devices, Retail Pharmacy, and Other Business. The Pharmaceutical Distribution segment distributes pharmaceutical products to hospitals, other distributors, retail drug stores, and clinics. This segment also offers distribution, logistics, and other value-added services for domestic and international pharmaceutical and healthcare products manufacturers, and other suppliers. The Medical Devices segment distributes medical devices. The Retail Pharmacy segment operates and franchises a network of retail drug stores. As of December 31, 2020, this segment had 8,977 retail pharmacies. The Other Business segment engages in the production and sale of pharmaceutical products, chemical reagents, and laboratory supplies. The company also rents and manages properties; distributes medical instruments, Chinese herbal medicines, antibiotics, and biological products; and offers information technology development and medicine consultation, investment, goods and technology import and export, business consultation, health consultation, medical consultation, market information consultation and investigation, and convention and exhibition services. In addition, it manages medical project investment, consulting, and technology training activities. The company was founded in 2003 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200023",
        "website": "http://www.sinopharmgroup.com.cn",
        "market_cap": 10500503552
    },
    "SHTDY": {
        "short_name": "SINOPHARM GROUP CO. LTD.",
        "long_name": "Sinopharm Group Co., Ltd.",
        "summary": "Sinopharm Group Co. Ltd., together with its subsidiaries, engages in the wholesale and retail of pharmaceutical and medical devices and healthcare products in the People's Republic of China. The company operates through four segments: Pharmaceutical Distribution, Medical Devices, Retail Pharmacy, and Other Business. The Pharmaceutical Distribution segment distributes pharmaceutical products to hospitals, other distributors, retail drug stores, and clinics. This segment also offers distribution, logistics, and other value-added services for domestic and international pharmaceutical and healthcare products manufacturers, and other suppliers. The Medical Devices segment distributes medical devices. The Retail Pharmacy segment operates and franchises a network of retail drug stores. As of December 31, 2020, this segment had 8,977 retail pharmacies. The Other Business segment engages in the production and sale of pharmaceutical products, chemical reagents, and laboratory supplies. The company also rents and manages properties; distributes medical instruments, Chinese herbal medicines, antibiotics, and biological products; and offers information technology development and medicine consultation, investment, goods and technology import and export, business consultation, health consultation, medical consultation, market information consultation and investigation, and convention and exhibition services. In addition, it manages medical project investment, consulting, and technology training activities. The company was founded in 2003 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200023",
        "website": "http://www.sinopharmgroup.com.cn",
        "market_cap": 9507845120
    },
    "X2S.F": {
        "short_name": "SINOPHARM GRP CO.LTD.YC 1",
        "long_name": "Sinopharm Group Co., Ltd.",
        "summary": "Sinopharm Group Co. Ltd., together with its subsidiaries, engages in the wholesale and retail of pharmaceutical and medical devices and healthcare products in the People's Republic of China. The company operates through four segments: Pharmaceutical Distribution, Medical Devices, Retail Pharmacy, and Other Business. The Pharmaceutical Distribution segment distributes pharmaceutical products to hospitals, other distributors, retail drug stores, and clinics. This segment also offers distribution, logistics, and other value-added services for domestic and international pharmaceutical and healthcare products manufacturers, and other suppliers. The Medical Devices segment distributes medical devices. The Retail Pharmacy segment operates and franchises a network of retail drug stores. As of December 31, 2020, this segment had 8,977 retail pharmacies. The Other Business segment engages in the production and sale of pharmaceutical products, chemical reagents, and laboratory supplies. The company also rents and manages properties; distributes medical instruments, Chinese herbal medicines, antibiotics, and biological products; and offers information technology development and medicine consultation, investment, goods and technology import and export, business consultation, health consultation, medical consultation, market information consultation and investigation, and convention and exhibition services. In addition, it manages medical project investment, consulting, and technology training activities. The company was founded in 2003 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200023",
        "website": "http://www.sinopharmgroup.com.cn",
        "market_cap": 8975308800
    },
    "X2S1.F": {
        "short_name": "SINOPHARM GROUP 1/5/O.N.",
        "long_name": "Sinopharm Group Co., Ltd.",
        "summary": "Sinopharm Group Co. Ltd., together with its subsidiaries, engages in the wholesale and retail of pharmaceutical and medical devices and healthcare products in the People's Republic of China. The company operates through four segments: Pharmaceutical Distribution, Medical Devices, Retail Pharmacy, and Other Business. The Pharmaceutical Distribution segment distributes pharmaceutical products to hospitals, other distributors, retail drug stores, and clinics. This segment also offers distribution, logistics, and other value-added services for domestic and international pharmaceutical and healthcare products manufacturers, and other suppliers. The Medical Devices segment distributes medical devices. The Retail Pharmacy segment operates and franchises a network of retail drug stores. As of December 31, 2020, this segment had 8,977 retail pharmacies. The Other Business segment engages in the production and sale of pharmaceutical products, chemical reagents, and laboratory supplies. The company also rents and manages properties; distributes medical instruments, Chinese herbal medicines, antibiotics, and biological products; and offers information technology development and medicine consultation, investment, goods and technology import and export, business consultation, health consultation, medical consultation, market information consultation and investigation, and convention and exhibition services. In addition, it manages medical project investment, consulting, and technology training activities. The company was founded in 2003 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200023",
        "website": "http://www.sinopharmgroup.com.cn",
        "market_cap": 8470696448
    }
}