{
    "002207.SZ": {
        "short_name": "XINJIANG ZHUNDONG",
        "long_name": "Xinjiang Zhundong Petroleum Technology Co., Ltd.",
        "summary": "Xinjiang Zhundong Petroleum Technology Co., Ltd. provides oilfield dynamic monitoring and oil recovery technology solutions for oil and gas exploration companies in China and internationally. The company offers petroleum technology, oil field management, construction and installation, and transportation services. Its services include oilfield dynamic monitoring well testing; production testing; downhole operations, including clearing and preventing wax, profile control, water plugging, acidification, fracturing, coiled tubing operations, application of oilfield nitrogen technology, and workover; power electrical installation engineering; storage tank machinery cleaning; and transportation services. It also manufactures and sells oilfield chemical additives, such as polyacrylamide, clay anti-swelling agent, wax, crosslinking agents, flooding additives, and organic salts aggravating agent products, as well as produces oil products, including oil additives, chemical additives, drilling additives, and cementing additives. Xinjiang Zhundong Petroleum Technology Co., Ltd. was incorporated in 2001 and is based in Changji, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changji",
        "zipcode": "831511",
        "website": "http://www.zygf.com.cn",
        "market_cap": "Small Cap"
    },
    "002353.SZ": {
        "short_name": "YANTAI JEREH OILFI",
        "long_name": "Yantai Jereh Oilfield Services Group Co., Ltd.",
        "summary": "Yantai Jereh Oilfield Services Group Co., Ltd. provides integrated solutions for the oil and gas, power, and environmental management sectors worldwide. It offers various equipment, such as drilling and workover equipment, cementing fleets, fracturing spreads, coiled tubing units, nitrogen pumping units, heating equipment, plunger pumps and spares, simulation training systems, flowline products, well control equipment, and wellhead equipment; and gas compressors. It also provides integrated oilfield and management services, drilling and completion services, workover and stimulation services, and oil production services; and oilfield surface, gas field surface, pipeline, and liquefied natural gas (LNG) engineering services, as well as oil and gas storage, oil refinery and petrochemical, and LNG/CNG fueling services. In addition, the company provides consulting services, such as investment opportunity study, design, preliminary feasibility-study and feasibility-study report, general-planning design, evaluation of post-production, and others; engineering services consisting of conceptual design, process design package, FEED and basic design, and detail design services; procurement services; construction management services; and modular fabrication services. Further, it offers ecological remediation, solid waste treatment, wastewater treatment, and equipment manufacturing services; and engages in fossil and new energy, and combined energy generation activities. The company was formerly known as Yantai Jereh Equipment Group Co., Ltd. and changed its name to Yantai Jereh Oilfield Services Group Co., Ltd. in November 2007. Yantai Jereh Oilfield Services Group Co., Ltd. was founded in 1999 and is based in Yantai, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yantai",
        "zipcode": "264003",
        "website": "http://www.jereh.com",
        "market_cap": "Large Cap"
    },
    "002490.SZ": {
        "short_name": "SHANDONG MOLONG PE",
        "long_name": "Shandong Molong Petroleum Machinery Company Limited",
        "summary": "Shandong Molong Petroleum Machinery Company Limited engages in the research and development, production, and sale of products for the energy equipment industry in the People's Republic of China. The company operates through Pipe Products, Three Kinds of Pumping Units, Petroleum Machinery Parts, Tube Blank, and Others segments. It offers pipes for petroleum and gas extraction, fluid and structural pipes, petroleum pumping machines, petroleum pumps, petroleum pumping rods, cylinder liners for drilling rigs, valve parts, and casting and forging solutions . The company's products also include API and non API casing products, line pipe products, precision steel pipes, hydraulic prop tubes, fluid pipes, cylinder tubes, and boiler tubes; sucker rods; valve body, cylinder liners, gate valves, and billet products. Its products are used in petroleum, natural gas, coalbed methane, shale gas and other energy drilling, machinery processing, urban pipe network, etc. In addition, the company engages in the research of new materials for energy equipment; production and sale of metal casting and forging; sea water desalination activities; waste heat and gas power generation activities; and manufacture and sale of special oil metal materials. It also exports its energy equipment. Shandong Molong Petroleum Machinery Company Limited was founded in 2001 and is based in Shouguang City, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shouguang",
        "zipcode": "262700",
        "website": "http://www.molonggroup.com",
        "market_cap": "Mid Cap"
    },
    "002629.SZ": {
        "short_name": "ZHEJIANG RENZHI CO",
        "long_name": "Zhejiang Renzhi Co., Ltd.",
        "summary": "Zhejiang Renzhi Co., Ltd. provides professional services in the oil and gas drilling and engineering fields primarily in China. It is involved in the development, production, and sale of oilfield chemicals; and development, production, sale, and import and export trade of new materials. The company also offers drilling fluid technical services; oilfield special equipment inspection and repair services; and anti-corrosion engineering services. The company was formerly known as Sichuan Renzhi Oilfield Technology Services Co., Ltd. and changed its name to Zhejiang Renzhi Co., Ltd. in October 2016. Zhejiang Renzhi Co., Ltd. was founded in 1998 and is based in Wenzhou, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wenzhou",
        "zipcode": null,
        "website": "http://www.chinarenzhi.com",
        "market_cap": "Small Cap"
    },
    "0196.HK": {
        "short_name": "HONGHUA GROUP",
        "long_name": "Honghua Group Limited",
        "summary": "Honghua Group Limited, an investment holding company, engages in the research, design, manufacture, setting, and sale of land rigs, related parts, and components. It operates through Land Drilling Rigs; Parts and Components and Others; Drilling Engineering Services; and Fracturing segments. The company designs and manufactures mast and substructures, as well as hoisting, rotating, high and low pressure mud, and auxiliary system parts for rigs; manufactures and assembles rig electrical equipment, including VFD systems, SCR systems, MCC systems, drilling motors, well site circuitry and lighting systems, etc.; and manufactures mud tanks, solids control equipment, drill floor tools, mud manifolds and personnel camps, etc. It also offers various oil and gas engineering services, including well drilling, directional drilling, and seismic services for CNOOC, SHELL, MOGE, PTTEP, NOBEL, etc. In addition, the company provides direct financing lease, operating leasing, sale and leaseback, sublease, and trust and joint lease financing services. Further, it manufactures panels of drilling rigs; trades in drilling rigs and related parts; designs and manufactures offshore drilling modules; and provides technical support, and drilling and fracturing engineering services, as well as after-sales service covering rig installation, commissioning, and solution. The company operates in the People's Republic of China, the Americas, the Middle East, Europe, and Africa, as well as Central, South, and South East Asia. Honghua Group Limited was founded in 1997 and is headquartered in Chengdu, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610036",
        "website": "http://www.hh-gltd.com",
        "market_cap": "Small Cap"
    },
    "0568.HK": {
        "short_name": "SHANDONG MOLONG",
        "long_name": "Shandong Molong Petroleum Machinery Company Limited",
        "summary": "Shandong Molong Petroleum Machinery Company Limited engages in the research and development, production, and sale of products for the energy equipment industry in the People's Republic of China. The company operates through Pipe Products, Three Kinds of Pumping Units, Petroleum Machinery Parts, Tube Blank, and Others segments. It offers pipes for petroleum and gas extraction, fluid and structural pipes, petroleum pumping machines, petroleum pumps, petroleum pumping rods, cylinder liners for drilling rigs, valve parts, and casting and forging solutions . The company's products also include API and non API casing products, line pipe products, precision steel pipes, hydraulic prop tubes, fluid pipes, cylinder tubes, and boiler tubes; sucker rods; valve body, cylinder liners, gate valves, and billet products. Its products are used in petroleum, natural gas, coalbed methane, shale gas and other energy drilling, machinery processing, urban pipe network, etc. In addition, the company engages in the research of new materials for energy equipment; production and sale of metal casting and forging; sea water desalination activities; waste heat and gas power generation activities; and manufacture and sale of special oil metal materials. It also exports its energy equipment. Shandong Molong Petroleum Machinery Company Limited was founded in 2001 and is based in Shouguang City, China.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shouguang",
        "zipcode": "262700",
        "website": "http://www.molonggroup.com",
        "market_cap": "Mid Cap"
    },
    "1080.HK": {
        "short_name": "SHENGLI PIPE",
        "long_name": "Shengli Oil & Gas Pipe Holdings Limited",
        "summary": "Shengli Oil & Gas Pipe Holdings Limited, an investment holding company, designs, processes, manufactures, and sells welded pipes for oil and gas pipeline, and other construction and manufacturing applications in Mainland China and Hong Kong. The company operates through two segments, Pipes Business and Trading Business. It produces submerged-arc helical and longitudinal welded pipes that are primarily used to transport crude oil, refined petroleum products, natural gas, and other related products, as well as used for the oil and infrastructure industry. The company also engages in the provision of anti-corrosion services for oil and gas pipelines, and other construction and manufacturing applications; trading of environmental energy equipment, fuel oil and chemical products, and commodities; and provision of new energy technical development services. In addition, it offers anti-corrosion technical and rental services; and trades in rolled coils. Shengli Oil & Gas Pipe Holdings Limited was founded in 1972 and is headquartered in Zibo, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zibo",
        "zipcode": "255082",
        "website": "http://www.slogp.com",
        "market_cap": "Small Cap"
    },
    "1623.HK": {
        "short_name": "HILONG",
        "long_name": "Hilong Holding Limited",
        "summary": "Hilong Holding Limited, an investment holding company, provides oil field equipment and services worldwide. The company operates through Oilfield Equipment Manufacturing and Services, Line Pipe Technology and Services, Oilfield Services, and Offshore Engineering Service segments. The Oilfield Equipment Manufacturing and Service segment produces and sells oilfield equipment; and offers oil country tubular goods (OCTG) coating services. The Line Pipe Technology and Services segment provides services related to oil and gas pipeline; and produces coating materials for anticorrosive and anti-friction purposes. The Oilfield Services segment offers well drilling services; integrated comprehensive services; and OCTG trading and related services to oil and gas producers. The Offshore Engineering Services segment provides offshore engineering and design services. The company is also involved in the manufacture, trading, and distribution of oil and gas equipment; the manufacture and distribution of hardbanding materials and special steel; the research and development on the technology of manufacturing oil and gas equipment, as well as coating services; the research, inspection, and repairment of oil and gas equipment; and the provision of offshore oilfield services. Hilong Holding Limited was founded in 2002 and is headquartered in Shanghai, the People's Republic of China. Hilong Holding Limited is a subsidiary of Hilong Group Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200949",
        "website": "http://www.hilonggroup.com",
        "market_cap": "Small Cap"
    },
    "1921.HK": {
        "short_name": "DALIPAL HLDG",
        "long_name": "Dalipal Holdings Limited",
        "summary": "Dalipal Holdings Limited, together with its subsidiaries, develops, manufactures, and sells oil country tubular goods, other oil pipes, and pipe billets in the People's Republic of China and internationally. The company was founded in 1998 and is headquartered in Cangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Cangzhou",
        "zipcode": null,
        "website": "http://www.dalipal.com",
        "market_cap": "Mid Cap"
    },
    "2883.HK": {
        "short_name": "CHINA OILFIELD",
        "long_name": "China Oilfield Services Limited",
        "summary": "China Oilfield Services Limited, together with its subsidiaries, provides integrated offshore oilfield services in Mainland China and internationally. The company operates through four segments: Drilling Services, Well Services, Marine Support Services, and Geophysical Acquisition and Surveying Services. The Drilling Services segment provides jack-up drilling rig, semi-submersible drilling rig, module rig, and land drilling rig services. As of December 31, 2020, it operated and managed 57 drilling rigs, which include 43 jack-up drilling rigs and 14 semi-submersible drilling rigs; and 5 module rigs. The Well Services segment offers onshore and offshore well services, including logging, drilling and completion fluids, directional drilling, cementing, well completion and workover, stimulation, etc. The Marine Support Services segment owns and operates offshore vessels that provide services for offshore oil and gas exploration, development, construction, and production. This segment also offers anchor handling for various water level, towing of drilling rigs/engineering barges, oil lifting, offshore transportation, standby, firefighting, rescue, oil spill assisting, and other marine support services. It operates and manages approximately 140 vessels, including AHTS vessels, platform supply vessels, and oilfield standby vessels. The Geophysical Acquisition and Surveying Services segment provides offshore seismic acquisition, offshore geo-surveying, seismic data processing and interpretation, and fundamental construction services. This segment owns 5 towing streamer seismic vessels, 1 professional source vessel, 2 ocean bottle cable teams, 5 integrated marine surveying vessels, and 2 support vessels. China Oilfield Services Limited also issues bonds. The company is based in Sanhe, China. China Oilfield Services Limited is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Sanhe",
        "zipcode": "065201",
        "website": "http://www.cosl.com.cn",
        "market_cap": "Large Cap"
    },
    "300084.SZ": {
        "short_name": "HAIMO TECHNOLOGIES",
        "long_name": "Haimo Technologies Group Corp.",
        "summary": "Haimo Technologies Group Corp. manufactures and sells oilfield equipment and instruments for oilfield service companies in China, the Middle East, North Africa, Central, South and Southeast Asia, and North and South America. It offers multiphase flow meters (MPFM), wet gas meters, bulk multiphase meters, high performance and low production testers, shale oil/gas meters, and mobile well testing and production measurement services. The company also provides fluid end assemblies for fracking; accessories, including joints, valves, and valve seating products; ball injectors; and high pressure fluid components and manifolds. In addition, it offers environmental protection equipment and services, such as wastewater treatment and reuse, solid waste disposal, and contaminated soil remediation from industries of oil and gas production and refinery, municipal, mining and chemical processing, etc. Further, the company provides integrated production optimization services, as well as value added services, including data validation and cleansing, well testing verification and optimization, intelligent allocation, water injection optimization, real-time well monitoring and alarm systems, and production analysis and enhancement consultation services. Additionally, it is involved in the oil and gas exploration, development, and production activities. The company was formerly known as Lanzhou Haimo Technologies Co., Ltd. and changed its name to Haimo Technologies Group Corp. in November 2016. Haimo Technologies Group Corp. was founded in 1994 and is based in Lanzhou, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lanzhou",
        "zipcode": "730010",
        "website": "http://www.haimotech.com",
        "market_cap": "Small Cap"
    },
    "300157.SZ": {
        "short_name": "LANDOCEAN GROUP LI",
        "long_name": "LandOcean Energy Services Co.,Ltd.",
        "summary": "LandOcean Energy Services Co.,Ltd. research, develops, commercializes, and sells petroleum exploration and development software, oil and gas equipment, downhole equipment, and instrument technology in China and internationally. It engages in the geological and geophysical, engineering technology, high-end equipment manufacturing, and cloud computing big data businesses. The company also provides business development and technical services. It serves oil and gas industry. LandOcean Energy Services Co.,Ltd. is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100094",
        "website": "http://www.ldocean.com.cn",
        "market_cap": "Mid Cap"
    },
    "300164.SZ": {
        "short_name": "TONG PETROTECH COR",
        "long_name": "Tong Petrotech Corp.",
        "summary": "Tong Petrotech Corp., together with its subsidiaries, researches, develops, manufactures, sells, and services perforation technology services to oilfield customers. The company offers horizontal perforation completion technology, fracturing completion perforation technology, vertical well fracturing perforation completion technology, horizontal well perforation fracturing technology, and old well plugging removal technology services. It also provides directional drilling and drilling technology services; and fracturing design, horizontal well staged fracturing, fast drilling bridge plug technology, and evaluation services, as well as oil recovery and oil block development services. In addition, the company produces and sells approximately 100,000 meters of various types of guns; and exports 100,000 composite perforating and pumping guns to the United States. It operates in the People's Republic of China, the United States, Indonesia, Kazakhstan, and internationally. The company was formerly known as Tong Oil Tools Co., Ltd. and changed its name to Tong Petrotech Corp. in June 2019. Tong Petrotech Corp. was founded in 1995 and is headquartered in Xi'an, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710075",
        "website": "http://www.tongoiltools.com",
        "market_cap": "Mid Cap"
    },
    "300191.SZ": {
        "short_name": "SINO GEOPHYSICAL C",
        "long_name": "Sino Geophysical Co., Ltd",
        "summary": "Sino Geophysical Co., Ltd. provides integrated oil and gas exploration and development technology services in China and internationally. It offers technical services, such as acquisition and processing integration, and unconventional oil and gas, and geothermal services, as well as earthquake, geological, and engineering integration services. The company also engages in oil and gas investment; and asset management activities. Sino Geophysical Co., Ltd. was incorporated in 2003 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100107",
        "website": "http://www.sinogeo.com",
        "market_cap": "Mid Cap"
    },
    "300471.SZ": {
        "short_name": "HOUPU CLEAN ENERGY",
        "long_name": "Houpu Clean Energy Co., Ltd.",
        "summary": "Houpu Clean Energy Co., Ltd. provides clean energy equipment solutions in China. The company also offers refueling solutions in clean energy applications; platform operation and supervision services based on Internet, cloud computing, and big data analysis; CRM and PLM system based site operation and maintenance services; and energy chemical engineering consulting, survey, engineering, construction, installation, and project management services. It provides compressed natural gas (CNG) filling station station-level management systems, intelligent gun detachment detection devices, electric control cabinets, CNG program control panels, CNG verification devices, CNG universal intelligent gas dispensers, verification devices of liquefied natural gas (LNG) dispensers, L-CNG trunk-type skid-mounted filling equipment, L-CNG/CNG filling stations, LNG filling stations, LNG fully skid-mounted filling devices, unattended skid-mounted filling devices, LNG filling machines, and LNG station control systems for vehicles. The company also offers LNG fuel-powered ship supply systems, mobile LNG filling stations, gas supply systems, and barges LNG filling stations for marine applications; LNG tanker gas supply skids, LNG gas supply skids, LNG dewar flask gas supply skids, LNG split gas supply skids, and LNG fixed civil stations for civil applications; and hydrogen station control systems and dispensers, and hydrogenation skid-mounted equipment; and components. The company was formerly known as Chengdu Huaqi Houpu Holding Co.,Ltd. and changed its name to Houpu Clean Energy Co., Ltd. in August 2019. Houpu Clean Energy Co., Ltd. was founded in 2005 and is based in Chengdu, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "611730",
        "website": "http://www.hqhop.com",
        "market_cap": "Mid Cap"
    },
    "3303.HK": {
        "short_name": "JUTAL OIL SER",
        "long_name": "Jutal Offshore Oil Services Limited",
        "summary": "Jutal Offshore Oil Services Limited, an investment holding company, engages in the fabrication of facilities, and provision of integrated services for oil and gas industries, new energy, and refining and chemical industries. The company offers offshore engineering and modular construction services, including construction of large-scale modules, such as onshore LNG modules, modular plants, upper modules of offshore platforms, and FPSO/FLNG modules; petrochemical and shipbuilding services comprising projects in oil and gas process modules, petrochemical equipment and undersea business, and EPC contracting services; and technical support services for shipbuilding industry, as well as ship repair and construction services. It also provides oil and gas treatment technical services, which include treatment technology and solutions in natural gas purification and treatment, oil production water treatment, and sludge purification; and new energy equipment construction services, such as services for the development and utilization of new energy, as well as undertakes construction of crane products. It operates in the People's Republic of China, the United States, Switzerland, Norway, Singapore, Japan, France, the United Kingdom, the Netherlands, and internationally. Jutal Offshore Oil Services Limited was founded in 1995 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518068",
        "website": "http://www.jutal.com",
        "market_cap": "Mid Cap"
    },
    "3337.HK": {
        "short_name": "ANTON OILFIELD",
        "long_name": "Anton Oilfield Services Group",
        "summary": "Anton Oilfield Services Group, an investment holding company, provides oil and gas field development technical services for oil companies in the People's Republic of China and internationally. It operates through three segments: Drilling Technology, Well Completion, and Oil Production Services. The company offers geology technology services, such as oil and gas field design and development, geological engineering, and geological research and technical support; oilfield management and oil and gas development general contract services, including production capacity construction, oil and gas field management general contract, oil/gas field cooperative development, digital oilfield management, reservoir technology support, oilfield operation and maintenance, and supervision; and drilling technology services comprising integrated drilling, rig, directional drilling, drilling fluid and completion fluid, oilfield environmental protection, and cementing. It also provides completion technology services, such as stimulation and integrated completion, completion technique and tool, sand control, fracturing and pumping, coiled tubing operation, stimulation chemical, and logging; workover and well testing, and oil production technology services; and inspection technology, including oilfield nondestructive detection and evaluation, special equipment testing, gas leaking inspection, pipeline inspection, metrology inspection, and environmental inspection, as well as tubing and casing inspection, repairing, and anti-corrosion technology services. In addition, the company offers asset leasing services, such as drilling tool, drilling equipment, oilfield production equipment, and oilfield production facility leasing services. Further, it manufactures rod casings; and provides construction services. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.antonoil.com",
        "market_cap": "Small Cap"
    },
    "3899.HK": {
        "short_name": "CIMC ENRIC",
        "long_name": "CIMC Enric Holdings Limited",
        "summary": "CIMC Enric Holdings Limited designs, develops, manufactures, engineers, and maintains transportation, storage, and processing equipment for the energy, chemicals, environmental, and liquid food industries worldwide. Its Clean Energy segment manufactures and operates equipment for the storage, transportation, processing, and distribution of liquefied natural gas, compressed natural gas, and liquefied petroleum gas; and offers engineering, procurement, and construction (EPC) services for the clean energy industry, as well as intelligent IOT platforms under the Anjiehui brand. It offers its products under the Enric, Sanctum, Hongtu, CIMC Tank, Cryobest, YPDI, CIMC SOE, CIMC Hydrogen Energy, and Hashenleng brands. Its Chemical and Environmental segment offers tank containers for the storage and transportation of liquefied or gasified chemicals under the CIMC Tank and Tankmiles brands; maintenance and value-added services for tank containers; and special equipment for environmental protection, as well as environmental protection, pollution treatment, and resource recycling services. Its Liquid Food segment engineers, manufactures, and sells stainless steel tanks for storage and processing liquid food; and provides EPC services for brewery and other liquid food industries under the Ziemann Holvrieka, DME, NSI, McMillan, and Briggs brands. The company also manufactures compressors and accessories, and pressure vessels; offers business solutions for gas equipment; researches and develops technology for natural gas equipment; cryogenic storage and transportation equipment design, manufacture, and technical services; collects, processes, and sells renewable resources; offers terminal and depot, and nonmetallic scrap processing services; and repairs and maintains pressure vessels. The company was incorporated in 2004 and is headquartered in Shenzhen, the People's Republic of China. The company is a subsidiary of China International Marine Containers (Hong Kong) Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518067",
        "website": "http://www.enricgroup.com",
        "market_cap": "Large Cap"
    },
    "4HB.F": {
        "short_name": "HONGHUA GROUP LTD  HD-,10",
        "long_name": "Honghua Group Limited",
        "summary": "Honghua Group Limited, an investment holding company, engages in the research, design, manufacture, setting, and sale of land rigs, related parts, and components. It operates through Land Drilling Rigs; Parts and Components and Others; Drilling Engineering Services; and Fracturing segments. The company designs and manufactures mast and substructures, as well as hoisting, rotating, high and low pressure mud, and auxiliary system parts for rigs; manufactures and assembles rig electrical equipment, including VFD systems, SCR systems, MCC systems, drilling motors, well site circuitry and lighting systems, etc.; and manufactures mud tanks, solids control equipment, drill floor tools, mud manifolds and personnel camps, etc. It also offers various oil and gas engineering services, including well drilling, directional drilling, and seismic services for CNOOC, SHELL, MOGE, PTTEP, NOBEL, etc. In addition, the company provides direct financing lease, operating leasing, sale and leaseback, sublease, and trust and joint lease financing services. Further, it manufactures panels of drilling rigs; trades in drilling rigs and related parts; designs and manufactures offshore drilling modules; and provides technical support, and drilling and fracturing engineering services, as well as after-sales service covering rig installation, commissioning, and solution. The company operates in the People's Republic of China, the Americas, the Middle East, Europe, and Africa, as well as Central, South, and South East Asia. Honghua Group Limited was founded in 1997 and is headquartered in Chengdu, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610036",
        "website": "http://www.hh-gltd.com",
        "market_cap": "Small Cap"
    },
    "5AO.F": {
        "short_name": "ANTON OILFIELD SERVICES",
        "long_name": "Anton Oilfield Services Group",
        "summary": "Anton Oilfield Services Group, an investment holding company, provides oil and gas field development technical services for oil companies in the People's Republic of China and internationally. It operates through three segments: Drilling Technology, Well Completion, and Oil Production Services. The company offers geology technology services, such as oil and gas field design and development, geological engineering, and geological research and technical support; oilfield management and oil and gas development general contract services, including production capacity construction, oil and gas field management general contract, oil/gas field cooperative development, digital oilfield management, reservoir technology support, oilfield operation and maintenance, and supervision; and drilling technology services comprising integrated drilling, rig, directional drilling, drilling fluid and completion fluid, oilfield environmental protection, and cementing. It also provides completion technology services, such as stimulation and integrated completion, completion technique and tool, sand control, fracturing and pumping, coiled tubing operation, stimulation chemical, and logging; workover and well testing, and oil production technology services; and inspection technology, including oilfield nondestructive detection and evaluation, special equipment testing, gas leaking inspection, pipeline inspection, metrology inspection, and environmental inspection, as well as tubing and casing inspection, repairing, and anti-corrosion technology services. In addition, the company offers asset leasing services, such as drilling tool, drilling equipment, oilfield production equipment, and oilfield production facility leasing services. Further, it manufactures rod casings; and provides construction services. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.antonoil.com",
        "market_cap": "Small Cap"
    },
    "600968.SS": {
        "short_name": "CNOOC ENERGY TECHNOLOGY & SERVI",
        "long_name": "CNOOC Energy Technology & Services Limited",
        "summary": "CNOOC Energy Technology & Services Limited operates in the oil and gas industry in China. The company operates through four segments: Energy Technology Services; FPSO Production Technology Services; Energy Logistics Services; Safety, Environmental Protection and Energy Conservation. It offers energy technology services, such as engineering and technical, equipment operation and maintenance, pipeline technical, and data information services; FPSO production technology services; energy logistics services, including logistics, sales, and catering services; and oil spill emergency, safety and environmental protection technology, industrial water treatment, training services, coatings and industrial protection, catalyst, LNG cold energy utilization, and energy conservation and environmental monitoring services. The company is based in Beijing, China. CNOOC Energy Technology & Services Limited is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100027",
        "website": "http://cenertech.cnooc.com.cn",
        "market_cap": "Large Cap"
    },
    "601798.SS": {
        "short_name": "LANPEC TECHNOLOGIES CO LTD.",
        "long_name": "Lanpec Technologies Limited",
        "summary": "Lanpec Technologies Limited manufactures and sells petroleum and petrochemical equipment in China and internationally. The company offers oil drilling machinery, including oil drilling machinery DC drive, DC drive cluster, and 1500-7000 meters series drilling rigs; and mud pumps and mud pump single pumps, mud pump wearing parts and petroleum cylinder roller chains, pumping units/rods/pump products, drill products, and screws drilling and other downhole tools. It also provides refining and chemical equipment, which include shell-and-shell heat exchangers, tube heat exchangers, heat exchanger separators, liquefied natural gas open-frame gasifiers, surface evaporation air coolers, hydrogenation heat exchangers, heat extraction furnaces, plate air cooling, plate evaporators, liquid hydrocarbon spherical storage tanks, cryogenic spherical tanks, egg-shaped sludge digestion tanks, and thermal power unit plate type air-condensing steam devices; synthesis towers, nitrogen storage tanks, and hydrocracking high-pressure heat exchangers; and liquefied petroleum gas cryogenic spherical tanks and liquid hydrocarbon spherical tanks. In addition, the company offers offshore oil equipment comprising oil and gas separation equipment, oil and gas water treatment systems, oily sewage treatment systems, and water injection systems; and engineering software design, as well as technical services. Further, it provides light and food machinery and equipment, such as plate heat exchangers, plate type sterilization units, plate and tube evaporators, and plate condensers. Lanpec Technologies Limited was founded in 1960 and is based in Lanzhou, China. As on March 13, 2020, Lanpec Technologies Limited operates as subsidiary of China Energy Engineering Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lanzhou",
        "zipcode": "730070",
        "website": "http://www.lanpec.com",
        "market_cap": "Mid Cap"
    },
    "603318.SS": {
        "short_name": "SHUIFA ENERGAS GAS CO LTD",
        "long_name": "Dalian Energas Gas-System Co., Ltd.",
        "summary": "Dalian Energas Gas-System Co., Ltd. designs, manufactures, sells, and services fuel gas transmission-distribution systems and related products in China and internationally. Its primary products include fuel gas distribution systems, fuel gas application systems, spare parts, etc. The company's application system products comprise auxiliary equipment for gas turbines, material supply directly pipes for gas turbines, and seal pipes of steam turbines. It also provides gas distribution systems comprising boosting stations, reducing stations, long-distance pipeline distribution systems, offshore platform distribution systems, and city gate stations; gas application systems consisting of final and fuel, water washing, and lubricating oil skids, as well as MSD and seal piping systems; and distributed energy solutions, such as combined cooling heating and power systems. In addition, the company offers fuel gas pressure regulating boxes and regulators, and LNG gas filling stations. Further, it provides manufacturing, packing, transportation, erection, commissioning, start-up, and after sale services. The company was founded in 2002 and is based in Dalian, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116600",
        "website": "http://www.energas.cn",
        "market_cap": "Mid Cap"
    },
    "603619.SS": {
        "short_name": "ZHONGMAN PETROLEUM AND NATURAL ",
        "long_name": "Zhongman Petroleum and Natural Gas Group Corp., Ltd.",
        "summary": "Zhongman Petroleum and Natural Gas Group Corp., Ltd., an oil and gas company, engages in the drilling engineering contractor and petroleum equipment manufacture businesses. The company offers drilling and drilling completion package, oil and gas exploration and development, geological exploration project, international trade, drilling engineering and technology, and vehicle natural gas installation and technical services. It is also involved in the provision of services for the sets of drilling rigs, rig parts, and special vehicles, including pre-delivery training, delivery post-training and technical, station-based spare parts support, drilling team formation, training, technical consultation services, etc.; and intimate services, such as assembly commissioning, technical guidance, user training, use security, maintenance, repair, and other services, as well as manufactures oil rig and equipment. The company operates sales and service networks in various oil fields in China, the Middle East, and Central Asia. Zhongman Petroleum and Natural Gas Group Corp., Ltd. is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.zpec.com",
        "market_cap": "Mid Cap"
    },
    "603727.SS": {
        "short_name": "BOMESC OFFSHORE ENGINEERING CO ",
        "long_name": "BOMESC Offshore Engineering Company Limited",
        "summary": "BOMESC Offshore Engineering Company Limited provides engineering, procurement, and construction (EPC) services for offshore oil and gas industries. The company provides design and construction EPC services for electronic modules, life modules, chemical injection modules, sledges, ocean engineering modules, and modules used in LNG mining, refinery, and chemical plants. It offers design, construction, onshore installation, and shipment and offshore installation for living-quarter, electrical, CEM, process, and the public modules; fire pump rooms; and water tanks and diesel tanks, which are used in the facilities construction of the upper artificial island. The company operates in China, the Middle East, North and South America, Africa, Singapore, Europe, Australia, and internationally. BOMESC Offshore Engineering Company Limited was founded in 1996 and is headquartered in Tianjin, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300457",
        "website": "http://www.bomesc.com",
        "market_cap": "Mid Cap"
    },
    "603800.SS": {
        "short_name": "SUZHOU DOUSON DRILLING AND PROD",
        "long_name": "Suzhou Douson Drilling & Production Equipment Co., Ltd.",
        "summary": "Suzhou Douson Drilling&Production Equipment Co., Ltd. manufactures and sells drilling and production equipment to the oil, gas, and chemical industries in China, the United States, Canada, Spain, the United Kingdom, Australia, the Middle East, and Russia. It offers CW type wellhead equipment, oil and gas production and testing devices, various valves and actuators, manifolds, BOP products, subsea valves and connectors, well control equipment, and driver spindles. The company was founded in 2001 and is headquartered in Suzhou, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": null,
        "website": "http://www.douson.cn",
        "market_cap": "Small Cap"
    },
    "8HL.F": {
        "short_name": "HILONG HOLDING LTD HD-,10",
        "long_name": "Hilong Holding Limited",
        "summary": "Hilong Holding Limited, an investment holding company, provides oil field equipment and services worldwide. The company operates through Oilfield Equipment Manufacturing and Services, Line Pipe Technology and Services, Oilfield Services, and Offshore Engineering Service segments. The Oilfield Equipment Manufacturing and Service segment produces and sells oilfield equipment; and offers oil country tubular goods (OCTG) coating services. The Line Pipe Technology and Services segment provides services related to oil and gas pipeline; and produces coating materials for anticorrosive and anti-friction purposes. The Oilfield Services segment offers well drilling services; integrated comprehensive services; and OCTG trading and related services to oil and gas producers. The Offshore Engineering Services segment provides offshore engineering and design services. The company is also involved in the manufacture, trading, and distribution of oil and gas equipment; the manufacture and distribution of hardbanding materials and special steel; the research and development on the technology of manufacturing oil and gas equipment, as well as coating services; the research, inspection, and repairment of oil and gas equipment; and the provision of offshore oilfield services. Hilong Holding Limited was founded in 2002 and is headquartered in Shanghai, the People's Republic of China. Hilong Holding Limited is a subsidiary of Hilong Group Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200949",
        "website": "http://www.hilonggroup.com",
        "market_cap": "Small Cap"
    },
    "AMCF": {
        "short_name": "ANDATEE CHINA MARINE FUEL SVCS ",
        "long_name": "Andatee China Marine Fuel Services Corporation",
        "summary": "Andatee China Marine Fuel Services Corporation, through its subsidiaries, engages in the production, storage, distribution, and trading of blended marine fuel oil for cargo and fishing vessels in the People's Republic of China. The company also produces customer specific products using its proprietary blending technology. It sells its products through distributors, as well as to retail customers in Liaoning, Shandong, Jiangsu, Shanghai, Guangdong, and Zhejiang Provinces. The company is based in Dalian, the People's Republic of China.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": null,
        "website": "http://www.andatee.com",
        "market_cap": "Small Cap"
    },
    "CHOLF": {
        "short_name": "CHINA OILFIELD SERVICES",
        "long_name": "China Oilfield Services Limited",
        "summary": "China Oilfield Services Limited, together with its subsidiaries, provides integrated offshore oilfield services in Mainland China and internationally. The company operates through four segments: Drilling Services, Well Services, Marine Support Services, and Geophysical Acquisition and Surveying Services. The Drilling Services segment provides jack-up drilling rig, semi-submersible drilling rig, module rig, and land drilling rig services. As of December 31, 2020, it operated and managed 57 drilling rigs, which include 43 jack-up drilling rigs and 14 semi-submersible drilling rigs; and 5 module rigs. The Well Services segment offers onshore and offshore well services, including logging, drilling and completion fluids, directional drilling, cementing, well completion and workover, stimulation, etc. The Marine Support Services segment owns and operates offshore vessels that provide services for offshore oil and gas exploration, development, construction, and production. This segment also offers anchor handling for various water level, towing of drilling rigs/engineering barges, oil lifting, offshore transportation, standby, firefighting, rescue, oil spill assisting, and other marine support services. It operates and manages approximately 140 vessels, including AHTS vessels, platform supply vessels, and oilfield standby vessels. The Geophysical Acquisition and Surveying Services segment provides offshore seismic acquisition, offshore geo-surveying, seismic data processing and interpretation, and fundamental construction services. This segment owns 5 towing streamer seismic vessels, 1 professional source vessel, 2 ocean bottle cable teams, 5 integrated marine surveying vessels, and 2 support vessels. China Oilfield Services Limited also issues bonds. The company is based in Sanhe, China. China Oilfield Services Limited is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Sanhe",
        "zipcode": "065201",
        "website": "http://www.cosl.com.cn",
        "market_cap": "Mid Cap"
    },
    "CO9.F": {
        "short_name": "CHINA OILFIELD SVCS H YC1",
        "long_name": "China Oilfield Services Limited",
        "summary": "China Oilfield Services Limited, together with its subsidiaries, provides integrated offshore oilfield services in Mainland China and internationally. The company operates through four segments: Drilling Services, Well Services, Marine Support Services, and Geophysical Acquisition and Surveying Services. The Drilling Services segment provides jack-up drilling rig, semi-submersible drilling rig, module rig, and land drilling rig services. As of December 31, 2020, it operated and managed 57 drilling rigs, which include 43 jack-up drilling rigs and 14 semi-submersible drilling rigs; and 5 module rigs. The Well Services segment offers onshore and offshore well services, including logging, drilling and completion fluids, directional drilling, cementing, well completion and workover, stimulation, etc. The Marine Support Services segment owns and operates offshore vessels that provide services for offshore oil and gas exploration, development, construction, and production. This segment also offers anchor handling for various water level, towing of drilling rigs/engineering barges, oil lifting, offshore transportation, standby, firefighting, rescue, oil spill assisting, and other marine support services. It operates and manages approximately 140 vessels, including AHTS vessels, platform supply vessels, and oilfield standby vessels. The Geophysical Acquisition and Surveying Services segment provides offshore seismic acquisition, offshore geo-surveying, seismic data processing and interpretation, and fundamental construction services. This segment owns 5 towing streamer seismic vessels, 1 professional source vessel, 2 ocean bottle cable teams, 5 integrated marine surveying vessels, and 2 support vessels. China Oilfield Services Limited also issues bonds. The company is based in Sanhe, China. China Oilfield Services Limited is a subsidiary of China National Offshore Oil Corporation.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Sanhe",
        "zipcode": "065201",
        "website": "http://www.cosl.com.cn",
        "market_cap": "Mid Cap"
    },
    "E8F.F": {
        "short_name": "CIMC ENRIC HLDG.INC.HK-01",
        "long_name": "CIMC Enric Holdings Limited",
        "summary": "CIMC Enric Holdings Limited designs, develops, manufactures, engineers, and maintains transportation, storage, and processing equipment for the energy, chemicals, environmental, and liquid food industries worldwide. Its Clean Energy segment manufactures and operates equipment for the storage, transportation, processing, and distribution of liquefied natural gas, compressed natural gas, and liquefied petroleum gas; and offers engineering, procurement, and construction (EPC) services for the clean energy industry, as well as intelligent IOT platforms under the Anjiehui brand. It offers its products under the Enric, Sanctum, Hongtu, CIMC Tank, Cryobest, YPDI, CIMC SOE, CIMC Hydrogen Energy, and Hashenleng brands. Its Chemical and Environmental segment offers tank containers for the storage and transportation of liquefied or gasified chemicals under the CIMC Tank and Tankmiles brands; maintenance and value-added services for tank containers; and special equipment for environmental protection, as well as environmental protection, pollution treatment, and resource recycling services. Its Liquid Food segment engineers, manufactures, and sells stainless steel tanks for storage and processing liquid food; and provides EPC services for brewery and other liquid food industries under the Ziemann Holvrieka, DME, NSI, McMillan, and Briggs brands. The company also manufactures compressors and accessories, and pressure vessels; offers business solutions for gas equipment; researches and develops technology for natural gas equipment; cryogenic storage and transportation equipment design, manufacture, and technical services; collects, processes, and sells renewable resources; offers terminal and depot, and nonmetallic scrap processing services; and repairs and maintains pressure vessels. The company was incorporated in 2004 and is headquartered in Shenzhen, the People's Republic of China. The company is a subsidiary of China International Marine Containers (Hong Kong) Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518067",
        "website": "http://www.enricgroup.com",
        "market_cap": "Small Cap"
    },
    "GSG.F": {
        "short_name": "SHENGLI O.+G.H.REGS HD-10",
        "long_name": "Shengli Oil & Gas Pipe Holdings Limited",
        "summary": "Shengli Oil & Gas Pipe Holdings Limited, an investment holding company, designs, processes, manufactures, and sells welded pipes for oil and gas pipeline, and other construction and manufacturing applications in Mainland China and Hong Kong. The company operates through two segments, Pipes Business and Trading Business. It produces submerged-arc helical and longitudinal welded pipes that are primarily used to transport crude oil, refined petroleum products, natural gas, and other related products, as well as used for the oil and infrastructure industry. The company also engages in the provision of anti-corrosion services for oil and gas pipelines, and other construction and manufacturing applications; trading of environmental energy equipment, fuel oil and chemical products, and commodities; and provision of new energy technical development services. In addition, it offers anti-corrosion technical and rental services; and trades in rolled coils. Shengli Oil & Gas Pipe Holdings Limited was founded in 1972 and is headquartered in Zibo, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Zibo",
        "zipcode": "255082",
        "website": "http://www.slogp.com",
        "market_cap": "Small Cap"
    },
    "HRC1.F": {
        "short_name": "RECON TECHNOLOGY  DL -,01",
        "long_name": "Recon Technology, Ltd.",
        "summary": "Recon Technology, Ltd. provides hardware, software, and on-site services to companies in the petroleum mining and extraction industry in the People's Republic of China. The company offers equipment, tools, and other hardware related to oilfield production and management, and transportation; and develops and sells industrial automation control and information solutions. It also provides equipment for oil and gas production and transportation, including heating furnaces and burner, as well as enhancing techniques comprising packers of fracturing; production packers; sand prevention in oil and water wells; water locating and plugging techniques; fissure shaper; fracture acidizing technique; and electronic broken-down service to resolve block-up and freezing problems. In addition, the company offers automation systems and services, including pumping unit controller that monitors the pumping units and collects data; RTU to monitor natural gas wells and collect gas well pressure data; wireless dynamometers and wireless pressure gauges; electric multi-way valves for oilfield metering station flow control; and natural gas flow computer systems. Further, it provides Recon SCADA oilfield monitor and data acquisition system for supervision and data collection; EPC service of pipeline SCADA system for pipeline monitoring and data acquisition; EPC service of oil and gas wells SCADA system for monitoring and data acquisition of oil wells and natural gas wells; EPC service of oilfield video surveillance and control system to control the oil and gas wellhead and measurement station areas; and technique service for digital oilfield transformation. Additionally, the company offers oilfield waste water treatment solutions and related chemicals; and oily sludge disposal solutions. Recon Technology, Ltd. was incorporated in 2007 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100012",
        "website": "http://www.recon.cn",
        "market_cap": "Small Cap"
    },
    "I8O.F": {
        "short_name": "JUTAL OFF.OIL SRVCS HD-01",
        "long_name": "Jutal Offshore Oil Services Limited",
        "summary": "Jutal Offshore Oil Services Limited, an investment holding company, engages in the fabrication of facilities, and provision of integrated services for oil and gas industries, new energy, and refining and chemical industries. The company offers offshore engineering and modular construction services, including construction of large-scale modules, such as onshore LNG modules, modular plants, upper modules of offshore platforms, and FPSO/FLNG modules; petrochemical and shipbuilding services comprising projects in oil and gas process modules, petrochemical equipment and undersea business, and EPC contracting services; and technical support services for shipbuilding industry, as well as ship repair and construction services. It also provides oil and gas treatment technical services, which include treatment technology and solutions in natural gas purification and treatment, oil production water treatment, and sludge purification; and new energy equipment construction services, such as services for the development and utilization of new energy, as well as undertakes construction of crane products. It operates in the People's Republic of China, the United States, Switzerland, Norway, Singapore, Japan, France, the United Kingdom, the Netherlands, and internationally. Jutal Offshore Oil Services Limited was founded in 1995 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518068",
        "website": "http://www.jutal.com",
        "market_cap": "Small Cap"
    },
    "LNDT": {
        "short_name": "LIANDI CLEAN TECHNOLOGY INC",
        "long_name": "LianDi Clean Technology, Inc.",
        "summary": "LianDi Clean Technology, Inc., through its subsidiaries, distributes petroleum and petrochemical valves, equipment, and related services in the People's Republic of China. The company distributes unheading units for the delayed coking process; and offers systems integration, and related technical and engineering services to petroleum and petrochemical companies and other energy companies. It also develops and markets optimization software for data collection, performance analysis, and process optimization in the polymerization reaction of ethylene production. In addition, the company is involved in development, manufacture, and sale of organic and inorganic chemical products, and high polymer fine chemical products; provision of chemical professional services and oil tank sludge cleaning services; and recycle and sale of discarded or used packing products. LianDi Clean Technology, Inc. was founded in 2004 and is based in Beijing, the People's Republic of China. As of June 29, 2015, LianDi Clean Technology, Inc. operates as a subsidiary of Smart Specialists Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100089",
        "website": "http://www.china-liandi.com",
        "market_cap": "Small Cap"
    },
    "PXI.F": {
        "short_name": "SHANDONG MOLONG PETR. H",
        "long_name": "Shandong Molong Petroleum Machinery Company Limited",
        "summary": "Shandong Molong Petroleum Machinery Company Limited engages in the research and development, production, and sale of products for the energy equipment industry in the People's Republic of China. The company operates through Pipe Products, Three Kinds of Pumping Units, Petroleum Machinery Parts, Tube Blank, and Others segments. It offers pipes for petroleum and gas extraction, fluid and structural pipes, petroleum pumping machines, petroleum pumps, petroleum pumping rods, cylinder liners for drilling rigs, valve parts, and casting and forging solutions . The company's products also include API and non API casing products, line pipe products, precision steel pipes, hydraulic prop tubes, fluid pipes, cylinder tubes, and boiler tubes; sucker rods; valve body, cylinder liners, gate valves, and billet products. Its products are used in petroleum, natural gas, coalbed methane, shale gas and other energy drilling, machinery processing, urban pipe network, etc. In addition, the company engages in the research of new materials for energy equipment; production and sale of metal casting and forging; sea water desalination activities; waste heat and gas power generation activities; and manufacture and sale of special oil metal materials. It also exports its energy equipment. Shandong Molong Petroleum Machinery Company Limited was founded in 2001 and is based in Shouguang City, China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shouguang",
        "zipcode": "262700",
        "website": "http://www.molonggroup.com",
        "market_cap": "Small Cap"
    },
    "RCON": {
        "short_name": "Recon Technology, Ltd.",
        "long_name": "Recon Technology, Ltd.",
        "summary": "Recon Technology, Ltd. provides hardware, software, and on-site services to companies in the petroleum mining and extraction industry in the People's Republic of China. The company offers equipment, tools, and other hardware related to oilfield production and management, and transportation; and develops and sells industrial automation control and information solutions. It also provides equipment for oil and gas production and transportation, including heating furnaces and burner, as well as enhancing techniques comprising packers of fracturing; production packers; sand prevention in oil and water wells; water locating and plugging techniques; fissure shaper; fracture acidizing technique; and electronic broken-down service to resolve block-up and freezing problems. In addition, the company offers automation systems and services, including pumping unit controller that monitors the pumping units and collects data; RTU to monitor natural gas wells and collect gas well pressure data; wireless dynamometers and wireless pressure gauges; electric multi-way valves for oilfield metering station flow control; and natural gas flow computer systems. Further, it provides Recon SCADA oilfield monitor and data acquisition system for supervision and data collection; EPC service of pipeline SCADA system for pipeline monitoring and data acquisition; EPC service of oil and gas wells SCADA system for monitoring and data acquisition of oil wells and natural gas wells; EPC service of oilfield video surveillance and control system to control the oil and gas wellhead and measurement station areas; and technique service for digital oilfield transformation. Additionally, the company offers oilfield waste water treatment solutions and related chemicals; and oily sludge disposal solutions. Recon Technology, Ltd. was incorporated in 2007 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100012",
        "website": "http://www.recon.cn",
        "market_cap": "Small Cap"
    },
    "SHANF": {
        "short_name": "SHANDONG MOLONG PETROLEUM MACHI",
        "long_name": "Shandong Molong Petroleum Machinery Company Limited",
        "summary": "Shandong Molong Petroleum Machinery Company Limited engages in the research and development, production, and sale of products for the energy equipment industry in the People's Republic of China. The company operates through Pipe Products, Three Kinds of Pumping Units, Petroleum Machinery Parts, Tube Blank, and Others segments. It offers pipes for petroleum and gas extraction, fluid and structural pipes, petroleum pumping machines, petroleum pumps, petroleum pumping rods, cylinder liners for drilling rigs, valve parts, and casting and forging solutions . The company's products also include API and non API casing products, line pipe products, precision steel pipes, hydraulic prop tubes, fluid pipes, cylinder tubes, and boiler tubes; sucker rods; valve body, cylinder liners, gate valves, and billet products. Its products are used in petroleum, natural gas, coalbed methane, shale gas and other energy drilling, machinery processing, urban pipe network, etc. In addition, the company engages in the research of new materials for energy equipment; production and sale of metal casting and forging; sea water desalination activities; waste heat and gas power generation activities; and manufacture and sale of special oil metal materials. It also exports its energy equipment. Shandong Molong Petroleum Machinery Company Limited was founded in 2001 and is based in Shouguang City, China.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shouguang",
        "zipcode": "262700",
        "website": "http://www.molonggroup.com",
        "market_cap": "Small Cap"
    }
}