{
    "002267.SZ": {
        "short_name": "SHAANXI PROVINCIAL",
        "long_name": "Shaanxi Provincial Natural Gas Co.Ltd",
        "summary": "Shaanxi Provincial Natural Gas Co.Ltd, a natural gas company, engages in the planning, construction, operation, management, and distribution of natural gas in Shaanxi Province, China. It operates Jingbian to Xi'an, Xianyang to Baoji, Xi'an to Weinan, Baoji to Hanzhong, Hanzhong to Ankang, etc. pipelines with a total mileage of approximately 3,300 kilometers. The company was founded in 1995 and is based in Xi'an, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Xi'an"
    },
    "002492.SZ": {
        "short_name": "ZHUHAI WINBASE INT",
        "long_name": "Zhuhai Winbase International Chemical Tank Terminal Co., Ltd.",
        "summary": "Zhuhai Winbase International Chemical Tank Terminal Co., Ltd. engages in bulk liquid petrochemicals and finished oil products business in China. It is involved in the loading and discharging, storage, and transferring activities. The company was founded in 2000 and is based in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Zhuhai"
    },
    "41S.F": {
        "short_name": "SINOSTAR PEC HLDGS LTD",
        "long_name": "Sinostar PEC Holdings Limited",
        "summary": "Sinostar PEC Holdings Limited, an investment holding company, produces and supplies petrochemical products in the People's Republic of China. It operates in two segments, Gas Separation, and Transport and Logistic Services. The company offers liquefied petroleum gas (LPG), which is used as a source of fuel by households and industrial manufacturers; propylene, an organic compound to produce chemical intermediates, such as polypropylene and vinyl; purified isobutylene, methyl tert-butyl ether, and hydrogen; and polypropylene, a thermoplastic polymer under the Hengchang brand that is used to produce plastic products for various industrial applications. It also provides logistics and transportation services for LPG and petroleum related products. Sinostar PEC Holdings Limited sells its products to manufacturers of petrochemical and plastic products, as well as LPG distributors. The company was incorporated in 2006 and is based in Singapore. Sinostar PEC Holdings Limited is a subsidiary of Intelligent People Holdings Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Dongming"
    },
    "5PD.SI": {
        "short_name": "$ Hengyang Petro",
        "long_name": "Hengyang Petrochemical Logistics Limited",
        "summary": "Hengyang Petrochemical Logistics Limited, an investment holding company, provides logistics service for the petrochemical industry in the People's Republic of China. It offers storage and land transportation services for bulk liquid petrochemicals, gases, and oils, such as methanol, acetic acid, phenol, acetone, styrene, ethylene glycol, polyether polyol, propane, butane, gasoline, diesel, and fuel oil and base oil. The company also provides whole-tank leasing, and spot leasing services, as well as manages port terminal. Hengyang Petrochemical Logistics Limited was founded in 2002 and is based in Jiangyin, the People's Republic of China.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "city": "Jiangyin"
    },
    "600617.SS": {
        "short_name": "SHANXI GUOXIN ENERGY CORPORATIO",
        "long_name": "Shanxi Guoxin Energy Corporation Limited",
        "summary": "Shanxi Guoxin Energy Corporation Limited engages in the energy management business. The company's products primarily include natural gas, coal bed methane, and coal gas. It also provides energy sector related consulting services. The company was formerly known as Shanghai Lianhua Synthetic Fiber Co., Ltd. and changed its name to Shanxi Guoxin Energy Corporation Limited in July 2014. The company was incorporated in 1992 and is based in Taiyuan, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Taiyuan"
    },
    "900913.SS": {
        "short_name": "SHANXI GUOXIN ENERGY CORPORATIO",
        "long_name": "Shanxi Guoxin Energy Corporation Limited",
        "summary": "Shanxi Guoxin Energy Corporation Limited engages in the energy management business. The company's products primarily include natural gas, coal bed methane, and coal gas. It also provides energy sector related consulting services. The company was formerly known as Shanghai Lianhua Synthetic Fiber Co., Ltd. and changed its name to Shanxi Guoxin Energy Corporation Limited in July 2014. The company was incorporated in 1992 and is based in Taiyuan, China.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Taiyuan"
    },
    "C9Q.SI": {
        "short_name": "Sinostar Pec",
        "long_name": "Sinostar PEC Holdings Limited",
        "summary": "Sinostar PEC Holdings Limited, an investment holding company, produces and supplies petrochemical products in the People's Republic of China. It operates in two segments, Gas Separation, and Transport and Logistic Services. The company offers liquefied petroleum gas (LPG), which is used as a source of fuel by households and industrial manufacturers; propylene, an organic compound to produce chemical intermediates, such as polypropylene and vinyl; purified isobutylene, methyl tert-butyl ether, and hydrogen; and polypropylene, a thermoplastic polymer under the Hengchang brand that is used to produce plastic products for various industrial applications. It also provides logistics and transportation services for LPG and petroleum related products. Sinostar PEC Holdings Limited sells its products to manufacturers of petrochemical and plastic products, as well as LPG distributors. The company was incorporated in 2006 and is based in Singapore. Sinostar PEC Holdings Limited is a subsidiary of Intelligent People Holdings Limited.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "city": "Dongming"
    },
    "KEH.F": {
        "short_name": "CHINESE.PEOP.HLDGS HD-,07",
        "long_name": "Chinese People Holdings Company Limited",
        "summary": "Chinese People Holdings Company Limited, an investment holding company, sells and distributes gas fuel in the People's Republic of China. The company operates through Provision of Piped Gas; Sale and Distribution of Cylinder Gas; and FMCG and Food Ingredients segments. It is involved in the sale of piped gas and construction of gas pipeline networks under gas connection contracts; sale and distribution of gas using tank containers to end-user households, and industrial and commercial customers; and retail and wholesale of merchandise, including rice, meat, and fresh food, as well as FMCG and barreled drinking water through supermarkets and convenience stores. The company was formerly known as Chinese People Gas Holdings Company Limited and changed its name to Chinese People Holdings Company Limited in 2007. Chinese People Holdings Company Limited is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    }
}