{
    "002828.SZ": {
        "short_name": "XINJIANG BEIKEN EN",
        "long_name": "XinJiang Beiken Energy Engineering Co,.Ltd",
        "summary": "Xinjiang Beiken Energy Engineering Co., Ltd. provides oil, gas, and coal bed methane extraction; and related engineering and technical services in China and internationally. The company offers drilling and cementing engineering, and directional well technical services, as well as mud, downhole, and oil production technical services; and oil and gas field exploration and development technology research and consulting services. It is also involved in the research, development, manufacture, and sale of drilling, cementing, and oil production additives used in oilfields; manufacture of logging while drilling tools and PDC drill bit; testing and maintenance/repair of well control equipment; and lease and repair of drilling and other tools. In addition, the company imports/exports petroleum machinery and electromechanical products; invests in the oil sector; and provides after-sale and professional technical consultancy services. The company was formerly known as XinJiang Beiken Energy Engineering Stock Co., Ltd. and changed its name to Xinjiang Beiken Energy Engineering Co., Ltd. in November 2017. Xinjiang Beiken Energy Engineering Co., Ltd. was founded in 1995 and is headquartered in Karamay, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Karamay",
        "zipcode": "834009",
        "website": "http://www.beiken.com",
        "full_time_employees": 1311
    },
    "1033.HK": {
        "short_name": "SINOPEC SSC",
        "long_name": "Sinopec Oilfield Service Corporation",
        "summary": "Sinopec Oilfield Service Corporation provides petroleum engineering and technical services in the People's Republic of China, the Middle East, and internationally. It operates through five segments: Geophysics, Drilling Engineering, Logging and Mud Logging, Special Down-Hole Operations, and Engineering Construction. The Geophysics segment offers terrestrial and marine geophysical exploration, development, and technical services. The Drilling Engineering segment provides land and ocean drilling design, construction, and technical services, as well as drilling instrumentation. The Logging and Mud Logging segment offers land and ocean project contracting and technical services for collection, monitoring, transmission, processing and interpretation, and evaluation of wellbore oil and gas, geology, and engineering information. The Special Down-Hole Operations segment provides oil engineering technical and construction services, including oil testing, well repair, and lateral drilling, as well as fracturing, acidizing, and oil assignments. The Engineering Construction segment offers various services, such as feasibility studies; design, procurement, and construction for projects of onshore and offshore oil and gas fields; long-distance pipeline projects, oil and gas transporting process projects, storage and transportation projects, petrochemical supporting projects, and LNG projects; building construction, water resources and hydropower, ports and waterways, electricity transmission and distribution projects; manufacturing of pressure vessels; and coal chemical engineering, geothermal utilization, energy saving, and municipal roads and bridges. The company was formerly known as Sinopec Yizheng Chemical Fibre Company Limited and changed its name to Sinopec Oilfield Service Corporation in March 2015. The company is headquartered in Beijing, the People's Republic of China. Sinopec Oilfield Service Corporation is a subsidiary of China Petrochemical Corporation.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100728",
        "website": "http://ssc.sinopec.com",
        "full_time_employees": 71736
    },
    "YIZH.F": {
        "short_name": "SINOPEC OILF. SERV. YC 1",
        "long_name": "Sinopec Oilfield Service Corporation",
        "summary": "Sinopec Oilfield Service Corporation provides petroleum engineering and technical services in the People's Republic of China, the Middle East, and internationally. It operates through five segments: Geophysics, Drilling Engineering, Logging and Mud Logging, Special Down-Hole Operations, and Engineering Construction. The Geophysics segment offers terrestrial and marine geophysical exploration, development, and technical services. The Drilling Engineering segment provides land and ocean drilling design, construction, and technical services, as well as drilling instrumentation. The Logging and Mud Logging segment offers land and ocean project contracting and technical services for collection, monitoring, transmission, processing and interpretation, and evaluation of wellbore oil and gas, geology, and engineering information. The Special Down-Hole Operations segment provides oil engineering technical and construction services, including oil testing, well repair, and lateral drilling, as well as fracturing, acidizing, and oil assignments. The Engineering Construction segment offers various services, such as feasibility studies; design, procurement, and construction for projects of onshore and offshore oil and gas fields; long-distance pipeline projects, oil and gas transporting process projects, storage and transportation projects, petrochemical supporting projects, and LNG projects; building construction, water resources and hydropower, ports and waterways, electricity transmission and distribution projects; manufacturing of pressure vessels; and coal chemical engineering, geothermal utilization, energy saving, and municipal roads and bridges. The company was formerly known as Sinopec Yizheng Chemical Fibre Company Limited and changed its name to Sinopec Oilfield Service Corporation in March 2015. The company is headquartered in Beijing, the People's Republic of China. Sinopec Oilfield Service Corporation is a subsidiary of China Petrochemical Corporation.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Drilling",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100728",
        "website": "http://ssc.sinopec.com",
        "full_time_employees": 71736
    }
}