{
    "000060.SZ": {
        "short_name": "SHN ZHONGJIN LINGN",
        "long_name": "Shenzhen Zhongjin Lingnan Nonfemet Co. Ltd.",
        "summary": "Shenzhen Zhongjin Lingnan Nonfemet Co. Ltd. produces and sells non-ferrous metals in China and internationally. The company undertakes cross-industry and cross-region operations that include mining, processing, smelting, manufacturing, research and development, construction materials, real estate development, trade, warehousing, and financial service. Its product portfolio includes fine lead ore, fine zinc ore, mixed lead/zinc ore, fine sulfur ore, electrolytic lead, fine zinc, silver, fine cadmium, germanium ingots, germanium dioxide, indium ingots, sulfuric acid, zinc sulfate, section aluminum, curtain walls, steel stripes, nickel hydroxide, zinc powder for batteries, and fibrous nickel powder. The company was founded in 1984 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.nonfemet.com",
        "market_cap": "Large Cap"
    },
    "000426.SZ": {
        "short_name": "INNER MONGOLIA XIN",
        "long_name": "Inner Mongolia Xingye Mining Co., Ltd.",
        "summary": "Inner Mongolia Xingye Mining Co., Ltd. engages in the mining, extracting, and smelting of non-ferrous and precious metals. Its products include lead, zinc, silver, tin, copper, iron, bismuth, tungsten, and other non-ferrous metals. The company was founded in 1991 and is based in Chifeng, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chifeng",
        "zipcode": "024000",
        "website": "http://www.nmxyky.com",
        "market_cap": "Large Cap"
    },
    "000603.SZ": {
        "short_name": "SHENGDA RESOURCES",
        "long_name": "Shengda Resources Co.,Ltd.",
        "summary": "Shengda Resources Co.,Ltd., through its subsidiaries, engages in the exploration and development of non-ferrous metals in China. It primarily mines for lead, zinc, and silver. The company was formerly known as Shengda Mining Co., Ltd. and changed its name to Shengda Resources Co.,Ltd. in October 2019. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.sdkygf.com",
        "market_cap": "Mid Cap"
    },
    "000629.SZ": {
        "short_name": "PANGANG GP VANADIU",
        "long_name": "Pangang Group Vanadium & Titanium Resources Co., Ltd.",
        "summary": "Pangang Group Vanadium & Titanium Resources Co., Ltd. engages in the production and supply of vanadium and titanium products in China and internationally. The company provides vanadium products, including vanadium pentoxides, vanadium ferrovanadiums, vanadium-nitrogen alloys, vanadium-aluminum alloys, etc.; and titanium products comprising titanium dioxides and slags, ilmenite, etc. Its products are used in steel, electronics, non-ferrous metals, coatings, and inks industries. The company was founded in 1993 and is headquartered in Panzhihua, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Panzhihua",
        "zipcode": "617067",
        "website": "http://www.pgvt.cn",
        "market_cap": "Large Cap"
    },
    "000657.SZ": {
        "short_name": "CHINA TUNGSTEN & H",
        "long_name": "China Tungsten and Hightech Materials Co.,Ltd",
        "summary": "China Tungsten and Hightech Materials Co., Ltd. researches, develops, produces, sells, and trades in nonferrous metals in China. The company's products include cemented carbide, tungsten, molybdenum, tantalum, niobium, and other nonferrous metals and its deep-processing products and equipment. It also offers cutting tools, mining facilities components, IT processing tools, wear parts, hard face materials, powders products. China Tungsten and Hightech Materials Co., Ltd. was formerly known as Hainan Jinhai Co., Ltd. and changed its name to China Tungsten and Hightech Materials Co., Ltd. in 2000. The company was founded in 1993 and is based in Haikou, China. China Tungsten and Hightech Materials Co.,Ltd operates as a subsidiary of Hunan Nonferrous Metals Corporation Limited.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Haikou",
        "zipcode": null,
        "website": "http://www.minmetalstungsten.com",
        "market_cap": "Mid Cap"
    },
    "000688.SZ": {
        "short_name": "GUOCHENG MINING CO",
        "long_name": "GuoCheng Mining CO.,LTD",
        "summary": "GuoCheng Mining CO., Ltd. engages in the mining and beneficiation of nonferrous metals. Its metals include lead and zinc mines, as well as associated gold, silver, and copper. The company also engages in the trading of mineral and non-ferrous metal products; and precious and rare metals, as well as in the development of non-ferrous metals and ferrous metals. In addition, it produces and sells downstream sulfuric acid. The company was formerly known as Jianxin Mining Co., Ltd. and changed its name to Guocheng Mining Co., Ltd. in August 2018. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100070",
        "website": "http://www.gcky0688.com",
        "market_cap": "Large Cap"
    },
    "000697.SZ": {
        "short_name": "LIGEANCE AEROSPACE",
        "long_name": "Ligeance Aerospace Technology Co.,Ltd.",
        "summary": "Ligeance Aerospace Technology Co., Ltd. engages in the mining, smelting, and sale of molybdenum ore, associated sulfur, antimony, lead, and silver. The company primarily offers molybdenum fine powder. It is also involved in the development, production, sale, and maintenance of aero engines, gas turbine blades, and large unmanned aerial vehicles, as well as offers technical services; production, processing, assembly, and maintenance of aerospace components; and research and development of smelting technologies. In addition, the company provides aircraft-related precision and structural parts, including aircrafts wing leading surface and engine-related components, and lifting and lowering equipment and oil pump covers primarily used in commercial aircrafts, helicopters, engines, other aircraft, and industrial products; and a range of value-added services, such as component assembly, ancillary logistics, and fast shop floor services, as well as invests in mineral resources. Further, it imports and exports goods and technology. The company was formerly known as Shaanxi Ligeance Mineral Resources Co., Ltd. Ligeance Aerospace Technology Co., Ltd. was founded in 1993 and is based in Xianyang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xianyang",
        "zipcode": "712000",
        "website": "http://www.lsmin.com",
        "market_cap": "Mid Cap"
    },
    "000751.SZ": {
        "short_name": "HULUDAO ZINC INDUS",
        "long_name": "Huludao Zinc Industry Co.,Ltd.",
        "summary": "Huludao Zinc Industry Co.,Ltd. engages in the smelting, processing, and selling metal products primarily in China. The company is involved in the zinc, copper, and lead smelting and deep processing; and cadmium, indium, sulfuric acid, and copper sulfate utilization processing activities. It also provides zinc ingot, electrolead, high purity, silver ingot, hot galvanized, zinc sulfate, and gold products. The company's products are used in the metallurgy, machinery, electronics, medicine, chemical, military, and other industries. It also exports its products to approximately 20 countries and regions. The company is based in Huludao, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huludao",
        "zipcode": "125003",
        "website": "http://www.hldxygf.com",
        "market_cap": "Mid Cap"
    },
    "000762.SZ": {
        "short_name": "TIBET MINERAL DEVM",
        "long_name": "Tibet Mineral Development Co., LTD",
        "summary": "Tibet Mineral Development Co., LTD engages in mining business. The company explores for chromite, copper, lithium, and boron deposits. Its products electrolytic copper; industrial-grade lithium carbonate, lithium hydroxide monohydrate, and battery-grade lithium carbonate; and lithium salts. The company was founded in 1997 and is based in Lhasa, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lhasa",
        "zipcode": "850000",
        "website": null,
        "market_cap": "Large Cap"
    },
    "000795.SZ": {
        "short_name": "INNUOVO TECHNOLOGY",
        "long_name": "Innuovo Technology Co., Ltd.",
        "summary": "Innuovo Technology Co., Ltd., together with its subsidiaries, engages in the research and development, production, and sale of rare earth permanent magnet materials in China. It also develops and produces automated logistics system integration and related equipment; lifting equipment, such as roadway stacking machines; and conveyors, including drums, suspensions, and plate chains, shelves, and rolled profiles, as well as provides electrical machinery and equipment. In addition, Innuovo Technology Co., Ltd. provides logistics management software that consists of warehouse management system and equipment control system. The company's products are used in the fields of aerospace, mechanical instrumentation, and medical equipment. The company was formerly known as Taiyuan Shuangta Ganyu Co., Ltd. Innuovo Technology Co., Ltd. was founded in 1997 and is based in Taiyuan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": "030024",
        "website": "http://www.innuovo.com",
        "market_cap": "Mid Cap"
    },
    "000960.SZ": {
        "short_name": "YUNNAN TIN",
        "long_name": "Yunnan Tin Company Limited",
        "summary": "Yunnan Tin Company Limited engages in the tin production and processing activities in China. The company offers tin ingots, special tins for float glass production, bearing alloy ingots, lead-based alloys, tin-lead wire solders, zinc and tin zinc alloy wires, lead-free solder wires and bars, casting solder bars, extruder solder bars, tin granules, tin balls, spherical solder powders, ball grid array solder balls, tin and solder anodes, lead-free solder pastes, low-temperature solder pastes, and eutectic solder pastes. It also provides copper cathode products, tin chemicals, indium and silver ingots, tin base alloys, organic and inorganic tin chemicals, etc. The company also exports its products. Yunnan Tin Company Limited was 1883 and is based in Gejiu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Gejiu",
        "zipcode": "661000",
        "website": "http://www.ytl.com.cn",
        "market_cap": "Large Cap"
    },
    "000962.SZ": {
        "short_name": "NINGXIA ORIENT TAN",
        "long_name": "Ningxia Orient Tantalum Industry Co., Ltd.",
        "summary": "Ningxia Orient Tantalum Industry Co., Ltd. researches, develops, and produces rare metals in China. It offers antimony, titanium, and related alloys; titanium products, such as Titanium and titanium alloy wires, pipes, bars, ingots, rings and forgings, and slabs, as well as other compounds, including titanium tetrachloride and titanium trichloride; beryllium bronze alloys; photovoltaic materials comprising silicon carbide powders and cutting steel wires. The company also provides energy materials; superconducting series; and other products, such as molybdenum strips, potassium chloride, sodium chloride, potassium fluoride, molybdenum foils and strips, and high temperature infrared radiation coatings. Its products are primarily used in electronics, communication, aviation, aerospace, metallurgy, petroleum, chemical, sports, medicals, atomic energy, solar energy, and other fields. Ningxia Orient Tantalum Industry Co., Ltd. was incorporated in 1999 and is based in Shizuishan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shizuishan",
        "zipcode": "753000",
        "website": "http://www.otic.com.cn",
        "market_cap": "Mid Cap"
    },
    "002114.SZ": {
        "short_name": "YUNNAN LUOPING ZIN",
        "long_name": "Yunnan luoping Zinc&Electricity Co.,Ltd.",
        "summary": "Yunnan luoping Zinc&Electricity Co.,Ltd. engages in mining and processing lead-zinc ores in China. The company processes zinc ingots, crude indium ingots, cadmium ingots, zinc sulfide concentrate, electrolytic zinc, electrolytic cadmium, lead concentrates, antimony concentrate, and silver concentrates, as well as ultrafine and oxide zinc powder. It is also involved in hydropower generation. The company was incorporated in 2000 and is based in Luoping, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Luoping",
        "zipcode": "655800",
        "website": "http://www.lpxdgf.cn",
        "market_cap": "Mid Cap"
    },
    "002155.SZ": {
        "short_name": "HUNAN GOLD CORPORA",
        "long_name": "Hunan Gold Corporation Limited",
        "summary": "Hunan Gold Corporation Limited engages in the exploration, mining, processing, smelting, and refining of gold ingot, tantalum, tungsten, and niobium products in China. Its principal products include gold, fine bismuth, antimony oxide, yttrium oxide, tungsten concentrate, and ammonium paratungstate products. It is also involved in the mine development and design, mechanical repair, and logistics and international trade activities. The company offers its products under the Chenzhou brand. The company was formerly known as Chenzhou Mining Group Co., Ltd. and changed its name to Hunan Gold Corporation Limited in May 2015. Hunan Gold Corporation Limited is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": null,
        "website": "http://www.hngoldcorp.com",
        "market_cap": "Mid Cap"
    },
    "002171.SZ": {
        "short_name": "ANHUI TRUCHUM ADVA",
        "long_name": "Anhui Truchum Advanced Materials and Technology Co., Ltd.",
        "summary": "Anhui Truchum Advanced Materials and Technology Co., Ltd. engages in the metal base material processing business in China and internationally. The company offers copper alloy plates/strips, copper alloy wires, conductive copper bars, cold-rolled ribbon steel products, and precision welded tubes for use in various industries, such as power electronics, hardware, automobile, machinery, LED and rail traffic, etc. It also provides thermal equipment for carbon and carborundum based composite materials, high temperature composite materials, ceramic based composite materials, high-end vacuum heat treatment, and powder metallurgy manufacturing enterprises. The company was formerly known as Anhui Jingcheng Copper Co., Ltd. and changed its name to Anhui Truchum Advanced Materials and Technology Co., Ltd. in July 2015. Anhui Truchum Advanced Materials and Technology Co., Ltd. was founded in 1999 and is headquartered in Wuhu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhu",
        "zipcode": "241008",
        "website": "http://www.ahcjxc.com",
        "market_cap": "Large Cap"
    },
    "002237.SZ": {
        "short_name": "SHANDONG HUMON SME",
        "long_name": "Shandong Humon Smelting Co., Ltd.",
        "summary": "Shandong Humon Smelting Co., Ltd. engages in the exploration, mining, selection, and smelting of gold in China. It also produces silver, cathode copper, electrolytic lead, vitriol, and liquid sulfur dioxide. The company was founded in 1994 and is based in Yantai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yantai",
        "zipcode": "264109",
        "website": "http://www.hbyl.cn",
        "market_cap": "Large Cap"
    },
    "002378.SZ": {
        "short_name": "CHONGYI ZHANGYUAN",
        "long_name": "Chongyi Zhangyuan Tungsten Co., Ltd.",
        "summary": "Chongyi Zhangyuan Tungsten Co., Ltd. engages in the mining, beneficiation, smelting, and powder producing activities in China. It offers APTs, tungsten oxide, tungsten powders, tungsten carbide powders, inserts, rods, buttons, and special parts under the Zhangyuan brand. The company is also involved in tungsten alloy and cemented carbide producing; and deep processing and trading activities. The company was founded in 1990 and is based in Ganzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ganzhou",
        "zipcode": "341300",
        "website": "http://www.zy-tungsten.com",
        "market_cap": "Mid Cap"
    },
    "002428.SZ": {
        "short_name": "YUNNAN LINCANG XIN",
        "long_name": "Yunnan Lincang Xinyuan Germanium Industry Co.,LTD",
        "summary": "Yunnan Lincang Xinyuan Germanium Industry Co.,LTD mines, researches, develops, manufactures, and supplies tantalum products. It offers tantalum material products, such as district melting ingots, cerium oxide, and fiber-optic cerium tetrachloride used in infrared optics, solar cells, fiber optic communications, semiconductor specialty gases, PET catalysts, and other industries. The company also provides solar tantalum substrate, including solar germanium wafers used in space satellite solar cell, high-altitude surveillance drones, and ground high-concentration solar power stations; LED substrates for automotive applications; and semiconductor grade and semi-insulator gallium arsenide crystals and substrates used in nanoscale semiconductor integrated circuits and LED general illumination fields comprising microwave oscillators and amplifiers, fiber optic communication rate amplifiers, and other fields. In addition, it offers cooling and non-cooling infrared lenses consisting of fixed-focus lenses, continuous zoom lenses, and dual-field lenses, large diameter single crystals, infrared optical banks, optical grade germanium crystals, plastic optical components, and light windows. The company is based in Kunming, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": null,
        "website": "http://www.sino-ge.com",
        "market_cap": "Mid Cap"
    },
    "002738.SZ": {
        "short_name": "SINOMINE RESOURCE",
        "long_name": "Sinomine Resource Group Co., Ltd.",
        "summary": "Sinomine Resource Group Co., Ltd. operates as a geological exploration technology services company in nonferrous metals industry. The company offers solid mineral exploration technical services for copper, lead, zinc, nickel, cobalt, gold, silver, platinum, and other non-ferrous metals. It also holds interests in the Shivuma copper project in Zambia, Perlat copper project in Albania, and Chromite project in Zimbabwe, as well as explores for gold, silver, cobalt, lead, zinc, iron, nickel, and uranium deposits. In addition, the company undertakes engineering projects; and provides related and extending services for oversea resources exploration, including exploration material production, storage, and freight. It has operations in China, Zambia, Zimbabwe, Malaysia, the Democratic Republic of the Congo, Canada, Albania, Indonesia, Uganda, Papua New Guinea, Laos, the Philippines, Afghanistan, Pakistan, and Turkey. The company was formerly known as Sinomine Resource Exploration Co., Ltd. and changed its name to Sinomine Resource Group Co., Ltd. in August 2018. Sinomine Resource Group Co., Ltd. was founded in 1999 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100089",
        "website": "http://www.sinomine.cn",
        "market_cap": "Large Cap"
    },
    "002842.SZ": {
        "short_name": "GUANGDONG XIANGLU",
        "long_name": "Guangdong Xianglu Tungsten Co., Ltd.",
        "summary": "Guangdong Xianglu Tungsten Co., Ltd. engages in the research, development, production, and sales of tungsten products in China. Its products include tungsten trioxide, blue tungsten oxide, tungsten powder, tungsten carbide powder, and cemented carbide; and hard alloy. The company also exports its products. Guangdong Xianglu Tungsten Co., Ltd. was founded in 1997 and is based in Chaozhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chaozhou",
        "zipcode": null,
        "website": "http://www.xl-tungsten.com",
        "market_cap": "Mid Cap"
    },
    "002978.SZ": {
        "short_name": "SICHUAN ANNING IRO",
        "long_name": "Sichuan Anning Iron and Titanium Co.,Ltd.",
        "summary": "Sichuan Anning Iron and Titanium Co., Ltd. engages in the mining, washing, and sale of vanadium-titanium magnetite. Its principal products are titanium and vanadium-titanium iron concentrates. The company was founded in 1994 and is based in Panzhihua City, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Panzhihua City",
        "zipcode": null,
        "website": "http://www.scantt.com",
        "market_cap": "Large Cap"
    },
    "06GN.F": {
        "short_name": "CHINA KINGST.MNG HLDGS",
        "long_name": "China Kingstone Mining Holdings Limited",
        "summary": "China Kingstone Mining Holdings Limited, an investment holding company, engages in the mining, processing, and trading of marble stones and marble-related products in the People's Republic of China. Its offers beige marble slabs and blocks; and marble slags. The company also offers shaped stone products, including curved plates, moldings, fireplace components, tables, and special order products. The company owns and operates the Zhangjiaba Mine, which is located in Zhenjiang Village, Xiangshui County, Jiangyou City of Sichuan Province. China Kingstone Mining Holdings Limited was incorporated in 2010 and is headquartered in Jiangyou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Jiangyou",
        "zipcode": null,
        "website": "http://www.kingstonemining.com",
        "market_cap": "Small Cap"
    },
    "1370.HK": {
        "short_name": "AOWEI HOLDING",
        "long_name": "Aowei Holding Limited",
        "summary": "Aowei Holding Limited, through its subsidiaries, engages in the exploration, mining, processing, and sale of iron ore products in the People's Republic of China. The company's principal products include iron ores, preliminary concentrates, and iron ore concentrates. It owns and operates three iron ore mines, including Wang'ergou Mine that covers an area of approximately 1.5287 square kilometers situated in Zoumayi Village, Laiyuan County; Shuanmazhuang Mine, which covers an area of approximately 2.1871 square kilometers located in Zoumayi Village, Laiyuan County; and Zhijiazhuang Mine covering an area of approximately 0.3337 square kilometers situated in Yangjiazhuang Village, Laiyuan County. Aowei Holding Limited also provides hospital management services; establishes specialist clinics; and supplies medical consumables and nursing services. In addition, it is also engaged in supply chain business. The company was formerly known as Hengshi Mining Investments Limited and changed its name to Aowei Holding Limited in November 2017. Aowei Holding Limited was founded in 2004 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.aoweiholding.com",
        "market_cap": "Small Cap"
    },
    "1380.HK": {
        "short_name": "CHI KINGSTONE",
        "long_name": "China Kingstone Mining Holdings Limited",
        "summary": "China Kingstone Mining Holdings Limited, an investment holding company, engages in the mining, processing, and trading of marble stones and marble-related products in the People's Republic of China. Its offers beige marble slabs and blocks; and marble slags. The company also offers shaped stone products, including curved plates, moldings, fireplace components, tables, and special order products. The company owns and operates the Zhangjiaba Mine, which is located in Zhenjiang Village, Xiangshui County, Jiangyou City of Sichuan Province. China Kingstone Mining Holdings Limited was incorporated in 2010 and is headquartered in Jiangyou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Jiangyou",
        "zipcode": null,
        "website": "http://www.kingstonemining.com",
        "market_cap": "Small Cap"
    },
    "300930.SZ": {
        "short_name": "HANG ZHOU YITONG N",
        "long_name": "Hangzhou Yitong New Material Co., LTD",
        "summary": "Hangzhou Yitong New Material Co., LTD manufactures iron based powder products in China and internationally. The company produces the water atomized iron, alloy steel, free cutting steel, stainless steel, sintered hardening, diamond matrix, magnetic series, and ultrafine iron, as well as copper-based alloy powders. Its products are used in automobile, motorcycle, household appliances, electric tools, construction machinery, instrumentation, and other fields. The company was formerly known as Jiande Yitong Metal Powder Co.,Ltd. Hangzhou Yitong New Material Co., LTD was founded in 2000 and is based in Jiande City, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiande",
        "zipcode": "311613",
        "website": "http://www.ytpowder.com",
        "market_cap": "Mid Cap"
    },
    "33X1.F": {
        "short_name": "XINJIANG XINX.MNG H YC-25",
        "long_name": "Xinjiang Xinxin Mining Industry Co., Ltd.",
        "summary": "Xinjiang Xinxin Mining Industry Co., Ltd., together with its subsidiaries, engages in mining, ore processing, smelting, refining, and selling nickel, copper, and other nonferrous metals. It provides nickel cathode, as well as other products, including copper cathode, cobalt products, gold, silver, platinum, and palladium. The company holds a 100% interest in the Kalatongke nickel-copper mine located in Fuyun County, Xinjiang; and the Huangshandong, Huangshan, and Xiangshan nickel-copper mines situated in Hami, Xinjiang. It also has interests in two vanadium mines located in Shangnan, Shaanxi. Xinjiang Xinxin Mining Industry Co., Ltd. was founded in 1950 and is based in Urumqi, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Urumqi",
        "zipcode": "830000",
        "website": "http://kunlun.wsfg.hk",
        "market_cap": "Small Cap"
    },
    "3788.HK": {
        "short_name": "CHINA HANKING",
        "long_name": "China Hanking Holdings Limited",
        "summary": "China Hanking Holdings Limited, together with its subsidiaries, engages in the exploration, mining, processing, smelting, and marketing of mineral resources in the People's Republic of China and Australia. The company operates three iron ore mines, including Aoniu, Maogong, and Shangma mines, which are located in the Anshan-Benxi iron ore belt. It also operates three gold mining projects located in western and northern Australia. In addition, the company engages in the sale of agricultural and forestry products, and constructional design business; trading of building materials; and manufacture and sale of green building materials. The company was incorporated in 2010 and is headquartered in Shenyang, China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenyang",
        "zipcode": "110016",
        "website": "http://www.hankingmining.com",
        "market_cap": "Mid Cap"
    },
    "3833.HK": {
        "short_name": "XINXIN MINING",
        "long_name": "Xinjiang Xinxin Mining Industry Co., Ltd.",
        "summary": "Xinjiang Xinxin Mining Industry Co., Ltd., together with its subsidiaries, engages in mining, ore processing, smelting, refining, and selling nickel, copper, and other nonferrous metals. It provides nickel cathode, as well as other products, including copper cathode, cobalt products, gold, silver, platinum, and palladium. The company holds a 100% interest in the Kalatongke nickel-copper mine located in Fuyun County, Xinjiang; and the Huangshandong, Huangshan, and Xiangshan nickel-copper mines situated in Hami, Xinjiang. It also has interests in two vanadium mines located in Shangnan, Shaanxi. Xinjiang Xinxin Mining Industry Co., Ltd. was founded in 1950 and is based in Urumqi, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Urumqi",
        "zipcode": "830000",
        "website": "http://kunlun.wsfg.hk",
        "market_cap": "Mid Cap"
    },
    "3939.HK": {
        "short_name": "WANGUO MINING",
        "long_name": "Wanguo International Mining Group Limited",
        "summary": "Wanguo International Mining Group Limited, an investment holding company, engages in mining, ore processing, and sale of concentrate products in the People's Republic of China. The company offers copper, zinc, iron, sulfur, and lead concentrates, as well as gold and silver by-products. It holds interest in the Xinzhuang mine located in Jiangxi Province. The company was formerly known as Multinational International Group Limited. Wanguo International Mining Group Limited was incorporated in 2011 and is headquartered in Yichun, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Yichun",
        "zipcode": null,
        "website": "http://www.wgmine.com",
        "market_cap": "Small Cap"
    },
    "3993.HK": {
        "short_name": "CMOC",
        "long_name": "China Molybdenum Co., Ltd.",
        "summary": "China Molybdenum Co., Ltd., together with its subsidiaries, engages in the mining, beneficiation, smelting, refining, and trading of copper, cobalt, molybdenum, tungsten, niobium, phosphates, and other base and rare metals. The company provides molybdenum oxide, ferromolybdenum, molybdenum and tungsten concentrates, copper concentrate, cobalt hydroxide, ferroniobium, phosphate fertilizer, gold and silver, and other related products. It is also involved in the refining and sale of mineral products; purchase and sale of molybdenum and tungsten products; import and export of goods and technology; and hotel management, consulting, enterprise operating and management, asset management, logistics, and transportation businesses. The company has operations in China, Australia, Brazil and the Democratic Republic of the Congo, Switzerland, and internationally. China Molybdenum Co., Ltd. was incorporated in 2006 and is based in Luoyang, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Luoyang",
        "zipcode": "471500",
        "website": "http://www.cmoc.com",
        "market_cap": "Large Cap"
    },
    "600172.SS": {
        "short_name": "HENAN HUANGHE WHIRLWIND CO. LTD",
        "long_name": "Henan Huanghe Whirlwind Co., Ltd.",
        "summary": "Henan Huanghe Whirlwind Co., Ltd. manufactures and sells synthetic diamonds and diamond tools in China and internationally. Its principal products include super-hard materials and composites, super-hard abrasives, diamond presses, and construction machinery. The company also offers hoisting machinery, electromechanical products, metal powder products, drill pipe products, diamond bit products, motors, and pyrophyllite products. The company was founded in 1978 and is based in Zhengzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": null,
        "website": "http://www.huanghewhirlwind.com",
        "market_cap": "Mid Cap"
    },
    "600259.SS": {
        "short_name": "RISING NONFERROUS METALS SHARE ",
        "long_name": "Rising Nonferrous Metals Share Co.,Ltd.",
        "summary": "Rising Nonferrous Metals Share Co.,Ltd. engages in the research, mining, smelting, trading, and warehousing of non-ferrous metals. Its products include medium and heavy rare earth metals, and tungsten products. The company holds five tungsten mines. Rising Nonferrous Metals Share Co.,Ltd. is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510501",
        "website": "http://www.gsysgf.com",
        "market_cap": "Large Cap"
    },
    "600331.SS": {
        "short_name": "SICHUAN HONGDA CHEMICAL INDUSTR",
        "long_name": "Sichuan Hongda Co.,Ltd",
        "summary": "Sichuan Hongda Co.,Ltd. provides zinc and chemical products in China. The company offers chemical fertilizers, including ammonium phosphate, calcium hydrogen phosphate, potassium dihydrogen phosphate, potassium sulfate, potassium chloride, ammonium sulfate, ammonium chloride, etc., as well as industrial grade ammonium phosphate, feed grade calcium hydrogen phosphate, chlor-alkali, and industrial sulfuric acid. It also provides plastic woven bags, gypsum and gypsum products, zinc ingots, and zinc alloy, as well as extracted waste metal materials; and rare metals, such as molybdenum, indium, and antimony, as well as zinc oxide and other products. The company was founded in 1979 and is headquartered in Shifang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shifang",
        "zipcode": "618418",
        "website": "http://www.sichuanhongda.com",
        "market_cap": "Mid Cap"
    },
    "600338.SS": {
        "short_name": "TIBET SUMMIT INDUSTRIAL",
        "long_name": "Tibet Summit Resources Co., Ltd.",
        "summary": "Tibet Summit Resources Co., Ltd. operates as a non-ferrous metal mining resource developer in Central Asia. It explores for lead, zinc, copper, lithium, silver, and other metals. The company is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.xizangzhufeng.com",
        "market_cap": "Large Cap"
    },
    "600392.SS": {
        "short_name": "SHENGHE RESOURCES HOLDING CO LT",
        "long_name": "Shenghe Resources Holding Co., Ltd",
        "summary": "Shenghe Resources Holding Co., Ltd develops, produces, and supplies rare earth (RE) resource and relevant products in China and internationally. Its principal products include RE concentrates, RE oxidants, RE compounds, RE metals, RE metallurgical materials, RE catalysts, zircon sand, titanium concentrate, and rutile. The company also provides monazite; rare earth ferrosilicon, Si-Ba inoculants, vermiculizer, spheroidizing agents, etc.; kyanite; and molecule sieves, as well as various chemical compounds, including oxalic acid, ammonium nitrate, ammonium chloride, and thionyl chloride. Its products are used in new energy and materials, energy conservation and environmental protection, aerospace, military, and electronics industries. The company was formerly known as Tiancheng Co., Ltd. Of Taiyuan University Of Technology and changed its name to Shenghe Resources Holding Co., Ltd in January 2013. The company is headquartered in Chengdu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610041",
        "website": "http://www.shengheholding.com",
        "market_cap": "Large Cap"
    },
    "600456.SS": {
        "short_name": "BAOJI TITANIUM INDUSTRY CO",
        "long_name": "Baoji Titanium Industry Co., Ltd.",
        "summary": "Baoji Titanium Industry Co., Ltd. manufactures and sells titanium and titanium alloy products. Its products include plates, strips, foils, pipes, bars, wires, forgings, and castings. The company also produces zirconium, nickel, and steel in various forms. It offers its products for use in aviation, aerospace, ships and vessels, construction, medical, chemical processing, oil and gas, electric energy, metallurgy, marine engineering, tourism, and sports applications. The company exports its products to the United States, Japan, Germany, France, Britain, India, and internationally. The company was founded in 1999 and is based in Baoji, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Baoji",
        "zipcode": "721014",
        "website": "http://www.baoti.com",
        "market_cap": "Large Cap"
    },
    "600497.SS": {
        "short_name": "YUNNAN CHIHONG ZINC&GERMANIUM C",
        "long_name": "Yunnan Chihong Zinc & Germanium Co., Ltd.",
        "summary": "Yunnan Chihong Zinc & Germanium Co., Ltd. engages in the exploration, mining, processing, and trading of minerals in Japan. The company offers lead, zinc, hot-dip galvanized alloy, and cast zinc alloy ingots; and small metals, such as high-purity cerium oxide, zone smelting ingots, high-purity germanium tetrachloride, single-crystal, bismuth ingots, cadmium ingots, and indium ingots. It also provides precious metals, including gold and silver ingots; and chemical products comprising sulfuric acid, zinc sulfate water, ammonium sulfate, and industrial sulfur. The company was founded in 1951 and is based in Qujing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qujing",
        "zipcode": "655011",
        "website": "http://www.chxz.com",
        "market_cap": "Large Cap"
    },
    "600531.SS": {
        "short_name": "HENAN YUGANG GOLD & LEAD",
        "long_name": "Henan Yuguang Gold&Lead Co., Ltd.",
        "summary": "Henan Yuguang Gold&Lead Co., Ltd. produces and sells electrolytic lead, silver, gold, and other nonferrous and precious metal products in China. It is also involved in smelting, and the import and export trade businesses. The company's products include lead ingots, copper cathodes, gold bars, silver ingots, sulfuric acid, lead alloys, modified plastics, copper sulfate pentahydrate, and liquid oxygen and argon, as well as fine bismuth and tellurium, and target and active zinc oxide products. It serves the lead, recycling, copper, rare and precious metal, alloy development, new materials, equipment manufacturing, and trading logistics industries, as well as other related industries, such as chemicals, furnacing, technical consulting and service, and inspection and analysis industries. The company was founded in 2000 and is based in Jiyuan, China. Henan Yuguang Gold&Lead Co., Ltd. is a subsidiary of Henan Yuguang Gold Lead Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiyuan",
        "zipcode": "459000",
        "website": "http://www.yggf.com.cn",
        "market_cap": "Mid Cap"
    },
    "600532.SS": {
        "short_name": "SHANGHAI TOPCARE MEDICAL SERVIC",
        "long_name": "Shanghai Topcare Medical Services Co., Ltd.",
        "summary": "Shanghai Topcare Medical Services Co., Ltd. engages in mining activities. It primarily explores for iron ore. The company was formerly known as Shanghai Hongda Mining Co., Ltd. and changed its name to Shanghai Topcare Medical Services Co., Ltd. in December 2020. Shanghai Topcare Medical Services Co., Ltd. is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200120",
        "website": "http://www.hdky600532.com",
        "market_cap": "Mid Cap"
    },
    "600549.SS": {
        "short_name": "XIAMEN TUNGSTEN",
        "long_name": "Xiamen Tungsten Co., Ltd.",
        "summary": "Xiamen Tungsten Co., Ltd. engages in mining, smelting, downstream processing, and secondary resource recovery of tungsten, molybdenum, and rare earth metals in China and internationally. The company offers tungsten concentrates, including WO3, WOX, tungsten powder, WC, cemented carbide, tungsten steel, tungsten bars, tungsten wires, etc.; tungsten carbide and tungsten carbide powder; wear parts, such as metal cutting tools, drills, wear parts, ceramics alloys, electronic contacts, and others; tungsten oxide; tungsten powder; cobalt powder; and tungsten titanium carbide powder. It also provides thermal spray powder; RTP; cast WC; cemented carbide rods; cemented carbide tools; PCB micro-milling; cemented carbide pellets; cemented carbide grits; large carbide products; tubular welding rods; carbide substrates for PDCs; crude tungsten wires; doped tungsten rods; hot zone and tray for high temperature furnace; and fine tungsten wires. In addition, the company offers tungsten electrodes, large size tungsten and molybdenum rods, tungsten vacuum metalizing coils, tungsten alloys, and tungsten rods and crucibles. Further, it provides rear earth oxides, metals, and permanent magnets, as well as phosphor products; and ammonium molybdate, molybdenum power and round blanks, molybdenum wires and crucibles, and other molybdenum products, as well as molybdenum oxides, plates, electrodes, and round blanks. Additionally, the company offers Li-ion battery cathode materials, such as lithium cobalt oxides, ternary cathode materials, lithium manganese oxides, lithium iron phosphates, etc., as well as hydrogen storage alloy powders. It also develops communities and office buildings in Xiamen, Zhangzhou, Chengdu, Luzhou, Chongqing, and other places. The company was formerly known as Xiamen Wu Factory and changed its name to Xiamen Tungsten Co., Ltd. in December 1997. Xiamen Tungsten Co., Ltd. was founded in 1958 and is headquartered in Xiamen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361009",
        "website": "http://www.cxtc.com",
        "market_cap": "Large Cap"
    },
    "600711.SS": {
        "short_name": "CHENGTUN MINING GROUP CO. LTD",
        "long_name": "Chengtun Mining Group Co., Ltd.",
        "summary": "Chengtun Mining Group Co., Ltd. engages in non-ferrous metal mining activities in China. The company explores for copper, tin, tungsten, lead, zinc, gold, silver, and polymetallic metals. It also provides metal commercial factoring, as well as metal financing services. The company was formerly known as Xiamen Eagle Mining Group Co., Ltd. Chengtun Mining Group Co., Ltd. was incorporated in 1992 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": null,
        "website": "http://www.600711.com",
        "market_cap": "Large Cap"
    },
    "600714.SS": {
        "short_name": "QINGHAI JINRUI MINERAL DEVELOPM",
        "long_name": "Qinghai Jinrui Mineral Development Co., Ltd",
        "summary": "Qinghai Jinrui Mineral Development Co., Ltd produces and sells coal products. It operates through Coal Industry and Chemical Industry segments. The company also offers strontium carbonate, thiourea, sulfur, celestite ore powder, and lapis lazuli, as well as sand, gravel, and pebbles. It primarily operates in Qinghai province, China. The company was formerly known as Mountains in Qinghai Ferroalloy Co., Ltd. Qinghai Jinrui Mineral Development Co., Ltd was founded in 1996 and is headquartered in Xining, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xining",
        "zipcode": null,
        "website": null,
        "market_cap": "Mid Cap"
    },
    "600961.SS": {
        "short_name": "ZHUZHOU SMELTER GROUP CO. LTD.",
        "long_name": "Zhuzhou Smelter Group Co.,Ltd.",
        "summary": "Zhuzhou Smelter Group Co.,Ltd. produces and sells lead, zinc, and alloy products in China. The company offers lead, zinc, and silver ingots under the Torch brand. It is also involved in the recovery of copper, gold, silver, bismuth, cadmium, indium, tellurium, and other rare metals and sulfuric acid. The company is based in Zhuzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuzhou",
        "zipcode": null,
        "website": "http://www.torchcn.com",
        "market_cap": "Mid Cap"
    },
    "600980.SS": {
        "short_name": "BGRIMM TECHNOLOGY CO LTD",
        "long_name": "BGRIMM Technology Co., Ltd.",
        "summary": "BGRIMM Technology Co., Ltd. researches, develops, produces, and sells mining equipment in the People's Republic of China and internationally. The company also develops, produces, and sells magnetic materials and devices. It offers permanent ferrite magnetic powders, rare earth permanent magnets, injection pellets, magnetic devices, and soft magnetic and absorbing materials for the use in automobiles, computers, home appliances, electric toys, electric tools, electro-acoustic devices, etc. The company was formerly known as BGRIMM Magnetic Materials & Technology Co., Ltd. and changed its name to BGRIMM Technology Co., Ltd. in June 2016. BGRIMM Technology Co., Ltd. was founded in 2000 and is based in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100160",
        "website": "http://www.bgrimmtec.com",
        "market_cap": "Mid Cap"
    },
    "601020.SS": {
        "short_name": "TIBET HUAYU MINING CO LTD",
        "long_name": "Tibet Huayu Mining Co., Ltd.",
        "summary": "Tibet Huayu Mining Co., Ltd. engages in mining, processing, exploration, and sale of lead, zinc, copper, and other nonferrous metals in China. The company was founded in 2002 and is based in Lhasa, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lhasa",
        "zipcode": "850000",
        "website": "http://www.huayumining.com",
        "market_cap": "Mid Cap"
    },
    "601212.SS": {
        "short_name": "BAIYIN NONFERROUS GROUP CO LTD",
        "long_name": "Baiyin Nonferrous Group Co., Ltd.",
        "summary": "Baiyin Nonferrous Group Co., Ltd. engages in the mining, smelting, processing, and trading of various non-ferrous metals in China. It offers copper, lead, zinc, gold, silver, and cadmium ingots; zinc and lead-based alloys; and sulfuric acid, selenium dioxide, and other metal products. The company was founded in 1954 and is based in Baiyin, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Baiyin",
        "zipcode": "730900",
        "website": "http://www.bynmc.com",
        "market_cap": "Large Cap"
    },
    "601958.SS": {
        "short_name": "JINDUICHENG MOLYBDENUM CO. LTD.",
        "long_name": "Jinduicheng Molybdenum Co., Ltd.",
        "summary": "Jinduicheng Molybdenum Co., Ltd. produces and sells molybdenum products worldwide. It offers molybdenum furnace products, including roasted molybdenum concentrate and concentrate blocks, molybdenum iron and concentrate blocks, and ferro molybdenum; and molybdenum chemical products, such as sodium molybdate, ammonium molybdate, pure molybdenum disulfide and oxide, and ammonium octamolybdate and heptamolybdate, as well as molybdenum trioxide, organic molybdenum, and others. The company also provides molybdenum metal products comprising molybdenum powders, slabs, rods, wires, wafers, crucibles, electrodes, mandrels, stirrers, components, moly stands, screws, nozzles, material boats, cakes, rings, orifices, etc.; spraying molybdenum wires; rolling molybdenum rods and plates; and welded molybdenum round targets, as well as nuts. In addition, it offers sulfur concentrate, sulfuric acid, and ferric sulfate powder. Its products are used in the areas of steel milling, petrochemical, mechanical manufacture, aerospace, electronics, lighting, etc. The company is headquartered in Xi'an, China. Jinduicheng Molybdenum Co., Ltd. is a subsidiary of Jinduicheng Molybdenum Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710077",
        "website": "http://www.jdcmoly.com",
        "market_cap": "Large Cap"
    },
    "603399.SS": {
        "short_name": "JINZHOU JIXIANG MOLY CO LTD",
        "long_name": "Jinzhou Jixiang Molybdenum Co., Ltd.",
        "summary": "Jinzhou Jixiang Molybdenum Co., Ltd., together with its subsidiaries, engages in mining, smelting, processing, production, and sale of molybdenum products for steel mills in China. It provides moly metallurgical products, such as molybdenum alloy, oxide powder, and concentrates; and molybdenum chemical products, including ammonium molybdate and tetramolybdate, molybdenum trioxide and dioxide, and molybdenum powder. The company also offers molybdenum metal products comprising molybdenum wires, plates, rods, heads, electrodes, sheets, components, alloy mandrel, crucibles, and targets. It also sells its products in approximately 30 countries, including the United States, Russia, Britain, the Netherlands, Japan, Korea, Taiwan, and other countries. The company was founded in 2003 and is headquartered in Jinzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinzhou",
        "zipcode": "121007",
        "website": "http://www.ncdmoly.com",
        "market_cap": "Mid Cap"
    },
    "603799.SS": {
        "short_name": "ZHEJIANG HUAYOU COBALT CO LTD",
        "long_name": "Zhejiang Huayou Cobalt Co., Ltd",
        "summary": "Zhejiang Huayou Cobalt Co., Ltd engages in the research, development, manufacture, and sale of lithium battery materials and cobalt materials in China and internationally. The company's products include battery grade cobalt tetroxide and cobalt sulfate, and cobalt oxide; electrodeposited copper and copper oxide; cobalt trioxide, cobalt cathode, cobalt hydroxide battery grade, iron phosphate, and ferric phosphate; and Li carbonic acid and ternary precursors. Its products are used for Li-ion battery cathode material, high temperature alloy for aviation and aerospace, cemented carbide, colorant and glaze material, rubber adhesive, petrochemical catalysts, magnetic materials, glass, as well as used in the manufacture of dyes, paint, anti-wrinkle, and fireworks. The company was founded in 2002 and is headquartered in Tongxiang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tongxiang",
        "zipcode": "314500",
        "website": "http://www.huayou.com",
        "market_cap": "Large Cap"
    },
    "603979.SS": {
        "short_name": "JCHX MINING MANAGEMENT CO LTD",
        "long_name": "JCHX Mining Management Co.,Ltd.",
        "summary": "JCHX Mining Management Co.,Ltd. engages in mine engineering, development, and construction activities in the People's Republic of China and internationally. It is also involved in contract mining activities; and the research and development of non-ferrous, ferrous, and chemical industries. The company was founded in 1997 and is based in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101500",
        "website": "http://www.jchxmc.com",
        "market_cap": "Large Cap"
    },
    "603993.SS": {
        "short_name": "CHINA MOLYBDENUM CO. LTD.",
        "long_name": "China Molybdenum Co., Ltd.",
        "summary": "China Molybdenum Co., Ltd., together with its subsidiaries, engages in the mining, beneficiation, smelting, refining, and trading of copper, cobalt, molybdenum, tungsten, niobium, phosphates, and other base and rare metals. The company provides molybdenum oxide, ferromolybdenum, molybdenum and tungsten concentrates, copper concentrate, cobalt hydroxide, ferroniobium, phosphate fertilizer, gold and silver, and other related products. It is also involved in the refining and sale of mineral products; purchase and sale of molybdenum and tungsten products; import and export of goods and technology; and hotel management, consulting, enterprise operating and management, asset management, logistics, and transportation businesses. The company has operations in China, Australia, Brazil and the Democratic Republic of the Congo, Switzerland, and internationally. China Molybdenum Co., Ltd. was incorporated in 2006 and is based in Luoyang, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Luoyang",
        "zipcode": "471500",
        "website": "http://www.cmoc.com",
        "market_cap": "Large Cap"
    },
    "6CH.F": {
        "short_name": "CHINA HAN.HLDGS LTD HD-,1",
        "long_name": "China Hanking Holdings Limited",
        "summary": "China Hanking Holdings Limited, together with its subsidiaries, engages in the exploration, mining, processing, smelting, and marketing of mineral resources in the People's Republic of China and Australia. The company operates three iron ore mines, including Aoniu, Maogong, and Shangma mines, which are located in the Anshan-Benxi iron ore belt. It also operates three gold mining projects located in western and northern Australia. In addition, the company engages in the sale of agricultural and forestry products, and constructional design business; trading of building materials; and manufacture and sale of green building materials. The company was incorporated in 2010 and is headquartered in Shenyang, China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenyang",
        "zipcode": "110016",
        "website": "http://www.hankingmining.com",
        "market_cap": "Small Cap"
    },
    "8331.HK": {
        "short_name": "P.B. GROUP",
        "long_name": "P.B. Group Limited",
        "summary": "P.B. Group Limited, an investment holding company, engages in the bentonite mining, and production and sale of drilling mud and pelletizing clay in the People's Republic of China. The company holds 100% interest in the Huanghu Bentonite mine an open-pit mine with a permitted mining area of approximately 2.1311 square kilometers located in Anhui province. It also engages in financial service, such as money lending business and wealth management services, and provision of insurance and MPF Schemes brokerage services. The company was formerly known as HangKan Group Limited and changed its name to P.B. Group Limited in February 2021. P.B. Group Limited was founded in 2002 and is headquartered in Wuhu, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Wuhu",
        "zipcode": null,
        "website": "http://www.thepbg.com",
        "market_cap": "Small Cap"
    },
    "CMCLF": {
        "short_name": "CHINA MOLYBDENUM CO. LTD.",
        "long_name": "China Molybdenum Co., Ltd.",
        "summary": "China Molybdenum Co., Ltd., together with its subsidiaries, engages in the mining, beneficiation, smelting, refining, and trading of copper, cobalt, molybdenum, tungsten, niobium, phosphates, and other base and rare metals. The company provides molybdenum oxide, ferromolybdenum, molybdenum and tungsten concentrates, copper concentrate, cobalt hydroxide, ferroniobium, phosphate fertilizer, gold and silver, and other related products. It is also involved in the refining and sale of mineral products; purchase and sale of molybdenum and tungsten products; import and export of goods and technology; and hotel management, consulting, enterprise operating and management, asset management, logistics, and transportation businesses. The company has operations in China, Australia, Brazil and the Democratic Republic of the Congo, Switzerland, and internationally. China Molybdenum Co., Ltd. was incorporated in 2006 and is based in Luoyang, the People's Republic of China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Luoyang",
        "zipcode": "471500",
        "website": "http://www.cmoc.com",
        "market_cap": "Large Cap"
    },
    "CREQF": {
        "short_name": "CHINA RARE EARTH HLDGS",
        "long_name": "China Rare Earth Holdings Limited",
        "summary": "China Rare Earth Holdings Limited, together with its subsidiaries, engages in manufacturing and selling rare earth products and refractory products in the People's Republic of China, Japan, Europe, and internationally. The company offers rare earth products for use in electronic devices, computers, electronic motors, LCDs, DVDs, magnetic materials, magnetic memory chips, fiber optics, superconductors, mobile phone batteries, precision optics, and various energy-saving environmental protection products. It also provides refractory products, such as high temperature ceramics products for use in heat-treatment facilities for the petrochemical, steel metallurgy, non-ferrous metallurgy, glass, construction material, chemical fertilizer, and ceramics industries. In addition, China Rare Earth Holdings Limited trades in rare earth products; and manufactures and sells magnesium grains products. The company was formerly known as Yixing Xinwei Holdings Limited and changed its name to China Rare Earth Holdings Limited in May 2000. China Rare Earth Holdings Limited was founded in 1987 and is headquartered in Yixing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Yixing",
        "zipcode": "214226",
        "website": "http://www.creh.com.hk",
        "market_cap": "Small Cap"
    },
    "D7N.F": {
        "short_name": "CHINA MOLYBDENUM H YC-,20",
        "long_name": "China Molybdenum Co., Ltd.",
        "summary": "China Molybdenum Co., Ltd., together with its subsidiaries, engages in the mining, beneficiation, smelting, refining, and trading of copper, cobalt, molybdenum, tungsten, niobium, phosphates, and other base and rare metals. The company provides molybdenum oxide, ferromolybdenum, molybdenum and tungsten concentrates, copper concentrate, cobalt hydroxide, ferroniobium, phosphate fertilizer, gold and silver, and other related products. It is also involved in the refining and sale of mineral products; purchase and sale of molybdenum and tungsten products; import and export of goods and technology; and hotel management, consulting, enterprise operating and management, asset management, logistics, and transportation businesses. The company has operations in China, Australia, Brazil and the Democratic Republic of the Congo, Switzerland, and internationally. China Molybdenum Co., Ltd. was incorporated in 2006 and is based in Luoyang, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Luoyang",
        "zipcode": "471500",
        "website": "http://www.cmoc.com",
        "market_cap": "Large Cap"
    },
    "HI2.F": {
        "short_name": "AOWEI HLDG LTD HD-,0001",
        "long_name": "Aowei Holding Limited",
        "summary": "Aowei Holding Limited, through its subsidiaries, engages in the exploration, mining, processing, and sale of iron ore products in the People's Republic of China. The company's principal products include iron ores, preliminary concentrates, and iron ore concentrates. It owns and operates three iron ore mines, including Wang'ergou Mine that covers an area of approximately 1.5287 square kilometers situated in Zoumayi Village, Laiyuan County; Shuanmazhuang Mine, which covers an area of approximately 2.1871 square kilometers located in Zoumayi Village, Laiyuan County; and Zhijiazhuang Mine covering an area of approximately 0.3337 square kilometers situated in Yangjiazhuang Village, Laiyuan County. Aowei Holding Limited also provides hospital management services; establishes specialist clinics; and supplies medical consumables and nursing services. In addition, it is also engaged in supply chain business. The company was formerly known as Hengshi Mining Investments Limited and changed its name to Aowei Holding Limited in November 2017. Aowei Holding Limited was founded in 2004 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.aoweiholding.com",
        "market_cap": "Small Cap"
    },
    "HIH.V": {
        "short_name": "HYLANDS INTERNATIONAL HOLDINGS ",
        "long_name": "Hylands International Holdings Inc.",
        "summary": "Hylands International Holdings Inc. engages in the exploration, evaluation, and development of mineral property interests in the People's Republic of China. The company explores for nickel cobalt, and magnesium deposits. It holds interest in the Suyeke North property that comprises one exploration permit totaling 7.42 square kilometers located in Suyeke, Xinjiang Province. The company was formerly known as New Era Minerals Inc. and changed its name to Hylands International Holdings Inc. in June 2020. Hylands International Holdings Inc. was incorporated in 2007 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100020",
        "website": "http://www.neweramineralsinc.com",
        "market_cap": "Small Cap"
    },
    "RAE.F": {
        "short_name": "CHINA RARE EARTH  HD-,10",
        "long_name": "China Rare Earth Holdings Limited",
        "summary": "China Rare Earth Holdings Limited, together with its subsidiaries, engages in manufacturing and selling rare earth products and refractory products in the People's Republic of China, Japan, Europe, and internationally. The company offers rare earth products for use in electronic devices, computers, electronic motors, LCDs, DVDs, magnetic materials, magnetic memory chips, fiber optics, superconductors, mobile phone batteries, precision optics, and various energy-saving environmental protection products. It also provides refractory products, such as high temperature ceramics products for use in heat-treatment facilities for the petrochemical, steel metallurgy, non-ferrous metallurgy, glass, construction material, chemical fertilizer, and ceramics industries. In addition, China Rare Earth Holdings Limited trades in rare earth products; and manufactures and sells magnesium grains products. The company was formerly known as Yixing Xinwei Holdings Limited and changed its name to China Rare Earth Holdings Limited in May 2000. China Rare Earth Holdings Limited was founded in 1987 and is headquartered in Yixing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Yixing",
        "zipcode": "214226",
        "website": "http://www.creh.com.hk",
        "market_cap": "Small Cap"
    },
    "VIA.AX": {
        "short_name": "VIAGOLD FPO 1C",
        "long_name": "ViaGold Rare Earth Resources Holdings Limited",
        "summary": "ViaGold Rare Earth Resources Holdings Limited, an investment holding company, engages in processing, refining, and separating rare earth metals in the People's Republic of China. The company also provides management and consultancy services to educational institutions; and leasing and capital financing services. In addition, it is involved in trading minerals. The company was formerly known as ViaGOLD Capital Limited. ViaGold Rare Earth Resources Holdings Limited is based in Zhuhai, the People's Republic of China.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "ASX",
        "market": "au_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": null,
        "website": "http://www.viagold.ws",
        "market_cap": "Small Cap"
    },
    "WBWB": {
        "short_name": "WU BA SUPERIOR PRODS HLDG GROUP",
        "long_name": "WU BA Superior Products Holding Group Inc.",
        "summary": "Wu Ba Superior Products Holding Group Inc. owns and operates an ecommerce business in the People's Republic of China. Its ecommerce platform offers marketplace services that enable third-party merchants to sell products to consumers. The company is headquartered in ShenZhen, China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "ShenZhen",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "WI0.F": {
        "short_name": "WANGUO INTL MNG GRP HD-10",
        "long_name": "Wanguo International Mining Group Limited",
        "summary": "Wanguo International Mining Group Limited, an investment holding company, engages in mining, ore processing, and sale of concentrate products in the People's Republic of China. The company offers copper, zinc, iron, sulfur, and lead concentrates, as well as gold and silver by-products. It holds interest in the Xinzhuang mine located in Jiangxi Province. The company was formerly known as Multinational International Group Limited. Wanguo International Mining Group Limited was incorporated in 2011 and is headquartered in Yichun, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Yichun",
        "zipcode": null,
        "website": "http://www.wgmine.com",
        "market_cap": "Small Cap"
    },
    "Z4RN.F": {
        "short_name": "ADD NEW EN.INV.HLDGS",
        "long_name": "Add New Energy Investment Holdings Group Limited",
        "summary": "Add New Energy Investment Holdings Group Limited, an investment holding company, engages in the exploration, mining, and processing of iron and ilmenite ores in the People's Republic of China. It primarily produces and sells iron and titanium concentrates to iron pellets and steel producers. The company's mines include Yangzhuang Iron Mine, Zhuge Shangyu Ilmenite Mine, and Qinjiazhuang Ilmenite Mine. It is also involved in the trading of coarse iron powder and mixed coal; generation of wind power; and provision of finance lease. The company was formerly known as China Zhongsheng Resources Holdings Limited and changed its name to Add New Energy Investment Holdings Group Limited in July 2016. Add New Energy Investment Holdings Group Limited was incorporated in 2011 and is headquartered in Yishui, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Yishui",
        "zipcode": null,
        "website": "http://www.addnewenergy.com.hk",
        "market_cap": "Small Cap"
    }
}