{
    "000820.SZ": {
        "short_name": "SHENWU ENERGY SAVI",
        "long_name": "Shenwu Energy Saving Co., Ltd.",
        "summary": "Shenwu Energy Saving Co., Ltd. act as a technical proposal supplier and engineering contractor in the energy conservation, environmental protection, and utilization of resources. It engages in the treatment and recovery of solid wastes and dust in the steel industry; and smelting slags from the non-ferrous industry. The company is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210019",
        "website": "http://www.sw-es.cn",
        "market_cap": "Small Cap"
    },
    "002499.SZ": {
        "short_name": "KELIN ENVIRONMENTA",
        "long_name": "Kelin Environmental Protection Equipment, Inc.",
        "summary": "Kelin Environmental Protection Equipment, Inc. manufactures and sells environmental protection equipment in China. It offers bag filters, bag and electrical filters, desulfurization and denitration equipment, dry and wet electrostatic precipitators, ultra-high temperature filters, cyclone equipment, small filters, furnace shell equipment, cooling equipment, electrical and control equipment, conveying equipment, and auxiliary products. The company also provides EPC services. Its products are used in metallurgical, power, solid waste incineration, grain, building material, light industry chemical, non-ferrous metal, and other industries. The company was formerly known as Wujiang Baodai Dedusting Co., Ltd. and changed its name to Kelin Environmental Protection Equipment, Inc. in 2007. Kelin Environmental Protection Equipment, Inc. was founded in 1979 and is headquartered in Suzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215200",
        "website": "http://www.kelin-china.com",
        "market_cap": "Small Cap"
    },
    "0586.HK": {
        "short_name": "CONCH VENTURE",
        "long_name": "China Conch Venture Holdings Limited",
        "summary": "China Conch Venture Holdings Limited, an investment holding company, provides energy preservation and environmental protection solutions in Mainland China, rest of Asia, Africa, and North America. The company operates through Energy Preservation and Environmental Protection Solutions, Port Logistics Services, and New Building Materials segments. It manufactures and sells residual heat power generation, vertical mill, waste incineration, and solid waste solutions, as well as offers related after sales services. The company also provides port logistics services, including cargo handling, trans-shipment, and warehousing services; and alternative wall building materials, such as cellulose fiber cement sheets, and autoclaved and wood wool cement boards. In addition, it designs and constructs energy preservation and environmental protection projects. China Conch Venture Holdings Limited was founded in 2013 and is headquartered in Wuhu, China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Wuhu",
        "zipcode": "241070",
        "website": "http://www.conchventure.com",
        "market_cap": "Mid Cap"
    },
    "1296.HK": {
        "short_name": "GUODIAN TECH",
        "long_name": "Guodian Technology & Environment Group Corporation Limited",
        "summary": "Guodian Technology & Environment Group Corporation Limited provides environmental protection and energy conservation solutions, and renewable energy equipment manufacturing and services in the People's Republic of China. It operates through four segments: Environmental Protection, Energy Conservation Solutions, Wind Power Products and Services, and All Others. The Environmental Protection segment offers sulphur oxide and nitrogen oxide control technologies, desulphurization and denitrification facilities rental, ash removal with filer bag, and water treatment related technologies and products. The Energy Conservation Solutions segment offers energy saving products and services, including plasma and micro-oil ignition equipment; gas turbine improvement services; and energy-efficient power plants construction services. The Wind Power Products and Services segment produces and sells wind turbine and its components; and offers system solutions and services to wind power operators. The All Others segment generates wind and solar power; and sells other electric power control system related products. The company also offers desulphurization and other environmental protection engineering services; produces and sells selective catalytic reduction catalyst; constructs and operates water treatment projects; designs and installs sewage treatment equipment; researches, develops, and sells wind turbine technology; and provides energy conservation engineering services. In addition, it produces and sells steam turbines and other electric equipment, variable pitch control systems for wind turbine, and electric power related products; and researches and develops technology. The company was formerly known as Guodian Technology & Environment Group Limited Liability Company and was changed to Guodian Technology & Environment Group Corporation Limited. The company was founded in 2001 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100039",
        "website": "http://www.01296.hk",
        "market_cap": "Small Cap"
    },
    "1452.HK": {
        "short_name": "DENOX ENV",
        "long_name": "Denox Environmental & Technology Holdings Limited",
        "summary": "Denox Environmental & Technology Holdings Limited, an investment holding company, designs, manufactures, and sells plate-type DeNOx catalysts in the People's Republic of China and internationally. The company sells its plate-type DeNOx catalysts to coal-fired power plants; engineering, procurement, and construction services providers; and boiler manufacturers. It also produces stainless steel mesh. In addition, the company develops catalysts for diesel-powered vehicles and vessels. Denox Environmental & Technology Holdings Limited was founded in 2010 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100070",
        "website": "http://www.china-denox.com",
        "market_cap": "Small Cap"
    },
    "1527.HK": {
        "short_name": "TENGY ENV",
        "long_name": "Zhejiang Tengy Environmental Technology Co., Ltd",
        "summary": "Zhejiang Tengy Environmental Technology Co., Ltd, together with its subsidiaries, designs, develops, manufactures, installs, and sells environmental pollution prevention equipment and electronic products in Mainland China and internationally. The company offers electrostatic precipitators, bag filter precipitators, and electrostatic-bag composite precipitators. Its precipitators are installed at coal-fired power plants, metallurgical plants, paper mills, and other industrial production plants. The company also offers installation services. Its customers include project owners of power plants and industrial production plants, or contractors who undertake the construction work of power plants and industrial production plants. The company was founded in 2009 and is headquartered in Zhuji, China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zhuji",
        "zipcode": null,
        "website": "http://www.tengy.com",
        "market_cap": "Small Cap"
    },
    "2014.HK": {
        "short_name": "OZNER WATER",
        "long_name": "Ozner Water International Holding Limited",
        "summary": "Ozner Water International Holding Limited, an investment holding company, engages in the water purification, air sanitization, supply chain, and other businesses in the People's Republic of China. The company's Water Purification segment sells and leases water purification machines; and provides training services to distributors. The Air Sanitisation segment engages in the provision of air sanitization construction, and related consulting and training services; and sale of air sanitization products. The Supply Chain segment sells micro motor products. The Other segment provides financing services in lending loans to distributors. It is also involved in the development and manufacture of water purification and air sanitization products, as well as micro motor products; and provision of finance leasing/leasing/factoring, and water purifying services. Ozner Water International Holding Limited was incorporated in 2013 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.ozner.net",
        "market_cap": "Small Cap"
    },
    "2377.HK": {
        "short_name": "BOQI ENV",
        "long_name": "China Boqi Environmental (Holding) Co., Ltd.",
        "summary": "China Boqi Environmental (Holding) Co., Ltd., an investment holding company, offers flue gas treatment services and environmental protection solutions in the People's Republic of China and internationally. The company operates through Environmental Protection Facility Engineering (EPC), Operation and Maintenance (O&M), Build-Operate-Transfer (BOT) & Transfer-Operate-Transfer (TOT), and Others segments. The EPC segment offers project engineering and design, equipment and materials procurement, project construction, and equipment installment and testing services. The O&M segment provides operation and regular maintenance services for the desulfurization, denitrification, and dust removal facilities. The BOT & TOT segment engages in the construction of infrastructure or acquisition of existing infrastructure from grantor, operation and maintenance of flue gas treatment projects to the concession contract, and transferring the ownership of the infrastructure to the grantor. The Others segment sells by-products and others. It also engages in the provision of technical support, facilities testing, and spare parts replacement services. In addition, the company sells coal and chemicals; and offers technology and exploration services. China Boqi Environmental (Holding) Co., Ltd., was incorporated in 2015 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.chinaboqi.com",
        "market_cap": "Small Cap"
    },
    "300137.SZ": {
        "short_name": "HEBEI SAILHERO ENV",
        "long_name": "Hebei Sailhero Environmental Protection High-tech Co.,Ltd",
        "summary": "Hebei Sailhero Environmental Protection High-tech Co.,Ltd researches, develops, manufactures, and sells online and automatic environmental monitoring instruments in China. It offers ambient air monitoring and early warning systems, surface and underground water monitoring systems, drinking water monitoring and early warning systems, acid rain online monitoring systems, and pollution source online monitoring systems, as well as emergency monitoring, decision-making, and command systems. The company also provides operation services for environmental monitoring instruments. Hebei Sailhero Environmental Protection High-tech Co.,Ltd was founded in 1996 and is based in Shijiazhuang, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": "050035",
        "website": "http://www.sailhero.com",
        "market_cap": "Small Cap"
    },
    "300152.SZ": {
        "short_name": "XIONGAN KERONG ENV",
        "long_name": "Xiongan Kerong Environment Technology Co., Ltd.",
        "summary": "Xiongan Kerong Environment Technology Co., Ltd. designs, manufactures, and sells boiler ignition and combustion sets of equipment and control systems. It operates water conservancy and water environment governance, ecological environment governance, energy-saving combustion, thermal power cogeneration and engineering, distributed energy management, solid waste treatment, soil governance, environmental monitoring, clean combustion, and integrated environmental governance businesses. The company was formerly known as Xuzhou Kerong Environmental Resources Co., Ltd. and changed its name to Xiongan Kerong Environment Technology Co., Ltd. in July 2019. The company was founded in 1980 and is based in Baoding, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Baoding",
        "zipcode": null,
        "website": "http://www.kre.cn",
        "market_cap": "Small Cap"
    },
    "300272.SZ": {
        "short_name": "CANATURE HEALTH TE",
        "long_name": "Canature Health Technology Group Co., Ltd.",
        "summary": "Canature Health Technology Group Co., Ltd. manufactures and sells residential and commercial water treatment systems and components worldwide. It provides control valves, pressure tanks, water softeners, water filters, reverse osmosis products, brine tanks, and commercial and industrial water systems. The company sells its products under the Canature brand name. The company was formerly known as Shanghai Canature Environmental Products Co., Ltd. and changed its name to Canature Health Technology Group Co., Ltd. in July 2018. Canature Health Technology Group Co., Ltd. was founded in 2001 and is based in Shanghai, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201299",
        "website": "http://www.canature-global.com",
        "market_cap": "Small Cap"
    },
    "300425.SZ": {
        "short_name": "CSCEC SCIMEE SCI&T",
        "long_name": "Cscec Scimee Sci. and Tech. Co., Ltd.",
        "summary": "Cscec Scimee Sci. and Tech. Co., Ltd. develops environment protection equipment in China. The company offers magnetic separation water purification equipment in metallurgy, coal, river, oil, car, sanitation, sludge treatment, and other fields. It also engages in sludge treatment activities. The company was formerly known as Scimee Sci.&Tech. Co.,Ltd and changed its name to Cscec Scimee Sci. and Tech. Co., Ltd. in October 2019. Cscec Scimee Sci. and Tech. Co., Ltd. was founded in 2002 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610045",
        "website": "http://www.scimee.com",
        "market_cap": "Small Cap"
    },
    "300664.SZ": {
        "short_name": "PENGYAO ENVIRONMEN",
        "long_name": "Penyao Environmental Protection Co., Ltd.",
        "summary": "Penyao Environmental Protection Co., Ltd. engages in the environmental protection equipment business in China. It manufactures and sells sewage treatment, water purification, environmental protection, and sludge treatment and disposal equipment. The company was founded in 1984 and is headquartered in Yixing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yixing",
        "zipcode": "214214",
        "website": "http://www.penyao.com.cn",
        "market_cap": "Small Cap"
    },
    "300929.SZ": {
        "short_name": "ANHUI HUAQI ENVIRO",
        "long_name": "Anhui Huaqi Environmental Protection Technology Co., Ltd.",
        "summary": "Anhui Huaqi Environmental Protection Technology Co., Ltd. offers sewage treatment plants. It engages in the technical research of biological aerated filter, engineering design, EPC, pollution control facility operation, BOT investment, and development and production of the matched products. It provides integrated sewage treatment equipment; vehicle-mounted treatment equipment; decontamination desanding products comprising micro-filter for BAFÂ\u0096rotary and BAF special microfiltration machine-flat; methanol dosing; and BAF pool equipment. The company was founded in 2002 and is based in Maanshan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Maanshan",
        "zipcode": "243061",
        "website": "http://www.hqhb.com",
        "market_cap": "Small Cap"
    },
    "5GD.SI": {
        "short_name": "Sunpower",
        "long_name": "Sunpower Group Ltd.",
        "summary": "Sunpower Group Ltd. provides environmental protection solutions in the People's Republic of China, Canada, the United States, Asia, South East Asia, the Middle East, and Europe. The company operates through two segments, Manufacturing & Services and Green Investments. The Manufacturing & Services segment designs, researches, develops, and manufactures heat exchangers and pressure vessels that are used for completing the reaction, heat transfer, separation, and storage processes of industrial production; and pipeline energy saving products, such as steam distribution pipelines, pipe and spring supports, and hangers that provide heat isolation from environmental temperature changes and minimize temperature loss during transmission. This segment also offers heat pipes and heat pipe exchangers that are used in the petrochemical, steel and chemical industries; heat pipes, which are used in the construction of roads, railways, and oil pipelines; and related environmental protection products. It also offers flare and flare gas recovery systems to recover petrochemical by-products from flare or waste gas; zero liquid discharge systems for high salinity wastewater; and petrochemical engineering, which provides sulfur recovery solutions, skid-mounted equipment, and formaldehyde devices; waste heat recovery and pipeline energy saving engineering solutions; and thermal power engineering comprising engineering, procurement, and construction services for thermal power projects. The Green Investments segment invests, develops, and operates centralized steam, heat, and electricity cogeneration plants. The company also installs and commissions various projects; provides design, technical and consultation, technology, sales, and after-sale services; produces and sells foam glass products; researches new energy-saving materials; and supplies heat and electricity to enterprises. Sunpower Group Ltd. was founded in 1997 and is headquartered in Nanjing, the People's Republic of China.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "211112",
        "website": "http://www.sunpower.com.cn",
        "market_cap": "Small Cap"
    },
    "600388.SS": {
        "short_name": "FUJIAN LONGKING CO LTD",
        "long_name": "Fujian Longking Co., Ltd.",
        "summary": "Fujian Longking Co., Ltd. manufactures and sells air pollution protection equipment worldwide. The company's products include flue gas dust collection, FGD, SNCR, bulk material conveying, and electrical control equipment, as well as package solutions for flue gas pollutants. Its products are used in various industries, including electric power, metallurgy, building materials, light industry, and chemical industry. The company exports its products to 40 countries and regions, including Japan, Russia, Brazil, Thailand, Philippine, Indonesia, Iran, Serbia, and Turkey. Fujian Longking Co., Ltd. was founded in 1971 and is based in Longyan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Longyan",
        "zipcode": "364000",
        "website": "http://www.longking.com.cn",
        "market_cap": "Small Cap"
    },
    "603177.SS": {
        "short_name": "ZHEJIANG TUNA ENVIRONMENTAL SCI",
        "long_name": "Zhejiang Tuna Environmental Science & TechnologyCo.,Ltd.",
        "summary": "Zhejiang Tuna Environmental Science & TechnologyCo.,Ltd. engages in the research and development, manufacture, and turnkey contract of flue gas purification technologies in China and internationally. The company undertakes engineering projects, such as wet lime-stone, semi-dry, and ammonia flue gas desulphurization, as well as SCR flue gas denitration, bag\\electric precipitator, and other projects on EPC and BOT basis. It also offers desulfurization products, including MST series wet-type limestone ball mills, rubber lined pipes, TBF-DU belt type vacuum filters, TLD single-shaft double louver series dampers, TME mist eliminators, and TSP-I spray banks; dedusting equipment comprising wet electro-static precipitators and electric-bag composite dust collectors, as well as dry dust remover technology; and cellular and plate catalysts. The company was founded in 2005 and is headquartered in Shaoxing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shaoxing",
        "zipcode": "312000",
        "website": "http://www.zj-tuna.com",
        "market_cap": "Small Cap"
    },
    "603200.SS": {
        "short_name": "SHANGHAI EMPEROR OF CLEANING HI",
        "long_name": "Shanghai Emperor of Cleaning Hi-Tech Co., Ltd",
        "summary": "Shanghai Emperor of Cleaning Hi-Tech Co., Ltd provides water treatment and air duct cleaning services. It offers process water, sewage, boiler water, circulating water, and other water treatment services for various industries, such as iron and steel metallurgy, petrochemical, pulp and paper, automobile manufacturing, electronics, and medicine; and civil water treatment technology services, including commercial air conditioning water treatment, rainwater harvesting, water reuse, landscape water treatment, and water saving services in commercial buildings, airport stations, urban complexes, etc. The company's duct cleaning services comprise central air-conditioning duct cleaning and disinfection, closed space environment disinfection, and other services for hotel business buildings, airport, high-speed rail stations, urban complexes, and other places. Shanghai Emperor of Cleaning Hi-Tech Co., Ltd was founded in 1994 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200437",
        "website": "http://www.china-xiba.com",
        "market_cap": "Small Cap"
    },
    "603408.SS": {
        "short_name": "RUNNER (XIAMEN) CORP",
        "long_name": "Runner (Xiamen) Corp.",
        "summary": "Runner (Xiamen) Corp. manufactures and sells kitchen and bathroom, water purification, fresh air purification, health care, and other home furnishing produts in China and internationally. It offers faucets, showers, bathroom accessories, showerdoors, and toilet parts; household, commercial, whole house, and replacement filters; and wall mount fresh air ventilation systems, cabinet type fresh air ventilation systems, fresh air ventilation systems, and empty machine series. The company also provides gerontic care and health care products; and intelligent equipment and auto parts. Runner (Xiamen) Corp. was founded in 1990 and is headquartered in Xiamen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361021",
        "website": "http://runner-corp.com",
        "market_cap": "Small Cap"
    },
    "603686.SS": {
        "short_name": "FUJIAN LONGMA ENVIR SANITATION ",
        "long_name": "Fujian Longma Environmental Sanitation Equipment Co., Ltd.",
        "summary": "Fujian Longma Environmental Sanitation Equipment Co., Ltd. manufactures sanitation equipment in China. The company offers road cleaning equipment, such as road sweepers, vacuum sweepers, road washing and cleaning trucks, sprinklers, high-pressure sprinklers, multi-functional dust suppression trucks, pavement maintaining trucks, guardrail cleaning trucks, sewer dredging and cleaning trucks, and snow sweepers. It also provides garbage transfer equipment, including suction-type sewer, compression garbage, dock with self-discharging garbage, detachable container garbage, kitchen garbage, self-loading and discharging garbage trucks, as well as garbage compression and transfer stations, garbage bin carriers, and movable refuse compactor. In addition, the company offers waste disposal equipment; EV power products; and road cleaning and garbage transfer spare parts, as well as municipal services. Further, it is involved in various activities comprising city cleaning, garbage collecting and transferring, public toilet operating, landscaping, etc. The company markets its products under the FULONGMA brand. Fujian Longma Environmental Sanitation Equipment Co., Ltd. is headquartered in Longyan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Longyan",
        "zipcode": "364012",
        "website": "http://www.fjlm.com.cn",
        "market_cap": "Small Cap"
    },
    "688069.SS": {
        "short_name": "WUXI DELINHAI ENVIRONMENTA TECH",
        "long_name": "Wuxi Delinhai Environmental Technology Co., Ltd.",
        "summary": "Wuxi Delinhai Environmental Technology Co., Ltd. engages in the cyanobacteria treatment technology business in China. It develops, sells, integrates, operates, and maintains cyanobacteria treatment equipment for the treatment of lake and reservoir cyanobacteria blooms; and the prevention and control of cyanobacteria blooms. The company was founded in 2009 and is based in Wuxi, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": null,
        "website": "http://www.wxdlh.com",
        "market_cap": "Small Cap"
    },
    "688309.SS": {
        "short_name": "NIUTECH ENVIRONMENT TECHNOLOGY ",
        "long_name": "Niutech Environment Technology Corporation",
        "summary": "Niutech Environment Technology Corporation engages in the research and development, production, and sale of environment protection equipment worldwide. It offers tire to oil, plastic to oil, oil purification, CB processing, biomass pyrolysis, and oil sludge systems. The company is based in Jinan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": "250002",
        "website": "http://niutech.com",
        "market_cap": "Small Cap"
    },
    "68C.F": {
        "short_name": "CHINA CONCH VENT. HD -,01",
        "long_name": "China Conch Venture Holdings Limited",
        "summary": "China Conch Venture Holdings Limited, an investment holding company, provides energy preservation and environmental protection solutions in Mainland China, rest of Asia, Africa, and North America. The company operates through Energy Preservation and Environmental Protection Solutions, Port Logistics Services, and New Building Materials segments. It manufactures and sells residual heat power generation, vertical mill, waste incineration, and solid waste solutions, as well as offers related after sales services. The company also provides port logistics services, including cargo handling, trans-shipment, and warehousing services; and alternative wall building materials, such as cellulose fiber cement sheets, and autoclaved and wood wool cement boards. In addition, it designs and constructs energy preservation and environmental protection projects. China Conch Venture Holdings Limited was founded in 2013 and is headquartered in Wuhu, China.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Wuhu",
        "zipcode": "241070",
        "website": "http://www.conchventure.com",
        "market_cap": "Mid Cap"
    },
    "9GT.F": {
        "short_name": "GUODIAN TECH.+ENV.GR.HYC1",
        "long_name": "Guodian Technology & Environment Group Corporation Limited",
        "summary": "Guodian Technology & Environment Group Corporation Limited provides environmental protection and energy conservation solutions, and renewable energy equipment manufacturing and services in the People's Republic of China. It operates through four segments: Environmental Protection, Energy Conservation Solutions, Wind Power Products and Services, and All Others. The Environmental Protection segment offers sulphur oxide and nitrogen oxide control technologies, desulphurization and denitrification facilities rental, ash removal with filer bag, and water treatment related technologies and products. The Energy Conservation Solutions segment offers energy saving products and services, including plasma and micro-oil ignition equipment; gas turbine improvement services; and energy-efficient power plants construction services. The Wind Power Products and Services segment produces and sells wind turbine and its components; and offers system solutions and services to wind power operators. The All Others segment generates wind and solar power; and sells other electric power control system related products. The company also offers desulphurization and other environmental protection engineering services; produces and sells selective catalytic reduction catalyst; constructs and operates water treatment projects; designs and installs sewage treatment equipment; researches, develops, and sells wind turbine technology; and provides energy conservation engineering services. In addition, it produces and sells steam turbines and other electric equipment, variable pitch control systems for wind turbine, and electric power related products; and researches and develops technology. The company was formerly known as Guodian Technology & Environment Group Limited Liability Company and was changed to Guodian Technology & Environment Group Corporation Limited. The company was founded in 2001 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100039",
        "website": "http://www.01296.hk",
        "market_cap": "Small Cap"
    },
    "CGYV": {
        "short_name": "CHINA ENERGY RECOVERY INC",
        "long_name": "China Energy Recovery, Inc.",
        "summary": "China Energy Recovery, Inc. designs, manufactures, installs, and services waste heat recovery systems in China. The company's energy recovery systems capture industrial waste energy to produce electrical power, which enables industrial manufacturers to reduce their energy costs, shrink their emissions footprint, and generate saleable emissions credits. It serves petrochemical, paper manufacturing, refining/power generation, coke processing, cement, and steel industries. The company is headquartered in Shanghai, China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": null,
        "market_cap": "Small Cap"
    },
    "LS9.SI": {
        "short_name": "Leader Env",
        "long_name": "Leader Environmental Technologies Limited",
        "summary": "Leader Environmental Technologies Limited, an investment holding company, engages in the research and development, design, fabrication, assembly, and installation of environmental protection systems primarily for industrial waste gas and wastewater treatments in the People's Republic of China. The company also provides technical consulting and support services for environmental protection technologies and systems. In addition, it offers industrial waste gas treatment solutions for the elimination of dust and desulphurization from the emission of industrial waste gas, as well as for the elimination of nitrogen oxides from the emission of waste gas; and industrial wastewater treatment solutions for the removal and reduction of pollutants in the wastewater from the emission of industrial wastewater, as well as undertakes operation and maintenance works. Further, the company invests in the construction and operation of new energy generation, water management, and other related environmental projects. The company was incorporated in 2006 and is headquartered in Changchun, the People's Republic of China.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": "130033",
        "website": "http://www.anjie.cc",
        "market_cap": "Small Cap"
    },
    "NEWA": {
        "short_name": "Newater Technology, Inc.",
        "long_name": "Newater Technology, Inc.",
        "summary": "Newater Technology, Inc. operates as a wastewater purification treatment company in the People's Republic of China. The company focuses on the development, manufacture, and sale of disk tube reverse osmosis and disk tube Nano-filtration membrane filtration products that are used in the treatment, recycling, and discharge of wastewater. It also offers engineering support and installation, technical advice and service, and other project-related solutions to turn wastewater into clean water. In addition, the company offers landfill leachate treatment and purification services; and traditional wastewater treatment solutions, such as activated carbon and resins. It primarily serves energy, garbage and waste, and chemical industries. Newater Technology, Inc. was founded in 2012 and is headquartered in Yantai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Yantai",
        "zipcode": "264000",
        "website": "http://dtnewa.com",
        "market_cap": "Small Cap"
    },
    "OZ1.F": {
        "short_name": "OZNER WAT.INTL HLDG HD-01",
        "long_name": "Ozner Water International Holding Limited",
        "summary": "Ozner Water International Holding Limited, an investment holding company, engages in the water purification, air sanitization, supply chain, and other businesses in the People's Republic of China. The company's Water Purification segment sells and leases water purification machines; and provides training services to distributors. The Air Sanitisation segment engages in the provision of air sanitization construction, and related consulting and training services; and sale of air sanitization products. The Supply Chain segment sells micro motor products. The Other segment provides financing services in lending loans to distributors. It is also involved in the development and manufacture of water purification and air sanitization products, as well as micro motor products; and provision of finance leasing/leasing/factoring, and water purifying services. Ozner Water International Holding Limited was incorporated in 2013 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.ozner.net",
        "market_cap": "Small Cap"
    }
}