{
    "002236.SZ": {
        "short_name": "ZHEJIANG DAHUA TEC",
        "long_name": "Zhejiang Dahua Technology Co., Ltd.",
        "summary": "Zhejiang Dahua Technology Co., Ltd. operates in the security video surveillance industry worldwide. The company offers network, high definition composite video interface (HDCVI), PTZ, and thermal cameras; network and HDCVI recorders; video intercoms, including kits, accessories, emergency phone terminals, and IP and analog products; and access control products, such as controllers, modules, turnstiles, accessories, AI, and time attendance solutions. It also provides alarms; traffic enforcement, entrance and exit, parking, mobile products/solutions, MPT, and related software and accessories; transmission solutions comprising PoE, ePoE, access, aggregation, and core switches, as well as related accessories and platforms; display and control solutions, including video management platform (VMP), decoders, splicing controllers, network keyboards, LCD monitors and video walls, LCD digital signage, LED displays, and interactive LCD displays; and video conferencing solutions. In addition, the company offers face recognition, vehicle analysis, event detection, and structuring servers; security screening; IP and cloud storage products; drones; memory cards and internal SSDs; and cable accessories, power, cabling, and audio solutions, as well as detectors and software solutions. It serves transportation, building, retail, banking and finance, critical infrastructure, and warehousing and logistics industries, as well as the government. Zhejiang Dahua Technology Co., Ltd. was incorporated in 2002 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310053",
        "website": "http://www.dahuatech.com",
        "full_time_employees": 17251
    },
    "002268.SZ": {
        "short_name": "CHENGDU WESTONE IN",
        "long_name": "Westone Information Industry Inc.",
        "summary": "Westone Information Industry Inc. provides network information security solutions, products, and services to industrial clients and enterprise-level users in China. It offers commercial crypto products, including crypto chips, modules, devices, systems, etc.; and information security products comprising network security products, host security products, data security products, security application products, security management products, etc. The company also provides security information systems, such as mobile Internet security products, high-security terminals, wireless communication security products, etc.; and security integration and operation services consisting of consultation, planning, designing, operation, and maintenance. Westone Information Industry Inc. was founded in 1998 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610041",
        "website": "http://www.westone.com.cn",
        "full_time_employees": 2409
    },
    "002312.SZ": {
        "short_name": "SICHUAN DEV LOMON",
        "long_name": "Sichuan Development Lomon Co., Ltd.",
        "summary": "Chengdu Santai Holding Group Co., Ltd. provides financial outsourcing services in China. The company offers business process combing, platform centralized management, and big data analysis and service solutions for various business processes of the banking industry. It also provides phosphorus chemical products, including industrial grade monoammonium phosphate, feed-grade calcium hydrogen phosphate, and fertilizer-grade monoammonium phosphate. The company was founded in 1997 and is headquartered in Chengdu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610091",
        "website": "http://www.isantai.com",
        "full_time_employees": 3379
    },
    "002528.SZ": {
        "short_name": "SHENZHEN INFINOVA",
        "long_name": "Shenzhen Infinova Limited",
        "summary": "Shenzhen Infinova Limited provides electronic security products and solutions worldwide. The company offers IP digital and analog monitoring systems, such as bolt machines, hemispheres, fast balls, integrated cameras, PTZs, video codecs, matrix and optical products, DVRs, keyboards, and auxiliary equipment, as well as CCTV management software; and HD-SDI digital monitoring systems, including gun cameras, high-speed domes, PTZ cameras, optical and matrix products, encoders, DVRs, and auxiliary products. It also provides intelligent traffic monitoring systems comprising electronic police machines, bayonet machines, and intelligent traffic monitoring system software; and access control and patrol systems consisting of network access control one machines, built-in Web server network access controllers, built-in Web server independent access control systems, remote input/output boards, card reader adapters, induction card readers, LCD screen readers, fingerprint readers, and multi-user access control software; and multi-service network switching platform. The company was formerly known as Kuantuo Technology (Shenzhen) Ltd. and changed its name to Shenzhen Infinova Limited in December 2007. Shenzhen Infinova Limited was founded in 2000 and is headquartered in Shenzhen, China. Shenzhen Infinova Limited is a subsidiary of Infinova Corporation.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518110",
        "website": "http://www.infinova.com.cn",
        "full_time_employees": 1543
    },
    "002960.SZ": {
        "short_name": "JADE BIRD FIRE CO",
        "long_name": "Jade Bird Fire Co., Ltd.",
        "summary": "Jade Bird Fire Co., Ltd. develops, manufactures, and sells professional fire-safe electronic products and fire safety systems in China and internationally. The company offers household fire alarm systems, automatic fire alarm and linkage control systems, gas fire extinguishing systems, electrical fire monitoring systems, fire door monitoring systems, fire equipment power monitoring systems, wireless wide area intelligent fire protection systems, fire cloud data centres, flammable gas alarm systems, gas fire extinguishing systems, fire emergency lighting and evacuation indication systems, bus type toxic and harmful gas detection and alarm systems, and fire alarm systems. Its products are used in Zhongnanhai, Beijing Olympic Games, Shanghai World Expo, and Guangzhou Asian Games. The company was formerly known as Beida Jade Bird Universal Fire Alarm Device Co., Ltd and changed its name to Jade Bird Fire Co., Ltd. in November 2019. Jade Bird Fire Co., Ltd. was founded in 2001 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.jbufa.com",
        "full_time_employees": 2434
    },
    "003004.SZ": {
        "short_name": "BEIJING TELESOUND",
        "long_name": "Beijing Telesound Electronics Co., Ltd.",
        "summary": "Beijing Telesound Electronics Co., Ltd. provides security and protection systems in China. The company offers city, and subway security and protection image information management systems; remote monitoring solutions for city dangerous fountain, bank coffers, schools, substations, machine rooms oil fields, road monitoring, local office building, etc.; system solutions for bank ATM network operation and maintenance; bank network monitoring and alarming management solutions; security and protection, and information management solutions for national storage; and cultural heritage image information management solutions for state administration of cultural heritage. Its products are used in the fields of government, finance, police, army, judicature, post, traffic, hospital, school, etc. The company was founded in 1994 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100085",
        "website": "http://www.telesound.com.cn",
        "full_time_employees": 596
    },
    "300116.SZ": {
        "short_name": "BAOLI NEW ENERGY T",
        "long_name": "Blivex Energy Technology Co., Ltd",
        "summary": "Baoli New Energy Technology Co., Ltd engages in the development and sale of lithium battery products in China. The company was formerly known as Shaanxi J&R Optimum Energy Co., Ltd and changed its name to Baoli New Energy Technology Co., Ltd. in September 2020. Baoli New Energy Technology Co., Ltd. was founded in 1999 and is based in Xi'an, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": null,
        "website": null,
        "full_time_employees": 809
    },
    "300155.SZ": {
        "short_name": "GUANGDONG ANJUBAO",
        "long_name": "Guangdong Anjubao Digital Technology Co., Ltd.",
        "summary": "Guangdong Anjubao Digital Technology Co., Ltd. engages in the research and development, production, sale, and service of community security and protection at home solutions in China. The company offers DF2013 SYSTEM, an IP based building intercom system designed for residential apartment and high rise complex; and analogue building intercom, smart home, car park management, and security and protection systems, as well as cables. It also provides smart community, floating population management, and home and shop security solutions. Guangdong Anjubao Digital Technology Co., Ltd. is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.anjubao.com",
        "full_time_employees": null
    },
    "300188.SZ": {
        "short_name": "XIAMEN MEIYA PICO",
        "long_name": "Xiamen Meiya Pico Information Co.,LTD.",
        "summary": "Xiamen Meiya Pico Information Co.,LTD. provides digital forensics and information security products and services in China and internationally. The company offers computer forensic products, including Recovery Master, a professional digital forensic equipment, which supports the recovery of various data formats; Forensic MagiCube, a portable computer forensics equipment that is used in the laboratory or field investigation; Forensic Tower, a forensic workstation; and Forensics Master, a forensic analysis software. Its computer forensic products also comprise OCTOPUS, a multi-protocol acquisition device for online/offline data acquisition; Aurora, an integrated password recovery solution; Data Wiping Workstation, a data destroying device for various storage media; Write-blocker Kit that secures digital investigation on various storage media; and HDD Duplication System, a multi-tasks clone device for disk-to-disk and disk-to-image duplication. In addition, the company provides mobile forensics systems for data acquisition, data recovery, data analysis, and report making on cell phones; Forensics Commander, a smart investigation table for pre-examining, storage fixing, analyzing, system emulation, and real-time reporting; Forensic Grampus, a forensic automobile for instant forensic response; and Digital Forensic Lab, a solution that provides support on the digital forensic investigation. Further, it offers anti-drone gear for drone flights; and iNF-9560 vehicle-based LTE locator systems, as well as provides computer forensics, mobile forensics, data recovery, information security, and online training courses. It serves forensic, law enforcement, and government customers. The company was founded in 1999 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": null,
        "website": "http://meiyapico.com",
        "full_time_employees": 3745
    },
    "300270.SZ": {
        "short_name": "JOYWARE ELECTRONIC",
        "long_name": "Joyware Electronics Co.,Ltd",
        "summary": "Joyware Electronics Co.,Ltd provides video surveillance solutions worldwide. Its products include dome, bullet, fisheye, PTZ, starlight, and licensed cameras; industrial Ethernet switches, optical transceivers, and wireless products; and storage products, such as NVR and DVR products. The company offers high definition digital video network monitoring solutions for highway, safe city, intelligent transportation, financial supervision, and control rail transportation, as well as provides OEM and ODM services to various security product companies. Joyware Electronics Co.,Ltd was founded in 2000 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.joyware.com",
        "full_time_employees": null
    },
    "300333.SZ": {
        "short_name": "SINOSUN TECHNOLOGY",
        "long_name": "SinoSun Technology Co. Ltd.",
        "summary": "SinoSun Technology Co. Ltd. provides paper based technology security product. It offers Paper grain, an impregnable security technology that has applications in the field of security instruments, commodities, and others; and Paper texture products to protect bank notes and re-control voucher from forgery, alteration, and cloning. The company is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518040",
        "website": "http://www.sinosun.com.cn",
        "full_time_employees": 357
    },
    "300367.SZ": {
        "short_name": "NETPOSA TECHNOLOGI",
        "long_name": "NetPosa Technologies, Ltd.",
        "summary": "NetPosa Technologies, Ltd. engages in the research and development of video management system platforms in China and internationally. It offers video networking systems, such as power video networking platforms, power social video resource pooling platforms, social resource access systems, mobile video surveillance platforms, comprehensive maintenance management platforms, servers, storage-type network hard disk recorders, network video coders and decoders, and matrix network control keyboards; and video cloud storage and video structured server products. The company also provides video image analysis systems, smart community security and protection systems, hyper-convergence live-action command systems, vehicle big data platforms, police big-data platforms, Internet human intelligence management platforms, and physical security information management platforms; video investigation applications; and dynamic face recognition systems. Its products are used in the urban public security, intelligent transportation and city, rail transit, intelligent building, and home security sectors. The company was founded in 2000 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.netposa.com",
        "full_time_employees": null
    },
    "300448.SZ": {
        "short_name": "HAOYUN TECHNOLOGIE",
        "long_name": "Haoyun Technologies Co.,Ltd.",
        "summary": "Haoyun Technologies Co.,Ltd. provides security solutions in China. The company offers cameras, precise positioning, storage, transmission, display and control, voice intercom, access control, anti-theft alarm products, and physical protection products. Its products are used in various applications, such as financial, public security, judicial, smart property management, and Internet of things. The company was formerly known as Guangzhou Haoyun Security Technologies Co., Ltd. and changed its name to Haoyun Technologies Co.,Ltd. in July 2016. Haoyun Technologies Co.,Ltd.was founded in 2001 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "511400",
        "website": "http://www.haoyuntech.com",
        "full_time_employees": 1163
    },
    "300449.SZ": {
        "short_name": "BEIJING HANBANG TE",
        "long_name": "Beijing Hanbang Technology Corp.",
        "summary": "Beijing Hanbang Technology Corp. provides solutions for the radio and television monitoring, intelligent security, and intellectual property protection industries in China. The company offers DVR and NVR products, HD-SDI cameras, IP cameras, infrared imaging cameras, and compression cards, as well as Internet application solutions. It also exports its products to the United States, Brazil, the United Kingdom, Poland, Romania, Turkey, South Africa, Russia, India, and internationally. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.hbgk.net",
        "full_time_employees": 272
    },
    "300613.SZ": {
        "short_name": "SHANGHAI FULLHAN M",
        "long_name": "Shanghai Fullhan Microelectronics Co., Ltd.",
        "summary": "Shanghai Fullhan Microelectronics Co., Ltd. manufactures and sells chips and solutions for video surveillance products in China. The company offers H.264 codec SoC, image signal processor IC products, and analog and IP cameras, as well as IoT and vehicle application products. The company was founded in 2004 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200233",
        "website": "http://www.fullhan.com",
        "full_time_employees": null
    },
    "300656.SZ": {
        "short_name": "SHENZHEN MINDE ELE",
        "long_name": "Shenzhen MinDe Electronics Technology Ltd.",
        "summary": "Shenzhen MinDe Electronics Technology Ltd. designs, develops, manufactures, and sells barcode scan instruments in China and internationally. The company's products include handheld barcode scanners, cordless barcode scanners, scan engines, image platforms, lightweight data terminals, etc., as well as software tools. It also provides OEM barcode scanner engine integration solutions for AIDC equipment manufacturer, such as mobile computer manufacturers, kiosk and factory process control equipment manufacturers, etc.; support services for various customization activities, including decoding software, barcode encryption, resizing and reshaping, etc.; and OEM production and design services. The company's products are used in manufacturing, retailing, postage, logistic, and medical service application domains. Shenzhen MinDe Electronics Technology Ltd. was founded in 2004 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.mindeo.cn",
        "full_time_employees": null
    },
    "300771.SZ": {
        "short_name": "SHENZHEN ZHILAI SC",
        "long_name": "Shenzhen Zhilai Sci and Tech Co., Ltd.",
        "summary": "Shenzhen Zhilai Sci and Tech Co., Ltd. researches and develops, manufactures, sells, and services lockers in China and internationally. The company offers delivery, refrigerator, barcode, RFID, APP, and charging lockers. It also provides after-sale services. The company was founded in 1999 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518052",
        "website": "http://www.szzhilai.com",
        "full_time_employees": 2318
    },
    "300902.SZ": {
        "short_name": "GUOANDA CO LTD",
        "long_name": "Guoanda Co., Ltd.",
        "summary": "Guoanda Co., Ltd. engages in the research, development, production, and sale of fire extinguishing equipment. It serves customers in various sectors, including transportation, power grid, wind power generation, underground pipe network, financial, and mobile communications. The company was founded in 2008 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361023",
        "website": "http://www.ssa119.com",
        "full_time_employees": 358
    },
    "CSKD": {
        "short_name": "CHINA SKYRISE DIGITAL SERVICE I",
        "long_name": "China Skyrise Digital Service, Inc.",
        "summary": "China Skyrise Digital Service, Inc., together with its subsidiaries, engages in the development and sale of digital residential intercom and safety products in the People's Republic of China. The company's products include standalone digital video recorders (DVRs), embedded DVRs, mobile DVRs, digital cameras, intelligent control system software platforms, perimeter security alarm systems monitors, and auxiliary apparatuses. It also offers monitor products, such as LCD multiple screen combination panel walls, LCD advertising players, built-in quadruple LCD/CRT monitors, IP monitors, and progressive scanning color digital monitors in standard, high-end, luxury, and wireless models. In addition, the company involves in developing a system-on-chip product, as well as community e-business value-added services. Its customers primarily include urban and suburban residential communities, property management companies, real estate development companies, engineering companies, and system integration companies in China, Hong Kong, Macao, and Taiwan. China Skyrise Digital Service, Inc. was founded in 2003 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518070",
        "website": "http://www.szskyrise.com",
        "full_time_employees": 145
    }
}