{
    "000709.SZ": {
        "short_name": "HESTEEL CO LTD",
        "long_name": "Hbis Company Limited",
        "summary": "Hbis Company Limited produces and sells steel products in China. The company's products include hot and cold rolled coils, pickling rolls, galvanized coated coils, medium and wide plates, bars, wires, steel profiles, and steel strips. Its products are used in automobiles, home appliances, pipelines, bridges, machinery manufacturing, warehousing, and other fields. Hbis Company Limited is based in Shijiazhuang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": "050023",
        "website": "http://www.hebgtgf.com",
        "market_cap": "Mid Cap"
    },
    "000717.SZ": {
        "short_name": "SGIS SONGSHAN",
        "long_name": "SGIS Songshan Co., Ltd.",
        "summary": "SGIS Songshan Co., Ltd. engages in the iron and steel business in China. The company offers iron and steel products, metal products, coke, and coal chemical products, as well as technical development, transfer, introduction, and consulting services. It also sells mineral products and coal. The company was founded in 1997 and is based in Shaoguan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shaoguan",
        "zipcode": "512123",
        "website": "http://www.sgss.com.cn",
        "market_cap": "Small Cap"
    },
    "000761.SZ": {
        "short_name": "BENGANG STL PLATE",
        "long_name": "Bengang Steel Plates Co., Ltd.",
        "summary": "Bengang Steel Plates Co., Ltd. engages in steel smelting, rolling, producing, trading, and selling ferrous metal products in the People's Republic of China. The company offers hot-rolled plates, cold-rolled sheets, special steel profiles, pig iron, and crude steel; and automotive surface panels, oil pipeline steel, container board shipboard, and other products for use in automobiles, home appliances, petrochemicals, aerospace, machinery manufacturing, energy transportation, construction and decoration, and metal products. It also involved in the electricity generation, coal chemical, railway, and import and export trade businesses. Bengang Steel Plates Co., Ltd. also exports its products to approximately 60 countries and regions. The company was incorporated in 1997 and is based in Benxi, the People's Republic of China. Bengang Steel Plates Co., Ltd. is a subsidiary of Benxi Steel & Iron (Group) Co. Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Benxi",
        "zipcode": "117000",
        "website": "http://www.bsteel.com.cn",
        "market_cap": "Mid Cap"
    },
    "000778.SZ": {
        "short_name": "XINXING DUCTILE IR",
        "long_name": "Xinxing Ductile Iron Pipes Co., Ltd.",
        "summary": "Xinxing Ductile Iron Pipes Co., Ltd. engages in the research, manufacture, and trade of ductile iron pipes and tube castings, and steel products in China. It offers ductile iron pipes for water supply, sewage, gas, and heat applications, as well as special interfaces and coatings; ferrous metallurgy products, such as rolled ribbed steel bars for reinforced concrete; steel grating; composite tubes; and special and stainless steel pipes. It sells its products through a sales network in Asia, Europe, Africa, and America, as well as exports internationally. Xinxing Ductile Iron Pipes Co., Ltd. as founded in 1971 and is based in Wu'an, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wu'an",
        "zipcode": "056300",
        "website": "http://www.xinxing-pipes.com",
        "market_cap": "Mid Cap"
    },
    "000825.SZ": {
        "short_name": "SHANXI TAIGANG ST",
        "long_name": "Shanxi Taigang Stainless Steel Co., Ltd.",
        "summary": "Shanxi Taigang Stainless Steel Co., Ltd. engages in the production and sales of iron and steel in China and internationally. The company's products include cold silicon steel, carbon steel hot rolled coil/plate, train axle steel, alloy mould steel, military steel, etc. It also offers stainless steel, slab, black ingot, black metal, ferroalloy, metalware, and other steel products. In addition, the company is involved in the export and import of raw material for iron and steel production. Its products are used in petroleum, chemical, shipbuilding, container, railway, automobile, urban light rail, power generation, spacecraft, and other sectors and industries. The company was founded in 1998 and is based in Taiyuan, China. Shanxi Taigang Stainless Steel Co., Ltd. is a subsidiary of Taiyuan Iron & Steel (Group) Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": null,
        "website": "http://tgbx.tisco.com.cn",
        "market_cap": "Mid Cap"
    },
    "000898.SZ": {
        "short_name": "ANGANG STEEL CO LT",
        "long_name": "Angang Steel Company Limited",
        "summary": "Angang Steel Company Limited engages in the production, processing, and sale of steel products in the People's Republic of China. Its principal products include hot rolled sheets, medium and thick plates, cold rolled sheets, galvanized steel sheets, color coating plates, cold rolled silicon steel, heavy rails and sections, seamless steel pipes and wire rods, and other products. The company also engages in ferrous metal smelting and steel pressing and processing activities. In addition, it sells metal materials and products, and building materials, etc.; provides wholesale and retail purchasing services; develops metallurgy and related materials and equipment; and purchases and sells metal and other materials, as well as imports, exports, wholesales, and retails technology products. Further, the company engages in the purification of cooking gas; production of coal products and dissolved acetylene; and sale of compressed and liquefied gas. The company's products are used in various industries, such as machinery, metallurgy, petroleum, chemical industry, coal, electricity, railway, shipbuilding, automobile, construction, home appliances, and aviation industries. It also exports its products. The company was formerly known as Angang New Steel Company Limited and changed its name to Angang Steel Company Limited in June 2006. Angang Steel Company Limited was founded in 1997 and is headquartered in Anshan, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Anshan",
        "zipcode": "114021",
        "website": "http://www.ansteel.com.cn",
        "market_cap": "Mid Cap"
    },
    "000926.SZ": {
        "short_name": "HBFX S&TECHNOLOGY",
        "long_name": "Hubei Fuxing Science and Technology Co.,Ltd",
        "summary": "Hubei Fuxing Science and Technology Co.,Ltd. produces steel products in China. The company offers radial tire steel cords, tires steel products, PC steel hinges, steel wire ropes, prestressed PC steel strands, tire wires, and other products. The company also exports its products. Hubei Fuxing Science and Technology Co.,Ltd. is based in Hanchuan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hanchuan",
        "zipcode": "431608",
        "website": "http://www.chinafxkj.com",
        "market_cap": "Small Cap"
    },
    "000932.SZ": {
        "short_name": "HUNAN VALIN STEEL",
        "long_name": "Hunan Valin Steel Co., Ltd.",
        "summary": "Hunan Valin Steel Co., Ltd. manufactures and sells ferrous metal products in China. It offers steel billets, seamless steel pipes, wire rods, rebars, hot-rolled ultra-thin strip coils, cold-rolled coils, galvanized sheets, small and medium-sized materials, and hot-rolled medium plates. Hunan Valin Steel Co., Ltd. is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": "410004",
        "website": "http://www.valin.cn",
        "market_cap": "Mid Cap"
    },
    "000959.SZ": {
        "short_name": "BEIJING SHOUGANG",
        "long_name": "Beijing Shougang Co., Ltd.",
        "summary": "Beijing Shougang Co., Ltd. manufactures and sells iron and steel products in Mainland China. The company offers hot rolling steel products, including hot-rolled car pickling plates, special steel products, saw blade steel, containers, pipeline steel, and hot rolled steel for automobiles and construction machinery. It also provides cold rolling steel products comprising oriented and non-oriented silicon steel, car boards, tinplates, home appliance boards, and color coated boards. In addition, the company is involved in the construction of freight port, catering, conference, and hotel operation, as well as provides technical consultation and services. Its products are used in automobiles, compressor, machinery manufacturing, hardware accessories, packing, household electrical appliances, industrial and electric motor, energy cars, transformer, and other industries. The company was founded in 1999 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100041",
        "website": "http://www.sggf.com.cn",
        "market_cap": "Mid Cap"
    },
    "002075.SZ": {
        "short_name": "JIANGSU SHAGANG GR",
        "long_name": "Jiangsu Shagang Co., Ltd.",
        "summary": "Jiangsu Shagang Co. Ltd. manufactures steel products. It offers spring steel, bearing steel, marine anchor chain steel, alloy tube blank, and automobile steel; and anchor chain round bar for vessel, alloy structure steel, seamless tube billet for high pressure, continuous casting billets, corrosion resistant standard unit steel, steel for cold heading and cold intrusion, steel for fastening unit, carbon structure steel, hot rolled deformed bar, low alloy high strength structure steel flat bar, silicon sheet for electric motor, steel for fastening unit, petroleum well tubular steel, hardenability guaranteed steel, alloyed structural tubular steel, and carbon tubular steel. Its products are used in automobile manufacturing, railways, locomotives, ship building, and machinery manufacturing applications. It offers its products in Japan, Southeast Asia, Europe, America, and internationally. Jiangsu Shagang Group Huaigang Special Steel Co., Ltd. was formerly known as Jiangsu Huaigang Group Co. Ltd. The company was founded in 1970 and is based in Huaian, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhangjiagang",
        "zipcode": "215625",
        "website": "http://www.shaganggf.com",
        "market_cap": "Mid Cap"
    },
    "002110.SZ": {
        "short_name": "SANSTEEL MINGUANG",
        "long_name": "Sansteel MinGuang Co.,Ltd.,Fujian",
        "summary": "Sansteel MinGuang Co., Ltd., Fujian manufactures and sells steel products in China. The company offers building materials, metal products, medium thick plates, machinery manufacturing materials, rebars, wire rods, and round bars. It also provides construction machinery steel, building steel, and structural steel products, as well as pre-stressed steel bars and rolling rebars. The company was founded in 2001 and is based in Sanming, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Sanming",
        "zipcode": "36500",
        "website": "http://www.sgmg.com.cn",
        "market_cap": "Mid Cap"
    },
    "002132.SZ": {
        "short_name": "HENAN HENGXING SCI",
        "long_name": "Henan Hengxing Science & Technology Co.,Ltd.",
        "summary": "Henan Hengxing Science & Technology Co.,Ltd. manufactures and sells galvanized and stranded steel wires in China and internationally. The company primarily produces steel cords for radial tires, galvanized steel strands, PC steel strands, hose steel wires, diamond wires, and polycrystalline silicon sheets used in automobile tires, rubber hoses, power cables, overhead power lines, high-speed railways, ports, silicon wafer cutting for photovoltaic solar energy, etc. It also offers investment services. The company was founded in 1995 and is based in Gongyi, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Gongyi",
        "zipcode": null,
        "website": "http://www.hengxingchinese.com",
        "market_cap": "Small Cap"
    },
    "002318.SZ": {
        "short_name": "ZHEJIANG JIULI HI-",
        "long_name": "Zhejiang Jiuli Hi-Tech Metals Co., Ltd.",
        "summary": "Zhejiang Jiuli Hi-Tech Metals Co., Ltd. manufactures and sells stainless steel pipes and tubes worldwide. Its products include austenitic stainless steel pipes/tubes, duplex stainless steel, corrosion and high temperature resistant alloys, ferritic stainless steel, precipitation hardening stainless steel, clad/lined pipes, titanium alloys, and pipe fittings. The company's products are used in civil nuclear power, thermal/hydro electric generation, oil and gas, refinery, chemical, offshore engineering and shipbuilding, seawater desalination and water treatment, natural gas, and instrumentation tubing industries, as well as aerospace, auto, fertilizer, chemical fiber, pulp and paper, food, etc. industries. Zhejiang Jiuli Hi-Tech Metals Co., Ltd. was founded in 1987 and is headquartered in Huzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huzhou",
        "zipcode": "313028",
        "website": "http://www.jiuli.com",
        "market_cap": "Small Cap"
    },
    "002418.SZ": {
        "short_name": "ZHE JIANG KANGSHEN",
        "long_name": "Zhe Jiang Kangsheng Co.,Ltd.",
        "summary": "Zhe Jiang Kangsheng Co.,Ltd. manufactures and sells refrigeration piping systems and new energy vehicle parts in China. The company offers steel tubes, aluminum tubes, copper tubes, micro channel heat exchangers, condensers, and evaporators; pure electric tourist buses, pure electric buses, pure electric logistics vehicles, pure electric touring cars, and pure electric airport shuttle buses; and financing lease, small loans, and other financial services. It also provides aluminum sheets, air conditioning parts, and microchannel heat exchangers. Zhe Jiang Kangsheng Co.,Ltd. was founded in 1996 and is based in Chun'an, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chun'an",
        "zipcode": "311700",
        "website": "http://www.kasun.cn",
        "market_cap": "Small Cap"
    },
    "002443.SZ": {
        "short_name": "ZHEJIANG KINGLAND",
        "long_name": "Zhejiang Kingland Pipeline and Technologies Co.,Ltd.",
        "summary": "Zhejiang Kingland Pipeline and Technologies Co.,Ltd. manufactures and sells oil and gas pipelines, and civilian pipelines in China. The company's principal products include hot-dip galvanized/black pipes, lined or PE coated GAL pipes, coated pipes, epoxy primer pre-coated hot-dip galvanized pipes, helical submerged-arc welded pipes, high frequency welded pipes, FBE/2PE/3PE coated pipes, PP-R/PE pipes, and fittings, as well as SAWL and HFW pipes. It provides products for use in oil and natural gas transportation pipeline projects, mine slurry and mine powder transportation line pipes, undersea line pipes, heating power pipeline projects, urban water supply and drainage projects, oil well casing pipes, extra high voltage power steel pipe towers, refining pipeline projects, and underground of urban gas steel pipelines. The company also offers 3PP/3PE/FBE coated pipes, internal coated pipes, ERW, PE gas pipes, PE water pipes, PP-R water pipes, and fittings for use in the municipal and architectural water supply and drainage, city gas transportation, rural water irrigation, electric power field, communication field, chemistry industry, medicine field, etc. In addition, it provides submerged arc welded longitudinal pipes for use in media transportation, including land/marine oil, gas, chemical, coal slurry, ore pulp, water, etc., as well as in offshore platform, power plant, chemical industry, building, bridge, structures, and others. The company also exports its products to approximately 30 countries. Zhejiang Kingland Pipeline and Technologies Co.,Ltd. was founded in 1993 and is based in Huzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huzhou",
        "zipcode": "313000",
        "website": "http://www.chinakingland.com",
        "market_cap": "Small Cap"
    },
    "002478.SZ": {
        "short_name": "JIANGSU CHANGBAO S",
        "long_name": "Jiangsu Changbao Steeltube Co.,Ltd",
        "summary": "Jiangsu Changbao Steeltube Co.,Ltd produces and sells various steel pipes and tubes primarily in the People's Republic of China. The company offers OCTG products for petroleum industry, including connection tubings and casings, coupling stocks, perforating gun carrier pipes, petroleum tool pipes, drill pipes, and slotted pipes; boiler tubes for power generation; steel tubes for auto industry comprising automobile precision tubes, piping for hydraulic cylinders, and axel tubes; petrochemical tubes, steel tubes for low temperature resistance, and high pressure fertilizer tubes; and steel tubes for engineering machinery industry, such as mechanical steel pipes, boom pipes, and piping for hydraulic cylinders. It also provides line pipes, geological drilling pipes, core barrels, rope corning drill pipe materials, gas cylinder pipes, and accumulator tubes, as well as steel pipes for marine engineering, structural purpose, and fluid transmission. The company exports its products to Europe, the Americas, the Middle East, CIS, Southeast Asia, Australia, Africa, and internationally. Jiangsu Changbao Steeltube Co.,Ltd was founded in 1958 and is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": null,
        "website": "http://www.cbsteeltube.com",
        "market_cap": "Small Cap"
    },
    "002652.SZ": {
        "short_name": "SUZHOU YANGTZE NEW",
        "long_name": "Suzhou Yangtze New Materials Co., Ltd.",
        "summary": "Suzhou Yangtze New Materials Co., Ltd. researches, develops, produces, and sells functional organic coated boards and substrates in China. The company offers organic coated boards for use in IT industry, food processing industry, hospitals, photovoltaic manufacturing, and other high-clean workshops and car partitions. Its products are also used to produce exterior parts of white household appliances, such as refrigerators, washing machines, and microwave ovens. In addition, the company's products are used in the electronic industrial workshops, radio/sonar laboratories, and special medical examination rooms. The company is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": null,
        "website": "http://www.yzjnm.com",
        "market_cap": "Small Cap"
    },
    "002659.SZ": {
        "short_name": "BEIJING KAIWEN EDU",
        "long_name": "Beijing Kaiwen Education Technology Co., Ltd.",
        "summary": "Jiangsu Zhongtai Bridge Steel Structure Co., Ltd. engages in the steel structure fabrication business in China. It fabricates large-scale bridge steel structures, ship blocks, and crane steelworks, as well as heavy steel sections for power plants, etc. The company is based in Jiangyin, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiangyin",
        "zipcode": "214521",
        "website": "http://www.ztsschina.com/index.asp?iLT=1",
        "market_cap": "Small Cap"
    },
    "002743.SZ": {
        "short_name": "ANHUI FUHUANG STEE",
        "long_name": "Anhui Fuhuang Steel Structure Co., Ltd.",
        "summary": "Anhui Fuhuang Steel Structure Co., Ltd. engages in the design, production, installation, and general contracting of steel structures, and doors and windows. The company is headquartered in Chaohu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chaohu",
        "zipcode": "238076",
        "website": "http://www.fuhuang.cn",
        "market_cap": "Small Cap"
    },
    "002756.SZ": {
        "short_name": "YONGXING SPECIAL M",
        "long_name": "Yongxing Special Materials Technology Co., Ltd.",
        "summary": "Yongxing Special Materials Technology Co., Ltd. develops, produces, and sells nickel alloys and stainless steel products in China and internationally. The company offers austenitic and duplex stainless steel round bars; stainless steel wire rods; and special alloys, including iron ultratek, ultratek, precision, and stainless steel alloys. Its products are primarily used in petrochemical, high-pressure boiler, nuclear power energy, equipment manufacturing, aerospace, and other industrial fields. The company was formerly known as Yongxing Special Stainless Steel Co., Ltd. and changed its name to Yongxing Special Materials Technology Co., Ltd. in August 2019. Yongxing Special Materials Technology Co., Ltd. was founded in 2000 and is based in Huzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huzhou",
        "zipcode": "313005",
        "website": "http://www.yongxingbxg.com",
        "market_cap": "Mid Cap"
    },
    "0323.HK": {
        "short_name": "MAANSHAN IRON",
        "long_name": "Maanshan Iron & Steel Company Limited",
        "summary": "Maanshan Iron & Steel Company Limited, together with its subsidiaries, manufactures and sells iron and steel products, and related by-products in the People's Republic of China and internationally. It offers hot and cold rolled, galvanized, and color coated strips; ship plates, container use strips, electric steel, pipe steel, etc.; H-beam, angle, and channel sections; cold-heading wire rods; and train wheels for wagon cars. The company also provides railway wheel and tire, bearing, spring, gear, tool and die, ring, high grade cold heading, non-quenched and tempered, anchor chain, roller, and alloy structural steel, as well as alloy tube billet, steel for heavy castings and forgings, and other series. In addition, it is involved in the production and sale of coke, coke chemical, energy, and metallic products, as well as screw threaded, round, section, angle, and deformed steel products; sale of iron ore and iron ore fines, and scrap steel products; and metallurgy and extended processing of ferrous metals and sale of resulting products, as well as extended processing of iron and steel products. Further, the company researches and develops automobile, home electrical appliances, engineering, and machinery materials; produces and sells steel and stamping spare parts; provides materials storage, and technical consulting services; offers products and equipment used in rail transport, urban transport, and machinery construction; and trades in pig iron. Additionally, it engages in the investment and trading businesses. The company was founded in 1953 and is headquartered in Maanshan, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Maanshan",
        "zipcode": "243003",
        "website": "http://www.magang.com.cn",
        "market_cap": "Mid Cap"
    },
    "0347.HK": {
        "short_name": "ANGANG STEEL",
        "long_name": "Angang Steel Company Limited",
        "summary": "Angang Steel Company Limited engages in the production, processing, and sale of steel products in the People's Republic of China. Its principal products include hot rolled sheets, medium and thick plates, cold rolled sheets, galvanized steel sheets, color coating plates, cold rolled silicon steel, heavy rails and sections, seamless steel pipes and wire rods, and other products. The company also engages in ferrous metal smelting and steel pressing and processing activities. In addition, it sells metal materials and products, and building materials, etc.; provides wholesale and retail purchasing services; develops metallurgy and related materials and equipment; and purchases and sells metal and other materials, as well as imports, exports, wholesales, and retails technology products. Further, the company engages in the purification of cooking gas; production of coal products and dissolved acetylene; and sale of compressed and liquefied gas. The company's products are used in various industries, such as machinery, metallurgy, petroleum, chemical industry, coal, electricity, railway, shipbuilding, automobile, construction, home appliances, and aviation industries. It also exports its products. The company was formerly known as Angang New Steel Company Limited and changed its name to Angang Steel Company Limited in June 2006. Angang Steel Company Limited was founded in 1997 and is headquartered in Anshan, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Anshan",
        "zipcode": "114021",
        "website": "http://www.ansteel.com.cn",
        "market_cap": "Mid Cap"
    },
    "0826.HK": {
        "short_name": "TIANGONG INT'L",
        "long_name": "Tiangong International Company Limited",
        "summary": "Tiangong International Company Limited produces and sells die steel (DS), high speed steel (HSS), cutting tools, and titanium alloys. The company operates in five segments: DS, HSS, Cutting Tools, Titanium Alloy, and Trading of Goods. It also trades in carbon steel products, and alloy steel and cutting tools; researches and develops alloy and steel related products; and provides investment management and advisory related services. The company is also involved in the precision forging of high speed steel. It operates in the People's Republic of China, North America, Europe, other Asian countries, and internationally. The company was founded in 1981 and is headquartered in Danyang, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Danyang",
        "zipcode": "212312",
        "website": "http://www.tggj.cn",
        "market_cap": "Small Cap"
    },
    "0BG2.F": {
        "short_name": "OSSEN INNOV.SP.ADR DL-,01",
        "long_name": "Ossen Innovation Co., Ltd.",
        "summary": "Ossen Innovation Co., Ltd., together with its subsidiaries, manufactures and sells various plain surface prestressed steel materials, and rare earth coated and zinc coated prestressed steel materials in the People's Republic of China and internationally. The company offers plain surface products, including plain surface prestressed concrete (PC) strands that are used in precast concrete plates on the riding surface of bridges; and unbonded plain surface PC strands for the construction of bridges and buildings. It also provides plain surface PC wires and indented PC wires, which are used in the construction of buildings; helical rib PC wires for the construction of railway ties or sleepers, and buildings; and coated prestressed products comprising zinc coated PC and rare earth coated PC products. The company markets and sells its products under the Ossen brand name. Ossen Innovation Co., Ltd. also exports its products to the United States, Canada, Spain, Japan, South Korea, Taiwan, Australia, South Africa, Saudi Arabia, and internationally. The company was formerly known as Ultra Glory International, Ltd. Ossen Innovation Co., Ltd. was founded in 2010 and is based in Shanghai, the People's Republic of China. Ossen Innovation Co., Ltd. operates as a subsidiary of Pujiang International Group Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200120",
        "website": "http://www.osseninnovation.com",
        "market_cap": "Small Cap"
    },
    "1053.HK": {
        "short_name": "CHONGQING IRON",
        "long_name": "Chongqing Iron & Steel Company Limited",
        "summary": "Chongqing Iron & Steel Company Limited, together with its subsidiaries, processes, produces and sells steel plates, wire rods, bar materials, and billets and thin plates in the People's Republic of China. It is also involved in the production and sale of coal chemical products, pig iron and grain slag, etc. The company's products have applications in various industries, such as machinery, architecture, engineering, automobile, motorbike, shipbuilding, offshore oil, gas cylinder, boiler, and oil and gas pipelines. Chongqing Iron & Steel Company Limited was incorporated in 1997 and is based in Chongqing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "401258",
        "website": "http://www.cqgt.cn",
        "market_cap": "Mid Cap"
    },
    "1266.HK": {
        "short_name": "XIWANG STEEL",
        "long_name": "Xiwang Special Steel Company Limited",
        "summary": "Xiwang Special Steel Company Limited, together with its subsidiaries, manufactures and sells electric arc furnace-based special steel products in China. The company operates through four segments: Ordinary Steel, Special Steel, Trading of Commodities, and By-Products. It produces ordinary steel products, such as rebars primarily for use in building construction and infrastructure projects; and ribbed and plain wire rods for use in making of coil, spring, electronic, and precise machinery parts. The company offers carbon structural steel products, including steel billets, bars, and wires primarily for buildings and infrastructures; alloy structural steel products for machineries; bearing steel wires and bars for manufacturing rollers or ball bearings for the automobile industry; and steel ingots. It trades in commodities, including iron ore dust, pellets, steel billets, and coke; and sells by-products, such as steel slag, steel scrap, steam, and electricity. The company was founded in 2003 and is headquartered in Binzhou, China. Xiwang Special Steel Company Limited is a subsidiary of Xiwang Investment Limited Company.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Binzhou",
        "zipcode": null,
        "website": "http://www.xiwangsteel.com",
        "market_cap": "Small Cap"
    },
    "1553.HK": {
        "short_name": "MAIKE TUBE",
        "long_name": "Maike Tube Industry Holdings Limited",
        "summary": "Maike Tube Industry Holdings Limited, through its subsidiaries, manufactures and sells standard prefabricated pipe nipples and steel pipe products in the People's Republic of China and internationally. The company's products include standard prefabricated steel, stainless, and brass pipe nipples, as well as coupling/sockets, welded outlets, and others; electric resistance welding and spiral submerged arc welded steel pipes; assembled piping systems; conduits; and customized steel pipes. It also engages in the design and supply of assembled piping systems. In addition, the company sells steel coils. It serves gas, as well as heating, ventilation, and air conditioning companies; and water supply companies, infrastructure and construction companies, wholesalers, and distributors. The company was founded in 2013 and is headquartered in Jinan, People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": "250400",
        "website": "http://www.mechpipingtech.com",
        "market_cap": "Small Cap"
    },
    "200761.SZ": {
        "short_name": "BENGANG STL PLATE",
        "long_name": "Bengang Steel Plates Co., Ltd.",
        "summary": "Bengang Steel Plates Co., Ltd. engages in steel smelting, rolling, producing, trading, and selling ferrous metal products in the People's Republic of China. The company offers hot-rolled plates, cold-rolled sheets, special steel profiles, pig iron, and crude steel; and automotive surface panels, oil pipeline steel, container board shipboard, and other products for use in automobiles, home appliances, petrochemicals, aerospace, machinery manufacturing, energy transportation, construction and decoration, and metal products. It also involved in the electricity generation, coal chemical, railway, and import and export trade businesses. Bengang Steel Plates Co., Ltd. also exports its products to approximately 60 countries and regions. The company was incorporated in 1997 and is based in Benxi, the People's Republic of China. Bengang Steel Plates Co., Ltd. is a subsidiary of Benxi Steel & Iron (Group) Co. Ltd.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Benxi",
        "zipcode": "117000",
        "website": "http://www.bsteel.com.cn",
        "market_cap": "Mid Cap"
    },
    "2738.HK": {
        "short_name": "HUAJIN INTL",
        "long_name": "Huajin International Holdings Limited",
        "summary": "Huajin International Holdings Limited, an investment holding company, processes and sells cold-rolled steel products and galvanized steel products in the People's Republic of China and Southeast Asia. It offers cold-rolled carbon steel strips, sheets, welded steel tubes, and zinc coated steel products. It serves light industrial hardware, home appliances, furniture, motorcycle/bicycle accessories, LED, and lighting industries. The company was founded in 2005 and is headquartered in Jiangmen, the People's Republic of China. Huajin International Holdings Limited is a subsidiary of Haiyi Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Jiangmen",
        "zipcode": null,
        "website": "http://www.huajin-hk.com",
        "market_cap": "Small Cap"
    },
    "2XI.F": {
        "short_name": "XIWANG SPEC.STEEL",
        "long_name": "Xiwang Special Steel Company Limited",
        "summary": "Xiwang Special Steel Company Limited, together with its subsidiaries, manufactures and sells electric arc furnace-based special steel products in China. The company operates through four segments: Ordinary Steel, Special Steel, Trading of Commodities, and By-Products. It produces ordinary steel products, such as rebars primarily for use in building construction and infrastructure projects; and ribbed and plain wire rods for use in making of coil, spring, electronic, and precise machinery parts. The company offers carbon structural steel products, including steel billets, bars, and wires primarily for buildings and infrastructures; alloy structural steel products for machineries; bearing steel wires and bars for manufacturing rollers or ball bearings for the automobile industry; and steel ingots. It trades in commodities, including iron ore dust, pellets, steel billets, and coke; and sells by-products, such as steel slag, steel scrap, steam, and electricity. The company was founded in 2003 and is headquartered in Binzhou, China. Xiwang Special Steel Company Limited is a subsidiary of Xiwang Investment Limited Company.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Binzhou",
        "zipcode": null,
        "website": "http://www.xiwangsteel.com",
        "market_cap": "Small Cap"
    },
    "300234.SZ": {
        "short_name": "ZHEJIANG KAIER NEW",
        "long_name": "Zhejiang Kaier New Materials Co.,Ltd.",
        "summary": "Zhejiang Kaier New Materials Co.,Ltd. engages in the research, development, manufacture, and sale of vitreous enamel panels in China and internationally. The company offers wall cladding systems for metro stations, tunnels, external facade walls, underground walkways, and gas heaters. Zhejiang Kaier New Materials Co.,Ltd. was founded in 2003 and is based in Jinhua, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinhua",
        "zipcode": "321036",
        "website": "http://www.vepanels.com",
        "market_cap": "Small Cap"
    },
    "300421.SZ": {
        "short_name": "JIANGSU LIXING GEN",
        "long_name": "Jiangsu LiXing General Steel Ball Co., Ltd.",
        "summary": "Jiangsu LiXing General Steel Ball Co., Ltd. manufactures and sells mechanical parts and auto components. It produces a series of high precision bearing, noiseless, special automobile, special hub, and windmill steel balls, as well as other products. The company provides its products for use in electronic appliance bearings, roller bars, delicate mechanism bearings, automobile, and windmills. It markets its products approximately in 20 countries in Europe, Asia, and the United States. The company is based in Rugao, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Rugao",
        "zipcode": null,
        "website": "http://www.jgbr.com.cn",
        "market_cap": "Small Cap"
    },
    "300855.SZ": {
        "short_name": "JIANGSU TOLAND ALL",
        "long_name": "Jiangsu ToLand Alloy Co.,Ltd",
        "summary": "Jiangsu ToLand Alloy Co.,Ltd engages in the research and development, production, and sale of alloy materials and products in China. The company offers high-temperature alloys, welding materials, precision alloys, special stainless steels, and resistance electric heating alloys; and raw materials, such as ultra-pure nickel-based super alloys for the manufacturing of high-end equipment for aero engines and gas turbines, as well as bars, wires, strips, pipes, castings, etc. Its products are used in various industries, such as aerospace, ships, energy, as well as national defense, military, and civilian high-end equipment manufacturing. The company was founded in 1991 and is based in Danyang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Danyang",
        "zipcode": "212352",
        "website": "http://www.toland-alloy.com",
        "market_cap": "Small Cap"
    },
    "300881.SZ": {
        "short_name": "SHENGTAK NEW MATER",
        "long_name": "Shengtak New Material Co., Ltd",
        "summary": "Shengtak New Material Co., Ltd engages in the production, research and development, and sale of seamless steel pipes for use in industrial energy equipment in China. The company offers alloy steel, stainless steel, and carbon steel pipes for use in power plant boiler equipment manufacturing industries, petroleum refining and chemical enterprises, power stations, and other industries. It also produces and sells pressure-welded steel gratings and ball joint railings for power station boiler manufacturers. The company was founded in 2001 and is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": "213144",
        "website": "http://www.shengdechina.com",
        "market_cap": "Small Cap"
    },
    "34T1.F": {
        "short_name": "TIANGONG INTL CO.DL-,0025",
        "long_name": "Tiangong International Company Limited",
        "summary": "Tiangong International Company Limited produces and sells die steel (DS), high speed steel (HSS), cutting tools, and titanium alloys. The company operates in five segments: DS, HSS, Cutting Tools, Titanium Alloy, and Trading of Goods. It also trades in carbon steel products, and alloy steel and cutting tools; researches and develops alloy and steel related products; and provides investment management and advisory related services. The company is also involved in the precision forging of high speed steel. It operates in the People's Republic of China, North America, Europe, other Asian countries, and internationally. The company was founded in 1981 and is headquartered in Danyang, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Danyang",
        "zipcode": "212312",
        "website": "http://www.tggj.cn",
        "market_cap": "Small Cap"
    },
    "34T1.MU": {
        "short_name": "TIANGONG INTL CO.DL-,0025",
        "long_name": "Tiangong International Company Limited",
        "summary": "Tiangong International Company Limited produces and sells die steel (DS), high speed steel (HSS), cutting tools, and titanium alloys. The company operates in five segments: DS, HSS, Cutting Tools, Titanium Alloy, and Trading of Goods. It also trades in carbon steel products, and alloy steel and cutting tools; researches and develops alloy and steel related products; and provides investment management and advisory related services. The company is also involved in the precision forging of high speed steel. It operates in the People's Republic of China, North America, Europe, other Asian countries, and internationally. The company was founded in 1981 and is headquartered in Danyang, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Danyang",
        "zipcode": "212312",
        "website": "http://www.tggj.cn",
        "market_cap": "Small Cap"
    },
    "600010.SS": {
        "short_name": "INNER MONGOLIA BAOTOU STEEL UNI",
        "long_name": "Inner Mongolia Baotou Steel Union Co., Ltd.",
        "summary": "Inner Mongolia Baotou Steel Union Co., Ltd. operates in the steel industry in China and internationally. It offers automobile, appliance, high-grade pipeline, and high-strength structural steel products. It also provides wide and heavy plates, silicon steel, hot continuous and supporting cold rolling, continuous rolling, galvanizing, etc., as well as seamless pipes, rails, and wires and bars. The company was founded in 1999 and is based in Baotou, China. Inner Mongolia Baotou Steel Union Co., Ltd. operates as a subsidiary of Baotou Iron and Steel (Group) Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Baotou",
        "zipcode": "014010",
        "website": "http://www.btsteel.com",
        "market_cap": "Large Cap"
    },
    "600019.SS": {
        "short_name": "BAOSHAN IRON & STEEL CO",
        "long_name": "Baoshan Iron & Steel Co., Ltd.",
        "summary": "Baoshan Iron & Steel Co., Ltd. engages in the manufacture and sale of iron and steel products in China and internationally. It operates through Iron and Steel Manufacturing, Processing and Distribution, and Others segments. The company offers hot-rolled steel; pickled HR steel sheet; cold rolled steel sheet, such as oncoated steel steel, galvanzied steel sheet, tin plate and TFS, precoated steel sheet, electrical steel, etc.; prepaimted stainless steel; galvanized steel sheet; electrical steel sheet; heavy plates; pipes and tubes; bar and wire rods; stainless steel; and special steel, which includes bar, wire, plate and sheet, strip, seamless tube, forging, etc. It also engages in the provision of asset management and information technology services, as well as transportation, warehousing, and postal services; steel trading; smelting and rolling black metal; and manufacturing and selling hot-dip galvanized steel sheets and laser tailor-welded plate products. The company was founded in 2000 and is based in Shanghai, China. Baoshan Iron & Steel Co., Ltd. is a subsidiary of China Baowu Steel Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201999",
        "website": "http://bg.baosteel.com",
        "market_cap": "Large Cap"
    },
    "600072.SS": {
        "short_name": "CSSC SCIENCE & TECHNOLOGY CO LT",
        "long_name": "CSSC Science & Technology Co., Ltd.",
        "summary": "CSSC Science & Technology Co., Ltd. manufactures and sells steel structures in China. It also undertakes integrated mechanical engineering projects; and provides marine LPG tanks, pressure vessels, port machines, marine products, and other engineering products, as well as offshore engineering services. The company is based in Shanghai, China. CSSC Science & Technology Co., Ltd. is a subsidiary of China State Shipbuilding Corporation.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200023",
        "website": "http://www.jnhi.com",
        "market_cap": "Small Cap"
    },
    "600117.SS": {
        "short_name": "XINING SPECIAL STEEL",
        "long_name": "XiNing Special Steel Co., Ltd.",
        "summary": "Xining Special Steel Co., Ltd. engages in the steel manufacturing, iron ore, coking coal, and real estate development businesses in China and internationally. The company provides bearing, tool and die, stainless, and spring steel products. It also engages in the manufacturing coking coal products; real estate development activities; and mining of iron and vanadium ores. The company's products are used in various industries, such as automotive, railway, shipbuilding, petrochemical, mining machinery, weapons and equipment, and aerospace industries. Xining Special Steel Co., Ltd. is based in Xining, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xining",
        "zipcode": "810005",
        "website": "http://www.xntg.com",
        "market_cap": "Small Cap"
    },
    "600126.SS": {
        "short_name": "HANGZHOU IRON & STEEL CO LTD",
        "long_name": "Hang Zhou Iron & Steel Co.,Ltd.",
        "summary": "Hangzhou Iron & Steel Co., Ltd. primarily manufactures and sells steel products in China. The company offers carbon structural steel, low-alloy structural steel, cold-rolled or deep-drawn low-carbon steel, pipeline steel, automotive structural steel, container steel, shipbuilding steel, bridge steel, checkered plate and other steels, as well as hot-rolled coils. It also involves in the environmental protection, industrial wastewater treatment, municipal water supply, environmental protection equipment integration, and sludge treatment businesses. The company was founded in 1957 and is based in Hangzhou, China. Hang Zhou Iron & Steel Co.,Ltd. operates as a subsidiary of HANGZHOU IRON & STEEL GROUP CO., LTD.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.hzsteel.com",
        "market_cap": "Mid Cap"
    },
    "600165.SS": {
        "short_name": "NINGXIA XINRI HENGLI STEEL WIRE",
        "long_name": "Ningxia Xinri Hengli Steel Wire Rope Co.,Ltd",
        "summary": "Ningxia Xinri Hengli Steel Wire Rope Co.,Ltd operates in the biochemical industry. It offers activated carbon and lauric acid products. The company was founded in 1958 and is based in Yinchuan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yinchuan",
        "zipcode": null,
        "website": "http://www.en.xinrihengli.com",
        "market_cap": "Small Cap"
    },
    "600231.SS": {
        "short_name": "LINGYUAN IRON & STEEL CO. LTD.",
        "long_name": "Lingyuan Iron & Steel Co., Ltd.",
        "summary": "Lingyuan Iron & Steel Co., Ltd. engages in the steel mining, smelting, and rolling business in China. It offers rebars, broad stripes, steel bars, wire rods, steel strips, and steel pipes, as well as after-sales services. The company also exports its products. Lingyuan Iron & Steel Co., Ltd. was founded in 1996 and is based in Lingyuan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lingyuan",
        "zipcode": "122500",
        "website": "http://www.lggf.com.cn",
        "market_cap": "Small Cap"
    },
    "600307.SS": {
        "short_name": "GANSU JIU STEEL GP HONGXING IRO",
        "long_name": "Gansu Jiu Steel Group Hongxing Iron & Steel Co.,Ltd.",
        "summary": "Gansu Jiu Steel Group Hongxing Iron & Steel Co.,Ltd. produces and sells iron and steel and their rolled products in China, South Korea, Japan, the United States, Hong Kong, and Taiwan. It offers wiring, stainless steel, and continuous steel billet casting products, as well as rods, and medium and roll plates. The company was founded in 1999 and is based in Jiayuguan, China. Gansu Jiu Steel Group Hongxing Iron & Steel Co.,Ltd. is a subsidiary of Jiuquan Iron & Steel (Group) Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiayuguan",
        "zipcode": "735100",
        "website": "http://www.jiugang.com/index.html",
        "market_cap": "Mid Cap"
    },
    "600399.SS": {
        "short_name": "FUSHUN SPECIAL STEEL",
        "long_name": "Fushun Special Steel Co.,LTD.",
        "summary": "Fushun Special Steel Co.,LTD. manufactures and sells steel products in China. The company offers super alloy, tool and die steel, stainless steel, titanium alloy, and alloy structural steel products. Its products are used in the aviation, aerospace, weapons, nuclear power, petroleum and petrochemical, transportation, engineering machinery, and medical industries. The company also exports its products to approximately 30 countries. Fushun Special Steel Co.,LTD. was founded in 1937 and is based in Fushun, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fushun",
        "zipcode": null,
        "website": "http://www.fs-ss.com",
        "market_cap": "Mid Cap"
    },
    "600507.SS": {
        "short_name": "FANGDA SPECIAL STEEL TECHNOLOGY",
        "long_name": "Fangda Special Steel Technology Co., Ltd.",
        "summary": "Fangda Special Steel Technology Co., Ltd. manufactures and distributes steel products in China. The company provides alloy structural round steel used in the automobile and tractor industries; hot-rolled ribbed steel bars used in civil engineering construction; hot-rolled flat steel used in flat steel for the plate chain of material lifting conveyors, as well as used in material conveying equipment in mining, building materials, cement, chemical, and other industries; spring flat steel used to make automobile spring plates or air suspension guide arms; and spring round steel and wire rod products. It also offers high-speed wire, coiled screw, large coil, automobile leaf spring, automobile torsion bar, stabilizer bar, etc. The company sells its products under the Changli and Seagull brands. It also exports its products. The company was formerly known as Nanchang Changli Iron & Steel Co., Ltd. and changed its name to Fangda Special Steel Technology Co., Ltd. in December 2009. Fangda Special Steel Technology Co., Ltd. is based in Nanchang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330012",
        "website": "http://www.fangda-specialsteels.com/web/index.aspx",
        "market_cap": "Mid Cap"
    },
    "600569.SS": {
        "short_name": "ANYANG IRON & STEEL CO",
        "long_name": "Anyang Iron and Steel Co., Ltd.",
        "summary": "AnYang Iron & Steel Inc. produces and sells steel and coking chemical products. Its products include heavy plates, furnace coils, hot rolled coils, and wires and small and medium-sized materials. The company was founded in 1993 and is based in Anyang, China. AnYang Iron & Steel Inc. is a subsidiary of Anyang Iron & Steel Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Anyang",
        "zipcode": "455004",
        "website": "http://www.aysteel.com.cn",
        "market_cap": "Small Cap"
    },
    "600782.SS": {
        "short_name": "XINYU IRON & STEEL CO. LTD.",
        "long_name": "Xinyu Iron & Steel Co., Ltd",
        "summary": "Xinyu Iron & Steel Co., Ltd produces and sells steel products in China. The company offers steel pipes, strips, wires, and strands; hot rolled coils, cold rolled sheets, wire rods, and rebars; and round, threaded, and ball flat steel products, as well as other metal products. It also exports its products to approximately 20 countries and regions, including Europe, the United States, Brazil, the Middle East, South Korea, Japan, Southeast Asia, and India. The company is based in Xinyu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xinyu",
        "zipcode": "338001",
        "website": "http://www.xinsteel.com.cn",
        "market_cap": "Mid Cap"
    },
    "600784.SS": {
        "short_name": "LUYIN INVESTMENT GROUP CO",
        "long_name": "Luyin Investment Group Co., Ltd.",
        "summary": "Luyin Investment Group Co., Ltd. primarily engages in the powder metallurgy business. It is also involved in the iron ore mining; real estate development; international trade; cashmere textile; and cultural art businesses, as well as provision of property services and microfinance. The company was founded in 1993 and is based in Jinan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": "250014",
        "website": "http://www.luyin.cn",
        "market_cap": "Small Cap"
    },
    "600808.SS": {
        "short_name": "MAANSHAN IRON & STEEL CO",
        "long_name": "Maanshan Iron & Steel Company Limited",
        "summary": "Maanshan Iron & Steel Company Limited, together with its subsidiaries, manufactures and sells iron and steel products, and related by-products in the People's Republic of China and internationally. It offers hot and cold rolled, galvanized, and color coated strips; ship plates, container use strips, electric steel, pipe steel, etc.; H-beam, angle, and channel sections; cold-heading wire rods; and train wheels for wagon cars. The company also provides railway wheel and tire, bearing, spring, gear, tool and die, ring, high grade cold heading, non-quenched and tempered, anchor chain, roller, and alloy structural steel, as well as alloy tube billet, steel for heavy castings and forgings, and other series. In addition, it is involved in the production and sale of coke, coke chemical, energy, and metallic products, as well as screw threaded, round, section, angle, and deformed steel products; sale of iron ore and iron ore fines, and scrap steel products; and metallurgy and extended processing of ferrous metals and sale of resulting products, as well as extended processing of iron and steel products. Further, the company researches and develops automobile, home electrical appliances, engineering, and machinery materials; produces and sells steel and stamping spare parts; provides materials storage, and technical consulting services; offers products and equipment used in rail transport, urban transport, and machinery construction; and trades in pig iron. Additionally, it engages in the investment and trading businesses. The company was founded in 1953 and is headquartered in Maanshan, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Maanshan",
        "zipcode": "243003",
        "website": "http://www.magang.com.cn",
        "market_cap": "Mid Cap"
    },
    "600992.SS": {
        "short_name": "GUIZHOU WIRE ROPE CO",
        "long_name": "Guizhou Wire Rope Incorporated Company",
        "summary": "Guizhou Wire Rope Incorporated Company produces, processes, and sells steel wire ropes and strands, and related materials and equipment primarily in China. The company offers single strand, four strand, multi-layer strand, shaped strand, compacted, point and line contact, parallel twisted, oil, diameter, sealed, balanced, fishing, elevator, aviation, and handling wire ropes, as well as steel wire ropes for conveyor belts. It also provides steel wires; PC Strands, including galvanized, pre-stressed concrete, and un-bonded pre-stressed steel strands; and wire rope sling - insert buckles, joint less splicing rigging, aluminum alloy pressed joints, two-legged and Limb rigging, hot and cold castings. The company offers its products under the Dragon brand name. It also exports its products to the United States, Britain, Canada, Denmark, the Netherlands, Singapore, and other countries. The company was founded in 2000 and is based in Zunyi, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zunyi",
        "zipcode": "563000",
        "website": "http://www.gzgsgf.com.cn",
        "market_cap": "Small Cap"
    },
    "601003.SS": {
        "short_name": "LIUZHOU IRON & STEEL CO. LTD.",
        "long_name": "Liuzhou Iron & Steel Co., Ltd.",
        "summary": "Liuzhou Iron & Steel Co., Ltd. produces and sells iron and steel products. The company offers rebars, wires, channels, and ship and boiler plates, as well as round, angle, die, and other steel products. It exports its products to ASEAN countries, Japan, South Korea, and Europe. The company was founded in 1958 and is based in Liuzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Liuzhou",
        "zipcode": "545002",
        "website": "http://www.liusteel.com",
        "market_cap": "Mid Cap"
    },
    "601028.SS": {
        "short_name": "JIANGSU YULONG STEEL PIPE CO LT",
        "long_name": "Jiangsu Yulong Steel Pipe Co., Ltd.",
        "summary": "Jiangsu Yulong Steel Pipe Co., Ltd. produces and sells steel pipes in China and internationally. The company's products include submerged arc welded pipes, SAWH steel pipes, high frequency longitudinal resistance welded pipes, square and rectangular steel pipes, 3PP/3PE/FBE anticorrosive pipes, corrosion-resistant metallurgical composite bimetallic longitudinal welded pipes, and alloy-steel pipes. Its products are used in the areas of petroleum, petrochemical, natural gas, shale gas, pulp, water transportation, large steel structure, etc. The company is based in Wuxi, China. Jiangsu Yulong Steel Pipe Co., Ltd. is a subsidiary of Lhasa Zhihe Science and Technology Development Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214183",
        "website": "http://www.yulongsteelpipe.com",
        "market_cap": "Mid Cap"
    },
    "603616.SS": {
        "short_name": "BEIJING HANJIAN HESHAN PIPELINE",
        "long_name": "Beijing Hanjian Heshan Pipeline Co.,Ltd",
        "summary": "Beijing Hanjian Heshan Pipeline Co.,Ltd manufactures and sells pre-stressed steel cylinder concrete pipes, pressure steel pipes, drainage pipes, commercial concrete products, and concrete box culverts in China. The company was founded in 2004 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102488",
        "website": "http://www.bjhs.cn",
        "market_cap": "Small Cap"
    },
    "603878.SS": {
        "short_name": "JIANGSU WUJIN STAINLESS STEEL P",
        "long_name": "Jiangsu Wujin Stainless Steel Pipe Group CO.,LTD.",
        "summary": "Jiangsu Wujin Stainless Steel Pipe Group CO.,LTD. researches, develops, manufactures, and sells stainless steel and nickel alloy seamless pipes, welded pipes, fittings, and flanges in China and internationally. Its products are primarily used in the power station boiler, nuclear power, petroleum, petrochemical, chemical, coal chemical, salt chemical, LNG, photovoltaic power generation, solar thermal electric power generation, ship and ocean engineering, pressure vessel, and machinery manufacturing industries. The company was founded in 1970 and is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": "213111",
        "website": "http://wjss.com.cn",
        "market_cap": "Small Cap"
    },
    "603969.SS": {
        "short_name": "SILVERY DRAGON PRESTRESSED MATE",
        "long_name": "SILVERY DRAGON PRESTRESSED MATERIALS CO., LTD. TIANJIN",
        "summary": "SILVERY DRAGON PRESTRESSED MATERIALS CO., LTD. TIANJIN manufactures and sells pre-stressed concrete steel products in China. The company offers spiral rib PC, PCCP steel, plane surface PC steel, and indented PC wires; PC steel bars; indented spiral-rip PC strands; PE strands; spiral hollow cables; and galvanized PC wires and strands. It also provides PC bar systems, which are used in CRTS I type post tension high-speed railway track plates; spiral rib wires that are used in CRTS II type pre-tensioned high-speed railway track plates; and PC steel systems, which are used in CRTS III type pre-tension high-speed railway track plates, as well as PC steel bars for mine reinforcement. The company supplies its products for use in railway, highway, water conservancy, and construction industries, as well as special pre-stressed concrete structure. It also exports its products to approximately 80 countries. SILVERY DRAGON PRESTRESSED MATERIALS CO., LTD. TIANJIN was founded in 1998 and is headquartered in Tianjin, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300400",
        "website": "http://www.yinlong.com",
        "market_cap": "Small Cap"
    },
    "605050.SS": {
        "short_name": "FRIEND CO LTD",
        "long_name": "Friend Co.,Ltd.",
        "summary": "Friend Co.,Ltd. provides steel logistics supply chain services for medium and high-end automotive, home appliance, and other related enterprises. It offers procurement, cutting, warehousing and packaging, transportation and distribution, and related technical support services. The company was founded in 2004 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.scmfriend.com",
        "market_cap": "Small Cap"
    },
    "605158.SS": {
        "short_name": "ZHEJIANG HUADA NEW MATERIALS CO",
        "long_name": "Zhejiang Huada New Materials Co., Ltd.",
        "summary": "Zhejiang Huada New Materials Co., Ltd. engages in the production, research and development, and sale of crystalline cold rolled steel and corrosion resistance of hot plating zinc plated steel plate products in China. It offers hot galvanized, rolling hard, acid pickling roll, color coating, and peritoneal color plate products. The company exports to Europe, Southeast Asia, and the Middle East. Zhejiang Huada New Materials Co., Ltd. was founded in 2003 and is based in Hangzhou, China. Zhejiang Huada New Materials Co., Ltd. operates as a subsidiary of Zhejiang Huada Group Co.,Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311413",
        "website": "http://www.hdnew.cn",
        "market_cap": "Small Cap"
    },
    "688186.SS": {
        "short_name": "ZHANGJIAGANG GUANGDA SPECIAL MA",
        "long_name": "Zhangjiagang Guangda Special Material Co., Ltd.",
        "summary": "Zhangjiagang Guangda Special Material CO.,LTD. produces and sells steel alloy ingots and forgings. It offers die and tool, alloy structural, railway locomotive, and special alloy steel, as well as wind and nuclear power products. The company also provides machine accessories. Its products are used in civil and military aircraft, armored car, racing, vessel, rail, petrochemical, wind power, power station, mining, machinery, and machinery applications. The company was founded in 2003 and is based in Zhangjiagang, China. Zhangjiagang Guangda Special Material CO.,LTD. operates as a subsidiary of Zhangjiagang Guangda Investment Holding Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhangjiagang",
        "zipcode": "215614",
        "website": "http://www.zjggdtc.com/index.html",
        "market_cap": "Small Cap"
    },
    "6890.HK": {
        "short_name": "KANGLI INT HLDG",
        "long_name": "KangLi International Holdings Limited",
        "summary": "KangLi International Holdings Limited, together with its subsidiaries, manufactures and sells galvanized steel products in the People's Republic of China, South Korea, and internationally. It operates in three segments: Hard Steel Coil, Unpainted Galvanised Steel Products, and Painted Galvanised Steel Products. The Hard Steel Coil segment provides cold-rolled hard steel coils. The Unpainted Galvanised Steel Products segment offers hot-dipped galvanized/zinc coated steel coils and sheets. The Painted Galvanised Steel Products segment provides hot-dipped color coated galvanized steel coils and sheets. The company sells its products to midstream steel product processors for further processing; and home appliance manufacturers for use in the production of home appliances, such as refrigerators, washing machines, and ovens. KangLi International Holdings Limited was founded in 2003 and is headquartered in Changzhou, China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": null,
        "website": "http://www.jnpmm.com",
        "market_cap": "Small Cap"
    },
    "CGP.F": {
        "short_name": "CHONGQING IRON+STEEL HYC1",
        "long_name": "Chongqing Iron & Steel Company Limited",
        "summary": "Chongqing Iron & Steel Company Limited, together with its subsidiaries, processes, produces and sells steel plates, wire rods, bar materials, and billets and thin plates in the People's Republic of China. It is also involved in the production and sale of coal chemical products, pig iron and grain slag, etc. The company's products have applications in various industries, such as machinery, architecture, engineering, automobile, motorbike, shipbuilding, offshore oil, gas cylinder, boiler, and oil and gas pipelines. Chongqing Iron & Steel Company Limited was incorporated in 1997 and is based in Chongqing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "401258",
        "website": "http://www.cqgt.cn",
        "market_cap": "Mid Cap"
    },
    "DM7.F": {
        "short_name": "DA MING INTL H.REGS HD-10",
        "long_name": "Da Ming International Holdings Limited",
        "summary": "Da Ming International Holdings Limited processes, distributes, and sells stainless steel and carbon steel products in the People's Republic of China and internationally. It offers high strength steel, wear-resistant steel, regular stainless steel, duel phase steel, heat-resistant steel, nickel based alloy, super austenitic-steel, and 6mo steel products. The company is also involved in the purchase and sale of metal materials; and distribution and sale of fixed assets. It serves machineries, distributors, petrochemical, home hardware and appliances, automobile and transport, construction, renewable energy, and other industries. The company was incorporated in 2007 and is headquartered in Wuxi, the People's Republic of China. Da Ming International Holdings Limited is a subsidiary of Ally Good Group Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": null,
        "website": "http://www.dmssc.net",
        "market_cap": "Small Cap"
    },
    "GNV.F": {
        "short_name": "ANGANG STEEL CO. H  YC 1",
        "long_name": "Angang Steel Company Limited",
        "summary": "Angang Steel Company Limited engages in the production, processing, and sale of steel products in the People's Republic of China. Its principal products include hot rolled sheets, medium and thick plates, cold rolled sheets, galvanized steel sheets, color coating plates, cold rolled silicon steel, heavy rails and sections, seamless steel pipes and wire rods, and other products. The company also engages in ferrous metal smelting and steel pressing and processing activities. In addition, it sells metal materials and products, and building materials, etc.; provides wholesale and retail purchasing services; develops metallurgy and related materials and equipment; and purchases and sells metal and other materials, as well as imports, exports, wholesales, and retails technology products. Further, the company engages in the purification of cooking gas; production of coal products and dissolved acetylene; and sale of compressed and liquefied gas. The company's products are used in various industries, such as machinery, metallurgy, petroleum, chemical industry, coal, electricity, railway, shipbuilding, automobile, construction, home appliances, and aviation industries. It also exports its products. The company was formerly known as Angang New Steel Company Limited and changed its name to Angang Steel Company Limited in June 2006. Angang Steel Company Limited was founded in 1997 and is headquartered in Anshan, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Anshan",
        "zipcode": "114021",
        "website": "http://www.ansteel.com.cn",
        "market_cap": "Mid Cap"
    },
    "GSIH": {
        "short_name": "GENERAL STEEL HOLDINGS INC",
        "long_name": "General Steel Holdings, Inc.",
        "summary": "General Steel Holdings, Inc. engages in the business of cell research, development, storage, and cell culture service in the People's Republic of China. General Steel Holdings, Inc. was incorporated in 2002 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.gshi-steel.com",
        "market_cap": "Small Cap"
    },
    "HUDI": {
        "short_name": "Huadi International Group Co., ",
        "long_name": "Huadi International Group Co., Ltd.",
        "summary": "Huadi International Group Co., Ltd. manufactures and sells industrial stainless steel seamless pipes and tubes in the People's Republic of China. The company's products are used in the oil and gas transmission, chemistry engineering, food processing, medical devices, aeronautics and astronautics, boiler, irrigation works construction, electricity, automobile, naval architecture, paper mill, and mechanical industries. It also exports its products to 20 countries, including the United States, Mexico, Thailand, Australia, Argentina, India, the Philippines, the United Arab Emirates, Taiwan, Canada, and internationally. The company was founded in 1992 and is based in Wenzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Wenzhou",
        "zipcode": "325025",
        "website": "http://www.huadi.cc",
        "market_cap": "Small Cap"
    },
    "MAANF": {
        "short_name": "MAANSHAN IRON & STEEL CO",
        "long_name": "Maanshan Iron & Steel Company Limited",
        "summary": "Maanshan Iron & Steel Company Limited, together with its subsidiaries, manufactures and sells iron and steel products, and related by-products in the People's Republic of China and internationally. It offers hot and cold rolled, galvanized, and color coated strips; ship plates, container use strips, electric steel, pipe steel, etc.; H-beam, angle, and channel sections; cold-heading wire rods; and train wheels for wagon cars. The company also provides railway wheel and tire, bearing, spring, gear, tool and die, ring, high grade cold heading, non-quenched and tempered, anchor chain, roller, and alloy structural steel, as well as alloy tube billet, steel for heavy castings and forgings, and other series. In addition, it is involved in the production and sale of coke, coke chemical, energy, and metallic products, as well as screw threaded, round, section, angle, and deformed steel products; sale of iron ore and iron ore fines, and scrap steel products; and metallurgy and extended processing of ferrous metals and sale of resulting products, as well as extended processing of iron and steel products. Further, the company researches and develops automobile, home electrical appliances, engineering, and machinery materials; produces and sells steel and stamping spare parts; provides materials storage, and technical consulting services; offers products and equipment used in rail transport, urban transport, and machinery construction; and trades in pig iron. Additionally, it engages in the investment and trading businesses. The company was founded in 1953 and is headquartered in Maanshan, the People's Republic of China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Maanshan",
        "zipcode": "243003",
        "website": "http://www.magang.com.cn",
        "market_cap": "Mid Cap"
    },
    "OSN": {
        "short_name": "Ossen Innovation Co., Ltd.",
        "long_name": "Ossen Innovation Co., Ltd.",
        "summary": "Ossen Innovation Co., Ltd., together with its subsidiaries, manufactures and sells various plain surface prestressed steel materials, and rare earth coated and zinc coated prestressed steel materials in the People's Republic of China and internationally. The company offers plain surface products, including plain surface prestressed concrete (PC) strands that are used in precast concrete plates on the riding surface of bridges; and unbonded plain surface PC strands for the construction of bridges and buildings. It also provides plain surface PC wires and indented PC wires, which are used in the construction of buildings; helical rib PC wires for the construction of railway ties or sleepers, and buildings; and coated prestressed products comprising zinc coated PC and rare earth coated PC products. The company markets and sells its products under the Ossen brand name. Ossen Innovation Co., Ltd. also exports its products to the United States, Canada, Spain, Japan, South Korea, Taiwan, Australia, South Africa, Saudi Arabia, and internationally. The company was formerly known as Ultra Glory International, Ltd. Ossen Innovation Co., Ltd. was founded in 2010 and is based in Shanghai, the People's Republic of China. Ossen Innovation Co., Ltd. operates as a subsidiary of Pujiang International Group Limited.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200120",
        "website": "http://www.osseninnovation.com",
        "market_cap": "Small Cap"
    },
    "YM9A.F": {
        "short_name": "MAANSHAN IRON STEEL H YC1",
        "long_name": "Maanshan Iron & Steel Company Limited",
        "summary": "Maanshan Iron & Steel Company Limited, together with its subsidiaries, manufactures and sells iron and steel products, and related by-products in the People's Republic of China and internationally. It offers hot and cold rolled, galvanized, and color coated strips; ship plates, container use strips, electric steel, pipe steel, etc.; H-beam, angle, and channel sections; cold-heading wire rods; and train wheels for wagon cars. The company also provides railway wheel and tire, bearing, spring, gear, tool and die, ring, high grade cold heading, non-quenched and tempered, anchor chain, roller, and alloy structural steel, as well as alloy tube billet, steel for heavy castings and forgings, and other series. In addition, it is involved in the production and sale of coke, coke chemical, energy, and metallic products, as well as screw threaded, round, section, angle, and deformed steel products; sale of iron ore and iron ore fines, and scrap steel products; and metallurgy and extended processing of ferrous metals and sale of resulting products, as well as extended processing of iron and steel products. Further, the company researches and develops automobile, home electrical appliances, engineering, and machinery materials; produces and sells steel and stamping spare parts; provides materials storage, and technical consulting services; offers products and equipment used in rail transport, urban transport, and machinery construction; and trades in pig iron. Additionally, it engages in the investment and trading businesses. The company was founded in 1953 and is headquartered in Maanshan, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Maanshan",
        "zipcode": "243003",
        "website": "http://www.magang.com.cn",
        "market_cap": "Mid Cap"
    },
    "ZKIN": {
        "short_name": "ZK International Group Co., Ltd",
        "long_name": "ZK International Group Co., Ltd.",
        "summary": "ZK International Group Co., Ltd., through its subsidiaries, engages in the designing, producing, and selling double-press thin-walled stainless steel, carbon steel, and single-press tubes and fittings in the People's Republic of China. It offers carbon and stainless steel strips; carbon and stainless steel pipes; light gauge stainless steel pipes; pipe connections and fittings; and couplings, adapters, unions, caps, plug pipes, elbows, three-way fittings, tees, cross, side-inlet elbows, wyes, reducers, bushings, pipe fasteners, and pipe flanges. The company also provides stainless steel band, copper strip, valve, light industry machinery and equipment, and other stainless steel products. Its products are used in various applications, including water and gas transmission within urban infrastructural development, residential housing development, food and beverage production, oil and gas exploitation, and agricultural irrigation. The company also exports its products to Europe, Africa, and Southeast Asia. ZK International Group Co., Ltd. was incorporated in 2015 and is based in Wenzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Wenzhou",
        "zipcode": "325025",
        "website": "http://www.zkinternationalgroup.com",
        "market_cap": "Small Cap"
    }
}