{
  "000598.SZ": {
    "city": "Chengdu",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Utilities - Regulated Water",
    "long_name": "Chengdu Xingrong Environment Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "CHENGDU XINGRONG E",
    "state": null,
    "summary": "Chengdu Xingrong Environment Co., Ltd. provides water utilities and environmental services in China. It produces, distributes, and markets tap water; and operates and manages sewage treatment services comprising municipal sewage, rural sewage, and industrial wastewater services. The company also engages in the investment, design, construction, operation management, technical development and consultation, and technical services of reclaimed water-related projects, as well as maintenance and repair of reclaimed water facilities; and sale of reclaimed water. In addition, it is involved in the design, construction, and consulting of water supply and drainage services; and provides pipeline technical services, such as water supply pipeline leakage control engineering, drainage pipeline inspection, repair and cleaning, pressure pipeline leak point positioning, underground pipeline detection, engineering measurement, data test of pipe networks, and other related technical and consultation services. The company operates 8 waterworks, 13 sewage treatment plants, 2 waste-to-energy plants, 2 leachate treatment plants, and 1 sewage sludge treatment plant. The company was formerly known as Chengdu Xingrong Investment Co., Ltd. and changed its name to Chengdu Xingrong Environment Co., Ltd. in June 2015. Chengdu Xingrong Environment Co., Ltd. was founded in 1995 and is based in Chengdu, China.",
    "website": "http://www.cdxrec.com",
    "zipcode": "610041"
  },
  "000605.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Utilities - Regulated Water",
    "long_name": "Bohai Water Industry Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "BOHAI WATER INDUST",
    "state": null,
    "summary": "Bohai Water Industry Co.,Ltd engages in water supply and sewage treatment businesses. The company is based in Beijing, China.",
    "website": "http://www.bohai-water.com",
    "zipcode": "101100"
  },
  "000685.SZ": {
    "city": "Zhongshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Utilities - Regulated Water",
    "long_name": "Zhongshan Public Utilities Group Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "ZHONGSHAN PUBLIC",
    "state": null,
    "summary": "Zhongshan Public Utilities Group Co., Ltd. provides environmental protection and water services in China. The company is involved in the urban water supply and sewage treatment activities; urban cleaning, and garbage collection and transportation activities; and waste treatment, leakage treatment, and power generation activities. Its water supply coverage area comprises of approximately 2,000 square kilometers. The company also operates and manages farmers' market; and constructs passenger service hub ports. In addition, it undertakes construction projects, including municipal, construction, decoration, fire, electrical and mechanical, and urban and road lighting projects, as well as installs and reconstructs gas pipeline. Further, the company engages in financial investment businesses. The company was formerly known as Zhongshan Public Utilities Science and Technology Company Limited and changed its name to Zhongshan Public Utilities Group Co., Ltd. in August 2008. Zhongshan Public Utilities Group Co., Ltd. was founded in 1998 and is based in Zhongshan, China.",
    "website": "http://www.zpug.net",
    "zipcode": "528403"
  },
  "003039.SZ": {
    "city": "Foshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Utilities - Regulated Water",
    "long_name": "Guangdong Shunkong Development Co. Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "GUANGDONG SHUNKONG",
    "state": null,
    "summary": "Guangdong Shunkong Development Co. Ltd. engages in the urban water supply business. It also offers solid waste treatment, municipal engineering, environmental testing and management consulting, and domestic garbage and sludge treatment services. The company was founded in 2015 and is based in Foshan, China.",
    "website": "http://www.gdskfz.com",
    "zipcode": null
  },
  "1542.HK": {
    "city": "Taizhou",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Utilities - Regulated Water",
    "long_name": "Taizhou Water Group Co., Ltd.",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Utilities",
    "short_name": "TAIZHOU WATER",
    "state": null,
    "summary": "Taizhou Water Group Co., Ltd. engages in supplying municipal, tap, and raw water in Mainland China. It is also involved in installation of water pipelines. The company was founded in 1993 and is headquartered in Taizhou, the People's Republic of China.",
    "website": "http://www.zjtzwater.com",
    "zipcode": "318020"
  },
  "2281.HK": {
    "city": "Luzhou",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Utilities - Regulated Water",
    "long_name": "Luzhou Xinglu Water (Group) Co., Ltd.",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Utilities",
    "short_name": "XINGLU WATER",
    "state": null,
    "summary": "Luzhou Xinglu Water (Group) Co., Ltd., an integrated municipal water service provider, together with its subsidiaries, engages in the tap water supply and wastewater treatment businesses in China. It also provides tap water supply related installation and maintenance services; and construction and upgrading services related to tap water supply and wastewater treatment infrastructure. The company owns 10 tap water plants with a daily supply capacity of approximately 491,500 tons; and has a total of 9 wastewater treatment plants with an aggregate wastewater treatment capacity of 301,000 tons per day. It serves urban and rural residents, industrial and commercial users, local governments, and other institutions. The company was founded in 1958 and is headquartered in Luzhou, the People's Republic of China. Luzhou Xinglu Water (Group) Co., Ltd. is a subsidiary of Luzhou City Xinglu Investment Group Co., Ltd.",
    "website": "http://www.lzss.com",
    "zipcode": null
  },
  "27K.SG": {
    "city": "Chongqing",
    "country": "China",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Utilities - Regulated Water",
    "long_name": "Kangda International Environmental Company Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Utilities",
    "short_name": "Kangda Intl Environmen.Co.Ltd.R",
    "state": null,
    "summary": "Kangda International Environmental Company Limited, an investment holding company, engages in the urban water treatment, water environment comprehensive remediation, and rural water improvement businesses in People's Republic of China. Its Urban Water Treatment segment is involved in the design, construction, upgradation, and operation of waste water treatment plants (WTP), reclaimed water treatment plants, sludge treatment plants, and water distribution plants; and the operation and maintenance of waste water treatment facilities entrusted by governments. The company's Water Environment Comprehensive Remediation segment engages in the river harnessing and improvement, foul water body treatment, and sponge city construction. Its Rural Water Improvement segment is involved in the construction and operation of water environment facilities in villages, including waste water treatment, pipeline construction for collecting waste water, and rural living environment activities. The company also constructs municipal infrastructure; invests and manages environmental and public infrastructure projects; develops and sells WTP equipment; develops computer software; and sells water purifying materials. It serves municipal, district, or county level governments, as well as their designees. The company was founded in 1996 and is headquartered in Chongqing, the People's Republic of China.",
    "website": "http://www.kangdaep.com",
    "zipcode": null
  },
  "300021.SZ": {
    "city": "Tianjin",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Utilities - Regulated Water",
    "long_name": "Dayu Water-saving Group Co., Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "DAYU WATER-SAVING",
    "state": null,
    "summary": "Dayu Water-saving Group Co., Ltd engages in the research and development, manufacture, and sale of water-saving irrigation materials in China and internationally. The company offers internal inlay drip tapes, pressure compensated drip tapes, filter systems, irrigation automatic control systems, PE and PVC pipes, drip irrigation fittings, spray irrigation products, PE and PVC pipe fittings, PP connection fittings, sprinklers, and integrated water-fertilizer irrigation systems. It also provides project design, construction, and servicing of water-saving irrigation projects. The company was founded in 1999 and is based in Tianjin, China.",
    "website": "http://www.gsdyjsgs.com",
    "zipcode": "301712"
  },
  "300055.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Utilities - Regulated Water",
    "long_name": "Beijing Water Business Doctor Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "BEIJING WATER BUSI",
    "state": null,
    "summary": "Beijing Water Business Doctor Co., Ltd. engages in the industrial and municipal water supply business in China. It is also involved in the provision of sewage treatment, industrial production, sludge treatment, and garbage disposal facilities; sewage solutions for hazardous waste treatment plant; coking wastewater solution; petrochemical wastewater solutions; and provision of energy-saving equipment, as well as environmental protection equipment manufacturing activities. The company was founded in 1998 and is headquartered in Beijing, China.",
    "website": "http://www.waterbd.cn",
    "zipcode": "100024"
  },
  "300262.SZ": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Utilities - Regulated Water",
    "long_name": "SafBon Water Service (Holding) Inc.,Shanghai",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "SHANGHAII SAFBON W",
    "state": null,
    "summary": "SafBon Water Service (Holding) Inc.,Shanghai provides water treatment services in China. The company offers industrial waste water treatment solutions, including lime technology for reclaimed water treatment, membrane bio-reactor technology for reclaimed water treatment, flue gas desulfurization wastewater treatment, zero liquid discharge, and oily water separation technology; municipal water treatment solutions comprising drinking water purification systems and processes, BIOBON process with biological suspending chain aeration system, precoat filtration technology, low impact development system, and sewage treatment for municipal waste water; and membrane and ion exchange solutions, including hi-tower regeneration, power coated, and demineralized water treatment technology. It also provides solid waste treatment solutions, such as hazardous incineration, and the thin film sludge dryer technology; seawater desalination solutions comprising membrane and containerized desalination technology; compressed natural gas (CNG)/liquefied natural gas (LNG) filling stations, LNG gasification stations, natural gas regulation stations, and long distance gas pipelines, as well as combined cooling, heating, and power systems; and sea water flue gas desulfurization technology. In addition, the company offers ceramic flat membrane systems, which removes pollutants like particles and microorganisms and produces clear water free from biological and toxic hazards; and dissolved air flotation systems that treats water and waste water. SafBon Water Service (Holding) Inc.,Shanghai is headquartered in Shanghai, China.",
    "website": "http://www.safbon.com",
    "zipcode": null
  },
  "300961.SZ": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Utilities - Regulated Water",
    "long_name": "Hynar Water Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "HYNAR WATER GROUP",
    "state": null,
    "summary": "Hynar Water Group Co., Ltd. provides industrial wastewater treatment and water supply services. The company offers investment, design, construction, and operation services for industrial parks, and industrial sewage treatment plants and related supporting pipe networks, as well as drinking water supply facilities. It also provides sludge treatment and disposal system solutions. The company provides industrial wastewater treatment services for the pharmaceutical, printing and dyeing, chemical, and other industries. Hynar Water Group Co., Ltd. was founded in 2001 is based in Shenzhen, China.",
    "website": "http://www.hainawater.com",
    "zipcode": "518052"
  },
  "3768.HK": {
    "city": "Kunming",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Utilities - Regulated Water",
    "long_name": "Kunming Dianchi Water Treatment Co., Ltd.",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Utilities",
    "short_name": "DCWT",
    "state": null,
    "summary": "Kunming Dianchi Water Treatment Co., Ltd., together with its subsidiaries, design, develop, construct, operate, and maintain water supply and wastewater treatment facilities in the People's Republic of China. It operates through Wastewater Treatment, Water Supply, and Others segments. It designs, constructs, operates, and maintains wastewater treatment or water supply facilities under the transfer-operate-transfer and build-operate-transfer concession agreements. The company is also involved in the reclaimed water supply and running water supply; municipal wastewater treatment; water quality testing; provision of logistics and leasing services, and professional training; and manufacture and sale of chemical products. In addition, it provides management, transportation, watershed management, sludge resource utilization, mine restoration, and solid waste treatment and disposal services, as well as engages in thermal production activities. The company was founded in 1989 and is headquartered in Kunming, the People's Republic of China. Kunming Dianchi Water Treatment Co., Ltd. is a subsidiary of Kunming Dianchi Investment Co., Ltd.",
    "website": "http://www.kmdcwt.com",
    "zipcode": "650000"
  },
  "600168.SS": {
    "city": "Wuhan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Utilities - Regulated Water",
    "long_name": "Wuhan Sanzhen Industry Holding Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "WUHAN SANZHEN INDUSTRY HOLDING ",
    "state": null,
    "summary": "Wuhan Sanzhen Industry Holding Co., Ltd. engages in water production and supply, and sewage treatment activities in China. It is also involved in the construction and operation of tunnels and other infrastructure. The company is based in Wuhan, China.",
    "website": "http://www.600168.com.cn",
    "zipcode": "430062"
  },
  "600187.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Utilities - Regulated Water",
    "long_name": "Heilongjiang Interchina Water Treatment Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "HEILONGJIANG INTERCHINA WATER C",
    "state": null,
    "summary": "Heilongjiang Interchina Water Treatment Co.,Ltd. engages in the construction and operation of water project in China. The company is involved in the purification and supply of water. It also offers sewage treatment, drainage integration, engineering, and technical services. In addition, the company provides green sustainable energy and project construction services. The company was founded in 1998 and is headquartered in Shanghai, China.",
    "website": "http://www.interchinawater.com",
    "zipcode": "201112"
  },
  "600323.SS": {
    "city": "Foshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Utilities - Regulated Water",
    "long_name": "Grandblue Environment Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Utilities",
    "short_name": "GRANDBLUE ENVIRONMENT CO LTD",
    "state": null,
    "summary": "Grandblue Environment Co., Ltd. engages in the water supply, sewage treatment, solid waste treatment, and gas supply businesses in China. The company provides water supply services, including water intake, production, and delivery to end-customers; sewage treatment services, such as sewage treatment pipe network maintenance, pumping station management, and sewage treatment plant operation and management; and gas supply services. It also offers solid waste treatment services comprising sanitation cleaning, garbage sorting, garbage collection, garbage transfer, incineration power generation, sanitary landfill, leachate treatment, fly ash treatment, slag treatment, waste treatment, sludge treatment, manure treatment, hazardous waste treatment, etc., as well as domestic and kitchen cooking waste treatment. The company was formerly known as Nanhai Development Co. Ltd. and changed its name to Grandblue Environment Co., Ltd. in December 2013. Grandblue Environment Co., Ltd. was founded in 1992 and is based in Foshan, China.",
    "website": "http://www.grandblue.cn",
    "zipcode": "528200"
  },
  "600461.SS": {
    "city": "Nanchang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Utilities - Regulated Water",
    "long_name": "Jiangxi Hongcheng Environment Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "JIANGXI HONGCHENG ENVIRONMENT C",
    "state": null,
    "summary": "Jiangxi Hongcheng Environment Co., Ltd. engages in the production and supply of water in China. It is also involved in the operation of sewage treatment plants. The company was formerly known as Jiangxi Hongcheng Waterworks Co.,Ltd. and changed its name to Jiangxi Hongcheng Environment Co., Ltd. in February 2021. The company is based in Nanchang, China. Jiangxi Hongcheng Environment Co., Ltd. is a subsidiary of Nanchang Waterworks Group Ltd.",
    "website": "http://www.jxhcsy.com",
    "zipcode": "330025"
  },
  "601199.SS": {
    "city": "Jiangyin",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Utilities - Regulated Water",
    "long_name": "Jiangsu Jiangnan Water Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "JIANGSU JIANGNAN WATER CO LTD",
    "state": null,
    "summary": "Jiangsu Jiangnan Water Co., Ltd. supplies water in China. It engages in the drainage and water treatment-related business; water supply engineering design and technical advice; water quality testing; measuring and testing water meters; and public infrastructure investing business. The company owns four ground water plants in Xiaowan, Xiaoshan, Chengxi, and Ligang, with a daily water supply capacity of 1.16 million cubic meters. It also manages and constructs drainage network and pumping stations; offers maintenance and dredging services; manages sewage treatment related facilities; provides sewage treatment and industrial water purification services; designs and constructs water supply and drainage pipelines; installs water supply and drainage equipment; constructs urban road projects, public squares, and pipeline parts and components; and offers pipe network repairs and other services. The company was founded in 1966 and is based in Jiangyin, China.",
    "website": "http://www.jsjnsw.com",
    "zipcode": null
  },
  "601368.SS": {
    "city": "Nanning",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Utilities - Regulated Water",
    "long_name": "Guangxi Nanning Waterworks Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "GUANGXI NANNING WATERWORKS CO L",
    "state": null,
    "summary": "Guangxi Nanning Waterworks Co., Ltd. produces and sells water in China. It is also involved in sewage treatment activities; and the construction and operation of water supply and drainage facilities. The company was founded in 2006 and is based in Nanning, China.",
    "website": "http://www.gxlcwater.com",
    "zipcode": "530031"
  },
  "603817.SS": {
    "city": "Fuzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Utilities - Regulated Water",
    "long_name": "Fujian Haixia Environmental Protection Group Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "FUJIAN HAIXIA ENVIRONMENTAL PRO",
    "state": null,
    "summary": "Fujian Haixia Environmental Protection Group Co.,Ltd. provides environmental services in China. It offers single and municipal sewage treatment, garbage leachate treatment, industrial wastewater treatment, township sewage treatment, sludge treatment and disposal, solid and hazardous waste disposal, and linen washing services, as well as resource utilization of muck and construction waste. The company was founded in 2002 and is based in Fuzhou, China. Fujian Haixia Environmental Protection Group Co.,Ltd. is a subsidiary of Fuzhou Water Affairs Investment and Development Co., Ltd.",
    "website": "http://www.fjhxhb.com",
    "zipcode": null
  },
  "6136.HK": {
    "city": "Chongqing",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Utilities - Regulated Water",
    "long_name": "Kangda International Environmental Company Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Utilities",
    "short_name": "KANGDA ENV",
    "state": null,
    "summary": "Kangda International Environmental Company Limited, an investment holding company, engages in the urban water treatment, water environment comprehensive remediation, and rural water improvement businesses in People's Republic of China. Its Urban Water Treatment segment is involved in the design, construction, upgradation, and operation of waste water treatment plants (WTP), reclaimed water treatment plants, sludge treatment plants, and water distribution plants; and the operation and maintenance of waste water treatment facilities entrusted by governments. The company's Water Environment Comprehensive Remediation segment engages in the river harnessing and improvement, foul water body treatment, and sponge city construction. Its Rural Water Improvement segment is involved in the construction and operation of water environment facilities in villages, including waste water treatment, pipeline construction for collecting waste water, and rural living environment activities. The company also constructs municipal infrastructure; invests and manages environmental and public infrastructure projects; develops and sells WTP equipment; develops computer software; and sells water purifying materials. It serves municipal, district, or county level governments, as well as their designees. The company was founded in 1996 and is headquartered in Chongqing, the People's Republic of China.",
    "website": "http://www.kangdaep.com",
    "zipcode": null
  },
  "6839.HK": {
    "city": "Kunming",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Utilities - Regulated Water",
    "long_name": "Yunnan Water Investment Co., Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Utilities",
    "short_name": "YUNNAN WATER",
    "state": null,
    "summary": "Yunnan Water Investment Co., Limited, an investment holding company, designs, develops, constructs, operates, and maintains municipal water supply and solid wastewater treatment facilities in the People's Republic of China and internationally. It operates through five segments: Wastewater Treatment, Water Supply, Solid Waste Treatment Construction and Sales of Equipment, and Others. It constructs and operates wastewater treatment projects, water supply projects, and solid waste treatment projects; undertakes build and transfer (BT) projects, and engineering-procurement-construction (EPC) projects; and produces, installs, and sells equipment for wastewater treatment, water supply, solid waste treatment, and other infrastructure facilities. The company undertakes operation and maintenance (O&M) projects for wastewater treatment, water supply, and solid waste treatment facilities owned by third parties; and offers technical and consultancy services. As at 31 December 2019, it had 124 concession wastewater treatment projects, including 7 build-own-operate (BOO), 69 build-operate-transfer (BOT), 2 transfer-own-operate (TOO), 21 transfer-operate-transfer (TOT) projects, 2 rehabilitate-operate-transfer (ROT), and 23 municipal environment comprehensive treatment projects, with total daily treatment capacity of approximately 3,380,400 tonnes; 66 concession water supply projects comprising, 15 BOO projects, 35 BOT projects, 11 TOT projects, and 4 municipal environment comprehensive treatment projects with total daily capacity of approximately 224,100 tonnes; 21 solid waste treatment projects with annual treatment capacity of approximately 3,571,000 tonnes; 11 BT projects and 10 EPC projects; and 30 O&M projects. The company was formerly known as Yunnan Water Industry Investment and Development Co., Ltd. and changed its name to Yunnan Water Investment Company Limited in July 2014. The company was founded in 2009 and is headquartered in Kunming, the People's Republic of China.",
    "website": "http://www.yunnanwater.cn",
    "zipcode": null
  },
  "688096.SS": {
    "city": "Nantong",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Utilities - Regulated Water",
    "long_name": "Jiangsu Jingyuan Environmental Protection Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Utilities",
    "short_name": "JIANGSU JINGYUAN ENVIRONMENTAL ",
    "state": null,
    "summary": "Jiangsu Jingyuan Environmental Protection Co., Ltd. provides professional and integrated water treatment solutions for customers in China and internationally. The company offers industrial waste sewage treatment equipment and systems, including coal-containing wastewater treatment, desulfurization wastewater treatment, zero-emissions, electrocatalytic oxidation treatment, and reclaimed water processing and reuse systems, etc. for use in the wastewater treatment and zero-emission treatment stages. It also provides water supply treatment equipment and systems, such as raw water pretreatment and desalinated water preparation systems that are used in the water supply treatment stage. In addition, the company engages in the consulting, integration, and sales and engineering contracting business. Jiangsu Jingyuan Environmental Protection Co., Ltd. was founded in 1999 and is based in Nantong, China.",
    "website": "http://www.jsjyep.com",
    "zipcode": "226000"
  },
  "688101.SS": {
    "city": "Xiamen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Utilities - Regulated Water",
    "long_name": "Suntar Environmental Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "SUNTAR ENVIRONMENTAL TECHNOLOGY",
    "state": null,
    "summary": "Suntar Environmental Technology Co., Ltd. provides industrial membrane separation solutions in China. It offers It offers ceramic, spiral, and PP/PE membrane separation; and flow-cel membrane, solvent recovery, membrane bioreactor, and continuous chromatography separation and ion exchange technologies. The company also provides ceramic, spiral wound, hollow fiber, and spiral membranes, as well as lab equipment and IMBRs. It serves customers in biological, chemical engineering, pharmaceutical, and food and beverage industries. The company was founded in 2005 and is based in Xiamen, China.",
    "website": "http://www.suntar.com",
    "zipcode": "716000"
  },
  "688156.SS": {
    "city": "Wuhan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Utilities - Regulated Water",
    "long_name": "Road Environment Technology.,Ltd",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Utilities",
    "short_name": "ROAD ENVIRONMENT TECHNOLOGY CO ",
    "state": null,
    "summary": "Road Environment Technology.,Ltd provides solid wastewater treatment and disposal services in China. It offers river and lake slit, engineering mud, industrial slag and sludge, and municipal sludge treatment services. The company was founded in 2006 and is based in Wuhan, China.",
    "website": "http://www.road-group.com",
    "zipcode": "430075"
  },
  "BEH.SI": {
    "city": "Beijing",
    "country": "China",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Utilities - Regulated Water",
    "long_name": "China International Holdings Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Utilities",
    "short_name": "China Intl",
    "state": null,
    "summary": "China International Holdings Limited, an investment holding company, engages in the water supply services and land development businesses in the People's Republic of China. The company's Water Supply Services segment constructs water pipelines and supplies gray water. Its Land Development segment provides engineering and land leveling services for preliminary land development projects. The company is also involved in the investment of properties; and energy and natural resources business. China International Holdings Limited is based in Beijing, the People's Republic of China.",
    "website": "http://www.cihgrp.net",
    "zipcode": "100081"
  }
}
