{
  "000593.SZ": {
    "city": "Chengdu",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Utilities - Regulated Gas",
    "long_name": "Sichuan Datong Gas Development Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Utilities",
    "short_name": "SICHUAN DATONG GAS",
    "state": null,
    "summary": "Sichuan Datong Gas Development Co.,Ltd. engages in the supply and distribution of natural gas through pipelines for households and industrial users in China. It also operates hotels; invests in, develops, and manages properties; and provides interior decoration services. The company is headquartered in Chengdu, China.",
    "website": "http://www.dtrq.com",
    "zipcode": "610051"
  },
  "002700.SZ": {
    "city": "Aksu",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Utilities - Regulated Gas",
    "long_name": "Xinjiang Haoyuan Natural Gas Co. ,Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Utilities",
    "short_name": "XINJIANG HAOYUAN N",
    "state": null,
    "summary": "Xinjiang Haoyuan Natural Gas Co. ,Ltd. engages in the transmission, distribution, and sale of natural gas; and home installation business in China. It operates long-distance gas pipelines, high and medium voltage municipal pipelines, gas stations, and CNG refueling mother station, as well as CNG trucks and tractors. The company was formerly known as Aksu Haoyuan Natural Gas Co., Ltd. And changed its name to Xinjiang Haoyuan Natural Gas Co. ,Ltd. The company was founded in 2006 and is based in Aksu, China.",
    "website": "http://www.hytrq.com",
    "zipcode": null
  },
  "1265.HK": {
    "city": "Tianjin",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Utilities - Regulated Gas",
    "long_name": "Tianjin Jinran Public Utilities Company Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Utilities",
    "short_name": "TIANJINJINRAN",
    "state": null,
    "summary": "Tianjin Jinran Public Utilities Company Limited engages in the operation and management of gas pipeline infrastructure, and the sale and distribution of piped gas to industrial and commercial users, and residential users in Mainland China. It operates through five segments: Sales of Piped Gas; Gas Connection; Gas Transportation; Sales of Gas Appliances and Others; and Gas Pipelines Rent. The company also provides piped gas connection services in Tianjin City and Jining, Inner Mongolia; leases pipelines, gas station facilities, and self-owned buildings; transports gas; and sells and installs gas appliances. In addition, it engages in the investment, urban gas operation, import and export, pipeline project, investment consultation, and mining investment activities. The company was formerly known as Tianjin Tianlian Public Utilities Company Limited and changed its name to Tianjin Jinran Public Utilities Company Limited in June 2012. The company is headquartered in Tianjin, the People's Republic of China. Tianjin Jinran Public Utilities Company Limited is a subsidiary of Tianjin Gas Group Company Limited.",
    "website": "http://www.jinrangongyong.com",
    "zipcode": null
  },
  "1430.HK": {
    "city": "Suzhou",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Utilities - Regulated Gas",
    "long_name": "Suchuang Gas Corporation Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Utilities",
    "short_name": "SUCHUANG GAS",
    "state": null,
    "summary": "Suchuang Gas Corporation Limited, an investment holding company, engages in the distribution and sale of piped natural gas to industrial, commercial, and residential users in Mainland China and internationally. It also provides natural gas transmission services; operates as a contractor for the construction and installation of gas pipelines; and constructs and operates natural gas filling stations. As of December 31, 2019, the company operated 5 compressed natural gas (CNG) /liquefied natural gas (LNG) refueling stations, including three stations in Guangyuan; 1 station in Taicang; and 1 station in Suzho; and served 595 commercial and industrial customers, and 250,000 residential customers. In addition, it promotes technologies for nitrogen and carbon dioxide; invests in the upstream asset; and offers technical, consulting, transfer, and development services, as well as sells chemicals. Further, the company is involved in the port facilities, contract energy management, project construction, and industrial investment businesses. Suchuang Gas Corporation Limited was founded in 2002 and is headquartered in Suzhou, the People's Republic of China.",
    "website": "http://www.suchuanggas.com",
    "zipcode": "215400"
  },
  "1635.HK": {
    "city": "Shanghai",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Utilities - Regulated Gas",
    "long_name": "Shanghai Dazhong Public Utilities(Group) Co.,Ltd.",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "DZUG",
    "state": null,
    "summary": "Shanghai Dazhong Public Utilities (Group) Co., Ltd., an investment holding company, engages in the piped gas supply and wastewater treatment activities in the People's Republic of China. The company operates four segments: Piped Gas Supply; Wastewater Treatment; Public Infrastructure Projects; and Transportation Services. It sells, distributes, and supplies piped natural gas; constructs and installs gas pipelines; treats wastewater and handles urban wastewater; rents cars, taxies, and tourist cars; and offers freight transport, relocation, liquefied petroleum gas delivery, and tourism services, as well as operates Dazhong Chuxing platform that provides online car hailing services. The company also offers infrastructure investment, construction, operation maintenance, and protection services; public infrastructure project services; and transportation, storage and, postal services, as well as sells gas related products. In addition, it provides financial services, including financial leasing, pre-paid cards, etc.; and scientific research and technological services, as well as invests in venture capital enterprises. Further, the company engages in the municipal road operation; agriculture development; payment; assets management; and financial consultancy activities. It owns approximately 6,826 kilometers of underground pipelines; and 900 operating vehicles. The company was formerly known as Shanghai Pudong Dazhong Taxi Co., Ltd. and changed its name to Shanghai Dazhong Public Utilities (Group) Co., Ltd. in May 2003. The company was founded in 1991 and is based in Shanghai, the People's Republic of China.",
    "website": "http://www.dzug.cn",
    "zipcode": "200235"
  },
  "1940.HK": {
    "city": "Tangshan",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Utilities - Regulated Gas",
    "long_name": "China Gas Industry Investment Holdings Co. Ltd.",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "CGII HLDGS",
    "state": null,
    "summary": "China Gas Industry Investment Holdings Co., Ltd., an investment holding company, produces and sells industrial gas in the People's Republic of China. The company provides industrial gas products, which include oxygen, nitrogen, argon, hydrogen and carbon dioxide. It primarily engages in the supply of pipeline industrial gas, as well as liquefied industrial gas (LNG) principally to offsite independent third parties through road tanker delivery; and LNG-related business, which includes the supply of LNG and provision of gas transmission services. In addition, the company operates an automobile LNG filling station; and constructs industrial gas projects. It sells its liquefied industrial gas to customers in a range of industries, including medical, shipping, engineering, photovoltaic, food, and automotive. The company was founded in 2004 and is headquartered in Tangshan, China.",
    "website": "http://cgiiholdings.com/web/index.html",
    "zipcode": null
  },
  "2688.HK": {
    "city": "Langfang",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Utilities - Regulated Gas",
    "long_name": "ENN Energy Holdings Limited",
    "market": "hk_market",
    "market_cap": "Large Cap",
    "sector": "Utilities",
    "short_name": "ENN ENERGY",
    "state": null,
    "summary": "ENN Energy Holdings Limited, an investment holding company, engages in the investment, construction, operation, and management of gas pipeline infrastructures; and integrated energy, and vehicle and ship refueling stations in the People's Republic of China. It operates through Retail Gas Sales Business, Integrated Energy Business, Wholesale of Gas, Construction and Installation, and Value Added Business segments. The company also sells and distributes piped gas, liquefied natural gas, and other multi-energy products; and provides other services in relation to energy supply. In addition, it is involved in the business of energy trading; retail of gas pipelines, and related materials and equipment; transportation of oil products and gas; and sourcing of compressed pipeline gas, as well as wholesale and retail of LNG, CNG, gas equipment, appliances, and others; and provision of financial services. As of December 31, 2020, the company served approximately 23.21 million residential customers and 177,128 commercial/industrial customers. The company was formerly known as XinAo Gas Holdings Limited and changed its name to ENN Energy Holdings Limited in September 2010. ENN Energy Holdings Limited was founded in 1992 and is headquartered in Langfang, China.",
    "website": "http://www.ennenergy.com",
    "zipcode": "065001"
  },
  "600333.SS": {
    "city": "Changchun",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Utilities - Regulated Gas",
    "long_name": "Changchun Gas Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "CHANGCHUN GAS CO",
    "state": null,
    "summary": "Changchun Gas Co., Ltd. provides gas to urban, industrial, commercial, automotive, and other end customers in China. It engages in the storage and transportation of natural gas; and operation of gas pipelines. The company was founded in 1924 and is based in Changchun, China.",
    "website": "http://www.ccrq.com.cn",
    "zipcode": null
  },
  "600635.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Utilities - Regulated Gas",
    "long_name": "Shanghai Dazhong Public Utilities(Group) Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "SHANGHAI DAZHONG PUBLIC UTILITI",
    "state": null,
    "summary": "Shanghai Dazhong Public Utilities (Group) Co., Ltd., an investment holding company, engages in the piped gas supply and wastewater treatment activities in the People's Republic of China. The company operates four segments: Piped Gas Supply; Wastewater Treatment; Public Infrastructure Projects; and Transportation Services. It sells, distributes, and supplies piped natural gas; constructs and installs gas pipelines; treats wastewater and handles urban wastewater; rents cars, taxies, and tourist cars; and offers freight transport, relocation, liquefied petroleum gas delivery, and tourism services, as well as operates Dazhong Chuxing platform that provides online car hailing services. The company also offers infrastructure investment, construction, operation maintenance, and protection services; public infrastructure project services; and transportation, storage and, postal services, as well as sells gas related products. In addition, it provides financial services, including financial leasing, pre-paid cards, etc.; and scientific research and technological services, as well as invests in venture capital enterprises. Further, the company engages in the municipal road operation; agriculture development; payment; assets management; and financial consultancy activities. It owns approximately 6,826 kilometers of underground pipelines; and 900 operating vehicles. The company was formerly known as Shanghai Pudong Dazhong Taxi Co., Ltd. and changed its name to Shanghai Dazhong Public Utilities (Group) Co., Ltd. in May 2003. The company was founded in 1991 and is based in Shanghai, the People's Republic of China.",
    "website": "http://www.dzug.cn",
    "zipcode": "200235"
  },
  "600681.SS": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Utilities - Regulated Gas",
    "long_name": "Bestsun Energy Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "BESTSUN ENERGY CO LTD",
    "state": null,
    "summary": "Bestsun Energy Co., Ltd. operates in the gas sector. The company sells natural gas and heating energy; and transports gas, as well as provides gas connections and appliances. It operates in the Hebei and Shaanxi provinces, as well as Tianjin, China. The company was formerly known as Wuhan Winowner Group Co., Ltd. and changed its name to Bestsun Energy Co., Ltd. in August 2004. Bestsun Energy Co., Ltd. was founded in 1992 and is based in Beijing, China.",
    "website": "http://www.bestsungas.com",
    "zipcode": null
  },
  "600856.SS": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Utilities - Regulated Gas",
    "long_name": "Zhongxing Tianheng Energy Technology (Beijing) Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "ZHONGXING TIANHENG ENERGY TECHN",
    "state": null,
    "summary": "Zhongxing Tianheng Energy Technology (Beijing) Co., Ltd. operates in the natural gas industry in China and internationally. The company produces and sells natural gases, such as CNG and LNG; invests in, constructs, and operates CNG refueling stations and substations, and LNG liquefaction plants and receiving stations; operates LNG storage and distribution stations, and gas supply stations; and develops and operates oil and gas assets internationally. It also engages in the crude oil refining activities. The company was formerly known as Changchun Sinoenergy Corporation and changed its name to Zhongxing Tianheng Energy Technology (Beijing) Co., Ltd. in October 2020. Zhongxing Tianheng Energy Technology (Beijing) Co., Ltd. is based in Beijing, China.",
    "website": "http://www.snencn.cn",
    "zipcode": null
  },
  "603080.SS": {
    "city": "Kashi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Utilities - Regulated Gas",
    "long_name": "Xinjiang Torch Gas Co., Ltd",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Utilities",
    "short_name": "XINJIANG TORCH GAS CO LTD",
    "state": null,
    "summary": "Xinjiang Torch Gas Co., Ltd engages in the natural gas transmission and distribution activities in China. The company also provides sales and home installation services. It owns approximately 120 kilometers of long-distance pipeline and 1 CNG parent station, as well as offers CNG refueling services. The company was founded in 2003 and is based in Kashi, China.",
    "website": "http://www.zw.org.cn/hjrq",
    "zipcode": "844000"
  },
  "603393.SS": {
    "city": "Urumqi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Utilities - Regulated Gas",
    "long_name": "Xinjiang Xintai Natural Gas Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "XINJIANG XINTAI NATURAL GAS CO ",
    "state": null,
    "summary": "Xinjiang Xintai Natural Gas Co., Ltd. engages in the transmission, distribution, and sale of natural gas in China. It serves civil, commercial, automotive, and industrial parks. The company was formerly known as Xinjiang Xintai Investment (Group) Co., Ltd. and changed its name to Xinjiang Xintai Natural Gas Co., Ltd. in December 2012. Xinjiang Xintai Natural Gas Co., Ltd. was founded in 2000 and is based in Urumqi, China.",
    "website": "http://www.xjxtrq.com",
    "zipcode": "831400"
  },
  "605368.SS": {
    "city": "Zhumadian City",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Utilities - Regulated Gas",
    "long_name": "Henan Lantian Gas Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "HENAN LANTIAN GAS CO LTD",
    "state": null,
    "summary": "Henan Lantian Gas Co.,Ltd. transports and sells natural gas pipelines. It also offers gas pipeline installation services. The company was founded in 2002 and is based in Zhumadian City, China. Henan Lantian Gas Co., Ltd. operates as a subsidiary of Henan Lantian Group CO.,LTD.",
    "website": "http://www.hnltrq.com.cn",
    "zipcode": "463000"
  },
  "9908.HK": {
    "city": "Jiaxing",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Utilities - Regulated Gas",
    "long_name": "JiaXing Gas Group Co., Ltd.",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Utilities",
    "short_name": "JIAXING GAS",
    "state": null,
    "summary": "JiaXing Gas Group Co., Ltd. operates as a piped natural gas (PNG) operator in the People's Republic of China. The company sells PNG, liquefied natural gas (LNG), and liquefied petroleum gas (LPG) to residential and non-residential users; provides construction and installation services for gas pipeline network and gas facilities to property developers and owners, or occupants of residential and non-residential properties; and distributes and sells gas pipes and equipment. It also provides gas technology consulting services; constructs and operates new energy facilities, as well as LNG storage and transportation station; transports LNG and compressed natural gas; sells vapour and construction materials; and leases properties. The company serves customers in the Jiaxing port and urban areas. JiaXing Gas Group Co., Ltd. was founded in 1998 and is headquartered in Jiaxing, the People's Republic of China.",
    "website": "http://www.jxrqgs.com",
    "zipcode": null
  },
  "AJ2.SI": {
    "city": "Chaozhou",
    "country": "China",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Utilities - Regulated Gas",
    "long_name": "Ouhua Energy Holdings Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Utilities",
    "short_name": "Ouhua Energy",
    "state": null,
    "summary": "Ouhua Energy Holdings Limited, an investment holding company, engages in the import, processing, and wholesale of liquefied petroleum gas (LPG) in the People's Republic of China. The company imports raw materials, including butane and propane, and processes these products into LPG; and purchases and sells LPG. It also exports its products to Vietnam, the Philippines, and Thailand in Southeast Asia. The company was founded in 2000 and is based in Chaozhou, the People's Republic of China. Ouhua Energy Holdings Limited is a subsidiary of High Tree Worldwide Ltd.",
    "website": "http://www.ohwa.com.sg",
    "zipcode": null
  },
  "CHNGQ": {
    "city": "Xi’an",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Regulated Gas",
    "long_name": "China Natural Gas, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Utilities",
    "short_name": "CHINA NATURAL GAS INC",
    "state": null,
    "summary": "China Natural Gas, Inc., an integrated natural gas operator, engages in the sale and distribution of natural gas and gasoline to commercial, industrial, and residential customers in the People's Republic of China. The company is primarily involved in the distribution of compressed natural gas (CNG) through its variable interest entity-owned CNG fueling stations. As of December 31, 2012, it operated 31 CNG fueling stations, including 20 CNG fueling stations in Shaanxi Province, 10 CNG fueling stations in Henan Province, and 1 CNG fueling station in Hubei Province. It also installs natural gas pipelines, as well as distributes and sells piped natural gas to residential and commercial customers through a high pressure pipeline network of approximately 120 kilometers in the city of Xi'an in Shaanxi Province, including Lantian County; the districts of Lintong and Baqiao in Shaanxi Province; and the city of Lingbao in Henan Province. As of the above date, the company had approximately 122,020 residential and commercial customers for its pipeline network, as well as operated 4 automobile conversion sites for converting gasoline-fueled vehicles to hybrid (natural gas/gasoline) powered vehicles. The company is based in Xi'an, the People's Republic of China. On July 2, 2014, the involuntary petition of China Natural Gas, Inc. for reorganization under Chapter 11 was converted to Chapter 7. The involuntary petition was filed under Chapter 11 on February 8, 2013.",
    "website": null,
    "zipcode": "710065"
  },
  "CNER": {
    "city": "Tianjin",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Regulated Gas",
    "long_name": "China New Energy Group Co.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Utilities",
    "short_name": "CHINA NEW ENERGY GROUP COMPANY",
    "state": null,
    "summary": "China New Energy Group Company, a natural gas company, engages in the development, construction, and operation of natural gas distribution networks. It also distributes natural gas to residential, industrial, and commercial customers in small and medium sized cities in China. The company owns the rights to develop distribution networks to provide natural gas in the cities of Dashiqiao, Nandaihe, Zhanhua, and Wuyuan. Its distribution networks provide natural gas to an aggregate of approximately 64,000 consumers. The company is headquartered in Tianjin, China.",
    "website": null,
    "zipcode": "300042"
  },
  "TLJ.F": {
    "city": "Zhengzhou",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Utilities - Regulated Gas",
    "long_name": "China Tian Lun Gas Holdings Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Utilities",
    "short_name": "CN TIAN LUN GAS HL.HD-,01",
    "state": null,
    "summary": "China Tian Lun Gas Holdings Limited, together with its subsidiaries, engages in the transportation, distribution, and sale of natural gas and compressed natural gas through its gas pipeline connections in the People' Republic of China. The company provides construction, designing, laying, installation, and maintenance services for gas pipeline connections. It also constructs and operates gas filling stations; produces and sells liquefied natural gas in bulk and in cylinders; sells gas equipment; provides engineering design and consulting, and new energy technology development services; trades in natural gas equipment; invests in equity and assets; and sells urban gas and gas appliances. The company serves to residential, vehicles, commercial, and industrial sectors. It owns 51 gas refilling stations. The company was founded in 2002 and is headquartered in Zhengzhou, the People's Republic of China. China Tian Lun Gas Holdings Limited is a subsidiary of Tian Lun Group Limited.",
    "website": "http://www.tianlungas.com",
    "zipcode": "450003"
  },
  "XGH.F": {
    "city": "Langfang",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Utilities - Regulated Gas",
    "long_name": "ENN Energy Holdings Limited",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Utilities",
    "short_name": "ENN ENERGY HLDGS  HD-,10",
    "state": null,
    "summary": "ENN Energy Holdings Limited, an investment holding company, engages in the investment, construction, operation, and management of gas pipeline infrastructures; and integrated energy, and vehicle and ship refueling stations in the People's Republic of China. It operates through Retail Gas Sales Business, Integrated Energy Business, Wholesale of Gas, Construction and Installation, and Value Added Business segments. The company also sells and distributes piped gas, liquefied natural gas, and other multi-energy products; and provides other services in relation to energy supply. In addition, it is involved in the business of energy trading; retail of gas pipelines, and related materials and equipment; transportation of oil products and gas; and sourcing of compressed pipeline gas, as well as wholesale and retail of LNG, CNG, gas equipment, appliances, and others; and provision of financial services. As of December 31, 2020, the company served approximately 23.21 million residential customers and 177,128 commercial/industrial customers. The company was formerly known as XinAo Gas Holdings Limited and changed its name to ENN Energy Holdings Limited in September 2010. ENN Energy Holdings Limited was founded in 1992 and is headquartered in Langfang, China.",
    "website": "http://www.ennenergy.com",
    "zipcode": "065001"
  },
  "XNGSF": {
    "city": "Langfang",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Regulated Gas",
    "long_name": "ENN Energy Holdings Limited",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Utilities",
    "short_name": "ENN ENERGY HOLDINGS LTD",
    "state": null,
    "summary": "ENN Energy Holdings Limited, an investment holding company, engages in the investment, construction, operation, and management of gas pipeline infrastructures; and integrated energy, and vehicle and ship refueling stations in the People's Republic of China. It operates through Retail Gas Sales Business, Integrated Energy Business, Wholesale of Gas, Construction and Installation, and Value Added Business segments. The company also sells and distributes piped gas, liquefied natural gas, and other multi-energy products; and provides other services in relation to energy supply. In addition, it is involved in the business of energy trading; retail of gas pipelines, and related materials and equipment; transportation of oil products and gas; and sourcing of compressed pipeline gas, as well as wholesale and retail of LNG, CNG, gas equipment, appliances, and others; and provision of financial services. As of December 31, 2020, the company served approximately 23.21 million residential customers and 177,128 commercial/industrial customers. The company was formerly known as XinAo Gas Holdings Limited and changed its name to ENN Energy Holdings Limited in September 2010. ENN Energy Holdings Limited was founded in 1992 and is headquartered in Langfang, China.",
    "website": "http://www.ennenergy.com",
    "zipcode": "065001"
  },
  "XNGSY": {
    "city": "Langfang",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Utilities - Regulated Gas",
    "long_name": "ENN Energy Holdings Limited",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Utilities",
    "short_name": "ENN ENERGY HOLDINGS LTD",
    "state": null,
    "summary": "ENN Energy Holdings Limited, an investment holding company, engages in the investment, construction, operation, and management of gas pipeline infrastructures; and integrated energy, and vehicle and ship refueling stations in the People's Republic of China. It operates through Retail Gas Sales Business, Integrated Energy Business, Wholesale of Gas, Construction and Installation, and Value Added Business segments. The company also sells and distributes piped gas, liquefied natural gas, and other multi-energy products; and provides other services in relation to energy supply. In addition, it is involved in the business of energy trading; retail of gas pipelines, and related materials and equipment; transportation of oil products and gas; and sourcing of compressed pipeline gas, as well as wholesale and retail of LNG, CNG, gas equipment, appliances, and others; and provision of financial services. As of December 31, 2020, the company served approximately 23.21 million residential customers and 177,128 commercial/industrial customers. The company was formerly known as XinAo Gas Holdings Limited and changed its name to ENN Energy Holdings Limited in September 2010. ENN Energy Holdings Limited was founded in 1992 and is headquartered in Langfang, China.",
    "website": "http://www.ennenergy.com",
    "zipcode": "065001"
  }
}
