{
    "GPRC": {
        "short_name": "GUANWEI RECYCLING CORP",
        "long_name": "Biochar Now, Inc.",
        "summary": "Guanwei Recycling Corp. manufactures and distributes low density polyethylene (LDPE) and other recycled plastics products primarily in the People's Republic of China and internationally. It imports and recycles LDPE plastic scrap material into granular plastic for use in the manufacture of various consumer products. The company's LDPE products are used in the manufacture of chemical and functional fibers, as well as a raw material in the manufacture of shoe soles, insulation materials, fire-proofing and water-proofing materials, and foam. It also sells its products to customers in a range of industries, including shoe manufacturing, architecture and engineering products, industrial equipment and supplies, and chemical and petrochemical manufacturing. Guanwei Recycling Corp. was founded in 2005 and is based in Fuqing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Fuqing",
        "zipcode": "350301",
        "website": null,
        "full_time_employees": 540
    },
    "TIA.F": {
        "short_name": "TIANJIN CAP. H  YC 1",
        "long_name": "Tianjin Capital Environmental Protection Group Company Limited",
        "summary": "Tianjin Capital Environmental Protection Group Company Limited, together with its subsidiaries, engages in the sewage treatment and construction of the sewage treatment plants in the People's Republic of China. The company operates through Processing of Sewage Water; Recycled Water; Pipeline Connection; Heating and Cooling Service; Sales of Tap Water; Sale of Environmental Protection Equipment; and All Other segments. It also provides toll collection and engineering consulting services; environment governance, technical consulting services, etc.; technical consulting for water recycling business; and energy saving and research, consulting and transfer, and property management services, as well as invests in construction projects. The company was founded in 1993 and is based in Tianjin, the People's Republic of China. Tianjin Capital Environmental Protection Group Company Limited is a subsidiary of Tianjin Municipal Investment Company Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300381",
        "website": "http://www.tjcep.com",
        "full_time_employees": null
    },
    "TNJIF": {
        "short_name": "TIANJIN CAP ENVIRONMTL PROTECT ",
        "long_name": "Tianjin Capital Environmental Protection Group Company Limited",
        "summary": "Tianjin Capital Environmental Protection Group Company Limited, together with its subsidiaries, engages in the sewage treatment and construction of the sewage treatment plants in the People's Republic of China. The company operates through Processing of Sewage Water; Recycled Water; Pipeline Connection; Heating and Cooling Service; Sales of Tap Water; Sale of Environmental Protection Equipment; and All Other segments. It also provides toll collection and engineering consulting services; environment governance, technical consulting services, etc.; technical consulting for water recycling business; and energy saving and research, consulting and transfer, and property management services, as well as invests in construction projects. The company was founded in 1993 and is based in Tianjin, the People's Republic of China. Tianjin Capital Environmental Protection Group Company Limited is a subsidiary of Tianjin Municipal Investment Company Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300381",
        "website": "http://www.tjcep.com",
        "full_time_employees": null
    },
    "TRITF": {
        "short_name": "TRI-TECH HOLDING INC",
        "long_name": "Tri-Tech Holding Inc.",
        "summary": "Tri-Tech Holding Inc. provides consulting, engineering, procurement, construction, and technical services. Its Water, Wastewater Treatment and Municipal Infrastructure segment procures and constructs build-transfer processing equipment and processing control systems for the municipal water supply and distribution, wastewater treatment, and gray water recycling activities; and offers municipal facilities engineering and operation management services for related infrastructure construction projects. The company's Industrial Pollution Control and Safety segment provides systems for volatile organic compounds abatement, odor control, water and wastewater treatment, water recycling facilities design, engineering, procurement, and construction for oil, gas, petrochemical, and power industries. The company serves government, state-owned entities, and commercial clients. Tri-Tech Holding Inc. was incorporated in 2002 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.tri-tech.cn",
        "full_time_employees": 286
    },
    "U9E.SI": {
        "short_name": "China Everbright",
        "long_name": "China Everbright Water Limited",
        "summary": "China Everbright Water Limited, an investment holding company, provides water environmental management services in Mainland China and Germany. It offers municipal waste water treatment, industrial waste water treatment, water supply, reusable water, sludge harmless treatment, sponge city construction and operation, river-basin ecological restoration, waste water source heat pump, leachate treatment, and engineering construction, as well as researches and develops water environment technologies. The company also provides project investment, planning and design, and operations management services; investment and investment management, business development and management, and pipeline network construction and maintenance services; and survey, mapping, design, and consultancy services for municipal projects. As of December 31, 2020, it invested in and operated water treatment projects with a designed daily waste water treatment capacity of approximately 6.5 m3. The company is based in Shenzhen, the People's Republic of China. China Everbright Water Limited is a subsidiary of China Everbright Water Holdings Limited.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518000",
        "website": "http://www.ebwater.com",
        "full_time_employees": 2231
    }
}