{
    "APTVN.MX": {
        "short_name": "APTIV PLC",
        "long_name": "Aptiv PLC",
        "summary": "Aptiv PLC designs, manufacturers, and sells vehicle components worldwide. The company provides electrical, electronic, and safety technology solutions to the automotive and commercial vehicle markets. It operates through two segment, Signal and Power Solutions, and Advanced Safety and User Experience. The Signal and Power Solutions segment designs, manufactures, and assembles vehicle's electrical architecture, including engineered component products, connectors, wiring assemblies and harnesses, cable management products, electrical centers, and hybrid high voltage and safety distribution systems. The Advanced Safety and User Experience segment provides critical components, systems integration, and software development for vehicle safety, security, comfort, and convenience, such as sensing and perception systems, electronic control units, multi-domain controllers, vehicle connectivity systems, application software, and autonomous driving technologies. The company was formerly known as Delphi Automotive PLC and changed its name to Aptiv PLC in December 2017. Aptiv PLC is headquartered in Dublin, Ireland.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Ireland",
        "city": "Dublin"
    },
    "ATAR": {
        "short_name": "AVATAR VENTURES",
        "long_name": "Avatar Ventures Corp.",
        "summary": "Avatar Ventures Corp., a development stage company, focuses on developing aftermarket electronic accessories for consumer motor vehicles in China. The company is developing a cellular phone car adapter that enables cellular text messages and wireless emails to be displayed on a small liquid crystal display screen attached to the car's dashboard area. It also develops mobile marketing solutions, ranging from simple text messaging campaigns to robust mobile applications. In addition, the company develops iText Direct, a proprietary SMS solution; and a mobile Website intended to assist clients in navigating existing mobile Websites and/or build new mobile Websites. Avatar Ventures Corp. was founded in 2006 and is based in Carson City, Nevada.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Carson City"
    },
    "CIEAN.MX": {
        "short_name": "CIE AUTOMOTIVE SA",
        "long_name": "CIE Automotive, S.A.",
        "summary": "CIE Automotive, S.A. designs, manufactures, and sells automotive components and sub-assemblies worldwide. It offers roof systems, including opening roof, shading, and glazing systems; BIW, chassis, and steering products, such as body in white, hubs, outer rings and spindles, steering column brackets, EPS main housings and components, steering nuts, airbag frames, steering housings, brake boosters, steering column tubes, rear axles, and seat structures; and exterior/interior trim products comprising arm rests, storage compartments, central consoles, ashtrays, glove compartments, in mold decorations, trim parts, emblems, rear-view mirrors, crossbeams, and front covers. The company also provides axle beams and spindles, brake camshafts, axle shafts, rear axle assemblies, pistons, levers, air suspension brackets, spindles, stabilizer bars, and sector shafts; and engine products, including crankshafts, crankshaft caps, diesel and gasoline common rails, ladder frames, camshaft covers and bearings, camshaft bearings housings, valve guides, brackets, exhaust air duct tubes, air tanks, and oil pans. In addition, it offers transmission and gearbox products, such as mechanical and gearbox housings, clutch and transmission housings, pistons, gearbox components and oil pans, differential cases, planetary carriers, flanges, axle shafts, CVT and hybrid components, crowns, and forging parts for CV-joints. Further, the company is involved in the services and installations, waste management and recovery, scrap, real estate, electricity production and sale, agro-biotechnology, fatty oils marketing, and biofuel production and sale businesses. It offers its products to original equipment manufacturers and TIER-1 suppliers. CIE Automotive, S.A. was founded in 1996 and is headquartered in Bilbao, Spain.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Spain",
        "city": "Bilbao"
    },
    "FARE": {
        "short_name": "WORLD MOTO INC",
        "long_name": "World Moto, Inc.",
        "summary": "World Moto, Inc. designs, manufactures, markets, and sells moto-meter products and services primarily in Thailand. Its principal product is the moto-meter, which provides moto-taxi fare metering and other communication capabilities. The company also develops moto-meter related smartphone application, which connects directly to the moto-meter through a secure Bluetooth connection and can access real-time data from the moto-meter, and enables customers to view driver profiles and ratings before getting on a motorcycle taxi. In addition, it develops Yes, a concierge service that enables persons to order products and have them delivered to their address by motor scooter; and HailYes, an integrated mobile platform, which instantly connects consumers to transport and commerce services in a local community, as well as Wheelies, an advertising product that displays static and streaming media on the wheels of motorcycles and automobiles. The company markets its products through social media, direct sales, and trade shows. World Moto, Inc. is based in Bangkok, Thailand.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "FRTN.MX": {
        "short_name": "VALEO",
        "long_name": "Valeo SA",
        "summary": "Valeo SA designs, produces, and sells components, integrated systems, modules, and services for the automotive sector in France, North America, South America, Asia, Africa, and other European countries. The company operates through four segments: Comfort & Driving Assistance Systems, Powertrain Systems, Thermal Systems, and Visibility Systems. It offers parking and driving assistance products, such as ultrasonic sensors, radars, and cameras to detect obstacles around vehicles; intuitive control products; and a range of connectivity solutions from short-range to long-range connectivity, as well as develops systems that enable the integration of applications, such as car sharing services and remote parking systems. The company also provides powertrain systems, including electric powertrain systems for electric cars; products, such as torque converters, dual dry and wet clutches, and hydraulic actuators that enable the automation of transmissions to reduce fuel consumption and enhance driving comfort; and clean engines for vehicles. In addition, it designs and manufactures systems, modules, and components to optimize thermal management of vehicles and passenger comfort in the cabin, including heating ventilation and air conditioning systems. Further, the company designs and produces lighting and wiper systems for drivers in all weather conditions. In addition, it offers original equipment spares to auto manufacturers; and replacement parts and accessories to independent aftermarket for passenger cars and commercial vehicles. Valeo SA was founded in 1923 and is headquartered in Paris, France.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "France",
        "city": "Paris"
    },
    "GTX.DE": {
        "short_name": "GENTEX CORP.  DL-,06",
        "long_name": "Gentex Corporation",
        "summary": "Gentex Corporation provides digital vision, connected car, dimmable glass, and fire protection products worldwide. It operates through Automotive Products and Other segments. The company designs, develops, manufactures, and markets automotive products, including interior and exterior electrochromic automatic-dimming rearview mirrors, automotive electronics, and non-automatic-dimming rearview mirrors for automotive passenger cars, light trucks, pick-up trucks, sport utility vehicles, and vans for original equipment manufacturers, automotive suppliers, and various aftermarket and accessory customers. It also manufactures and sells variable dimmable windows to aircraft manufacturers and airline operators. In addition, the company provides photoelectric smoke detectors and alarms, electrochemical carbon monoxide detectors and alarms, audible and visual signaling alarms, and bells and speakers used in fire detection systems in office buildings, hotels, and other commercial and residential establishments. It sells its fire protection products directly, as well as through sales managers and manufacturer representative organizations to fire protection and security product distributors, electrical wholesale houses, and original equipment manufacturers of fire protection systems. Gentex Corporation was founded in 1974 and is headquartered in Zeeland, Michigan.",
        "currency": "EUR",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Zeeland"
    }
}