{
    "0RT7.L": {
        "short_name": "TENNECO INC TENNECO ORD SHS",
        "long_name": "Tenneco Inc.",
        "summary": "Tenneco Inc. designs, manufactures, and sells clean air, powertrain, and ride performance products and systems for light vehicle, commercial truck, off-highway, industrial, and aftermarket customers worldwide. The company operates through Clean Air, Powertrain, Ride Performance, and Motorparts segments. It offers clean air products and systems, including catalytic converters and diesel oxidation catalysts; diesel particulate filters(DPFs); burner systems; lean nitrogen oxide (NOx) traps; selective catalytic reduction (SCR) systems; hydrocarbon vaporizers and injectors; SCR-coated diesel particulate filters systems; urea dosing systems; four-way catalysts; alternative NOx reduction technologies; mufflers and resonators; fabricated exhaust manifolds; pipes; hydroformed assemblies; elastomeric hangers and isolators; and aftertreatment control units. The company also provides powertrain products and systems, such as pistons; piston rings; cylinder liners; valve seats and guides; bearings; spark plugs; valvetrain products; system protection products; and seals and gaskets. In addition, it offers motor parts, including steering and suspension, braking, sealing, engine, emission, and maintenance products, as well as shocks and struts; and ride performance products and systems comprising advanced suspension technologies, and ride control and braking products, as well as noise, vibration, and harshness performance materials. The company was formerly known as Tenneco Automotive Inc. and changed its name to Tenneco Inc. in 2005. Tenneco Inc. was founded in 1996 and is headquartered in Lake Forest, Illinois.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United States",
        "state": "IL",
        "city": "Lake Forest",
        "zipcode": "60045",
        "website": "http://www.tenneco.com",
        "market_cap": 1757274240
    },
    "APTVN.MX": {
        "short_name": "APTIV PLC",
        "long_name": "Aptiv PLC",
        "summary": "Aptiv PLC designs, manufacturers, and sells vehicle components worldwide. The company provides electrical, electronic, and safety technology solutions to the automotive and commercial vehicle markets. It operates through two segment, Signal and Power Solutions, and Advanced Safety and User Experience. The Signal and Power Solutions segment designs, manufactures, and assembles vehicle's electrical architecture, including engineered component products, connectors, wiring assemblies and harnesses, cable management products, electrical centers, and hybrid high voltage and safety distribution systems. The Advanced Safety and User Experience segment provides critical components, systems integration, and software development for vehicle safety, security, comfort, and convenience, such as sensing and perception systems, electronic control units, multi-domain controllers, vehicle connectivity systems, application software, and autonomous driving technologies. The company was formerly known as Delphi Automotive PLC and changed its name to Aptiv PLC in December 2017. Aptiv PLC was founded in 2011 and is headquartered in Dublin, Ireland.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.aptiv.com",
        "market_cap": 821604843520
    },
    "ATAR": {
        "short_name": "AVATAR VENTURES",
        "long_name": "Avatar Ventures Corp.",
        "summary": "Avatar Ventures Corp., a development stage company, focuses on developing aftermarket electronic accessories for consumer motor vehicles in China. The company is developing a cellular phone car adapter that enables cellular text messages and wireless emails to be displayed on a small liquid crystal display screen attached to the car's dashboard area. It also develops mobile marketing solutions, ranging from simple text messaging campaigns to robust mobile applications. In addition, the company develops iText Direct, a proprietary SMS solution; and a mobile Website intended to assist clients in navigating existing mobile Websites and/or build new mobile Websites. Avatar Ventures Corp. was founded in 2006 and is based in Carson City, Nevada.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Carson City",
        "zipcode": "89703",
        "website": "http://www.avatarventurescorp.com",
        "market_cap": 10300
    },
    "CIEAN.MX": {
        "short_name": "CIE AUTOMOTIVE SA",
        "long_name": "CIE Automotive, S.A.",
        "summary": "CIE Automotive, S.A. designs, manufactures, and sells automotive components and sub-assemblies worldwide. It offers roof systems, including opening roof, shading, and glazing systems; BIW, chassis, and steering products, such as body in white, hubs, outer rings and spindles, steering column brackets, EPS main housings and components, steering nuts, airbag frames, steering housings, brake boosters, steering column tubes, rear axles, and seat structures; and exterior/interior trim products comprising arm rests, storage compartments, central consoles, ashtrays, glove compartments, in mold decorations, trim parts, emblems, rear-view mirrors, crossbeams, and front covers. The company also provides axle beams and spindles, brake camshafts, axle shafts, rear axle assemblies, pistons, levers, air suspension brackets, spindles, stabilizer bars, and sector shafts; and engine products, including crankshafts, crankshaft caps, diesel and gasoline common rails, ladder frames, camshaft covers and bearings, camshaft bearings housings, valve guides, brackets, exhaust air duct tubes, air tanks, and oil pans. In addition, it offers transmission and gearbox products, such as mechanical and gearbox housings, clutch and transmission housings, pistons, gearbox components and oil pans, differential cases, planetary carriers, flanges, axle shafts, CVT and hybrid components, crowns, and forging parts for CV-joints. Further, the company is involved in the services and installations, waste management and recovery, scrap, real estate, electricity production and sale, agro-biotechnology, fatty oils marketing, and biofuel production and sale businesses. It offers its products to original equipment manufacturers and Tier-1 suppliers. CIE Automotive, S.A. was incorporated in 1949 and is headquartered in Bilbao, Spain.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Spain",
        "state": null,
        "city": "Bilbao",
        "zipcode": "48009",
        "website": "http://www.cieautomotive.com",
        "market_cap": 72202043392
    },
    "FARE": {
        "short_name": "WORLD MOTO INC",
        "long_name": "World Moto, Inc.",
        "summary": "World Moto, Inc. designs, manufactures, markets, and sells moto-meter products and services primarily in Thailand. Its principal product is the moto-meter, which provides moto-taxi fare metering and other communication capabilities. The company also develops moto-meter related smartphone application, which connects directly to the moto-meter through a secure Bluetooth connection and can access real-time data from the moto-meter, and enables customers to view driver profiles and ratings before getting on a motorcycle taxi. In addition, it develops Yes, a concierge service that enables persons to order products and have them delivered to their address by motor scooter; and HailYes, an integrated mobile platform, which instantly connects consumers to transport and commerce services in a local community, as well as Wheelies, an advertising product that displays static and streaming media on the wheels of motorcycles and automobiles. The company markets its products through social media, direct sales, and trade shows. World Moto, Inc. is based in Bangkok, Thailand.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": null,
        "market_cap": 149014
    },
    "HARITASEAT.NS": {
        "short_name": "HARITA SEATING SYS",
        "long_name": "Harita Seating Systems Limited",
        "summary": "Harita Seating Systems Limited provides seating solutions for automotive industry in India. It offers driver and cabin seating solutions for commercial vehicles, tractors, off-road vehicles, original equipment manufacturers, and construction equipment; and passenger seats for buses. The company also manufactures and sells seat foams. It also exports its products. Harita Seating Systems Limited was founded in 1988 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Consumer Goods",
        "industry": "Auto Parts",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600006",
        "website": "http://www.haritaseating.com",
        "market_cap": 5975178752
    }
}