{"GPRO.MX": {"short_name": "GOPRO INC.", "long_name": "GoPro, Inc.", "summary": "GoPro, Inc. develops and sells cameras, drones, and mountable and wearable accessories in the United States and internationally. The company offers cloud connected HERO7 Silver, HERO7 Black, and HERO8 Black waterproof cameras; MAX, a 360-degree waterproof camera; GoPro Plus, a cloud-based storage solution that enables subscribers to access, edit, and share content; Quik, a desktop editing application; and GoPro App, a mobile app that uploads a user's GoPro photos and video clips to a smartphone, as well as allows users to mix and match filters for a customizable editing experience. It also offers mounts and accessories comprising equipment-based mounts consisting of helmet, handlebar, roll bar, and tripod mounts that enable consumers to wear the mount on their bodies, such as wrist housings, chest harnesses, and head straps; and colored camera sleeves, spare batteries, dive filters, and charging accessories and cables. GoPro, Inc. markets and sells its products through retailers and distributors, as well as through its Website. The company was formerly known as Woodman Labs, Inc. and changed its name to GoPro, Inc. in February 2014. GoPro, Inc. was founded in 2004 and is headquartered in San Mateo, California.", "currency": "MXN", "sector": "Consumer Goods", "industry": "Electronic Equipment", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "San Mateo"}, "SCE.DE": {"short_name": "SCHWEIZER ELECTR. NA O.N.", "long_name": "Schweizer Electronic AG", "summary": "Schweizer Electronic AG, together with its subsidiaries, develops, produces, and distributes printed circuit boards (PCBs) worldwide. The company offers sportive PCBs; and power electronics, including heavy copper, inlay, power combi, and IMS boards. It also provides embedding products and solutions, such as integrated interposer board for the embedding of logic semiconductors; power PCB; cavity boards for various solutions; and ÂµÂ² Pack for smallest, thinnest, and multi-chip semiconductor packages, as well as modules with direct pad contacting. In addition, the company offers system cost reduction solutions, including FR4 Flex with restricted installation possibilities; resistor print for integration of resistors as a passive component through thick-film technology carried out by screen printing process; high frequency PCBs for safety engineering for vehicles; electroless nickel-electroless palladium-autocatalytic gold surface finishes for automotive and industrial applications; and all in one PCBs for power electronics, embedding, and system cost reduction applications. It provides its products for the automotive, solar, aviation, and general industries; and electronic control units, motor drives, DC/DC and AC/DC converters, and consumer and mobile applications, as well as semiconductor packaging. Schweizer Electronic AG was founded in 1849 and is headquartered in Schramberg, Germany.", "currency": "EUR", "sector": "Consumer Goods", "industry": "Electronic Equipment", "exchange": "GER", "market": "de_market", "country": "Germany", "city": "Schramberg"}}