{
  "MSHOP.AT": {
    "city": "Chios",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "Personal Products",
    "long_name": "Mediterra S.A.",
    "market": "gr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Goods",
    "short_name": "MEDITERRA S.A. (CR)",
    "state": null,
    "summary": "Mediterra S.A. engages in retail business activities in Greece and internationally. The company's stores offer traditional products, such as loukoums, taffy sweets, fruit preserves in syrup, cookies, candies, and traditional sweets; snacks and chocolates; Mastiha chewing gums and breakfast products; grocery, including cereals, pasta products, dips, jams, spreads, olives and olive oil products, salty flavors, and salads; Mastiha liqueur and wines; cosmetics, parapharmaceutical products, and publications and gifts; and organic products. It operates 16 stores under the mastihashop brand. The company was founded in 2002 and is headquartered in Chios, Greece. Mediterra S.A. is a subsidiary of Chios Mastiha Growers Association.",
    "website": "http://www.mastihashop.com",
    "zipcode": "821 00"
  },
  "PAP.AT": {
    "city": "Chalcis",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "Personal Products",
    "long_name": "Papoutsanis S.A.",
    "market": "gr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Goods",
    "short_name": "PAPOUTSANIS S.A.",
    "state": null,
    "summary": "Papoutsanis S.A. produces and sells body, face, and hair care products in Greece and internationally. The company offers shower gels, shampoos, hand washes, face cleansers, hand and body lotions, body oils, hair conditioners, hair masks and oils, hand creams, soaps, bathing and shaving foams, liquid soaps, antiseptic hand gels, fragrances, and soap noodles, as well as accessories, such as paper cases, dental and shaving kits, shower and bath caps, sewing kits, vanity sets, nail files, cotton tips and pads, class caps, stirrers, shoe-shine sponges, bath sponges, slippers, and display stands. The company offers its products under the Olivia, HAIRCHIC, KARAVAKI, Aromatics, Natura, Green Olive Soap, Glycerine Soap, L'OCCITANE Hotel ?menities, Korres, Sarbacane, Olive Care, Olivia Fusion, Skin Essentials, For Kids, Ahava, Eau De Grece, and SOAP NOODLES brands. It also exports to Europe, America, Asia and Oceania. The company was formerly known as Plias SA. Papoutsanis S.A. was founded in 1870 and is based in Chalkida, Greece.",
    "website": "http://www.papoutsanis.gr",
    "zipcode": "34100"
  },
  "RBN.MX": {
    "city": "Slough",
    "country": "United Kingdom",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Personal Products",
    "long_name": "Reckitt Benckiser Group plc",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Goods",
    "short_name": "RECKITT BENCKISER GROUP PLC",
    "state": null,
    "summary": "Reckitt Benckiser Group plc manufactures, markets, and sells health, hygiene, and nutrition products in the United Kingdom, the United States, China, and internationally. The company offers acne treatment creams, facial washes, and cleansing pads; disinfection, hygiene, and first aid products; condoms, sex toys, and lubricants; heartburn and indigestion solutions; and cough and chest congestion, multi-symptom, and sinus remedies for adults and children under the Clearasil, Dettol, Durex, Gaviscon, and Mucinex brands. It also provides analgesics; footcare products; sore throat medications; and hair removal products under the Nurofen, Scholl, Strepsils, and Veet brands. In addition, the company offers fragrances and devices; water softeners; home cleaning products; dish washes; toilet bowl cleaners; disinfectants; sprays, baits, and plug-ins for pest control; stain removals; fabric washing; and other hygiene products under the Air Wick, Calgon, Cillit Bang, Finish, Veja, Harpic, Lysol, Mortein, Vanish, and Woolite brands, as well as infant and child nutrition products, adult nutrition products, and a range of vitamins, minerals, and supplements under the Enfamil, Airborne, Mead Johnson, Move Free, Schiff, and Nutramigen brands. The company was founded in 1819 and is headquartered in Slough, the United Kingdom.",
    "website": "http://www.reckitt.com",
    "zipcode": "SL1 3UH"
  },
  "SAR.AT": {
    "city": "Athens",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "Personal Products",
    "long_name": "Gr. Sarantis S.A.",
    "market": "gr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Goods",
    "short_name": "GR. SARANTIS S.A. (CR)",
    "state": null,
    "summary": "Gr. Sarantis S.A., together with its subsidiaries, produces and trades in cosmetics, household products, and parapharmaceutical items in Greece. It operates through four segments: Mass Market Cosmetics, Household Products, Other Sales, and Private Label Products. The company provides personal care products, including baby care, baby wash, grooming, hair care, hair colorant, hair styling, hand wash, oral care, personal hygiene, shaving, skin care, and sun care products, as well as deodorants and fragrances; and home care products, such as bathroom cleaner, cleaning tool, dishwashing, drainer care, food packaging, insect control, septic tank activator, and shoe care products, as well as garbage bags. It also offers health care products comprising food supplements, health and self care products, and skin and sun care products; cosmetics, including candle, make up, treatment, and home and other fragrance products; and professional products, such as cleaning tools, detergents, garbage bags, and food and other packaging products. The company offers its products through hypermarkets, supermarkets, groceries, beauty shops, and pharmacies. Gr. Sarantis S.A. exports its products to approximately 50 countries. The company was founded in 1930 and is headquartered in Athens, Greece.",
    "website": "http://sarantisgroup.com",
    "zipcode": "151 25"
  },
  "YALCO.AT": {
    "city": "Kifissia",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "Personal Products",
    "long_name": "YALCO - Socrates D. Constantinou & Son S.A.",
    "market": "gr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Goods",
    "short_name": "YALCO - CONSTANTINOY S.A. (CR)",
    "state": null,
    "summary": "YALCO - Socrates D. Constantinou & Son S.A. distributes and supplies household and hotel equipment in Greece. It offers porcelain products that include glassware, cutlery, kitchen utensils, and table accessories under IONIA name; and operates retail outlets, as well as manufactures nonstick aluminum cookware products under Fest name. The company also provides professional equipment for tabletop, buffet, kitchen, lobby, room service, and conference. It serves customers through department stores, hypermarkets, supermarkets, and independent retailers. The company also exports its products to 35 countries. YALCO - Socrates D. Constantinou & Son S.A. was founded in 1920 and is headquartered in Kifissia, Greece.",
    "website": "http://www.yalco.gr",
    "zipcode": "14564"
  }
}
