{"ASCO.AT": {"short_name": "A.S. COMPANY S.A. (CR)", "long_name": "As Commercial Industrial Company of Computers and Toys S.A.", "summary": "As Commercial Industrial Company of Computers and Toys S.A. manufactures, imports, and trades in toys for various ages in Greece and internationally. It offers approximately 1,500 game codes. The company also sells its products online. In addition, it is involved in the wholesale trade of toys and computers; and import of kids clothing. The company was founded in 1990 and is headquartered in Thessaloniki, Greece.", "currency": "EUR", "sector": "Consumer Goods", "industry": "Recreational Goods, Other", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Thessaloniki"}, "BELA.AT": {"short_name": "JUMBO S.A. (CR)", "long_name": "Jumbo S.A.", "summary": "Jumbo S.A. engages in the retail of toys, baby products, gift articles, household products, stationery, seasonal and decoration items, books, and related products. As of December 31, 2019, the company operated 80 stores, including 52 stores in Greece, 5 stores in Cyprus, 9 stores in Bulgaria, and 14 stores in Romania. It also operates e-jumbo, an on line store. In addition, the company is involved in the wholesale of toys and related products to third parties. Jumbo S.A. was founded in 1986 and is headquartered in Athens, Greece.", "currency": "EUR", "sector": "Consumer Goods", "industry": "Recreational Goods, Other", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Athens"}, "BKNG.MX": {"short_name": "BOOKING HOLDINGS INC", "long_name": "Booking Holdings Inc.", "summary": "Booking Holdings Inc. provides travel and restaurant online reservation and related services worldwide. The company operates Booking.com, which connects travellers with a selection of places to stay, including apartments, vacation homes, family-run B&Bs, 5-star luxury resorts, tree houses, and igloos; and KAYAK that searches other sites to show travellers the information they need to find the right flights, hotels, rental cars, and vacation packages. It also operates Priceline, an online travel deal service, which provides travellers to save on hotel rooms, airline tickets, rental cars, vacation packages, and cruises; Agoda, which provides online accommodation reservation services. In addition, the company operates Rentalcars.com that offers online rental car reservation services; and OpenTable, an online provider of restaurant reservation services to consumers and restaurant reservation management services to restaurants. Further, it offers travel-related insurance products. The company was formerly known as The Priceline Group Inc. and changed its name to Booking Holdings Inc. in February 2018. Booking Holdings Inc. was founded in 1997 and is headquartered in Norwalk, Connecticut.", "currency": "MXN", "sector": "Consumer Goods", "industry": "Recreational Goods, Other", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Norwalk"}, "EXPE.MX": {"short_name": "EXPEDIA GROUP INC", "long_name": "Expedia Group, Inc.", "summary": "Expedia Group, Inc. operates as an online travel company worldwide. It operates through four segments: Core Online Travel Agencies, Trivago, Vrbo, and Egencia. Its brand portfolio include Brand Expedia, a full-service online travel brand with localized websites; Hotels.com for marketing and distributing lodging accommodations; Vrbo, an online marketplace for the alternative accommodations; Expedia Partner Solutions, a business-to-business brand that provides travel offerings for various airlines and hotels, online and offline travel agencies, loyalty and corporate travel companies, and various consumer brands; and Egencia, which provides corporate travel management services. The company's brand portfolio also comprise Orbitz, Travelocity, and CheapTickets travel Websites; ebookers, a full-service travel brand; Hotwire, an online travel Website; Expedia Group Media Solutions that provides media partnerships and digital marketing solutions; trivago, an online hotel metasearch platform; and Expedia Local Expert, a provider of online and in-market concierge services, activities, experiences, and ground transportation. In addition, its brand portfolio consists of CarRentals.com, an online car rental booking service; Classic Vacations, a luxury travel specialist; Expedia CruiseShipCenters, a provider of advice for travelers booking cruises and vacations; and SilverRail, a provider of a rail retail and distribution platform connecting rail carriers and suppliers to online and offline travel distributors. Further, the company provides online travel services through its Wotif.com, lastminute.com.au, travel.com.au, Wotif.co.nz, and lastminute.co.nz brands; loyalty programs; and advertising and media services. It serves leisure and corporate travelers. The company was formerly known as Expedia, Inc. and changed its name to Expedia Group, Inc. in March 2018. Expedia Group, Inc. was founded in 1996 and is headquartered in Seattle, Washington.", "currency": "MXN", "sector": "Consumer Goods", "industry": "Recreational Goods, Other", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Seattle"}, "KYRI.AT": {"short_name": "KIRIAKOULIS SHIPPING S.A.", "long_name": "Kiriacoulis Mediterranean Cruises Shipping SA", "summary": "Kiriacoulis Mediterranean Cruises Shipping SA, together with its subsidiaries, engages in the professional sea tourism, tourist ports management, and real estate businesses. It offers yacht chartering services, flotillas, bareboat chartering services, crew chartering services, etc. The company also sells new and second hand yachts, including sailboats, monohulls, catamarans, and motorboats, as well as provides parking spaces. It operates through a fleet of approximately 270 owned and managed yachts in Greece, Italy, Croatia, France, Malta, Spain, the Caribbean, and internationally. The company was founded in 1980 and is headquartered in Athens, Greece.", "currency": "EUR", "sector": "Consumer Goods", "industry": "Recreational Goods, Other", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Athens"}, "NCLHN.MX": {"short_name": "NORWEGIAN CRUISE LINE HLDGS LTD", "long_name": "Norwegian Cruise Line Holdings Ltd.", "summary": "Norwegian Cruise Line Holdings Ltd., together with its subsidiaries, operates as a cruise company in the North America, Europe, the Asia-Pacific, and internationally. The company operates the Norwegian Cruise Line, Oceania Cruises, and Regent Seven Seas Cruises brands. It offers cruise itineraries ranging from a few days to 180-days calling on various locations, including destinations in Scandinavia, Russia, the Mediterranean, the Greek Isles, Alaska, Canada and New England, India and the rest of Asia, Tahiti and the South Pacific, Australia and New Zealand, Africa, South America, the Panama Canal, the Caribbean, and Harvest Caye. As of February 20, 2020, the company had 28 ships with approximately 59,150 berths. It distributes its products through retail/travel advisor, international travel advisor, and onboard cruise sales channels, as well as meetings, incentives, and charters. The company was founded in 1966 and is headquartered in Miami, Florida.", "currency": "MXN", "sector": "Consumer Goods", "industry": "Recreational Goods, Other", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Miami"}}