{"CEV.DE": {"short_name": "CENTROTEC SE  INH O.N.", "long_name": "Centrotec SE", "summary": "Centrotec SE, together with its subsidiaries, develops, produces, and sells system solutions in the areas of heating, ventilation, and climate control technology for buildings worldwide. It operates in three segments: Climate Systems, Gas Flue Systems, and Medical Technology & Engineering Plastics. The company provides heating systems condensing boiler technology for oil and gas; solar thermal systems; heat pumps; and gas flue and air piping systems. It also offers construction materials for airtight and watertight buildings and roof products; ventilation systems for heat recovery; climate control systems; and combined head and power units for natural gas, sewage gas, and biogas. In addition, it also offers medical technology components and equipment, as well as plastic semi-finished and prefabricated products. Centrotec SE is based in Brilon, Germany.", "currency": "EUR", "sector": "Consumer Goods", "industry": "Rubber & Plastics", "exchange": "GER", "market": "de_market", "country": "Germany", "city": "Brilon"}, "DAIOS.AT": {"short_name": "DAIOS PLASTICS S.A. (CR)", "long_name": "Daios Plastics S.A.", "summary": "Daios Plastics S.A. produces and sells plastic films for agricultural applications in Europe and internationally. The company offers plastic films for soft fruit protection applications; greenhouse films for protecting crops; tubes for transferring the warm air; greenhouse sides; gutters; asparagus films; low-tunnels; mulch films; and drip irrigation products. It also provides industrial packaging products, such as shrink films and hoods, and various stretch hoods for water bottling companies, cement and polypropylene producers, and other industries. The company was founded in 1974 and is based in Naousa, Greece.", "currency": "EUR", "sector": "Consumer Goods", "industry": "Rubber & Plastics", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Naousa"}}