{"BOSSN.MX": {"short_name": "HUGO BOSS AG", "long_name": "Hugo Boss AG", "summary": "Hugo Boss AG, together with its subsidiaries, develops, markets, and distributes fashion and accessories for men and women worldwide. The company offers business, casual, athleisure, and evening wear; shoes and accessories; and licensed products, including fragrances, eyewear, and watches, as well as children's fashion products. It markets and sells its products under the BOSS and HUGO brand names through online stores, freestanding stores, shop-in-shops, and factory outlets with approximately 7,450 sales points. Hugo Boss AG was founded in 1924 and is headquartered in Metzingen, Germany.", "currency": "MXN", "sector": "Consumer Goods", "industry": "Textile - Apparel Clothing", "exchange": "MEX", "market": "mx_market", "country": "Germany", "city": "Metzingen"}, "CPRIN.MX": {"short_name": "CAPRI HOLDINGS LTD", "long_name": "Capri Holdings Limited", "summary": "Capri Holdings Limited designs, markets, distributes, and retails branded women's and men's apparel, footwear, and accessories in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia. The company's Versace segment offers ready-to-wear, accessories, footwear, and home furnishings through a distribution network, including boutiques; and department and specialty stores, as well as through Versace e-commerce sites. It also licenses Versace brand name and trademarks to third parties to retail and/or wholesale its products; and has licensing agreements to the manufacture and sale of jeans, fragrances, watches, and eyewear. As of March 28, 2020, this segment operated 206 retail stores, including concessions; and 824 wholesale doors. Its Jimmy Choo segment sells luxury footwear, handbags, and small leather goods through directly operated Jimmy Choo stores; and Jimmy Choo e-commerce sites. It also licenses Jimmy Choo brand name and trademarks to third parties to retail and/or wholesale its products; and has licensing agreements to the manufacture and sale of fragrances, sunglasses, and eyewear. This segment operated 226 retail stores, including concessions; and 554 wholesale doors. The company's Michael Kors segment offers accessories, footwear, and apparel through retail stores, department stores, specialty stores, and select licensing partners, as well as through Michael Kors e-commerce sites. It also licenses Michael Kors brand name and trademarks to third parties to retail and/or wholesale its products; and has licensing agreements to the manufacture and sale of watches, jewelry, fragrances, and eyewear. This segment operated 839 retail stores, including concessions; and 2,982 wholesale doors. The company was formerly known as Michael Kors Holdings Limited and changed its name to Capri Holdings Limited in December 2018. The company was founded in 1981 and is based in London, the United Kingdom.", "currency": "MXN", "sector": "Consumer Goods", "industry": "Textile - Apparel Clothing", "exchange": "MEX", "market": "mx_market", "country": "United Kingdom", "city": "London"}, "DUR.AT": {"short_name": "DUROS S.A. (CR)", "long_name": "Duros S.A.", "summary": "Duros S.A. operates as a menswear company in Greece. It offers shirts, polo shirts, knitwear and cardigans, T-shirts, trousers, jackets, suits, blazers, and shoes. The company was founded in 1960 and is based in Patras, Greece.", "currency": "EUR", "sector": "Consumer Goods", "industry": "Textile - Apparel Clothing", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Patras"}, "ELBE.AT": {"short_name": "ELVE S.A. (CR)", "long_name": "Elve S.A.", "summary": "Elve S.A. manufactures and sells uniforms, corporate clothing, accessories, and personal protective equipment in France and internationally. It offers corporate clothes for museums, banks, casinos, hotels, and organizations; and T-shirts, polo shirts, and hoodies for gas stations, telecommunication chain stores, and others. The company also provides labor clothing and accessories, such as jackets, security pants, waterproof clothing, body suits, safety shoes, reflective clothing, accessories, gloves, and hats; and safety clothing and personal protective equipment, including bulletproof vests, warmth and waterproof clothes, safety shoes, accessories, clothing bags, isothermal, gloves, etc. In addition, it invest in and owns 5 solar energy parks with a total power of 5.2 MW. The company was founded in 1971 and is headquartered in Kavala, Greece.", "currency": "EUR", "sector": "Consumer Goods", "industry": "Textile - Apparel Clothing", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Kavala"}, "MONCN.MX": {"short_name": "MONCLER SPA", "long_name": "Moncler S.p.A.", "summary": "Moncler S.p.A., together with its subsidiaries, designs, produces, and distributes clothing and related accessories for men, women, and children under the Moncler brand name in Italy, other European countries, the Middle East, Africa, Asia, the Americas, and internationally. The company provides various collections under the Moncler brand name. It also offers footwear; leather goods, such as bags, backpacks, and accessories; and sunglasses and eyeglasses. As of December 31, 2019, the company operated 209 retail directly operated stores and 64 wholesale shop-in-shops. It also sells its products through moncler.com, an online store. The company was formerly known as Moncler S.r.l. and changed its name to Moncler S.p.A. in October 2013. Moncler S.p.A. was founded in 1952 and is headquartered in Milan, Italy.", "currency": "MXN", "sector": "Consumer Goods", "industry": "Textile - Apparel Clothing", "exchange": "MEX", "market": "mx_market", "country": "Italy", "city": "Milan"}, "PNGB": {"short_name": "PANGLOBAL BRANDS INC", "long_name": "Panglobal Brands, Inc.", "summary": "Panglobal Brands, Inc. engages in the design, production, and sale of clothing and accessories in the United States and internationally. It merchandises and sells junior T-shirts, junior denim, dresses, skirts, and knit and woven tops. The company sells its products under Sosik, Scrapbook, Scrapbook Originals, Crafty Couture, Tea and Honey, and Haven brand names. It sells its products through a network of wholesale accounts. The company is based in Los Angeles, California.", "currency": "USD", "sector": "Consumer Goods", "industry": "Textile - Apparel Clothing", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Los Angeles"}, "RL.MX": {"short_name": "RALPH LAUREN CORP", "long_name": "Ralph Lauren Corporation", "summary": "Ralph Lauren Corporation designs, markets, and distributes lifestyle products in North America, Europe, Asia, and internationally. The company offers apparel, including a range of men's, women's, and children's clothing accessories, which comprise sandals, eyewear, watches, fashion and fine jewelry, scarves, hats, gloves, umbrellas, and belts, as well as leather goods, such as handbags, luggage, small leather goods, and belts; home products consisting of bedding and bath products, furniture, fabrics and wallpapers, lightings, tabletops, floorcoverings, and giftware; and fragrances. It sells apparel and accessories under the Ralph Lauren Collection, Ralph Lauren Purple Label, Polo Ralph Lauren, Double RL, Lauren Ralph Lauren, Polo Golf Ralph Lauren, Ralph Lauren Golf, RLX Ralph Lauren, Polo Ralph Lauren Children, Chaps, Club Monaco, and other brand names; women's fragrances under the Ralph Lauren Collection, Woman by Ralph Lauren, Romance Collection, Ralph Collection, and Big Pony Women's brand names; and men's fragrances under the Polo Blue, Safari, Purple Label, Polo Red, Polo Green, Polo Black, Polo Supreme, Polo Sport, and Big Pony Men's brand names. The company's restaurant concepts include The Polo Bar in New York City; RL Restaurant in Chicago; Ralph's in Paris; and Ralph's Coffee concept. Ralph Lauren Corporation sells its products to department stores, specialty stores, and golf and pro shops, as well as directly to consumers through its retail stores, concession-based shop-within-shops, and its digital commerce sites. The company directly operates 530 retail stores and 654 concession-based shop-within-shops; and operates 80 Ralph Lauren stores, 31 Ralph Lauren concession shops, and 139 Club Monaco stores and shops through licensing partners. Ralph Lauren Corporation was founded in 1967 and is based in New York, New York.", "currency": "MXN", "sector": "Consumer Goods", "industry": "Textile - Apparel Clothing", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "New York"}, "UAA.MX": {"short_name": "UNDER ARMOUR INC", "long_name": "Under Armour, Inc.", "summary": "Under Armour, Inc., together with its subsidiaries, develops, markets, and distributes branded performance apparel, footwear, and accessories for men, women, and youth primarily in North America, Europe, the Middle East, Africa, the Asia-Pacific, and Latin America. The company offers its apparel in compression, fitted, and loose types to be worn in hot and cold. It also provides various footwear products for running, basketball, cleated sports, training, and outdoor. In addition, the company offers accessories, which include gloves, bags, and headwear; and digital fitness subscriptions, as well as digital advertising through MapMyFitness, MyFitnessPal, and Endomondo platforms. It primarily offers its products under the HEATGEAR, COLDGEAR, RUSH or RECOVER, UA Logo, UNDER ARMOUR, UA, ARMOUR, PROTECT THIS HOUSE, I WILL, ARMOURBOX, ARMOUR BRA, and ARMOUR FLEECE, as well as MyFitnessPal, MapMyFitness, and UNDER ARMOUR CONNECTED FITNESS brands. The company sells its products through wholesale channels, including national and regional sporting goods chains, independent and specialty retailers, department store chains, institutional athletic departments, and leagues and teams, as well as independent distributors; and directly to consumers through a network of 388 brand and factory house stores, as well as through e-commerce websites. Under Armour, Inc. was founded in 1996 and is headquartered in Baltimore, Maryland.", "currency": "MXN", "sector": "Consumer Goods", "industry": "Textile - Apparel Clothing", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Baltimore"}}