{
    "ADSN.MX": {
        "short_name": "ADIDAS AG",
        "long_name": "adidas AG",
        "summary": "adidas AG, together with its subsidiaries, designs, develops, distributes, and markets athletic and sports lifestyle products worldwide. The company operates through ten segments: Europe, North America Adidas, North America Reebok, Asia-Pacific, Russia/CIS, Latin America, Emerging Markets, Adidas Golf, Runtastic, and Other Centrally Managed Businesses. It offers footwear; apparel; accessories and gear, such as bags, balls, and fitness equipment; and golf products under the adidas and Reebok brands. The company is also involved in the operation of Runtastic, a digital health and fitness space; and Y-3 label business activities. It sells its products through approximately 2,500 own-retail stores; mono-branded franchise stores; and wholesale distribution, as well as its e-commerce channel. The company was formerly known as adidas-Salomon AG and changed its name to adidas AG in June 2006. adidas AG was founded in 1920 and is headquartered in Herzogenaurach, Germany.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Textile - Apparel Footwear & Accessories",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Germany",
        "state": null,
        "city": "Herzogenaurach",
        "zipcode": "91074",
        "website": "http://www.adidas-group.com",
        "full_time_employees": 54722
    },
    "KERN.MX": {
        "short_name": "KERING",
        "long_name": "Kering SA",
        "summary": "Kering SA develops, designs, manufactures, markets, and sells apparel and accessories. The company offers shoes; leather goods, including handbags and wallets, purses, and other leather products; eyewear, textile accessories, etc.; and jewelry and watches, as well as ready-to-wear products for men and women. It also provides perfumes and cosmetics. The company provides Gucci, Saint Laurent, Bottega Veneta, Alexander McQueen, Balenciaga, Brioni, Boucheron, Pomellato, DoDo, Qeelin, Girard-Perregaux, Ulysse Nardin, and Kering Eyewear branded products. It sells its products through department stores, multi-brand stores, and franchise stores, as well as e-commerce sites. As of December 31, 2020, it operated 1,433 stores. Kering SA sells its products in the Asia-Pacific, Western Europe, North America, Japan, and internationally. The company was formerly known as PPR SA and changed its name to Kering SA in June 2013. Kering SA was founded in 1963 and is based in Paris, France.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Textile - Apparel Footwear & Accessories",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75007",
        "website": "http://www.kering.com",
        "full_time_employees": 38553
    },
    "PUMN.MX": {
        "short_name": "PUMA SE",
        "long_name": "PUMA SE",
        "summary": "PUMA SE, together with its subsidiaries, designs, develops, sells, and markets footwear, apparel, and accessories in Europe, the Middle East, Africa, the Americas and, the Asia Pacific. The company offers performance and sport-inspired lifestyle products in categories, such as football, cricket, handball, rugby, volleyball, running, training and fitness, golf, and motorsports. It also issues licenses to independent partners to design, develop, manufacture, and sell watches, glasses, safety shoes, and gaming accessories such as the Playseat. The company sells its products through PUMA retail stores and factory outlets, as well as through online stores. It offers its products primarily under the PUMA and Cobra Golf brand names. The company was founded in 1924 and is headquartered in Herzogenaurach, Germany.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Textile - Apparel Footwear & Accessories",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Germany",
        "state": null,
        "city": "Herzogenaurach",
        "zipcode": "91074",
        "website": "http://www.puma.com",
        "full_time_employees": 13000
    }
}