{"UEM.L": {"short_name": "UTILICO EMERGING MARKETS TRUST ", "long_name": "Utilico Emerging Markets Trust PLC", "summary": "Utilico Emerging Markets Trust PLC is a closed-ended balanced mutual fund launched and managed by ICM Investment Management Limited. The fund is co-managed by ICM Limited. It invests in the public equity and fixed income markets of emerging market countries across the globe. The fund seeks to invest in securities of companies operating in the infrastructure, utility, and related sectors. It primarily invests in value stocks of companies, as well as in convertible securities and bonds of various credit ratings. The fund focuses on businesses with essential service or monopolistic characteristics to create its portfolio. It benchmarks the performance of its portfolio against the MSCI Emerging Markets Total Return Index. The fund was formerly known as Utilico Emerging Markets Limited. Utilico Emerging Markets Trust PLC was formed on July 20, 2005 and is domiciled in United Kingdom.", "currency": "GBp", "sector": "Financial Services", "industry": "Asset Management", "exchange": "LSE", "market": "gb_market", "country": "Bermuda", "city": "Hamilton"}, "UTL.L": {"short_name": "UIL LIMITED ORD 10P (DI)", "long_name": "UIL Limited", "summary": "UIL Limited is a closed-ended equity mutual fund launched and managed by ICM Limited. The fund invests in public equity markets across the globe. It seeks to invest in stocks of companies operating in the infrastructure, utility, and related sectors including water, sewerage, waste, electricity, gas, telecommunications, ports, airports, service, rail, roads, and any business with essential service or monopolistic characteristics. The fund primarily invests in value stocks of companies. It employs fundamental analysis with a focus on such factors as sound balance sheets, good cash flows, ability to pay and sustain dividends, good asset bases, and market conditions to create its portfolio. The fund benchmarks the performance of its portfolio against the FTSE Utilities Index, FTSE All-Share Index, and the Dow Jones World Utilities Index. It was formerly known as Utilico Investments Limited. UIL Limited was formed on August, 2003 and is domiciled in Bermuda.", "currency": "GBp", "sector": "Financial Services", "industry": "Asset Management", "exchange": "LSE", "market": "gb_market", "country": "Bermuda", "city": "Hamilton"}, "VEFL-SDB.ST": {"short_name": "VEF Ltd", "long_name": "VEF Ltd.", "summary": "VEF Ltd. is a venture capital firm specializing in early venture, emerging growth and growth capital investments. The firm primarily invests in modern financial services and fintech sector. The financial services sector includes payments providers, Credit, mobile money and all forms of financial marketplaces. It typically invests in the emerging and frontier markets. It prefers to take a minority stakes and board representation. Vostok Emerging Finance Ltd. was founded in 2015 and is based in Hamilton, Bermuda.", "currency": "SEK", "sector": "Financial Services", "industry": "Asset Management", "exchange": "STO", "market": "se_market", "country": "Bermuda", "city": "Hamilton"}, "VNV.ST": {"short_name": "VNV Global AB", "long_name": "VNV Global AB (publ)", "summary": "VNV Global AB (publ) formerly known as Vostok New Ventures Ltd., is a private equity and venture capital firm specializing in growth capital, buyout investments, incubation, seed/startup, early venture, mid venture, late venture. It prefers to invest  in online marketplaces, consumer-focused and business 2 business companies globally except China. It usually seeks investments where it can become a significant minority shareholder and actively manage the investment through board representation. The firm prefers to invest in unlisted companies. It prefers to take majority and minority stake in its portfolio companies. VNV Global AB (publ) was founded on April 5, 2007 and is based in Hamilton, Bermuda with an additional office in Stockholm, Sweden .", "currency": "SEK", "sector": "Financial Services", "industry": "Asset Management", "exchange": "STO", "market": "se_market", "country": "Bermuda", "city": "Hamilton"}, "VSTKF": {"short_name": "VNV GLOBAL AB", "long_name": "VNV Global AB (publ)", "summary": "VNV Global AB (publ) formerly known as Vostok New Ventures Ltd., is a private equity and venture capital firm specializing in growth capital, buyout investments, incubation, seed/startup, early venture, mid venture, late venture. It prefers to invest  in online marketplaces, consumer-focused and business 2 business companies globally except China. It usually seeks investments where it can become a significant minority shareholder and actively manage the investment through board representation. The firm prefers to invest in unlisted companies. It prefers to take majority and minority stake in its portfolio companies. VNV Global AB (publ) was founded on April 5, 2007 and is based in Hamilton, Bermuda with an additional office in Stockholm, Sweden .", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "PNK", "market": "us_market", "country": "Bermuda", "city": "Hamilton"}}