{
    "6541.TW": {
        "short_name": "TANVEX BIOPHARMA INC",
        "long_name": "Tanvex BioPharma, Inc.",
        "summary": "Tanvex BioPharma, Inc., a biopharmaceutical company, engages in the research, development, manufacture, and sale of biosimilar and biologic products and drugs in Taiwan and the United States. Its products pipeline include TX01, which has completed phase III clinical trials; TX05, which is in phase III clinical trials for the treatment of cancer; TX16 which is in phase I; and other products. The company was formerly known as Ruenvex Biotech, Inc. Tanvex BioPharma, Inc. was incorporated in 2013 and is based in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "George Town"
    },
    "MITO": {
        "short_name": "Stealth BioTherapeutics Corp.",
        "long_name": "Stealth BioTherapeutics Corp",
        "summary": "Stealth BioTherapeutics Corp, a clinical-stage biotechnology company, focuses on the discovery, development, and commercialization of therapies for diseases involving mitochondrial dysfunction. Its lead product candidate, Elamipretide, has the potential to treat rare genetic and common age-related mitochondrial diseases. The company's product candidates include SBT-20, a small peptide that targets and binds reversibly to cardiolipin, stabilizing mitochondrial structure, and function under conditions of oxidative stress; and SBT-272, a lead discovery pipeline compound, evaluating for rare neurodegenerative diseases, such as amyotrophic lateral sclerosis. Stealth BioTherapeutics Corp was founded in 2006 and is based in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Cayman Islands",
        "city": "George Town"
    },
    "S1BA.F": {
        "short_name": "STEALTH BIOTH. SP.ADR/12",
        "long_name": "Stealth BioTherapeutics Corp",
        "summary": "Stealth BioTherapeutics Corp, a clinical-stage biotechnology company, focuses on the discovery, development, and commercialization of therapies for diseases involving mitochondrial dysfunction. Its lead product candidate, Elamipretide, has the potential to treat rare genetic and common age-related mitochondrial diseases. The company's product candidates include SBT-20, a small peptide that targets and binds reversibly to cardiolipin, stabilizing mitochondrial structure, and function under conditions of oxidative stress; and SBT-272, a lead discovery pipeline compound, evaluating for rare neurodegenerative diseases, such as amyotrophic lateral sclerosis. Stealth BioTherapeutics Corp was founded in 2006 and is based in George Town, the Cayman Islands.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "city": "George Town"
    },
    "TBPH": {
        "short_name": "Theravance Biopharma, Inc.",
        "long_name": "Theravance Biopharma, Inc.",
        "summary": "Theravance Biopharma, Inc., a diversified biopharmaceutical company, discovers, develops, and commercializes organ-selective medicines. The company offers YUPELRI, a once-daily, nebulized long-acting muscarinic antagonist used for the treatment of chronic obstructive pulmonary disease. Its product portfolio also include TD-1473, a gut-selective pan-janus kinase (JAK) inhibitor that is in Phase IIb/III clinical trials for the treatment of rheumatoid arthritis, myelofibrosis, and ulcerative colitis, as well as for a range of inflammatory intestinal diseases, including ulcerative colitis and Crohn's disease. In addition, the company's product portfolio also comprise Ampreloxetine, an investigational norepinephrine reuptake inhibitor that has completed Phase III study for neurogenic orthostatic hypotension; TD-8236, an investigational, inhaled lung-selective pan-JAK inhibitor, which is Phase II clinical study for treatment of a range of inflammatory diseases; and TD-5202, an investigational, orally administered, gut-selective, irreversible JAK3 inhibitor that is in Phase I clinical study for treatment of inflammatory intestinal diseases. Further, it offers TRELEGY ELLIPTA for the treatment of COPD; Velusetrag, an oral and investigational medicine for gastrointestinal motility disorders; and Selective 5-HT4 Agonist for treatment of gastrointestinal motility disorders. It has a licensing and collaboration agreements with Pfizer Inc., Mylan Ireland Limited, Janssen Biotech, Inc., Alfasigma S.p.A, Trek Therapeutics, PBC, and Takeda Pharmaceutical Company Limited. The company was incorporated in 2013 and is based in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "city": "George Town"
    }
}