{
  "CRHN.MX": {
    "city": "Dublin",
    "country": "Ireland",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "General Building Materials",
    "long_name": "CRH plc",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Industrial Goods",
    "short_name": "CRH",
    "state": null,
    "summary": "CRH plc, through its subsidiaries, manufactures and distributes building materials. It operates in three segments: Americas Materials, Europe Materials, and Building Products. The company manufactures and supplies cement, lime, aggregates, precast, ready mixed concrete, and asphalt products; concrete masonry and hardscape products comprising pavers, kerbs, retaining walls, and related patio products; and glass and glazing products, including architectural glass, custom-engineered curtain and window walls, architectural windows, storefront systems, doors, skylights, and architectural hardware. It also offers precast concrete and polymer-based products, such as underground vaults, drainage pipes and structures, utility enclosures, and modular precast structures to the water, energy, communication, transportation, and building structures markets; and construction accessories, such as anchoring, fixing, and connection solutions, as well as lifting systems, formwork accessories, and other accessories used in construction applications. In addition, the company offers network access products, which include composite access chambers, covers, passive safety systems, retention sockets, sealants, and meter boxes; and paving and construction services. Further, it provides building and civil engineering contracting, contract surfacing, operates logistics and owned railway infrastructure; sells and distributes cement; and supplies access chambers and ducting products. It serves governments, contractors, homebuilders, homeowners, and sub-contractors. The company operates primarily in the Republic of Ireland, the United Kingdom, the rest of Europe, the United States, and internationally. CRH plc was founded in 1936 and is headquartered in Dublin, Ireland.",
    "website": "http://www.crh.com",
    "zipcode": "16"
  },
  "ETN1N.MX": {
    "city": "Dublin",
    "country": "Ireland",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Diversified Machinery",
    "long_name": "Eaton Corporation plc",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Industrial Goods",
    "short_name": "EATON CORPORATION PLC",
    "state": null,
    "summary": "Eaton Corporation plc operates as a power management company. Its Electrical Americas and Electrical Global segment provides electrical components, industrial components, power distribution and assemblies, residential products, single and three phase power quality products, wiring devices, circuit protection products, utility power distribution products, power reliability equipment, and services in North and South America, as well as hazardous duty electrical, emergency lighting, fire detection, explosion-proof instrumentation, and structural support systems internationally. The company's Hydraulics segment provides pumps, motors, and hydraulic power units; valves, cylinders, and electronic controls; industrial and hydraulic hoses, fittings, assemblies, thermoplastic hose and tubing products, couplings, connectors, and assembly equipment; and industrial drums and disc brakes. Its Aerospace segment offers pumps, motors, hydraulic power units, hoses and fittings, and electro-hydraulic pumps; valves, cylinders, electronic controls, electromechanical actuators, sensors, aircraft flap and slat systems, and nose wheel steering systems; thermoplastic tubing products, fittings, adapters, couplings, and sealing and ducting products; fuel pumps, sensors, valves, and adapters and regulators; and wiring connectors and cables, as well as hydraulic and bag filters, strainers and cartridges, and golf grips. The company's Vehicle segment offers transmissions, clutches, hybrid power systems, superchargers, engine valves and valve actuation systems, cylinder heads, locking and limited slip differentials, transmission controls, and fuel vapor components for the vehicle industry. Its eMobility segment provides voltage inverters, converters, fuses, onboard chargers, circuit protection units, vehicle controls, power distribution systems, fuel tank isolation valves, and commercial vehicle hybrid systems. The company was founded in 1916 and is based in Dublin, Ireland.",
    "website": "http://www.eaton.com",
    "zipcode": "4"
  }
}
