{
    "AON.JO": {
        "short_name": "African & Over Ent Ltd -N",
        "long_name": "African and Overseas Enterprises Limited",
        "summary": "African and Overseas Enterprises Limited, through its subsidiaries, engages in the retail, property, and water infrastructure businesses. The company retails fashion apparel through Queenspark stores in South Africa and Namibia, as well as through a franchise in Kenya. It also owns and manages a property portfolio; and offers private water and wastewater utility services. The company was incorporated in 1947 and is based in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7925",
        "website": "http://www.rextrueform.com",
        "market_cap": null
    },
    "AOO.JO": {
        "short_name": "African & Over Ent Ltd",
        "long_name": "African and Overseas Enterprises Limited",
        "summary": "African and Overseas Enterprises Limited, through its subsidiaries, engages in the retail, property, and water infrastructure businesses. The company retails fashion apparel through Queenspark stores in South Africa and Namibia, as well as through a franchise in Kenya. It also owns and manages a property portfolio; and offers private water and wastewater utility services. The company was incorporated in 1947 and is based in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7925",
        "website": "http://www.rextrueform.com",
        "market_cap": null
    },
    "BCF.JO": {
        "short_name": "Bowler Metcalf Ltd",
        "long_name": "Bowler Metcalf Limited",
        "summary": "Bowler Metcalf Limited manufactures and sells rigid plastic packaging for the toiletry, cosmetic, household, pharmaceutical, and food markets in South Africa. The company offers plastic packaging products. It also owns various properties. Bowler Metcalf Limited was founded in 1972 and is headquartered in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7800",
        "website": "http://www.bowlermetcalf.co.za",
        "market_cap": null
    },
    "CGR.JO": {
        "short_name": "Calgro M3 Hldgs Ltd",
        "long_name": "Calgro M3 Holdings Limited",
        "summary": "Calgro M3 Holdings Limited, together with its subsidiary, engages in the development of integrated residential properties in South Africa. The company operates through three segments: Residential Property Development, Memorial Parks, and Residential Rental Investments. It also develops and manages memorial parks, as well as provides burial rights and maintenance services. The company also invests in real estate properties. Calgro M3 Holdings Limited was incorporated in 1995 and is headquartered in Bryanston, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Bryanston",
        "zipcode": "2196",
        "website": "http://www.calgrom3.com",
        "market_cap": null
    },
    "CLH.JO": {
        "short_name": "City Lodge Hotels Ltd",
        "long_name": "City Lodge Hotels Limited",
        "summary": "City Lodge Hotels Limited operates hotels in South Africa and internationally. The company operates hotels under the Courtyard, City Lodge, Fairview, Town Lodge, and Road Lodge brand names. It operates 5 Courtyard hotels with 381 rooms; 20 City Lodge hotels with 3,531 rooms; 14 Town Lodge hotels with 1,804 rooms; 22 Road Lodge hotels with 2,059 rooms; and 1 Fairview hotel with 127 rooms. The company was founded in 1985 and is headquartered in Bryanston, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Bryanston",
        "zipcode": "2191",
        "website": "http://www.clhg.com",
        "market_cap": null
    },
    "CMH.JO": {
        "short_name": "Combined Motor Hldgs Ltd",
        "long_name": "Combined Motor Holdings Limited",
        "summary": "Combined Motor Holdings Limited, an investment holding company, engages in the motor retail and car hire businesses in South Africa. It offers new and used vehicles, parts, and related services; and life, disability, dread disease, retrenchment, and vehicle and component warranty insurance products, as well as vehicle financing solutions. The company also operates a fleet of approximately 7,000 vehicles through First Car Rental. In addition, it is involved in the distribution and franchising business; distribution of consumables, digital marketing, and workshop equipment; and supply and installation of workshop lifting, lubrication and diagnostic equipment, and the supply of waterless car wash systems. The company was founded in 1976 and is headquartered in Umhlanga, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Umhlanga",
        "zipcode": "4319",
        "website": "http://www.cmh.co.za",
        "market_cap": null
    },
    "CSB.JO": {
        "short_name": "Cashbuild Ltd",
        "long_name": "Cashbuild Limited",
        "summary": "Cashbuild Limited retails building materials and associated products. The company offers cement, timber, bricks, roof coverings, and decorative products. It serves contractors, homebuilders and improvers, farmers, traders, and other customers. As of June 30, 2020, the company operated 318 stores, including 256 Cashbuild stores, 61 P&L Hardware stores, and 1 DIY stores in South Africa, Botswana, Swaziland, Lesotho, Namibia, Malawi, and Zambia. Cashbuild Limited was founded in 1978 and is based in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2001",
        "website": "http://www.cashbuild.co.za",
        "market_cap": null
    },
    "FBR.JO": {
        "short_name": "Famous Brands Ltd",
        "long_name": "Famous Brands Limited",
        "summary": "Famous Brands Limited, through its subsidiaries, operates as a branded quick service, fast casual, and casual dining restaurant franchisor. The company operates franchised, master license, and company-owned restaurants. It operates a portfolio of 24 brands represented through a franchise network of 2,898 restaurants in South Africa, the rest of Africa, the Middle East, and the United Kingdom. It also manufactures and supplies food or other products to franchisees or customers; and provides logistics services. The company was formerly known as Steers Holdings Limited and changed its name to Famous Brands Limited in 2004. Famous Brands Limited was incorporated in 1969 and is headquartered in Midrand, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Midrand",
        "zipcode": null,
        "website": "http://www.famousbrands.co.za",
        "market_cap": null
    },
    "G5E.F": {
        "short_name": "TSOGO SUN GAMING  RC -,02",
        "long_name": "Tsogo Sun Gaming Limited",
        "summary": "Tsogo Sun Gaming Limited, together with its subsidiaries, engages in the gaming and entertainment business in South Africa. It operates casinos and hotels, limited payout machines (LPMs), and electronic bingo terminals. The company's gaming and entertainment options include theatre productions, movies, restaurants, ten-pin bowling, a theme park, and others. It operates 14 Tsogo Sun Gaming casinos, 21 Galaxy bingo sites, and VSlots LPMs, as well as Sandton Convention Centre. The company was formerly known as Tsogo Sun Holdings Limited and changed its name to Tsogo Sun Gaming Limited in July 2019. Tsogo Sun Gaming Limited was founded in 1969 and is headquartered in Fourways, South Africa.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Four Ways",
        "zipcode": "2055",
        "website": "http://www.tsogosun.com/gaming",
        "market_cap": "Small Cap"
    },
    "GPL.JO": {
        "short_name": "Grand Parade Inv Ltd",
        "long_name": "Grand Parade Investments Limited",
        "summary": "Grand Parade Investments Limited is a private equity and venture capital firm specializing in incubation, PIPE's, industry consolidation, recapitalizations, buyouts, and growth capital investments. It considers investments in seed and startup, middle market, mature, turnaround, and emerging growth stages. The firm typically invests in leisure, tourism, and gaming sectors and also considers investments in property, retail, food, manufacturing, real estate and entertainment. It seeks to invest in Africa with a focus on South Africa and Western Cape. The firm primarily invests between R$10 million ($0.84 million) and R$1000 million ($84.98 million) in companies with enterprise value greater than R$300 million ($25.50 million). The firm prefers to take a board seat in its portfolio companies. It may enter into joint ventures and other similar alliances, whereby it forms partnerships with such entities, contributing not only capital, but also providing strategic managerial input. The firm prefers to take minority or majority stake in its portfolio companies. The firm seeks to take more than 20 per cent stake, however a smaller stake is also considered where there is the potential to increase such stake in the future. It seeks to make balance sheet investments. Grand Parade Investments Limited was founded in 1997 and is based in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "8001",
        "website": "http://www.grandparade.co.za",
        "market_cap": null
    },
    "HIL.JO": {
        "short_name": "Homechoice Int plc",
        "long_name": "HomeChoice International plc",
        "summary": "HomeChoice International plc, an investment holding company, operates as an omni-channel home-shopping retailer in South Africa and internationally. It operates through Retail, Financial Services, Property, and Other segments. The company offers a range of homewares and selected apparels and footwear products under the HomeChoice brand; and technology-related products under the FoneChoice brand. It also provides personal loans and insurance products under the FinChoice brand through digital platforms. In addition, the company sells credit life, funeral, and product protection insurance products. It offers its products through digital platforms, contact centers, sales agents, catalogues, and showrooms. The company was founded in 1985 and is headquartered in Cape Town, South Africa. HomeChoice International plc is a subsidiary of GFM Limited.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7800",
        "website": "http://www.homechoiceinternational.com",
        "market_cap": null
    },
    "HY7.F": {
        "short_name": "SHOPRITE HLD LTD RC 1,134",
        "long_name": "Shoprite Holdings Limited",
        "summary": "Shoprite Holdings Limited, an investment holding company, primarily engages in the food retailing business in South Africa and other African countries. The company operates through four segments: Supermarkets RSA, Supermarkets Non-RSA, Furniture, and Other Operating segments. It also offers clothing, general merchandise, cosmetic, and liquor products; furniture, bedding, loose carpeting, home entertainment, and floor covering products; and liquors, electrical and household appliances, and soft furnishings. In addition, the company distributes various pharmaceutical products and surgical equipment to pharmacies, hospitals, clinics, dispensing doctors, and veterinary surgeons. As of June 28, 2020, it operated 2,829 stores under the Shoprite, Shoprite Hyper, Checkers, Checkers Hyper, Usave, Shoprite LiquorShop, Checkers LiquorShop, House & Home, OK Furniture & Power Express, MediRite Pharmacy, TransPharm, Computicket, Computicket Travel, Checkers Food Services, Freshmark, k'nect, OK Foods, OK Grocer, OK MiniMark, OK Express, Sentra, OK Liquor, and Megasave brands. Further, the company provides ticketing, and car rental and accommodation services; stadium management, capacity management, travel management, and access control solutions; and short-term insurance and treasury management services. Shoprite Holdings Limited was founded in 1979 and is based in Brackenfell, South Africa.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Brackenfell",
        "zipcode": "7560",
        "website": "http://www.shopriteholdings.co.za",
        "market_cap": "Mid Cap"
    },
    "HY7A.F": {
        "short_name": "SHOPRITE HDGS ADR  RC-,01",
        "long_name": "Shoprite Holdings Limited",
        "summary": "Shoprite Holdings Limited, an investment holding company, primarily engages in the food retailing business in South Africa and other African countries. The company operates through four segments: Supermarkets RSA, Supermarkets Non-RSA, Furniture, and Other Operating segments. It also offers clothing, general merchandise, cosmetic, and liquor products; furniture, bedding, loose carpeting, home entertainment, and floor covering products; and liquors, electrical and household appliances, and soft furnishings. In addition, the company distributes various pharmaceutical products and surgical equipment to pharmacies, hospitals, clinics, dispensing doctors, and veterinary surgeons. As of June 28, 2020, it operated 2,829 stores under the Shoprite, Shoprite Hyper, Checkers, Checkers Hyper, Usave, Shoprite LiquorShop, Checkers LiquorShop, House & Home, OK Furniture & Power Express, MediRite Pharmacy, TransPharm, Computicket, Computicket Travel, Checkers Food Services, Freshmark, k'nect, OK Foods, OK Grocer, OK MiniMark, OK Express, Sentra, OK Liquor, and Megasave brands. Further, the company provides ticketing, and car rental and accommodation services; stadium management, capacity management, travel management, and access control solutions; and short-term insurance and treasury management services. Shoprite Holdings Limited was founded in 1979 and is based in Brackenfell, South Africa.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Brackenfell",
        "zipcode": "7560",
        "website": "http://www.shopriteholdings.co.za",
        "market_cap": "Mid Cap"
    },
    "ITE.JO": {
        "short_name": "Italtile Ltd",
        "long_name": "Italtile Limited",
        "summary": "Italtile Limited manufactures and retails tiles, bathroom ware, and related products in South Africa. It operates through five segments: Retail, Franchising, Properties, Supply and Support Services, and Manufacturing. The company is involved in franchising and retailing of tiles, brassware, laminated flooring, bathroom ware, and accessories; and distributing of tiles, shower enclosures, brassware, laminated flooring, accessories, and tiling tools. It also invests in properties; and manufactures tiles, sanitary ware, baths, adhesive, and related products. The company offers its products under the U-Light, Italtile Retail, CTM, and TopT brands. As of June 30, 2020, it operated through a network of 198 stores in Southern and East Africa. The company was founded in 1969 and is based in Bryanston, South Africa. Italtile Limited is a subsidiary of Rallen (Pty) Ltd.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Bryanston",
        "zipcode": "2021",
        "website": "http://www.italtile.com",
        "market_cap": null
    },
    "L4L.JO": {
        "short_name": "Long 4 Life Limited",
        "long_name": "Long4life Limited",
        "summary": "Long4life Limited is a venture capital firm focuses on businesses with proven track record, having strong cash flow & attractive growth capital prospects led by strong, management teams. The firm prefers to invest in retail, wholesale, manufacturing, service, merchandising, distribution, e-commerce, Sports & Recreation, personal care, Beverages & Wellness sectors. Long4life Limited is based in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.long4life.co.za",
        "market_cap": null
    },
    "LEAT": {
        "short_name": "LEATT CORPORATION",
        "long_name": "Leatt Corporation",
        "summary": "Leatt Corporation designs, develops, markets, and distributes personal protective equipment for participants of motor sports and leisure activities worldwide. The company offers Leatt-Brace system, an injection molded neck protection system designed to prevent injuries to the cervical spine and neck. It also provides helmets for head and brain protection; and body armor range, including chest protectors, full upper body protectors, upper body protection vests, back protectors, knee braces, knee and elbow guards, impact shorts and cooling vests, off-road motorcycle boots, and mountain biking shoes. In addition, the company offers other products, parts, and accessories, such as goggles; toolbelt, duffel, gear, helmet, and hydration bags; casual clothing and caps; hats; and apparels that comprises jerseys, pants, shorts, socks, gloves, and jackets, as well as aftermarket support products. Further, it acts as the original equipment manufacturer for neck braces sold by other brands. The company's products are used by riders of motorcycles, bicycles, snowmobiles, and ATVs, as well as motor racing cars and other helmeted sports. It sells its products to customers through a network of distributors and retailers; and through its online stores at leatt.com. The company was formerly known as Treadzone, Inc. and changed its name to Leatt Corporation in May 2005. Leatt Corporation was founded in 2001 and is headquartered in Durbanville, South Africa.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Durbanville",
        "zipcode": "7550",
        "website": "http://www.leatt.com",
        "market_cap": "Small Cap"
    },
    "LEW.JO": {
        "short_name": "Lewis Group Ltd",
        "long_name": "Lewis Group Limited",
        "summary": "Lewis Group Limited, a credit retailer, sells household furniture and electrical appliances in South Africa, Botswana, Lesotho, Eswatini, and Namibia. The company's stores offer home electronics; sound and vision equipment; and lounge, bedroom, and dining room furniture products under the Lewis, Best Home and Electric, United Furniture Outlets, and Beares brands. In addition, it provides short-term insurance to customers purchasing merchandise on credit. As of November 25, 2020, the company operated approximately 805 stores. Lewis Group Limited was founded in 1934 and is based in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7925",
        "website": "http://www.lewisgroup.co.za",
        "market_cap": null
    },
    "LUX.JO": {
        "short_name": "Luxe Holdings Limited",
        "long_name": "Luxe Holdings Limited",
        "summary": "Luxe Holdings Limited owns and licenses a portfolio of corporate owned and franchised luxury retail brands in South Africa. It manufactures and supplies gold and silver jewelry; and retails luxury watches. The company operates outlets under the Natal Wholesale Jewellers, Arthur Kaplan, and World's Finest Watches brand names. The company was formerly known as Taste Holdings Limited and changed its name to Luxe Holdings Limited in July 2020. Luxe Holdings Limited was incorporated in 2000 and is based in Sandton, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2196",
        "website": "http://www.luxeholdings.co.za",
        "market_cap": null
    },
    "M4HA.F": {
        "short_name": "METAIR INVTS LTD O.N.",
        "long_name": "Metair Investments Limited",
        "summary": "Metair Investments Limited manufactures, assembles, distributes, and retails energy storage products and automotive components in South Africa, Romania, Turkey, the United Kingdom, the Middle East, and Russia. It offers energy storage products, including automotive and industrial batteries, solar systems, back-up systems, standby systems, charging systems, battery distribution networks, and lithium-ion starter batteries and mining cap lamps for original equipment manufacturers and the automotive aftermarket. The company offers energy storage products for use in telecommunication, utility, mining, retail, and material/product handling sectors. It also provides automotive components, such as air-conditioning and climate control systems, air cleaners, radiators, wiper systems, engine control units, washer systems, charge air coolers, reserve tanks and starter motors, brake pads, brake discs, brake shoes, hydraulics and other braking components, shock absorbers, struts, and track control arms. In addition, the company also provides automotive parts, such as coil springs, leaf springs, stabilizer and torsion bars, headlights, tail lights, reflectors, plastic injection moldings, commercial lighting products, chrome plating, body color paintings and assemblies, automotive cables and wires, wiring harnesses, instrument clusters/combination meters, and molded parts. Metair Investments Limited was founded in 1948 and is headquartered in Johannesburg, South Africa.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2193",
        "website": "http://www.metair.co.za",
        "market_cap": "Small Cap"
    },
    "MMRTY": {
        "short_name": "MASSMART HOLDINGS",
        "long_name": "Massmart Holdings Limited",
        "summary": "Massmart Holdings Limited operates as a retail and wholesale distributor. It operates through four divisions: Massdiscounters, Masswarehouse, Massbuild, and Masscash. The Massdiscounters division operates discount retail stores that offer general merchandise, fresh food, groceries, and liquor, as well as technological solutions in multimedia and hi-tech under the Game and DionWired retail formats. This division operates 173 stores in South Africa, Botswana, Ghana, Kenya, Lesotho, Malawi, Mozambique, Namibia, Nigeria, Tanzania, Uganda, and Zambia. The Masswarehouse division operates warehouse stores under the Makro and The Fruitspot names that sell food, liquor, and general merchandise for retail, commercial, and wholesale customers; and fresh and cut fruit and vegetables, as well as provides crowd-sourced final mile delivery services to individuals and corporates. This division operates 22 stores in South Africa. The Massbuild division operates DIY, home improvement, and building materials stores under the Builders Warehouse, Builders Express, Builders Superstore, and Builders Trade Depot brands. This division operates 118 stores in South Africa, Botswana, Mozambique, and Zambia. The Masscash division engages in the wholesale of food and cosmetic products under the CBW, Trident, Jumbo Cash & Carry, Sunshine, Eureka, Saverite, and Shield brands; and operation of retail outlets under the Cambridge Food and Rhino brands. This division operates 130 stores South Africa, Botswana, Lesotho, Mozambique, Namibia, Swaziland, and Zambia. It also engages in the management, investment, and finance businesses; and property holding business. The company was founded in 1990 and is headquartered in Sandton, South Africa. Massmart Holdings Limited operates as a subsidiary of Main Street 830 Proprietary Limited.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2157",
        "website": "http://www.massmart.co.za",
        "market_cap": "Small Cap"
    },
    "MOTUY": {
        "short_name": "MOTUS HOLDINGS LTD",
        "long_name": "Motus Holdings Limited",
        "summary": "Motus Holdings Limited operates in the automotive sector in South Africa, the United Kingdom, Australia, South East Asia, and Southern and East Africa. It operates through four segments: Import and Distribution, Retail and Rental, Motor-Related Financial Services, and Aftermarket Parts. The Import and Distribution segment imports and distributes passenger and light commercial vehicles and parts to a network of dealerships, car rental companies, fleets, and government institutions in South Africa. The Retail and Rental segment sells passenger and commercial vehicles in various segments. It has 77 pre-owned dealerships, 226 passenger vehicle dealerships, and 18 commercial vehicle dealerships in South Africa; 90 commercial dealerships and 29 passenger dealerships in the United Kingdom; and 28 passenger vehicle dealerships in Australia. This segment also rents cars under the Europcar and Tempest brands; and sells used cars under the Auto Pedigree brand. The Motor-Related Financial Services segment develops and distributes various vehicle related financial products and services through importers and distributors, dealers, vehicle finance houses, call centers, and digital channels. It manages and administers service, maintenance, and warranty plans; and develops and sells value added products and services. This segment also provides fleet management services to corporate customers. The Aftermarket Parts segment distributes, sells, and retails accessories and aftermarket parts for out-of-warranty vehicles through owned branches, retail stores, a network of franchised outlets, and specialised workshops. It operates 797 retail stores, including 72 owned stores in Southern Africa and South East Asia. The company is also involved in the property investment activities. Motus Holdings Limited was incorporated in 2017 and is based in Bedfordview, South Africa.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Bedfordview",
        "zipcode": "2008",
        "website": "http://www.motuscorp.co.za",
        "market_cap": "Small Cap"
    },
    "MPT.JO": {
        "short_name": "Mpact Limited",
        "long_name": "Mpact Limited",
        "summary": "Mpact Limited engages in the paper and plastic packaging and recycling business in South Africa. It operates through Paper and Plastics segments. The company manufactures recycled-based packaging and industrial paper grades, such as containerboards and carton boards; and a range of printed and unprinted converted corrugated products, including boards for use in the manufacture of corrugated packaging, corrugated boxes, die-cut cases, folded glued cases, trays, and point-of-sale displays, cups, lids, and bags. It also sells Mondi ProVantage Baywhite, a white top Kraftliner and Mondi ProVantage BayKraf, a Kraftliner; and recycles paper through various recovered paper sources comprising pre- and post-consumer materials. In addition, the company manufactures various plastic packaging products, such as polyethylene-terephthalate (PET) preforms, bottles, and jars; closures for food and beverage, household, and chemical markets; plastic jumbo bins, wheelie bins, and pallets and crates; FMCG rigid plastic packaging products; polystyrene and PET trays; vinyl films. It offers packaging and industrial paper products to corrugated board and box producers, and other containerboard converters; carton boards to folding carton and other producers of industrial products, as well as users of cards and book covers; corrugated products to producers of agricultural, fast moving consumer goods (FMCG), and other durable and non-durable goods; and plastic packaging products to food, beverage, personal care, home care, pharmaceutical, agricultural, and retail markets. The company is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.mpact.co.za",
        "market_cap": null
    },
    "MRP.JO": {
        "short_name": "Mr Price Group Ltd",
        "long_name": "Mr Price Group Limited",
        "summary": "Mr Price Group Limited, together with its subsidiaries, operates as a fashion value retailer serving women, men, and children in South Africa and internationally. The company operates through three segments: Apparel, Home, and Financial Services and Cellular. It offers clothing, underwear, footwear, cosmetics, and accessories; furniture and kids merchandise; sporting, outdoor, and fitness products comprising footwear, apparel, equipment, and accessories; women's smart and casual fashion and intimate wear; and home textile and dÃ©cor products for bedroom, living-room, bathroom, kitchen, and dining-room. The company also provides credit; manages and collects debtor's books; and markets financial services, cellular products, and value-added services, as well as offers store cards, airtime, and insurance products. It serves its customers through an omni-channel retail distribution of 1,378 corporate-owned stores and 9 franchised stores in Africa, as well as through its online channels. Mr Price Group Limited was founded in 1885 and is headquartered in Durban, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Durban",
        "zipcode": "4001",
        "website": "http://www.mrpricegroup.com",
        "market_cap": null
    },
    "MRPLY": {
        "short_name": "MR.PRICE GROUP",
        "long_name": "Mr Price Group Limited",
        "summary": "Mr Price Group Limited, together with its subsidiaries, operates as a fashion value retailer serving women, men, and children in South Africa and internationally. The company operates through three segments: Apparel, Home, and Financial Services and Cellular. It offers clothing, underwear, footwear, cosmetics, and accessories; furniture and kids merchandise; sporting, outdoor, and fitness products comprising footwear, apparel, equipment, and accessories; women's smart and casual fashion and intimate wear; and home textile and dÃ©cor products for bedroom, living-room, bathroom, kitchen, and dining-room. The company also provides credit; manages and collects debtor's books; and markets financial services, cellular products, and value-added services, as well as offers store cards, airtime, and insurance products. It serves its customers through an omni-channel retail distribution of 1,378 corporate-owned stores and 9 franchised stores in Africa, as well as through its online channels. Mr Price Group Limited was founded in 1885 and is headquartered in Durban, South Africa.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Durban",
        "zipcode": "4001",
        "website": "http://www.mrpricegroup.com",
        "market_cap": "Mid Cap"
    },
    "MSM.JO": {
        "short_name": "Massmart Holdings Ltd",
        "long_name": "Massmart Holdings Limited",
        "summary": "Massmart Holdings Limited operates as a retail and wholesale distributor. It operates through four divisions: Massdiscounters, Masswarehouse, Massbuild, and Masscash. The Massdiscounters division operates discount retail stores that offer general merchandise, fresh food, groceries, and liquor, as well as technological solutions in multimedia and hi-tech under the Game and DionWired retail formats. This division operates 173 stores in South Africa, Botswana, Ghana, Kenya, Lesotho, Malawi, Mozambique, Namibia, Nigeria, Tanzania, Uganda, and Zambia. The Masswarehouse division operates warehouse stores under the Makro and The Fruitspot names that sell food, liquor, and general merchandise for retail, commercial, and wholesale customers; and fresh and cut fruit and vegetables, as well as provides crowd-sourced final mile delivery services to individuals and corporates. This division operates 22 stores in South Africa. The Massbuild division operates DIY, home improvement, and building materials stores under the Builders Warehouse, Builders Express, Builders Superstore, and Builders Trade Depot brands. This division operates 118 stores in South Africa, Botswana, Mozambique, and Zambia. The Masscash division engages in the wholesale of food and cosmetic products under the CBW, Trident, Jumbo Cash & Carry, Sunshine, Eureka, Saverite, and Shield brands; and operation of retail outlets under the Cambridge Food and Rhino brands. This division operates 130 stores South Africa, Botswana, Lesotho, Mozambique, Namibia, Swaziland, and Zambia. It also engages in the management, investment, and finance businesses; and property holding business. The company was founded in 1990 and is headquartered in Sandton, South Africa. Massmart Holdings Limited operates as a subsidiary of Main Street 830 Proprietary Limited.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2157",
        "website": "http://www.massmart.co.za",
        "market_cap": null
    },
    "MTA.JO": {
        "short_name": "Metair Investments Ltd",
        "long_name": "Metair Investments Limited",
        "summary": "Metair Investments Limited manufactures, assembles, distributes, and retails energy storage products and automotive components in South Africa, Romania, Turkey, the United Kingdom, the Middle East, and Russia. It offers energy storage products, including automotive and industrial batteries, solar systems, back-up systems, standby systems, charging systems, battery distribution networks, and lithium-ion starter batteries and mining cap lamps for original equipment manufacturers and the automotive aftermarket. The company offers energy storage products for use in telecommunication, utility, mining, retail, and material/product handling sectors. It also provides automotive components, such as air-conditioning and climate control systems, air cleaners, radiators, wiper systems, engine control units, washer systems, charge air coolers, reserve tanks and starter motors, brake pads, brake discs, brake shoes, hydraulics and other braking components, shock absorbers, struts, and track control arms. In addition, the company also provides automotive parts, such as coil springs, leaf springs, stabilizer and torsion bars, headlights, tail lights, reflectors, plastic injection moldings, commercial lighting products, chrome plating, body color paintings and assemblies, automotive cables and wires, wiring harnesses, instrument clusters/combination meters, and molded parts. Metair Investments Limited was founded in 1948 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2193",
        "website": "http://www.metair.co.za",
        "market_cap": null
    },
    "MTH.JO": {
        "short_name": "Motus Holdings Ltd",
        "long_name": "Motus Holdings Limited",
        "summary": "Motus Holdings Limited operates in the automotive sector in South Africa, the United Kingdom, Australia, South East Asia, and Southern and East Africa. It operates through four segments: Import and Distribution, Retail and Rental, Motor-Related Financial Services, and Aftermarket Parts. The Import and Distribution segment imports and distributes passenger and light commercial vehicles and parts to a network of dealerships, car rental companies, fleets, and government institutions in South Africa. The Retail and Rental segment sells passenger and commercial vehicles in various segments. It has 77 pre-owned dealerships, 226 passenger vehicle dealerships, and 18 commercial vehicle dealerships in South Africa; 90 commercial dealerships and 29 passenger dealerships in the United Kingdom; and 28 passenger vehicle dealerships in Australia. This segment also rents cars under the Europcar and Tempest brands; and sells used cars under the Auto Pedigree brand. The Motor-Related Financial Services segment develops and distributes various vehicle related financial products and services through importers and distributors, dealers, vehicle finance houses, call centers, and digital channels. It manages and administers service, maintenance, and warranty plans; and develops and sells value added products and services. This segment also provides fleet management services to corporate customers. The Aftermarket Parts segment distributes, sells, and retails accessories and aftermarket parts for out-of-warranty vehicles through owned branches, retail stores, a network of franchised outlets, and specialised workshops. It operates 797 retail stores, including 72 owned stores in Southern Africa and South East Asia. The company is also involved in the property investment activities. Motus Holdings Limited was incorporated in 2017 and is based in Bedfordview, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Bedfordview",
        "zipcode": "2008",
        "website": "http://www.motuscorp.co.za",
        "market_cap": null
    },
    "NCS.JO": {
        "short_name": "Nictus Ltd",
        "long_name": "Nictus Limited",
        "summary": "Nictus Limited, together with its subsidiaries, operates as a retailer of household furniture, electrical appliances, and home electronics under the Nictus Furnishers brand in South Africa. The company also provides short-term insurance under the Corporate Guarantee brand. It operates three furniture retail stores. The company is headquartered in Sandton, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2191",
        "website": "http://www.nictuslimited.co.za",
        "market_cap": null
    },
    "NPK.JO": {
        "short_name": "Nampak Ltd",
        "long_name": "Nampak Limited",
        "summary": "Nampak Limited manufactures and sells metal, plastic, and paper packaging products in South Africa and internationally. The company offers HDPE and PET bottles and jars, plastic closures, tubes, and crates and drums for the fruit juice, dairy, carbonated soft drink, water, alcoholic beverage, bakery, agriculture, chemical, petroleum, personal care, and household markets. It also provides aluminum beverage cans and ends for the alcoholic, carbonated soft drink, fruit juice, energy drink, vegetable juice, and ice tea markets; tinplate food cans for the canned food market; and aluminum and tinplate cans, including aerosols, monoblocs, and paint and shoe polish cans to the personal care, household goods, and industrial markets, as well as crowns for the beverage market. In addition, the company offers beverage cartons for milk, fruit juice, water, and traditional beer; self-opening paper bags for the flour and sugar markets; and corrugated cases/boxes for the tobacco, poultry, and food and general commercial markets, as well as labels and folding cartons for the tobacco, food and beverage markets. Nampak Limited is headquartered in Sandton, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2191",
        "website": "http://www.nampak.co.za",
        "market_cap": null
    },
    "NPKLY": {
        "short_name": "NAMPAK",
        "long_name": "Nampak Limited",
        "summary": "Nampak Limited manufactures and sells metal, plastic, and paper packaging products in South Africa and internationally. The company offers HDPE and PET bottles and jars, plastic closures, tubes, and crates and drums for the fruit juice, dairy, carbonated soft drink, water, alcoholic beverage, bakery, agriculture, chemical, petroleum, personal care, and household markets. It also provides aluminum beverage cans and ends for the alcoholic, carbonated soft drink, fruit juice, energy drink, vegetable juice, and ice tea markets; tinplate food cans for the canned food market; and aluminum and tinplate cans, including aerosols, monoblocs, and paint and shoe polish cans to the personal care, household goods, and industrial markets, as well as crowns for the beverage market. In addition, the company offers beverage cartons for milk, fruit juice, water, and traditional beer; self-opening paper bags for the flour and sugar markets; and corrugated cases/boxes for the tobacco, poultry, and food and general commercial markets, as well as labels and folding cartons for the tobacco, food and beverage markets. Nampak Limited is headquartered in Sandton, South Africa.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2191",
        "website": "http://www.nampak.co.za",
        "market_cap": "Small Cap"
    },
    "PIK.F": {
        "short_name": "PICK'N PAY STORES RC-0125",
        "long_name": "Pick n Pay Stores Limited",
        "summary": "Pick n Pay Stores Limited, an investment holding company, engages in the retail of food, clothing, general merchandise, pharmaceuticals, and liquor in South Africa and Rest of Africa. It owns, franchises, and invests in hypermarkets, supermarkets, local stores, clothing stores, liquor stores, pharmacy stores, superstores, build stores, punch stores, and express stores under the Pick n Pay and Boxer brands, which offer food products, wine, clothing, and health and wellness products. The company also offers its products through an online shopping platform www.pnp.co.za. In addition, it acquires and develops retail and distribution sites; and provides third-party bill payments, travel and event ticketing, and financial services, as well as gift cards; and sells prepaid electricity. The company operates a network of 1,925 owned and franchised stores. Pick n Pay Stores Limited was founded in 1967 and is based in Cape Town, South Africa.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7708",
        "website": "http://www.pnp.co.za",
        "market_cap": "Small Cap"
    },
    "PIK.JO": {
        "short_name": "Pick n Pay Stores Ltd",
        "long_name": "Pick n Pay Stores Limited",
        "summary": "Pick n Pay Stores Limited, an investment holding company, engages in the retail of food, clothing, general merchandise, pharmaceuticals, and liquor in South Africa and Rest of Africa. It owns, franchises, and invests in hypermarkets, supermarkets, local stores, clothing stores, liquor stores, pharmacy stores, superstores, build stores, punch stores, and express stores under the Pick n Pay and Boxer brands, which offer food products, wine, clothing, and health and wellness products. The company also offers its products through an online shopping platform www.pnp.co.za. In addition, it acquires and develops retail and distribution sites; and provides third-party bill payments, travel and event ticketing, and financial services, as well as gift cards; and sells prepaid electricity. The company operates a network of 1,925 owned and franchised stores. Pick n Pay Stores Limited was founded in 1967 and is based in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7708",
        "website": "http://www.pnp.co.za",
        "market_cap": null
    },
    "PPH.JO": {
        "short_name": "Pepkor Holdings Ltd",
        "long_name": "Pepkor Holdings Limited",
        "summary": "Pepkor Holdings Limited, together with its subsidiaries, operates as a retailer focusing on discount, value, and specialized goods in Angola, Botswana, eSwatini, Lesotho, Mozambique, Malawi, Namibia, Nigeria, South Africa, and Zambia. The company offers clothing products, general merchandise, household goods, furniture, appliances, consumer electronics, cellular products and services, financial, and fintech services. As of September 30, 2020, it operated approximately 5,254 stores. The company was formerly known as Steinhoff Africa Retail Limited and changed its name to Pepkor Holdings Limited in August 2018. Pepkor Holdings Limited was founded in 2017 and is based in Cape Town, South Africa. Pepkor Holdings Limited is a subsidiary of Steinhoff International Holdings N.V.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7493",
        "website": "http://www.pepkor.co.za",
        "market_cap": null
    },
    "RTN.JO": {
        "short_name": "Rex Trueform Group -N-",
        "long_name": "Rex Trueform Group Limited",
        "summary": "Rex Trueform Group Limited, through its subsidiaries, engages in the retail of clothing and accessories in South Africa. It operates through Retail, Property, and Water Infrastructure segments. The company offers ladies' and men's clothing, shoes, costume jewelry, related fashion accessories, and cosmetics through branded Queenspark outlets located in South Africa and Namibia, as well as through a Queenspark branded franchised outlet in Kenya. It also invests in properties; and has investments in a private water and wastewater utility group that operates in South Africa. The company was formerly known as Rex Trueform Clothing Company Limited and changed its name to Rex Trueform Group Limited in January 2018. The company was founded in 1937 and is based in Cape Town, South Africa. Rex Trueform Group Limited is a subsidiary of African and Overseas Enterprises Limited.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7925",
        "website": "http://www.rextrueform.com",
        "market_cap": null
    },
    "RTO.JO": {
        "short_name": "Rex Trueform Group Ltd",
        "long_name": "Rex Trueform Group Limited",
        "summary": "Rex Trueform Group Limited, through its subsidiaries, engages in the retail of clothing and accessories in South Africa. It operates through Retail, Property, and Water Infrastructure segments. The company offers ladies' and men's clothing, shoes, costume jewelry, related fashion accessories, and cosmetics through branded Queenspark outlets located in South Africa and Namibia, as well as through a Queenspark branded franchised outlet in Kenya. It also invests in properties; and has investments in a private water and wastewater utility group that operates in South Africa. The company was formerly known as Rex Trueform Clothing Company Limited and changed its name to Rex Trueform Group Limited in January 2018. The company was founded in 1937 and is based in Cape Town, South Africa. Rex Trueform Group Limited is a subsidiary of African and Overseas Enterprises Limited.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7925",
        "website": "http://www.rextrueform.com",
        "market_cap": null
    },
    "S1VA.F": {
        "short_name": "PEPKOR LTD.",
        "long_name": "Pepkor Holdings Limited",
        "summary": "Pepkor Holdings Limited, together with its subsidiaries, operates as a retailer focusing on discount, value, and specialized goods in Angola, Botswana, eSwatini, Lesotho, Mozambique, Malawi, Namibia, Nigeria, South Africa, and Zambia. The company offers clothing products, general merchandise, household goods, furniture, appliances, consumer electronics, cellular products and services, financial, and fintech services. As of September 30, 2020, it operated approximately 5,254 stores. The company was formerly known as Steinhoff Africa Retail Limited and changed its name to Pepkor Holdings Limited in August 2018. Pepkor Holdings Limited was founded in 2017 and is based in Cape Town, South Africa. Pepkor Holdings Limited is a subsidiary of Steinhoff International Holdings N.V.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7493",
        "website": "http://www.pepkor.co.za",
        "market_cap": "Mid Cap"
    },
    "SHFF.JO": {
        "short_name": "Steinhoff Inv Hldgs Pref",
        "long_name": "Steinhoff Investment Holdings Limited",
        "summary": "Steinhoff Investment Holdings Limited manufactures, sources, warehouses, distributes, and retails furniture and household goods in Europe and the Pacific Rim. The company offers furniture, beds, and related homeware products. It also offers distribution and warehousing services to the mining, manufacturing, industrial, and allied sectors; transportation and fuel logistics services to the petrochemical and gas industries; and transport and related logistics services to the sugar and agricultural industry. In addition, the company offers passenger bus transportation services. The company is based in Sandton, South Africa. Steinhoff Investment Holdings Limited operates as a subsidiary of Steinhoff International Holdings N.V.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2090",
        "website": null,
        "market_cap": null
    },
    "SHP.JO": {
        "short_name": "Shoprite Holdings Ltd",
        "long_name": "Shoprite Holdings Limited",
        "summary": "Shoprite Holdings Limited, an investment holding company, primarily engages in the food retailing business in South Africa and other African countries. The company operates through four segments: Supermarkets RSA, Supermarkets Non-RSA, Furniture, and Other Operating segments. It also offers clothing, general merchandise, cosmetic, and liquor products; furniture, bedding, loose carpeting, home entertainment, and floor covering products; and liquors, electrical and household appliances, and soft furnishings. In addition, the company distributes various pharmaceutical products and surgical equipment to pharmacies, hospitals, clinics, dispensing doctors, and veterinary surgeons. As of June 28, 2020, it operated 2,829 stores under the Shoprite, Shoprite Hyper, Checkers, Checkers Hyper, Usave, Shoprite LiquorShop, Checkers LiquorShop, House & Home, OK Furniture & Power Express, MediRite Pharmacy, TransPharm, Computicket, Computicket Travel, Checkers Food Services, Freshmark, k'nect, OK Foods, OK Grocer, OK MiniMark, OK Express, Sentra, OK Liquor, and Megasave brands. Further, the company provides ticketing, and car rental and accommodation services; stadium management, capacity management, travel management, and access control solutions; and short-term insurance and treasury management services. Shoprite Holdings Limited was founded in 1979 and is based in Brackenfell, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Brackenfell",
        "zipcode": "7560",
        "website": "http://www.shopriteholdings.co.za",
        "market_cap": null
    },
    "SNH.DE": {
        "short_name": "STEINHOFF INT.HLDG.EO-,50",
        "long_name": "Steinhoff International Holdings N.V.",
        "summary": "Steinhoff International Holdings N.V. engages in retailing activities in Australasia, Poland, Rest of Africa, Rest of Europe, South Africa, and the United Kingdom. It retails household goods, clothing, footwear, textiles, cell phones, airtime, and fast-moving consumer goods, as well as furniture and appliances. The company was founded in 1964 and is headquartered in Stellenbosch, South Africa.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "GER",
        "market": "de_market",
        "country": "South Africa",
        "state": null,
        "city": "Stellenbosch",
        "zipcode": "7600",
        "website": "http://www.steinhoffinternational.com",
        "market_cap": "Small Cap"
    },
    "SNH.F": {
        "short_name": "STEINHOFF INT.HLDG.EO-,50",
        "long_name": "Steinhoff International Holdings N.V.",
        "summary": "Steinhoff International Holdings N.V. engages in retailing activities in Australasia, Poland, Rest of Africa, Rest of Europe, South Africa, and the United Kingdom. It retails household goods, clothing, footwear, textiles, cell phones, airtime, and fast-moving consumer goods, as well as furniture and appliances. The company was founded in 1964 and is headquartered in Stellenbosch, South Africa.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Stellenbosch",
        "zipcode": "7600",
        "website": "http://www.steinhoffinternational.com",
        "market_cap": "Small Cap"
    },
    "SNH.JO": {
        "short_name": "Steinhoff Int Hldgs N.V.",
        "long_name": "Steinhoff International Holdings N.V.",
        "summary": "Steinhoff International Holdings N.V. engages in retailing activities in Australasia, Poland, Rest of Africa, Rest of Europe, South Africa, and the United Kingdom. It retails household goods, clothing, footwear, textiles, cell phones, airtime, and fast-moving consumer goods, as well as furniture and appliances. The company was founded in 1964 and is headquartered in Stellenbosch, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Stellenbosch",
        "zipcode": "7600",
        "website": "http://www.steinhoffinternational.com",
        "market_cap": null
    },
    "SNH.VI": {
        "short_name": "STEINHOFF INTERNATIONAL NV",
        "long_name": "Steinhoff International Holdings N.V.",
        "summary": "Steinhoff International Holdings N.V. engages in retailing activities in Australasia, Poland, Rest of Africa, Rest of Europe, South Africa, and the United Kingdom. It retails household goods, clothing, footwear, textiles, cell phones, airtime, and fast-moving consumer goods, as well as furniture and appliances. The company was founded in 1964 and is headquartered in Stellenbosch, South Africa.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "VIE",
        "market": "at_market",
        "country": "South Africa",
        "state": null,
        "city": "Stellenbosch",
        "zipcode": "7600",
        "website": "http://www.steinhoffinternational.com",
        "market_cap": "Small Cap"
    },
    "SRGHY": {
        "short_name": "SHOPRITE HOLDINGS",
        "long_name": "Shoprite Holdings Limited",
        "summary": "Shoprite Holdings Limited, an investment holding company, primarily engages in the food retailing business in South Africa and other African countries. The company operates through four segments: Supermarkets RSA, Supermarkets Non-RSA, Furniture, and Other Operating segments. It also offers clothing, general merchandise, cosmetic, and liquor products; furniture, bedding, loose carpeting, home entertainment, and floor covering products; and liquors, electrical and household appliances, and soft furnishings. In addition, the company distributes various pharmaceutical products and surgical equipment to pharmacies, hospitals, clinics, dispensing doctors, and veterinary surgeons. As of June 28, 2020, it operated 2,829 stores under the Shoprite, Shoprite Hyper, Checkers, Checkers Hyper, Usave, Shoprite LiquorShop, Checkers LiquorShop, House & Home, OK Furniture & Power Express, MediRite Pharmacy, TransPharm, Computicket, Computicket Travel, Checkers Food Services, Freshmark, k'nect, OK Foods, OK Grocer, OK MiniMark, OK Express, Sentra, OK Liquor, and Megasave brands. Further, the company provides ticketing, and car rental and accommodation services; stadium management, capacity management, travel management, and access control solutions; and short-term insurance and treasury management services. Shoprite Holdings Limited was founded in 1979 and is based in Brackenfell, South Africa.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Brackenfell",
        "zipcode": "7560",
        "website": "http://www.shopriteholdings.co.za",
        "market_cap": "Mid Cap"
    },
    "SRHGF": {
        "short_name": "SHOPRITE HOLDINGS",
        "long_name": "Shoprite Holdings Limited",
        "summary": "Shoprite Holdings Limited, an investment holding company, primarily engages in the food retailing business in South Africa and other African countries. The company operates through four segments: Supermarkets RSA, Supermarkets Non-RSA, Furniture, and Other Operating segments. It also offers clothing, general merchandise, cosmetic, and liquor products; furniture, bedding, loose carpeting, home entertainment, and floor covering products; and liquors, electrical and household appliances, and soft furnishings. In addition, the company distributes various pharmaceutical products and surgical equipment to pharmacies, hospitals, clinics, dispensing doctors, and veterinary surgeons. As of June 28, 2020, it operated 2,829 stores under the Shoprite, Shoprite Hyper, Checkers, Checkers Hyper, Usave, Shoprite LiquorShop, Checkers LiquorShop, House & Home, OK Furniture & Power Express, MediRite Pharmacy, TransPharm, Computicket, Computicket Travel, Checkers Food Services, Freshmark, k'nect, OK Foods, OK Grocer, OK MiniMark, OK Express, Sentra, OK Liquor, and Megasave brands. Further, the company provides ticketing, and car rental and accommodation services; stadium management, capacity management, travel management, and access control solutions; and short-term insurance and treasury management services. Shoprite Holdings Limited was founded in 1979 and is based in Brackenfell, South Africa.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Brackenfell",
        "zipcode": "7560",
        "website": "http://www.shopriteholdings.co.za",
        "market_cap": "Mid Cap"
    },
    "STHHF": {
        "short_name": "STEINHOFF INTERNATIONAL HLDGS N",
        "long_name": "Steinhoff International Holdings N.V.",
        "summary": "Steinhoff International Holdings N.V. engages in retailing activities in Australasia, Poland, Rest of Africa, Rest of Europe, South Africa, and the United Kingdom. It retails household goods, clothing, footwear, textiles, cell phones, airtime, and fast-moving consumer goods, as well as furniture and appliances. The company was founded in 1964 and is headquartered in Stellenbosch, South Africa.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Stellenbosch",
        "zipcode": "7600",
        "website": "http://www.steinhoffinternational.com",
        "market_cap": "Small Cap"
    },
    "SUI.JO": {
        "short_name": "Sun International Ltd",
        "long_name": "Sun International Limited",
        "summary": "Sun International Limited owns and operates casinos, hotels, and resort properties in South Africa, Swaziland, Nigeria, and Latin America. It operates or has an interest in a total of 19 resorts, luxury hotels, and casinos. Sun International Limited was founded in 1966 and is headquartered in Sandton, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2196",
        "website": "http://www.suninternational.com",
        "market_cap": null
    },
    "SUR.JO": {
        "short_name": "Spur Corporation Ltd",
        "long_name": "Spur Corporation Ltd",
        "summary": "Spur Corporation Ltd, together with its subsidiaries, operates as a restaurant franchisor in South Africa and internationally. The company operates and franchises restaurants under the Spur Steak Ranches, Panarottis Pizza Pasta, John Dory's Fish Grill Sushi, The Hussar Grill, RocoMamas, Casa Bella, and Nikos brands. As of June 30, 2020, it operated through a network of 631 outlets, including 84 outside of South Africa. The company is also involved in sauce manufacturing, warehousing, and product distribution businesses; and training, export, dÃ©cor manufacturing, call center, and radio station businesses. Spur Corporation Ltd was founded in 1967 and is headquartered in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7441",
        "website": "http://www.spurcorporation.com",
        "market_cap": null
    },
    "TFG.JO": {
        "short_name": "The Foschini Group Limited",
        "long_name": "The Foschini Group Limited",
        "summary": "The Foschini Group Limited, together with its subsidiaries, operates independent chain-stores in South Africa and internationally. The company operates through four segments: TFG Africa Retail, Credit, TFG London, and TFG Australia. It offers clothing for men, ladies, and kids; jewelry; cellphones; accessories; cosmetics; sporting and outdoor apparel and equipment; and homeware and furniture. The company provides its products under the @home, @homelivingspace, American Swiss, Archive, Colette, Connor, Donna, Duesouth Escapes, Exact, Fabiani, The FIX, Foschini, G-Star RAW, Hi, Hobbs, Johnny Bigg, Markham, Phase Eight, Relay Jeans, RFO, Rockwear, Sneaker Factory, SODA Bloc, Sportscene, Sterns, Tarocash, Totalsports, Whistles, and yd. brands. It operates 4,083 trading outlets in 32 countries on 5 continents, as well as online. The company was formerly known as Foschini Limited and changed its name to The Foschini Group Limited in September 2010. The Foschini Group Limited was founded in 1924 and is headquartered in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7500",
        "website": "http://www.tfglimited.co.za",
        "market_cap": null
    },
    "TGO.JO": {
        "short_name": "Tsogo Sun Hotels LTD",
        "long_name": "Tsogo Sun Hotels Limited",
        "summary": "Tsogo Sun Hotels Limited owns, leases, and manages hotels in South Africa. The company operates through four segments: Manco, Rental Income Â\u0096 HPF, Internally Managed, and Offshore. The company operates hotels and resorts under the Southern Sun Hotels and Resorts, SunSquare, Garden Court, StayEasy, SUN1, hi Hotels brand names. It consists of a portfolio of 110 hotels. The company was founded in 1969 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2055",
        "website": "http://www.tsogosun.com",
        "market_cap": null
    },
    "TPC.JO": {
        "short_name": "Transpaco Ltd",
        "long_name": "Transpaco Limited",
        "summary": "Transpaco Limited, together with its subsidiaries, manufactures, recycles, and distributes paper and plastic packaging products primarily in South Africa. It operates through Plastics Products, Paper and Board Products, and Properties and Group Services segments. The company manufactures plastic products comprising refuse bags, bin liners, sheeting and film, retail vestÂ\u0096type plastic bags, retail boutique plastic bags, refuse bags, industrial plastic bags, tubing and sheeting, scholastic stationery, and high density and low density polyethylene; and paper and board products, including printed folded cartons, package inserts, heavy duty and light duty cores, yarn and tape cores, conical containers, void fillers, carton dividers, angle boards, and paper straws. It also offers specialized films, consisting of cast pallet stabilization wrapping, stretch film, and cast films; and packaging and machinery products, such as corrugated board and cartons, pallet and food wrap, paper bags, plastic bags, tubing and sheeting, tape and closures, cleaning materials, protective clothing, paper and board, packaging machinery, general packaging, and labels. It serves retail, general packaging, transport, industrial, agricultural, cosmetics, food, mining, pharmaceutical, and veterinary sectors. Transpaco Limited was incorporated in 1951 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2090",
        "website": "http://www.transpaco.co.za",
        "market_cap": null
    },
    "TRU.JO": {
        "short_name": "Truworths Int Ltd",
        "long_name": "Truworths International Limited",
        "summary": "Truworths International Limited, an investment holding and management company, engages in the retail of fashion apparel, footwear, and related merchandise and homeware. It operates through Truworths and Office segments. The company operates approximately 728 stores in South Africa; and 49 stores in the rest of Africa. It serves in South Africa, the United Kingdom, Germany, the Republic of Ireland, and other sub-Saharan African countries. Truworths International Limited was founded in 1917 and is based in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "8001",
        "website": "http://www.truworthsinternational.com",
        "market_cap": null
    },
    "TSG.JO": {
        "short_name": "Tsogo Sun Gaming Ltd",
        "long_name": "Tsogo Sun Gaming Limited",
        "summary": "Tsogo Sun Gaming Limited, together with its subsidiaries, engages in the gaming and entertainment business in South Africa. It operates casinos and hotels, limited payout machines (LPMs), and electronic bingo terminals. The company's gaming and entertainment options include theatre productions, movies, restaurants, ten-pin bowling, a theme park, and others. It operates 14 Tsogo Sun Gaming casinos, 21 Galaxy bingo sites, and VSlots LPMs, as well as Sandton Convention Centre. The company was formerly known as Tsogo Sun Holdings Limited and changed its name to Tsogo Sun Gaming Limited in July 2019. Tsogo Sun Gaming Limited was founded in 1969 and is headquartered in Fourways, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Four Ways",
        "zipcode": "2055",
        "website": "http://www.tsogosun.com/gaming",
        "market_cap": null
    },
    "WHL.JO": {
        "short_name": "Woolworths Holdings Ltd",
        "long_name": "Woolworths Holdings Limited",
        "summary": "Woolworths Holdings Limited, through its subsidiaries, operates a chain of retail stores in sub-Saharan Africa, Australia, and New Zealand. It operates through seven segments: Woolworths Fashion, Beauty and Home; Woolworths Food; Woolworths Logistics; Woolworths Financial Services; David Jones; Country Road Group; and Treasury segments. The company offers food, clothing, homeware, beauty, lifestyle products, and general merchandise, as well as operates department stores. It also provides financial products and services, such as store cards, credit cards, personal loans, and insurance products. The company operates approximately 643 WSA stores in South Africa and 88 stores in the rest of Africa. Woolworths Holdings Limited was founded in 1931 and is headquartered in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "8001",
        "website": "http://www.woolworthsholdings.co.za",
        "market_cap": null
    },
    "WLWHY": {
        "short_name": "WOOLWORTHS HLDGS",
        "long_name": "Woolworths Holdings Limited",
        "summary": "Woolworths Holdings Limited, through its subsidiaries, operates a chain of retail stores in sub-Saharan Africa, Australia, and New Zealand. It operates through seven segments: Woolworths Fashion, Beauty and Home; Woolworths Food; Woolworths Logistics; Woolworths Financial Services; David Jones; Country Road Group; and Treasury segments. The company offers food, clothing, homeware, beauty, lifestyle products, and general merchandise, as well as operates department stores. It also provides financial products and services, such as store cards, credit cards, personal loans, and insurance products. The company operates approximately 643 WSA stores in South Africa and 88 stores in the rest of Africa. Woolworths Holdings Limited was founded in 1931 and is headquartered in Cape Town, South Africa.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "8001",
        "website": "http://www.woolworthsholdings.co.za",
        "market_cap": "Mid Cap"
    }
}