{
    "BCF.JO": {
        "short_name": "Bowler Metcalf Ltd",
        "long_name": "Bowler Metcalf Limited",
        "summary": "Bowler Metcalf Limited manufactures and sells rigid plastic packaging for the toiletry, cosmetic, household, pharmaceutical, and food markets in South Africa. The company offers plastic packaging products. It also owns various properties. Bowler Metcalf Limited was founded in 1972 and is headquartered in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7800",
        "website": "http://www.bowlermetcalf.co.za",
        "market_cap": null
    },
    "MPT.JO": {
        "short_name": "Mpact Limited",
        "long_name": "Mpact Limited",
        "summary": "Mpact Limited engages in the paper and plastic packaging and recycling business in South Africa. It operates through Paper and Plastics segments. The company manufactures recycled-based packaging and industrial paper grades, such as containerboards and carton boards; and a range of printed and unprinted converted corrugated products, including boards for use in the manufacture of corrugated packaging, corrugated boxes, die-cut cases, folded glued cases, trays, and point-of-sale displays, cups, lids, and bags. It also sells Mondi ProVantage Baywhite, a white top Kraftliner and Mondi ProVantage BayKraf, a Kraftliner; and recycles paper through various recovered paper sources comprising pre- and post-consumer materials. In addition, the company manufactures various plastic packaging products, such as polyethylene-terephthalate (PET) preforms, bottles, and jars; closures for food and beverage, household, and chemical markets; plastic jumbo bins, wheelie bins, and pallets and crates; FMCG rigid plastic packaging products; polystyrene and PET trays; vinyl films. It offers packaging and industrial paper products to corrugated board and box producers, and other containerboard converters; carton boards to folding carton and other producers of industrial products, as well as users of cards and book covers; corrugated products to producers of agricultural, fast moving consumer goods (FMCG), and other durable and non-durable goods; and plastic packaging products to food, beverage, personal care, home care, pharmaceutical, agricultural, and retail markets. The company is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.mpact.co.za",
        "market_cap": null
    },
    "NPK.JO": {
        "short_name": "Nampak Ltd",
        "long_name": "Nampak Limited",
        "summary": "Nampak Limited manufactures and sells metal, plastic, and paper packaging products in South Africa and internationally. The company offers HDPE and PET bottles and jars, plastic closures, tubes, and crates and drums for the fruit juice, dairy, carbonated soft drink, water, alcoholic beverage, bakery, agriculture, chemical, petroleum, personal care, and household markets. It also provides aluminum beverage cans and ends for the alcoholic, carbonated soft drink, fruit juice, energy drink, vegetable juice, and ice tea markets; tinplate food cans for the canned food market; and aluminum and tinplate cans, including aerosols, monoblocs, and paint and shoe polish cans to the personal care, household goods, and industrial markets, as well as crowns for the beverage market. In addition, the company offers beverage cartons for milk, fruit juice, water, and traditional beer; self-opening paper bags for the flour and sugar markets; and corrugated cases/boxes for the tobacco, poultry, and food and general commercial markets, as well as labels and folding cartons for the tobacco, food and beverage markets. Nampak Limited is headquartered in Sandton, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2191",
        "website": "http://www.nampak.co.za",
        "market_cap": null
    },
    "NPKLY": {
        "short_name": "NAMPAK",
        "long_name": "Nampak Limited",
        "summary": "Nampak Limited manufactures and sells metal, plastic, and paper packaging products in South Africa and internationally. The company offers HDPE and PET bottles and jars, plastic closures, tubes, and crates and drums for the fruit juice, dairy, carbonated soft drink, water, alcoholic beverage, bakery, agriculture, chemical, petroleum, personal care, and household markets. It also provides aluminum beverage cans and ends for the alcoholic, carbonated soft drink, fruit juice, energy drink, vegetable juice, and ice tea markets; tinplate food cans for the canned food market; and aluminum and tinplate cans, including aerosols, monoblocs, and paint and shoe polish cans to the personal care, household goods, and industrial markets, as well as crowns for the beverage market. In addition, the company offers beverage cartons for milk, fruit juice, water, and traditional beer; self-opening paper bags for the flour and sugar markets; and corrugated cases/boxes for the tobacco, poultry, and food and general commercial markets, as well as labels and folding cartons for the tobacco, food and beverage markets. Nampak Limited is headquartered in Sandton, South Africa.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2191",
        "website": "http://www.nampak.co.za",
        "market_cap": "Small Cap"
    },
    "TPC.JO": {
        "short_name": "Transpaco Ltd",
        "long_name": "Transpaco Limited",
        "summary": "Transpaco Limited, together with its subsidiaries, manufactures, recycles, and distributes paper and plastic packaging products primarily in South Africa. It operates through Plastics Products, Paper and Board Products, and Properties and Group Services segments. The company manufactures plastic products comprising refuse bags, bin liners, sheeting and film, retail vestÂ\u0096type plastic bags, retail boutique plastic bags, refuse bags, industrial plastic bags, tubing and sheeting, scholastic stationery, and high density and low density polyethylene; and paper and board products, including printed folded cartons, package inserts, heavy duty and light duty cores, yarn and tape cores, conical containers, void fillers, carton dividers, angle boards, and paper straws. It also offers specialized films, consisting of cast pallet stabilization wrapping, stretch film, and cast films; and packaging and machinery products, such as corrugated board and cartons, pallet and food wrap, paper bags, plastic bags, tubing and sheeting, tape and closures, cleaning materials, protective clothing, paper and board, packaging machinery, general packaging, and labels. It serves retail, general packaging, transport, industrial, agricultural, cosmetics, food, mining, pharmaceutical, and veterinary sectors. Transpaco Limited was incorporated in 1951 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2090",
        "website": "http://www.transpaco.co.za",
        "market_cap": null
    }
}