{
    "0A4H.L": {
        "short_name": "STONECO LTD STONECO ORD SHS CLA",
        "long_name": "StoneCo Ltd.",
        "summary": "StoneCo Ltd. provides financial technology solutions to merchants and integrated partners to conduct electronic commerce across in-store, online, and mobile channels in Brazil. It distributes its solutions, principally through proprietary Stone Hubs, which offer hyper-local sales and services; and technology and solutions to digital merchants through sales and technical personnel and software vendors, as well as sells solutions to brick-and-mortar and digital merchants through sales team. As of December 31, 2020, the company served approximately 652,600 clients primarily small-and-medium-sized businesses; and 260 integrated partners, such as global payment service providers, digital marketplaces, and integrated software vendors. The company was founded in 2000 and is headquartered in George Town, Cayman Islands. StoneCo Ltd. is a subsidiary of HR Holdings, LLC.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1002",
        "website": "http://www.stone.co",
        "market_cap": "Large Cap"
    },
    "0Q0.F": {
        "short_name": "STONECO  A  DL-,000079365",
        "long_name": "StoneCo Ltd.",
        "summary": "StoneCo Ltd. provides financial technology solutions to merchants and integrated partners to conduct electronic commerce across in-store, online, and mobile channels in Brazil. It distributes its solutions, principally through proprietary Stone Hubs, which offer hyper-local sales and services; and technology and solutions to digital merchants through sales and technical personnel and software vendors, as well as sells solutions to brick-and-mortar and digital merchants through sales team. As of December 31, 2020, the company served approximately 652,600 clients primarily small-and-medium-sized businesses; and 260 integrated partners, such as global payment service providers, digital marketplaces, and integrated software vendors. The company was founded in 2000 and is headquartered in George Town, Cayman Islands. StoneCo Ltd. is a subsidiary of HR Holdings, LLC.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1002",
        "website": "http://www.stone.co",
        "market_cap": "Large Cap"
    },
    "0TB.F": {
        "short_name": "THERAVANCE BIOPHARMA",
        "long_name": "Theravance Biopharma, Inc.",
        "summary": "Theravance Biopharma, Inc., a diversified biopharmaceutical company, discovers, develops, and commercializes organ-selective medicines in the United States, Europe, and Asia. The company offers YUPELRI, a once-daily, nebulized long-acting muscarinic antagonist used for the treatment of chronic obstructive pulmonary disease (COPD). Its product portfolio also include Izencitinib, a gut-selective pan-janus kinase (JAK) inhibitor that is in Phase IIb/III clinical trials for the treatment of rheumatoid arthritis, myelofibrosis, and ulcerative colitis, as well as for a range of inflammatory intestinal diseases, including ulcerative colitis and Crohn's disease. In addition, the company's product portfolio also comprise Ampreloxetine, an investigational norepinephrine reuptake inhibitor that has completed Phase III study for neurogenic orthostatic hypotension; TD-8236, an investigational, inhaled lung-selective pan-JAK inhibitor, which is Phase II clinical study for treatment of a range of inflammatory diseases; and TD-5202, an investigational, orally administered, gut-selective, irreversible JAK3 inhibitor that is in Phase I clinical study for treatment of inflammatory intestinal diseases. Further, it offers TRELEGY for the treatment of COPD; Velusetrag, an oral and investigational medicine for gastrointestinal motility disorders; and Selective 5-HT4 Agonist for treatment of gastrointestinal motility disorders. It has a licensing and collaboration agreements with Pfizer Inc., Viatris Inc., Janssen Biotech, Inc., Alfasigma S.p.A, and Takeda Pharmaceutical Company Limited. The company was incorporated in 2013 and is based in George Town, the Cayman Islands.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1104",
        "website": "http://www.theravance.com",
        "market_cap": "Small Cap"
    },
    "1591.TWO": {
        "short_name": "INMAX HOLDING CO LTD",
        "long_name": "Inmax Holding Co., Ltd.",
        "summary": "Inmax Holding Co., Ltd. manufactures and sells a range of fasteners primarily in the Southeast Asia region. It offers pneumatic and industrial nails; coil roofing nails for roofing, asphalt and fiberglass shingles, lathing, insulation board, vinyl siding, fiber cement roofing and siding, and waterproof tar paper applications; coil nails for use in wooden pallets and wooden boxes assembly, siding, decking, panel sheathing, and fencing; and staples for furniture and wooden box manufacturing, as well as for fastening works, such as architectural applications. The company also provides brads for use in finish, trim, drawers, and cabinets; and plastic strip and paper tape nails for framing, sheathing, sub flooring, roof decking, and exterior decks. Inmax Holding Co., Ltd. was incorporated in 2009 and is headquartered in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1002",
        "website": "http://www.inmax-fasteners.com",
        "market_cap": "Small Cap"
    },
    "1626.TW": {
        "short_name": "AIRMATE CAYMAN INTL CO",
        "long_name": "Airmate (Cayman) International Co Limited",
        "summary": "Airmate (Cayman) International Co Limited researches, develops, manufactures, and sells household appliances in China, Japan, South Korea, and internationally. The company offers electric fans and heaters, air purifiers, humidifiers, dehumidifiers, and fresh air systems. It also provides precision molds treatment services. The company also offers its products through online store. Airmate (Cayman) International Co Limited was founded in 1973 and is based in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": null,
        "website": "http://www.airmate-china.com",
        "market_cap": "Mid Cap"
    },
    "2236.TW": {
        "short_name": "PATEC PRECISION INDUSTRY CO LTD",
        "long_name": "Patec Precision Industry Co., Ltd.",
        "summary": "Patec Precision Industry Co., Ltd., together with its subsidiaries, manufactures and sells press machines and parts for automobiles and motorcycles in Singapore, China, Indonesia, and Europe. It provides motorcycle and automobile safety system components, such as door lock parts, seat parts, brake disc shock absorbers, flanges, exhaust system hooks, clutch, and other related safety products, as well as processes automobile components. The company also offers medical device and equipment; and sells of manipulator applications. Patec Precision Industry Co., Ltd. was founded in 1992 and is headquartered in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KYI-9005",
        "website": "http://www.patec-intl.com",
        "market_cap": "Small Cap"
    },
    "2239.TW": {
        "short_name": "CAYMAN ENGLEY INDUSTRIAL CO. LT",
        "long_name": "Cayman Engley Industrial Co., Ltd.",
        "summary": "Cayman Engley Industrial Co., Ltd. produces and sells automobile parts in China and internationally. The company offers stamping and welding parts, including body in white parts, cockpit carriers, and stamping bumpers; and roll parts, such as rolling bumpers and door sills. It also provides long fiberglass hot-pressing and injection products comprising under body shields, front ends, spare wheel pans, door modules, battery trays, wheel arch liners, heat shields, interior trim parts, and lamp brackets; and mold manufacturing products consisting of prototype and sop tools. In addition, the company engages in the development and manufacture of soft robot software; and provision of related technical consulting services. Cayman Engley Industrial Co., Ltd. was founded in 1991 and is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.engley.com",
        "market_cap": "Large Cap"
    },
    "2248.TWO": {
        "short_name": "eLAND",
        "long_name": "Shining Victory Motor Electronic Co., Ltd.",
        "summary": "Shining Victory Motor Electronic Co., Ltd. engages in the production and sale of automotive components. It offers optoelectronic products, automotive electronics, and automotive metal and plastic decorative parts, including car door illuminating welcome pedals, car interior light bar ambient lights, shifting atmosphere lights, sun visors, luggage racks, bright strips, etc. The company is based in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1208",
        "website": "http://www.top-elan.com/",
        "market_cap": "Small Cap"
    },
    "2637.TW": {
        "short_name": "WISDOM MARINE LINES CO LIMITED",
        "long_name": "Wisdom Marine Lines Co., Limited",
        "summary": "Wisdom Marine Lines Co., Limited, together with its subsidiaries, primarily provides marine cargo transportation services in the Netherlands, Japan, Singapore, Denmark, Hong Kong, and internationally. It also offers vessel management and maintenance, vessel chartering, vessel leasing, and shipping agency and management services. The company acquires, operates, and manages dry bulk vessels with a focus on the handysize sector. It operates a fleet of 129 vessels that include bulk carriers, log carriers, tween-deckrs, multi-purpose vessels, RORO ships, and container ships of various sizes. Wisdom Marine Lines Co., Limited was founded in 1999 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "1108",
        "website": "http://www.wisdomlines.com.tw",
        "market_cap": "Large Cap"
    },
    "2928.TWO": {
        "short_name": "REDHORSE GROUP CO LTD",
        "long_name": "Redhorse Group Co.Ltd.",
        "summary": "Redhorse Group Co.Ltd. engages in the gift sales, and education and entertainment business operations in Japan and internationally . It operates through three segments: Souvenir Sales, E-commerce Sales, and Other. The company provides support to direct trading between suppliers and restaurants under the OWL brand name; souvenirs; disaster prevention consulting services that offer storage batteries during a disaster; and green drinks, supplement to deal with the sleeping environment, as well as operates game/esports facility, and guesthouses and hostels. In addition, it is involved in the communication, e-commerce, real estate, hometown tax, and regional industry support and revitalization businesses. Redhorse Group Co.Ltd. was founded in 1964 and is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "1002",
        "website": "http://www.redhorse-group.com",
        "market_cap": "Small Cap"
    },
    "2936.TW": {
        "short_name": "COASTER INTERNATIONAL CO LTD",
        "long_name": "Coaster International Co., Ltd.",
        "summary": "Coaster International Co., Ltd. engages in the wholesale of furniture in the United States and internationally. It provides bedroom, living room, dining room, accents group, recreation, and home office furniture; and furniture for youth. The company was founded in 2013 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-9005",
        "website": "http://www.coasterinternational.com",
        "market_cap": "Small Cap"
    },
    "2939.TW": {
        "short_name": "KAYEE INTERNATIONAL GROUP CO LT",
        "long_name": "Kayee International Group Co., Ltd",
        "summary": "Kayee International Group Co., Ltd, through its subsidiaries, develops, manufactures, and sells body care products, household goods, sports equipment, electronic and electrical appliances, and kitchenware products. The company offers health and beauty life products, including leggings, bras, pillows, wireless TV hearing earphones, briefs, slim shapers, and skirts; and outdoor living products, such as multi tools flashlight, rollers, lanterns, solar lights, air fresheners, infrared sensor lights, ironing devices, motion sensor solar power lights, moving flame candles, solar LED ground spot lights, stainless steel solar gutter lights, turbo sweepers, expandable hoses, spin products, and star lasers. It also provides fitness products comprising body shapers, torso training products, and jumping fitness products; appliances that include smokeless grills, air wave fryers, wall heaters, rice cookers with steamers, and USB rechargeable vacuum food sealer; and kitchen products. The company sells its products through direct TV channels, TV shopping channels, retail stores, and mail order/Internet sales channels in Europe, the Americas, Asia, and internationally. Kayee International Group Co., Ltd was founded in 2015 and is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.kayeetv.com",
        "market_cap": "Small Cap"
    },
    "4137.TW": {
        "short_name": "CHLITINA HOLDING LIMITED",
        "long_name": "Chlitina Holding Limited",
        "summary": "Chlitina Holding Limited, together with its subsidiaries, researches, develops, manufactures, and markets beauty skincare products in China and internationally. It offers makeup removers, facial cleansers, hydrating toners, lotions, moisturizing creams, facial masks, sunscreens, and foundation makeup products; eye care, anti-wrinkle, whitening, and hydrating products; and professional salon botanical extracts, herbal essence products, essential oils, and breast enlargement products under the Chlitina brand name. The company also provides enterprise management consulting services; medical cosmetology services; and cosmetology training services to beauty professionals, as well as operates as a dealer of health food and daily necessities products, skincare and supplementary health care products, and general practice and foods. The company sells its products online. As of December 31, 2019, it operated through a network of 4,809 CHLITINA franchised beauty salons in mainland China, Taiwan, Hong Kong, and South East Asia. Chlitina Holding Limited was founded in 1989 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1111",
        "website": "http://www.chlitina.com",
        "market_cap": "Large Cap"
    },
    "4139.TWO": {
        "short_name": "MA KUANG HEALTHCARE HOLDING LIM",
        "long_name": "Ma Kuang Healthcare Holding Limited",
        "summary": "Kuang Healthcare Holding Limited, an investment holding company, provides medical services in Taiwan. The company offers TCM healthcare services, such as TCM orthopedic, weight management, pain management, examination, and TCM aftercare services; and TCM consultation, acupuncture, TuiNa therapy, cupping, Gua Sha/Scrapping, and TDP lamp services. It also provides Chinese medicinal powders, healthcare products, and Chinese proprietary medicines. The company operates 20 TCM clinics and TuiNa centres. Kuang Healthcare Holding Limited was founded in 2009 and is headquartered in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": null,
        "website": "http://www.makuanggroup.com",
        "market_cap": "Mid Cap"
    },
    "4148.TW": {
        "short_name": "ALL COSMOS BIO-TECH HOLDING COR",
        "long_name": "All Cosmos Bio-Tech Holding Corporation",
        "summary": "All Cosmos Bio-Tech Holding Corporation, through its subsidiaries, manufactures and sells bio-organic and bio-chemical compound fertilizers in Malaysia. It also engages in the research and development of microorganisms for waste disposal of oil-palm; and wholesale of probiotics. In addition, the company is involved in the research and forest plantation activities. It also exports its products to Taiwan, Indonesia, Vietnam, and China. All Cosmos Bio-Tech Holding Corporation was founded in 1999 and is headquartered in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9005",
        "website": "http://www.allcosmos.com",
        "market_cap": "Mid Cap"
    },
    "4154.TWO": {
        "short_name": "KINO CO LTD",
        "long_name": "Kino Co., Ltd.",
        "summary": "Kino Co., Ltd. engages in the development and selling of healthcare and beauty products in Malaysia, Singapore, China, Taiwan, and internationally. It operates through Functional Drinks, Health Care Products, Food Service and Entertainment, Performing arts, and Others segments. The company offers nutraceutical products, including health related enhancement functional drinks, as well as health pads and herbal tea under the Kinohimitsu brand; and facial mask, cleanser, slimming cream, and other skincare products under the Activa and Xpertise brands. It is also involved in the business of restaurant and entertainment, conduction of artistic performance activities, production and brokerage, and sale of tickets. In addition, the company engages in the production of fine metal accessories. The company sells its products through pharmacies, departmental chains, hypermarkets, and health and beauty stores. It operates a network of approximately 5,000 physical channels. The company was formerly known as Kino Biotech Co., Ltd. The company was incorporated in 2010 and is headquartered in Camana Bay, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Beverages - Non-Alcoholic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Camana Bay",
        "zipcode": "KY1-9007",
        "website": "http://www.kinobiotech.com",
        "market_cap": "Small Cap"
    },
    "4190.TW": {
        "short_name": "JOURDENESS GROUP LIMITED",
        "long_name": "Jourdeness Group Limited",
        "summary": "Jourdeness Group Limited, together with its subsidiaries, manufactures and distributes cosmetics. It is involved in the beauty and body spa business, which include online beauty courses; and management and consulting activities. It operates approximately 640 skin care and spa direct and franchise chain stores in Taiwan, Mainland China, and Malaysia. Jourdeness Group Limited was founded in 2010 and is headquartered in the Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.jourdeness.com",
        "market_cap": "Mid Cap"
    },
    "4552.TW": {
        "short_name": "LIDA HOLDINGS LIMITED",
        "long_name": "Lida Holdings Limited",
        "summary": "Lida Holdings Limited, together with its subsidiaries, designs, manufactures, and sells air compressors, electric welders, and power tools. It offers piston, screw, and scroll air compressors used in the medical, food, mining, chemical, electronic power, building materials, automobiles, steel, furniture, machinery manufacturing, and other industries. The company provides its products under the Lida, Luowei, and Eagleland brands in China, Australia, Korea, Turkey, Malaysia, South Africa, France, the United Kingdom, Belgium, Indonesia, and internationally. Lida Holdings Limited was founded in 1993 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1103",
        "website": "http://www.lidaholdings.com",
        "market_cap": "Mid Cap"
    },
    "4571.TW": {
        "short_name": "KHGEARS INTERNATIONAL LTD",
        "long_name": "Khgears International Limited",
        "summary": "Khgears International Limited researches, develops, manufactures, and sells gears and gearboxes in Asia, the United States, and Europe. It offers precision gears, such as spiral bevel and cylindrical gears, turbine worms, and synchronous belt wheels; precision hardware products, including camshafts, hammers, and anvils; planetary products, corners, and turbine worm gearboxes; and cup and top hat type products, and integrated harmonic drives. The company's products are primarily used in power and garden tools, industrial sewing machines, yacht industries, automobiles, medical machinery equipment, and industrial robots. Khgears International Limited was founded in 2014 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.khgears.com",
        "market_cap": "Mid Cap"
    },
    "4581.TW": {
        "short_name": "WORLD KNOWN MFG (CAYMAN) LTD",
        "long_name": "World Known MFG (Cayman) Limited",
        "summary": "World Known MFG (Cayman) Limited produces and sells commercial vehicle parts in the United States, the United Kingdom, Sweden, Denmark, and Japan. The company offers exhaust manifolds, disc brakes, gearbox and pump housing products, and knuckles; and diesel engine and air disc brake components. It serves customers in commercial vehicle, green energy, construction machinery, agricultural machinery, and other industrial equipment industries. The company was founded in 2015 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.wkgroup.com",
        "market_cap": "Small Cap"
    },
    "4763.TW": {
        "short_name": "JINAN ACETATE CHEMICAL CO.",
        "long_name": "Jinan Acetate Chemical Co., Ltd.",
        "summary": "Jinan Acetate Chemical Co., Ltd. engages in the research and development, production, and sale of cellulose diacetate, cellulose acetate tows, and other related products in Asia, the United States, Africa, and Europe. Its products are used in cigarette filters, water-based pen refills, diaper absorbing lining, and clothes; and glasses frame and tool handles, etc. The company was founded in 1999 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.acetek.com.cn",
        "market_cap": "Mid Cap"
    },
    "4804.TWO": {
        "short_name": "DA LUE INTERNATIONAL HOLDING CO",
        "long_name": "Da Lue International Holding Company Limited",
        "summary": "Da Lue International Holding Company Limited, an investment holding company, provides various wedding services in China. The company offers wedding planning, witnesses ceremony, and wedding dress rental services, as well as wedding photography and video, and other wedding-related services; and wedding banquet, and conference and exhibition services It is also involved in the rental and sale of clothing and flowers, operation of hotels, and real estate business. In addition, the company offers catering and catering management services; and technology development, technical consulting, and other services in the field of network technology. The company's brand portfolio includes Victoria Wedding Club, Coloration LISA Wedding Photography, Taiwan North Suoluo Wedding Photography, Jennifer Wedding Photography, Princess Wedding Photography, Pujue Hotel, and Vienna Hotel. Da Lue International Holding Company Limited was founded in 2011 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.dalue.com.tw",
        "market_cap": "Small Cap"
    },
    "4927.TW": {
        "short_name": "APEX INTERNATIONAL CO LTD",
        "long_name": "Apex International Co., Ltd.",
        "summary": "Apex International Co., Ltd. manufactures and sells printed circuit boards in Taiwan. The company offers double-sided and multi-layer printed circuit boards for use in LCD TVs, hard disks, printers, set-top boxes, router, telephone, car audio, and navigator. It also exports its products. The company was founded in 2001 and is based in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "1208",
        "website": "http://www.apex-intl.com.tw",
        "market_cap": "Large Cap"
    },
    "4943.TW": {
        "short_name": "CONCRAFT HOLDING CO LTD",
        "long_name": "Concraft Holding Co., Ltd.",
        "summary": "Concraft Holding Co., Ltd. develops, manufactures, and sells connectors under the CONCRAFT brand name in China, Taiwan, and internationally. The company offers various types of connectors that are used in notebooks, mobile devices, LED TVs, set top boxes, networking, etc.; acoustic components, including receiver, speaker, speaker box, and speaker module components; and optical components, such as VCM components, yokes, lens holders, and base products for use in various electronic devices comprising digital cameras, cell phone cameras, webcams, car cams and security cameras, etc. It also provides automotive components, which include sensor parts, in-car cameras, press fit connectors, ABS controllers and components, fuel injectors, mechatronics parts, ECU parts, solenoid valves, lamp holders, and switchers; and medical components, such as filters, silicone masks, biopsy forceps, valve parts, T- connectors and Y- connectors, luer- connectors, syringe plungers, blood glucose housing parts, and blood pressure housing parts. The company was founded in 1991 and is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.concraft.com.tw",
        "market_cap": "Large Cap"
    },
    "4966.TWO": {
        "short_name": "PARADE TECHNOLOGIES LTD",
        "long_name": "Parade Technologies, Ltd.",
        "summary": "Parade Technologies, Ltd., a fabless semiconductor company, designs, develops, and sells high-speed interface standards, and touch controller and display processing integrated circuit (IC) chips for products used in computers, consumer electronics, and display panels. The company offers display port LCD timing controllers, embedded display port timing controllers, display port format converters, display port transmitters and receivers, and scalers with display port and high definition multimedia interface (HDMI) inputs; high-speed interface solutions; display port based solutions; display port repeater and switch products, including serial advanced technology architecture, PCI express, HDMI/DVI, and universal serial bus products; source drivers; and truetouch controllers, and touch and display driver integrations, as well as mixed-signal ICs. It operates in South Korea, China, Taiwan, Japan, and internationally. Parade Technologies, Ltd. was founded in 2005 and is headquartered in George Town, Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": null,
        "website": "http://www.paradetech.com",
        "market_cap": "Large Cap"
    },
    "4991.TWO": {
        "short_name": "GCS HOLDINGS INC",
        "long_name": "GCS Holdings, Inc.",
        "summary": "GCS Holdings, Inc., together with its subsidiaries, manufactures compound semiconductor wafer and foundry related services in China, the United States, Taiwan, and internationally. It also manufactures and sells optoelectronics technology products and optical chips, as well as grants royalty rights for intellectual property. In addition, the company develops, manufactures, and sells mobile phone radio frequency, filter, optical communication chip, power management, and optical fiber products, as well as positive, intrinsic, negative components, and avalanche photo diodes for telecommunication systems and data communication networks; and engages in manufacturing, retailing, and wholesaling telecommunication devices and electronic components. Further, it provides product design, outsourcing management, and research development services. The company serves wireless devices and fiber-optic communication providers. GCS Holdings, Inc. was founded in 1997 and is based in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9005",
        "website": "http://www.gcsincorp.com",
        "market_cap": "Mid Cap"
    },
    "5223.TWO": {
        "short_name": "ANLI INTERNATIONAL CO LTD",
        "long_name": "Anli International Co., Ltd.",
        "summary": "Anli International Co., Ltd. primarily engages in the development, production, assembly, and sale of various precision metal stamping and magnesium aluminum die casting in China and Taiwan. The company is also involved in the design, research, and development of electronic components, vehicle components, new metal materials, machine parts, communication equipment, and computer software; manufacture of fine blanking die products; inductance components; metal finishing activities; and installation of automated equipment, as well as in CNC processing business.It also provides automotive products, optical communication products, vision system application products, household products, and other products. The company's stamped and cast metallic parts and components are used in notebook PCs, tablet PCs, desktop PCs, cell phones, wearable devices, internet communications, home appliances, and daily items. It primarily serves the computers, communications, and consumer electronics industries. The company was founded in 2010 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-9005",
        "website": "http://www.anli-group.com",
        "market_cap": "Mid Cap"
    },
    "5225.TW": {
        "short_name": "EASTECH HOLDING LTD",
        "long_name": "Eastech Holding Limited",
        "summary": "Eastech Holding Limited, together with its subsidiaries, researches and develops, designs, manufactures, and sells speaker systems and earphones in China, Hong Kong, Japan, South Korea, the Netherlands, Sweden, and internationally. It offers home audio products, such as Dolby atoms sound bars, sound bars with wireless surround, and google voice assistant (GVA)/Alexa speaker systems, and home theaters; car speakers; personal audio products comprising Bluetooth and Airplay 2 and Wi-Fi speakers, VUI GVA AI speakers, true wireless stereo speaker/earphone, etc.; premium and automotive transducers under the PUNKTKILDE brand; and molds and acoustic kits. It also engages in the import and export trading of audio and headphone products, machinery, and equipment. The company was formerly known as Eastern Technologies Holding Limited and changed its name to Eastech Holding Limited in June 2017. Eastech Holding Limited was founded in 1971 and is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.eastech.com",
        "market_cap": "Small Cap"
    },
    "5281.TWO": {
        "short_name": "STRONGLED LIGHTING SYSTEM CO LT",
        "long_name": "StrongLED Lighting Systems (Cayman) Co., Ltd.",
        "summary": "StrongLED Lighting Systems (Cayman) Co., Ltd., an investment holding, researches, develops, manufactures, and sells LED lighting equipment in China. The company offers outdoor LED lighting products, including LED flood lights, linear lights, dot pixel lights, and in-ground/underwater lights; and indoor LED lighting products, such as LED wall washers, wall grazers, linear lights, flexible strips, downlights, dot pixel lights, and module lights, as well as smart lighting products, panel lights, and pendant lights. It also provides LED lighting control systems and software; intelligent lighting controllers, touch control panels, and LED lighting circuit expanders; and LED power supplies for indoor and outdoor lighting systems. StrongLED Lighting Systems (Cayman) Co., Ltd. was founded in 2002 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.strongled.com",
        "market_cap": "Small Cap"
    },
    "5284.TW": {
        "short_name": "JPP HOLDING COMPANY LIMITED",
        "long_name": "JPP Holding Company Limited",
        "summary": "JPP Holding Company Limited manufactures and sells various mechanical parts, enclosures, and electronic products for the aerospace, telecommunication, electronics, energy, healthcare, and food industries in the Cayman Islands and internationally. The company offers enclosures of flight control computers; and mechanical parts for the cockpit electronics of aircraft with a range of equipment, subsystems, and systems for flight control, navigation, communication, electrical systems, etc. It also provides monitor control cabinets, optical fiber communication system cabinets, 3G telecommunication cabinets, 4G LTE telecommunication cabinets, telephone system switch box+ IP phone system cabinets, telecommunication system cooling set-up boxes, multi-media self-refill billing machines, and bill's for exchange system casing and related products. In addition, the company offers mechanical parts and sub-assemblies of 3D motion picture projectors for digital cinema, surveillance system, and camera internal assembly components; industrial ventilation system chassis; and cash register assemblies. Further, it provides solar system related mechanical parts and assemblies, and solar power AC/DC power converter enclosures; mechanical parts of X-rays, medical displays, surgical operation tables, pharmaceutical carts, MRI cabinets, etc.; and mechanical parts and enclosures of automatic check weighers, metal detectors, meat analyzers, milk analyzers, etc. Additionally, the company designs, manufactures, and sells customized precision sheet metal products; and provision of after-sale services, and aerospace surface treatment and industrial painting services. It serves customers operating in the communications, electronics, aerospace, medical, green energy, food equipment, automobiles, transportation, and other industries. The company was founded in 1998 and is headquartered in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9005",
        "website": "http://www.jppholding.com",
        "market_cap": "Small Cap"
    },
    "5538.TW": {
        "short_name": "TONG MING ENTERPRISE CO LTD",
        "long_name": "Tong Ming Enterprise Co., Ltd.",
        "summary": "Tong Ming Enterprise Co., Ltd., together with its subsidiaries, manufactures and sells stainless steel fasteners and wires under the TONG brand name primarily in Mainland China. The company offers fasteners, such as screws, nuts, and threaded rods for use in mechanical engineering, energy, communication, and construction fields; and stainless steel wires, which are used as customized raw materials for manufacturing small sized screws, kitchen supplies, wire belts, redrawing wires, and springs. It also engages in investment business. The company was founded in 2009 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1003",
        "website": "http://www.tonggroup.com.tw",
        "market_cap": "Mid Cap"
    },
    "5543.TWO": {
        "short_name": "BUIMA GROUP INC",
        "long_name": "Buima Group Inc.",
        "summary": "Buima Group Inc. engages in the research, design, development, production, and sale of metal building materials in China, rest of Asia, Europe, and internationally. The company offers metal ceiling, such as corrugated board; grid, juno, and tube ceiling; and metal mesh board, square ceiling system, and the clip in ceiling system. It also provides various ceiling grid, such as premium, cliq, buima line, smart, deco, V-grid, eco, and a-line. In addition, the company offers Xing Li, Xing Chai, and Xingde compartment systems, as well as data room decorative wall panel, metal compartment, SD steel door, decorative metal wall panel, office compartment, and glass compartment systems. Further, it engages in punching technology, high-precision leveling technology, and commodity development activities. The company's products are used in medical and biology medicines, aerospace science and technology, cloud data center, and public construction and commercial space applications, as well as engineering, commercial office buildings, and electronic factories applications. The company was founded in 2009 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.buima.com.tw",
        "market_cap": "Mid Cap"
    },
    "5546.TW": {
        "short_name": "YONGGU GROUP INC",
        "long_name": "Yonggu Group Inc.",
        "summary": "Yonggu Group Inc. engages in the production and sale of ready-mixed commercial concrete, fly ash, and cement. It offers ready-mixed mortar, grinding stone powder, and composite material. The company was founded in 1999 is based in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.yg1999.com",
        "market_cap": "Mid Cap"
    },
    "5906.TW": {
        "short_name": "TAINAN ENTERPRISE(CAYMAN)CO LTD",
        "long_name": "Tainan Enterprise (Cayman) Co., Limited",
        "summary": "Tainan Enterprise (Cayman) Co., Limited designs, develops, produces, and sells clothing products in China. It offers urban fashion and casual men's and women's wear, sportswear, dresses, and accessories. The company markets and sells its products under the TONY JEANS, TONY UOMO, TJL, VOV, G-cut, Emely, and Emely Sweetie brand names. It also operates as sales representative of FILA brand apparel and accessories. The company was founded in 1999 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1205",
        "website": "http://www.tainancayman.com",
        "market_cap": "Small Cap"
    },
    "5NVA.F": {
        "short_name": "NAVIOS MARIT.AC.DL -,0001",
        "long_name": "Navios Maritime Acquisition Corporation",
        "summary": "Navios Maritime Acquisition Corporation provides marine transportation services worldwide. The company owns a fleet of crude oil, refined petroleum product, and chemical tankers. The company charters its vessels to oil companies, refiners, and large vessel operators. As of April 20, 2021, its fleet consisted of a total of 46 double-hulled tanker vessels, aggregating approximately 6.0 million deadweight tons, which includes 13 very large crude carrier tankers (VLCCs), including two bareboat chartered-in VLCCs. Navios Maritime Acquisition Corporation was founded in 2008 and is based in Grand Cayman, Cayman Islands.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "1104",
        "website": "http://www.navios-acquisition.com",
        "market_cap": "Small Cap"
    },
    "6451.TW": {
        "short_name": "SHUNSIN TECHNOLOGY HOLDINGS LTD",
        "long_name": "ShunSin Technology Holdings Limited",
        "summary": "ShunSin Technology Holdings Limited, through its subsidiaries, engages in the assembly, testing, and sales of various integrated circuits related to semiconductors in Mainland China, the United States, Taiwan, Malaysia, Singapore, and internationally. It offers semiconductor integrated circuit, such as power amplifier (PA), antenna switch module, filter, duplexer, etc. packaging and testing services for communication modules of smart phones; wafer thinning, cutting, and packaging inspection services for module processes; sensors, including micro electro-mechanical systems (MEMS) packaging and testing services for gyroscopes, ambient light sensors, etc. for use in sensing module of smart mobile phone; optical transceiver module packaging and testing services for storage and transmission of enterprise servers and cloud servers; and hybrid integrated circuit module for medical electronics, such as microphone module for hearing aids. The company also provides assembling and testing of automotive electronic parts for vehicle smart keys and vehicle media control system; 3d sensing front-end modules for biometric module of smartphone; and smartwatch mainboard assembly and testing for personal sports and intelligent health monitoring. Its products include system in package module, including 2G/2.5G/3G/4G front end and PA, PA, WiFi front end, mobile WiFi, and antenna switch modules; optical transceivers; thick film integrated circuits; finger print sensor products; micro vibration motors; concentrated photovoltaic (CPV) modules comprising CPV front end modules, electrical and optical sub-assemblies, and receivers; and MEMS modules and sensors, such as accelerometers, gyroscopes, G-sensors, pressure and gesture sensors, light and proximity sensors, BAW filters, and TOF sensors. ShunSin Technology Holdings Limited was founded in 2008 and is headquartered in Grand Cayman, the Cayman Islands. ShunSin Technology Holdings Limited is a subsidiary of Foxconn (Far East) Limited.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1205",
        "website": "http://www.shunsintech.com",
        "market_cap": "Large Cap"
    },
    "6456.TW": {
        "short_name": "GENERAL INTERFACE SOLUTION HOLD",
        "long_name": "General Interface Solution (GIS) Holding Limited",
        "summary": "General Interface Solution (GIS) Holding Limited engages in the research, development, production, and sales of touch and display modules in the United States, China, Singapore, Japan, Taiwan, and internationally. The company offers touch display solutions combining cover glass, touch sensors, and TFT-LCD display modules, as well as provides after sales services. It is also involved in the manufacture and sale of biometric systems, touch systems, and flat panel displays, as well as its materials; sale of fingerprint recognition products; and research of biomedical services. The company's products are used in wearable devices, mobile phones, tablet PCs, notebooks, automotive devices, AIO products, PND, portable TVs, and interactive whiteboards. General Interface Solution (GIS) Holding Limited was founded in 2011 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1205",
        "website": "http://www.gis-touch.com",
        "market_cap": "Large Cap"
    },
    "6541.TW": {
        "short_name": "TANVEX BIOPHARMA INC",
        "long_name": "Tanvex BioPharma, Inc.",
        "summary": "Tanvex BioPharma, Inc., a biopharmaceutical company, engages in the research, development, manufacture, and sale of biosimilar and biologic products and drugs in Taiwan and the United States. Its products pipeline include TX01, which has completed phase III clinical trials; TX05, which is in phase III clinical trials for the treatment of cancer; TX16 which is in phase I; and other products. The company was formerly known as Ruenvex Biotech, Inc. Tanvex BioPharma, Inc. was incorporated in 2013 and is based in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1205",
        "website": "http://www.tanvex.com",
        "market_cap": "Large Cap"
    },
    "6616.TWO": {
        "short_name": "TECHCENTIAL INTERNATIONAL LTD",
        "long_name": "Techcential International Ltd",
        "summary": "Techcential International Ltd, an investment holding company, designs, manufactures, and sells American wooden bedroom furniture products. It offers 5-piece bedroom furniture, including bed frames, night stand, dresser, chest, and mirror. The company also engages in the production and manufacturing of wood pellets; processing and manufacturing of rubber wood raw materials; and wholesale of wooden restaurant furniture and children's bed furniture. It has operations in the United States, Malaysia, Canada, and internationally. Techcential International Ltd was founded in 2001 and is based in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "1002",
        "website": "http://www.techcential-international.com",
        "market_cap": "Small Cap"
    },
    "6666.TW": {
        "short_name": "LUO LIH FEN HOLDING CO LTD",
        "long_name": "Luo Lih-Fen Holding Co., Ltd.",
        "summary": "Luo Lih-Fen Holding Co., Ltd. researches and develops, manufactures, and sells facial beauty care and cosmetic products in Mainland China. The company provides various beauty and health care products under the Glingluo, Sunlily, Draise, Qiecome, Liruoya, and EasyBio brand names, as well as offers beauty and skin care consulting services. It also provides deal management and related personnel training services. The company sells its products to beauty and cosmetic stores through dealers. Luo Lih-Fen Holding Co., Ltd. was founded in 2016 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": null,
        "website": "http://www.luolihfen.com",
        "market_cap": "Mid Cap"
    },
    "6671.TW": {
        "short_name": "SAN NENG GROUP HOLDINGS CO LTD",
        "long_name": "San Neng Group Holdings Co., Ltd.",
        "summary": "San Neng Group Holdings Co., Ltd., through its subsidiaries, engages in the research, development, production, and sale of baking equipment and peripheral products in Taiwan, Mainland China, Japan, and internationally. The company offers baking molds, including baking trays, toast boxes, cake molds, and pie plates; baking appliances comprising eggbeaters and egg whisks, mixing bowls, pastry tubes, pastry bags, revolving cake stands, knives, and trolleys used for baking, and other items that are not required in ovens; and ingredients, such as flour, prepared mix, fillings, fats and oils, food coloring, and other baking materials. It also provides pre-store and interconnected products; utensils for production of bread, cakes, biscuits, candies, Chinese style pastries, and snacks; customized products for central factories, chain bakeries, bakery shops, etc.; and household appliances, as well as kitchen supplies. The company sells its products under the SANNENG and UNOPAN brands. San Neng Group Holdings Co., Ltd. was founded in 2015 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.sannenggroup.com",
        "market_cap": "Mid Cap"
    },
    "6672.TW": {
        "short_name": "VENTEC INTERNATIONAL GROUP CO L",
        "long_name": "Ventec International Group Co.,Ltd.",
        "summary": "Ventec International Group Co., Ltd. designs, develops, manufactures, and sells copper clad laminates, aluminum-backed laminates, and prepreg bonding materials. Its products include standard FR4, lead free assembly, halogen free products, tec-thermal/thermal management and insulated metal substrate, thermal interface material, polyimide, tec-speed/signal integrity products, flex/flex rigid products, plastic interleaver and release film consumables, drill entry and exit material, copper foils and ACF, and masslam and drill products, as well as products for special applications. The company's products are used for the fabrication of various printed circuit board applications. It also engages in general investment and international trade business. The company operates in China, the United Kingdom, the United States, Germany, and Taiwan. Ventec International Group Co., Ltd. was founded in 2000 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.ventec-group.com",
        "market_cap": "Large Cap"
    },
    "7KM.F": {
        "short_name": "SEALAND CAP. GA. LS-,0001",
        "long_name": "Sealand Capital Galaxy Limited",
        "summary": "Sealand Capital Galaxy Limited, together with its subsidiaries, engages in the digital marketing and other IT related businesses in Macau, Hong Kong, Mainland China, and internationally. The company provides various services on enlisting merchants to mobile payment gateways and digital advertising services; and sells secured social communication and advertising products through Metalk. It sells and distributes mobile game; and offers IT related development and support services, as well as sells goods through internet, and provides provision of consultancy services related to e-commerce. The company was founded in 2015 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1107",
        "website": "http://scg-ltd.com",
        "market_cap": "Small Cap"
    },
    "8404.TW": {
        "short_name": "PAIHO SHIH HOLDING CORPORATION",
        "long_name": "Paiho Shih Holdings Corporation",
        "summary": "Paiho Shih Holdings Corporation, through its subsidiaries, manufactures and sells touch fastener, webbing, elastic, jacquard engineered mesh, and related peripheral materials in China and internationally. Its touch fastener products are used in shoes, garments, raincoats, caps, sporting goods, belts, and other applications; webbing products that include woven strips and shoelaces are used in accessories for decoration of shoe uppers, eyelets and laces, leathers, rear straps for sport bags, caps, and other applications; elastic products are used in pant straps, jacket lower hems, cuffs, shoe upper clothes, and other applications; and jacquard engineered mesh products are used in shoes, garments, sporting goods, child carts, baby goods, household textiles, and other applications. The company also engages in the commercial property management; selling and leasing of real estate properties; planning and consultation activities; and designing and decoration activities. In addition, it offers consumer electronic accessories; and masks and non-woven products. The company was founded in 2001 and is headquartered in Grand Cayman, the Cayman Islands. Paiho Shih Holdings Corporation is a subsidiary of Paiho Int'l Limited.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KYI-1208",
        "website": "http://www.paiho.cn",
        "market_cap": "Large Cap"
    },
    "8406.TWO": {
        "short_name": "GINKO INTERNATIONAL CO LTD",
        "long_name": "Ginko International Co., Ltd.",
        "summary": "Ginko International Co., Ltd., together with its subsidiaries, manufactures and sells non-disposable and disposable contact lenses, and lens care products in China, Germany, the United Kingdom, Australia, Poland, Canada, Brazil, Iran, and internationally. The company offers various optical products, such as high definition contact lenses, toric lenses, cosmetic lenses, and others, as well as lens solutions under the Horien and Hydron brands. Ginko International Co., Ltd. was founded in 2007 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1205",
        "website": "http://www.ginkointernational.com",
        "market_cap": "Large Cap"
    },
    "8411.TW": {
        "short_name": "KINGCAN HOLDINGS LIMITED",
        "long_name": "Kingcan Holdings Limited",
        "summary": "Kingcan Holdings Limited researches and develops, produces, and sells metal packaging and food cans, and related raw materials in China. It manufactures, imports, and exports tinplate cans, such as beverage, vegetables, and food cans; aluminum cans; and can lids for beverage and food cans, etc. The company also engages in international trading activities. Further, it provides professional one stop food and beverage canned filling OEM. The company also exports its products to the United States, Canada, Southeast Asia, India, the Middle East, and Yemen. The company was founded in 1998 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1 - 1205",
        "website": "http://tw.kingcan.net",
        "market_cap": "Mid Cap"
    },
    "8423.TWO": {
        "short_name": "POLYGREEN RESOURCES CO LTD",
        "long_name": "Polygreen Resources Co., Ltd.",
        "summary": "Polygreen Resources Co., Ltd., an investment holding company, engages in resource recycling and environmental protection business in Malaysia. The company manufactures and sells Tyrec, a tyrec reclaimed rubber for use in tires, conveyor belts, inner tubes, ring pads, rubber matting, shoe soles, vibration pads, dock fenders, and other rubber products; Burec, a butyl reclaimed rubber for use in butyl inner tubes, tire inner liners, butyl adhesives, and other butyl rubber-related products; and Narec, a natural inner tube reclaimed rubber for use in rubber matting, shoe soles, and other rubber products. Its products also comprise T-Mesh, a crumb rubber for use in various applications in rubber products as compounding substitute, such as tire, ring pads, and rubber matting; and rubber granules that are recycled from the tire and industrial rubber waste that is used in the underlayment for running tracks, children's playgrounds, gym, and rubber tiles. The company also exports its products to Japan, Europe, Taiwan, Vietnam, the Philippines, Indonesia, Thailand, Pakistan, China, the Middle East, Australia, Singapore, and internationally. It serves manufacturers in the tire and conveyor-belt industries. The company was founded in 1988 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.pgr.com.tw",
        "market_cap": "Small Cap"
    },
    "8427.TW": {
        "short_name": "KEYSHEEN (CAYMAN) HOLDINGS CO L",
        "long_name": "Keysheen (Cayman) Holdings Co., Limited",
        "summary": "Keysheen (Cayman) Holdings Co., Limited, an investment company, produces and sells outdoor leisure furniture-related products in the Cayman Islands, North America, Europe, Oceania, Africa, and Asia. It operates through Department of Outdoor Furniture and Department of Rattan Tables and Chairs segments. The Department of Outdoor Furniture segment engages in the production of various outdoor steel furniture and home textiles. The Department of Rattan Tables and Chairs segment produces outdoor metal and artificial plastic rattan tables and chairs, and equipment. The company was founded in 1972 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1106",
        "website": "http://www.keysheen.com",
        "market_cap": "Mid Cap"
    },
    "8429.TW": {
        "short_name": "JINLI GROUP HOLDINGS LTD",
        "long_name": "Jinli Group Holdings Limited",
        "summary": "Jinli Group Holdings Limited designs, manufactures, and sells casual and sports shoes in China. It also designs and sells casual wear, including denim and accessories. The company sells its products through agents and footwear traders. Jinli Group Holdings Limited was founded in 2010 is based in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1104",
        "website": "http://www.jinli.net.cn",
        "market_cap": "Mid Cap"
    },
    "8437.TWO": {
        "short_name": "DADI EARLY-CHILDHOOD EDUCATION ",
        "long_name": "Dadi Early-Childhood Education Group Limited",
        "summary": "Dadi Early-Childhood Education Group Limited, together with its subsidiaries, provides early childhood education management consulting services in Mainland China, Hong Kong, and Taiwan. It offers campus development, classroom decoration, curriculum design, and teaching materials and teaching aids development services; early childhood education supplies; preschool textbooks and toys; and preschool software. The company also wholesales and retails cultural and education products, musical instruments, educational and entertainment materials, computers and office equipment, and information software; and leases office equipment and teaching devices. In addition, it engages in the trading business; IPRs; provision of system integration services; books, audio, and software publication business; and provision of management consultation, general advertising, product design, art and culture, agent, convention and exhibition, and overseas study services. The company was founded in 2008 and is headquartered in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY 1-9005",
        "website": "http://www.edudadi.com",
        "market_cap": "Mid Cap"
    },
    "8466.TW": {
        "short_name": "MJ INTERNATIONAL CO LTD",
        "long_name": "M.J. International Co., Ltd.",
        "summary": "M.J. International Co., Ltd., together with its subsidiaries, engages in the development, production, and sales of luxury vinyl tile (LVT) floors. The company offers rigid core, LVT click, non-polyvinyl chloride, LVT dry back wood and stone design, and LVT dry back carpet and exclusive design products for commercial and residential customers. It also engages in the production and sales of titles, and decoration and construction materials. The company operates in Europe, North America, Mainland China, Taiwan, and internationally. M.J. International Co., Ltd. was founded in 1982 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.mjig.com",
        "market_cap": "Mid Cap"
    },
    "8467.TW": {
        "short_name": "BONNY WORLDWIDE LTD",
        "long_name": "Bonny Worldwide Limited",
        "summary": "Bonny Worldwide Limited, together with its subsidiaries, manufactures and sells OEM and ODM carbon fiber rackets and related sporting goods under the BONNY brand name. The company offers hockey sticks, tennis rackets, and badminton rackets. It also provides helmets for the goalkeepers, squash rackets, shuttlecocks, tennis balls, athletic shoes, sportswear, and travel bags, as well as other accessories. In addition, it operates and manages a sports center. The company has operations in North America, China, Taiwan, and internationally. Bonny Worldwide Limited was founded in 1982 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1104",
        "website": "http://www.bonnyworldwide.com",
        "market_cap": "Mid Cap"
    },
    "8488.TW": {
        "short_name": "JIYUAN PACKAGING HOLDINGS LTD",
        "long_name": "Jiyuan Packaging Holdings Limited",
        "summary": "Jiyuan Packaging Holdings Limited, an investment holding company, produces and sells three-piece tin and two-piece aluminum cans in China. The company's tinplate can products are used in the packaging of soft drinks, such as eight-treasure porridge and other granular drinks, protein drinks, coffee and fruit juice, and food cans; and aluminum cans for the packaging of carbonated beverages, beers, herbal teas, and other packages. It also provides tin cans, paper bowls, bottles, and plastic color-printing process services. The company was founded in 2014 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1003",
        "website": "http://www.jypkg.com",
        "market_cap": "Small Cap"
    },
    "9802.TW": {
        "short_name": "FULGENT SUN INTERNATIONAL CO LT",
        "long_name": "Fulgent Sun International (Holding) Co., Ltd.",
        "summary": "Fulgent Sun International (Holding) Co., Ltd., together with its subsidiaries, engages in the production and sale of sports and leisure outdoor footwear in Taiwan. Its products are used in mountain climbing, snow walking, medical correction, jogging, hiking, and other casual activities. The company is also involved in distribution agent, and import and export trade; processing and sale of clothing products; lease of land businesses. It exports its products in Asia, Europe, Africa, Australia, and the Americas. Fulgent Sun International (Holding) Co., Ltd. was founded in 1995 and is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1104",
        "website": "http://www.fulgentsun.com",
        "market_cap": "Large Cap"
    },
    "AC9.F": {
        "short_name": "AVANTI ACQ. CL.A DL-,0001",
        "long_name": "Avanti Acquisition Corp.",
        "summary": "Avanti Acquisition Corp. does not have significant operations. It intends to effect a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization, or similar business combination with one or more businesses or entities. The company was incorporated in 2020 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1102",
        "website": "http://www.avanti-acquisition.com",
        "market_cap": "Small Cap"
    },
    "AIQ.L": {
        "short_name": "AIQ LIMITED ORD GBP0.01 (DI)",
        "long_name": "AIQ Limited",
        "summary": "AIQ Limited focuses on social commerce businesses comprising social media platforms. It primarily focuses on seeking opportunities in data mining, artificial intelligence technologies, and social and online media, such as instant messaging platforms, as well as in the e-commerce sector. The company was incorporated in 2017 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1106",
        "website": "http://www.aiqhub.com",
        "market_cap": "Small Cap"
    },
    "ALUS-UN": {
        "short_name": "Alussa Energy Acquisition Corp.",
        "long_name": "Alussa Energy Acquisition Corp.",
        "summary": "Alussa Energy Acquisition Corp. focuses on effecting a merger, capital share exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses. It intends to focus on the production, operation, and development of crude oil and natural gas wells and related infrastructure. The company was incorporated in 2019 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1106",
        "website": "http://www.alussaenergy.com",
        "market_cap": null
    },
    "ALUS": {
        "short_name": "Alussa Energy Acquisition Corp.",
        "long_name": "Alussa Energy Acquisition Corp.",
        "summary": "Alussa Energy Acquisition Corp. focuses on effecting a merger, capital share exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses. It intends to focus on the production, operation, and development of crude oil and natural gas wells and related infrastructure. The company was incorporated in 2019 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1106",
        "website": "http://www.alussaenergy.com",
        "market_cap": "Small Cap"
    },
    "AVAN": {
        "short_name": "Avanti Acquisition Corp.",
        "long_name": "Avanti Acquisition Corp.",
        "summary": "Avanti Acquisition Corp. does not have significant operations. It intends to effect a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization, or similar business combination with one or more businesses or entities. The company was incorporated in 2020 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1102",
        "website": "http://www.avanti-acquisition.com",
        "market_cap": "Small Cap"
    },
    "BTAQ": {
        "short_name": "Burgundy Technology Acquisition",
        "long_name": "Burgundy Technology Acquisition Corporation",
        "summary": "Burgundy Technology Acquisition Corporation intends to effect a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. It focuses on public and private opportunities in the technology sector, primarily companies in enterprise software or technology-enabled services. The company was incorporated in 2020 and is based in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1104",
        "website": null,
        "market_cap": "Small Cap"
    },
    "BTAQU": {
        "short_name": "Burgundy Technology Acquisition",
        "long_name": "Burgundy Technology Acquisition Corporation",
        "summary": "Burgundy Technology Acquisition Corporation intends to effect a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. It focuses on public and private opportunities in the technology sector, primarily companies in enterprise software or technology-enabled services. The company was incorporated in 2020 and is based in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1104",
        "website": null,
        "market_cap": "Small Cap"
    },
    "CFEGF": {
        "short_name": "CHINA NONFERROUS GOLD LTD",
        "long_name": "China Nonferrous Gold Limited",
        "summary": "China Nonferrous Gold Limited explores, mines, and develops mineral properties. It primarily holds a 100% interest in the Pakrut gold project located in the southern Tien-Shan Fold belt, Tajikistan. The company was formerly known as Kryso Resources Corporation Limited and changed its name to China Nonferrous Gold Limited in October 2013. The company was incorporated in 2013 and is based in George Town, Cayman Islands. China Nonferrous Gold Limited is a subsidiary of China Nonferrous Metals Mining (Group) Co. Limited.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Gold",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9005",
        "website": "http://www.cnfgold.com",
        "market_cap": "Small Cap"
    },
    "CNG.L": {
        "short_name": "CHINA NONFERROUS GOLD LIMITED O",
        "long_name": "China Nonferrous Gold Limited",
        "summary": "China Nonferrous Gold Limited explores, mines, and develops mineral properties. It primarily holds a 100% interest in the Pakrut gold project located in the southern Tien-Shan Fold belt, Tajikistan. The company was formerly known as Kryso Resources Corporation Limited and changed its name to China Nonferrous Gold Limited in October 2013. The company was incorporated in 2013 and is based in George Town, Cayman Islands. China Nonferrous Gold Limited is a subsidiary of China Nonferrous Metals Mining (Group) Co. Limited.",
        "currency": "GBp",
        "sector": "Basic Materials",
        "industry": "Gold",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9005",
        "website": "http://www.cnfgold.com",
        "market_cap": "Small Cap"
    },
    "CUP-U.TO": {
        "short_name": "CARIBBEAN UTIL US",
        "long_name": "Caribbean Utilities Company, Ltd.",
        "summary": "Caribbean Utilities Company, Ltd. generates and distributes electricity in Grand Cayman, the Cayman Islands. The company generates electricity using diesel. As of December 31, 2020, it's installed generating capacity is 161 MW. It also operates 8 transformer substations with approximately 476 miles of land-based high-voltage transmission and distribution lines, and 15 miles of high-voltage submarine cable. The company also provides telecommunication services. The company was incorporated in 1966 and is headquartered in Grand Cayman, the Cayman Islands. Caribbean Utilities Company, Ltd. is a subsidiary of Fortis Energy (Bermuda) Ltd.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1101",
        "website": "http://www.cuc-cayman.com",
        "market_cap": "Small Cap"
    },
    "CUPUF": {
        "short_name": "CARIBBEAN UTILITIES CO",
        "long_name": "Caribbean Utilities Company, Ltd.",
        "summary": "Caribbean Utilities Company, Ltd. generates and distributes electricity in Grand Cayman, the Cayman Islands. The company generates electricity using diesel. As of December 31, 2020, it's installed generating capacity is 161 MW. It also operates 8 transformer substations with approximately 476 miles of land-based high-voltage transmission and distribution lines, and 15 miles of high-voltage submarine cable. The company also provides telecommunication services. The company was incorporated in 1966 and is headquartered in Grand Cayman, the Cayman Islands. Caribbean Utilities Company, Ltd. is a subsidiary of Fortis Energy (Bermuda) Ltd.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1101",
        "website": "http://www.cuc-cayman.com",
        "market_cap": "Small Cap"
    },
    "CW2.F": {
        "short_name": "CONSOLIDATED WATER CO.",
        "long_name": "Consolidated Water Co. Ltd.",
        "summary": "Consolidated Water Co. Ltd., together with its subsidiaries, designs, constructs, manages, and operates water production and water treatment plants primarily in the Cayman Islands, the Bahamas, and the United States. The company operates through four segments: Retail, Bulk, Services, and Manufacturing. It uses reverse osmosis technology to produce potable water from seawater. The company produces and supplies water to end-users, including residential, commercial, and government customers, as well as government-owned distributors. It also provides design, engineering, construction, procurement, and management services for desalination projects and water treatment plants, as well as management and engineering services relating to municipal water distribution and treatment. In addition, the company manufactures and services a range of water-related products, including reverse osmosis desalination equipment, membrane separation equipment, filtration equipment, piping systems, vessels, and custom fabricated components; and provides design, engineering, consulting, management, inspection, training, and equipment maintenance services for commercial, municipal, and industrial water production, supply, and treatment, as well as desalination and wastewater treatment. Consolidated Water Co. Ltd. was incorporated in 1973 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1102",
        "website": "http://www.cwco.com",
        "market_cap": "Small Cap"
    },
    "CWCO": {
        "short_name": "Consolidated Water Co. Ltd.",
        "long_name": "Consolidated Water Co. Ltd.",
        "summary": "Consolidated Water Co. Ltd., together with its subsidiaries, designs, constructs, manages, and operates water production and water treatment plants primarily in the Cayman Islands, the Bahamas, and the United States. The company operates through four segments: Retail, Bulk, Services, and Manufacturing. It uses reverse osmosis technology to produce potable water from seawater. The company produces and supplies water to end-users, including residential, commercial, and government customers, as well as government-owned distributors. It also provides design, engineering, construction, procurement, and management services for desalination projects and water treatment plants, as well as management and engineering services relating to municipal water distribution and treatment. In addition, the company manufactures and services a range of water-related products, including reverse osmosis desalination equipment, membrane separation equipment, filtration equipment, piping systems, vessels, and custom fabricated components; and provides design, engineering, consulting, management, inspection, training, and equipment maintenance services for commercial, municipal, and industrial water production, supply, and treatment, as well as desalination and wastewater treatment. Consolidated Water Co. Ltd. was incorporated in 1973 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1102",
        "website": "http://www.cwco.com",
        "market_cap": "Small Cap"
    },
    "CWNOF": {
        "short_name": "CHINESEWORLDNET.COM INC",
        "long_name": "Chineseworldnet.Com Inc.",
        "summary": "Chineseworldnet.com Inc. does not have significant operations. It intends to acquire or invest in other business opportunities. Previously, it was engaged in financial Web portal, investor relations and public relations, conference, and financial content and information distribution businesses. The company was incorporated in 2000 and is based in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1104",
        "website": null,
        "market_cap": "Small Cap"
    },
    "CXC1.SG": {
        "short_name": "Zoltav Resources Inc. Registere",
        "long_name": "Zoltav Resources Inc.",
        "summary": "Zoltav Resources Inc. acquires, explores for, develops, and produces hydrocarbons in Russia. The company holds interests in the Bortovoy license covering an area of 3,215 square kilometers with proved plus probable reserves of 750 billion cubic feet of gas, and 3.9 million barrels of oil and condensate located in the Saratov region of south western Russia. It also owns interests in the Koltogor exploration and production license containing the Koltogor oil field covering an area of 528 square kilometers with proved plus probable reserves of 79.2 million barrels of oil equivalent located in the Khantiy-Mansisk Autonomous Okrug of Western Siberia; and the Koltogor exploration and production license 10 containing the West Koltogor oil field covering an area of 167 square kilometers. Zoltav Resources Inc. was incorporated in 2003 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1001",
        "website": "http://www.zoltav.com",
        "market_cap": "Small Cap"
    },
    "EJH": {
        "short_name": "E-Home Household Service Holdin",
        "long_name": "E-Home Household Service Holdings Limited",
        "summary": "E-Home Household Service Holdings Limited operates as an integrated household service company in the People's Republic of China. The company operates through three segments: Installation and Maintenance, Housekeeping, and Senior Care Services. It engages in the delivery, installation, and repair and maintenance of home appliances, such as refrigerators, stoves, air conditioners, water heaters, and washing machines; and provision of home-moving, house cleaning, and nanny and maternity matron services, as well as senior care services through its Website and WeChat platform. The company also offers its services through offline channels. Its customers primarily include individuals and families. E-Home Household Service Holdings Limited was incorporated in 2018 and is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "350001",
        "website": "http://www.ej111.com",
        "market_cap": "Small Cap"
    },
    "FAN.F": {
        "short_name": "FABRINET  DL-,01",
        "long_name": "Fabrinet",
        "summary": "Fabrinet provides optical packaging and precision optical, electro-mechanical, and electronic manufacturing services in North America, the Asia-Pacific, and Europe. The company offers a range of advanced optical and electro-mechanical capabilities in the manufacturing process, including process design and engineering, supply chain management, manufacturing, printed circuit board assembly, advanced packaging, integration, final assembly, and testing. Its products include switching products, including reconfigurable optical add-drop multiplexers, optical amplifiers, modulators, and other optical components and modules that enable network managers to route voice, video, and data communications traffic through fiber optic cables at various wavelengths, speeds, and over various distances. The company's products also comprise tunable lasers, transceivers, and transponders; and active optical cables, which provide high-speed interconnect capabilities for data centers and computing clusters, as well as Infiniband, Ethernet, fiber channel, and optical backplane connectivity. In addition, it provides solid state, diode-pumped, gas, and fiber lasers used in semiconductor processing, biotechnology and medical device, metrology, and material processing industries; and differential pressure, micro-gyro, fuel, and other sensors used in automobiles, as well as non-contact temperature measurement sensors for the medical industry. Further, the company designs and fabricates application-specific crystals, lenses, prisms, mirrors, laser components, and substrates; and other custom and standard borosilicate, clear fused quartz, and synthetic fused silica glass products. It serves original equipment manufacturers of optical communication components, modules and sub-systems, industrial lasers, automotive components, medical devices, and sensors. The company was incorporated in 1999 and is based in George Town, the Cayman Islands.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9005",
        "website": "http://www.fabrinet.com",
        "market_cap": "Mid Cap"
    },
    "FDM.F": {
        "short_name": "FRESH DEL MONTE PROD.",
        "long_name": "Fresh Del Monte Produce Inc.",
        "summary": "Fresh Del Monte Produce Inc., through its subsidiaries, produces, markets, and distributes fresh and fresh-cut fruits and vegetables in North America, Europe, the Middle East, Africa, Asia, and internationally. It offers fresh and value added products, such as pineapples, melons, grapes, apples, citrus, blueberries, strawberries, pears, tomatoes, peaches, plums, nectarines, cherries and kiwis, avocados, fresh-cut and prepared fruits and vegetables, juices and other beverages, prepared meals and snacks, bananas, and other fruits and vegetables. The company also engages in poultry and meat products business; and ocean freight business. In addition, it manufactures and sells plastic and box products, such as bins, trays, bags, and boxes. The company offers its products under the Del Monte brand, as well as under other brands, such as UTC, Rosy, Fruit Express, Just Juice, Fruitini, Mann's Logo, Arcadian Harvest, Nourish Bowls, Broccolini, Caulilini, Better Burger Leaf, RomaLeaf, and other regional brands. It markets and distributes its products to retail stores, club stores, convenience stores, wholesalers, distributors, and foodservice operators. Fresh Del Monte Produce Inc. was founded in 1886 and is based in George Town, Cayman Islands.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9005",
        "website": "http://www.freshdelmonte.com",
        "market_cap": "Small Cap"
    },
    "FDP": {
        "short_name": "Fresh Del Monte Produce, Inc.",
        "long_name": "Fresh Del Monte Produce Inc.",
        "summary": "Fresh Del Monte Produce Inc., through its subsidiaries, produces, markets, and distributes fresh and fresh-cut fruits and vegetables in North America, Europe, the Middle East, Africa, Asia, and internationally. It offers fresh and value added products, such as pineapples, melons, grapes, apples, citrus, blueberries, strawberries, pears, tomatoes, peaches, plums, nectarines, cherries and kiwis, avocados, fresh-cut and prepared fruits and vegetables, juices and other beverages, prepared meals and snacks, bananas, and other fruits and vegetables. The company also engages in poultry and meat products business; and ocean freight business. In addition, it manufactures and sells plastic and box products, such as bins, trays, bags, and boxes. The company offers its products under the Del Monte brand, as well as under other brands, such as UTC, Rosy, Fruit Express, Just Juice, Fruitini, Mann's Logo, Arcadian Harvest, Nourish Bowls, Broccolini, Caulilini, Better Burger Leaf, RomaLeaf, and other regional brands. It markets and distributes its products to retail stores, club stores, convenience stores, wholesalers, distributors, and foodservice operators. Fresh Del Monte Produce Inc. was founded in 1886 and is based in George Town, Cayman Islands.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9005",
        "website": "http://www.freshdelmonte.com",
        "market_cap": "Small Cap"
    },
    "FHAI": {
        "short_name": "FOUNTAIN HEALTHY AGING INC",
        "long_name": "Fountain Healthy Aging, Inc.",
        "summary": "Wei Lian Jin Meng Group Limited, through its subsidiaries, develops, produces, markets, and sells coffee tea products. It also offers black coffee products and other coffee products. The company sell its products wholesale to retail partners and corporate customers, as well as sells directly to consumers via its e-commerce channels in the People's Republic of China. The company is based in the Cayman Islands.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": null,
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "FN": {
        "short_name": "Fabrinet",
        "long_name": "Fabrinet",
        "summary": "Fabrinet provides optical packaging and precision optical, electro-mechanical, and electronic manufacturing services in North America, the Asia-Pacific, and Europe. The company offers a range of advanced optical and electro-mechanical capabilities in the manufacturing process, including process design and engineering, supply chain management, manufacturing, printed circuit board assembly, advanced packaging, integration, final assembly, and testing. Its products include switching products, including reconfigurable optical add-drop multiplexers, optical amplifiers, modulators, and other optical components and modules that enable network managers to route voice, video, and data communications traffic through fiber optic cables at various wavelengths, speeds, and over various distances. The company's products also comprise tunable lasers, transceivers, and transponders; and active optical cables, which provide high-speed interconnect capabilities for data centers and computing clusters, as well as Infiniband, Ethernet, fiber channel, and optical backplane connectivity. In addition, it provides solid state, diode-pumped, gas, and fiber lasers used in semiconductor processing, biotechnology and medical device, metrology, and material processing industries; and differential pressure, micro-gyro, fuel, and other sensors used in automobiles, as well as non-contact temperature measurement sensors for the medical industry. Further, the company designs and fabricates application-specific crystals, lenses, prisms, mirrors, laser components, and substrates; and other custom and standard borosilicate, clear fused quartz, and synthetic fused silica glass products. It serves original equipment manufacturers of optical communication components, modules and sub-systems, industrial lasers, automotive components, medical devices, and sensors. The company was incorporated in 1999 and is based in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9005",
        "website": "http://www.fabrinet.com",
        "market_cap": "Mid Cap"
    },
    "GFHG.L": {
        "short_name": "GRAND FORTUNE HIGH GRADE LIMITE",
        "long_name": "Grand Fortune High Grade Limited",
        "summary": "Grand Fortune High Grade Limited develops and operates financial training courses in China. The company was formerly known as New Horizons Ultra Limited and changed its name to Grand Fortune High Grade Limited in May 2016. The company was incorporated in 2015 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1107",
        "website": "http://www.gf-hg.com",
        "market_cap": "Small Cap"
    },
    "GLRE": {
        "short_name": "Greenlight Reinsurance, Ltd.",
        "long_name": "Greenlight Capital Re, Ltd.",
        "summary": "Greenlight Capital Re, Ltd., through its subsidiaries, operates as a property and casualty reinsurance company worldwide. The company offers various property reinsurance products and services, including automobile physical damage; personal lines, such as homeowners' insurance; and commercial lines. It also provides casualty reinsurance products and services comprising general liability, motor liability, professional liability, and worker's compensation; and accident and health, transactional liability, mortgage insurance, surety, trade credit, marine, aviation, crop, energy, cyber, political, and terrorism products. The company markets its products through reinsurance brokers. Greenlight Capital Re, Ltd. was incorporated in 2004 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance - Reinsurance",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1205",
        "website": "http://www.greenlightre.com",
        "market_cap": "Small Cap"
    },
    "IFOS.V": {
        "short_name": "ITAFOS",
        "long_name": "Itafos",
        "summary": "Itafos operates as a phosphate and specialty fertilizer platform company. It operates through Conda, Arraias, and Development and Exploration segments. The company produces and sells monoammonium phosphate (MAP), MAP with micronutrients, superphosphoric acid, merchant grade phosphoric acid, single superphosphate (SSP), SSP with micronutrients, and ammonium polyphosphate. It also owns 100% interests in the Farim, a phosphate mine project situated in Farim, Guinea-Bissau; AraxÃ¡, a rare earth element and niobium mine and extraction plant project that covers an area of approximately 226 hectares situated in Minas Gerais, Brazil; Paris Hills, a phosphate mine project, which covers an area of approximately 1,010 hectares located in Idaho, the United States; and Mantaro, a phosphate mine project that covers an area of approximately 12,800 hectares located in Junin, Peru, as well as 99.4% interest in the Santana, an integrated phosphate mine and fertilizer plant project, which covers an area of approximately 233,070 hectares located in ParÃ¡, Brazil. The company was formerly known as MBAC Fertilizer Corp. and changed its name to Itafos in December 2016. Itafos is based in George Town, the Cayman Islands. Itafos is a subsidiary of CL Fertilizers Holding LLC.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1104",
        "website": "http://www.itafos.com",
        "market_cap": "Small Cap"
    },
    "IMPX-UN": {
        "short_name": "AEA-Bridges Impact Corp.",
        "long_name": "AEA-Bridges Impact Corp.",
        "summary": "AEA-Bridges Impact Corp. does not have significant operations. It intends to effect a merger, amalgamation, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. The company was incorporated in 2020 and is based in Grand Cayman, Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1102",
        "website": "http://www.aeabridgesimpactcorp.com",
        "market_cap": null
    },
    "IMPX": {
        "short_name": "AEA-Bridges Impact Corp.",
        "long_name": "AEA-Bridges Impact Corp.",
        "summary": "AEA-Bridges Impact Corp. does not have significant operations. It intends to effect a merger, amalgamation, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. The company was incorporated in 2020 and is based in Grand Cayman, Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1102",
        "website": "http://www.aeabridgesimpactcorp.com",
        "market_cap": "Small Cap"
    },
    "KRB.F": {
        "short_name": "CN NONFERROUS GO.LS-,0001",
        "long_name": "China Nonferrous Gold Limited",
        "summary": "China Nonferrous Gold Limited explores, mines, and develops mineral properties. It primarily holds a 100% interest in the Pakrut gold project located in the southern Tien-Shan Fold belt, Tajikistan. The company was formerly known as Kryso Resources Corporation Limited and changed its name to China Nonferrous Gold Limited in October 2013. The company was incorporated in 2013 and is based in George Town, Cayman Islands. China Nonferrous Gold Limited is a subsidiary of China Nonferrous Metals Mining (Group) Co. Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Gold",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9005",
        "website": "http://www.cnfgold.com",
        "market_cap": "Small Cap"
    },
    "LVRAU": {
        "short_name": "Levere Holdings Corp.",
        "long_name": "Levere Holdings Corp.",
        "summary": "Levere Holdings Corp. intends to effect a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. The company was incorporated in 2021 and is based in Grand Cayman, Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1102",
        "website": null,
        "market_cap": null
    },
    "MAFL.L": {
        "short_name": "MINERAL & FINANCIAL INVESTMENTS",
        "long_name": "Mineral & Financial Investments Limited",
        "summary": "Mineral & Financial Investments Limited, an investment company, invests in natural resources, minerals, metals, and oil and gas projects in the Cayman Islands. Mineral & Financial Investments Limited is based in George Town, the Cayman Islands.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9005",
        "website": "http://www.mineralandfinancial.com",
        "market_cap": "Small Cap"
    },
    "MBCFF": {
        "short_name": "ITAFOS",
        "long_name": "Itafos",
        "summary": "Itafos operates as a phosphate and specialty fertilizer platform company. It operates through Conda, Arraias, and Development and Exploration segments. The company produces and sells monoammonium phosphate (MAP), MAP with micronutrients, superphosphoric acid, merchant grade phosphoric acid, single superphosphate (SSP), SSP with micronutrients, and ammonium polyphosphate. It also owns 100% interests in the Farim, a phosphate mine project situated in Farim, Guinea-Bissau; AraxÃ¡, a rare earth element and niobium mine and extraction plant project that covers an area of approximately 226 hectares situated in Minas Gerais, Brazil; Paris Hills, a phosphate mine project, which covers an area of approximately 1,010 hectares located in Idaho, the United States; and Mantaro, a phosphate mine project that covers an area of approximately 12,800 hectares located in Junin, Peru, as well as 99.4% interest in the Santana, an integrated phosphate mine and fertilizer plant project, which covers an area of approximately 233,070 hectares located in ParÃ¡, Brazil. The company was formerly known as MBAC Fertilizer Corp. and changed its name to Itafos in December 2016. Itafos is based in George Town, the Cayman Islands. Itafos is a subsidiary of CL Fertilizers Holding LLC.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1104",
        "website": "http://www.itafos.com",
        "market_cap": "Small Cap"
    },
    "MBN.F": {
        "short_name": "ITAFOS",
        "long_name": "Itafos",
        "summary": "Itafos operates as a phosphate and specialty fertilizer platform company. It operates through Conda, Arraias, and Development and Exploration segments. The company produces and sells monoammonium phosphate (MAP), MAP with micronutrients, superphosphoric acid, merchant grade phosphoric acid, single superphosphate (SSP), SSP with micronutrients, and ammonium polyphosphate. It also owns 100% interests in the Farim, a phosphate mine project situated in Farim, Guinea-Bissau; AraxÃ¡, a rare earth element and niobium mine and extraction plant project that covers an area of approximately 226 hectares situated in Minas Gerais, Brazil; Paris Hills, a phosphate mine project, which covers an area of approximately 1,010 hectares located in Idaho, the United States; and Mantaro, a phosphate mine project that covers an area of approximately 12,800 hectares located in Junin, Peru, as well as 99.4% interest in the Santana, an integrated phosphate mine and fertilizer plant project, which covers an area of approximately 233,070 hectares located in ParÃ¡, Brazil. The company was formerly known as MBAC Fertilizer Corp. and changed its name to Itafos in December 2016. Itafos is based in George Town, the Cayman Islands. Itafos is a subsidiary of CL Fertilizers Holding LLC.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1104",
        "website": "http://www.itafos.com",
        "market_cap": "Small Cap"
    },
    "MITO": {
        "short_name": "Stealth BioTherapeutics Corp.",
        "long_name": "Stealth BioTherapeutics Corp",
        "summary": "Stealth BioTherapeutics Corp, a clinical-stage biotechnology company, focuses on the discovery, development, and commercialization of therapies for diseases involving mitochondrial dysfunction. Its lead product candidate is Elamipretide that is in phase 3 clinical trial to treat barth syndrome, phase 2/3 clinical trial for the treatment of duchenne cardiomyopathy, phase 2a clinical trial to treat friedreich's ataxia, phase 2 clinical trial for the treatment of dry age-related macular degeneration, phase 2 clinical trial to treat leber's hereditary optic neuropathy, and phase 3 clinical trial for the treatment of replisome myopathies. The company's product candidates also include SBT-20 to treat complications of diabetes, renal diseases, ocular diseases, neurodegenerative, Parkinson's, Alzheimer's, Huntington's, and ALS diseases; SBT-550 for rare neurological indications; and SBT-272, a peptidomimetic that targets the mitochondria and stabilizing mitochondrial function under conditions of oxidative stress, as well as SBT 550. Stealth BioTherapeutics Corp was incorporated in 2006 and is based in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9005",
        "website": "http://www.stealthbt.com",
        "market_cap": "Small Cap"
    },
    "NM-PH": {
        "short_name": "Navios Maritime Holdings Inc. S",
        "long_name": "Navios Maritime Holdings Inc.",
        "summary": "Navios Maritime Holdings Inc. operates as a seaborne shipping and logistics company in North America, Australia, Europe, Asia, South America, and internationally. The company operates through two segments, Dry Bulk Vessel Operations and Logistics Business. It focuses on the transportation and transshipment of dry bulk commodities, including iron ores, coal, and grains. The Dry Bulk Vessel Operations segment engages in the transportation and handling of bulk cargoes through the ownership, operation, and trading of vessels and freight. This segment charters its vessels to trading houses, producers, and government-owned entities. The Logistics Business segment operates ports and transfer station terminals, as well as upriver transport facilities in the Hidrovia region; and handles vessels, barges, push boats, and cabotage business. This segment provides its integrated transportation, storage, and related services through its port facilities, the fleet of dry and liquid cargo barges, and product tankers to mineral and grain commodity providers, as well as to users of refined petroleum products. As of April 21, 2021, the company's fleet consisted of 45 vessels totaling 5.0 million deadweight tons. Navios Maritime Holdings Inc. is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1104",
        "website": "http://www.navios.com",
        "market_cap": "Small Cap"
    },
    "NM": {
        "short_name": "Navios Maritime Holdings Inc.",
        "long_name": "Navios Maritime Holdings Inc.",
        "summary": "Navios Maritime Holdings Inc. operates as a seaborne shipping and logistics company in North America, Australia, Europe, Asia, South America, and internationally. The company operates through two segments, Dry Bulk Vessel Operations and Logistics Business. It focuses on the transportation and transshipment of dry bulk commodities, including iron ores, coal, and grains. The Dry Bulk Vessel Operations segment engages in the transportation and handling of bulk cargoes through the ownership, operation, and trading of vessels and freight. This segment charters its vessels to trading houses, producers, and government-owned entities. The Logistics Business segment operates ports and transfer station terminals, as well as upriver transport facilities in the Hidrovia region; and handles vessels, barges, push boats, and cabotage business. This segment provides its integrated transportation, storage, and related services through its port facilities, the fleet of dry and liquid cargo barges, and product tankers to mineral and grain commodity providers, as well as to users of refined petroleum products. As of April 21, 2021, the company's fleet consisted of 45 vessels totaling 5.0 million deadweight tons. Navios Maritime Holdings Inc. is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1104",
        "website": "http://www.navios.com",
        "market_cap": "Small Cap"
    },
    "OIIM": {
        "short_name": "O2Micro International Limited",
        "long_name": "O2Micro International Limited",
        "summary": "O2Micro International Limited, together with its subsidiaries, designs, develops, and markets integrated circuits and solutions for power management components and systems in China, the United States, Taiwan, Japan, Malaysia, Korea, Singapore, and internationally. The company offers analog and mixed-signal integrated circuits that manage and provide power for LCD and LED lighting; control and monitor battery charging and discharging in portable electronic devices and vehicles; perform DC/DC and AC/DC conversion; and provides select and switch functionality between power sources, and LED drivers for backlighting products. Its products are primarily used in the consumer electronics, computer, industrial, communication, and automotive markets for applications, including LCD and LED monitors, LCD and LED televisions, notebook and tablet computers, low/zero emission vehicles, mobile phones, power tools, energy efficient technology relating to batteries, LED lighting, including general lighting and portable electronics devices. The company sells its products through direct sales force, independent sales representatives, or distributors to OEMs, ODMs, and module makers. It also licenses its proprietary intellectual property to third parties; and provides design and engineering support services. The company was founded in 1995 and is headquartered in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1209",
        "website": "http://www.o2micro.com",
        "market_cap": "Small Cap"
    },
    "OMXA.F": {
        "short_name": "O2MICRO I.ADR DL-00002/50",
        "long_name": "O2Micro International Limited",
        "summary": "O2Micro International Limited, together with its subsidiaries, designs, develops, and markets integrated circuits and solutions for power management components and systems in China, the United States, Taiwan, Japan, Malaysia, Korea, Singapore, and internationally. The company offers analog and mixed-signal integrated circuits that manage and provide power for LCD and LED lighting; control and monitor battery charging and discharging in portable electronic devices and vehicles; perform DC/DC and AC/DC conversion; and provides select and switch functionality between power sources, and LED drivers for backlighting products. Its products are primarily used in the consumer electronics, computer, industrial, communication, and automotive markets for applications, including LCD and LED monitors, LCD and LED televisions, notebook and tablet computers, low/zero emission vehicles, mobile phones, power tools, energy efficient technology relating to batteries, LED lighting, including general lighting and portable electronics devices. The company sells its products through direct sales force, independent sales representatives, or distributors to OEMs, ODMs, and module makers. It also licenses its proprietary intellectual property to third parties; and provides design and engineering support services. The company was founded in 1995 and is headquartered in George Town, the Cayman Islands.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1209",
        "website": "http://www.o2micro.com",
        "market_cap": "Small Cap"
    },
    "OXBR": {
        "short_name": "Oxbridge Re Holdings Limited",
        "long_name": "Oxbridge Re Holdings Limited",
        "summary": "Oxbridge Re Holdings Limited, together with its subsidiaries, provides specialty property and casualty reinsurance solutions. It underwrites reinsurance contracts primarily for property and casualty insurance companies in the Gulf Coast region of the United States. The company distributes its products and solutions through reinsurance brokers. Oxbridge Re Holdings Limited was incorporated in 2013 and is headquartered in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance - Reinsurance",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9006",
        "website": "http://www.oxbridgere.com",
        "market_cap": "Small Cap"
    },
    "PAX": {
        "short_name": "Patria Investments Limited",
        "long_name": "Patria Investments Limited",
        "summary": "Patria Investments Limited operates as a private market investment firm focused on investing in Latin America. The company offers asset management services to investors focusing on private equity funds, infrastructure development funds, co-investments funds, constructivist equity funds, and real estate and credit funds. Patria Investments Limited was founded in 1994 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-9006",
        "website": "http://www.patria.com",
        "market_cap": "Mid Cap"
    },
    "RKTA-UN": {
        "short_name": "Rocket Internet Growth Opportun",
        "long_name": "Rocket Internet Growth Opportunities Corp.",
        "summary": "Rocket Internet Growth Opportunities Corp. focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. The company was founded in 2021 and is based in Grand Cayman, Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1102",
        "website": null,
        "market_cap": null
    },
    "S1BA.F": {
        "short_name": "STEALTH BIOTH. SP.ADR/12",
        "long_name": "Stealth BioTherapeutics Corp",
        "summary": "Stealth BioTherapeutics Corp, a clinical-stage biotechnology company, focuses on the discovery, development, and commercialization of therapies for diseases involving mitochondrial dysfunction. Its lead product candidate is Elamipretide that is in phase 3 clinical trial to treat barth syndrome, phase 2/3 clinical trial for the treatment of duchenne cardiomyopathy, phase 2a clinical trial to treat friedreich's ataxia, phase 2 clinical trial for the treatment of dry age-related macular degeneration, phase 2 clinical trial to treat leber's hereditary optic neuropathy, and phase 3 clinical trial for the treatment of replisome myopathies. The company's product candidates also include SBT-20 to treat complications of diabetes, renal diseases, ocular diseases, neurodegenerative, Parkinson's, Alzheimer's, Huntington's, and ALS diseases; SBT-550 for rare neurological indications; and SBT-272, a peptidomimetic that targets the mitochondria and stabilizing mitochondrial function under conditions of oxidative stress, as well as SBT 550. Stealth BioTherapeutics Corp was incorporated in 2006 and is based in George Town, the Cayman Islands.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9005",
        "website": "http://www.stealthbt.com",
        "market_cap": "Small Cap"
    },
    "SCGL.L": {
        "short_name": "SEALAND CAPITAL GALAXY LIMITED ",
        "long_name": "Sealand Capital Galaxy Limited",
        "summary": "Sealand Capital Galaxy Limited, together with its subsidiaries, engages in the digital marketing and other IT related businesses in Macau, Hong Kong, Mainland China, and internationally. The company provides various services on enlisting merchants to mobile payment gateways and digital advertising services; and sells secured social communication and advertising products through Metalk. It sells and distributes mobile game; and offers IT related development and support services, as well as sells goods through internet, and provides provision of consultancy services related to e-commerce. The company was founded in 2015 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1107",
        "website": "http://scg-ltd.com",
        "market_cap": "Small Cap"
    },
    "SEMUF": {
        "short_name": "SIEM INDUSTRIES INC",
        "long_name": "Siem Industries S.A.",
        "summary": "Siem Industries Inc., through its subsidiaries, operates in the oil and gas services industry and renewable energy sector worldwide. It operates through Offshore Support Vessels, Reefer Vessels and Car Carriers, Potash production, RoRo vessels, Scientific Core-Drilling, and Corporate and Other. The company provides subsea engineering and construction services; and offshore installation services, as well as related repair and refurbishment services. It also owns and operates fleet of 8 reefer vessels engaged in the refrigerated transportation of fruits and other perishable products; and engages in the provision of car and roll-on/roll-off transportation solutions and capabilities through partnerships with car manufacturers, shipping lines, and logistics companies. In addition, the company is involved in the mining of potash, which is used for fertilizer production, bischofite for the construction industry, magnesium chloride for de-icing, and other materials. Further, it offers finance services, including loans and guarantees, specialist credit advisory services, and investment services, as well as private asset-based financing. The company was formerly known as Norex Industries Inc. and changed its name to Siem Industries Inc. in 1998. Siem Industries Inc. was incorporated in 1980 and is based in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "1104",
        "website": "http://www.siemindustries.com",
        "market_cap": "Small Cap"
    },
    "STNE": {
        "short_name": "StoneCo Ltd.",
        "long_name": "StoneCo Ltd.",
        "summary": "StoneCo Ltd. provides financial technology solutions to merchants and integrated partners to conduct electronic commerce across in-store, online, and mobile channels in Brazil. It distributes its solutions, principally through proprietary Stone Hubs, which offer hyper-local sales and services; and technology and solutions to digital merchants through sales and technical personnel and software vendors, as well as sells solutions to brick-and-mortar and digital merchants through sales team. As of December 31, 2020, the company served approximately 652,600 clients primarily small-and-medium-sized businesses; and 260 integrated partners, such as global payment service providers, digital marketplaces, and integrated software vendors. The company was founded in 2000 and is headquartered in George Town, Cayman Islands. StoneCo Ltd. is a subsidiary of HR Holdings, LLC.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1002",
        "website": "http://www.stone.co",
        "market_cap": "Large Cap"
    },
    "TBPH": {
        "short_name": "Theravance Biopharma, Inc.",
        "long_name": "Theravance Biopharma, Inc.",
        "summary": "Theravance Biopharma, Inc., a diversified biopharmaceutical company, discovers, develops, and commercializes organ-selective medicines in the United States, Europe, and Asia. The company offers YUPELRI, a once-daily, nebulized long-acting muscarinic antagonist used for the treatment of chronic obstructive pulmonary disease (COPD). Its product portfolio also include Izencitinib, a gut-selective pan-janus kinase (JAK) inhibitor that is in Phase IIb/III clinical trials for the treatment of rheumatoid arthritis, myelofibrosis, and ulcerative colitis, as well as for a range of inflammatory intestinal diseases, including ulcerative colitis and Crohn's disease. In addition, the company's product portfolio also comprise Ampreloxetine, an investigational norepinephrine reuptake inhibitor that has completed Phase III study for neurogenic orthostatic hypotension; TD-8236, an investigational, inhaled lung-selective pan-JAK inhibitor, which is Phase II clinical study for treatment of a range of inflammatory diseases; and TD-5202, an investigational, orally administered, gut-selective, irreversible JAK3 inhibitor that is in Phase I clinical study for treatment of inflammatory intestinal diseases. Further, it offers TRELEGY for the treatment of COPD; Velusetrag, an oral and investigational medicine for gastrointestinal motility disorders; and Selective 5-HT4 Agonist for treatment of gastrointestinal motility disorders. It has a licensing and collaboration agreements with Pfizer Inc., Viatris Inc., Janssen Biotech, Inc., Alfasigma S.p.A, and Takeda Pharmaceutical Company Limited. The company was incorporated in 2013 and is based in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1104",
        "website": "http://www.theravance.com",
        "market_cap": "Small Cap"
    },
    "TBSAU": {
        "short_name": "TB SA Acquisition Corp",
        "long_name": "TB SA Acquisition Corp",
        "summary": "TB SA Acquisition Corp, a blank check company, intends to effect a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or related business combination with one or more businesses or entities. The company was founded in 2021 and is based in Grand Cayman, Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1102",
        "website": null,
        "market_cap": null
    },
    "TETHF": {
        "short_name": "TETHYS PETROLEUM LIMITED",
        "long_name": "Tethys Petroleum Limited",
        "summary": "Tethys Petroleum Limited engages in the acquisition, exploration, and development of crude oil and natural gas fields in Kazakhstan. It holds 100% working interest in the Kyzyloi production contract covering 449 sq. km; Akkulka exploration licence and contract covering 827 sq. km; Akkulka production contract covering 396 sq. km; and Kul-Bas exploration and production contract covering 7,632 sq. km located in Kazakhstan. The company was formerly known as Tethys Petroleum Investments Limited and changed its name to Tethys Petroleum Limited in September 2006. Tethys Petroleum Limited was incorporated in 2003 and is based in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9007",
        "website": "http://www.tethys-group.com",
        "market_cap": "Small Cap"
    },
    "TP21.F": {
        "short_name": "TETHYS PETROLEUM LTD",
        "long_name": "Tethys Petroleum Limited",
        "summary": "Tethys Petroleum Limited engages in the acquisition, exploration, and development of crude oil and natural gas fields in Kazakhstan. It holds 100% working interest in the Kyzyloi production contract covering 449 sq. km; Akkulka exploration licence and contract covering 827 sq. km; Akkulka production contract covering 396 sq. km; and Kul-Bas exploration and production contract covering 7,632 sq. km located in Kazakhstan. The company was formerly known as Tethys Petroleum Investments Limited and changed its name to Tethys Petroleum Limited in September 2006. Tethys Petroleum Limited was incorporated in 2003 and is based in George Town, the Cayman Islands.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9007",
        "website": "http://www.tethys-group.com",
        "market_cap": "Small Cap"
    },
    "TPL.V": {
        "short_name": "TETHYS PETROLEUM LIMITED",
        "long_name": "Tethys Petroleum Limited",
        "summary": "Tethys Petroleum Limited engages in the acquisition, exploration, and development of crude oil and natural gas fields in Kazakhstan. It holds 100% working interest in the Kyzyloi production contract covering 449 sq. km; Akkulka exploration licence and contract covering 827 sq. km; Akkulka production contract covering 396 sq. km; and Kul-Bas exploration and production contract covering 7,632 sq. km located in Kazakhstan. The company was formerly known as Tethys Petroleum Investments Limited and changed its name to Tethys Petroleum Limited in September 2006. Tethys Petroleum Limited was incorporated in 2003 and is based in George Town, the Cayman Islands.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9007",
        "website": "http://www.tethys-group.com",
        "market_cap": "Small Cap"
    },
    "VLATU": {
        "short_name": "Valor Latitude Acquisition Corp",
        "long_name": "Valor Latitude Acquisition Corp.",
        "summary": "Valor Latitude Acquisition Corp. intends to effect a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. The company was incorporated in 2021 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1104",
        "website": null,
        "market_cap": null
    },
    "VOX.V": {
        "short_name": "VOX ROYALTY CORP",
        "long_name": "Vox Royalty Corp.",
        "summary": "Vox Royalty Corp. operates as a precious metals focused mining royalty and streaming company. The company holds a portfolio of 50 royalties and streaming assets, as well as 1 royalty option. It operates in Australia, Canada, Peru, Brazil, Mexico, the United States, Madagascar, and Nigeria. Vox Royalty Corp. was founded in 2014 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Other Precious Metals & Mining",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1 9012",
        "website": "http://www.voxroyalty.com",
        "market_cap": "Small Cap"
    },
    "VOXCF": {
        "short_name": "VOX RTY CORP",
        "long_name": "Vox Royalty Corp.",
        "summary": "Vox Royalty Corp. operates as a precious metals focused mining royalty and streaming company. The company holds a portfolio of 50 royalties and streaming assets, as well as 1 royalty option. It operates in Australia, Canada, Peru, Brazil, Mexico, the United States, Madagascar, and Nigeria. Vox Royalty Corp. was founded in 2014 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Other Precious Metals & Mining",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1 9012",
        "website": "http://www.voxroyalty.com",
        "market_cap": "Small Cap"
    },
    "VPCB": {
        "short_name": "VPC Impact Acquisition Holdings",
        "long_name": "VPC Impact Acquisition Holdings II",
        "summary": "VPC Impact Acquisition Holdings II is a blank check company. The company was incorporated in 2020 and is based in George Town, Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1104",
        "website": null,
        "market_cap": null
    },
    "VPCBU": {
        "short_name": "VPC Impact Acquisition Holdings",
        "long_name": "VPC Impact Acquisition Holdings II",
        "summary": "VPC Impact Acquisition Holdings II is a blank check company. The company was incorporated in 2020 and is based in George Town, Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1104",
        "website": null,
        "market_cap": null
    },
    "VYGG-UN": {
        "short_name": "Vy Global Growth",
        "long_name": "Vy Global Growth",
        "summary": "Vy Global Growth does not have significant operations. It intends to effect a merger, share exchange, asset acquisition, share purchase, reorganization, or other similar business combination with one or more businesses in the financial, technology, and business services sectors. The company was incorporated in 2020 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-9010",
        "website": "http://vygg.com",
        "market_cap": null
    },
    "VYGG": {
        "short_name": "Vy Global Growth",
        "long_name": "Vy Global Growth",
        "summary": "Vy Global Growth does not have significant operations. It intends to effect a merger, share exchange, asset acquisition, share purchase, reorganization, or other similar business combination with one or more businesses in the financial, technology, and business services sectors. The company was incorporated in 2020 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-9010",
        "website": "http://vygg.com",
        "market_cap": "Small Cap"
    },
    "ZOL.L": {
        "short_name": "ZOLTAV RESOURCES INC ORD SHS US",
        "long_name": "Zoltav Resources Inc.",
        "summary": "Zoltav Resources Inc. acquires, explores for, develops, and produces hydrocarbons in Russia. The company holds interests in the Bortovoy license covering an area of 3,215 square kilometers with proved plus probable reserves of 750 billion cubic feet of gas, and 3.9 million barrels of oil and condensate located in the Saratov region of south western Russia. It also owns interests in the Koltogor exploration and production license containing the Koltogor oil field covering an area of 528 square kilometers with proved plus probable reserves of 79.2 million barrels of oil equivalent located in the Khantiy-Mansisk Autonomous Okrug of Western Siberia; and the Koltogor exploration and production license 10 containing the West Koltogor oil field covering an area of 167 square kilometers. Zoltav Resources Inc. was incorporated in 2003 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1001",
        "website": "http://www.zoltav.com",
        "market_cap": "Small Cap"
    }
}