{
  "0KD.F": {
    "city": "Rosh Haayin",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Kornit Digital Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "KORNIT DIGITAL  IS -,01",
    "state": null,
    "summary": "Kornit Digital Ltd. develops, designs, and markets digital printing solutions for the fashion, apparel, and home decor segments of printed textile industry worldwide. The company's solutions include digital printing systems, ink and other consumables, associated software, and value-added services. Its products and services include direct-to-garment printing systems from smaller industrial operators to mass producers; NeoPigment ink and other consumables; QuickP designer software; and maintenance and support, and professional services. The company serves decorators, online businesses, brand owners, and contract printers. Kornit Digital Ltd. was incorporated in 2002 and is headquartered in Rosh HaAyin, Israel.",
    "website": "http://www.kornit.com",
    "zipcode": "4809246"
  },
  "19C.F": {
    "city": "Menashe",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Building Products & Equipment",
    "long_name": "Caesarstone Ltd.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "CAESARSTONE LTD.  IS -,04",
    "state": null,
    "summary": "Caesarstone Ltd., together with its subsidiaries, develops, manufactures, and markets engineered quartz surfaces under the Caesarstone brand in the United States, Australia, Canada, Latin America, Asia, Israel, Europe, the Middle East, and Africa. The company's engineered quartz slabs are primarily used as kitchen countertops in the renovation and remodeling construction end markets, as well as in new buildings construction market. Its products are also used in other applications, such as vanity tops, wall panels, back splashes, floor tiles, stairs, furniture, and other interior and exterior surfaces that are used in various residential and non-residential applications. The company also offers porcelain products under the Lioli brand for flooring and cladding applications, as well as resells natural stones, and fabrication and installation accessories. It sells its products directly to fabricators, sub-distributors, and resellers; and indirectly through a network of independent distributors. The company was formerly known as Caesarstone Sdot Yam Ltd. and changed its name to Caesarstone Ltd. in June 2016. Caesarstone Ltd. was founded in 1987 and is headquartered in MP Menashe, Israel.",
    "website": "http://www.caesarstone.com",
    "zipcode": "3780400"
  },
  "50S.F": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Security & Protection Services",
    "long_name": "SuperCom Ltd.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SUPERCOM LTD.  IS -,01",
    "state": null,
    "summary": "SuperCom Ltd. provides digital identity, Internet of Things and connectivity, and cyber security products and solutions to governments, and private and public organizations worldwide. The company offers MAGNA, a common platform for ID registries, e-passports, biometric visas, automated fingerprint identification systems, digitized driver's licenses, and electronic voter registration and election management. Its PureRF suite is a solution based on RFID tag technology to identify, locate, track, monitor, count, and protect people and objects. The company's PureRF suite comprises PureRF tags, hands-free long-range RFID asset and vehicle tags, PureRF readers, PureRF activators, and PureRF initializers. It also provides house arrest monitoring systems, PureTag RF bracelets, PureCom RF base stations, GPS offender tracking systems, PureTrack smartphone device, PureBeacon, PureMonitor offender electronic monitoring software, inmate monitoring systems, DoorGuard tracking station, and personnel tags. In addition, the company offers domestic violence victim protection systems. Further, it provides connectivity products and solutions comprising AVIDITY WBSac, BOLSTER WBSn, BreezeULTRA P6000, Arena controller, and BreezeNET B. Additionally, the company offers Safend's Encryption Suite that protects the organization's sensitive data; and designs solutions for carrier Wi-Fi, enterprise connectivity, smart city, smart hospitality, connected campuses, and connected events. SuperCom Ltd. sells its systems and products through local representatives, subsidiaries, and distribution channels, as well as independent representatives and resellers. The company was formerly known as Vuance Ltd. and changed its name to SuperCom Ltd. in January 2013. SuperCom Ltd. was founded in 1988 and is based in Tel Aviv-Yafo, Israel.",
    "website": "http://www.supercom.com",
    "zipcode": "6713412"
  },
  "A5F.F": {
    "city": "Upper Galilee",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Amiad Water Systems Ltd.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "AMIAD WATER SYS.LTD.IS-50",
    "state": null,
    "summary": "Amiad Water Systems Ltd., together with its subsidiaries, produces and supplies water filters and filtration systems for the industrial, municipal, ballast water, oil and gas, and irrigation markets worldwide. It offers automatic, semi-automatic, and manual filters, as well as fertigation injectors for farmers and large agricultural co-ops; automatic filters for industrial sector; and develops, manufactures, and distributes water treatment and filtration solutions for potable water and wastewater in various applications, such as pre-filtration for UV and tertiary treatment, and polishing, as well as for MF, UF, NF, and RO membranes. The company was formerly known as Amiad Filtration Systems Ltd. and changed its name to Amiad Water Systems Ltd. in September 2011. Amiad Water Systems Ltd. was founded in 1962 and is headquartered in Upper Galilee, Israel.",
    "website": "http://www.amiad.com",
    "zipcode": "12335"
  },
  "AFS.L": {
    "city": "Upper Galilee",
    "country": "Israel",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Amiad Water Systems Ltd.",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "AMIAD WATER SYSTEMS LTD ORD ILS",
    "state": null,
    "summary": "Amiad Water Systems Ltd., together with its subsidiaries, produces and supplies water filters and filtration systems for the industrial, municipal, ballast water, oil and gas, and irrigation markets worldwide. It offers automatic, semi-automatic, and manual filters, as well as fertigation injectors for farmers and large agricultural co-ops; automatic filters for industrial sector; and develops, manufactures, and distributes water treatment and filtration solutions for potable water and wastewater in various applications, such as pre-filtration for UV and tertiary treatment, and polishing, as well as for MF, UF, NF, and RO membranes. The company was formerly known as Amiad Filtration Systems Ltd. and changed its name to Amiad Water Systems Ltd. in September 2011. Amiad Water Systems Ltd. was founded in 1962 and is headquartered in Upper Galilee, Israel.",
    "website": "http://www.amiad.com",
    "zipcode": "12335"
  },
  "AKMY.V": {
    "city": "Beit Shean",
    "country": "Israel",
    "currency": "CAD",
    "exchange": "VAN",
    "industry": "Pollution & Treatment Controls",
    "long_name": "K.B. Recycling Industries Ltd.",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "K B RECYCLING INDUSTRIES LTD",
    "state": null,
    "summary": "K.B. Recycling Industries Ltd. recycles and manufactures polyethylene sheets products from the post-consumed plastic bags and sheets in Israel. Its products include polyethylene geomembrane, which is used in building and infrastructure underground sealing systems; polyethylene sheet that is laminated with PET and cotton mixed non-woven fabric, which provides heavy-duty surface protection during construction work and renovations; polyethylene geomembrane root barrier, which is used in underground installations and helps in preventing roots from growing into certain soil; and polyethylene geomembrane gas barrier, a laminated polyethylene sheet with a BOPP sheet that is used for prevention of underground gasses leaks into the building spaces. The company offers its products under Rhino, Armadillo, Cricket, and Elephant brands. K.B. Recycling Industries Ltd. was incorporated in 2008 and is headquartered in Beit Shean, Israel.",
    "website": "http://kb-recycling.com",
    "zipcode": "11715"
  },
  "ALD.TA": {
    "city": "Or-Yehuda",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Specialty Business Services",
    "long_name": "A.L.D. Advanced Logistics Developments Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "A.L.D. ADVANCED",
    "state": null,
    "summary": "A.L.D. Advanced Logistics Developments Ltd. provides professional consulting, software development, and training services in Israel and internationally. It offers RAM Commander, a modular software that covers various engineering tasks related to reliability of electronic, electro-mechanical, and mechanical systems; and Failure Reporting, Analysis and Corrective Action System, a Web based and user configurable system, which captures information about equipment or the processes throughout its life cycle ranging from design and production testing to customers support. The company also provides Decision by Life Cycle Cost, a life cycle cost tool for managers, decision-makers, engineers, ILS personnel, and other staff; and Favoscope Quality Management System, a Web-based audit system for quality process management. In addition, it offers Statistical Process Control, a software for real-time monitoring of the manufacturing process and its enhancement with decision-making support, statistical analysis, and reports; and ALD College Course Management Software System for colleges and educational institutions. Further, the company provides consulting services, such as reliability and quality program plan, reliability prediction and analysis, FMEA/FMECA, failure and testability analysis, aviation safety assessment, electrical parts stress analysis, suppliers quality management, maintainability prediction and analysis, reliability demonstration test program, reliability centered maintenance, failure data collection, thermal analysis, logistics support, spares optimization, statistical process control, accelerated life testing, software QA, six sigma process improvement, validation, quality management, and ISO certification services. It serves clients in aerospace, defense, electronic components, railway, and telecommunications sectors. A.L.D. Advanced Logistics Developments Ltd. was founded in 1984 and is headquartered in Or-Yehuda, Israel.",
    "website": "http://www.aldservice.com",
    "zipcode": null
  },
  "AMAN.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Conglomerates",
    "long_name": "Amanet Management & Systems Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "AMANET MANAGEMENT",
    "state": null,
    "summary": "Amanet Management & Systems Ltd., through its subsidiaries, provides consulting, project management, and logistics services in Israel and internationally. It offers management services; consulting and operating services for industrial engineering and management projects; organizational development services; coordination and management services for construction engineering projects; project administration operating services for special issues; and outsourcing services for logistics and administration systems. The company also provides system characterization and software development; data systems implementation; professional; IT consultancy; and quality control and software testing services, as well as implementation training services and assimilation of data systems in organizations. It serves customers in various segments, including industry, defense/military, government, public institutions, commerce and services, construction, business, and others. The company was founded in 1970 and is based in Tel Aviv, Israel.",
    "website": "http://www.amanet.co.il",
    "zipcode": "6971050"
  },
  "AQUA.TA": {
    "city": "Rosh Haayin",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Aquarius Engines (A.M) Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "AQUARIUS ENGINES",
    "state": null,
    "summary": "Aquarius Engines (A.M) Ltd. develops, manufactures, and sells power generators. It serves telecommunication center, microgrid, truck, powertrain, marine, and aviation markets. The company is based in Rosh HaAyin, Israel.",
    "website": "http://www.aquariusengines.com",
    "zipcode": "4809149"
  },
  "AQUEF": {
    "city": "Rosh Haayin",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Aquarius Engines (A.M) Ltd.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "AQUARIUS ENGINES (A.M) LTD",
    "state": null,
    "summary": "Aquarius Engines (A.M) Ltd. develops, manufactures, and sells power generators. It serves telecommunication center, microgrid, truck, powertrain, marine, and aviation markets. The company is based in Rosh HaAyin, Israel.",
    "website": "http://www.aquariusengines.com",
    "zipcode": "4809149"
  },
  "ARAD.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Arad Investment & Industrial Development Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "ARAD INVESTMENT &",
    "state": null,
    "summary": "Arad Investment & Industrial Development Ltd., through its subsidiaries, operates in the real estate, technology, software, outsourcing, human resources, and other sectors. The company engages in planning, construction, and management of industrial buildings, parks for knowledge-intensive industries, and commercial centers; sale of apartments; improvement and sale of land owned for residential buildings; and development of various construction projects. It also offers computing systems consulting, planning, integration, training, implementation, and maintenance services; support and other professional services for computing systems; data processing and communication services; software development services; and infrastructure software, as well as markets hardware products. In addition, the company provides outsourcing services; maintenance services for communication systems; and human resource and wage services. Further, it sells communications equipment; and produces and sells pot blocks. Arad Investment & Industrial Development Ltd. is based in Tel Aviv, Israel.",
    "website": null,
    "zipcode": "6581603"
  },
  "ARAN.TA": {
    "city": "Caesarea",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Conglomerates",
    "long_name": "Aran Research & Development (1982) Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "ARAN RESEARCH&DEVE",
    "state": null,
    "summary": "Aran Research & Development (1982) Ltd. engages in the product design and development, and equipment manufacturing businesses for plastics industry in Israel. The company develops various medical devices, such as cardiovascular devices, in-vitro diagnostics, surgical instruments, medical robots, and other products; and water devices and fluid management systems, including pressure and flow regulators, electric and hydraulic valves, air release valves, sprinklers, drippers, taps, water meters, filters, check valves, electronic controllers, and testing devices. It also provides portable and stationary control stations for unmanned systems; electro-optics; rugged electronics for ground, marine, and aerial platforms operating in harsh environments; ground systems for access control and security forces; test equipment; production line facilities; measurement and weighing devices; specialty printers; automatic beverage machines; computerized shopping carts and self-checkout kiosk; industrial and communication devices; and batteries. In addition, the company supplies machines and equipment, such as injection molding machines, robotics and automation, injection molds, hot runners systems, drying dosing and conveying systems, plasticizing screws barrels, ultrasonic welding and cleaning, and raw materials; and support services, as well as invests in medical startups. Aran Research & Development (1982) Ltd. was founded in 1982 and is based in Caesarea, Israel.",
    "website": "http://www.aran-rd.com",
    "zipcode": "3088900"
  },
  "ARTS.TA": {
    "city": "Bet Shemesh",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Pollution & Treatment Controls",
    "long_name": "Airtouch Solar Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "AIRTOUCH SOLAR LTD",
    "state": null,
    "summary": "Airtouch Solar Ltd provides autonomous water-free robotic cleaning solutions for solar panels. The company is based in Bet Shemesh, Israel.",
    "website": "http://www.airtouchsolar.com",
    "zipcode": "9905503"
  },
  "ASHO.TA": {
    "city": "Ashkelon",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Aerospace & Defense",
    "long_name": "Ashot Ashkelon Industries Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "ASHOT ASHKELON",
    "state": null,
    "summary": "Ashot Ashkelon Industries Ltd. develops, manufactures, assembles, and supplies systems and components for the aerospace, defense, automotive, and other industries in Israel and internationally. It offers aerospace products, such as long and short shafts for turbofan and turboprop jet engines; high lift system components, including universal joints, transmissions and gearboxes, shafts, and extension joints; landing gears components; electromechanical assemblies for aircraft; gearboxes, transmissions, and gear-based products; and tungsten weights. The company also provides automatic transmissions, final drives, transfer boxes, drop boxes, PTO's, and a range of gear based assemblies and shafts for main battle tanks; and off-road vehicle products comprising automatic transmissions, hydraulic and mechanical power take off units, transmission range shafts, planetary systems, clutch independent drives, mass transit gearboxes, drive axles, final drives, oil pumps, reduction and transfer boxes, and gear assemblies. In addition, it offers tungsten-based heavy metal products for applications in aircraft and instrument balance weights, helicopter rotor dampers, aircraft and land-based gyro components, airborne antenna bases, propeller and blade balancing, X-ray and radiation therapy shields, industrial shields for irradiation systems, armor piercing penetrators, fragmentation parts, radar balancing, tool holders, and oil and gas liners. The company is based in Ashkelon, Israel. Ashot Ashkelon Industries Ltd. is a subsidiary of Israel Military Industries Ltd.",
    "website": "http://www.ashot.co.il",
    "zipcode": "7810001"
  },
  "AUGN.TA": {
    "city": null,
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Augwind Energy Tech Storage Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "AUGWIND ENERGY TEC",
    "state": null,
    "summary": "Augwind develops technology that provides solutions to wind power production. The company offers a solar augmented device that gets integrated to an existing wind turbine while utilizing the wind turbine power generating system while incorporating a novel power dispatchability technology. The company is based in Israel.",
    "website": "http://www.aug-wind.com",
    "zipcode": null
  },
  "AVIV.TA": {
    "city": "Jerusalem",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Engineering & Construction",
    "long_name": "Mordechai Aviv Taasiot Beniyah (1973) Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "MORDECHAI AVIV",
    "state": null,
    "summary": "Mordechai Aviv Taasiot Beniyah (1973) Ltd. engages in the planning, construction, marketing, and sale of real estate properties in Israel and internationally. The company undertakes the construction of residential, commercial, and industrial projects. It also offers engineering works in the fields of flooring, electrical, plaster, paint, plumbing, development work, transportation, and logistics, as well as engages in the leasing and operation of real estate properties. The company was formerly known as Saf Or Industrial Construction Ltd. and changed its name to Mordechai Aviv Taasiot Beniyah (1973) Ltd. in March 1993. Mordechai Aviv Taasiot Beniyah (1973) Ltd. was incorporated in 1973 and is based in Jerusalem, Israel.",
    "website": "http://maviv.co.il",
    "zipcode": "28281"
  },
  "AVLN.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Engineering & Construction",
    "long_name": "Aviv Arlon Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "AVIV ARLON LTD",
    "state": null,
    "summary": "Aviv Arlon Ltd. focuses on the acquisition, improvement, development, leasing, and management of shopping centers in the United States and Serbia. The company was founded in 2007 and is based in Ramat Gan, Israel.",
    "website": "http://www.avivarlon.com",
    "zipcode": null
  },
  "BRAN.TA": {
    "city": "Beit Dagan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Engineering & Construction",
    "long_name": "Baran Group Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "BARAN GROUP LTD",
    "state": null,
    "summary": "Baran Group Ltd provides engineering, technology, telecommunication, and construction solutions worldwide. The company operates through two segments, Baran Israel and Baran International. Its solutions include feasibility studies, engineering and design, permitting and validation, construction and site management, procurement and contracting, project management and control, operation and maintenance, turnkey, project financing, and related services. The company serves various industries, such as manufacturing, industrial process, power generation and distribution, petroleum production, water supply, sewerage and hazardous waste treatment, general building, construction, transportation, and telecommunications. Baran Group Ltd was founded in 1979 and is headquartered in Beit Dagan, Israel.",
    "website": "http://www.barangroup.com",
    "zipcode": "50200"
  },
  "BSEN.TA": {
    "city": "Beit Shemesh",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Aerospace & Defense",
    "long_name": "Bet Shemesh Engines Holdings (1997) Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "BET SHEMESH ENGINE",
    "state": null,
    "summary": "Bet Shemesh Engines Holdings (1997) Ltd designs, develops, manufactures, and sells engine parts for the aerospace industry. The company offers jet engine parts, including compressors, turbine disks and blisks, frames, cases, air seals, spacers, and turbine nozzels and blades; sheet metals and combustion chambers; and augmentor seals, flaps, and flame holders. It also provides torque frames, discs, gears, rotating seals, bearing housings, cases, rings, rotors, flanges, hubs, impellers, and stub shafts; and air foils and structural parts. In addition, the company offers maintenance, repair, overhaul, and engineering services; and field services, such as troubleshooting, HSI on-wing, etc for civil and military applications. Further, it designs, develops, customizes, manufactures, and sells gas turbine engines, modules, and parts. The company was founded in 1997 and is based in Beit Shemesh, Israel.",
    "website": "http://www.bsel.co.il",
    "zipcode": "9905529"
  },
  "CDEV.TA": {
    "city": "Herzliya",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Conglomerates",
    "long_name": "Cohen Development Gas & Oil Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "COHEN DEV&IND BLDG",
    "state": null,
    "summary": "Cohen Development Gas & Oil Ltd engages in the natural oil and gas business. It holds interests in the Ashkelon, Noa, Tamar, Dalit, North Whale, South Whale, Block 12, Shark, Crocdilem Olshas/367, New Horizon/ 405, and New Yahel/406 licenses. Cohen Development Gas & Oil Ltd was founded in 1958 and is based in Herzliya, Israel.",
    "website": null,
    "zipcode": null
  },
  "CRWTF": {
    "city": "Airport City",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Security & Protection Services",
    "long_name": "Crow Technologies 1977 Ltd.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "CROW TECHNOLOGIES 1977",
    "state": null,
    "summary": "Crow Technologies 1977 Ltd., through its subsidiaries, designs, develops, manufactures, sells, and distributes a range of security detection and alarm systems for use in commercial and industrial facilities, residential homes, and open areas. The company offers alarm control panels and accessories, such as Serenity alarm systems, and wired and wireless security solutions. It also provides wireless and wired detectors comprising Freewave fully supervised wireless detectors, detectors for indoor and outdoor installations, double technology and anti-masking detectors, QUAD imaging PET immune detectors and dual detectors with anti-masking, double dual and double linear imaging technology detectors, professional mirror optics PIR detectors, and ceiling mount detectors, as well as vibration and acoustic sensors. In addition, the company offers outdoor detection products, such as external detection detectors; connected home peripherals; wired outdoor sounders, wireless ultra slim external sounders, and wireless indoor sounders; and personal alert transmitters. The company offers its products through a network of distributors and sales offices to professional installers and central monitoring stations worldwide. Crow Technologies 1977 Ltd. was founded in 1977 and is headquartered in Airport City, Israel.",
    "website": "http://www.thecrowgroup.com",
    "zipcode": "70100"
  },
  "CSTE": {
    "city": "Menashe",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Building Products & Equipment",
    "long_name": "Caesarstone Ltd.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Caesarstone Ltd.",
    "state": null,
    "summary": "Caesarstone Ltd., together with its subsidiaries, develops, manufactures, and markets engineered quartz surfaces under the Caesarstone brand in the United States, Australia, Canada, Latin America, Asia, Israel, Europe, the Middle East, and Africa. The company's engineered quartz slabs are primarily used as kitchen countertops in the renovation and remodeling construction end markets, as well as in new buildings construction market. Its products are also used in other applications, such as vanity tops, wall panels, back splashes, floor tiles, stairs, furniture, and other interior and exterior surfaces that are used in various residential and non-residential applications. The company also offers porcelain products under the Lioli brand for flooring and cladding applications, as well as resells natural stones, and fabrication and installation accessories. It sells its products directly to fabricators, sub-distributors, and resellers; and indirectly through a network of independent distributors. The company was formerly known as Caesarstone Sdot Yam Ltd. and changed its name to Caesarstone Ltd. in June 2016. Caesarstone Ltd. was founded in 1987 and is headquartered in MP Menashe, Israel.",
    "website": "http://www.caesarstone.com",
    "zipcode": "3780400"
  },
  "CTGL": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Specialty Business Services",
    "long_name": "Citrine Global Corp.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "CITRINE GLOBAL",
    "state": null,
    "summary": "Citrine Global Corp., a technology company, engages in the design, development, and commercialization of a platform utilizing proprietary vaporization technology to enable health, wellness, and beauty treatments in Israel, the United States, Canada, and Europe. Its products include Novokid, a device for the treatment of head lice and eggs; and Shine, a device for the treatment and rejuvenation of the hair and scalp. The company was formerly known as TechCare Corp. and changed its name to Citrine Global Corp. in August 2020. Citrine Global Corp. is headquartered in Tel Aviv, Israel.",
    "website": "http://www.citrine-global.com",
    "zipcode": "6721503"
  },
  "DNYA.TA": {
    "city": "Or Yehuda",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Engineering & Construction",
    "long_name": "Danya Cebus Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "DNYA CEBUS",
    "state": null,
    "summary": "Danya Cebus Ltd., a construction company, engages in the planning and execution of various projects in Israel and internationally. It undertakes infrastructure projects, including road paving, railway infrastructure building, construction of bridges and parking lots, and tunnel mining and related infrastructure development; commercial and industrial projects; residential buildings; and other projects. The company is also involved in the development and sale of residential units; and executing and establishing projects in the fields of electricity, cogeneration, fire discovery and extinguishment, high voltage, low voltage, plumbing, sprinklers, air conditioning, and ventilation. In addition, it provides professional skilled workers; and undertakes geotechnical works. The company is based in Or Yehuda, Israel. Danya Cebus Ltd. is a subsidiary of Africa Israel Investments Ltd.",
    "website": "http://www.denyagroup.co",
    "zipcode": "60250"
  },
  "EB2.F": {
    "city": "Haifa",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Aerospace & Defense",
    "long_name": "Elbit Systems Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "ELBIT SYS LTD",
    "state": null,
    "summary": "Elbit Systems Ltd. develops and supplies a portfolio of airborne, land, and naval systems and products for defense, homeland security, and commercial aviation applications primarily in Israel. The company offers military aircraft and helicopter, commercial aviation, unmanned aircraft, electro-optic, night vision, countermeasures, naval, land vehicle, electronic warfare and signal intelligence, commercial cyber training, and medical instrumentation systems, as well as command, control, communications, computer, intelligence, surveillance, and reconnaissance and cyber systems; and munitions. The company markets its systems and products as a prime contractor or subcontractor to various governments and companies. It also has operations in the United States, Europe, Latin America, the Asia-Pacific, and internationally. Elbit Systems Ltd. was incorporated in 1966 and is based in Haifa, Israel.",
    "website": "http://elbitsystems.com",
    "zipcode": "3100401"
  },
  "ELAL.TA": {
    "city": "Lod",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Airlines",
    "long_name": "El Al Israel Airlines Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "EL AL ISRAEL AIRLI",
    "state": null,
    "summary": "El Al Israel Airlines Ltd., together with its subsidiaries, provides passengers and cargo transportation services. The company operates flights on passenger aircraft to approximately 40 direct destinations in 26 countries in Europe, the United States and Canada, the Far East, Central Asia, and South Africa. It also offers aircraft maintenance and conveyance services in airport; sells duty-free products; manages travel agencies; and produces and supplies prepared kosher meals to airlines and other organizations. In addition, the company provides institutional catering services; and markets tour packages and airline tickets to travel agents and individual travelers, as well as operates various restaurants. El Al Israel Airlines Ltd. was founded in 1948 and is based in Lod, Israel.",
    "website": "http://www.elal.com",
    "zipcode": "7015001"
  },
  "ELALF": {
    "city": "Lod",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Airlines",
    "long_name": "El Al Israel Airlines Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "EL AL ISRAEL AIRLINES LTD",
    "state": null,
    "summary": "El Al Israel Airlines Ltd., together with its subsidiaries, provides passengers and cargo transportation services. The company operates flights on passenger aircraft to approximately 40 direct destinations in 26 countries in Europe, the United States and Canada, the Far East, Central Asia, and South Africa. It also offers aircraft maintenance and conveyance services in airport; sells duty-free products; manages travel agencies; and produces and supplies prepared kosher meals to airlines and other organizations. In addition, the company provides institutional catering services; and markets tour packages and airline tickets to travel agents and individual travelers, as well as operates various restaurants. El Al Israel Airlines Ltd. was founded in 1948 and is based in Lod, Israel.",
    "website": "http://www.elal.com",
    "zipcode": "7015001"
  },
  "ELCO.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Conglomerates",
    "long_name": "Elco Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "ELCO LTD",
    "state": null,
    "summary": "Elco Ltd., together with its subsidiaries, operates in the construction, infrastructure, consumer electronics, telecommunications, entertainment, and real estate sectors in Israel and internationally. It operates through four segments: Electra, Electra Consumer Products, Electra Real Estate, and Supergaz Energy. The company is involved in the general contracting of building and infrastructure; mechanical engineering, real estate development, and concessions and facility management activities; import, retail, and marketing of air conditioning, telecommunication, and electronic home appliances; acquisition, management, and enhancement of multi-family properties; and content and distribution, leisure, and cinema businesses. It also markets, supplies, and distributes LPG, natural gas, and CNG to private households, as well as industrial, commercial, and transportation sectors. Elco Ltd. was founded in 1949 and is based in Tel Aviv-Yafo, Israel. Elco Ltd. is a subsidiary of G. Salkind Ltd.",
    "website": "http://www.elco.co.il",
    "zipcode": "978914"
  },
  "ELMR.TA": {
    "city": "Ashkelon",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Engineering & Construction",
    "long_name": "El-Mor Electric Installation & Services (1986) Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "ELMORE ELEC INSTL",
    "state": null,
    "summary": "El-Mor Electric Installation & Services (1986) Ltd., through its subsidiaries, operates in the energy, infrastructure, and communications fields in Israel and internationally. The company undertakes the construction and implementation of energy, electricity, and air-conditioning projects in various fields, including power plants, renewable and solar energy, industry, telecom, high-tech, commercial and public buildings, military and defense facilities, electrical and telecom infrastructure, and street lighting. It also constructs substations; contracts PV solar plants; manufactures and assembles power electrical boards, distribution switchboards, and automation and MCC boards; and provides management and maintenance services for energy, electrical, and electro-mechanical systems. In addition, the company engages in transforming organic waste into energy using pyrolysis and gasification solutions; planning, constructing, and maintaining cogeneration-based power stations with capacity up to 16 MW; and supplying, installing, and maintaining steam boilers based on fire tubes, water tubes, and electricity. El-Mor Electric Installation & Services (1986) Ltd. was founded in 1967 and is based in Ashkelon, Israel.",
    "website": "http://www.el-mor.co.il",
    "zipcode": null
  },
  "ELRN.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Conglomerates",
    "long_name": "Elron Electronic Industries Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "ELRON ELECTRONIC",
    "state": null,
    "summary": "Elron Electronic Industries Ltd., through its subsidiaries, provides technology products in the medical devices and cyber fields. The company offers BrainsGate, a minimally invasive treatment for ischemic stroke; Pocared, an automated microbiology lab system for infectious diseases diagnosis; CartiHeal implants for cartilage and bone repair in weight bearing joints; Coramaze, a transfemoral mitral valve repair system with atraumatic anchoring; Notal Vision, a remote monitoring of patients at risk of vision loss from age-related macular degeneration; cyber intelligence platform that detects and defuses threats before they become cyberattacks; Alcide, a dev-to-production security tool for workloads running on kubernetes platforms; and SecuredTouch a behavioral biometrics for mobile transactions. It also provides Ironscales, an automated phishing prevention, detection, and response platform; Cynerio, a connected medical device; Kindite, a cloud encryption solution; KZen, a non-custodial digital currency wallet; Naval Dome, a maritime cyber detection and prevention system; Sayata Labs, an AI-based cyber risk assessment solution; OpenLegacy, a platform that enables the digital transformation process; OzCode, which provides root cause analysis, collaboration, and real-time bug triage solutions; PLYmedia, a platform for ad networks; Audioburst, an AI-powered audio search platform; Aqwise, a biological water and wastewater treatment solutions for the industrial and municipal markets; Atlantium, a water disinfection solution; SECDO, a platform that automatically detects suspicious activity, while accelerating incident investigation and response; Kyma, a remote patient monitoring device; and Jordan Valley, an X-ray based metrology solutions for semiconductors process control. In addition, the company offers Cloudyn, Given Imaging, Sync-Rx, Wavion, Safend, Medingo, Teledata, and 3DV Systems. Elron Electronic Industries Ltd. was founded in 1961 and is based in Tel Aviv, Israel.",
    "website": "http://www.elron.com",
    "zipcode": "6702301"
  },
  "ELRNF": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Elron Electronic Industries Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "ELRON ELECTRONIC INDUSTRIES",
    "state": null,
    "summary": "Elron Electronic Industries Ltd., through its subsidiaries, provides technology products in the medical devices and cyber fields. The company offers BrainsGate, a minimally invasive treatment for ischemic stroke; Pocared, an automated microbiology lab system for infectious diseases diagnosis; CartiHeal implants for cartilage and bone repair in weight bearing joints; Coramaze, a transfemoral mitral valve repair system with atraumatic anchoring; Notal Vision, a remote monitoring of patients at risk of vision loss from age-related macular degeneration; cyber intelligence platform that detects and defuses threats before they become cyberattacks; Alcide, a dev-to-production security tool for workloads running on kubernetes platforms; and SecuredTouch a behavioral biometrics for mobile transactions. It also provides Ironscales, an automated phishing prevention, detection, and response platform; Cynerio, a connected medical device; Kindite, a cloud encryption solution; KZen, a non-custodial digital currency wallet; Naval Dome, a maritime cyber detection and prevention system; Sayata Labs, an AI-based cyber risk assessment solution; OpenLegacy, a platform that enables the digital transformation process; OzCode, which provides root cause analysis, collaboration, and real-time bug triage solutions; PLYmedia, a platform for ad networks; Audioburst, an AI-powered audio search platform; Aqwise, a biological water and wastewater treatment solutions for the industrial and municipal markets; Atlantium, a water disinfection solution; SECDO, a platform that automatically detects suspicious activity, while accelerating incident investigation and response; Kyma, a remote patient monitoring device; and Jordan Valley, an X-ray based metrology solutions for semiconductors process control. In addition, the company offers Cloudyn, Given Imaging, Sync-Rx, Wavion, Safend, Medingo, Teledata, and 3DV Systems. Elron Electronic Industries Ltd. was founded in 1961 and is based in Tel Aviv, Israel.",
    "website": "http://www.elron.com",
    "zipcode": "6702301"
  },
  "ELSPC.TA": {
    "city": "Caesarea",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Elspec Engineering Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "ELSPEC ENGINEERING",
    "state": null,
    "summary": "Elspec Engineering Ltd develops, manufactures, and markets power quality solutions and services to the industrial, commercial, and utility sectors worldwide. The company offers metering and protection products, such as multi-functional digital fault recorders; and hand-held, portable, and fixed power quality analyzers. It also provides PQSCADA Sapphire, an open programmable platform that offers functionality and performance for data exploration, analysis, and visualization; and power factor solutions. The company was founded in 1988 and is headquartered in Caesarea, Israel.",
    "website": "http://www.elspec-ltd.com",
    "zipcode": null
  },
  "ELTR.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Engineering & Construction",
    "long_name": "Electra Limited",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "ELECTRA LTD",
    "state": null,
    "summary": "Electra Limited operates as an electromechanical, and construction and infrastructure company in Israel and internationally. It operates through five segments: Construction and Infrastructure Projects in Israel; Construction projects and Infrastructure Projects Abroad; Facility Management; Development and Construction of Entrepreneurial Real Estate; and Concessions. The company designs, plans, and builds residential, commercial, and industrial complexes; and installs and maintains elevators, escalators, air-conditioning and heating systems, and electricity systems, as well as provides plumbing, water purification, and sewage solutions. It also maintains electromechanical infrastructure in residential, commercial, and industrial facilities; and provides building management amenities. In addition, the company engages in the instillation of electrical infrastructure products for high voltage power lines, high/intermediate voltage, and low voltage supply systems. Further, it develops and constructs real estate properties; and provides concept development, construction and infrastructure, and management services for concessionary projects. The company was formerly known as Electra (Israel) Ltd. and changed its name to Electra Limited in January 2003. Electra Limited was founded in 1945 and is based in Ramat Gan, Israel. Electra Limited operates as a subsidiary of Elco Ltd.",
    "website": "http://www.electra.co.il",
    "zipcode": "5250501"
  },
  "EQTL.TA": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Conglomerates",
    "long_name": "Equital Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "EQUITAL",
    "state": null,
    "summary": "Equital Ltd., through its subsidiaries, engages in the real estate, oil and gas, and residential construction businesses in Israel, the United States, and Europe. It is involved in the planning, developing, setting up, rental, and management of rental assets; and planning, developing, building, leasing, marketing, and sale of residential projects. It rents and manages transportation complexes, commercial areas, office buildings, industrial and storage buildings, parking lots, gas stations, and land for commercial tenants, transportation companies, and industrial and corporate clients. In addition, the company engages in the exploration, production, operation, management, and sale of oil, natural gas, and condensate for industrial customers and private electricity clients, and oil and natural distribution companies. Further, it manages and operates hotels. The company was incorporated in 1977 and is based in Petah Tikva, Israel.",
    "website": null,
    "zipcode": "49002"
  },
  "ESLT": {
    "city": "Haifa",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Aerospace & Defense",
    "long_name": "Elbit Systems Ltd.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "Elbit Systems Ltd.",
    "state": null,
    "summary": "Elbit Systems Ltd. develops and supplies a portfolio of airborne, land, and naval systems and products for defense, homeland security, and commercial aviation applications primarily in Israel. The company offers military aircraft and helicopter, commercial aviation, unmanned aircraft, electro-optic, night vision, countermeasures, naval, land vehicle, electronic warfare and signal intelligence, commercial cyber training, and medical instrumentation systems, as well as command, control, communications, computer, intelligence, surveillance, and reconnaissance and cyber systems; and munitions. The company markets its systems and products as a prime contractor or subcontractor to various governments and companies. It also has operations in the United States, Europe, Latin America, the Asia-Pacific, and internationally. Elbit Systems Ltd. was incorporated in 1966 and is based in Haifa, Israel.",
    "website": "http://elbitsystems.com",
    "zipcode": "3100401"
  },
  "ESLT.TA": {
    "city": "Haifa",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Aerospace & Defense",
    "long_name": "Elbit Systems Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "ELBIT SYSTEMS LTD",
    "state": null,
    "summary": "Elbit Systems Ltd. develops and supplies a portfolio of airborne, land, and naval systems and products for defense, homeland security, and commercial aviation applications primarily in Israel. The company offers military aircraft and helicopter, commercial aviation, unmanned aircraft, electro-optic, night vision, countermeasures, naval, land vehicle, electronic warfare and signal intelligence, commercial cyber training, and medical instrumentation systems, as well as command, control, communications, computer, intelligence, surveillance, and reconnaissance and cyber systems; and munitions. The company markets its systems and products as a prime contractor or subcontractor to various governments and companies. It also has operations in the United States, Europe, Latin America, the Asia-Pacific, and internationally. Elbit Systems Ltd. was incorporated in 1966 and is based in Haifa, Israel.",
    "website": "http://elbitsystems.com",
    "zipcode": "3100401"
  },
  "FBRT.TA": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Aerospace & Defense",
    "long_name": "FMS Enterprises Migun Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "FMS ENTERPR. MIGUN",
    "state": null,
    "summary": "FMS Enterprises Migun Ltd. manufactures and sells ballistic protection raw materials and products worldwide. It provides uni-directional (UD) polyethylene and aramid fabrics; pressed panels made of UD fabrics; military and civilian vehicles; composite armor kits; hard and soft armors; boat armor; and ballistic shields. The company offers its products for various applications, such as personal ballistic protection, vehicle armoring, ship armoring, and aircraft armoring applications. FMS Enterprises Migun Ltd. was founded in 1986 and is based in Petah Tikva, Israel.",
    "website": "http://www.fms.co.il",
    "zipcode": null
  },
  "FRDN.TA": {
    "city": "Haifa",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Fridenson Logistic Services Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "FRIDENSON LOGISTIC",
    "state": null,
    "summary": "Fridenson Logistic Services Ltd provides logistics solutions worldwide. The company offers international freight forwarding services, including sea and air delivery services, third-party deliveries and projects, customs brokerage services, cargo insurance, etc.; customs clearance and marine insurance services; and land transport and crane services, as well as provides trade and financing solutions. It operates storage and cargo terminals and shipping agency. The company was formerly known as Fridenson Cranes and Trucking Ltd. and changed its name to Fridenson Logistic Services Ltd in June 2007. Fridenson Logistic Services Ltd was founded in 1975 and is based in Haifa, Israel. Fridenson Logistic Services Ltd is a subsidiary of Cambridge Holdings Ltd.",
    "website": "http://www.fridenson.co.il",
    "zipcode": "26113"
  },
  "GAON.TA": {
    "city": "Or Yehuda",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Conglomerates",
    "long_name": "B. Gaon Holdings Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "B GAON HOLDINGS LT",
    "state": null,
    "summary": "B. Gaon Holdings Ltd. provides solutions for water and gas distribution, sewage treatment, desalination, and fire protection markets worldwide. The company operates through four divisions: Infrastructure, M.E.P Systems, Metering & Control, and Projects. It focuses on the development, production, and marketing of pipes, valves, hydrants, and accessories. The company offers steel and plastic pipes, various valves, and other accessories used in the infrastructure and industrial sectors; and residential plumbing pipes, air conditioning units, fire hydrants, valves for fire extinguishing systems, profiles, ducts, and others. It also manufactures and markets water measurement, control, and monitoring systems, as well as water meters. The company was founded in 1998 and is based in Or Yehuda, Israel.",
    "website": "http://www.gaon.com",
    "zipcode": "6039730"
  },
  "GKL.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Aerospace & Defense",
    "long_name": "Global Knafaim Leasing Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "GLOBAL KNAFAIM",
    "state": null,
    "summary": "Global Knafaim Leasing Ltd acquires, leases, and trades in used commercial aircraft. It offers its products to airlines, leasing companies, and financiers in North and South America, Europe, Asia, Australia, and South Africa. The company was incorporated in 2002 and is based in Ramat Gan, Israel. Global Knafaim Leasing Ltd is a subsidiary of Knafaim Holdings Ltd.",
    "website": "http://gkl-leasing.com",
    "zipcode": "5250606"
  },
  "GLPL.TA": {
    "city": "Sha'ar HaGolan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Building Products & Equipment",
    "long_name": "Golan Plastic Products Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "GOLAN PLASTIC PROD",
    "state": null,
    "summary": "Golan Plastic Products Ltd engages in the production and sale of PE-Xa piping solutions under the Pexgol name worldwide. The company provides pipes, fittings, and accessories. It serves the mining, industrial, infrastructure, residential, oil and gas, and aquaculture sectors. Golan Plastic Products Ltd was founded in 1964 and is based in Sha'ar HaGolan, Israel. Golan Plastic Products Ltd operates as a subsidiary of Kibbutz Shaar Hagolan",
    "website": "http://www.pexgol.com",
    "zipcode": "15145"
  },
  "GLTC.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Waste Management",
    "long_name": "Galileo Tech Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "GALILEO TECH",
    "state": null,
    "summary": "Galileo Tech Ltd provides plastic waste recycle solutions in Israel. The company offers a recycling technology that converts waste originated into raw materials for plastic products. It also products payment and purse clearing, and financial services. Galileo Tech Ltd is based in Tel Aviv, Israel.",
    "website": "http://www.galileo-technology.com",
    "zipcode": null
  },
  "GOSS.TA": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Security & Protection Services",
    "long_name": "G1 Secure Solutions Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "G 1 SECURE SOL",
    "state": null,
    "summary": "G1 Secure Solutions Ltd provides security and safety services in Israel. It operates through Technologies, Security, Monitoring, and Hotelo divisions. The company offers human security and electronic security services, as well as low voltage systems; and planning, supply, installation, maintenance, and servicing services. It serves smart cities, monitoring and control programming, fire detection and extinguishing systems, and next generation safety tools; and neighborhoods and cities, private homes and businesses, retail facilities, and public institutions and buildings. The company was founded in 1937 and is based in Petah Tikva, Israel.",
    "website": "http://www.g1-group.com",
    "zipcode": "4951714"
  },
  "HAMAT.TA": {
    "city": "Ashdod",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Building Products & Equipment",
    "long_name": "Hamat Group Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "HAMAT GROUP LTD",
    "state": null,
    "summary": "Hamat Group Ltd. manufactures, markets, and exports bathroom and kitchen products in Israel and internationally. The company provides faucets for bathroom, kitchen, and toilet; showers and shower stalls; kitchen and bathroom sinks; and spare parts, such as pipes, tubs, steam delicacies, handles for taps, ceramic apparatus, and drainage products, as well as installations and sanitary products. It also offers bath accessories, such as soap dispensers, towel bars, racks, mirrors, aerators, toilet paper holders, toilet brush holders, garbage pails, grab bars, hangers, and other functional products. The company was founded in 1951 and is based in Ashdod, Israel. Hamat Group Ltd. is a subsidiary of Niur Holdings Ltd.",
    "website": "http://www.hamat.co.il",
    "zipcode": "77164"
  },
  "HICN.TA": {
    "city": "Yavne",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Highcon Systems Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "HIGHCON SYSTEMS",
    "state": null,
    "summary": "Highcon Systems Ltd. develops and markets a proprietary technology for digital cutting and creasing solutions for post print processes in the folding carton and corrugated carton industry. It offers Highcon Beam 2C for the digital cutting and creasing for corrugated board; Highcon Beam 2 for the digital cutting and creasing for mainstream production; Highcon Euclid 5S, a digital cutting and creasing machine to suit the needs of printers working in B2/29 in format; and Highcon Euclid 5C, a digital cutting and creasing machine for converters working in corrugated and fluted substrates from 1 mm up to 3mm / 40-120pt. The company was founded in 2009 and is headquartered in Yavne, Israel.",
    "website": "http://www.highcon.net",
    "zipcode": "8122503"
  },
  "IMCO.TA": {
    "city": "Nesher",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Aerospace & Defense",
    "long_name": "IMCO Industries Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "IMCO INDUSTRIES",
    "state": null,
    "summary": "IMCO Industries Ltd. designs, develops, manufactures, and sells electromechanical and electrical solutions for military customers in Israel. The company offers land solutions, such as high-definition multi-function display for ground applications, operational electrical and power distribution boxes, smoke grenade launchers, control harnesses, external crew switch boxes, electro-mechanic and video switches, internal and external LED lightings, slip rings, and fuel feeler gauges, as well as CNC metalworking and assembly manual work solutions. It also provides air solutions, including glass cockpits for foreign army, large area display for glass cockpits, IAI blackhawk demonstrator helicopters, multi-function display for avionic radar and EW systems, and harnesses, as well as hands-on throttle and stick products, such as throttles and joysticks. In addition, the company provides naval solutions, such as computer units for stabilized cannon, naval multi-function displays and recorders, harnesses for stabilized cannon, fire control system display screens, and video recording and distribution systems, as well as renovation of submarine stick wheels. Further, it offers medical / civil solutions, including aesthetics devices, such as laser hair removal, full body contouring, facial aesthetics RF, and laser devices, as well as laser device handles. The company was founded in 1974 and is based in Nesher, Israel. IMCO Industries Ltd. is a subsidiary of Josef Yakir Investments & Assets Ltd.",
    "website": "http://www.imco-ind.com",
    "zipcode": "3660102"
  },
  "INFR.TA": {
    "city": "Avihayil",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Waste Management",
    "long_name": "Infimer Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "INFIMER LTD",
    "state": null,
    "summary": "Infimer Ltd develops technology and production processes for converting municipal solid waste. The company produces Infimer, a thermoplastic composite material that serves as an alternative to the raw materials used by the plastics industry, and minimizes cost of household landfilling and the carbon footprints. Its Infimer range of thermoplastic composite materials are used for the production of plastic products, such as garden sheds, chairs, pallets, toolboxes, and pipes. The company was founded in 2013 and is based in Avihayil, Israel.",
    "website": "http://www.infimer.com",
    "zipcode": "4291000"
  },
  "INTR.TA": {
    "city": "Herzliya",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Conglomerates",
    "long_name": "Inter Gamma Investment Company Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "INTERGAMA",
    "state": null,
    "summary": "Inter-Gamma Investment Company Ltd., through its subsidiaries, operates in the fuel management and fuel stations infrastructure, public transportation payment systems, imaging, and real-estate sectors worldwide. It operates through three divisions: Technologies, Real Estate, and Imaging. The Technologies division develops, manufactures, and markets automated car refueling, automated fuel stations management, and car fleets management systems, including automation, c-store, RFID vehicle identification, and fuel and fleet management systems for retail gas stations and commercial fleets, as well as on board management systems for public transportation. The Real Estate division owns and operates office spaces and service areas in industrial zones. The Imaging division distributes consumer imaging, professional imaging, and raw materials for electronic imaging equipment, as well as consumables. Inter-Gamma Investment Company Ltd. was founded in 1965 and is based in Herzliya, Israel.",
    "website": "http://www.intergamma.co.il",
    "zipcode": null
  },
  "ISHI.TA": {
    "city": "Haifa",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Aerospace & Defense",
    "long_name": "Israel Shipyards Industries Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "ISRAEL SHIPYARDS",
    "state": null,
    "summary": "Israel Shipyards Industries Ltd designs and constructs military and civilian vessels. It also operates and manages cargo ships; and provides vessel repair services. In addition, it is involved in the operation of a port, as well as provision of port services. The company was incorporated in 2019 and is based in Haifa, Israel.",
    "website": null,
    "zipcode": "3296280"
  },
  "KNFM.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Airlines",
    "long_name": "Knafaim Holdings Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "KNAFAIM HLDGS LTD",
    "state": null,
    "summary": "Knafaim Holdings Ltd, through its subsidiaries, operates in the aviation industry. The company operates flights in various routes in Europe, Asia, Africa, and North America; and provides duty free products, preparing and supplying passenger caterings, various security services, and ongoing and general maintenance services for aircrafts, as well as manages travel agencies. It also engages in the purchase, lease, and sale of commercial aircrafts to airlines worldwide. In addition, the company offers military aircraft maintenance services to the Israeli Air Force; and ground handling service to airlines and private aircrafts operating in Ben Gurion international airport. The company was founded in 1980 and is based in Ramat Gan, Israel.",
    "website": "http://www.knafaim.co.il/",
    "zipcode": null
  },
  "KRNT": {
    "city": "Rosh Haayin",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Specialty Industrial Machinery",
    "long_name": "Kornit Digital Ltd.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "Kornit Digital Ltd.",
    "state": null,
    "summary": "Kornit Digital Ltd. develops, designs, and markets digital printing solutions for the fashion, apparel, and home decor segments of printed textile industry worldwide. The company's solutions include digital printing systems, ink and other consumables, associated software, and value-added services. Its products and services include direct-to-garment printing systems from smaller industrial operators to mass producers; NeoPigment ink and other consumables; QuickP designer software; and maintenance and support, and professional services. The company serves decorators, online businesses, brand owners, and contract printers. Kornit Digital Ltd. was incorporated in 2002 and is headquartered in Rosh HaAyin, Israel.",
    "website": "http://www.kornit.com",
    "zipcode": "4809246"
  },
  "LEOF.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Engineering & Construction",
    "long_name": "Lewinsky-Ofer Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "LEVINSKI OFER LTD",
    "state": null,
    "summary": "Lewinsky-Ofer Ltd. operates as a public construction and entrepreneurship company in Israel. It constructs residential properties; office and industry buildings; educational institutions; and residential neighborhoods. The company was formerly known as Paz Hen Ltd. and changed its name to Lewinsky-Ofer Ltd. in 2013. Lewinsky-Ofer Ltd. was incorporated in 1977 and is based in Tel Aviv, Israel.",
    "website": "http://www.levinski-ofer.co.il",
    "zipcode": null
  },
  "LEVI.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Engineering & Construction",
    "long_name": "Meshulam Levinstein Contracting & Engineering Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "MESHULAM LEVINSTEI",
    "state": null,
    "summary": "Meshulam Levinstein Contracting & Engineering Ltd. engages in the engineering, construction, and real estate businesses in Israel and internationally. The company constructs and develops office buildings, public buildings, and structures designed for the hi-tech industry; housing units, apartment buildings, and residential neighborhoods; and shopping centers and commercial buildings. It also engages in the construction and ownership of income real estate properties; and project development and implementation activities, including land investments, handling permits, construction, sales, and rental activities. In addition, the company undertakes infrastructure work, bridge construction, and building contracting activities. Meshulam Levinstein Contracting & Engineering Ltd. was founded in 1945 and is based in Tel Aviv, Israel.",
    "website": "http://www.levinstein.co.il",
    "zipcode": null
  },
  "LHIS.TA": {
    "city": "Sderot",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Lachish Industries Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "LACHISH INDUSTRIES",
    "state": null,
    "summary": "Lachish Industries Ltd. manufactures and sells cattle feeding machinery in Israel. The company offers products, such as self-propellers, vertical trailers, stationery mixers, and delivery trucks. It sells its products for dairy farming and feedlot industry under the RMH brand. The company was founded in 1956 and is based in Sderot, Israel.",
    "website": "http://www.rmhmixer.com",
    "zipcode": "80100"
  },
  "LSCO.TA": {
    "city": "Holon",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Engineering & Construction",
    "long_name": "Lesico Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "LESICO LTD",
    "state": null,
    "summary": "Lesico Ltd., together with its subsidiaries, engages in the construction of various infrastructure projects in Israel and internationally. The company operates in two segments, Construction and Maintenance. It coordinates the construction of civil engineering projects, including various buildings, and infrastructures above and below the ground; administrative and operational structures, such as protected structures and obstacles on the borders for the defense establishment; and rail infrastructure, such as railways and related works. The company also coordinates the construction of infrastructure for fuel, gas, water, and sewage pipelines; mechanical work of piping; installation of equipment at power stations; and establishment of complex pipeline infrastructure for the pharmaceutical, food, and microelectronics sectors. In addition, it constructs sewage treatment plants, pumping stations, infrastructure in desalination facilities, sludge treatment plants, and infrastructure related to smell of waste plants. Further, the company provides preventive and fracture maintenance services for water and sewage systems to municipal and institutional customers under long-term contracts, as well as smashing works and pipe sleeve services for the maintenance of pipeline infrastructures; and maintains and services wastewater treatment plants. Additionally, it undertakes service and maintenance work in energy and power stations, including maintenance of turbines and mechanical maintenance; and establishes and operates infrastructures for the treatment and provision of various environmental services under franchise agreements. The company is also involved in the engineering sector. Lesico Ltd. was incorporated in 1969 and is based in Holon, Israel.",
    "website": "http://www.lesico.com",
    "zipcode": null
  },
  "LUDN.TA": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Engineering & Construction",
    "long_name": "Ludan Engineering Co. Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "LUDAN ENGINEERING",
    "state": null,
    "summary": "Ludan Engineering Co. Ltd. operates as an engineering company worldwide. It is involved in the provision of engineering and project management services that include management, planning, procurement, and construction services, as well as turn-key services; technological solutions for industrial wastewater; consultation and construction of land and groundwater; and treatment of exhaust gases, contaminated water, and sewage. The company also develops, manufactures, and installs computerized ticketing systems, entrance control systems, and vehicle fleet management systems; produces automated testing systems; provides real-time command and control systems and feasibility testing services; and implements international management software. In addition, it engages in the planning solutions and supply of systems and equipment in the fields of building control, security, and access control and multimedia systems, as well as operation and maintenance of the systems; and development of solutions for information security for infrastructure companies and industrial factories. The company was founded in 1977 and is headquartered in Petah Tikva, Israel.",
    "website": "http://www.ludan-group.com/ludan-group",
    "zipcode": "49130"
  },
  "LUZN.TA": {
    "city": "Jerusalem",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Engineering & Construction",
    "long_name": "Amos Luzon Development and Energy Group Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "AMOS LUZON DEVELOP",
    "state": null,
    "summary": "Amos Luzon Development and Energy Group Ltd, together with its subsidiaries, operates as a real estate development and construction company in Israel, Poland, Bulgaria, Slovakia, and Ukraine. It is also involved in the energy infrastructure business. The company undertakes offices and commercial center, residence, hotel, apartment, and other projects. It serves customers in the private and public sectors. The company was formerly known as U. Dori Group Ltd and changed its name to Amos Luzon Development and Energy Group Ltd in May 2016. The company was founded in 1961 and is based in Jerusalem, Israel. Amos Luzon Development and Energy Group Ltd is a subsidiary of Gazit-Globe Israel (Development) Ltd.",
    "website": "http://www.dorigroup.co.il",
    "zipcode": null
  },
  "MAGS": {
    "city": "Yehud",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NGM",
    "industry": "Security & Protection Services",
    "long_name": "Magal Security Systems Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Magal Security Systems Ltd.",
    "state": null,
    "summary": "Magal Security Systems Ltd. develops, manufactures, markets, and sells perimeter intrusion detection sensors, physical barriers, video analytics and management systems, cyber security products and systems, and security video observation and surveillance systems. The company operates through two segments, Products and Projects. It offers perimeter security products that enable customers to monitor, limit, and control access by unauthorized personnel to specific regions or areas. The company's perimeter security systems include fence mounted detection systems; detection grids, gates, and fences to protect water passages, VIP residences, and other outdoor applications; buried sensors; hybrid perimeter intrusion detection and intelligent lighting systems; electrical field disturbance sensors; and microwave sensors. It also provides integrated intelligent video management solutions for security surveillance and business intelligence applications; video management products for monitoring, securing, and the active management of network video systems and analytics, as well as wired, wireless, and fiber optic communication network solutions; and turnkey solutions. In addition, the company offers life safety/duress alarm to protect personnel in prisons. Further, it provides closed circuit television and intelligent video analytics solutions; Fortis X, a new generation command and control system; StarNet 2, a security management system; and Network Manager, a middleware package. The company's products are used to protect borders and sensitive facilities, including military bases, power plants, air and sea ports, postal facilities, prisons, banks, retail operations, hospitals, municipal security, sporting events, and industrial locations from terrorism, theft, and security threats. It sells its products through system integrators and distribution channels. The company was founded in 1965 and is headquartered in Yehud, Israel.",
    "website": "http://www.magalsecurity.com",
    "zipcode": "5621617"
  },
  "MMAN.TA": {
    "city": "Lod",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Maman-Cargo Terminals & Handling Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "MAMAN CARGO TERMIN",
    "state": null,
    "summary": "Maman-Cargo Terminals & Handling Ltd., together with its subsidiaries, provides logistics and aviation services in Israel. The company offers import, export, commercial land fright, and courier services. It also provides temperature control storage for storing aircraft surfaces and bulk refrigerated cargo, standard refrigeration, cooling, etc. The company was founded in 1974 and is based in Lod, Israel. Maman-Cargo Terminals & Handling Ltd. is a subsidiary of Taavura Holdings Ltd.",
    "website": "http://www.maman.co.il",
    "zipcode": null
  },
  "MNGN.TA": {
    "city": "Jerusalem",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Min Hagoren Development Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "MIN HAGOREN DEV",
    "state": null,
    "summary": "Min Hagoren Development Ltd., a power system company, develops, manufactures, constructs, markets, and sells uninterruptible power supply (UPS) power units in Israel. Its products include UPS systems consisting of battery cabinet, control and management, industrial, and modular online three phase UPS systems, as well as UPS repair services; and power supply units, such as HPS power supplies, telecom power supply units, DC to AC inverters, and converters. The company also provides three phase transformers; and automatic voltage stabilizers comprising static voltage regulators to protect electrical equipment from mains power surges and brown-outs; GSTS and STSW static switches; GTSI industrial UPS and inverters; and emergency lighting systems. In addition, it offers modular DC to DC, and modular AC to DC converters. It also exports its products to approximately 80 countries. Min Hagoren Development Ltd. was founded in 1970 and is headquartered in Jerusalem, Israel.",
    "website": "http://gorendev.co.il",
    "zipcode": "9777517"
  },
  "MNRV.TA": {
    "city": "Ashdod",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Engineering & Construction",
    "long_name": "Minrav Group Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "MINRAV HOLDINGS",
    "state": null,
    "summary": "Minrav Group Ltd, together its subsidiaries, engages in engineering and construction works in Israel and internationally. The company is involved in the engineering management and execution of construction works in real estate, infrastructure, and environmental projects as contractors in the public and private sectors. Its projects include military training camp cities, train tunnels, sea water desalination plants, parking lots and bridges, museums, heritage centers, cultural auditoriums, football stadiums, office buildings, government offices, and other facilities and offices. The company also develops residential construction projects comprising apartments; leases and manages assets to the business and government sectors for use as commercial, industrial, and office space; and constructs and operates wastewater purification plants. In addition, it manufactures, imports, and markets plastic and PVC products; and operates and leases freezing works. The company was formerly known as Minrav Holdings Ltd. and changed its name to Minrav Group Ltd in January 2021. Minrav Group Ltd was founded in 1969 and is based in Ashdod, Israel.",
    "website": "http://www.minrav.co.il",
    "zipcode": null
  },
  "ORBI.TA": {
    "city": "Netanya",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Aerospace & Defense",
    "long_name": "Orbit Technologies Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "ORBIT TECHNOLOGIES",
    "state": null,
    "summary": "Orbit Technologies Ltd provides airborne communications, and satellite-tracking maritime and ground-station solutions in Israel and internationally. It provides airborne, maritime, and rail mobile satcom products; and tracking and telemetry products, including aeronautical test telemetries and antenna control units. The company also offers EO satellite tracking and remote sensing, and pedestals ground station solutions; and airborne audio solutions. In addition, it provides turnkey solutions. The company was founded in 1950 and is headquartered in Netanya, Israel.",
    "website": "http://www.orbit-cs.com",
    "zipcode": "4250608"
  },
  "ORIN.TA": {
    "city": "Lod",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Orian Sh.M. Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "ORIAN SH.M. LTD.",
    "state": null,
    "summary": "Orian Sh.M. Ltd. provides logistics services worldwide. It offers international freight forwarding and courier, customs clearance and brokerage, ocean and air freight, storage center, and distribution and transportation services, as well as ocean and air cargo insurance, healthcare supply chain, third party shipment, special express, project cargo, and blood samples delivery services. The company was founded in 1953 and is based in Lod, Israel.",
    "website": "http://www.orian.com",
    "zipcode": "71100"
  },
  "ORON.TA": {
    "city": "Beersheba",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Engineering & Construction",
    "long_name": "Oron Group Investments & Holdings Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "ORON GROUP INVESTM",
    "state": null,
    "summary": "Oron Group Investments & Holdings Ltd, together with its subsidiaries, engages in the civil engineering, infrastructure, and construction businesses in Israel. The company constructs residential condominiums, including detached houses; and plans, executes, and manages engineering works, bridge construction, tunneling works, marine works, and public buildings, as well as offers solutions in the fields of construction and paving. It is also involved in the planning, construction, and management of industrial buildings, logistic centers, factories, storage buildings, and commercial centers; planning and execution of infrastructure projects, such as roads, bridges, and pumping stations; and development and execution of civil engineering and real estate projects. In addition, the company provides geotechnical works, such as geological survey drilling, groundwater monitoring, geological drilling, water pumping, stabilization and supporting slopes, energy absorbing networks, concrete spraying, vertical drains, tunneling works, dice injections, and jet grout works. Further, it manufactures and supplies quarry materials for the production of concrete and asphalt mixtures; and ready-mix concrete, cement mortar, kurkar clay, white clay, and asphalt mixtures, as well as offers bulk transportation services. Oron Group Investments & Holdings Ltd was founded in 2003 and is based in Beer Sheva, Israel.",
    "website": "http://www.oron-group.co.il",
    "zipcode": null
  },
  "ORTC.TA": {
    "city": "Herzliya",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Business Equipment & Supplies",
    "long_name": "O.R.T. Technologies Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "O.R.T. TECHNOLOGIE",
    "state": null,
    "summary": "O.R.T. Technologies Ltd, through its subsidiaries, supplies automotive fleet management and electronic payment method products in Israel. The company provides smart cards; and management and control systems, as well as related products for public transportation. It also offers automated ticketing systems; rear office servers; driver consoles, sales machines, and device microbiology systems on vehicles; and manual and automatic devices for sale and validation stations. The company was formerly known as Rapac Electronics Ltd. and changed its name to O.R.T. Technologies Ltd in 2006. O.R.T. Technologies Ltd was founded in 2000 and is based in Herzliya, Israel.",
    "website": "http://www.ortechno.com",
    "zipcode": null
  },
  "OTIVF": {
    "city": "Yokneam Illit",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Business Equipment & Supplies",
    "long_name": "On Track Innovations Ltd.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ON TRACK INNOVATIONS",
    "state": null,
    "summary": "On Track Innovations Ltd., together with its subsidiaries, designs, develops, and markets cashless payment solutions worldwide. It operates in two segments, Retail and Petroleum. The company's product portfolio includes readers, controllers and terminals, management software, payment services, and a complete Payment System as a Service (PSaaS). It offers OtiMetry System that incorporates telemetry, sales, and operations into solution with cloud control, and real-time online management and alerts; TRIO-IQ, a telemetry gateway and EMV payment reader; TRIO, a payment device for installation in kiosks and vending machines; UNO-8 and UNO-PLUS, a contactless reader for unattended retail environments with self-service payment stations, including ATMs, toll roads, access control, and mass transit validators; and controllers and gateways comprises OTI TeleBox, a machine-to-machine controller that enables the communication between machines, and GoBox, a machine-to-machine controller that communicates between machines, cashless readers, and remote servers. The company also provides a terminal management system, which is a cloud-based system that provides real-time control and insights of each machine enabling operators to remotely manage their terminal's fleet; and cloud based vending management system and vending BI. In addition, it offers payment services, including payment service API, which is an application programming interface, close loop payment that supports close-loop payment cards, and APIs for integration with mobile payment solutions, as well as original equipment manufacturer (OEM) payment solutions. The company's readers are certified by various card associations and support Apple Pay, Google Pay, Samsung Pay, MIFARE, FeliCa, and others. The company was formerly known as De-Bug Innovations Ltd. and changed its name to On Track Innovations Ltd. in July 1991. On Track Innovations Ltd. was founded in 1990 and is headquartered in Yokneam Illit, Israel.",
    "website": "http://www.otiglobal.com",
    "zipcode": "2069200"
  },
  "OVRS.TA": {
    "city": "Ashdod",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Overseas Commerce Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "OVERSEAS",
    "state": null,
    "summary": "Overseas Commerce Ltd. provides logistics services in Israel and internationally. The company operates and manages customs- supervised container and cargo terminals; and warehouses for storing hazardous materials and products under temperature control. It also provides logistics services, such as warehousing, inventory management, value-added services, etc.; and land transport and distribution services. The company serves exporters and importers, international cargo forwarders, customs brokers, shipping companies and ship agents, and various government authorities related to the import and export processes of cargo. Overseas Commerce Ltd. was founded in 1967 and is based in Ashdod, Israel.",
    "website": "http://www.ovrs.co.il",
    "zipcode": "7714001"
  },
  "PAYT.TA": {
    "city": "Ness Ziona",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Electrical Equipment & Parts",
    "long_name": "Payton Industries Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "PAYTON INDUSTRIES",
    "state": null,
    "summary": "Payton Industries Ltd. develops, manufactures, and sells transformers for the telecommunications, industry and military, and medical companies in Israel, the United States, and East Asia. It offers high frequency, current, network, single-phase, three-phase, and planar transformers; and coils, chokes, chargers, adapters, power supplies, and lighting blasts, as well as repair and electronic assembly services. Payton Industries Ltd. was founded in 1987 and is based in Nes Ziona, Israel.",
    "website": "http://www.payton.co.il",
    "zipcode": "7403128"
  },
  "PLRM.TA": {
    "city": "Zevulun",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Building Products & Equipment",
    "long_name": "Palram Industries (1990) Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "PALRAM INDUSTRIES",
    "state": null,
    "summary": "Palram Industries (1990) Ltd, together with its subsidiaries, manufactures and sells semi-finished extruded thermoplastic sheets, architectural panel systems, and finished products in Israel and internationally. The company offers PVC, polycarbonate and acrylic sheets, and panel systems. Its products are used in DIY, construction, architectural project, advertising, agriculture, glazing, and fabrication markets. The company was founded in 1963 and is based in Zevulun, Israel. Palram Industries (1990) Ltd operates as a subsidiary of Ramat Yohanan Industries & Agriculture Development-Agricultural Coperative Society.",
    "website": "http://www.palram.com",
    "zipcode": "30035"
  },
  "RADA": {
    "city": "Netanya",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Aerospace & Defense",
    "long_name": "RADA Electronic Industries Ltd.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "RADA Electronic Industries Ltd.",
    "state": null,
    "summary": "RADA Electronic Industries Ltd., a defense technology company, develops, manufactures, markets, and sells defense electronics to various air forces and companies worldwide. It offers military avionic systems, including flight data recorders for fighter aircraft; digital video/audio/data recorders; high definition digital video/audio/data recording for fighter and trainer aircrafts; a range of head-up-displays color video cameras for fighter aircraft; and various ground debriefing solutions. The company also provides avionics solutions, such as mission data recorders and debriefing solutions and HUD video cameras; avionics for unmanned aircraft vehicles (UAVs) comprising interface control processors, engine control computers, payload management computers, and others; and inertial navigation systems for air and land applications. In addition, it offers land-based tactical radars for defense forces, critical infrastructure protection, border surveillance, active military protection, and counter-drone applications. RADA Electronic Industries Ltd. has strategic relationships with Embraer S.A.; Hindustan Aeronautics Ltd.; Israel Aerospace Industries Ltd.; Military Forces; Lockheed Martin Corporation; Rafael Advanced Defense Systems Ltd.; Elbit Systems Ltd.; Leonardo DRS; Anduril Industries Inc.; European Air Defense Integrators; Ascent Vision Technologies; and Boeing Defense, Space & Security. The company was founded in 1970 and is headquartered in Netanya, Israel.",
    "website": "http://www.rada.com",
    "zipcode": "4250407"
  },
  "RADA.TA": {
    "city": "Netanya",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Aerospace & Defense",
    "long_name": "RADA Electronic Industries Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "RADA ELECTRONIC",
    "state": null,
    "summary": "RADA Electronic Industries Ltd., a defense technology company, develops, manufactures, markets, and sells defense electronics to various air forces and companies worldwide. It offers military avionic systems, including flight data recorders for fighter aircraft; digital video/audio/data recorders; high definition digital video/audio/data recording for fighter and trainer aircrafts; a range of head-up-displays color video cameras for fighter aircraft; and various ground debriefing solutions. The company also provides avionics solutions, such as mission data recorders and debriefing solutions and HUD video cameras; avionics for unmanned aircraft vehicles (UAVs) comprising interface control processors, engine control computers, payload management computers, and others; and inertial navigation systems for air and land applications. In addition, it offers land-based tactical radars for defense forces, critical infrastructure protection, border surveillance, active military protection, and counter-drone applications. RADA Electronic Industries Ltd. has strategic relationships with Embraer S.A.; Hindustan Aeronautics Ltd.; Israel Aerospace Industries Ltd.; Military Forces; Lockheed Martin Corporation; Rafael Advanced Defense Systems Ltd.; Elbit Systems Ltd.; Leonardo DRS; Anduril Industries Inc.; European Air Defense Integrators; Ascent Vision Technologies; and Boeing Defense, Space & Security. The company was founded in 1970 and is headquartered in Netanya, Israel.",
    "website": "http://www.rada.com",
    "zipcode": "4250407"
  },
  "RDF1.F": {
    "city": "Netanya",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Aerospace & Defense",
    "long_name": "RADA Electronic Industries Ltd.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "RADA EL.  DL-,03",
    "state": null,
    "summary": "RADA Electronic Industries Ltd., a defense technology company, develops, manufactures, markets, and sells defense electronics to various air forces and companies worldwide. It offers military avionic systems, including flight data recorders for fighter aircraft; digital video/audio/data recorders; high definition digital video/audio/data recording for fighter and trainer aircrafts; a range of head-up-displays color video cameras for fighter aircraft; and various ground debriefing solutions. The company also provides avionics solutions, such as mission data recorders and debriefing solutions and HUD video cameras; avionics for unmanned aircraft vehicles (UAVs) comprising interface control processors, engine control computers, payload management computers, and others; and inertial navigation systems for air and land applications. In addition, it offers land-based tactical radars for defense forces, critical infrastructure protection, border surveillance, active military protection, and counter-drone applications. RADA Electronic Industries Ltd. has strategic relationships with Embraer S.A.; Hindustan Aeronautics Ltd.; Israel Aerospace Industries Ltd.; Military Forces; Lockheed Martin Corporation; Rafael Advanced Defense Systems Ltd.; Elbit Systems Ltd.; Leonardo DRS; Anduril Industries Inc.; European Air Defense Integrators; Ascent Vision Technologies; and Boeing Defense, Space & Security. The company was founded in 1970 and is headquartered in Netanya, Israel.",
    "website": "http://www.rada.com",
    "zipcode": "4250407"
  },
  "ROO.AX": {
    "city": "Kfar Vitkin",
    "country": "Israel",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Farm & Heavy Construction Machinery",
    "long_name": "Roots Sustainable Agricultural Technologies Ltd.",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ROOTS CDI 1:1",
    "state": null,
    "summary": "Roots Sustainable Agricultural Technologies Ltd. operates as an agriculture technology company in Israel. It focuses on developing, producing, and commercializing precision agriculture technologies that address difficult weather conditions, enhance crop yields, and provide water for irrigation. The company offers drip and temperature control (D-RZTO) system, root zone temperature optimization (RZTO) system, and irrigation by condensation (IBC)system. Roots Sustainable Agricultural Technologies Ltd. was incorporated in 2009 and is based in Kfar Vitkin, Israel.",
    "website": "http://www.rootssat.com",
    "zipcode": null
  },
  "RSEL.TA": {
    "city": "Migdal Ha'Emek",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Aerospace & Defense",
    "long_name": "RSL Electronics Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "R.S.L.ELECTRONICS",
    "state": null,
    "summary": "RSL Electronics Ltd. engages in the development, manufacture, and sale of control, utilities, and diagnostics and prognostics systems for aerospace, energy, and defense sectors in Israel and internationally. It provides diagnostic engine starting system controllers, digital temperature control amplifiers, break control systems, digital generator control units, diagnostic fuel management controllers, fuel system controllers, and primary power distribution control systems. The company also offers total health and usage management system for helicopters and UAVs; and CMS for wind turbines, hydro-electric turbines, and steam turbines, as well as for trains and railway tracks. In addition, it provides muzzle velocity radar systems to measure the velocity of a range of ammunition for field artillery, mortars, naval guns, and anti-aircraft guns. RSL Electronics Ltd. is based in Migdal Ha'Emek, Israel.",
    "website": "http://www.rsl-electronics.com",
    "zipcode": "23100"
  },
  "SCOP.TA": {
    "city": "Bnei Ayish",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Industrial Distribution",
    "long_name": "Scope Metals Group Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "SCOPE METALS GROUP",
    "state": null,
    "summary": "Scope Metals Group Ltd. stores, processes, and delivers metal and plastic worldwide. The company supplies stainless steel, aluminum, steel and steel alloys, magnesium, plastics, nickel alloys, brass, bronze, copper, lead and titanium. Its products include metal and engineering plastic products, such as plates, sheets, coils, bars, beams, extrusions, pipes, tubes, and wires; and pipes, fittings, valves, and accessories for fire protection systems, steam and ventilation systems, food and clean industries, sewage and water systems, and infrastructure supplies. The company also offers welding equipment and accessories; fasteners; and decorative products, consisting of stairs and railings, floor gratings, decorative stainless steel sheets, and other products. It serves food processing and pharmaceuticals, energy, water, chemicals and petrochemicals, fertilizers, aerospace and aviation, military, machining, elevators and construction, solar energy, infrastructure, microelectronics, high tech, and other industries. The company was founded in 1968 and is headquartered in Bnei Ayish, Israel.",
    "website": "http://www.scope-metal.com",
    "zipcode": null
  },
  "SEMG.TA": {
    "city": "Hod Hasharon",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Waste Management",
    "long_name": "Seach Medical Group Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "SEACH MEDICAL",
    "state": null,
    "summary": "Seach Medical Group Ltd. cultivates, processes, produces, and manufactures medicinal and cannabis products. The company is based in Hod Hasharon, Israel.",
    "website": "http://www.seach.co.il",
    "zipcode": "45110"
  },
  "SHGR.TA": {
    "city": "Holon",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Specialty Business Services",
    "long_name": "Shagrir Group Vehicle Services Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "SHAGRIR GROUP VEHI",
    "state": null,
    "summary": "Shagrir Group Vehicle Services Ltd provides roadside towing, rescue, and assistance services in Israel. The company offers various services, such as assistance in starting the vehicle, repairing, wheel replacement, fuel supply, and light bulb replacement services, as well as other services that consist of water damage, plumbing, bodywork, and paint services. It provides services to insurance companies, insurance agents, and general public. The company operates eight service centers. Shagrir Group Vehicle Services Ltd was founded in 1984 and is based in Holon, Israel.",
    "website": "http://www.shagrir.co.il",
    "zipcode": "5811701"
  },
  "SHOM.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Conglomerates",
    "long_name": "E.N. Shoham Business Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "SHOHAM BUSINESS",
    "state": null,
    "summary": "E.N. Shoham Business Ltd operates as an investment arm of Rubicon Business Group Ltd. It specializes in investments in the industry, retail, and real estate sectors. The firm seeks to invest in Israel and abroad. Isal Amlat was founded in 1987 and is based in Herzliya Pituach, Israel. E.N.",
    "website": "http://www.shohambiz.com",
    "zipcode": null
  },
  "SKBN.TA": {
    "city": "Airport City",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Engineering & Construction",
    "long_name": "Shikun & Binui Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "SHIKUN & BINUI LTD",
    "state": null,
    "summary": "Shikun & Binui Ltd., together with its subsidiaries, engages in the infrastructure and construction, real estate development, concessions, energy, and other businesses in Israel, the United States, Africa, and internationally. The company undertakes road paving, bridge building, foundations, tunnels, drilling, pipe system thrusting, electric, and water and sewage infrastructure works; and constructs hydraulic power plants, railroad and gas infrastructures, as well as placing of fiber optics. It also manages and executes contracting works in non-residential, residential, and energy and water construction projects; and manufactures various raw materials, including concrete, asphalt, construction materials, and pre-cast accessories. In addition, the company purchase, plans, develops, and sells land; and constructs, rents, and sells office and industrial buildings. Further, it engages in financing, planning, and operating infrastructure projects, including water desalination and hydraulic production of electricity; and initiating, building, and operating facilities for the production of electricity using solar photovoltaic energy and natural gas. The company was formerly known as Housing and Construction Holding Company Ltd. and changed its name to Shikun & Binui Ltd. in March 2009. The company was founded in 1920 and is headquartered in Airport City, Israel.",
    "website": "http://www.shikunbinui.com",
    "zipcode": "7010000"
  },
  "SPCB": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Security & Protection Services",
    "long_name": "SuperCom Ltd.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SuperCom, Ltd.",
    "state": null,
    "summary": "SuperCom Ltd. provides digital identity, Internet of Things and connectivity, and cyber security products and solutions to governments, and private and public organizations worldwide. The company offers MAGNA, a common platform for ID registries, e-passports, biometric visas, automated fingerprint identification systems, digitized driver's licenses, and electronic voter registration and election management. Its PureRF suite is a solution based on RFID tag technology to identify, locate, track, monitor, count, and protect people and objects. The company's PureRF suite comprises PureRF tags, hands-free long-range RFID asset and vehicle tags, PureRF readers, PureRF activators, and PureRF initializers. It also provides house arrest monitoring systems, PureTag RF bracelets, PureCom RF base stations, GPS offender tracking systems, PureTrack smartphone device, PureBeacon, PureMonitor offender electronic monitoring software, inmate monitoring systems, DoorGuard tracking station, and personnel tags. In addition, the company offers domestic violence victim protection systems. Further, it provides connectivity products and solutions comprising AVIDITY WBSac, BOLSTER WBSn, BreezeULTRA P6000, Arena controller, and BreezeNET B. Additionally, the company offers Safend's Encryption Suite that protects the organization's sensitive data; and designs solutions for carrier Wi-Fi, enterprise connectivity, smart city, smart hospitality, connected campuses, and connected events. SuperCom Ltd. sells its systems and products through local representatives, subsidiaries, and distribution channels, as well as independent representatives and resellers. The company was formerly known as Vuance Ltd. and changed its name to SuperCom Ltd. in January 2013. SuperCom Ltd. was founded in 1988 and is based in Tel Aviv-Yafo, Israel.",
    "website": "http://www.supercom.com",
    "zipcode": "6713412"
  },
  "SPEN.TA": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Engineering & Construction",
    "long_name": "Shapir Engineering and Industry Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "SHAPIR ENGINEERING",
    "state": null,
    "summary": "Shapir Engineering and Industry Ltd engages in the infrastructure, concessions, quarry materials, real estate development and construction businesses in Israel. It constructs bridges, interchanges, commercial public projects, and apartment buildings, as well as undertakes road paving and marine works; and designs, constructs, maintains, and operates large-scale projects in cooperation with the private and public sectors. The company also manufactures quarry materials, ready-mix concrete and building finishing products, prefabricated elements from prestressed and precast concrete, and hot mix asphalt for paving roadways. In addition, it is involved in the development and construction of apartment buildings. The company was formerly known as Shapir Bareket Holdings Ltd. and changed its name to Shapir Engineering and Industry Ltd in September 2014. Shapir Engineering and Industry Ltd was founded in 1968 and is based in Petach Tikva, Israel.",
    "website": "http://www.shapir.co.il",
    "zipcode": "4951780"
  },
  "SPUP": {
    "city": "Jerusalem",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Conglomerates",
    "long_name": "Sipup Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SIPUP CORP",
    "state": null,
    "summary": "Sipup Corporation focuses on producing, packing, and selling flavored yogurts. The company was incorporated in 2012 and is based in Jerusalem, Israel.",
    "website": null,
    "zipcode": "9777603"
  },
  "SRRPF": {
    "city": "Holon",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Specialty Business Services",
    "long_name": "Shagrir Group Vehicle Services Ltd",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "SHAGRIR GROUP VEHICLE SERVICES ",
    "state": null,
    "summary": "Shagrir Group Vehicle Services Ltd provides roadside towing, rescue, and assistance services in Israel. The company offers various services, such as assistance in starting the vehicle, repairing, wheel replacement, fuel supply, and light bulb replacement services, as well as other services that consist of water damage, plumbing, bodywork, and paint services. It provides services to insurance companies, insurance agents, and general public. The company operates eight service centers. Shagrir Group Vehicle Services Ltd was founded in 1984 and is based in Holon, Israel.",
    "website": "http://www.shagrir.co.il",
    "zipcode": "5811701"
  },
  "TATT": {
    "city": "Gedera",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NGM",
    "industry": "Aerospace & Defense",
    "long_name": "TAT Technologies Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "TAT Technologies Ltd.",
    "state": null,
    "summary": "TAT Technologies Ltd., together with its subsidiaries, provides solutions and services to the commercial and military aerospace, and ground defense industries in the United States, Israel, and internationally. The company operates through four segments: Original Equipment Manufacturing (OEM) of Heat Transfer Solutions and Aviation Accessories; Maintenance, Repair, and Overhaul (MRO) Services for Heat Transfer Components and OEM of Heat Transfer Solutions; MRO Services for Aviation Components; and Overhaul and Coating of Jet Engine Components. It designs, develops, and manufactures a range of heat transfer solutions, such as pre-cooler and oil/fuel hydraulic heat exchangers used in mechanical and electronic systems in commercial, military, and business aircraft; environmental control and power electronics cooling systems for use in aircraft and ground applications; and a range of other mechanical aircraft accessories and systems, such as pumps, valves, and turbine power units. The company also provides MRO services for heat transfer components, as well as for manufacturing heat transfer solutions; and aviation components, such as power plants, landing gears, and other aircraft components. In addition, it engages in the operation of a repair station, which provides heat transfer MRO services for airlines, air cargo carriers, maintenance service centers, and the military; and the overhaul and coating of jet engine components, including turbine vanes and blades, fan blades, variable inlet guide vanes, and afterburner flaps. The company was formerly known as Galagraph Ltd. and changed its name to TAT Technologies Ltd. in May 1992. TAT Technologies Ltd. was founded in 1969 and is headquartered in Gedera, Israel.",
    "website": "http://tat-technologies.com",
    "zipcode": "70750002"
  },
  "TATT.TA": {
    "city": "Gedera",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Aerospace & Defense",
    "long_name": "TAT Technologies Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "TAT TECHNOLOGIES",
    "state": null,
    "summary": "TAT Technologies Ltd., together with its subsidiaries, provides solutions and services to the commercial and military aerospace, and ground defense industries in the United States, Israel, and internationally. The company operates through four segments: Original Equipment Manufacturing (OEM) of Heat Transfer Solutions and Aviation Accessories; Maintenance, Repair, and Overhaul (MRO) Services for Heat Transfer Components and OEM of Heat Transfer Solutions; MRO Services for Aviation Components; and Overhaul and Coating of Jet Engine Components. It designs, develops, and manufactures a range of heat transfer solutions, such as pre-cooler and oil/fuel hydraulic heat exchangers used in mechanical and electronic systems in commercial, military, and business aircraft; environmental control and power electronics cooling systems for use in aircraft and ground applications; and a range of other mechanical aircraft accessories and systems, such as pumps, valves, and turbine power units. The company also provides MRO services for heat transfer components, as well as for manufacturing heat transfer solutions; and aviation components, such as power plants, landing gears, and other aircraft components. In addition, it engages in the operation of a repair station, which provides heat transfer MRO services for airlines, air cargo carriers, maintenance service centers, and the military; and the overhaul and coating of jet engine components, including turbine vanes and blades, fan blades, variable inlet guide vanes, and afterburner flaps. The company was formerly known as Galagraph Ltd. and changed its name to TAT Technologies Ltd. in May 1992. TAT Technologies Ltd. was founded in 1969 and is headquartered in Gedera, Israel.",
    "website": "http://tat-technologies.com",
    "zipcode": "70750002"
  },
  "USDR": {
    "city": "Tirat Carmel",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Aerospace & Defense",
    "long_name": "UAS Drone Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "UAS DRONE CORP",
    "state": null,
    "summary": "UAS Drone Corp. operates as a robotics company. The company engages in the development of an advanced robotics system that enables remote, real-time, pinpoint accurate firing of small arms and light weapons. Its products include UAS octocopters integrated with six degrees of freedom robotic gimbal for military and homeland security purposes. The company was founded in 2014 and is headquartered in Tirat Carmel, Israel.",
    "website": "http://dukeroboticsys.com",
    "zipcode": "3903212"
  },
  "VISN.TA": {
    "city": "Herzliya",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Conglomerates",
    "long_name": "Vision Sigma Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "VISION SIGMA",
    "state": null,
    "summary": "Vision Sigma Ltd. engages in the investments management and real estate activities in Israel and internationally. It operates through Income-generating Real Estate and Financial Investments segments. The company rents offices and commercial spaces. It is also involved in the generic investment operations; and cash balance management, as well as initiation and management of funds in financial markets. The company was formerly known as Atmor Industries (1973) Ltd. and changed its name to Vision Sigma Ltd. in January 2003. The company was founded in 1973 and is headquartered in Herzliya, Israel. Vision Sigma Ltd. is a subsidiary of Perelson Holdings Ltd.",
    "website": null,
    "zipcode": "46722"
  },
  "YAAC.TA": {
    "city": "Beersheba",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Engineering & Construction",
    "long_name": "Ya'acobi Brothers Group (YSB) Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "YAACOBI BROTHERS",
    "state": null,
    "summary": "Ya'acobi Brothers Group (YSB) Ltd, through its subsidiaries, operates in construction, infrastructure, and entrepreneurship sectors in Israel and internationally. It undertakes projects in the areas of electricity and communication infrastructure, electromechanical infrastructure and system, railway infrastructure, traffic management and control, parking systems and solutions, control and security, highway and road infrastructure; smart lighting; stadiums and recreational sites; and smart city solutions, as well as entrepreneurship, BOT, PPP, and national projects. The company also provides infrastructure detection and water loss management, waste management, and recycling solutions; and facility management services. Its clients include public and governmental organizations, including the Ministry of Defense, national roads companies, municipalities, and local authorities, as well as private companies. The company was founded in 1974 and is based in Be'er Sheva, Israel.",
    "website": "http://www.ysbgroup.com",
    "zipcode": "8487124"
  },
  "ZIM": {
    "city": "Haifa",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Marine Shipping",
    "long_name": "ZIM Integrated Shipping Services Ltd.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "ZIM Integrated Shipping Service",
    "state": null,
    "summary": "ZIM Integrated Shipping Services Ltd., together with its subsidiaries, provides container shipping and related services in Israel and internationally. The company offers dry, reefer, project, out of gauge, breakbulk, and dangerous cargo services; inland transport services; and ZIMonitor, a reefer cargo tracking service. As of December 31, 2020, it operated a fleet of 87 vessels. ZIM Integrated Shipping Services Ltd. was incorporated in 1945 and is headquartered in Haifa, Israel.",
    "website": "http://www.zim.com",
    "zipcode": "3190500"
  }
}
