{
    "ASHO.TA": {
        "short_name": "ASHOT ASHKELON",
        "long_name": "Ashot Ashkelon Industries Ltd.",
        "summary": "Ashot Ashkelon Industries Ltd. develops, manufactures, assembles, and supplies systems and components for the aerospace, defense, automotive, and other industries in Israel and internationally. It offers aerospace products, such as long and short shafts for turbofan and turboprop jet engines; high lift system components, including universal joints, transmissions and gearboxes, shafts, and extension joints; landing gears components; electromechanical assemblies for aircraft; gearboxes, transmissions, and gear-based products; and tungsten weights. The company also provides automatic transmissions, final drives, transfer boxes, drop boxes, PTO's, and a range of gear based assemblies and shafts for main battle tanks; and off-road vehicle products comprising automatic transmissions, hydraulic and mechanical power take off units, transmission range shafts, planetary systems, clutch independent drives, mass transit gearboxes, drive axles, final drives, oil pumps, reduction and transfer boxes, and gear assemblies. In addition, it offers tungsten-based heavy metal products for applications in aircraft and instrument balance weights, helicopter rotor dampers, aircraft and land-based gyro components, airborne antenna bases, propeller and blade balancing, X-ray and radiation therapy shields, industrial shields for irradiation systems, armor piercing penetrators, fragmentation parts, radar balancing, tool holders, and oil and gas liners. The company is based in Ashkelon, Israel. Ashot Ashkelon Industries Ltd. is a subsidiary of Israel Military Industries Ltd.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Ashkelon"
    },
    "BSEN.TA": {
        "short_name": "BET SHEMESH ENGINE",
        "long_name": "Bet Shemesh Engines Holdings (1997) Ltd",
        "summary": "Bet Shemesh Engines Holdings (1997) Ltd designs, develops, manufactures, and sells engine parts for the aerospace industry. The company offers jet engine parts, including compressors, turbine disks and blisks, frames, cases, air seals, spacers, and turbine nozzels and blades; sheet metals and combustion chambers; and augmentor seals, flaps, and flame holders. It also provides torque frames, discs, gears, rotating seals, bearing housings, cases, rings, rotors, flanges, hubs, impellers, and stub shafts; and air foils and structural parts. In addition, the company offers repair, overhaul, and engineering services, as well as field services, such as troubleshooting, HSI on-wing, etc. Further, it designs, develops, customizes, manufactures, and sells gas turbine engines, modules, and parts; and maintenance, repair, and overhaul services for civil and military applications. The company was founded in 1997 and is based in Bet Shemesh, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Bet Shemesh"
    },
    "EB2.F": {
        "short_name": "ELBIT SYS LTD",
        "long_name": "Elbit Systems Ltd.",
        "summary": "Elbit Systems Ltd. develops and supplies a range of airborne, land, and naval systems and products for defense, homeland security, and commercial aviation applications. The company offers military aircraft and helicopter systems; commercial aviation systems and aero structures; unmanned aircraft systems and unmanned surface vessels; electro-optic and countermeasures systems; land vehicle systems; munitions; command, control, communications, computer, intelligence, surveillance, and reconnaissance and cyber systems; electronic warfare and signal intelligence systems; and commercial cyber protection products. It also provides medical diagnostic equipment, automotive night vision enhancement equipment, and smart glasses for sports applications; and super capacitor energy sources and fuel cells for transportation applications, as well as a range of support services, including training and simulation systems. The company markets its systems and products as a prime contractor or subcontractor to various governments and companies. It has operations in Israel, North America, Europe, the Asia-Pacific, Latin America, and internationally. Elbit Systems Ltd. was founded in 1966 and is based in Haifa, Israel.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Haifa"
    },
    "ESLT": {
        "short_name": "Elbit Systems Ltd.",
        "long_name": "Elbit Systems Ltd.",
        "summary": "Elbit Systems Ltd. develops and supplies a range of airborne, land, and naval systems and products for defense, homeland security, and commercial aviation applications. The company offers military aircraft and helicopter systems; commercial aviation systems and aero structures; unmanned aircraft systems and unmanned surface vessels; electro-optic and countermeasures systems; land vehicle systems; munitions; command, control, communications, computer, intelligence, surveillance, and reconnaissance and cyber systems; electronic warfare and signal intelligence systems; and commercial cyber protection products. It also provides medical diagnostic equipment, automotive night vision enhancement equipment, and smart glasses for sports applications; and super capacitor energy sources and fuel cells for transportation applications, as well as a range of support services, including training and simulation systems. The company markets its systems and products as a prime contractor or subcontractor to various governments and companies. It has operations in Israel, North America, Europe, the Asia-Pacific, Latin America, and internationally. Elbit Systems Ltd. was founded in 1966 and is based in Haifa, Israel.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Haifa"
    },
    "ESLT.TA": {
        "short_name": "ELBIT SYSTEMS LTD",
        "long_name": "Elbit Systems Ltd.",
        "summary": "Elbit Systems Ltd. develops and supplies a range of airborne, land, and naval systems and products for defense, homeland security, and commercial aviation applications. The company offers military aircraft and helicopter systems; commercial aviation systems and aero structures; unmanned aircraft systems and unmanned surface vessels; electro-optic and countermeasures systems; land vehicle systems; munitions; command, control, communications, computer, intelligence, surveillance, and reconnaissance and cyber systems; electronic warfare and signal intelligence systems; and commercial cyber protection products. It also provides medical diagnostic equipment, automotive night vision enhancement equipment, and smart glasses for sports applications; and super capacitor energy sources and fuel cells for transportation applications, as well as a range of support services, including training and simulation systems. The company markets its systems and products as a prime contractor or subcontractor to various governments and companies. It has operations in Israel, North America, Europe, the Asia-Pacific, Latin America, and internationally. Elbit Systems Ltd. was founded in 1966 and is based in Haifa, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Haifa"
    },
    "FBRT.TA": {
        "short_name": "FMS ENTERPR. MIGUN",
        "long_name": "FMS Enterprises Migun Ltd.",
        "summary": "FMS Enterprises Migun Ltd. manufactures and sells ballistic protection raw materials and products worldwide. It provides uni-directional (UD) polyethylene and aramid fabrics; pressed panels made of UD fabrics; military and civilian vehicles; composite armor kits; hard and soft armors; boat armor; and ballistic shields. The company offers its products for various applications, such as personal ballistic protection, vehicle armoring, ship armoring, and aircraft armoring applications. FMS Enterprises Migun Ltd. was founded in 1986 and is based in Petah Tikva, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Petah Tikva"
    },
    "GKL.TA": {
        "short_name": "GLOBAL KNAFAIM",
        "long_name": "Global Knafaim Leasing Ltd",
        "summary": "Global Knafaim Leasing Ltd acquires, leases, and trades used commercial aircraft. It offers its products to airlines, leasing companies, and financiers in North and South America, Europe, Asia, Australia, and South Africa. The company was incorporated in 2002 and is based in Ramat Gan, Israel. Global Knafaim Leasing Ltd is a subsidiary of Knafaim Holdings Ltd.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Ramat Gan"
    },
    "IMCO.TA": {
        "short_name": "IMCO INDUSTRIES",
        "long_name": "IMCO Industries Ltd.",
        "summary": "IMCO Industries Ltd. designs, develops, manufactures, and sells electrical and electronics, and electro-mechanical systems for military applications in Israel. The company offers land solutions, such as high-definition multi-function display for ground applications, operational electrical and power distribution boxes, smoke grenade launchers, control harnesses, electro-mechanic and video switches, internal and external LED lightings, slip rings, and fuel feeler gauges, as well as CNC metalworking and assembly manual work solutions. It also provides air solutions, including glass cockpit for foreign army, large area display for glass cockpit, IAI blackhawk demonstrator helicopters, multi-function display for avionic radar and EW systems, and harnesses, as well as hands-on throttle and stick products, such as throttle and joystick. In addition, the company provides naval solutions, such as computer units for stabilized cannon, naval multi-function displays and recorders, harnesses for stabilized cannon, fire control system display screens, and video recording and distribution systems, as well as renovation of submarine stick wheel. Further, it offers medical / civil solutions, including aesthetics devices, such as laser hair removal, full body contouring, facial aesthetics RF, and laser devices, as well as laser device handles. IMCO Industries Ltd. was founded in 1974 and is based in Nesher, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Nesher"
    },
    "ISHI.TA": {
        "short_name": "ISRAEL SHIPYARDS",
        "long_name": "Israel Shipyards Industries Ltd",
        "summary": "Israel Shipyards Industries Ltd designs and constructs military and civilian vessels. It also operates and manages cargo ships; and provides vessel repair services. In addition, it is involved in the operation of a port, as well as provision of port services. The company was incorporated in 2019 and is based in Haifa, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Haifa"
    },
    "RADA": {
        "short_name": "RADA Electronic Industries Ltd.",
        "long_name": "RADA Electronic Industries Ltd.",
        "summary": "RADA Electronic Industries Ltd. develops, manufactures, markets, and sells defense electronics to various air forces and companies worldwide. It offers military avionic systems, including flight data recorders for fighter aircraft; digital video/audio/data recorders; high definition digital video/audio/data recording for fighter and trainer aircrafts; a range of head-up-displays color video cameras for fighter aircraft; and various ground debriefing solutions. The company also provides avionics solutions, such as mission data recorders and debriefing solutions and HUD video cameras; avionics for unmanned aircraft vehicles (UAVs) comprising interface control processors, engine control computers, payload management computers, and others; and compact MEMS-based multiple-sensor aided inertial navigation systems (INS) for UAVs and backup INS for manned aircraft. In addition, it offers land-based tactical radars for defense forces and critical infrastructure protection solutions. The company has strategic relationships with Embraer S.A., Hindustan Aeronautics Ltd., Israel Aerospace Industries Ltd., Lockheed Martin Corporation, Rafael Advanced Defense Systems Ltd., Elbit Systems Ltd., Leonardo DRS, Ascent Vision Technologies, and Boeing Defense, Space & Security. RADA Electronic Industries Ltd. was founded in 1970 and is headquartered in Netanya, Israel.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Netanya"
    },
    "RDF1.F": {
        "short_name": "RADA EL.  DL-,03",
        "long_name": "RADA Electronic Industries Ltd.",
        "summary": "RADA Electronic Industries Ltd. develops, manufactures, markets, and sells defense electronics to various air forces and companies worldwide. It offers military avionic systems, including flight data recorders for fighter aircraft; digital video/audio/data recorders; high definition digital video/audio/data recording for fighter and trainer aircrafts; a range of head-up-displays color video cameras for fighter aircraft; and various ground debriefing solutions. The company also provides avionics solutions, such as mission data recorders and debriefing solutions and HUD video cameras; avionics for unmanned aircraft vehicles (UAVs) comprising interface control processors, engine control computers, payload management computers, and others; and compact MEMS-based multiple-sensor aided inertial navigation systems (INS) for UAVs and backup INS for manned aircraft. In addition, it offers land-based tactical radars for defense forces and critical infrastructure protection solutions. The company has strategic relationships with Embraer S.A., Hindustan Aeronautics Ltd., Israel Aerospace Industries Ltd., Lockheed Martin Corporation, Rafael Advanced Defense Systems Ltd., Elbit Systems Ltd., Leonardo DRS, Ascent Vision Technologies, and Boeing Defense, Space & Security. RADA Electronic Industries Ltd. was founded in 1970 and is headquartered in Netanya, Israel.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Netanya"
    },
    "RSEL.TA": {
        "short_name": "R.S.L.ELECTRONICS",
        "long_name": "RSL Electronics Ltd.",
        "summary": "RSL Electronics Ltd. engages in the development, manufacture, and sale of control, utilities, and diagnostics and prognostics systems for aerospace, energy, and defense sectors in Israel and internationally. It provides diagnostic engine starting system controllers, digital temperature control amplifiers, break control systems, digital generator control units, diagnostic fuel management controllers, fuel system controllers, and primary power distribution control systems. The company also offers total health and usage management system for helicopters and UAVs; and CMS for wind turbines, hydro-electric turbines, and steam turbines, as well as for trains and railway tracks. In addition, it provides muzzle velocity radar systems to measure the velocity of a range of ammunition for field artillery, mortars, naval guns, and anti-aircraft guns. RSL Electronics Ltd. is based in Migdal Ha'Emek, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Migdal Ha'Emek"
    },
    "TATT": {
        "short_name": "TAT Technologies Ltd.",
        "long_name": "TAT Technologies Ltd.",
        "summary": "TAT Technologies Ltd., together with its subsidiaries, provides solutions and services to the commercial and military aerospace, and ground defense industries in the United States, Israel, and internationally. The company operates through four segments: Original Equipment Manufacturing (OEM) of Heat Transfer Solutions and Aviation Accessories; Maintenance, Repair, and Overhaul (MRO) Services for Heat Transfer Components and OEM of Heat Transfer Solutions; MRO Services for Aviation Components; and Overhaul and Coating of Jet Engine Components. It designs, develops, and manufactures a range of heat transfer solutions, such as pre-cooler and oil/fuel hydraulic heat exchangers used in mechanical and electronic systems in commercial, military, and business aircraft; environmental control and power electronics cooling systems for use in aircraft and ground applications; and a range of other mechanical aircraft accessories and systems, such as pumps, valves, and turbine power units. The company also provides MRO services for heat transfer components, as well as for manufacturing heat transfer solutions; and aviation components, such as power plants, landing gears, and other aircraft components. In addition, it engages in the operation of a repair station, which provides heat transfer MRO services for airlines, air cargo carriers, maintenance service centers, and the military; and the overhaul and coating of jet engine components, including turbine vanes and blades, fan blades, variable inlet guide vanes, and afterburner flaps. The company was formerly known as Galagraph Ltd. and changed its name to TAT Technologies Ltd. in May 1992. TAT Technologies Ltd. was founded in 1985 and is headquartered in Gedera, Israel.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Israel",
        "city": "Gedera"
    },
    "USDR": {
        "short_name": "UAS DRONE CORP",
        "long_name": "UAS Drone Corp.",
        "summary": "UAS Drone Corp., through its subsidiary, Duke Robotics, Inc., operates as a robotics company. The company engages in the development of an advanced robotics system that enables remote, real-time, pinpoint accurate firing of small arms and light weapons. Its products include UAS octocopters integrated with six degrees of freedom robotic gimbal for military and homeland security purposes. The company was founded in 2014 and is headquartered in Tirat Carmel, Israel.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Tirat Carmel"
    }
}