{
    "AMAN.TA": {
        "short_name": "AMANET MANAGEMENT",
        "long_name": "Amanet Management & Systems Ltd.",
        "summary": "Amanet Management & Systems Ltd., through its subsidiaries, provides consulting, project management, and logistics services in Israel and internationally. It offers management services; consulting and operating services for industrial engineering and management projects; organizational development services; coordination and management services for construction engineering projects; project administration operating services for special issues; and outsourcing services for logistics and administration systems. The company also provides system characterization and software development; data systems implementation; professional; IT consultancy; and quality control and software testing services, as well as implementation training services and assimilation of data systems in organizations. It serves customers in various segments, including industry, defense/military, government, public institutions, commerce and services, construction, business, and others. The company was founded in 1970 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6971050",
        "website": "http://www.amanet.co.il",
        "market_cap": 128337648
    },
    "ARAN.TA": {
        "short_name": "ARAN RESEARCH&DEVE",
        "long_name": "Aran Research & Development (1982) Ltd.",
        "summary": "Aran Research & Development (1982) Ltd. engages in the product design and development, and equipment manufacturing businesses for plastics industry in Israel. The company develops various medical devices, such as cardiovascular devices, in-vitro diagnostics, surgical instruments, medical robots, and other products; and water devices and fluid management systems, including pressure and flow regulators, electric and hydraulic valves, air release valves, sprinklers, drippers, taps, water meters, filters, check valves, electronic controllers, and testing devices. It also provides portable and stationary control stations for unmanned systems; electro-optics; rugged electronics for ground, marine, and aerial platforms operating in harsh environments; ground systems for access control and security forces; test equipment; production line facilities; measurement and weighing devices; specialty printers; automatic beverage machines; computerized shopping carts and self-checkout kiosk; industrial and communication devices; and batteries. In addition, the company supplies machines and equipment, such as injection molding machines, robotics and automation, injection molds, hot runners systems, drying dosing and conveying systems, plasticizing screws barrels, ultrasonic welding and cleaning, and raw materials; and support services, as well as invests in medical startups. Aran Research & Development (1982) Ltd. was founded in 1982 and is based in Caesarea, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Caesarea",
        "zipcode": "3088900",
        "website": "http://www.aran-rd.com",
        "market_cap": 92337840
    },
    "CDEV.TA": {
        "short_name": "COHEN DEV&IND BLDG",
        "long_name": "Cohen Development Gas & Oil Ltd",
        "summary": "Cohen Development Gas & Oil Ltd engages in the natural oil and gas business. It holds interests in the Ashkelon, Noa, Tamar, Dalit, North Whale, South Whale, Block 12, Shark, Crocdilem Olshas/367, New Horizon/ 405, and New Yahel/406 licenses. Cohen Development Gas & Oil Ltd was founded in 1958 and is based in Herzliya, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Herzliya",
        "zipcode": null,
        "website": null,
        "market_cap": 434106592
    },
    "ELCO.TA": {
        "short_name": "ELCO LTD",
        "long_name": "Elco Ltd.",
        "summary": "Elco Ltd., together with its subsidiaries, operates in the construction, infrastructure, consumer electronics, telecommunications, entertainment, and real estate sectors in Israel and internationally. It operates through four segments: Electra, Electra Consumer Products, Electra Real Estate, and Supergaz Energy. The company is involved in the general contracting of building and infrastructure; mechanical engineering, real estate development, and concessions and facility management activities; import, retail, and marketing of air conditioning, telecommunication, and electronic home appliances; acquisition, management, and enhancement of multi-family properties; and content and distribution, leisure, and cinema businesses. It also markets, supplies, and distributes LPG, natural gas, and CNG to private households, as well as industrial, commercial, and transportation sectors. Elco Ltd. was founded in 1949 and is based in Tel Aviv-Yafo, Israel. Elco Ltd. is a subsidiary of G. Salkind Ltd.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "978914",
        "website": "http://www.elco.co.il",
        "market_cap": 4811118592
    },
    "ELRN.TA": {
        "short_name": "ELRON ELECTRONIC",
        "long_name": "Elron Electronic Industries Ltd.",
        "summary": "Elron Electronic Industries Ltd., through its subsidiaries, provides technology products in the medical devices and cyber fields. The company offers BrainsGate, a minimally invasive treatment for ischemic stroke; Pocared, an automated microbiology lab system for infectious diseases diagnosis; CartiHeal implants for cartilage and bone repair in weight bearing joints; Coramaze, a transfemoral mitral valve repair system with atraumatic anchoring; Notal Vision, a remote monitoring of patients at risk of vision loss from age-related macular degeneration; cyber intelligence platform that detects and defuses threats before they become cyberattacks; Alcide, a dev-to-production security tool for workloads running on kubernetes platforms; and SecuredTouch a behavioral biometrics for mobile transactions. It also provides Ironscales, an automated phishing prevention, detection, and response platform; Cynerio, a connected medical device; Kindite, a cloud encryption solution; KZen, a non-custodial digital currency wallet; Naval Dome, a maritime cyber detection and prevention system; Sayata Labs, an AI-based cyber risk assessment solution; OpenLegacy, a platform that enables the digital transformation process; OzCode, which provides root cause analysis, collaboration, and real-time bug triage solutions; PLYmedia, a platform for ad networks; Audioburst, an AI-powered audio search platform; Aqwise, a biological water and wastewater treatment solutions for the industrial and municipal markets; Atlantium, a water disinfection solution; SECDO, a platform that automatically detects suspicious activity, while accelerating incident investigation and response; Kyma, a remote patient monitoring device; and Jordan Valley, an X-ray based metrology solutions for semiconductors process control. In addition, the company offers Cloudyn, Given Imaging, Sync-Rx, Wavion, Safend, Medingo, Teledata, and 3DV Systems. Elron Electronic Industries Ltd. was founded in 1961 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6702301",
        "website": "http://www.elron.com",
        "market_cap": 627204480
    },
    "ELRNF": {
        "short_name": "ELRON ELECTRONIC INDUSTRIES",
        "long_name": "Elron Electronic Industries Ltd.",
        "summary": "Elron Electronic Industries Ltd., through its subsidiaries, provides technology products in the medical devices and cyber fields. The company offers BrainsGate, a minimally invasive treatment for ischemic stroke; Pocared, an automated microbiology lab system for infectious diseases diagnosis; CartiHeal implants for cartilage and bone repair in weight bearing joints; Coramaze, a transfemoral mitral valve repair system with atraumatic anchoring; Notal Vision, a remote monitoring of patients at risk of vision loss from age-related macular degeneration; cyber intelligence platform that detects and defuses threats before they become cyberattacks; Alcide, a dev-to-production security tool for workloads running on kubernetes platforms; and SecuredTouch a behavioral biometrics for mobile transactions. It also provides Ironscales, an automated phishing prevention, detection, and response platform; Cynerio, a connected medical device; Kindite, a cloud encryption solution; KZen, a non-custodial digital currency wallet; Naval Dome, a maritime cyber detection and prevention system; Sayata Labs, an AI-based cyber risk assessment solution; OpenLegacy, a platform that enables the digital transformation process; OzCode, which provides root cause analysis, collaboration, and real-time bug triage solutions; PLYmedia, a platform for ad networks; Audioburst, an AI-powered audio search platform; Aqwise, a biological water and wastewater treatment solutions for the industrial and municipal markets; Atlantium, a water disinfection solution; SECDO, a platform that automatically detects suspicious activity, while accelerating incident investigation and response; Kyma, a remote patient monitoring device; and Jordan Valley, an X-ray based metrology solutions for semiconductors process control. In addition, the company offers Cloudyn, Given Imaging, Sync-Rx, Wavion, Safend, Medingo, Teledata, and 3DV Systems. Elron Electronic Industries Ltd. was founded in 1961 and is based in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6702301",
        "website": "http://www.elron.com",
        "market_cap": 216702560
    },
    "EQTL.TA": {
        "short_name": "EQUITAL",
        "long_name": "Equital Ltd.",
        "summary": "Equital Ltd., through its subsidiaries, engages in the real estate, oil and gas, and residential construction businesses in Israel, the United States, and Europe. It is involved in the planning, developing, setting up, rental, and management of rental assets; and planning, developing, building, leasing, marketing, and sale of residential projects. It rents and manages transportation complexes, commercial areas, office buildings, industrial and storage buildings, parking lots, gas stations, and land for commercial tenants, transportation companies, and industrial and corporate clients. In addition, the company engages in the exploration, production, operation, management, and sale of oil, natural gas, and condensate for industrial customers and private electricity clients, and oil and natural distribution companies. Further, it manages and operates hotels. The company was incorporated in 1977 and is based in Petah Tikva, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": "49002",
        "website": null,
        "market_cap": 3204721152
    },
    "GAON.TA": {
        "short_name": "B GAON HOLDINGS LT",
        "long_name": "B. Gaon Holdings Ltd.",
        "summary": "B. Gaon Holdings Ltd. provides solutions for water and gas distribution, sewage treatment, desalination, and fire protection markets worldwide. The company operates through four divisions: Infrastructure, M.E.P Systems, Metering & Control, and Projects. It focuses on the development, production, and marketing of pipes, valves, hydrants, and accessories. The company offers steel and plastic pipes, various valves, and other accessories used in the infrastructure and industrial sectors; and residential plumbing pipes, air conditioning units, fire hydrants, valves for fire extinguishing systems, profiles, ducts, and others. It also manufactures and markets water measurement, control, and monitoring systems, as well as water meters. The company was founded in 1998 and is based in Or Yehuda, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Or Yehuda",
        "zipcode": "6039730",
        "website": "http://www.gaon.com",
        "market_cap": 177982208
    },
    "INTR.TA": {
        "short_name": "INTERGAMA",
        "long_name": "Inter Gamma Investment Company Ltd",
        "summary": "Inter-Gamma Investment Company Ltd., through its subsidiaries, operates in the fuel management and fuel stations infrastructure, public transportation payment systems, imaging, and real-estate sectors worldwide. It operates through three divisions: Technologies, Real Estate, and Imaging. The Technologies division develops, manufactures, and markets automated car refueling, automated fuel stations management, and car fleets management systems, including automation, c-store, RFID vehicle identification, and fuel and fleet management systems for retail gas stations and commercial fleets, as well as on board management systems for public transportation. The Real Estate division owns and operates office spaces and service areas in industrial zones. The Imaging division distributes consumer imaging, professional imaging, and raw materials for electronic imaging equipment, as well as consumables. Inter-Gamma Investment Company Ltd. was founded in 1965 and is based in Herzliya, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Herzliya",
        "zipcode": null,
        "website": "http://www.intergamma.co.il",
        "market_cap": 158571840
    },
    "SHOM.TA": {
        "short_name": "SHOHAM BUSINESS",
        "long_name": "E.N. Shoham Business Ltd",
        "summary": "E.N. Shoham Business Ltd operates as an investment arm of Rubicon Business Group Ltd. It specializes in investments in the industry, retail, and real estate sectors. The firm seeks to invest in Israel and abroad. Isal Amlat was founded in 1987 and is based in Herzliya Pituach, Israel. E.N.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ramat Gan",
        "zipcode": null,
        "website": "http://www.shohambiz.com",
        "market_cap": 312516928
    },
    "SPUP": {
        "short_name": "SIPUP CORP",
        "long_name": "Sipup Corporation",
        "summary": "Sipup Corporation focuses on producing, packing, and selling flavored yogurts. The company was incorporated in 2012 and is based in Jerusalem, Israel.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Jerusalem",
        "zipcode": "9777603",
        "website": null,
        "market_cap": 13707485
    },
    "VISN.TA": {
        "short_name": "VISION SIGMA",
        "long_name": "Vision Sigma Ltd.",
        "summary": "Vision Sigma Ltd. engages in the investments management and real estate activities in Israel and internationally. It operates through Income-generating Real Estate and Financial Investments segments. The company rents offices and commercial spaces. It is also involved in the generic investment operations; and cash balance management, as well as initiation and management of funds in financial markets. The company was formerly known as Atmor Industries (1973) Ltd. and changed its name to Vision Sigma Ltd. in January 2003. The company was founded in 1973 and is headquartered in Herzliya, Israel. Vision Sigma Ltd. is a subsidiary of Perelson Holdings Ltd.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Herzliya",
        "zipcode": "46722",
        "website": null,
        "market_cap": 75599072
    }
}