{
    "ARAD.TA": {
        "short_name": "ARAD INVESTMENT &",
        "long_name": "Arad Investment & Industrial Development Ltd.",
        "summary": "Arad Investment & Industrial Development Ltd., through its subsidiaries, operates in the real estate, technology, software, outsourcing, human resources, and other sectors. The company engages in planning, construction, and management of industrial buildings, parks for knowledge-intensive industries, and commercial centers; sale of apartments; improvement and sale of land owned for residential buildings; and development of various construction projects. It also offers computing systems consulting, planning, integration, training, implementation, and maintenance services; support and other professional services for computing systems; data processing and communication services; software development services; and infrastructure software, as well as markets hardware products. In addition, the company provides outsourcing services; maintenance services for communication systems; and human resource and wage services. Further, it sells communications equipment; and produces and sells pot blocks. Arad Investment & Industrial Development Ltd. is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6581603",
        "website": null,
        "market_cap": "Mid Cap"
    },
    "ELSPC.TA": {
        "short_name": "ELSPEC ENGINEERING",
        "long_name": "Elspec Engineering Ltd",
        "summary": "Elspec Engineering Ltd develops, manufactures, and markets power quality solutions and services to the industrial, commercial, and utility sectors worldwide. The company offers metering and protection products, such as multi-functional digital fault recorders; and hand-held, portable, and fixed power quality analyzers. It also provides PQSCADA Sapphire, an open programmable platform that offers functionality and performance for data exploration, analysis, and visualization; and power factor solutions. The company was founded in 1988 and is headquartered in Caesarea, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Caesarea",
        "zipcode": null,
        "website": "http://www.elspec-ltd.com",
        "market_cap": "Small Cap"
    },
    "MNGN.TA": {
        "short_name": "MIN HAGOREN DEV",
        "long_name": "Min Hagoren Development Ltd.",
        "summary": "Min Hagoren Development Ltd., a power system company, develops, manufactures, constructs, markets, and sells uninterruptible power supply (UPS) power units in Israel. Its products include UPS systems consisting of battery cabinet, control and management, industrial, and modular online three phase UPS systems, as well as UPS repair services; and power supply units, such as HPS power supplies, telecom power supply units, DC to AC inverters, and converters. The company also provides three phase transformers; and automatic voltage stabilizers comprising static voltage regulators to protect electrical equipment from mains power surges and brown-outs; GSTS and STSW static switches; GTSI industrial UPS and inverters; and emergency lighting systems. In addition, it offers modular DC to DC, and modular AC to DC converters. It also exports its products to approximately 80 countries. Min Hagoren Development Ltd. was founded in 1970 and is headquartered in Jerusalem, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Jerusalem",
        "zipcode": "9777517",
        "website": "http://gorendev.co.il",
        "market_cap": "Small Cap"
    },
    "PAYT.TA": {
        "short_name": "PAYTON INDUSTRIES",
        "long_name": "Payton Industries Ltd.",
        "summary": "Payton Industries Ltd. develops, manufactures, and sells transformers for the telecommunications, industry and military, and medical companies in Israel, the United States, and East Asia. It offers high frequency, current, network, single-phase, three-phase, and planar transformers; and coils, chokes, chargers, adapters, power supplies, and lighting blasts, as well as repair and electronic assembly services. Payton Industries Ltd. was founded in 1987 and is based in Nes Ziona, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ness Ziona",
        "zipcode": "7403128",
        "website": "http://www.payton.co.il",
        "market_cap": "Small Cap"
    }
}