{
    "AVIV.TA": {
        "short_name": "MORDECHAI AVIV",
        "long_name": "Mordechai Aviv Taasiot Beniyah (1973) Ltd.",
        "summary": "Mordechai Aviv Taasiot Beniyah (1973) Ltd. engages in the planning, construction, marketing, and sale of real estate properties in Israel and internationally. The company undertakes the construction of residential, commercial, and industrial projects. It also offers engineering works in the fields of flooring, electrical, plaster, paint, plumbing, development work, transportation, and logistics, as well as engages in the leasing and operation of real estate properties. The company was formerly known as Saf Or Industrial Construction Ltd. and changed its name to Mordechai Aviv Taasiot Beniyah (1973) Ltd. in March 1993. Mordechai Aviv Taasiot Beniyah (1973) Ltd. was incorporated in 1973 and is based in Jerusalem, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Jerusalem",
        "zipcode": "28281",
        "website": "http://maviv.co.il",
        "full_time_employees": 535
    },
    "AVLN.TA": {
        "short_name": "AVIV ARLON LTD",
        "long_name": "Aviv Arlon Ltd.",
        "summary": "Aviv Arlon Ltd. focuses on the acquisition, improvement, development, leasing, and management of shopping centers in the United States and Serbia. The company was founded in 2007 and is based in Ramat Gan, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ramat Gan",
        "zipcode": null,
        "website": "http://www.avivarlon.com",
        "full_time_employees": null
    },
    "BRAN.TA": {
        "short_name": "BARAN GROUP LTD",
        "long_name": "Baran Group Ltd",
        "summary": "Baran Group Ltd provides engineering, technology, telecommunication, and construction solutions worldwide. The company operates through two segments, Baran Israel and Baran International. Its solutions include feasibility studies, engineering and design, permitting and validation, construction and site management, procurement and contracting, project management and control, operation and maintenance, turnkey, project financing, and related services. The company serves various industries, such as manufacturing, industrial process, power generation and distribution, petroleum production, water supply, sewerage and hazardous waste treatment, general building, construction, transportation, and telecommunications. Baran Group Ltd was founded in 1979 and is headquartered in Beit Dagan, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Beit Dagan",
        "zipcode": "50200",
        "website": "http://www.barangroup.com",
        "full_time_employees": 769
    },
    "DNYA.TA": {
        "short_name": "DNYA CEBUS",
        "long_name": "Danya Cebus Ltd",
        "summary": "Danya Cebus Ltd., a construction company, engages in the planning and execution of various projects in Israel and internationally. It undertakes infrastructure projects, including road paving, railway infrastructure building, construction of bridges and parking lots, and tunnel mining and related infrastructure development; commercial and industrial projects; residential buildings; and other projects. The company is also involved in the development and sale of residential units; and executing and establishing projects in the fields of electricity, cogeneration, fire discovery and extinguishment, high voltage, low voltage, plumbing, sprinklers, air conditioning, and ventilation. In addition, it provides professional skilled workers; and undertakes geotechnical works. The company is based in Or Yehuda, Israel. Danya Cebus Ltd. is a subsidiary of Africa Israel Investments Ltd.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Or Yehuda",
        "zipcode": "60250",
        "website": "http://www.denyagroup.co",
        "full_time_employees": 1893
    },
    "ELMR.TA": {
        "short_name": "ELMORE ELEC INSTL",
        "long_name": "El-Mor Electric Installation & Services (1986) Ltd.",
        "summary": "El-Mor Electric Installation & Services (1986) Ltd., through its subsidiaries, operates in the energy, infrastructure, and communications fields in Israel and internationally. The company undertakes the construction and implementation of energy, electricity, and air-conditioning projects in various fields, including power plants, renewable and solar energy, industry, telecom, high-tech, commercial and public buildings, military and defense facilities, electrical and telecom infrastructure, and street lighting. It also constructs substations; contracts PV solar plants; manufactures and assembles power electrical boards, distribution switchboards, and automation and MCC boards; and provides management and maintenance services for energy, electrical, and electro-mechanical systems. In addition, the company engages in transforming organic waste into energy using pyrolysis and gasification solutions; planning, constructing, and maintaining cogeneration-based power stations with capacity up to 16 MW; and supplying, installing, and maintaining steam boilers based on fire tubes, water tubes, and electricity. El-Mor Electric Installation & Services (1986) Ltd. was founded in 1967 and is based in Ashkelon, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ashkelon",
        "zipcode": null,
        "website": "http://www.el-mor.co.il",
        "full_time_employees": 489
    },
    "ELTR.TA": {
        "short_name": "ELECTRA LTD",
        "long_name": "Electra Limited",
        "summary": "Electra Limited operates as an electromechanical, and construction and infrastructure company in Israel and internationally. It operates through five segments: Construction and Infrastructure Projects in Israel; Construction projects and Infrastructure Projects Abroad; Facility Management; Development and Construction of Entrepreneurial Real Estate; and Concessions. The company designs, plans, and builds residential, commercial, and industrial complexes; and installs and maintains elevators, escalators, air-conditioning and heating systems, and electricity systems, as well as provides plumbing, water purification, and sewage solutions. It also maintains electromechanical infrastructure in residential, commercial, and industrial facilities; and provides building management amenities. In addition, the company engages in the instillation of electrical infrastructure products for high voltage power lines, high/intermediate voltage, and low voltage supply systems. Further, it develops and constructs real estate properties; and provides concept development, construction and infrastructure, and management services for concessionary projects. The company was formerly known as Electra (Israel) Ltd. and changed its name to Electra Limited in January 2003. Electra Limited was founded in 1945 and is based in Ramat Gan, Israel. Electra Limited operates as a subsidiary of Elco Ltd.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ramat Gan",
        "zipcode": "5250501",
        "website": "http://www.electra.co.il",
        "full_time_employees": 11321
    },
    "LEOF.TA": {
        "short_name": "LEVINSKI OFER LTD",
        "long_name": "Lewinsky-Ofer Ltd.",
        "summary": "Lewinsky-Ofer Ltd. operates as a public construction and entrepreneurship company in Israel. It constructs residential properties; office and industry buildings; educational institutions; and residential neighborhoods. The company was formerly known as Paz Hen Ltd. and changed its name to Lewinsky-Ofer Ltd. in 2013. Lewinsky-Ofer Ltd. was incorporated in 1977 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": null,
        "website": "http://www.levinski-ofer.co.il",
        "full_time_employees": null
    },
    "LEVI.TA": {
        "short_name": "MESHULAM LEVINSTEI",
        "long_name": "Meshulam Levinstein Contracting & Engineering Ltd.",
        "summary": "Meshulam Levinstein Contracting & Engineering Ltd. engages in the engineering, construction, and real estate businesses in Israel and internationally. The company constructs and develops office buildings, public buildings, and structures designed for the hi-tech industry; housing units, apartment buildings, and residential neighborhoods; and shopping centers and commercial buildings. It also engages in the construction and ownership of income real estate properties; and project development and implementation activities, including land investments, handling permits, construction, sales, and rental activities. In addition, the company undertakes infrastructure work, bridge construction, and building contracting activities. Meshulam Levinstein Contracting & Engineering Ltd. was founded in 1945 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": null,
        "website": "http://www.levinstein.co.il",
        "full_time_employees": 113
    },
    "LSCO.TA": {
        "short_name": "LESICO LTD",
        "long_name": "Lesico Ltd.",
        "summary": "Lesico Ltd., together with its subsidiaries, engages in the construction of various infrastructure projects in Israel and internationally. The company operates in two segments, Construction and Maintenance. It coordinates the construction of civil engineering projects, including various buildings, and infrastructures above and below the ground; administrative and operational structures, such as protected structures and obstacles on the borders for the defense establishment; and rail infrastructure, such as railways and related works. The company also coordinates the construction of infrastructure for fuel, gas, water, and sewage pipelines; mechanical work of piping; installation of equipment at power stations; and establishment of complex pipeline infrastructure for the pharmaceutical, food, and microelectronics sectors. In addition, it constructs sewage treatment plants, pumping stations, infrastructure in desalination facilities, sludge treatment plants, and infrastructure related to smell of waste plants. Further, the company provides preventive and fracture maintenance services for water and sewage systems to municipal and institutional customers under long-term contracts, as well as smashing works and pipe sleeve services for the maintenance of pipeline infrastructures; and maintains and services wastewater treatment plants. Additionally, it undertakes service and maintenance work in energy and power stations, including maintenance of turbines and mechanical maintenance; and establishes and operates infrastructures for the treatment and provision of various environmental services under franchise agreements. The company is also involved in the engineering sector. Lesico Ltd. was incorporated in 1969 and is based in Holon, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Holon",
        "zipcode": null,
        "website": "http://www.lesico.com",
        "full_time_employees": 322
    },
    "LUDN.TA": {
        "short_name": "LUDAN ENGINEERING",
        "long_name": "Ludan Engineering Co. Ltd.",
        "summary": "Ludan Engineering Co. Ltd. operates as an engineering company worldwide. It is involved in the provision of engineering and project management services that include management, planning, procurement, and construction services, as well as turn-key services; technological solutions for industrial wastewater; consultation and construction of land and groundwater; and treatment of exhaust gases, contaminated water, and sewage. The company also develops, manufactures, and installs computerized ticketing systems, entrance control systems, and vehicle fleet management systems; produces automated testing systems; provides real-time command and control systems and feasibility testing services; and implements international management software. In addition, it engages in the planning solutions and supply of systems and equipment in the fields of building control, security, and access control and multimedia systems, as well as operation and maintenance of the systems; and development of solutions for information security for infrastructure companies and industrial factories. The company was founded in 1977 and is headquartered in Petah Tikva, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": "49130",
        "website": "http://www.ludan-group.com/ludan-group",
        "full_time_employees": 1253
    },
    "LUZN.TA": {
        "short_name": "AMOS LUZON DEVELOP",
        "long_name": "Amos Luzon Development and Energy Group Ltd",
        "summary": "Amos Luzon Development and Energy Group Ltd, together with its subsidiaries, operates as a real estate development and construction company in Israel, Poland, Bulgaria, Slovakia, and Ukraine. It is also involved in the energy infrastructure business. The company undertakes offices and commercial center, residence, hotel, apartment, and other projects. It serves customers in the private and public sectors. The company was formerly known as U. Dori Group Ltd and changed its name to Amos Luzon Development and Energy Group Ltd in May 2016. The company was founded in 1961 and is based in Jerusalem, Israel. Amos Luzon Development and Energy Group Ltd is a subsidiary of Gazit-Globe Israel (Development) Ltd.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Jerusalem",
        "zipcode": null,
        "website": "http://www.dorigroup.co.il",
        "full_time_employees": null
    },
    "MNRV.TA": {
        "short_name": "MINRAV HOLDINGS",
        "long_name": "Minrav Group Ltd",
        "summary": "Minrav Group Ltd, together its subsidiaries, engages in engineering and construction works in Israel and internationally. The company is involved in the engineering management and execution of construction works in real estate, infrastructure, and environmental projects as contractors in the public and private sectors. Its projects include military training camp cities, train tunnels, sea water desalination plants, parking lots and bridges, museums, heritage centers, cultural auditoriums, football stadiums, office buildings, government offices, and other facilities and offices. The company also develops residential construction projects comprising apartments; leases and manages assets to the business and government sectors for use as commercial, industrial, and office space; and constructs and operates wastewater purification plants. In addition, it manufactures, imports, and markets plastic and PVC products; and operates and leases freezing works. The company was formerly known as Minrav Holdings Ltd. and changed its name to Minrav Group Ltd in January 2021. Minrav Group Ltd was founded in 1969 and is based in Ashdod, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ashdod",
        "zipcode": null,
        "website": "http://www.minrav.co.il",
        "full_time_employees": 215
    },
    "ORON.TA": {
        "short_name": "ORON GROUP INVESTM",
        "long_name": "Oron Group Investments & Holdings Ltd",
        "summary": "Oron Group Investments & Holdings Ltd, together with its subsidiaries, engages in the civil engineering, infrastructure, and construction businesses in Israel. The company constructs residential condominiums, including detached houses; and plans, executes, and manages engineering works, bridge construction, tunneling works, marine works, and public buildings, as well as offers solutions in the fields of construction and paving. It is also involved in the planning, construction, and management of industrial buildings, logistic centers, factories, storage buildings, and commercial centers; planning and execution of infrastructure projects, such as roads, bridges, and pumping stations; and development and execution of civil engineering and real estate projects. In addition, the company provides geotechnical works, such as geological survey drilling, groundwater monitoring, geological drilling, water pumping, stabilization and supporting slopes, energy absorbing networks, concrete spraying, vertical drains, tunneling works, dice injections, and jet grout works. Further, it manufactures and supplies quarry materials for the production of concrete and asphalt mixtures; and ready-mix concrete, cement mortar, kurkar clay, white clay, and asphalt mixtures, as well as offers bulk transportation services. Oron Group Investments & Holdings Ltd was founded in 2003 and is based in Beer Sheva, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Beersheba",
        "zipcode": null,
        "website": "http://www.oron-group.co.il",
        "full_time_employees": 366
    },
    "SKBN.TA": {
        "short_name": "SHIKUN & BINUI LTD",
        "long_name": "Shikun & Binui Ltd.",
        "summary": "Shikun & Binui Ltd., together with its subsidiaries, engages in the infrastructure and construction, real estate development, concessions, energy, and other businesses in Israel, the United States, Africa, and internationally. The company undertakes road paving, bridge building, foundations, tunnels, drilling, pipe system thrusting, electric, and water and sewage infrastructure works; and constructs hydraulic power plants, railroad and gas infrastructures, as well as placing of fiber optics. It also manages and executes contracting works in non-residential, residential, and energy and water construction projects; and manufactures various raw materials, including concrete, asphalt, construction materials, and pre-cast accessories. In addition, the company purchase, plans, develops, and sells land; and constructs, rents, and sells office and industrial buildings. Further, it engages in financing, planning, and operating infrastructure projects, including water desalination and hydraulic production of electricity; and initiating, building, and operating facilities for the production of electricity using solar photovoltaic energy and natural gas. The company was formerly known as Housing and Construction Holding Company Ltd. and changed its name to Shikun & Binui Ltd. in March 2009. The company was founded in 1920 and is headquartered in Airport City, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Airport City",
        "zipcode": "7010000",
        "website": "http://www.shikunbinui.com",
        "full_time_employees": 8765
    },
    "SPEN.TA": {
        "short_name": "SHAPIR ENGINEERING",
        "long_name": "Shapir Engineering and Industry Ltd",
        "summary": "Shapir Engineering and Industry Ltd engages in the infrastructure, concessions, quarry materials, real estate development and construction businesses in Israel. It constructs bridges, interchanges, commercial public projects, and apartment buildings, as well as undertakes road paving and marine works; and designs, constructs, maintains, and operates large-scale projects in cooperation with the private and public sectors. The company also manufactures quarry materials, ready-mix concrete and building finishing products, prefabricated elements from prestressed and precast concrete, and hot mix asphalt for paving roadways. In addition, it is involved in the development and construction of apartment buildings. The company was formerly known as Shapir Bareket Holdings Ltd. and changed its name to Shapir Engineering and Industry Ltd in September 2014. Shapir Engineering and Industry Ltd was founded in 1968 and is based in Petach Tikva, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": "4951780",
        "website": "http://www.shapir.co.il",
        "full_time_employees": null
    },
    "YAAC.TA": {
        "short_name": "YAACOBI BROTHERS",
        "long_name": "Ya'acobi Brothers Group (YSB) Ltd",
        "summary": "Ya'acobi Brothers Group (YSB) Ltd, through its subsidiaries, operates in construction, infrastructure, and entrepreneurship sectors in Israel and internationally. It undertakes projects in the areas of electricity and communication infrastructure, electromechanical infrastructure and system, railway infrastructure, traffic management and control, parking systems and solutions, control and security, highway and road infrastructure; smart lighting; stadiums and recreational sites; and smart city solutions, as well as entrepreneurship, BOT, PPP, and national projects. The company also provides infrastructure detection and water loss management, waste management, and recycling solutions; and facility management services. Its clients include public and governmental organizations, including the Ministry of Defense, national roads companies, municipalities, and local authorities, as well as private companies. The company was founded in 1974 and is based in Be'er Sheva, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Beersheba",
        "zipcode": "8487124",
        "website": "http://www.ysbgroup.com",
        "full_time_employees": 614
    }
}