{
    "FRDN.TA": {
        "short_name": "FRIDENSON LOGISTIC",
        "long_name": "Fridenson Logistic Services Ltd",
        "summary": "Fridenson Logistic Services Ltd provides logistics solutions worldwide. The company offers freight forwarding services, including ocean freight, air freight, and third party shipments; project cargo services for oil and gas, telecommunication and energy infrastructure, rail wagons, heavy machinery, and others; and inland transport services comprising container transport, car carriers, liquids and gas, oversized cargoes, and heavy loads. It also provides warehouse and TPL; industrial re-locations; customs clearance; automotive supply chain; and marine insurance services, as well as operates two container yards. The company was formerly known as Fridenson Cranes and Trucking Ltd. and changed its name to Fridenson Logistic Services Ltd in June 2007. Fridenson Logistic Services Ltd was founded in 1975 and is based in Azor, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Azor"
    },
    "MMAN.TA": {
        "short_name": "MAMAN CARGO TERMIN",
        "long_name": "Maman-Cargo Terminals & Handling Ltd.",
        "summary": "Maman-Cargo Terminals & Handling Ltd., together with its subsidiaries, provides logistics and aviation services in Israel. The company offers import, export, commercial land fright, and courier services. It also provides temperature control storage for storing aircraft surfaces and bulk refrigerated cargo, standard refrigeration, cooling, etc. The company was founded in 1974 and is based in Lod, Israel. Maman-Cargo Terminals & Handling Ltd. is a subsidiary of Taavura Holdings Ltd.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Lod"
    },
    "ORIN.TA": {
        "short_name": "ORIAN SH.M. LTD.",
        "long_name": "Orian Sh.M. Ltd.",
        "summary": "Orian Sh.M. Ltd. provides logistics services worldwide. It offers international freight forwarding and courier, customs clearance and brokerage, ocean and air freight, storage center, and distribution and transportation services, as well as ocean and air cargo insurance, healthcare supply chain, third party shipment, special express, project cargo, and blood samples delivery services. The company was founded in 1953 and is based in Lod, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Lod"
    },
    "OVRS.TA": {
        "short_name": "OVERSEAS",
        "long_name": "Overseas Commerce Ltd.",
        "summary": "Overseas Commerce Ltd. provides logistics services in Israel and internationally. The company operates and manages customs-controlled container and cargo terminals; and warehouses for storing hazardous materials and products under temperature control. It also provides logistics services, such as storage, inventory management, value-added services, etc.; and land transport and distribution services. The company serves government offices, companies, and organizations, as well as retailers, importers of electrical appliances, and food manufacturers. Overseas Commerce Ltd. was founded in 1967 and is based in Ashdod, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Ashdod"
    }
}