{
  "FRDN.TA": {
    "city": "Haifa",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Fridenson Logistic Services Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "FRIDENSON LOGISTIC",
    "state": null,
    "summary": "Fridenson Logistic Services Ltd provides logistics solutions worldwide. The company offers international freight forwarding services, including sea and air delivery services, third-party deliveries and projects, customs brokerage services, cargo insurance, etc.; customs clearance and marine insurance services; and land transport and crane services, as well as provides trade and financing solutions. It operates storage and cargo terminals and shipping agency. The company was formerly known as Fridenson Cranes and Trucking Ltd. and changed its name to Fridenson Logistic Services Ltd in June 2007. Fridenson Logistic Services Ltd was founded in 1975 and is based in Haifa, Israel. Fridenson Logistic Services Ltd is a subsidiary of Cambridge Holdings Ltd.",
    "website": "http://www.fridenson.co.il",
    "zipcode": "26113"
  },
  "MMAN.TA": {
    "city": "Lod",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Maman-Cargo Terminals & Handling Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "MAMAN CARGO TERMIN",
    "state": null,
    "summary": "Maman-Cargo Terminals & Handling Ltd., together with its subsidiaries, provides logistics and aviation services in Israel. The company offers import, export, commercial land fright, and courier services. It also provides temperature control storage for storing aircraft surfaces and bulk refrigerated cargo, standard refrigeration, cooling, etc. The company was founded in 1974 and is based in Lod, Israel. Maman-Cargo Terminals & Handling Ltd. is a subsidiary of Taavura Holdings Ltd.",
    "website": "http://www.maman.co.il",
    "zipcode": null
  },
  "ORIN.TA": {
    "city": "Lod",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Orian Sh.M. Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "ORIAN SH.M. LTD.",
    "state": null,
    "summary": "Orian Sh.M. Ltd. provides logistics services worldwide. It offers international freight forwarding and courier, customs clearance and brokerage, ocean and air freight, storage center, and distribution and transportation services, as well as ocean and air cargo insurance, healthcare supply chain, third party shipment, special express, project cargo, and blood samples delivery services. The company was founded in 1953 and is based in Lod, Israel.",
    "website": "http://www.orian.com",
    "zipcode": "71100"
  },
  "OVRS.TA": {
    "city": "Ashdod",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Overseas Commerce Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "OVERSEAS",
    "state": null,
    "summary": "Overseas Commerce Ltd. provides logistics services in Israel and internationally. The company operates and manages customs- supervised container and cargo terminals; and warehouses for storing hazardous materials and products under temperature control. It also provides logistics services, such as warehousing, inventory management, value-added services, etc.; and land transport and distribution services. The company serves exporters and importers, international cargo forwarders, customs brokers, shipping companies and ship agents, and various government authorities related to the import and export processes of cargo. Overseas Commerce Ltd. was founded in 1967 and is based in Ashdod, Israel.",
    "website": "http://www.ovrs.co.il",
    "zipcode": "7714001"
  }
}
