{
    "50S.F": {
        "short_name": "SUPERCOM LTD.  IS -,01",
        "long_name": "SuperCom Ltd.",
        "summary": "SuperCom Ltd. provides digital identity, Internet of Things and connectivity, and cyber security products and solutions to governments, and private and public organizations worldwide. The company offers MAGNA, a common platform for ID registries, e-passports, biometric visas, automated fingerprint identification systems, digitized driver's licenses, and electronic voter registration and election management. Its PureRF suite is a solution based on RFID tag technology to identify, locate, track, monitor, count, and protect people and objects. The company's PureRF suite comprises PureRF tags, hands-free long-range RFID asset and vehicle tags, PureRF readers, PureRF activators, and PureRF initializers. It also provides house arrest monitoring systems, PureTag RF bracelets, PureCom RF base stations, GPS offender tracking systems, PureTrack smartphone device, PureBeacon, PureMonitor offender electronic monitoring software, inmate monitoring systems, DoorGuard tracking station, and personnel tags. In addition, the company offers domestic violence victim protection systems. Further, it provides connectivity products and solutions comprising AVIDITY WBSac, BOLSTER WBSn, BreezeULTRA P6000, Arena controller, and BreezeNET B. Additionally, the company offers Safend's Encryption Suite that protects the organization's sensitive data; and designs solutions for carrier Wi-Fi, enterprise connectivity, smart city, smart hospitality, connected campuses, and connected events. SuperCom Ltd. sells its systems and products through local representatives, subsidiaries, and distribution channels, as well as independent representatives and resellers. The company was formerly known as Vuance Ltd. and changed its name to SuperCom Ltd. in January 2013. SuperCom Ltd. was founded in 1988 and is based in Tel Aviv-Yafo, Israel.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "CRWTF": {
        "short_name": "CROW TECHNOLOGIES 1977",
        "long_name": "Crow Technologies 1977 Ltd.",
        "summary": "Crow Technologies 1977 Ltd., through its subsidiaries, designs, develops, manufactures, sells, and distributes a range of security detection and alarm systems for use in commercial and industrial facilities, residential homes, and open areas. The company offers alarm control panels and accessories, such as Serenity alarm systems, and wired and wireless security solutions. It also provides wireless and wired detectors comprising Freewave fully supervised wireless detectors, detectors for indoor and outdoor installations, double technology and anti-masking detectors, QUAD imaging PET immune detectors and dual detectors with anti-masking, double dual and double linear imaging technology detectors, professional mirror optics PIR detectors, and ceiling mount detectors, as well as vibration and acoustic sensors. In addition, the company offers outdoor detection products, such as external detection detectors; connected home peripherals; wired outdoor sounders, wireless ultra slim external sounders, and wireless indoor sounders; and personal alert transmitters. The company offers its products through a network of distributors and sales offices to professional installers and central monitoring stations worldwide. Crow Technologies 1977 Ltd. was founded in 1977 and is headquartered in Airport City, Israel.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Airport City"
    },
    "GOSS.TA": {
        "short_name": "G 1 SECURE SOL",
        "long_name": "G1 Secure Solutions Ltd",
        "summary": "G1 Secure Solutions Ltd provides security and safety services in Israel. It operates through Technologies, Security, Monitoring, and Hotelo divisions. The company offers human security and electronic security services, as well as low voltage systems; and planning, supply, installation, maintenance, and servicing services. It serves smart cities, monitoring and control programming, fire detection and extinguishing systems, and next generation safety tools; and neighborhoods and cities, private homes and businesses, retail facilities, and public institutions and buildings. The company was founded in 1937 and is based in Petah Tikva, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Petah Tikva"
    },
    "MAGS": {
        "short_name": "Magal Security Systems Ltd.",
        "long_name": "Magal Security Systems Ltd.",
        "summary": "Magal Security Systems Ltd. develops, manufactures, markets, and sells perimeter intrusion detection sensors, physical barriers, video analytics and management systems, cyber security products and systems, and security video observation and surveillance systems. The company operates through two segments, Products and Projects. It offers perimeter security products that enable customers to monitor, limit, and control access by unauthorized personnel to specific regions or areas. The company's perimeter security systems include fence mounted detection systems; detection grids, gates, and fences to protect water passages, VIP residences, and other outdoor applications; buried sensors; hybrid perimeter intrusion detection and intelligent lighting systems; electrical field disturbance sensors; and microwave sensors. It also provides integrated intelligent video management solutions for security surveillance and business intelligence applications; video management products for monitoring, securing, and the active management of network video systems and analytics, as well as wired, wireless, and fiber optic communication network solutions; and turnkey solutions. In addition, the company offers life safety/duress alarm to protect personnel in prisons. Further, it provides closed circuit television and intelligent video analytics solutions; Fortis X, a new generation command and control system; StarNet 2, a security management system; and Network Manager, a middleware package. The company's products are used to protect borders and sensitive facilities, including military bases, power plants, air and sea ports, postal facilities, prisons, banks, retail operations, hospitals, municipal security, sporting events, and industrial locations from terrorism, theft, and security threats. It sells its products through system integrators and distribution channels. The company was founded in 1965 and is headquartered in Yehud, Israel.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Israel",
        "city": "Yehud"
    },
    "SPCB": {
        "short_name": "SuperCom, Ltd.",
        "long_name": "SuperCom Ltd.",
        "summary": "SuperCom Ltd. provides digital identity, Internet of Things and connectivity, and cyber security products and solutions to governments, and private and public organizations worldwide. The company offers MAGNA, a common platform for ID registries, e-passports, biometric visas, automated fingerprint identification systems, digitized driver's licenses, and electronic voter registration and election management. Its PureRF suite is a solution based on RFID tag technology to identify, locate, track, monitor, count, and protect people and objects. The company's PureRF suite comprises PureRF tags, hands-free long-range RFID asset and vehicle tags, PureRF readers, PureRF activators, and PureRF initializers. It also provides house arrest monitoring systems, PureTag RF bracelets, PureCom RF base stations, GPS offender tracking systems, PureTrack smartphone device, PureBeacon, PureMonitor offender electronic monitoring software, inmate monitoring systems, DoorGuard tracking station, and personnel tags. In addition, the company offers domestic violence victim protection systems. Further, it provides connectivity products and solutions comprising AVIDITY WBSac, BOLSTER WBSn, BreezeULTRA P6000, Arena controller, and BreezeNET B. Additionally, the company offers Safend's Encryption Suite that protects the organization's sensitive data; and designs solutions for carrier Wi-Fi, enterprise connectivity, smart city, smart hospitality, connected campuses, and connected events. SuperCom Ltd. sells its systems and products through local representatives, subsidiaries, and distribution channels, as well as independent representatives and resellers. The company was formerly known as Vuance Ltd. and changed its name to SuperCom Ltd. in January 2013. SuperCom Ltd. was founded in 1988 and is based in Tel Aviv-Yafo, Israel.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Tel Aviv"
    }
}