{
    "BAM.BK": {
        "short_name": "BANGKOK COMMERCIAL ASSET MANAGE",
        "long_name": "Bangkok Commercial Asset Management Public Company Limited",
        "summary": "Bangkok Commercial Asset Management Public Company Limited operates as an asset management company. It purchases non-performing loans (NPLs) from financial institutions in Thailand, including banks and other asset management companies; and manage NPLs through debt restructuring negotiations with debtors to reach optimal solutions for all stakeholders where possible. The company also acquires non-performing assets (NPAs) through various means, such as negotiating with debtors for the transfer of the guarantee or repayment property, foreclosing the debt settlement, and purchasing NPAs directly from other financial institutions. Its NPLs are primarily collateralized by real estate properties, secured by a first priority mortgage; and NPAs are primarily real estate assets, such as empty lands, hotels, factories, commercial buildings, and certain movable assets, as well as residential properties, including detached houses, townhouses, and condominiums. The company was founded in 1998 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10500",
        "website": "http://www.bam.co.th",
        "market_cap": 63994388480
    },
    "FNS-R.BK": {
        "short_name": "FINANSA PUBLIC COMPANY LIMITED",
        "long_name": "Finansa Public Company Limited",
        "summary": "Finansa Public Company Limited, together with its subsidiaries, provides various financial services to institutional, corporate, and retail clients in Thailand. The company operates through three segments: Investment, Advisory and Management Business; Securities Business; and Warehouse and Factory Leasing Business. It invests in and provides finance and management advisory services; and offers warehouse and factory leasing services. The company also provides investment banking services, such as advisory services in the areas of initial public offerings, mergers and acquisitions, limited recourse project financings, and debt-related transactions; underwriting; mutual fund selling agency; bond trading; and investment and fund advisory services, as well as develops financial derivatives products. In addition, it offers private equity investment and loan management services, as well as wealth management services. The company was incorporated in 1989 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10500",
        "website": "http://www.finansa.com",
        "market_cap": 1748396544
    },
    "FNS.BK": {
        "short_name": "FINANSA PUBLIC COMPANY LIMITED",
        "long_name": "Finansa Public Company Limited",
        "summary": "Finansa Public Company Limited, together with its subsidiaries, provides various financial services to institutional, corporate, and retail clients in Thailand. The company operates through three segments: Investment, Advisory and Management Business; Securities Business; and Warehouse and Factory Leasing Business. It invests in and provides finance and management advisory services; and offers warehouse and factory leasing services. The company also provides investment banking services, such as advisory services in the areas of initial public offerings, mergers and acquisitions, limited recourse project financings, and debt-related transactions; underwriting; mutual fund selling agency; bond trading; and investment and fund advisory services, as well as develops financial derivatives products. In addition, it offers private equity investment and loan management services, as well as wealth management services. The company was incorporated in 1989 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10500",
        "website": "http://www.finansa.com",
        "market_cap": 1611684224
    },
    "MFC.BK": {
        "short_name": "MFC ASSET MANAGEMENT PUBLIC COM",
        "long_name": "MFC Asset Management Public Company Limited",
        "summary": "MFC Asset Management Public Company Limited is a publicly owned investment manager. The firm manages mutual funds for its clients. It also manages provident funds for its clients. The firm invests in public equity and fixed income markets of the world. It also invests in industrial property. The firm deals in acquiring and leasing the property. It includes freehold and leasehold, ownership and freehold rights of land and factories. The firm conducts in-house research to make its investments. MFC Asset Management Public Company Limited was previously known as The Mutual Fund Public Company Limited. MFC Asset Management Public Company Limited was founded on 14 March 1975, and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.mfcfund.com",
        "market_cap": 2386703872
    }
}