{
    "COL-R.BK": {
        "short_name": "COL PUBLIC COMPANY LIMITED",
        "long_name": "COL Public Company Limited",
        "summary": "COL Public Company Limited engages in the retail distribution of stationery supplies and office equipment in Thailand. It operates through two segments, Retail Shops and Non-Store. The company offers stationery and office supplies, and office furniture; office automotive supplies, such as conference and presentation, office electronics, and business gadgets, as well as factory and maintenance products, including screwdriver, adjustable wrenches, pliers, hammer, safety helmet, safety glasses, gloves, boots, measurement tape, tools box, handgun sealing packaging, ladder, wheelbarrow, etc. It also provides various goods for hotel, restaurant, and catering businesses, which include dish racks, juice dispensers, kitchen wares, food packaging, coffee makers, syrups, food trays and refrigerators, etc.; printing solution services, including name cards, rubber stamps, leaflets, etc., as well as ready-made templates; furniture layout design services; delivery services; gifts and souvenirs; packing equipment; and gift hampers. In addition, the company is involved in the trading and repairing of printers. Further, it offers books, stationery and art products, and learning instrument and materials, as well as lifestyle and entertainment products, such as backpack, GPS device, camera and DVR, car and bike camera, wearable devices and gadgets, home and office DIY decorative products, and gift products. Additionally, the company provides e-books, electronic reading device, music and movies products, and software and related services; consultant and franchise system management; and warehouse rental services. It sells its private brand products under ONE, ME.STYLE, SUNVO, NEO, and FURRADEC through catalog, call center, e-commerce and e-procurement, website, and retail stores. The company was formerly known as Officemate Public Company Limited and changed its name to COL Public Company Limited in April 2015. COL Public Company Limited is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "DTCI-R.BK": {
        "short_name": "D.T.C. INDUSTRIES PUBLIC COMPAN",
        "long_name": "D.T.C. Industries Public Company Limited",
        "summary": "D.T.C. Industries Public Company Limited produces and distributes pens and related products in Thailand and internationally. The company offers ball point pens, markers, fine liners and hi-liters, retractable pencils, stamp pads and endorsing inks, erasers, wax crayons, lead dart pencil refills, metal pens, roller pens, and miscellaneous products. It also provides space rental; and packaging and printing services. The company was founded in 1963 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "DTCI.BK": {
        "short_name": "D.T.C. INDUSTRIES PUBLIC COMPAN",
        "long_name": "D.T.C. Industries Public Company Limited",
        "summary": "D.T.C. Industries Public Company Limited produces and distributes pens and related products in Thailand and internationally. The company offers ball point pens, markers, fine liners and hi-liters, retractable pencils, stamp pads and endorsing inks, erasers, wax crayons, lead dart pencil refills, metal pens, roller pens, and miscellaneous products. It also provides space rental; and packaging and printing services. The company was founded in 1963 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    }
}