{
    "COMAN-R.BK": {
        "short_name": "COMANCHE INTERNATIONAL PUBLIC C",
        "long_name": "Comanche International Public Company Limited",
        "summary": "Comanche International Public Company Limited, together with its subsidiaries, provides information technology solutions for hotels and serviced apartments. It offers hospitality industry management systems with integrated modules, such as front office, point of sale, call accounting, back office with accounts payable, accounts receivable, general ledger, and inventory control. The company also sells computers and computer software, as well as provides maintenance services and other services relating to computer software. It operates in Thailand, Myanmar, Vietnam, Laos, Australia, Cambodia, Hong Kong, Macau, China, Japan, Indonesia, the Philippines, Maldives, Malaysia, Taiwan, India, Sri Lanka, and Singapore. Comanche International Public Company Limited was incorporated in 2003 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "COMAN.BK": {
        "short_name": "COMANCHE INTERNATIONAL PUBLIC C",
        "long_name": "Comanche International Public Company Limited",
        "summary": "Comanche International Public Company Limited, together with its subsidiaries, provides information technology solutions for hotels and serviced apartments. It offers hospitality industry management systems with integrated modules, such as front office, point of sale, call accounting, back office with accounts payable, accounts receivable, general ledger, and inventory control. The company also sells computers and computer software, as well as provides maintenance services and other services relating to computer software. It operates in Thailand, Myanmar, Vietnam, Laos, Australia, Cambodia, Hong Kong, Macau, China, Japan, Indonesia, the Philippines, Maldives, Malaysia, Taiwan, India, Sri Lanka, and Singapore. Comanche International Public Company Limited was incorporated in 2003 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "CPW-R.BK": {
        "short_name": "COPPERWIRED PUBLIC COMPANY LIMI",
        "long_name": "Copperwired Public Company Limited",
        "summary": "Copperwired Public Company Limited retails, distributes, and repairs computers, mobile phones, and accessories in Thailand. It operates various stores under the dotlife, Apple Reseller, U-Store, iServe, and KOAN names. The company is based in Bangkok, Thailand. Copperwired Public Company Limited operates as a subsidiary of Vnet Capital Co., Ltd.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "CPW.BK": {
        "short_name": "COPPERWIRED PUBLIC COMPANY LIMI",
        "long_name": "Copperwired Public Company Limited",
        "summary": "Copperwired Public Company Limited retails, distributes, and repairs computers, mobile phones, and accessories in Thailand. It operates various stores under the dotlife, Apple Reseller, U-Store, iServe, and KOAN names. The company is based in Bangkok, Thailand. Copperwired Public Company Limited operates as a subsidiary of Vnet Capital Co., Ltd.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "CSS-R.BK": {
        "short_name": "COMMUNICATION AND SYSTEM SOLUTI",
        "long_name": "Communication & System Solution Public Company Limited",
        "summary": "Communication & System Solution Public Company Limited, together with its subsidiaries, distributes and installs production equipment for electricity, water, air conditioning, and telecommunication systems in Thailand. It operates in two segments, Distribution Electrical Equipment and Installation Service. The Distribution Electrical Equipment segment supplies electrical cable and other electrical systems equipment, and passive fire protection materials and equipment. The Installation Service segment designs and installs telecommunication and fire protection systems. The company also distributes and installs tubes. Communication & System Solution Public Company Limited was founded in 1994 and is headquartered in Nonthaburi, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Nonthaburi"
    },
    "IT-R.BK": {
        "short_name": "IT CITY PUBLIC COMPANY LIMITED",
        "long_name": "IT City Public Company Limited",
        "summary": "IT City Public Company Limited engages in the retail of computers, tablets, peripherals, smartphones, and other related accessories and IT products under the IT CITY name. As of December 31, 2019, it operated 130 branches. IT City Public Company Limited is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "MSC-R.BK": {
        "short_name": "METRO SYSTEMS CORPORATION PUBLI",
        "long_name": "Metro Systems Corporation Public Company Limited",
        "summary": "Metro Systems Corporation Public Company Limited, together with its subsidiaries, engages in trading computers and equipment, software, supplies, and office equipment, as well as provision of related services in Thailand. The company provides server, storage, and network for IT infrastructure; backup, modernized application, and IBM I solutions for infrastructure; contractual, supplies, and outsourcing printing and services solutions for digital printing; and compute, network, storage, HCI, private, hybrid, public cloud, middleware and other, database, API, and backup and DR, as well as operating systems for digital infrastructure. It also offers businesses transformation, architecture design, application development, and infrastructure and managed service for digital transformation services; workforce and unified collaboration, mobility workforce, business process automation, and IT process management for digital collaboration; and SOLIDWORKS 3D CAD, simulation, electrical design, SOLIDWORKS product data management, and technical communication for designed and engineering solutions. In addition, it offers data integration tool, data platform, BI and data visualization, advance analytics and AI/ML, and data scientist platform. Further, it offers end point, network, server and data, cloud, and mobility security; and training and services. It also offers hardware products and office supplies. Metro Systems Corporation Public Company Limited was founded in 1985 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SIMAT-R.BK": {
        "short_name": "SIMAT TECHNOLOGIES PUBLIC COMPA",
        "long_name": "Simat Technologies Public Company Limited",
        "summary": "Simat Technologies Public Company Limited distributes computer hardware, software, and network accessories in Thailand and Malaysia. The company also offers computer information technology system development services. It sells various hardware products, such as corded and cordless barcode scanners, micro kiosks, mobile printers, barcode and label printers, card printers, face recognition products, mobile computers, wireless and networking products, RFID barcode readers and printers, and RFID antennas. The company also provides various software products comprising ManageSales, a sales force automation system; ManageWare, a warehouse management system solution; MobileNET; and Sky Frog. In addition, it manufactures self-adhesive label stickers, such as ribbonless, ESD, high temperature, healthcare, and barcode and serialize labels. Further, the company offers project management, implementation and training, helpdesk support, software customization and maintenance, custom software development, and technical services. Simat Technologies Public Company Limited was founded in 1995 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SIMAT.BK": {
        "short_name": "SIMAT TECHNOLOGIES PUBLIC COMPA",
        "long_name": "Simat Technologies Public Company Limited",
        "summary": "Simat Technologies Public Company Limited distributes computer hardware, software, and network accessories in Thailand and Malaysia. The company also offers computer information technology system development services. It sells various hardware products, such as corded and cordless barcode scanners, micro kiosks, mobile printers, barcode and label printers, card printers, face recognition products, mobile computers, wireless and networking products, RFID barcode readers and printers, and RFID antennas. The company also provides various software products comprising ManageSales, a sales force automation system; ManageWare, a warehouse management system solution; MobileNET; and Sky Frog. In addition, it manufactures self-adhesive label stickers, such as ribbonless, ESD, high temperature, healthcare, and barcode and serialize labels. Further, the company offers project management, implementation and training, helpdesk support, software customization and maintenance, custom software development, and technical services. Simat Technologies Public Company Limited was founded in 1995 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SIS-R.BK": {
        "short_name": "SIS DISTRIBUTION (THAILAND)",
        "long_name": "SiS Distribution (Thailand) Public Company Limited",
        "summary": "SiS Distribution (Thailand) Public Company Limited, together with its subsidiaries, distributes computer components, smartphones, and office automation equipment in Thailand. The company operates through four segments: Commercial Products, Consumer Products, Value Added Products, and Phones. It offers servers, home and business PCs, storage and networking devices, printers/scanners, and monitors; and private cloud, enterprise storage and backup, and security services. The company is also involved in the service and rental of computers and accessories. SiS Distribution (Thailand) Public Company Limited was founded in 1998 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SPVI-R.BK": {
        "short_name": "S P V I PUBLIC COMPANY LIMITED",
        "long_name": "S P V I Public Company Limited",
        "summary": "S P V I Public Company Limited engages in the distribution of computers, mobile phones, and related accessories and services in Thailand. As of December 31, 2019, it operated 48 branches. The company was founded in 1989 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SVOA-R.BK": {
        "short_name": "SVOA PUBLIC COMPANY LIMITED",
        "long_name": "SVOA Public Company Limited",
        "summary": "SVOA Public Company Limited provides information technology (IT) products and services in Thailand. The company operates through four segments: IT Distribution, Systems Integration, IT Outsourcing Services, and IT Project. It distributes IT products, such as computer equipment, peripherals, and software; assembles and distributes computers under SVOA Computer brand name through partners and authorized dealers; and provides repair and maintenance services for IT products through 11 SVOA service centers, and approximately 108 authorized SVOA service providers. The company also offers IT consulting services, system implementation, network system equipment, security system, and end-to-end IT solutions for financial and banking institutions, telecommunication companies, manufacturing and insurance industries, savings cooperatives, hospitals, government agencies, state enterprises, and private organizations, as well as data processing center, information technology management, and maintenance services. In addition, it provides computer system infrastructure services, including ATM outsource co-location, dedicated server, Web and email hosting, and disaster recovery support. The company was founded in 1982 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SVOA.BK": {
        "short_name": "SVOA PUBLIC COMPANY LIMITED",
        "long_name": "SVOA Public Company Limited",
        "summary": "SVOA Public Company Limited provides information technology (IT) products and services in Thailand. The company operates through four segments: IT Distribution, Systems Integration, IT Outsourcing Services, and IT Project. It distributes IT products, such as computer equipment, peripherals, and software; assembles and distributes computers under SVOA Computer brand name through partners and authorized dealers; and provides repair and maintenance services for IT products through 11 SVOA service centers, and approximately 108 authorized SVOA service providers. The company also offers IT consulting services, system implementation, network system equipment, security system, and end-to-end IT solutions for financial and banking institutions, telecommunication companies, manufacturing and insurance industries, savings cooperatives, hospitals, government agencies, state enterprises, and private organizations, as well as data processing center, information technology management, and maintenance services. In addition, it provides computer system infrastructure services, including ATM outsource co-location, dedicated server, Web and email hosting, and disaster recovery support. The company was founded in 1982 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SYNEX-R.BK": {
        "short_name": "SYNNEX (THAILAND) PUBLIC COMPAN",
        "long_name": "Synnex (Thailand) Public Company Limited",
        "summary": "Synnex (Thailand) Public Company Limited engages in the distribution of computers, computer peripherals, software, IT systems, computer consumables, and communication devices in Thailand. It distributes mobile phones and tablets; personal computers; and PC components comprising motherboard/mainboard, hard disk drives, central processing unit, dynamic random access memory, video graphics array, power supply units, and computer cases. The company also offers PC monitor, mouse, keyboard, speakers, headsets, mobile phone accessories, web camera/video camera, optical disk drive, projector, uninterruptible power supply, inkjet printer, laser printer, all-in-one printer/multi-function printer, dot matrix printer, plotter printer, pocket photo printer, scanner, sewing machine, ink cartridges, toner, printer ribbons, USB flash drive, and external hard disk drives/external solid-state drive. In addition, it provides commercial notebook, digital signage, closed circuit television, barcode and labelling equipment, server, network attached storage, switch, router, LAN card, wireless LAN, network cabling system, network management software and hardware, network security or firewall, and network accessories; and cloud services. Further, the company offers smart watch, wristband and smart eyewear, virtual reality glasses and headsets, drones, underwater scooter, smart light bulbs, internet protocol camera, industrial network products, and education robots; IoT products; and general and technical services and maintenance for network devices, servers, and various applications software. It serves computer retailers and wholesalers, software solution providers, computer manufacturers, department stores, superstores, and stationary shops. The company was formerly known as Compex (Thailand) Company Limited and changed its name to Synnex (Thailand) Public Company Limited in 2002. Synnex (Thailand) Public Company Limited was founded in 1988 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SYNEX.BK": {
        "short_name": "SYNNEX (THAILAND) PUBLIC COMPAN",
        "long_name": "Synnex (Thailand) Public Company Limited",
        "summary": "Synnex (Thailand) Public Company Limited engages in the distribution of computers, computer peripherals, software, IT systems, computer consumables, and communication devices in Thailand. It distributes mobile phones and tablets; personal computers; and PC components comprising motherboard/mainboard, hard disk drives, central processing unit, dynamic random access memory, video graphics array, power supply units, and computer cases. The company also offers PC monitor, mouse, keyboard, speakers, headsets, mobile phone accessories, web camera/video camera, optical disk drive, projector, uninterruptible power supply, inkjet printer, laser printer, all-in-one printer/multi-function printer, dot matrix printer, plotter printer, pocket photo printer, scanner, sewing machine, ink cartridges, toner, printer ribbons, USB flash drive, and external hard disk drives/external solid-state drive. In addition, it provides commercial notebook, digital signage, closed circuit television, barcode and labelling equipment, server, network attached storage, switch, router, LAN card, wireless LAN, network cabling system, network management software and hardware, network security or firewall, and network accessories; and cloud services. Further, the company offers smart watch, wristband and smart eyewear, virtual reality glasses and headsets, drones, underwater scooter, smart light bulbs, internet protocol camera, industrial network products, and education robots; IoT products; and general and technical services and maintenance for network devices, servers, and various applications software. It serves computer retailers and wholesalers, software solution providers, computer manufacturers, department stores, superstores, and stationary shops. The company was formerly known as Compex (Thailand) Company Limited and changed its name to Synnex (Thailand) Public Company Limited in 2002. Synnex (Thailand) Public Company Limited was founded in 1988 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "VCOM-R.BK": {
        "short_name": "VINTCOM TECHNOLOGY PUBLIC COMPA",
        "long_name": "Vintcom Technology Public Company Limited",
        "summary": "Vintcom Technology Public Company Limited, together with its subsidiaries, trades in computers and equipment in Thailand. It operates through Sale of Goods and Rendering of Services segments. The company also provides software and related services for computers. In addition, it offers installation, consulting, and computer system maintenance services; and network security monitoring services. The company was founded in 1992 and is based in Bangkok, Thailand. Vintcom Technology Public Company Limited is a subsidiary of Vnet Capital Co., Ltd.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "VCOM.BK": {
        "short_name": "VINTCOM TECHNOLOGY PUBLIC COMPA",
        "long_name": "Vintcom Technology Public Company Limited",
        "summary": "Vintcom Technology Public Company Limited, together with its subsidiaries, trades in computers and equipment in Thailand. It operates through Sale of Goods and Rendering of Services segments. The company also provides software and related services for computers. In addition, it offers installation, consulting, and computer system maintenance services; and network security monitoring services. The company was founded in 1992 and is based in Bangkok, Thailand. Vintcom Technology Public Company Limited is a subsidiary of Vnet Capital Co., Ltd.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    }
}