{
    "TGH-R.BK": {
        "short_name": "THAI GROUP HOLDINGS PUBLIC COMP",
        "long_name": "Thai Group Holdings Public Company Limited",
        "summary": "Thai Group Holdings Public Company Limited engages in the underwriting of life and non-life insurance business principally in Thailand. The company offers fire insurance products that provides coverage for residential and commercial properties caused by fire, gas explosion, and lighting. It also provides marine insurance products for losses or damages of shipping cargo, and/or ship vessels; domestic and international point-to-point marine, air, and land transportation; import and export protection; and other damages, including accident, explosive, vehicle damage or disappeared, and etc. The company's motor insurance offers coverage for vehicle damages, theft, fire, loss of life, and injury; and third party's vehicle damages, loss of life, and injury. In addition, it offers personal accidents, travel, cancer, accidental and property damage, burglary, all risk, plate glass, money, neon sign, contractors all risks, erection all risks, boiler & pressure vessel, electronic equipment, contractors' plant and equipment, machinery breakdown, public liability, medical malpractice liability, directors' and officers' liability, workmen's compensation, fidelity guarantee, golfer's indemnity, and other insurances. Further, the company provides auto leasing, used and new car hire purchase, cash your car, revolving loan, factoring loan, project finance, and other loans; and insurance agent training, business consulting, and property leasing, etc, as well as engages in the reinsurance business. Additionally, develops and rents real estate properties; management services; provides investing consultant and develops insurance technology. The company was incorporated in 2018 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    }
}