{
    "GVREIT.BK": {
        "short_name": "GOLDEN VENTURES LEASEHOLD REAL ",
        "long_name": "Golden Ventures Leasehold Real Estate Investment Trust",
        "summary": "Golden Ventures Leasehold Real Estate Investment Trust, a real estate investment trust, engages in the rental of properties in Thailand. It holds leasehold rights of Park Ventures Ecoplex building, as well as land and building sub-lease rights of Sathorn Square located at the Central Business District of Thailand. The company has elected to be taxed as a real estate investment trust. As a result, it would not be subject to corporate income tax on that portion of its net income that is distributed to shareholders. The company was founded in 2016 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10330",
        "website": "http://www.gvreit.com",
        "market_cap": "Micro Cap"
    },
    "IMPACT.BK": {
        "short_name": "IMPACT GROWTH REAL ESTATE INVES",
        "long_name": "Impact Growth Real Estate Investment Trust",
        "summary": "IMPACT Growth Real Estate Investment Trust is a real estate investment trust externally managed by RMI Company Limited. It invests in real estate markets of Thailand. The firm invests in freehold right of Building Exhibition and Conference of IMPACT Muang Thong Thani. IMPACT Growth Real Estate Investment Trust is domiciled in Thailand.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Nonthaburi",
        "zipcode": "11120",
        "website": "http://www.impactgrowthreit.com",
        "market_cap": "Small Cap"
    },
    "TPRIME.BK": {
        "short_name": "THAILAND PRIME PROPERTY FREEHOL",
        "long_name": "Thailand Prime Property Freehold and Leasehold Real Estate Investment Trust",
        "summary": "Thailand Prime Property Freehold and Leasehold Real Estate Investment Trust is a real estate investment trust externally managed by SCCP REIT Company Limited. The firm invest in leasehold rights over the Mercury Tower Project and acquiring at least 99.99 per cent. of shares of Exchange Tower Co.,Ltd which owns the Exchange Tower Project. Thailand Prime Property Freehold and Leasehold Real Estate Investment Trust is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.tprimereit.com",
        "market_cap": "Micro Cap"
    },
    "WHABT.BK": {
        "short_name": "WHA BUSINESS COMPLEX FREEHOLD",
        "long_name": "WHA Business Complex Freehold and Leasehold Real Estate Investment Trust",
        "summary": "WHA Business Complex Freehold and Leasehold Real Estate Investment Trust specializes in real estate investing.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": null,
        "website": null,
        "market_cap": "Micro Cap"
    }
}