{
  "DREIT.BK": {
    "city": "Bangkok",
    "country": "Thailand",
    "currency": "THB",
    "exchange": "SET",
    "industry": "REIT - Hotel & Motel",
    "long_name": "Dusit Thani Freehold and Leasehold Real Estate Investment Trust",
    "market": "th_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "DUSIT THANI FREEHOLD AND LEASEH",
    "state": null,
    "summary": "Dusit Thani Freehold and Leasehold Real Estate Investment Trust is a real estate investment trust. The firm focuses on investing in high potential freehold or leasehold properties especially in hotel properties, as well as investing in other assets that favor hotel-related business, such as meeting and convention room, restaurants, fitness center, spa, swimming pool, tennis court etc. The firm is based in Bangkok, Thailand.",
    "website": "http://www.dtcreit.com",
    "zipcode": "10330"
  },
  "SHREIT.BK": {
    "city": "Bangkok",
    "country": "Thailand",
    "currency": "THB",
    "exchange": "SET",
    "industry": "REIT - Hotel & Motel",
    "long_name": "Strategic Hospitality Extendable Freehold and Leasehold Real Estate Investment Trust",
    "market": "th_market",
    "market_cap": "Nano Cap",
    "sector": "Real Estate",
    "short_name": "STRATEGIC HOSPITALITY EXTENDABL",
    "state": null,
    "summary": "Strategic Hospitality Extendable Freehold and Leasehold Real Estate Investment Trust (\"SHREIT\") is a pioneering international REIT managed by Strategic Property Investors Company Limited. We provide investors with well-diversified portfolio of hospitality assets, access to younger and faster growing Mekong region countries through a regulated vehicle. SHREIT's initial portfolio is spread across key cities in Mekong region  Ho Chi Minh City and Jakarta. Each of the asset in the initial portfolio is strategically located, urban focused, and fully differentiates itself from it competitors. The REIT's hotels are catered for different customer segments, ranging from economy to luxury, with a total of 632 rooms under management. The hotels are operated by top international hotel operators such as Accor and Frasers.",
    "website": "http://www.sh-reit.com",
    "zipcode": "10120"
  },
  "SRIPANWA.BK": {
    "city": "Bangkok",
    "country": "Thailand",
    "currency": "THB",
    "exchange": "SET",
    "industry": "REIT - Hotel & Motel",
    "long_name": "Sri panwa Hospitality Real Estate Investment Trust",
    "market": "th_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "SRI PANWA HOSPITALITY REAL ESTA",
    "state": null,
    "summary": "Sri panwa Hotel Property Fund specializes in investing in real estate.",
    "website": "http://cireit.com",
    "zipcode": "10310"
  }
}
