{
    "1SY.SG": {
        "short_name": "Symphony Communications PCL Reg",
        "long_name": "Symphony Communication Public Company Limited",
        "summary": "Symphony Communication Public Company Limited provides communication high-speed circuit services in Thailand, the Southeast Asian countries, and internationally. The company operates in two segments, Render of Communication High Speed Circuit Services and Network Equipment Services. Its services include metro Ethernet, a high-speed network service using fiber optical Ethernet technology to support data transmissions; ready Ethernet, an Ethernet service for customers in commercial buildings in Bangkok metropolitan area; and time division multiplexing (TDM) transmission technology, a type of multiplexing that combines data streams by assigning each stream a different time slot in a set. The company also offers synchronous digital hierarchy, a high-speed circuit for sending and receiving high speed digital data from TDM technology; Ethernet over synchronous digital hierarchy, a high-speed circuit that provides data transmission through Ethernet connection; and dark fiber, which offers data transmission service through fiber optic to customers that require management and control over internal data transmission within division. In addition, it provides international private leased circuit service for multinational organizations to connect with other counties, as well as with international leased circuit and digital broadcasting providers of TV satellite; virtual private network services; and international Internet gateway and IP transit services, which are internet data communications services for connecting with Internet service providers. Further, the company offers cloud direct connect solution, a service connection from the client's office directly to the cloud service providers instead of using only the internet connection; and submarine cable system, as well as preventive maintenance and installation services of network equipment. Symphony Communication Public Company Limited was founded in 2005 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "AISF.F": {
        "short_name": "ADVANCED INFO S.-FGN-BA 1",
        "long_name": "Advanced Info Service Public Company Limited",
        "summary": "Advanced Info Service Public Company Limited operates as a mobile phone network company primarily in Thailand. The company operates through three segments: Mobile Phone Services, Mobile Phone and Equipment Sales, and Datanet and Broadband Services. It is involved in the operation of cellular telephone networks in the frequency of 900 MHz; and in 2.1 GHz and 1800 MHz frequencies. The company also imports and distributes handsets and accessories, as well as distributes cash cards; and provides online data communications services through telephone landlines and optical fiber, as well as electronic payment services. In addition, it provides international telephone service, broadcasting network, and television broadcasting services for various channels, as well as insurance brokerage services. Further, the company offers IT, content aggregator, and billing and collection outsourcing services; call center services; and land and building rental services, as well as related facilities. Additionally, it provides Internet data center, and Internet and satellite uplink-downlink services for communications; and distributes Internet equipment; publishes business telephone directories and advertising; offers mobile contents; and provides online advertising services. Advanced Info Service Public Company Limited was founded in 1989 and is based in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "AVIFY": {
        "short_name": "ADVANCED INFO SERVICE PUBLIC CO",
        "long_name": "Advanced Info Service Public Company Limited",
        "summary": "Advanced Info Service Public Company Limited operates as a mobile phone network company primarily in Thailand. The company operates through three segments: Mobile Phone Services, Mobile Phone and Equipment Sales, and Datanet and Broadband Services. It is involved in the operation of cellular telephone networks in the frequency of 900 MHz; and in 2.1 GHz and 1800 MHz frequencies. The company also imports and distributes handsets and accessories, as well as distributes cash cards; and provides online data communications services through telephone landlines and optical fiber, as well as electronic payment services. In addition, it provides international telephone service, broadcasting network, and television broadcasting services for various channels, as well as insurance brokerage services. Further, the company offers IT, content aggregator, and billing and collection outsourcing services; call center services; and land and building rental services, as well as related facilities. Additionally, it provides Internet data center, and Internet and satellite uplink-downlink services for communications; and distributes Internet equipment; publishes business telephone directories and advertising; offers mobile contents; and provides online advertising services. Advanced Info Service Public Company Limited was founded in 1989 and is based in Bangkok, Thailand.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "DTAC-R.BK": {
        "short_name": "TOTAL ACCESS COMMUNICATION",
        "long_name": "Total Access Communication Public Company Limited",
        "summary": "Total Access Communication Public Company Limited, together with its subsidiaries, primarily provides wireless telecommunications services in Thailand. The company operates in two segments, Mobile Telephone Service and Related Services; and Sales of Handsets and Starter Kits. It primarily offers its services in 800 MHz and 1800 MHz frequency bands. The company also provides asset management services; online payment services; and telecommunication equipment lease and device services. Total Access Communication Public Company Limited was founded in 1989 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "DTAC.BK": {
        "short_name": "TOTAL ACCESS COMMUNICATION",
        "long_name": "Total Access Communication Public Company Limited",
        "summary": "Total Access Communication Public Company Limited, together with its subsidiaries, primarily provides wireless telecommunications services in Thailand. The company operates in two segments, Mobile Telephone Service and Related Services; and Sales of Handsets and Starter Kits. It primarily offers its services in 800 MHz and 1800 MHz frequency bands. The company also provides asset management services; online payment services; and telecommunication equipment lease and device services. Total Access Communication Public Company Limited was founded in 1989 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "FSMART-R.BK": {
        "short_name": "FORTH SMART SERVICE PUBLIC COMP",
        "long_name": "Forth Smart Service Public Company Limited",
        "summary": "Forth Smart Service Public Company Limited, together with its subsidiaries, provides various top-up services for prepaid phones in Thailand. The company also offers receipt of other online services; and advertising services through online top-up machines, as well as rendering of service relating to online top-up machines. In addition, it offers nano finance and personal loan services. The company was founded in 2008 and is based in Bangkok, Thailand. Forth Smart Service Public Company Limited is a subsidiary of Forth Corporation Public Company Limited.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "FSMART.BK": {
        "short_name": "FORTH SMART SERVICE PUBLIC COMP",
        "long_name": "Forth Smart Service Public Company Limited",
        "summary": "Forth Smart Service Public Company Limited, together with its subsidiaries, provides various top-up services for prepaid phones in Thailand. The company also offers receipt of other online services; and advertising services through online top-up machines, as well as rendering of service relating to online top-up machines. In addition, it offers nano finance and personal loan services. The company was founded in 2008 and is based in Bangkok, Thailand. Forth Smart Service Public Company Limited is a subsidiary of Forth Corporation Public Company Limited.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "ICN-R.BK": {
        "short_name": "INFORMATION AND COMMUNICATION N",
        "long_name": "Information and Communication Networks Public Company Limited",
        "summary": "Information and Communication Networks Public Company Limited operates as a telecommunication system integrator company in Thailand. The company provides construction services for telecommunication networks; various services for the expansion of the installed base; and services for the improvement, upgrade, and alteration of software/ firmware/ license and/or hardware of telecommunication networks. It also offers electrical system installation services; designing and installing services for various other systems, such as mechanical and electrical, air refrigeration and control, automatic fire detection and alarm, and security systems for data centers; and develops supervisory control and data acquisition that facilitate data validation and analysis for monitoring the status of information and controlling industrial and engineering systems, telecommunication and communication, water supply, wastewater treatment, energy management, etc. In addition, the company distributes telecommunication spare parts to support wired and wireless networks comprising 3G/4G or LTE mobile systems, Internet protocol (IP) network for the Internet of Things, optical and microwave networks, SIM card security verification systems, synchronization systems for telecommunication devices to prevent mismatch in data communication, IT infrastructure servers and storage for cloud computing, mobile device management for subscribers' system monitoring and management, software defined networks for data center management, and fiber optic cables and installation-related equipment. Further, it provides preventive, corrective, and proactive/adaptive maintenance services for main mobile exchange, mobile equipment of the base stations, optical and microwave networks, IP routers/carrier switches, and IP networks for voice, video telephony, images, and data. Information and Communication Networks Public Company Limited was founded in 2007 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "INTUCH-R.BK": {
        "short_name": "INTOUCH HOLDINGS PUBLIC COMPANY",
        "long_name": "Intouch Holdings Public Company Limited",
        "summary": "Intouch Holdings Public Company Limited, through its subsidiaries, engages in the satellite, Internet, telecommunications, and media and advertising businesses. It operates through Local Wireless Telecommunications, Satellite and International Businesses, and Other Businesses segments. The company offers transponder rental and related services for domestic and international communications; broadband content services; advertising services; Internet data center, Internet, satellite uplink-downlink, and telecommunication services;, sale and service related to media, telephone network, mobile content, and engineering development services on communication technology and electronics. It also sells user terminals of IPSTAR and direct television equipment. In addition, the company offers computer program and related services, as well as information technology services; and trades in and rents telecommunications equipment and accessories. It has operations in Thailand, the People's Republic of China, India, Japan, Myanmar, and internationally. The company was formerly known as Shin Corporation Public Company Limited and changed its name to Intouch Holdings Public Company Limited in March 2014. Intouch Holdings Public Company Limited was founded in 1983 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "INTUCH.BK": {
        "short_name": "INTOUCH HOLDINGS PUBLIC COMPANY",
        "long_name": "Intouch Holdings Public Company Limited",
        "summary": "Intouch Holdings Public Company Limited, through its subsidiaries, engages in the satellite, Internet, telecommunications, and media and advertising businesses. It operates through Local Wireless Telecommunications, Satellite and International Businesses, and Other Businesses segments. The company offers transponder rental and related services for domestic and international communications; broadband content services; advertising services; Internet data center, Internet, satellite uplink-downlink, and telecommunication services;, sale and service related to media, telephone network, mobile content, and engineering development services on communication technology and electronics. It also sells user terminals of IPSTAR and direct television equipment. In addition, the company offers computer program and related services, as well as information technology services; and trades in and rents telecommunications equipment and accessories. It has operations in Thailand, the People's Republic of China, India, Japan, Myanmar, and internationally. The company was formerly known as Shin Corporation Public Company Limited and changed its name to Intouch Holdings Public Company Limited in March 2014. Intouch Holdings Public Company Limited was founded in 1983 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "ITEL-R.BK": {
        "short_name": "INTERLINK TELECOM PUBLIC COMPAN",
        "long_name": "Interlink Telecom Public Company Limited",
        "summary": "Interlink Telecom Public Company Limited provides telecommunication services through fiber optic network in Thailand. The company offers various services, such as interlink dark fiber, interlink wavelength, interlink international personal leased circuits, and interlink multi-protocol label switching based Internet protocol virtual private network services, as well as broadcast services. It also provides date center services, including co-location, virtual server, and disaster recovery services. The company was founded in 2007 and is headquartered in Bangkok, Thailand. Interlink Telecom Public Company Limited is a subsidiary of Interlink Communication Public Company Limited.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "ITEL.BK": {
        "short_name": "INTERLINK TELECOM PUBLIC COMPAN",
        "long_name": "Interlink Telecom Public Company Limited",
        "summary": "Interlink Telecom Public Company Limited provides telecommunication services through fiber optic network in Thailand. The company offers various services, such as interlink dark fiber, interlink wavelength, interlink international personal leased circuits, and interlink multi-protocol label switching based Internet protocol virtual private network services, as well as broadcast services. It also provides date center services, including co-location, virtual server, and disaster recovery services. The company was founded in 2007 and is headquartered in Bangkok, Thailand. Interlink Telecom Public Company Limited is a subsidiary of Interlink Communication Public Company Limited.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "JAS-R.BK": {
        "short_name": "JASMINE INTERNATIONAL PUBLIC CO",
        "long_name": "Jasmine International Public Company Limited",
        "summary": "Jasmine International Public Company Limited provides telecommunications services to individual and corporate clients in Thailand. The company provides high-speed connectivity; Internet services and applications; and software development, distribution, and general software services, including software system that supports value added services for broadband Internet business. It also offers marine and submarine optical fiber maintenance services; international private leased-circuit, Internet protocol virtual private network services, leased line Internet services, managed network services via optic fiber and copper cable networks, National Internet Exchange services, and co-location services and satellite communications. In addition, the company provides data center services; BranchConnext via asymmetric digital subscriber line; very high bit rate digital subscriber line; FTTx and 4G; Voice over Internet Protocol; electronic data interchange; and international calling cards; and consultancy, design, and sourcing for IP solutions. Further, it offers wireless communication services via very small aperture terminal; distributes network equipment and optical power meters; offers Internet and international calling services; and provides satellite phone services, and small mobile handset and fixed handset for users to use the service from a fixed indoor location in a remote area. Additionally, the company engages in system integration, equipment sourcing, system design, and network implementation for government and private sectors; cloud computing; the consultancy, design, and implementation of computer and IT network systems; the provision of space rental services; and investing in telecommunications infrastructure business, other assets, securities, and/or instruments. Jasmine International Public Company Limited was founded in 1982 and is headquartered in Nonthaburi, Thailand.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Nonthaburi"
    },
    "JAS.BK": {
        "short_name": "JASMINE INTERNATIONAL PUBLIC CO",
        "long_name": "Jasmine International Public Company Limited",
        "summary": "Jasmine International Public Company Limited provides telecommunications services to individual and corporate clients in Thailand. The company provides high-speed connectivity; Internet services and applications; and software development, distribution, and general software services, including software system that supports value added services for broadband Internet business. It also offers marine and submarine optical fiber maintenance services; international private leased-circuit, Internet protocol virtual private network services, leased line Internet services, managed network services via optic fiber and copper cable networks, National Internet Exchange services, and co-location services and satellite communications. In addition, the company provides data center services; BranchConnext via asymmetric digital subscriber line; very high bit rate digital subscriber line; FTTx and 4G; Voice over Internet Protocol; electronic data interchange; and international calling cards; and consultancy, design, and sourcing for IP solutions. Further, it offers wireless communication services via very small aperture terminal; distributes network equipment and optical power meters; offers Internet and international calling services; and provides satellite phone services, and small mobile handset and fixed handset for users to use the service from a fixed indoor location in a remote area. Additionally, the company engages in system integration, equipment sourcing, system design, and network implementation for government and private sectors; cloud computing; the consultancy, design, and implementation of computer and IT network systems; the provision of space rental services; and investing in telecommunications infrastructure business, other assets, securities, and/or instruments. Jasmine International Public Company Limited was founded in 1982 and is headquartered in Nonthaburi, Thailand.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Nonthaburi"
    },
    "JASN.F": {
        "short_name": "JASMINE INTL FGN  BA-,50",
        "long_name": "Jasmine International Public Company Limited",
        "summary": "Jasmine International Public Company Limited provides telecommunications services to individual and corporate clients in Thailand. The company provides high-speed connectivity; Internet services and applications; and software development, distribution, and general software services, including software system that supports value added services for broadband Internet business. It also offers marine and submarine optical fiber maintenance services; international private leased-circuit, Internet protocol virtual private network services, leased line Internet services, managed network services via optic fiber and copper cable networks, National Internet Exchange services, and co-location services and satellite communications. In addition, the company provides data center services; BranchConnext via asymmetric digital subscriber line; very high bit rate digital subscriber line; FTTx and 4G; Voice over Internet Protocol; electronic data interchange; and international calling cards; and consultancy, design, and sourcing for IP solutions. Further, it offers wireless communication services via very small aperture terminal; distributes network equipment and optical power meters; offers Internet and international calling services; and provides satellite phone services, and small mobile handset and fixed handset for users to use the service from a fixed indoor location in a remote area. Additionally, the company engages in system integration, equipment sourcing, system design, and network implementation for government and private sectors; cloud computing; the consultancy, design, and implementation of computer and IT network systems; the provision of space rental services; and investing in telecommunications infrastructure business, other assets, securities, and/or instruments. Jasmine International Public Company Limited was founded in 1982 and is headquartered in Nonthaburi, Thailand.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Nonthaburi"
    },
    "JTS-R.BK": {
        "short_name": "JASMINE TELECOM SYSTEMS PUBLIC ",
        "long_name": "Jasmine Telecom Systems Public Company Limited",
        "summary": "Jasmine Telecom Systems Public Company Limited engages in the design and installation of telecommunication systems, and telecom service and other businesses in Thailand. It is involved in information and communication technology system integration, computer systems integration, WiFi system design and implementation, smart building system design and implementation, and LAN and fiber optic installation services. The company also offers cloud computing services, such as infrastructure-as-a-service and software-as-a-service via internet network. In addition, it is involved in the distribution of telecommunications equipment; development of software applications; and maintenance service for computer hardware and other peripheral equipment. The company serves customers in the government and private sectors. Jasmine Telecom Systems Public Company Limited has a strategic collaboration agreement with KT Corporation for the operation of the data center and cloud service business. The company was founded in 1995 and is headquartered in Nonthaburi, Thailand.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Nonthaburi"
    },
    "JTS.BK": {
        "short_name": "JASMINE TELECOM SYSTEMS PUBLIC ",
        "long_name": "Jasmine Telecom Systems Public Company Limited",
        "summary": "Jasmine Telecom Systems Public Company Limited engages in the design and installation of telecommunication systems, and telecom service and other businesses in Thailand. It is involved in information and communication technology system integration, computer systems integration, WiFi system design and implementation, smart building system design and implementation, and LAN and fiber optic installation services. The company also offers cloud computing services, such as infrastructure-as-a-service and software-as-a-service via internet network. In addition, it is involved in the distribution of telecommunications equipment; development of software applications; and maintenance service for computer hardware and other peripheral equipment. The company serves customers in the government and private sectors. Jasmine Telecom Systems Public Company Limited has a strategic collaboration agreement with KT Corporation for the operation of the data center and cloud service business. The company was founded in 1995 and is headquartered in Nonthaburi, Thailand.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Nonthaburi"
    },
    "NVAA.F": {
        "short_name": "ADV.INFO SERV.-NVDR- BA 1",
        "long_name": "Advanced Info Service Public Company Limited",
        "summary": "Advanced Info Service Public Company Limited operates as a mobile phone network company primarily in Thailand. The company operates through three segments: Mobile Phone Services, Mobile Phone and Equipment Sales, and Datanet and Broadband Services. It is involved in the operation of cellular telephone networks in the frequency of 900 MHz; and in 2.1 GHz and 1800 MHz frequencies. The company also imports and distributes handsets and accessories, as well as distributes cash cards; and provides online data communications services through telephone landlines and optical fiber, as well as electronic payment services. In addition, it provides international telephone service, broadcasting network, and television broadcasting services for various channels, as well as insurance brokerage services. Further, the company offers IT, content aggregator, and billing and collection outsourcing services; call center services; and land and building rental services, as well as related facilities. Additionally, it provides Internet data center, and Internet and satellite uplink-downlink services for communications; and distributes Internet equipment; publishes business telephone directories and advertising; offers mobile contents; and provides online advertising services. Advanced Info Service Public Company Limited was founded in 1989 and is based in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "NVAN.F": {
        "short_name": "TRUE CORP. -NVDR-  BA 4",
        "long_name": "True Corporation Public Company Limited",
        "summary": "True Corporation Public Company Limited, together with its subsidiaries, engages in the telecommunications and diversified communications industries in Thailand. The company operates through TrueMove H, TrueOnline, and TrueVisions segments. It offers telephone, mobile, broadband Internet, Wi-Fi, and television and digital platforms. The company is also involved in entertainment, mobile equipment lessor, program production, non-government telecommunication, artist management and related, and marketing management activities. In addition, it operates news channel; and provides business solutions, online digital media services on website and telecommunication devices, distribution center services, consultancy and management services related to logistics, advertising sale and agency services, wireless telecommunication services, football club and related activities management services. Further, the company operates as a content provider; produces and distributes movie films; designs, develops, produces, and sells software products; and offers hospitality technology, as well as business process outsourcing services in technical service, marketing, and customer relations. The company was formerly known as TelecomAsia Corporation Public Company Limited and changed its name to True Corporation Public Company Limited in April 2004. True Corporation Public Company Limited was founded in 1990 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "NVAY.SG": {
        "short_name": "Jasmine International PCL Reg. ",
        "long_name": "Jasmine International Public Company Limited",
        "summary": "Jasmine International Public Company Limited provides telecommunications services to individual and corporate clients in Thailand. The company provides high-speed connectivity; Internet services and applications; and software development, distribution, and general software services, including software system that supports value added services for broadband Internet business. It also offers marine and submarine optical fiber maintenance services; international private leased-circuit, Internet protocol virtual private network services, leased line Internet services, managed network services via optic fiber and copper cable networks, National Internet Exchange services, and co-location services and satellite communications. In addition, the company provides data center services; BranchConnext via asymmetric digital subscriber line; very high bit rate digital subscriber line; FTTx and 4G; Voice over Internet Protocol; electronic data interchange; and international calling cards; and consultancy, design, and sourcing for IP solutions. Further, it offers wireless communication services via very small aperture terminal; distributes network equipment and optical power meters; offers Internet and international calling services; and provides satellite phone services, and small mobile handset and fixed handset for users to use the service from a fixed indoor location in a remote area. Additionally, the company engages in system integration, equipment sourcing, system design, and network implementation for government and private sectors; cloud computing; the consultancy, design, and implementation of computer and IT network systems; the provision of space rental services; and investing in telecommunications infrastructure business, other assets, securities, and/or instruments. Jasmine International Public Company Limited was founded in 1982 and is headquartered in Nonthaburi, Thailand.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Nonthaburi"
    },
    "SAMART-R.BK": {
        "short_name": "SAMART CORPORATION PUBLIC COMPA",
        "long_name": "Samart Corporation Public Company Limited",
        "summary": "Samart Corporation Public Company Limited designs and installs telecommunications systems, and sells telecommunications equipment in Thailand, Cambodia, and internationally. It operates through ICT Solution and Service, Digital, Call Center, Utilities and Transportations, and Technology Related Services segments. The ICT Solution and Service segment offers solutions and services in information and communication technology, including network solutions; and consulting, system design, installation and implementation, and operation and maintenance solutions and services for clients in the government and private sectors. The Digital segment provides integrated services in digital network, solution, and content. The Call Center segment offers outsourced contact center and customer management services, and turnkey total solutions, as well as digital service innovation and debt collection services; and operates a training institute. The Utilities and Transportations segment provides air traffic control services; supplies electricity in Cambodia; and offers construction design and installation services of electrical power transmission systems. The Technology Related Services segment manufactures and distributes television, and radio antennas and satellite dishes; and distributes, installs, and maintains communication and security systems. The company also provides broadcast network and system integrator services; distributes communication and electronic equipment; offers wire and wireless communication systems, nuclear technology services, and radiation for commercial purposes; leases freehold land; and invests in public utilities in the Indochina region. In addition, it provides engineering, procurement, and construction contractor, as well as maintenance services; and traffic control, electricity transportation, public rural telephone, TV media, and sport license and related services. The company was founded in 1955 and is headquartered in Nonthaburi, Thailand.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Nonthaburi"
    },
    "SAMART.BK": {
        "short_name": "SAMART CORPORATION PUBLIC COMPA",
        "long_name": "Samart Corporation Public Company Limited",
        "summary": "Samart Corporation Public Company Limited designs and installs telecommunications systems, and sells telecommunications equipment in Thailand, Cambodia, and internationally. It operates through ICT Solution and Service, Digital, Call Center, Utilities and Transportations, and Technology Related Services segments. The ICT Solution and Service segment offers solutions and services in information and communication technology, including network solutions; and consulting, system design, installation and implementation, and operation and maintenance solutions and services for clients in the government and private sectors. The Digital segment provides integrated services in digital network, solution, and content. The Call Center segment offers outsourced contact center and customer management services, and turnkey total solutions, as well as digital service innovation and debt collection services; and operates a training institute. The Utilities and Transportations segment provides air traffic control services; supplies electricity in Cambodia; and offers construction design and installation services of electrical power transmission systems. The Technology Related Services segment manufactures and distributes television, and radio antennas and satellite dishes; and distributes, installs, and maintains communication and security systems. The company also provides broadcast network and system integrator services; distributes communication and electronic equipment; offers wire and wireless communication systems, nuclear technology services, and radiation for commercial purposes; leases freehold land; and invests in public utilities in the Indochina region. In addition, it provides engineering, procurement, and construction contractor, as well as maintenance services; and traffic control, electricity transportation, public rural telephone, TV media, and sport license and related services. The company was founded in 1955 and is headquartered in Nonthaburi, Thailand.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Nonthaburi"
    },
    "SAMTEL-R.BK": {
        "short_name": "SAMART TELCOMS PUBLIC COMPANY L",
        "long_name": "Samart Telcoms Public Company Limited",
        "summary": "Samart Telcoms Public Company Limited engages in the fully-integrated telecommunications, communication network, and information technology businesses in Thailand. It operates through three segments: Network Infrastructure Solutions, Enhanced Technology Solutions, and Business Application. The Network Infrastructure Solutions segment provides advanced solutions and services for telecommunications and data communication networks comprising consultation, survey, design, installation and implementation, and system management services, as well as professional maintenance services for wired and wireless networks, including core networks, access networks, and network equipment and end devices; and various communications services through high-speed networks and satellite communications. The Enhanced Technology Solutions segment offers solutions, such as consultation, engineering design and software development to installation, project management, management, and maintenance services for information technology systems comprising advanced systems customization. The Business Application segment provides advanced software application services that enhance the operations of corporate and public sector clients. It is also involved in the repair and maintenance of systems; electronic fund transfer; electronic data interchange; provision of internet services; e-learning software development consultation; cyber security; and design and installation of enterprise resource planning (ERP) system and fully integrate ERP solution for government and public sectors. The company was founded in 1986 and is headquartered in Pak Kret, Thailand. Samart Telcoms Public Company Limited is a subsidiary of Samart Corporation Public Company Limited.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Pak Kret"
    },
    "SAMTEL.BK": {
        "short_name": "SAMART TELCOMS PUBLIC COMPANY L",
        "long_name": "Samart Telcoms Public Company Limited",
        "summary": "Samart Telcoms Public Company Limited engages in the fully-integrated telecommunications, communication network, and information technology businesses in Thailand. It operates through three segments: Network Infrastructure Solutions, Enhanced Technology Solutions, and Business Application. The Network Infrastructure Solutions segment provides advanced solutions and services for telecommunications and data communication networks comprising consultation, survey, design, installation and implementation, and system management services, as well as professional maintenance services for wired and wireless networks, including core networks, access networks, and network equipment and end devices; and various communications services through high-speed networks and satellite communications. The Enhanced Technology Solutions segment offers solutions, such as consultation, engineering design and software development to installation, project management, management, and maintenance services for information technology systems comprising advanced systems customization. The Business Application segment provides advanced software application services that enhance the operations of corporate and public sector clients. It is also involved in the repair and maintenance of systems; electronic fund transfer; electronic data interchange; provision of internet services; e-learning software development consultation; cyber security; and design and installation of enterprise resource planning (ERP) system and fully integrate ERP solution for government and public sectors. The company was founded in 1986 and is headquartered in Pak Kret, Thailand. Samart Telcoms Public Company Limited is a subsidiary of Samart Corporation Public Company Limited.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Pak Kret"
    },
    "SDC-R.BK": {
        "short_name": "SAMART DIGITAL PUBLIC COMPANY L",
        "long_name": "Samart Digital Public Company Limited",
        "summary": "Samart Digital Public Company Limited, together with its subsidiaries, distributes communications and electronics equipment in Thailand and internationally. The company operates in two segments, Mobile and Non-Mobile. The Mobile segment distributes mobile phones bundling with contents under the i-mobile and other brands; and provides retail and wholesale 3G services. The Non-Mobile segment offers voice, audiovisual or multimedia, and infotainment services through mobile phones; content services through multimedia channels; multimedia and interactive media services; Website services; and entertainment services, as well as produces television and radio programs, printed media, and billboards. The company also provides real estate agency, space rental, and other services. The company was formerly known as Samart I-Mobile Public Company Limited and changed its name to Samart Digital Public Company Limited in October 2017. The company was founded in 1995 and is based in Nonthaburi, Thailand. Samart Digital Public Company Limited is a subsidiary of Samart Corporation Public Company Limited.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Nonthaburi"
    },
    "SDC.BK": {
        "short_name": "SAMART DIGITAL PUBLIC COMPANY L",
        "long_name": "Samart Digital Public Company Limited",
        "summary": "Samart Digital Public Company Limited, together with its subsidiaries, distributes communications and electronics equipment in Thailand and internationally. The company operates in two segments, Mobile and Non-Mobile. The Mobile segment distributes mobile phones bundling with contents under the i-mobile and other brands; and provides retail and wholesale 3G services. The Non-Mobile segment offers voice, audiovisual or multimedia, and infotainment services through mobile phones; content services through multimedia channels; multimedia and interactive media services; Website services; and entertainment services, as well as produces television and radio programs, printed media, and billboards. The company also provides real estate agency, space rental, and other services. The company was formerly known as Samart I-Mobile Public Company Limited and changed its name to Samart Digital Public Company Limited in October 2017. The company was founded in 1995 and is based in Nonthaburi, Thailand. Samart Digital Public Company Limited is a subsidiary of Samart Corporation Public Company Limited.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Nonthaburi"
    },
    "SWTF.F": {
        "short_name": "INTOUCH HLDGS -FGN.-BA 1",
        "long_name": "Intouch Holdings Public Company Limited",
        "summary": "Intouch Holdings Public Company Limited, through its subsidiaries, engages in the satellite, Internet, telecommunications, and media and advertising businesses. It operates through Local Wireless Telecommunications, Satellite and International Businesses, and Other Businesses segments. The company offers transponder rental and related services for domestic and international communications; broadband content services; advertising services; Internet data center, Internet, satellite uplink-downlink, and telecommunication services;, sale and service related to media, telephone network, mobile content, and engineering development services on communication technology and electronics. It also sells user terminals of IPSTAR and direct television equipment. In addition, the company offers computer program and related services, as well as information technology services; and trades in and rents telecommunications equipment and accessories. It has operations in Thailand, the People's Republic of China, India, Japan, Myanmar, and internationally. The company was formerly known as Shin Corporation Public Company Limited and changed its name to Intouch Holdings Public Company Limited in March 2014. Intouch Holdings Public Company Limited was founded in 1983 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SYMC-R.BK": {
        "short_name": "SYMPHONY COMMUNICATION PUBLIC C",
        "long_name": "Symphony Communication Public Company Limited",
        "summary": "Symphony Communication Public Company Limited provides communication high-speed circuit services in Thailand, the Southeast Asian countries, and internationally. The company operates in two segments, Render of Communication High Speed Circuit Services and Network Equipment Services. Its services include metro Ethernet, a high-speed network service using fiber optical Ethernet technology to support data transmissions; ready Ethernet, an Ethernet service for customers in commercial buildings in Bangkok metropolitan area; and time division multiplexing (TDM) transmission technology, a type of multiplexing that combines data streams by assigning each stream a different time slot in a set. The company also offers synchronous digital hierarchy, a high-speed circuit for sending and receiving high speed digital data from TDM technology; Ethernet over synchronous digital hierarchy, a high-speed circuit that provides data transmission through Ethernet connection; and dark fiber, which offers data transmission service through fiber optic to customers that require management and control over internal data transmission within division. In addition, it provides international private leased circuit service for multinational organizations to connect with other counties, as well as with international leased circuit and digital broadcasting providers of TV satellite; virtual private network services; and international Internet gateway and IP transit services, which are internet data communications services for connecting with Internet service providers. Further, the company offers cloud direct connect solution, a service connection from the client's office directly to the cloud service providers instead of using only the internet connection; and submarine cable system, as well as preventive maintenance and installation services of network equipment. Symphony Communication Public Company Limited was founded in 2005 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SYMC.BK": {
        "short_name": "SYMPHONY COMMUNICATION PUBLIC C",
        "long_name": "Symphony Communication Public Company Limited",
        "summary": "Symphony Communication Public Company Limited provides communication high-speed circuit services in Thailand, the Southeast Asian countries, and internationally. The company operates in two segments, Render of Communication High Speed Circuit Services and Network Equipment Services. Its services include metro Ethernet, a high-speed network service using fiber optical Ethernet technology to support data transmissions; ready Ethernet, an Ethernet service for customers in commercial buildings in Bangkok metropolitan area; and time division multiplexing (TDM) transmission technology, a type of multiplexing that combines data streams by assigning each stream a different time slot in a set. The company also offers synchronous digital hierarchy, a high-speed circuit for sending and receiving high speed digital data from TDM technology; Ethernet over synchronous digital hierarchy, a high-speed circuit that provides data transmission through Ethernet connection; and dark fiber, which offers data transmission service through fiber optic to customers that require management and control over internal data transmission within division. In addition, it provides international private leased circuit service for multinational organizations to connect with other counties, as well as with international leased circuit and digital broadcasting providers of TV satellite; virtual private network services; and international Internet gateway and IP transit services, which are internet data communications services for connecting with Internet service providers. Further, the company offers cloud direct connect solution, a service connection from the client's office directly to the cloud service providers instead of using only the internet connection; and submarine cable system, as well as preventive maintenance and installation services of network equipment. Symphony Communication Public Company Limited was founded in 2005 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "TACYY": {
        "short_name": "TOTAL ACCESS COMMUNICATIONS",
        "long_name": "Total Access Communication Public Company Limited",
        "summary": "Total Access Communication Public Company Limited, together with its subsidiaries, primarily provides wireless telecommunications services in Thailand. The company operates in two segments, Mobile Telephone Service and Related Services; and Sales of Handsets and Starter Kits. It primarily offers its services in 800 MHz and 1800 MHz frequency bands. The company also provides asset management services; online payment services; and telecommunication equipment lease and device services. Total Access Communication Public Company Limited was founded in 1989 and is based in Bangkok, Thailand.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "TAFG.F": {
        "short_name": "TRUE CORP.PCL -FGN-  BA 4",
        "long_name": "True Corporation Public Company Limited",
        "summary": "True Corporation Public Company Limited, together with its subsidiaries, engages in the telecommunications and diversified communications industries in Thailand. The company operates through TrueMove H, TrueOnline, and TrueVisions segments. It offers telephone, mobile, broadband Internet, Wi-Fi, and television and digital platforms. The company is also involved in entertainment, mobile equipment lessor, program production, non-government telecommunication, artist management and related, and marketing management activities. In addition, it operates news channel; and provides business solutions, online digital media services on website and telecommunication devices, distribution center services, consultancy and management services related to logistics, advertising sale and agency services, wireless telecommunication services, football club and related activities management services. Further, the company operates as a content provider; produces and distributes movie films; designs, develops, produces, and sells software products; and offers hospitality technology, as well as business process outsourcing services in technical service, marketing, and customer relations. The company was formerly known as TelecomAsia Corporation Public Company Limited and changed its name to True Corporation Public Company Limited in April 2004. True Corporation Public Company Limited was founded in 1990 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "TDZ2.SG": {
        "short_name": "Samart Digital PCL Reg. Shares ",
        "long_name": "Samart Digital Public Company Limited",
        "summary": "Samart Digital Public Company Limited, together with its subsidiaries, distributes communications and electronics equipment in Thailand and internationally. The company operates in two segments, Mobile and Non-Mobile. The Mobile segment distributes mobile phones bundling with contents under the i-mobile and other brands; and provides retail and wholesale 3G services. The Non-Mobile segment offers voice, audiovisual or multimedia, and infotainment services through mobile phones; content services through multimedia channels; multimedia and interactive media services; Website services; and entertainment services, as well as produces television and radio programs, printed media, and billboards. The company also provides real estate agency, space rental, and other services. The company was formerly known as Samart I-Mobile Public Company Limited and changed its name to Samart Digital Public Company Limited in October 2017. The company was founded in 1995 and is based in Nonthaburi, Thailand. Samart Digital Public Company Limited is a subsidiary of Samart Corporation Public Company Limited.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Nonthaburi"
    },
    "TRUE-R.BK": {
        "short_name": "TRUE CORPORATION PUBLIC COMPANY",
        "long_name": "True Corporation Public Company Limited",
        "summary": "True Corporation Public Company Limited, together with its subsidiaries, engages in the telecommunications and diversified communications industries in Thailand. The company operates through TrueMove H, TrueOnline, and TrueVisions segments. It offers telephone, mobile, broadband Internet, Wi-Fi, and television and digital platforms. The company is also involved in entertainment, mobile equipment lessor, program production, non-government telecommunication, artist management and related, and marketing management activities. In addition, it operates news channel; and provides business solutions, online digital media services on website and telecommunication devices, distribution center services, consultancy and management services related to logistics, advertising sale and agency services, wireless telecommunication services, football club and related activities management services. Further, the company operates as a content provider; produces and distributes movie films; designs, develops, produces, and sells software products; and offers hospitality technology, as well as business process outsourcing services in technical service, marketing, and customer relations. The company was formerly known as TelecomAsia Corporation Public Company Limited and changed its name to True Corporation Public Company Limited in April 2004. True Corporation Public Company Limited was founded in 1990 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    }
}