{
    "ALDOL.PA": {
        "short_name": "DOLFINES",
        "long_name": "Dietswell S.A.",
        "summary": "Dietswell S.A. provides onshore and offshore drilling solutions to the energy industry worldwide. It offers design and engineering, inspections and QHSE audit, technical assistance, and drilling operations management services. The company designs various aspects of the processes related to onshore and offshore engineering; and provides well engineering services. It also offers independent third party rig inspection, technical audit, and commissioning services in order to assist oil and gas operators and drilling contractors. In addition, the company is involved in the operation of onshore and offshore drilling units, such as land rigs, platform rigs, swamp barges, jack ups, TAD, semi-submersible rigs, and drill ships. Further, it offers human resource services, including French and international contracts comprising legal, payroll, and back-office support services, as well as travel, medical, and healthcare insurance services; logistics services comprising mobilization services, travel logistics, local visas and work permit, and onsite assistance; and sourcing services consisting of pre-employment background check, advertisement, job interview, selection, and sourcing using network of consultants, as well as CVs databases. Additionally, the company provides legal services, including risk management, local content compliance, fiscal optimization, and notice period management; training and medical services, such as QHSE awareness training, performance score card and improvement plan, and personnel training development and implementation through certified training centers; and rig management and maintenance, drilling operations, and rig stacking/restart/revamping program services. Dietswell S.A. was founded in 2000 and is headquartered in Guyancourt, France.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductor - Broad Line",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Guyancourt"
    }
}