{
    "ATCLF": {
        "short_name": "ADVANCETC LTD",
        "long_name": "AdvanceTC Limited",
        "summary": "AdvanceTC Limited designs, develops, and commercializes mobile wireless computing and telecommunication devices worldwide. The company offers mobile computing devices with integrated telephony, voice calling, SMS/MMS/IM, VOIP, and video conferencing capabilities under the MAGIC brand; and a Windows OS microcomputer integrated with cellular telephony capabilities. It also provides software and applications services; and Xplore X7, a satellite smartphone. The company was incorporated in 2005 and is based in Sydney, Australia.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://advancetc.com",
        "full_time_employees": null
    },
    "BCC.AX": {
        "short_name": "BEAM COMS FPO",
        "long_name": "Beam Communications Holdings Limited",
        "summary": "Beam Communications Holdings Limited designs, develops, manufactures, sells, and distributes a range of satellite communication terminals, docking units, and handheld phone accessories. It also offers push-to-talk products, modems, antennas, and cables; gateways and cellular antennas; and data airtime services. The company sells its products through SatPhone Shop, an online retail store. It operates in Australia, the United States, the United Arab Emirates, the United Kingdom, China, Canada, Japan, and internationally. The company was formerly known as World Reach Limited and changed its name to Beam Communications Holdings Limited in November 2018. Beam Communications Holdings Limited was incorporated in 1985 and is based in Mulgrave, Australia.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Mulgrave",
        "zipcode": "3170",
        "website": "http://www.beamcommunications.com",
        "full_time_employees": null
    },
    "MOB.AX": {
        "short_name": "MOBILICOM FPO",
        "long_name": "Mobilicom Limited",
        "summary": "Mobilicom Limited, a hi-tech company, designs, develops, and delivers various communication solutions for mission critical and remote mobile private networks. The company provides holistic solutions and equipment that cater to mission-critical communication in the government and enterprise sector, with applications in unmanned platforms; disaster relief and public safety; and offshore and remote areas. It also offers end -to-end equipment hardware and software solutions, as well as integration, and support services for the commercial and industrial drone and robotics manufacturers, including communication, video processing and analytics, software tools, and others. Mobilicom Limited was incorporated in 2017 and is based in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://www.mobilicom-ltd.com.au",
        "full_time_employees": null
    },
    "NUH.AX": {
        "short_name": "NUHEARA FPO",
        "long_name": "Nuheara Limited",
        "summary": "Nuheara Limited, an audio wearables company, engages in the development and commercialization of hearing and wearables technology platforms worldwide. The company offers IQbuds2 MAX, a hearing bud; IQbuds BOOST, a wireless earbuds; QstreamTV; and Bluetooth transmitter products. Nuheara Limited was incorporated in 2007 and is headquartered in Perth, Australia.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6003",
        "website": "http://www.nuheara.com",
        "full_time_employees": null
    },
    "NUHRF": {
        "short_name": "NUHEARA LTD",
        "long_name": "Nuheara Limited",
        "summary": "Nuheara Limited, an audio wearables company, engages in the development and commercialization of hearing and wearables technology platforms worldwide. The company offers IQbuds2 MAX, a hearing bud; IQbuds BOOST, a wireless earbuds; QstreamTV; and Bluetooth transmitter products. Nuheara Limited was incorporated in 2007 and is headquartered in Perth, Australia.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6003",
        "website": "http://www.nuheara.com",
        "full_time_employees": null
    }
}