{
    "DPSM": {
        "short_name": "3D PIONEER SYSTEMS INC",
        "long_name": "3D Pioneer Systems Inc.",
        "summary": "3D Pioneer Systems Inc. does not have significant business. It intends to merge with another entity with experienced management and opportunities for growth in return for shares of our common stock. The company was incorporated in 2008 and is based in Melbourne, Victoria.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "DRH.F": {
        "short_name": "DRONESHIELD LTD",
        "long_name": "DroneShield Limited",
        "summary": "DroneShield Limited engages in the development, commercialization, and sale of hardware and software technology for drone detection and security in the United States, the United Kingdom, Australia, and internationally. The company's drone security solutions protect people, organizations, and critical infrastructures from the intrusion of drones. Its products include DroneGun Tactical, a countermeasure against a range of drone models; DroneGun MkIII, a compact drone countermeasure; DroneSentinel, an ideal detection solution in any environment facing UAS threats; DroneSentry that integrates company's suite of sensors and countermeasures in a unified platform deployable in permanent or temporary installations; and DroneCannon RW, a counterdrone defeat solution. The company also offers DroneNode, a covert counter-drone defense solution; DroneCannon RW, a drone jamming solution for use on remote weapon stations; DroneSentry-X, a vehicle mounted detect and defeat device; and DroneShield Complete, a real time monitoring solution for local drone activity; as well as RfPatrol and RfZero, which are drone detection devices. Its products are used by defense agencies; airports and other civil defense users; utilities, such as power plants, electricity grids, and gas pipelines; ports and other critical infrastructure asset owners; intelligence and national security agencies; prisons; stadiums and other public event venues and organizers; media production sites; real estate owners, including hotels, commercial offices, and manufacturing plants; and ultra-high net worth individuals and government officials. The company sells its products through third party distributors, as well as direct relationships with various customers. DroneShield Limited was founded in 2014 and is headquartered in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "QFY.AX": {
        "short_name": "QUANTIFY FPO",
        "long_name": "Quantify Technology Holdings Limited",
        "summary": "Quantify Technology Holdings Limited develops and sells hardware and software devices for the monitoring and management of internet-enabled devices in Australia. The company's hardware and software devices comprise lighting, power, heating, and cooling systems installed in buildings. Its flagship product is the Q Device, which provides real-time evaluation of environmental and risk factors for building occupants, as well as managing services and utilities. The company also offers qDimmer; qPower, an intelligent power point; qBlind, an intelligent blind control; and qBridge auxiliary controller. Quantify Technology Holdings Limited was incorporated in 2005 and is based in Perth, Australia.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Perth"
    }
}