{
    "AD8.AX": {
        "short_name": "AUDINATEGL FPO",
        "long_name": "Audinate Group Limited",
        "summary": "Audinate Group Limited develops and sells digital audio visual networking solutions worldwide. It offers Dante Controller, a software application that enables users to route audio and configure devices on a Dante network; Dante Virtual Soundcard, which turns the computer into a Dante-powered workstation and integrating the PC or Mac with Dante audio devices on the user network; Dante Via, an easy-to-use software that delivers unprecedented multi-channel routing of computer-based audio; Dante Embedded Platform, a software used in AV-over-IP solutions; and Dante Domain Manager, a network management that enables user authentication, role-based security, and audit capabilities for Dante networks. The company also provides Dante Brooklyn II networking solutions; Dante Application Library, which delivers Dante Virtual Soundcard directly to user Windows and MacOS audio applications; Dante Brooklyn II PDK, a product development kits; Dante Broadway, a chip that delivers Dante networking for medium channel-count applications; Dante Ultimo, a chip for low channel-count applications; Dante Ultimo PDK, a Ultimo development platform that includes hardware, software, documentation, and technical support packages; Dante PCIe-R Soundcard for recording solutions and audio processing; Dante HC, a network audio solution for professional AV systems; Dante Adapter Modules, which enables development of professional audio products; Dante AV, an AV-over-IP transport and management solutions; and Dante IP Core, a soft IP solutions, as well as Dante AVIO adapters and Dante-enabled products. It primarily serves original equipment manufacturers. The company was founded in 2003 and is based in Surry Hills, Australia.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Surry Hills",
        "zipcode": "2010",
        "website": "http://www.audinate.com",
        "market_cap": "Small Cap"
    },
    "AUDGF": {
        "short_name": "AUDINATE GROUP LIMITED",
        "long_name": "Audinate Group Limited",
        "summary": "Audinate Group Limited develops and sells digital audio visual networking solutions worldwide. It offers Dante Controller, a software application that enables users to route audio and configure devices on a Dante network; Dante Virtual Soundcard, which turns the computer into a Dante-powered workstation and integrating the PC or Mac with Dante audio devices on the user network; Dante Via, an easy-to-use software that delivers unprecedented multi-channel routing of computer-based audio; Dante Embedded Platform, a software used in AV-over-IP solutions; and Dante Domain Manager, a network management that enables user authentication, role-based security, and audit capabilities for Dante networks. The company also provides Dante Brooklyn II networking solutions; Dante Application Library, which delivers Dante Virtual Soundcard directly to user Windows and MacOS audio applications; Dante Brooklyn II PDK, a product development kits; Dante Broadway, a chip that delivers Dante networking for medium channel-count applications; Dante Ultimo, a chip for low channel-count applications; Dante Ultimo PDK, a Ultimo development platform that includes hardware, software, documentation, and technical support packages; Dante PCIe-R Soundcard for recording solutions and audio processing; Dante HC, a network audio solution for professional AV systems; Dante Adapter Modules, which enables development of professional audio products; Dante AV, an AV-over-IP transport and management solutions; and Dante IP Core, a soft IP solutions, as well as Dante AVIO adapters and Dante-enabled products. It primarily serves original equipment manufacturers. The company was founded in 2003 and is based in Surry Hills, Australia.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Surry Hills",
        "zipcode": "2010",
        "website": "http://www.audinate.com",
        "market_cap": "Small Cap"
    },
    "CPX.L": {
        "short_name": "CAP-XX LIMITED ORD NPV",
        "long_name": "CAP-XX Limited",
        "summary": "CAP-XX Limited, together with its subsidiaries, develops, manufactures, and sells supercapacitors and energy management systems primarily in the Asia Pacific, Europe, and North America. It offers thin, prismatic, and cylindrical cell supercapacitors, which provides power support for pulsed loads, secure power back-up for mission critical applications, and independent power storage for clean-tech products. The company provides its products for the use in various applications, including commercial and industrial electronics, such as handheld computers, point of sale terminals, telemetry units, and location tracking equipment; consumer handheld devices comprising digital cameras, tablet computers, and mobile phones; and clean energy applications, including energy harvesting and micro-hybrid vehicles. It also offers its products for the use in locks, PDAs, scanners, smart meters, smart watches, health monitoring patches, wearable devices, and wireless sensors, as well as in asset tracking, automotive, battery support, data transmission, solenoid activation, e-ink update, LED flashing, and power backup applications. The company was formerly known as Energy Storage Systems Pty Limited and changed its name to CAP-XX Limited. CAP-XX Limited was founded in 1997 and is headquartered in Seven Hills, Australia.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Seven Hills",
        "zipcode": "2147",
        "website": "http://www.cap-xx.com",
        "market_cap": "Small Cap"
    }
}