{
  "1LK.F": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Link Administration Holdings Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "LINK ADMINISTR. HLDGS.LTD",
    "state": "NSW",
    "summary": "Link Administration Holdings Limited provides technology-enabled administration solutions for companies, large asset owners, and trustees worldwide. The company operates through Retirement & Superannuation Solutions (RSS); Corporate Markets (CM); Banking & Credit Management (BCM); Fund Solutions (FS); and Technology & Operations (T&O) segments. The RSS segment provides core member and employer administration services; and a range of value-added services, including integrated clearing house, financial planning and advice, direct investment options, and trustee services. The CM segment offers shareholder management and analytics, stakeholder engagement, share and unit registry, employee share plans, and company secretarial support services, as well as insolvency solutions. The BCM segment provides loan origination and servicing, debt work-out, compliance, and regulatory oversight services to retail banks, investment banks, private equity funds, and other investors. The FS segment offers fund management, third-party administration, and transfer agency services to asset managers and a?variety of investment funds. The T&O segment provides services for the development and maintenance of proprietary IT systems and platforms; back office support functions; and value-added services of data analytics, digital solutions, and digital communications. The company was founded in 2005 and is headquartered in Sydney, Australia.",
    "website": "http://www.linkgroup.com",
    "zipcode": "2000"
  },
  "2NX.F": {
    "city": "Brisbane",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "NEXTDC Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "NEXTDC LTD",
    "state": "QLD",
    "summary": "NEXTDC Limited provides data center outsourcing solutions, connectivity services, and infrastructure management software in Australia. The company offers cloud connectivity for organizations; data center-as-a-service solutions; universal connectivity solutions; cloud center ecosystems; data-center infrastructure management; and intelligent service management services. It also provides technical assistance on-the-ground; and data center professional services for the infrastructure life cycle, including technical advisory, planning, project management, managing deliveries, and operational infrastructure support. In addition, the company provides data center colocation solutions comprising rack packages for individual or multiple racks; Rack Blocks to share the total power allocation across various racks; and Quarter Racks for smaller footprints. Further, it offers security systems and protocols that include multi-layered access systems with biometric fingerprint technology and ID access cards. Additionally, the company provides ONEDC, a data-center infrastructure management tool, which delivers real-time intelligence across entire NEXTDC data center footprint to manage infrastructure; and AXON virtual interconnectivity platform. NEXTDC Limited was founded in 2010 and is headquartered in Brisbane, Australia.",
    "website": "http://www.nextdc.com",
    "zipcode": "4001"
  },
  "433.F": {
    "city": "Chatswood",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Appen Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "APPEN LTD",
    "state": "NSW",
    "summary": "Appen Limited, together with its subsidiaries, provides data solutions and services for machine learning and artificial intelligence applications for technology companies, auto manufacturers, and government agencies in Australia, the United States, and internationally. It operates through two segments, Relevance and Speech and Image. The Relevance segment offers annotated training data, which is used as an input to enhance the performance of search engines, social media, and e-commerce applications. The Speech and Image segment provides training data that is used to build AI-based voice interface, translation, text analysis, AR/VR, and image perception systems. The company was formerly known as Appen Holdings Pty Limited and changed its name to Appen Limited in October 2014. Appen Limited was founded in 1996 and is headquartered in Chatswood, Australia.",
    "website": "http://www.appen.com",
    "zipcode": "2067"
  },
  "6Y3.F": {
    "city": "Perth",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "GSTechnologies Ltd.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "GS TECHS LTD (DI)",
    "state": "WA",
    "summary": "GSTechnologies Ltd., through its subsidiary, provides integrated information and communication technology (ICT) infrastructure solutions in Australia, Singapore, Malaysia, Hong Kong, India, Taiwan, China, and internationally. It engages in the supply, design, engineering, installation, and maintenance of structured cabling systems, network equipment, power and precision air-conditioner systems, access control and surveillance systems, smart monitoring and control systems, and information display systems. The company also provides wireless communication solutions, Internet of Things, and building services and data centers, as well as integrated access control and surveillance CCTV services. In addition, the company engages in the blockchain business. It serves ICT businesses and multi-national corporations, and education, hospitality, healthcare, energy, government, and financial institutions. The company was formerly known as Golden Saint Technologies Limited and changed its name to GSTechnologies Ltd. in August 2019. GSTechnologies Ltd. is based in Perth, Australia.",
    "website": "http://www.gstechnologies.co.uk",
    "zipcode": "6000"
  },
  "A8Y1.F": {
    "city": "Brisbane",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "EML Payments Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "EML PAYMENTS LTD.",
    "state": "QLD",
    "summary": "EML Payments Limited provides prepaid payment services in Australia, Europe, and North America. Its portfolio of payment solutions offers options for disbursement payouts, gifts, incentives, and rewards, as well as white label payments and banking-as-a-service technology. The company issues mobile, virtual, and physical card solutions for various corporate brands. It serves blue-chip financial institutions, nonfinancial corporates, SMEs, FinTech companies, public sector, and NGO bodies. The company was formerly known as Emerchants Limited and changed its name to EML Payments Limited in November 2016. EML Payments Limited was incorporated in 2003 and is headquartered in Brisbane, Australia.",
    "website": "http://emlpayments.com",
    "zipcode": "4000"
  },
  "APPEF": {
    "city": "Chatswood",
    "country": "Australia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "Appen Limited",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "APPEN LTD",
    "state": "NSW",
    "summary": "Appen Limited, together with its subsidiaries, provides data solutions and services for machine learning and artificial intelligence applications for technology companies, auto manufacturers, and government agencies in Australia, the United States, and internationally. It operates through two segments, Relevance and Speech and Image. The Relevance segment offers annotated training data, which is used as an input to enhance the performance of search engines, social media, and e-commerce applications. The Speech and Image segment provides training data that is used to build AI-based voice interface, translation, text analysis, AR/VR, and image perception systems. The company was formerly known as Appen Holdings Pty Limited and changed its name to Appen Limited in October 2014. Appen Limited was founded in 1996 and is headquartered in Chatswood, Australia.",
    "website": "http://www.appen.com",
    "zipcode": "2067"
  },
  "APX.AX": {
    "city": "Chatswood",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "Appen Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "APPEN FPO",
    "state": "NSW",
    "summary": "Appen Limited, together with its subsidiaries, provides data solutions and services for machine learning and artificial intelligence applications for technology companies, auto manufacturers, and government agencies in Australia, the United States, and internationally. It operates through two segments, Relevance and Speech and Image. The Relevance segment offers annotated training data, which is used as an input to enhance the performance of search engines, social media, and e-commerce applications. The Speech and Image segment provides training data that is used to build AI-based voice interface, translation, text analysis, AR/VR, and image perception systems. The company was formerly known as Appen Holdings Pty Limited and changed its name to Appen Limited in October 2014. Appen Limited was founded in 1996 and is headquartered in Chatswood, Australia.",
    "website": "http://www.appen.com",
    "zipcode": "2067"
  },
  "APXYY": {
    "city": "Chatswood",
    "country": "Australia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "Appen Limited",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "APPEN LTD UNSPON ADS EACH REP 0",
    "state": "NSW",
    "summary": "Appen Limited, together with its subsidiaries, provides data solutions and services for machine learning and artificial intelligence applications for technology companies, auto manufacturers, and government agencies in Australia, the United States, and internationally. It operates through two segments, Relevance and Speech and Image. The Relevance segment offers annotated training data, which is used as an input to enhance the performance of search engines, social media, and e-commerce applications. The Speech and Image segment provides training data that is used to build AI-based voice interface, translation, text analysis, AR/VR, and image perception systems. The company was formerly known as Appen Holdings Pty Limited and changed its name to Appen Limited in October 2014. Appen Limited was founded in 1996 and is headquartered in Chatswood, Australia.",
    "website": "http://www.appen.com",
    "zipcode": "2067"
  },
  "CCA.AX": {
    "city": "Brisbane",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "Change Financial Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "CHANGEFL FPO",
    "state": "QLD",
    "summary": "Change Financial Limited operates as a fintech company in the United States. It provides payment processor and mobile banking services through its mobile application. The company was formerly known as ChimpChange Limited and changed its name to Change Financial Limited in July 2017. Change Financial Limited was founded in 2011 and is based in Brisbane, Australia.",
    "website": "http://www.changefinancial.com",
    "zipcode": "4000"
  },
  "CCG.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "Comms Group Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "COMMS GRP FPO",
    "state": "NSW",
    "summary": "Comms Group Limited engages in the information and communication technology (ICT) business. The company provides hosted voice, data, enterprise networks, and cloud-based communication and communication enablement services to business customers. It offers SD-WAN technology that allows replacing expensive carrier-controlled MPLS networks with a public Internet-based solution; managed mobility services; cloud connect for any business that requires network access to connect to public cloud platforms; and enterprise-grade wireless LAN (WiFi) services. The company also provides global PBX, SIP trunking, wholesale voice, and voice and web conferencing services; and managed, cloud firewall, architect, and delivering services, as well as Microsoft Teams calling services. It serves corporate customers in Australia, New Zealand, Singapore, and internationally. The company was formerly known as CommsChoice Group Limited and changed its name to Comms Group Limited in November 2020. Comms Group Limited was incorporated in 2017 and is headquartered in Sydney, Australia.",
    "website": "http://www.commschoice.com",
    "zipcode": "2000"
  },
  "CCR.AX": {
    "city": "Southbank",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "Credit Clear Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CREDIT CLR FPO",
    "state": "VIC",
    "summary": "Credit Clear Limited, a fin-tech company, develops an online mobile payment platform. It offers receivables management solutions; and debt recovery services, as well as outsourced call handling, overflow assistance, financial hardship management, skip tracing, and field services. The company was incorporated in 2015 and is based in Southbank, Australia.",
    "website": "http://www.creditclear.com.au",
    "zipcode": "3006"
  },
  "CGO.AX": {
    "city": "Docklands",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "CPT Global Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "CPT GLOBAL FPO",
    "state": "VIC",
    "summary": "CPT Global Limited, together with its subsidiaries, provides information technology (IT) consultancy services for federal and state government, banking and finance, insurance, telecommunications, and retail and manufacturing sectors in Australia, Asia, Europe, North America, and South America. The company offers digital consulting, capacity planning, cost reduction, mainframe and midrange performance, project and program management, technical support, and management IT services, as well as management, functional, and automation testing services. It also provides transformation services, including strategic advisory, DevOps and release automation, customer experience, architecture and road mapping, robotic process automation, and workforce efficiency services; and assurance-delivery services, such as capacity planning and forecasting, environment and data management, QA and testing, performance testing, program and project leadership, benefits realization, real time payment systems, and implementation readiness services. In addition, the company offers assurance-operations services comprising IT service management, capacity management, stability and availability, performance monitoring and metrics, operational capability maturity, and business and service continuity services. Further, it provides optimization services, including mainframe optimization and cost reduction, cloud migration and optimization, lifecycle management, legacy migration, performance tuning and engineering, and mainframe modernization services. CPT Global Limited was founded in 1993 and is headquartered in Docklands, Australia.",
    "website": "http://www.cptglobal.com",
    "zipcode": "3008"
  },
  "CMSQF": {
    "city": "Abbotsford",
    "country": "Australia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "Computershare Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "COMPUTERSHARE LTD",
    "state": "VIC",
    "summary": "Computershare Limited provides issuer service, mortgage service, employee equity plans, communication, business, stakeholder relationship management, and technology services in Australia, the United States, the United Kingdom, Canada, Asia, and internationally. The company's issuer services comprise the provision of registry maintenance corporate actions, stakeholder relationship management, corporate governance, and related services; mortgage services and property rental, and tenant bond protection service; employee share plans and voucher services include administration and related services for employee share and option plans, and childcare voucher administration services; and business services comprise the provision of bankruptcy, class action, and corporate trust administration services. Its communication services and utilities operations consist of document composition and printing, intelligent mailing, inbound process automation, scanning, and electronic delivery; and technology services consist of the provision of software in share registry and financial services. The company was founded in 1978 and is based in Abbotsford, Australia.",
    "website": "http://www.computershare.com",
    "zipcode": "3067"
  },
  "CMSQY": {
    "city": "Abbotsford",
    "country": "Australia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "Computershare Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "COMPUTERSHARE LTD",
    "state": "VIC",
    "summary": "Computershare Limited provides issuer service, mortgage service, employee equity plans, communication, business, stakeholder relationship management, and technology services in Australia, the United States, the United Kingdom, Canada, Asia, and internationally. The company's issuer services comprise the provision of registry maintenance corporate actions, stakeholder relationship management, corporate governance, and related services; mortgage services and property rental, and tenant bond protection service; employee share plans and voucher services include administration and related services for employee share and option plans, and childcare voucher administration services; and business services comprise the provision of bankruptcy, class action, and corporate trust administration services. Its communication services and utilities operations consist of document composition and printing, intelligent mailing, inbound process automation, scanning, and electronic delivery; and technology services consist of the provision of software in share registry and financial services. The company was founded in 1978 and is based in Abbotsford, Australia.",
    "website": "http://www.computershare.com",
    "zipcode": "3067"
  },
  "CNGFF": {
    "city": "Brisbane",
    "country": "Australia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "Change Financial Limited",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "CHANGE FINANCIAL LTD",
    "state": "QLD",
    "summary": "Change Financial Limited operates as a fintech company in the United States. It provides payment processor and mobile banking services through its mobile application. The company was formerly known as ChimpChange Limited and changed its name to Change Financial Limited in July 2017. Change Financial Limited was founded in 2011 and is based in Brisbane, Australia.",
    "website": "http://www.changefinancial.com",
    "zipcode": "4000"
  },
  "CNW.AX": {
    "city": "Perth",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "Cirrus Networks Holdings Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "CIRRUS NET FPO",
    "state": "WA",
    "summary": "Cirrus Networks Holdings Limited, together with its subsidiaries, provides information technology (IT) services and related third-party products in Australia. The company offers business and technology consulting services; and integration services, such as connectivity and communications, data center, collaboration, security, infrastructure, and managed services, as well as, project management and people services. Cirrus Networks Holdings Limited was founded in 2003 and is based in Perth, Australia.",
    "website": "http://www.cirrusnetworks.com.au",
    "zipcode": "6000"
  },
  "COS.AX": {
    "city": "Brisbane",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "COSOL Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "COSOL FPO",
    "state": "QLD",
    "summary": "COSOL Limited provides information technology services in Australia. It utilizes proprietary software and services to deliver solutions for clients operating in asset-intensive industries with a focus on resource and capital-intensive enterprise asset management and infrastructure-focused systems. The company also provides digital business solutions, including business process and strategic reviews; legacy data services; and data migration and ongoing support services to clients, as well as implements enterprise resource planning/ enterprise asset management solutions. It serves mining and minerals processing, energy and utilities, public infrastructure and transport, defense, health services, and oil, gas, and petrochemical industries. The company was incorporated in 2019 and is headquartered in Brisbane, Australia.",
    "website": "http://www.cosol.com.au",
    "zipcode": "4000"
  },
  "CPU.AX": {
    "city": "Abbotsford",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "Computershare Limited",
    "market": "au_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "CSHARE FPO",
    "state": "VIC",
    "summary": "Computershare Limited provides issuer service, mortgage service, employee equity plans, communication, business, stakeholder relationship management, and technology services in Australia, the United States, the United Kingdom, Canada, Asia, and internationally. The company's issuer services comprise the provision of registry maintenance corporate actions, stakeholder relationship management, corporate governance, and related services; mortgage services and property rental, and tenant bond protection service; employee share plans and voucher services include administration and related services for employee share and option plans, and childcare voucher administration services; and business services comprise the provision of bankruptcy, class action, and corporate trust administration services. Its communication services and utilities operations consist of document composition and printing, intelligent mailing, inbound process automation, scanning, and electronic delivery; and technology services consist of the provision of software in share registry and financial services. The company was founded in 1978 and is based in Abbotsford, Australia.",
    "website": "http://www.computershare.com",
    "zipcode": "3067"
  },
  "CT1.AX": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "Constellation Technologies Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "CONST TECH FPO",
    "state": "VIC",
    "summary": "Constellation Technologies Limited develops and manages Internet of Things (IoT) products for industry and government applications in Australia. The company's solutions cover cloud, IoT, edge-computing sensors, big data, analytics, machine learning, artificial intelligence, and other technologies. It offers temperature and humidity monitors, sensors, RTD (temperature) and PH value probes, and gateways and interfaces, as well as operations management suites. The company also serves customers in the United States, India, the Middle East, and China. Constellation Technologies Limited was incorporated in 1987 and is based in Melbourne, Australia.",
    "website": "http://www.constellationtechnologies.net",
    "zipcode": "3000"
  },
  "CV1.AX": {
    "city": "Osborne Park",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "CV Check Ltd",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "CV CHECK FPO",
    "state": "WA",
    "summary": "CV Check Ltd, together with its subsidiaries, provides screening and verification check services Australia and New Zealand. The company offers national police checks; employment reference checks; employment and qualification checks; VEVO visa and work entitlement checks; credit, financial, and business checks; traffic and licence checks; and international checks, as well as predictive psychometric assessments services. It provides operates through its online platform. The company has a strategic alliance with Xref Limited. CV Check Ltd was founded in 2004 and is based in Osborne Park, Australia.",
    "website": "http://cvcheck.com",
    "zipcode": "6017"
  },
  "DC2.AX": {
    "city": "Osborne Park",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "DC Two Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "DCTWO FPO",
    "state": "WA",
    "summary": "DC Two Limited owns, builds, and manages cloud computing, hosting and data center services in Australia. It offers data center and cloud hosted services, data center hosting and colocation, data center and cloud automation software, and modular data center and hosting solutions. The company serves mining, exploration, energy, resources, telecommunications, and financial services companies; local governments; schools and law firms; and health organizations. DC Two Limited was founded in 2012 and is based in Osborne Park, Australia.",
    "website": "http://dctwo.com.au",
    "zipcode": "6017"
  },
  "DN9.F": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Douugh Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "DOUUGH LTD",
    "state": "NSW",
    "summary": "Douugh Limited, a fintech company, provides neobank and AI-driven financial wellness apps. It allows people to better manage their money and live financially healthier. The company is based in Osborne Park, Australia.",
    "website": "http://www.douugh.com",
    "zipcode": "2000"
  },
  "DOU.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "Douugh Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "DOUUGH FPO",
    "state": "NSW",
    "summary": "Douugh Limited, a fintech company, provides neobank and AI-driven financial wellness apps. It allows people to better manage their money and live financially healthier. The company is based in Osborne Park, Australia.",
    "website": "http://www.douugh.com",
    "zipcode": "2000"
  },
  "DTL.AX": {
    "city": "Brisbane",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "Data#3 Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "DATA3 FPO",
    "state": "QLD",
    "summary": "Data#3 Limited, together with its subsidiaries, provides information technology (IT) solutions primarily in Australia. It offers cloud solutions, such as public cloud services and modern data centers; modern workplace solutions, including digital workspace, collaboration, enterprise networks, systems management, and printing; security solutions comprising cloud and network security, identity and access management, data security and privacy, and security monitoring and analytics; data and analytics solutions, including business intelligence and customer management; and connectivity solutions comprising IT-OT networking, and software-defined and wireless networks. The company also provides consulting, procurement, project, support, and recruitment and contract resourcing services. Data#3 Limited was founded in 1977 and is headquartered in Brisbane, Australia.",
    "website": "http://www.data3.com",
    "zipcode": "4066"
  },
  "DUG.AX": {
    "city": "West Perth",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "DUG Technology Ltd",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "DUG TECH FPO",
    "state": "WA",
    "summary": "Dug Technology Ltd, a technology company, provides hardware and software solutions for the technology and resource sectors in Australia, Malaysia, the United States, and the United Kingdom. The company offers high-performance computing as a service solution; data center cooling solutions; DUG Insight, a 2D/3D/pre-stack visualization and interpretation package; and DUG McCloud, a cloud solution for compute as a service, professional services, and software. It also provides data services, including on-demand support for data loading, quality control, and management; and geoscience services, such as seismic processing, full waveform inversion, depth imaging, petro physical processing and interpretation, quantitative interpretation, and regional velocity model services. The company was founded in 2003 and is based in West Perth, Australia.",
    "website": "http://www.dug.com",
    "zipcode": "6005"
  },
  "DXN.AX": {
    "city": "Balcatta",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "DXN Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "DXNLIMITED FPO",
    "state": "WA",
    "summary": "DXN Limited engages in the designing, engineering, manufacturing, maintenance, and operation of data centers and related infrastructure in Australia. The company's data centers provide colocation services that offer space, power, cooling, and physical security for clients to house their computer servers, and related storage and networking equipment. It also engineers, constructs, and commissions data center solutions for edge data centers and telecommunications applications. The company was incorporated in 2017 and is based in Welshpool, Australia.",
    "website": "http://dxn.solutions",
    "zipcode": "6021"
  },
  "EML.AX": {
    "city": "Brisbane",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "EML Payments Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "EMLPAYMENT FPO",
    "state": "QLD",
    "summary": "EML Payments Limited provides prepaid payment services in Australia, Europe, and North America. Its portfolio of payment solutions offers options for disbursement payouts, gifts, incentives, and rewards, as well as white label payments and banking-as-a-service technology. The company issues mobile, virtual, and physical card solutions for various corporate brands. It serves blue-chip financial institutions, nonfinancial corporates, SMEs, FinTech companies, public sector, and NGO bodies. The company was formerly known as Emerchants Limited and changed its name to EML Payments Limited in November 2016. EML Payments Limited was incorporated in 2003 and is headquartered in Brisbane, Australia.",
    "website": "http://emlpayments.com",
    "zipcode": "4000"
  },
  "EPD.AX": {
    "city": "Perth",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "Empired Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "EMPIREDLTD FPO",
    "state": "WA",
    "summary": "Empired Limited provides information technology solutions in Australia, New Zealand, and the United States. The company offers integrated solutions, such as cloud, enterprise content management, customer relationship management, data insight and business intelligence, digital and experience design, enterprise resource planning, expert guidance, identity and access management, infrastructure transformation, change management, Internet of Things, managed infrastructure, mobile solution, application, project management office, office accelerator, spatial, system integration, and unified communication services, as well as Azure managed services. It serves clients in various industries, such as automotive, education, financial services and insurance, health, mining, oil and gas, and retail and manufacturing, as well as serves public sector and utilities. Empired Limited was founded in 1999 and is headquartered in Perth, Australia.",
    "website": "http://www.empired.com",
    "zipcode": "6000"
  },
  "FFT.AX": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "Future First Technologies Ltd",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "FFT GROUP FPO",
    "state": "VIC",
    "summary": "Future First Technologies Ltd provides information technology services primarily in Australia. The company operates in Asset Vision, farmbuy.com, and 1derful segments. The Asset Vision segment offers Asset Vision, a cloud and mobile driven enterprise; and asset management platform, which provides a unified approach to asset inspections, maintenance, and operations management services. The farmbuy.com segment provides digital advertising and marketing services to Australian agriculture and real estate companies. The 1derful segment offers 1derful, a total product solution that would reframe the way consumers manage their day-to-day banking and finances. The company was formerly known as PS&C Limited and changed its name to Future First Technologies Ltd in October 2020. Future First Technologies Ltd was founded in 2013 and is headquartered in Melbourne, Australia.",
    "website": "http://futurefirsttech.io",
    "zipcode": "3000"
  },
  "GST.L": {
    "city": "Perth",
    "country": "Australia",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Information Technology Services",
    "long_name": "GSTechnologies Ltd.",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "GSTECHNOLOGIES LTD ORD NPV (DI)",
    "state": "WA",
    "summary": "GSTechnologies Ltd., through its subsidiary, provides integrated information and communication technology (ICT) infrastructure solutions in Australia, Singapore, Malaysia, Hong Kong, India, Taiwan, China, and internationally. It engages in the supply, design, engineering, installation, and maintenance of structured cabling systems, network equipment, power and precision air-conditioner systems, access control and surveillance systems, smart monitoring and control systems, and information display systems. The company also provides wireless communication solutions, Internet of Things, and building services and data centers, as well as integrated access control and surveillance CCTV services. In addition, the company engages in the blockchain business. It serves ICT businesses and multi-national corporations, and education, hospitality, healthcare, energy, government, and financial institutions. The company was formerly known as Golden Saint Technologies Limited and changed its name to GSTechnologies Ltd. in August 2019. GSTechnologies Ltd. is based in Perth, Australia.",
    "website": "http://www.gstechnologies.co.uk",
    "zipcode": "6000"
  },
  "IP1.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "Integrated Payment Technologies Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "INPAYTECH FPO",
    "state": "NSW",
    "summary": "Integrated Payment Technologies Limited provides integrated electronic payment remittance solutions in Australia. The company offers ClickSuper that provides a complete turnkey solution to SuperStream and Single Touch Payroll compliance for superannuation funds, payroll, accounting, and enterprise resource planning software; and Payment Adviser service that facilitates the payment and communication of data concerning the payment between the payer/provider and payee/recipient. It also provides PayVu comprises ClickSuper and Payment Adviser services to make payments and record the transactions in an accounting system for bookkeepers, accountants, offshore support services, and other professional advisory providers. Integrated Payment Technologies Limited was founded in 2006 and is based in Sydney, Australia.",
    "website": "http://www.inpaytech.com.au",
    "zipcode": "2000"
  },
  "LG4.F": {
    "city": "Perth",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Cirrus Networks Holdings Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "CIRRUS NETW. HLDGS",
    "state": "WA",
    "summary": "Cirrus Networks Holdings Limited, together with its subsidiaries, provides information technology (IT) services and related third-party products in Australia. The company offers business and technology consulting services; and integration services, such as connectivity and communications, data center, collaboration, security, infrastructure, and managed services, as well as, project management and people services. Cirrus Networks Holdings Limited was founded in 2003 and is based in Perth, Australia.",
    "website": "http://www.cirrusnetworks.com.au",
    "zipcode": "6000"
  },
  "LNK.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "Link Administration Holdings Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "LINK ADMIN FPO",
    "state": "NSW",
    "summary": "Link Administration Holdings Limited provides technology-enabled administration solutions for companies, large asset owners, and trustees worldwide. The company operates through Retirement & Superannuation Solutions (RSS); Corporate Markets (CM); Banking & Credit Management (BCM); Fund Solutions (FS); and Technology & Operations (T&O) segments. The RSS segment provides core member and employer administration services; and a range of value-added services, including integrated clearing house, financial planning and advice, direct investment options, and trustee services. The CM segment offers shareholder management and analytics, stakeholder engagement, share and unit registry, employee share plans, and company secretarial support services, as well as insolvency solutions. The BCM segment provides loan origination and servicing, debt work-out, compliance, and regulatory oversight services to retail banks, investment banks, private equity funds, and other investors. The FS segment offers fund management, third-party administration, and transfer agency services to asset managers and a?variety of investment funds. The T&O segment provides services for the development and maintenance of proprietary IT systems and platforms; back office support functions; and value-added services of data analytics, digital solutions, and digital communications. The company was founded in 2005 and is headquartered in Sydney, Australia.",
    "website": "http://www.linkgroup.com",
    "zipcode": "2000"
  },
  "NXT.AX": {
    "city": "Brisbane",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "NEXTDC Limited",
    "market": "au_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "NEXTDC FPO",
    "state": "QLD",
    "summary": "NEXTDC Limited provides data center outsourcing solutions, connectivity services, and infrastructure management software in Australia. The company offers cloud connectivity for organizations; data center-as-a-service solutions; universal connectivity solutions; cloud center ecosystems; data-center infrastructure management; and intelligent service management services. It also provides technical assistance on-the-ground; and data center professional services for the infrastructure life cycle, including technical advisory, planning, project management, managing deliveries, and operational infrastructure support. In addition, the company provides data center colocation solutions comprising rack packages for individual or multiple racks; Rack Blocks to share the total power allocation across various racks; and Quarter Racks for smaller footprints. Further, it offers security systems and protocols that include multi-layered access systems with biometric fingerprint technology and ID access cards. Additionally, the company provides ONEDC, a data-center infrastructure management tool, which delivers real-time intelligence across entire NEXTDC data center footprint to manage infrastructure; and AXON virtual interconnectivity platform. NEXTDC Limited was founded in 2010 and is headquartered in Brisbane, Australia.",
    "website": "http://www.nextdc.com",
    "zipcode": "4001"
  },
  "OPY.AX": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "Openpay Group Ltd",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "OPENPAY FPO",
    "state": "VIC",
    "summary": "Openpay Group Ltd provides Buy Now Pay Later (BNPL) payment solutions in Australia, New Zealand, the United Kingdom, and the United States. The company partners with merchants to provide BNPL repayment plans to customers through in-store, in-app, and online channels, as well as facilitates increased transaction values and conversion rates for merchants at checkout. It also offers Openpay for Business, a software as a service portal that enables enterprise customers to manage trade accounts end to end, including applications, credit checks, approvals, and account management in one system. The company serves in healthcare, automotive, home improvement, and retail sectors. Openpay has strategic partnership with ezyVet to extend payment plans to fur babies. Openpay Group Ltd was founded in 2013 and is headquartered in Melbourne, Australia.",
    "website": "http://www.openpay.com.au",
    "zipcode": "3000"
  },
  "QCH.F": {
    "city": "Abbotsford",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Computershare Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "COMPUTERSHARE LTD.",
    "state": "VIC",
    "summary": "Computershare Limited provides issuer service, mortgage service, employee equity plans, communication, business, stakeholder relationship management, and technology services in Australia, the United States, the United Kingdom, Canada, Asia, and internationally. The company's issuer services comprise the provision of registry maintenance corporate actions, stakeholder relationship management, corporate governance, and related services; mortgage services and property rental, and tenant bond protection service; employee share plans and voucher services include administration and related services for employee share and option plans, and childcare voucher administration services; and business services comprise the provision of bankruptcy, class action, and corporate trust administration services. Its communication services and utilities operations consist of document composition and printing, intelligent mailing, inbound process automation, scanning, and electronic delivery; and technology services consist of the provision of software in share registry and financial services. The company was founded in 1978 and is based in Abbotsford, Australia.",
    "website": "http://www.computershare.com",
    "zipcode": "3067"
  },
  "QFE.AX": {
    "city": "Baulkham Hills",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "QuickFee Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "QUICKFEE FPO",
    "state": "NSW",
    "summary": "QuickFee Limited provides payment and lending solutions to professional service firms in Australia and the United States. The company develops QuickFee, an online platform and lending solution that enables clients to securely pay invoices up-front or over time. QuickFee Limited was founded in 2009 and is based in Baulkham Hills, Australia.",
    "website": "http://www.quickfee.com",
    "zipcode": "2153"
  },
  "SQID.CN": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "CAD",
    "exchange": "CNQ",
    "industry": "Information Technology Services",
    "long_name": "SQID Technologies Limited",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SQIDTechLtd",
    "state": "VIC",
    "summary": "SQID Technologies Limited, a payment processor, engages in the processing of credit card payments and direct debits on behalf of Australian e-commerce merchants and related businesses. It provides merchant services and transaction processing to business merchants, e-commerce platforms, charities, and community organizations in Australia. The company was incorporated in 2006 and is based in Melbourne, Australia.",
    "website": "http://www.sqidpayments.com.au",
    "zipcode": "3000"
  },
  "TYR.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "Tyro Payments Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "TYRO PAY FPO",
    "state": "NSW",
    "summary": "Tyro Payments Limited provides payment solutions to merchants and business banking products to businesses in Australia. The company operates through Payments, Banking, and Other/Corporate segments. It offers electronic funds transfer at point of sale (EFTPOS) solutions, business loans, and banking products. The company acquires credit, debit, and EFTPOS cards; and offers Medicare and private health fund claiming and rebating services. It also accepts payments online; and provides complementary banking solutions, including a loan in the form of a merchant cash advance and a deposit account, as well as solutions for its merchants and a drawcard for prospective merchants. The company primarily serves small and medium-sized enterprises in the health, hospitality, and retail industries. Tyro Payments Limited was founded in 2003 and is headquartered in Sydney, Australia.",
    "website": "http://www.tyro.com",
    "zipcode": "2000"
  },
  "WCG.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Information Technology Services",
    "long_name": "Webcentral Group Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "WEBCENTRAL FPO",
    "state": "NSW",
    "summary": "Webcentral Group Limited provides digital services for small and medium businesses. It offers domain names, website hosting, website design, email and office apps, online marketing, website security, and social media ads under the Netregistry, Melbourne IT, and Domainz brands; and digital marketing agency services, such as web design and development, search engine optimization, social media marketing, content production, pay-per-click advertising, and digital reputation management under the WME brand. The company was formerly known as ARQ Group Limited and changed its name to Webcentral Group Limited in June 2020. Webcentral Group Limited was founded in 1996 and is based in Melbourne, Australia.",
    "website": "http://www.webcentralgroup.com.au",
    "zipcode": "3000"
  }
}
