{
    "1X1.F": {
        "short_name": "CATAPULT GRP INTL",
        "long_name": "Catapult Group International Limited",
        "summary": "Catapult Group International Limited develops and sells wearable tracking solutions and analytics. It operates through three segments: Wearables, Video Analytics, and New Products. The company offers Vector, a wearable device; ClearSky, a local positioning system; and PLAYERTEK, an analytics solution. It is also involved in developing and selling tactical and coaching technology solutions; and an athlete management platform and analytics solution. The company serves prosumer athletes, sporting teams, leagues, and associations. Catapult Group International Limited was founded in 2006 and is based in Prahran, Australia.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Prahran",
        "zipcode": "3181",
        "website": "http://www.catapultsports.com",
        "market_cap": "Small Cap"
    },
    "CAT.AX": {
        "short_name": "CATAPULT FPO",
        "long_name": "Catapult Group International Limited",
        "summary": "Catapult Group International Limited develops and sells wearable tracking solutions and analytics. It operates through three segments: Wearables, Video Analytics, and New Products. The company offers Vector, a wearable device; ClearSky, a local positioning system; and PLAYERTEK, an analytics solution. It is also involved in developing and selling tactical and coaching technology solutions; and an athlete management platform and analytics solution. The company serves prosumer athletes, sporting teams, leagues, and associations. Catapult Group International Limited was founded in 2006 and is based in Prahran, Australia.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Prahran",
        "zipcode": "3181",
        "website": "http://www.catapultsports.com",
        "market_cap": "Small Cap"
    },
    "CAZGF": {
        "short_name": "CATAPULT GROUP INTERNATIONAL LT",
        "long_name": "Catapult Group International Limited",
        "summary": "Catapult Group International Limited develops and sells wearable tracking solutions and analytics. It operates through three segments: Wearables, Video Analytics, and New Products. The company offers Vector, a wearable device; ClearSky, a local positioning system; and PLAYERTEK, an analytics solution. It is also involved in developing and selling tactical and coaching technology solutions; and an athlete management platform and analytics solution. The company serves prosumer athletes, sporting teams, leagues, and associations. Catapult Group International Limited was founded in 2006 and is based in Prahran, Australia.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Prahran",
        "zipcode": "3181",
        "website": "http://www.catapultsports.com",
        "market_cap": "Small Cap"
    },
    "CDA.AX": {
        "short_name": "CODAN FPO",
        "long_name": "Codan Limited",
        "summary": "Codan Limited develops rugged and electronics solutions for organizations, mining companies, security and military groups, and governments worldwide. It operates through three segments: Communications Equipment, Metal Detection, and Tracking Solutions. The company designs, develops, manufactures, and markets communications equipment for tactical and land mobile radios. It also designs, develops, manufactures, and markets metal detection equipment, including handheld metal detecting technologies for recreational, gold mining, and demining markets. In addition, the company engages in the design, manufacture, maintenance, and support of a range of electronic products and associated software for the mining sector. It provides tracking solutions, which enable real-time monitoring and control of mining operations, for underground hard-rock mines. Further, the company offers manufacturing and support services to the Australian defense industry. It serves its customers through a network of dealers, distributors, and agents. Codan Limited was founded in 1959 and is headquartered in Mawson Lakes, Australia.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "SA",
        "city": "Mawson Lakes",
        "zipcode": "5095",
        "website": "http://www.codan.com.au",
        "market_cap": "Mid Cap"
    },
    "DVL.AX": {
        "short_name": "DORSAVI FPO",
        "long_name": "dorsaVi Ltd",
        "summary": "dorsaVi Ltd engages in the development and sale of motion analysis technologies in Australia, Europe, and the United States. It offers ViSafe, a wearable sensor technology that tracks, analyzes, and reports how employees move through their daily work lives and take the guess work out of workplace injuries and safety risks; and ViMove, a wearable sensor technology, which provides patient care and exercise plans, patient engagement and recovery programs, and new services and rehabilitation programs. The company also provides ViPerform, a wearable and wireless movement sensor technology that offers objective data to assess risk of sport injury and guide athletic training and recovery programs; and Telehealth solution. dorsaVi Ltd was incorporated in 2008 and is based in Kew, Australia.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Kew",
        "zipcode": "3101",
        "website": "http://www.dorsavi.com",
        "market_cap": "Small Cap"
    },
    "HRL.AX": {
        "short_name": "HRLHOLDING FPO",
        "long_name": "HRL Holdings Limited",
        "summary": "HRL Holdings Limited provides various environmental and laboratory services in Australia and New Zealand. It offers asbestos and hazardous materials management; property contamination testing and work place drug testing; environmental testing; and on-site testing and monitoring services, as well as environmental and property management software solutions. The company also provides food and environmental laboratory services, which include honey, milk, and dairy laboratory testing; food origin testing; drugs of abuse laboratory testing; asbestos laboratory analysis; environmental laboratory testing; and other laboratory research and development services. In addition, it offers geotechnical investigation and study; temporary works design and inspection; construction phase verification; earthworks supervision; soil, concrete, and aggregate testing; and onsite mobile laboratory testing services. Further, the company provides information management software solutions for asbestos and hazardous materials; field management software solutions; and customized compliance solutions and applications relating to workplace health and safety. It serves customers in the food, environmental, occupational hygiene, and construction industries. The company was incorporated in 2006 and is headquartered in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.hrlholdings.com",
        "market_cap": "Small Cap"
    },
    "HYD.AX": {
        "short_name": "HYDRIX FPO",
        "long_name": "Hydrix Limited",
        "summary": "Hydrix Limited provides product design, engineering, and regulatory services in Australia and internationally. It offers a range of services, including software, electronics, and mechanical design; industrial, user experience, and human factors engineering; and regulatory, clinical, and reimbursement consulting, as well as quality systems. The company also engages in the product distribution that focuses on the cardiovascular technologies with the potential to improve the quality of patient life and mobility; and early stage venture investment. It serves medical, consumer, industrial, mining, defense, and rail industries. The company was formerly known as Panorama Synergy Limited and changed its name to Hydrix Limited in November 2018. Hydrix Limited was incorporated in 1993 and is headquartered in Mulgrave, Australia.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Mulgrave",
        "zipcode": "3170",
        "website": "http://www.hydrix.com",
        "market_cap": "Small Cap"
    },
    "OIL.AX": {
        "short_name": "OPTISCAN FPO",
        "long_name": "Optiscan Imaging Limited",
        "summary": "Optiscan Imaging Limited engages in the development and commercialization of confocal endomicroscopic imaging technologies for medical, translational, and pre-clinical applications in Australia, North America, Europe, and Asia. It offers FIVE2 (ViewnVivo) system, a miniaturized fluorescence endomicroscope that brings imaging flexibility to preclinical research. The company also engages in the development of InVivage device for clinical use in the oral cancer and other cancer applications. Optiscan Imaging Limited was founded in 1994 and is headquartered in Mulgrave, Australia.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Mulgrave",
        "zipcode": "3170",
        "website": "http://www.optiscan.com",
        "market_cap": "Small Cap"
    },
    "RJP.F": {
        "short_name": "STRUCT.MONIT.SYSCDIS",
        "long_name": "Structural Monitoring Systems Plc",
        "summary": "Structural Monitoring Systems Plc, through its subsidiaries, designs, develops, manufactures, and markets structural health monitoring systems in Australia, the United States, Europe, and Canada. The company offers CVM switch for fatigue testing; CVM NDI structural monitoring systems; and laboratory kits for use in real-time crack detection and monitoring. It also designs, manufactures, and sells avionics and aircraft audio systems, as well as electronics manufacturing and prototype services. Structural Monitoring Systems Plc is based in Claremont, Australia.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "WA",
        "city": "Claremont",
        "zipcode": "6010",
        "website": "http://www.smsystems.com.au",
        "market_cap": "Small Cap"
    },
    "SMN.AX": {
        "short_name": "STRUCT MON CDI 1:1",
        "long_name": "Structural Monitoring Systems Plc",
        "summary": "Structural Monitoring Systems Plc, through its subsidiaries, designs, develops, manufactures, and markets structural health monitoring systems in Australia, the United States, Europe, and Canada. The company offers CVM switch for fatigue testing; CVM NDI structural monitoring systems; and laboratory kits for use in real-time crack detection and monitoring. It also designs, manufactures, and sells avionics and aircraft audio systems, as well as electronics manufacturing and prototype services. Structural Monitoring Systems Plc is based in Claremont, Australia.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Claremont",
        "zipcode": "6010",
        "website": "http://www.smsystems.com.au",
        "market_cap": "Small Cap"
    },
    "XRF.AX": {
        "short_name": "XRF SCIEN FPO",
        "long_name": "XRF Scientific Limited",
        "summary": "XRF Scientific Limited manufactures and markets precious metal products, specialized chemicals, and instruments for the scientific, analytical, construction material, and mining industries in Australia, Canada, and Europe. It operates through Capital Equipment, Precious Metals, and Consumables segments. The Capital Equipment segment designs, manufactures, and services automated fusion equipment, and high temperature test and production furnaces, as well as general laboratory equipment. The Precious Metals segment manufactures products for the laboratory and platinum alloy markets. The Consumables segment produces and distributes consumables, chemicals, and other supplies for analytical laboratories. The company is based in Osborne Park, Australia.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Osborne Park",
        "zipcode": "6017",
        "website": "http://www.xrfscientific.com",
        "market_cap": "Small Cap"
    }
}