{
    "ETLN.ME": {
        "short_name": "ETALON GROUP PLC",
        "long_name": "Etalon Group PLC",
        "summary": "Etalon Group PLC, together with its subsidiaries, primarily engages in residential development and construction business in Saint-Petersburg metropolitan and Moscow metropolitan areas in Russia. It operates through three segments: Residential Development, Construction Services, and Other Operations. The Residential Development segment constructs residential real estate properties, including flats, built-in premises, and parking places. The Construction Services segment provides construction services for third parties. The Other Operations segment sells construction materials; constructs stand-alone premises for commercial use; and offers various services related to sale and servicing of premises. Etalon Group PLC was founded in 1987 and is based in Nicosia, Cyprus.",
        "currency": "RUB",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Cyprus",
        "city": "Nicosia"
    },
    "MDPR.TA": {
        "short_name": "MEDIPOWER OVERSEAS",
        "long_name": "Medipower (Overseas) Public Co. Limited",
        "summary": "Medipower (Overseas) Public Co. Limited operates as a commercial real estate company in the United States, Canada, and Bulgaria. It owns and manages retail properties and residential developments, as well as shopping centers. The company was incorporated in 2001 and is based in Nicosia, Cyprus.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Cyprus",
        "city": "Nicosia"
    },
    "MLD.TA": {
        "short_name": "MIRLAND DEVELOPMEN",
        "long_name": "MirLand Development Corporation Plc",
        "summary": "MirLand Development Corporation Plc acquires, invests in, develops, constructs, leases, and sells commercial and residential real estate properties in Russia. Its projects portfolio consists of residential, office, retail, and logistics properties. The company was founded in 2004 and is headquartered in Limassol, Cyprus.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate—Development",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Cyprus",
        "city": "Limassol"
    }
}