{
    "4Q01.F": {
        "short_name": "RUMBLEON CL.B  DL-,001",
        "long_name": "RumbleON, Inc.",
        "summary": "RumbleON, Inc. operates an e-commerce platform that aggregates and distributes pre-owned vehicles to and from consumers and dealers in North America. It operates in three segments: Powersports, Automotive, and Vehicle Logistics and Transportation. The Powersports segment distributes motorcycles. The Automotive segment distributes cars and trucks. The Vehicle Logistics and Transportation Service segment provides automotive transportation services primarily between dealerships and auctions. It operates a platform that facilitates the ability of all participants in the supply chain, including RumbleOn, other dealers, and consumers to buy-sell-trade-finance-transport pre-owned vehicles. The company was formerly known as Smart Server, Inc. and changed its name to RumbleON, Inc. in February 2017. RumbleON, Inc. was incorporated in 2013 and is based in Irving, Texas.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Irving",
        "zipcode": "75038",
        "website": "http://www.rumbleon.com",
        "market_cap": "Small Cap"
    },
    "5ZL.F": {
        "short_name": "LAZYDAYS HOLDINGS INC.",
        "long_name": "Lazydays Holdings, Inc.",
        "summary": "Lazydays Holdings, Inc. operates recreation vehicle (RV) dealerships under the Lazydays name in the United States. It provides RV sales, RV parts and services, after-market parts and accessories, and RV camping facilities. The company offers various new and used RVs; onsite general RV maintenance and repair services; and collision repair services, as well as sells and installs various parts and accessories, such as tow hitches, satellite dishes, and suspension systems. It also operates the Lazydays RV resort at Tampa, Florida. In addition, the company arranges financing for vehicle purchases through third-party finance sources; and offers various third-party protection insurance plans and services to the purchasers of its RVs. It operates dealerships locations at The Villages, Florida; Tucson, Arizona; Minneapolis, Minnesota; Knoxville, Tennessee; and Loveland and Denver, Colorado. The company was founded in 1976 and is based in Seffner, Florida.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "FL",
        "city": "Seffner",
        "zipcode": "33584",
        "website": "http://www.lazydays.com",
        "market_cap": "Small Cap"
    },
    "ABG": {
        "short_name": "Asbury Automotive Group Inc",
        "long_name": "Asbury Automotive Group, Inc.",
        "summary": "Asbury Automotive Group, Inc., together with its subsidiaries, operates as an automotive retailer in the United States. It offers a range of automotive products and services, including new and used vehicles; and vehicle repair and maintenance services, replacement parts, and collision repair services. The company also provides finance and insurance products, including arranging vehicle financing through third parties; and aftermarket products, such as extended service contracts, guaranteed asset protection debt cancellation, prepaid maintenance, and credit life and disability insurance. As of December 31, 2020, the company owned and operated 112 new vehicle franchises representing 31 brands of automobiles at 91 dealership locations; and 25 collision centers in the United States. Asbury Automotive Group, Inc. was founded in 1996 and is headquartered in Duluth, Georgia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Duluth",
        "zipcode": "30097",
        "website": "http://www.asburyauto.com",
        "market_cap": "Mid Cap"
    },
    "AN": {
        "short_name": "AutoNation, Inc.",
        "long_name": "AutoNation, Inc.",
        "summary": "AutoNation, Inc., through its subsidiaries, operates as an automotive retailer in the United States. The company operates through three segments: Domestic, Import, and Premium Luxury. It offers a range of automotive products and services, including new and used vehicles; and parts and services, such as automotive repair and maintenance, and wholesale parts and collision services. The company also provides automotive finance and insurance products comprising vehicle services and other protection products, as well as arranges finance for vehicle purchases through third-party finance sources. As of December 31, 2020, it owned and operated 315 new vehicle franchises from 230 stores located primarily in metropolitan markets in the Sunbelt region. The company also owned and operated 74 AutoNation-branded collision centers, 5 AutoNation USA used vehicle stores, 4 AutoNation-branded automotive auction operations, and 3 parts distribution centers. AutoNation, Inc. was founded in 1991 and is headquartered in Fort Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Fort Lauderdale",
        "zipcode": "33301",
        "website": "http://www.autonation.com",
        "market_cap": "Mid Cap"
    },
    "AWG.F": {
        "short_name": "ASBURY AUTOMOTIVE  DL-,01",
        "long_name": "Asbury Automotive Group, Inc.",
        "summary": "Asbury Automotive Group, Inc., together with its subsidiaries, operates as an automotive retailer in the United States. It offers a range of automotive products and services, including new and used vehicles; and vehicle repair and maintenance services, replacement parts, and collision repair services. The company also provides finance and insurance products, including arranging vehicle financing through third parties; and aftermarket products, such as extended service contracts, guaranteed asset protection debt cancellation, prepaid maintenance, and credit life and disability insurance. As of December 31, 2020, the company owned and operated 112 new vehicle franchises representing 31 brands of automobiles at 91 dealership locations; and 25 collision centers in the United States. Asbury Automotive Group, Inc. was founded in 1996 and is headquartered in Duluth, Georgia.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "GA",
        "city": "Duluth",
        "zipcode": "30097",
        "website": "http://www.asburyauto.com",
        "market_cap": "Mid Cap"
    },
    "CARS": {
        "short_name": "Cars.com Inc.",
        "long_name": "Cars.com Inc.",
        "summary": "Cars.com, LLC, through its subsidiaries, operates as a digital marketplace, and provides solutions for the automotive industry. Its platform connects car shoppers with sellers. The company, through its marketplace, dealer websites, and other digital products, showcases dealer inventory, elevate and amplify dealers' and automotive manufacturers' (OEMs) brands, connect sellers with ready-to-buy audience, and empower shoppers with the resources and information needed to make car buying decisions. It also offers marketplace products, such as marketplace subscription advertising and social selling services; digital solutions, including Website platform hosting, AI chat tool, digital retailing, and review and reputation management; and advertising comprising display advertising, digital advertising, and in-market audio services. As of December 31, 2020, the company served 18,372 dealer customers in 50 states, which included franchise and independent dealers, with digital and brick-and-mortar stores; and primary automakers selling vehicles in the United States. Its customers are local car dealers, OEMs, and other national advertisers. Cars.com, LLC was founded in 1998 and is based in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60606",
        "website": "http://www.cars.com",
        "market_cap": "Small Cap"
    },
    "CK3.F": {
        "short_name": "CARS.COM INC.",
        "long_name": "Cars.com Inc.",
        "summary": "Cars.com, LLC, through its subsidiaries, operates as a digital marketplace, and provides solutions for the automotive industry. Its platform connects car shoppers with sellers. The company, through its marketplace, dealer websites, and other digital products, showcases dealer inventory, elevate and amplify dealers' and automotive manufacturers' (OEMs) brands, connect sellers with ready-to-buy audience, and empower shoppers with the resources and information needed to make car buying decisions. It also offers marketplace products, such as marketplace subscription advertising and social selling services; digital solutions, including Website platform hosting, AI chat tool, digital retailing, and review and reputation management; and advertising comprising display advertising, digital advertising, and in-market audio services. As of December 31, 2020, the company served 18,372 dealer customers in 50 states, which included franchise and independent dealers, with digital and brick-and-mortar stores; and primary automakers selling vehicles in the United States. Its customers are local car dealers, OEMs, and other national advertisers. Cars.com, LLC was founded in 1998 and is based in Chicago, Illinois.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60606",
        "website": "http://www.cars.com",
        "market_cap": "Small Cap"
    },
    "CRMT": {
        "short_name": "America's Car-Mart, Inc.",
        "long_name": "America's Car-Mart, Inc.",
        "summary": "America's Car-Mart, Inc., through its subsidiaries, operates as an automotive retailer in the United States. The company primarily sells older model used vehicles and provides financing for its customers. As of December 17, 2020, it operated 151 dealerships in the South-Central United States. America's Car-Mart, Inc. was founded in 1981 and is based in Rogers, Arkansas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "AR",
        "city": "Rogers",
        "zipcode": "72756",
        "website": "http://www.car-mart.com",
        "market_cap": "Small Cap"
    },
    "DRVN": {
        "short_name": "Driven Brands Holdings Inc.",
        "long_name": "Driven Brands Holdings Inc.",
        "summary": "Driven Brands Holdings Inc. provides automotive services to retail and commercial customers in North America and internationally. It operates through Maintenance; Car Wash, Paint, Collision & Glass; and Platform Services segments. The company offers various services, such as paint, collision, refinishing, glass, vehicle repair, oil change, maintenance, and car wash services. It also distributes a range of automotive parts, including radiators, air conditioning components, and exhaust products to automotive repair shops, auto parts stores, body shops, and other auto repair outlets, as well as offers automotive training services. As of December 26, 2020, it operated 4,227 company-operated, franchised, and independently-operated stores under the Take 5 Oil Change, Meineke Car Care Centers, MAACO, CARSTAR, 1-800-Radiator & A/C, ABRA, Fix Auto, and Uniban brand names. Driven Brands Holdings Inc. was founded in 1972 and is headquartered in Charlotte, North Carolina.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NC",
        "city": "Charlotte",
        "zipcode": "28202",
        "website": "http://www.drivenbrands.com",
        "market_cap": "Mid Cap"
    },
    "GAV.F": {
        "short_name": "GROUP 1 AUTOM.  DL-,01",
        "long_name": "Group 1 Automotive, Inc.",
        "summary": "Group 1 Automotive, Inc., through its subsidiaries, operates in the automotive retail industry. The company sells new and used cars, light trucks, and vehicle parts, as well as service and insurance contracts; arranges related vehicle financing; and offers automotive maintenance and repair services. It operates primarily in the metropolitan areas in 15 states in the United States; 33 towns in the United Kingdom; and 3 states in Brazil. As of March 16, 2021, the company owned and operated 184 automotive dealerships, 237 franchises, and 49 collision centers that offer 31 brands of automobiles. Group 1 Automotive, Inc. was incorporated in 1995 and is based in Houston, Texas.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77024",
        "website": "http://www.group1auto.com",
        "market_cap": "Mid Cap"
    },
    "GPI": {
        "short_name": "Group 1 Automotive, Inc.",
        "long_name": "Group 1 Automotive, Inc.",
        "summary": "Group 1 Automotive, Inc., through its subsidiaries, operates in the automotive retail industry. The company sells new and used cars, light trucks, and vehicle parts, as well as service and insurance contracts; arranges related vehicle financing; and offers automotive maintenance and repair services. It operates primarily in the metropolitan areas in 15 states in the United States; 33 towns in the United Kingdom; and 3 states in Brazil. As of March 16, 2021, the company owned and operated 184 automotive dealerships, 237 franchises, and 49 collision centers that offer 31 brands of automobiles. Group 1 Automotive, Inc. was incorporated in 1995 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77024",
        "website": "http://www.group1auto.com",
        "market_cap": "Mid Cap"
    },
    "HC9.F": {
        "short_name": "AM.CAR-MART  DL-,01",
        "long_name": "America's Car-Mart, Inc.",
        "summary": "America's Car-Mart, Inc., through its subsidiaries, operates as an automotive retailer in the United States. The company primarily sells older model used vehicles and provides financing for its customers. As of December 17, 2020, it operated 151 dealerships in the South-Central United States. America's Car-Mart, Inc. was founded in 1981 and is based in Rogers, Arkansas.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "AR",
        "city": "Rogers",
        "zipcode": "72756",
        "website": "http://www.car-mart.com",
        "market_cap": "Small Cap"
    },
    "KFS": {
        "short_name": "Kingsway Financial Services, In",
        "long_name": "Kingsway Financial Services Inc.",
        "summary": "Kingsway Financial Services Inc., through its subsidiaries, engages in the extended warranty and leased real estate business. The Extended Warranty segment markets, sells, and administers vehicle service agreements and related products for new and used automobiles. This segment also sells new home warranty products, as well as offers administration services to homebuilders and homeowners; markets and distributes warranty products to manufacturers, distributors, and installers of heating, ventilation and air conditioning, standby generator, commercial LED lighting, and refrigeration equipment; and provides equipment breakdown and maintenance support services to companies. The Leased Real Estate segment owns a parcel of real property consisting of approximately 192 acres located in the State of Texas. The company offers its products and services to credit unions, consumers, businesses, and homebuilders. Kingsway Financial Services Inc. was incorporated in 1989 and is headquartered in Itasca, Illinois.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Itasca",
        "zipcode": "60143",
        "website": "http://www.kingsway-financial.com",
        "market_cap": "Small Cap"
    },
    "KMX.MX": {
        "short_name": "CARMAX INC",
        "long_name": "CarMax, Inc.",
        "summary": "CarMax, Inc., through its subsidiaries, operates as a retailer of used vehicles in the United States. The company operates in two segments, CarMax Sales Operations and CarMax Auto Finance. It offers customers a range of makes and models of used vehicles, including domestic, imported, and luxury vehicles; vehicles that do not meet its retail standards to licensed dealers through on-site wholesale auctions; and extended protection plans to customers at the time of sale. The company also provides reconditioning and vehicle repair services; and financing alternatives for retail customers across a range of credit spectrum through its CarMax Auto Finance and arrangements with various financial institutions. As of February 29, 2020, it operated approximately 216 stores and 2 new car franchises. CarMax, Inc. was founded in 1993 and is based in Richmond, Virginia.",
        "currency": "MXN",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "VA",
        "city": "Richmond",
        "zipcode": "23238",
        "website": "http://www.carmax.com",
        "market_cap": "Large Cap"
    },
    "KMX": {
        "short_name": "CarMax Inc",
        "long_name": "CarMax, Inc.",
        "summary": "CarMax, Inc., through its subsidiaries, operates as a retailer of used vehicles in the United States. The company operates in two segments, CarMax Sales Operations and CarMax Auto Finance. It offers customers a range of makes and models of used vehicles, including domestic, imported, and luxury vehicles; vehicles that do not meet its retail standards to licensed dealers through on-site wholesale auctions; and extended protection plans to customers at the time of sale. The company also provides reconditioning and vehicle repair services; and financing alternatives for retail customers across a range of credit spectrum through its CarMax Auto Finance and arrangements with various financial institutions. As of February 29, 2020, it operated approximately 216 stores and 2 new car franchises. CarMax, Inc. was founded in 1993 and is based in Richmond, Virginia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Richmond",
        "zipcode": "23238",
        "website": "http://www.carmax.com",
        "market_cap": "Large Cap"
    },
    "LAD": {
        "short_name": "Lithia Motors, Inc.",
        "long_name": "Lithia Motors, Inc.",
        "summary": "Lithia Motors, Inc. operates as an automotive retailer in the United States. The company operates through three segments: Domestic, Import, and Luxury. It offers new and used vehicles; vehicle financing services; warranties, insurance contracts, and vehicle and theft protection services; and automotive repair and maintenance services, as well as sells vehicle body and parts. As of February 19, 2021, the company operated through 210 stores. It also offers its products online through 200 websites. Lithia Motors, Inc. was founded in 1946 and is headquartered in Medford, Oregon.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OR",
        "city": "Medford",
        "zipcode": "97501",
        "website": "http://www.lithiainvestorrelations.com",
        "market_cap": "Large Cap"
    },
    "LAZY": {
        "short_name": "Lazydays Holdings, Inc.",
        "long_name": "Lazydays Holdings, Inc.",
        "summary": "Lazydays Holdings, Inc. operates recreation vehicle (RV) dealerships under the Lazydays name in the United States. It provides RV sales, RV parts and services, after-market parts and accessories, and RV camping facilities. The company offers various new and used RVs; onsite general RV maintenance and repair services; and collision repair services, as well as sells and installs various parts and accessories, such as tow hitches, satellite dishes, and suspension systems. It also operates the Lazydays RV resort at Tampa, Florida. In addition, the company arranges financing for vehicle purchases through third-party finance sources; and offers various third-party protection insurance plans and services to the purchasers of its RVs. It operates dealerships locations at The Villages, Florida; Tucson, Arizona; Minneapolis, Minnesota; Knoxville, Tennessee; and Loveland and Denver, Colorado. The company was founded in 1976 and is based in Seffner, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Seffner",
        "zipcode": "33584",
        "website": "http://www.lazydays.com",
        "market_cap": "Small Cap"
    },
    "LMO.DE": {
        "short_name": "LITHIA MOTORS INC.",
        "long_name": "Lithia Motors, Inc.",
        "summary": "Lithia Motors, Inc. operates as an automotive retailer in the United States. The company operates through three segments: Domestic, Import, and Luxury. It offers new and used vehicles; vehicle financing services; warranties, insurance contracts, and vehicle and theft protection services; and automotive repair and maintenance services, as well as sells vehicle body and parts. As of February 19, 2021, the company operated through 210 stores. It also offers its products online through 200 websites. Lithia Motors, Inc. was founded in 1946 and is headquartered in Medford, Oregon.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "OR",
        "city": "Medford",
        "zipcode": "97501",
        "website": "http://www.lithiainvestorrelations.com",
        "market_cap": "Mid Cap"
    },
    "LMO.F": {
        "short_name": "LITHIA MOTORS INC.",
        "long_name": "Lithia Motors, Inc.",
        "summary": "Lithia Motors, Inc. operates as an automotive retailer in the United States. The company operates through three segments: Domestic, Import, and Luxury. It offers new and used vehicles; vehicle financing services; warranties, insurance contracts, and vehicle and theft protection services; and automotive repair and maintenance services, as well as sells vehicle body and parts. As of February 19, 2021, the company operated through 210 stores. It also offers its products online through 200 websites. Lithia Motors, Inc. was founded in 1946 and is headquartered in Medford, Oregon.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OR",
        "city": "Medford",
        "zipcode": "97501",
        "website": "http://www.lithiainvestorrelations.com",
        "market_cap": "Mid Cap"
    },
    "LMPX": {
        "short_name": "LMP Automotive Holdings, Inc.",
        "long_name": "LMP Automotive Holdings, Inc.",
        "summary": "LMP Automotive Holdings, Inc., through its subsidiaries, buys, sells, rents and subscribes for, and obtains financing for automobiles online and in person in the United States. It primarily buys pre-owned automobiles primarily through auctions or directly from other automobile dealers, as well as new automobiles from manufacturers and manufacturer distributors at fleet rates. The company was incorporated in 2017 and is headquartered in Fort Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Fort Lauderdale",
        "zipcode": "33394",
        "website": "http://www.lmpmotors.com",
        "market_cap": "Small Cap"
    },
    "LOTZ": {
        "short_name": "CarLotz, Inc.",
        "long_name": "CarLotz, Inc.",
        "summary": "CarLotz, Inc. operates as a consignment-to-retail used vehicle marketplace that provides its corporate vehicle sourcing partners and retail sellers of used vehicles. The company serves corporate vehicle sourcing partners, which include fleet leasing companies, rental car companies, banks, captive finance companies, third-party remarketers, wholesalers, companies that manage their own fleets, and original equipment manufacturers; retail sellers of used vehicles to individuals; and retail customers. It operates ten hubs throughout the Mid-Atlantic, Southeast, Southcentral, Midwest, and West Coast regions of the United States. The company was founded in 2011 and is headquartered in Richmond, Virginia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Richmond",
        "zipcode": "23224",
        "website": "http://www.carlotz.com",
        "market_cap": "Small Cap"
    },
    "NWAU": {
        "short_name": "NOWAUTO INC",
        "long_name": "Consumer Automotive Finance, Inc.",
        "summary": "Consumer Automotive Finance Inc. operates as a retailer in the used vehicle market of the United States. It focuses primarily on the buy here/pay here segment of the independent used vehicle sales and finance market. The company sells approximately 2000 and newer model-year used vehicles and provides related financing through sale type leases. As of December 31, 2010, it had two retail locations in Arizona. The company was formerly known as NowAuto Group, Inc. Consumer Automotive Finance Inc. is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89128",
        "website": "http://www.cafius.com",
        "market_cap": "Large Cap"
    },
    "PAG": {
        "short_name": "Penske Automotive Group, Inc.",
        "long_name": "Penske Automotive Group, Inc.",
        "summary": "Penske Automotive Group, Inc., a diversified transportation services company, operates automotive and commercial truck dealerships. The company operates through four segments: Retail Automotive, Retail Commercial Truck, Other, and Non-Automotive Investments. It operates dealerships under franchise agreements with various automotive manufacturers and distributors. The company engages in the sale of new and used motor vehicles, and related products and services comprise vehicle and collision repair services, as well as placement of finance and lease contracts, third-party insurance products, and other aftermarket products; and wholesale of parts. It also operates a heavy and medium duty truck dealership, which offers Freightliner and Western Star branded trucks, as well as a range of used trucks, and maintenance and repair services. In addition, it imports and distributes Western Star heavy-duty trucks, MAN heavy and medium duty trucks, buses, and Dennis Eagle refuse collection vehicles with associated parts in Australia, New Zealand, and portions of the Pacific. Further, the company distributes diesel and gas engines, and power systems. The company operates 304 retail automotive franchises, including 142 franchises located in the United States and 162 franchises located outside of the United States; 17 used vehicle supercenters in the United States and the United Kingdom; and 25 commercial truck dealerships in Texas, Oklahoma, Tennessee, Georgia, Utah, and Idaho, the United States, as well as Canada. Penske Automotive Group, Inc. was incorporated in 1990 and is headquartered in Bloomfield Hills, Michigan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MI",
        "city": "Bloomfield Hills",
        "zipcode": "48302-0954",
        "website": "http://www.penskeautomotive.com",
        "market_cap": "Mid Cap"
    },
    "PREC": {
        "short_name": "PRESTIGE CARS",
        "long_name": "Prestige Cars International, Inc.",
        "summary": "Prestige Cars International, Inc. operates as a restorer and dealer of pre-owned Rolls Royce, Bentley and other high-end motor cars, including many collector's editions. The company is based in Ft. Lauderdale, Florida. As per the transaction announced on March 27, 2007, Prestige Cars International, Inc. is a subsidiary of Cambridge Park Limited, Inc.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Ft. Lauderdale",
        "zipcode": "33311",
        "website": null,
        "market_cap": null
    },
    "RMBL": {
        "short_name": "RumbleOn, Inc.",
        "long_name": "RumbleON, Inc.",
        "summary": "RumbleON, Inc. operates an e-commerce platform that aggregates and distributes pre-owned vehicles to and from consumers and dealers in North America. It operates in three segments: Powersports, Automotive, and Vehicle Logistics and Transportation. The Powersports segment distributes motorcycles. The Automotive segment distributes cars and trucks. The Vehicle Logistics and Transportation Service segment provides automotive transportation services primarily between dealerships and auctions. It operates a platform that facilitates the ability of all participants in the supply chain, including RumbleOn, other dealers, and consumers to buy-sell-trade-finance-transport pre-owned vehicles. The company was formerly known as Smart Server, Inc. and changed its name to RumbleON, Inc. in February 2017. RumbleON, Inc. was incorporated in 2013 and is based in Irving, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Irving",
        "zipcode": "75038",
        "website": "http://www.rumbleon.com",
        "market_cap": "Small Cap"
    },
    "RUNA.F": {
        "short_name": "RUSH ENTERPRISES A DL-,01",
        "long_name": "Rush Enterprises, Inc.",
        "summary": "Rush Enterprises, Inc., through its subsidiaries, operates as an integrated retailer of commercial vehicles and related services in the United States. The company operates a network of commercial vehicle dealerships under the Rush Truck Centers name. Its Rush Truck Centers primarily sell commercial vehicles manufactured by Peterbilt, International, Hino, Ford, Isuzu, IC Bus, or Blue Bird; provides new and used commercial vehicles, and aftermarket parts, as well as service and repair, financing, and leasing and rental services; and offers property and casualty insurance, including collision and liability insurance on commercial vehicles, cargo insurance, and credit life insurance to its commercial vehicle customers. The company also offers equipment installation and repair, parts installation, and paint and body repair services; new vehicle pre-delivery inspection, truck modification, and natural gas fuel system installation services; body, chassis upfit, and component installation services, as well as sells tires for use on commercial vehicles, new and used trailers, and vehicle telematics products; and manufactures compressed natural gas fuel systems and related component parts for commercial vehicles. It serves regional and national truck fleets, corporations, local and state governments, and owner operators. The company operates a network of centers located in the states of Alabama, Arizona, California, Colorado, Florida, Georgia, Idaho, Illinois, Indiana, Kansas, Kentucky, Missouri, Nevada, Nebraska, New Mexico, North Carolina, Ohio, Oklahoma, Pennsylvania, Tennessee, Texas, Utah, and Virginia. Rush Enterprises, Inc. was founded in 1965 and is headquartered in New Braunfels, Texas.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "New Braunfels",
        "zipcode": "78130",
        "website": "http://www.rushenterprises.com",
        "market_cap": "Mid Cap"
    },
    "RUSHA": {
        "short_name": "Rush Enterprises, Inc.",
        "long_name": "Rush Enterprises, Inc.",
        "summary": "Rush Enterprises, Inc., through its subsidiaries, operates as an integrated retailer of commercial vehicles and related services in the United States. The company operates a network of commercial vehicle dealerships under the Rush Truck Centers name. Its Rush Truck Centers primarily sell commercial vehicles manufactured by Peterbilt, International, Hino, Ford, Isuzu, IC Bus, or Blue Bird; provides new and used commercial vehicles, and aftermarket parts, as well as service and repair, financing, and leasing and rental services; and offers property and casualty insurance, including collision and liability insurance on commercial vehicles, cargo insurance, and credit life insurance to its commercial vehicle customers. The company also offers equipment installation and repair, parts installation, and paint and body repair services; new vehicle pre-delivery inspection, truck modification, and natural gas fuel system installation services; body, chassis upfit, and component installation services, as well as sells tires for use on commercial vehicles, new and used trailers, and vehicle telematics products; and manufactures compressed natural gas fuel systems and related component parts for commercial vehicles. It serves regional and national truck fleets, corporations, local and state governments, and owner operators. The company operates a network of centers located in the states of Alabama, Arizona, California, Colorado, Florida, Georgia, Idaho, Illinois, Indiana, Kansas, Kentucky, Missouri, Nevada, Nebraska, New Mexico, North Carolina, Ohio, Oklahoma, Pennsylvania, Tennessee, Texas, Utah, and Virginia. Rush Enterprises, Inc. was founded in 1965 and is headquartered in New Braunfels, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "New Braunfels",
        "zipcode": "78130",
        "website": "http://www.rushenterprises.com",
        "market_cap": "Mid Cap"
    },
    "RUSHB": {
        "short_name": "Rush Enterprises, Inc.",
        "long_name": "Rush Enterprises, Inc.",
        "summary": "Rush Enterprises, Inc., through its subsidiaries, operates as an integrated retailer of commercial vehicles and related services in the United States. The company operates a network of commercial vehicle dealerships under the Rush Truck Centers name. Its Rush Truck Centers primarily sell commercial vehicles manufactured by Peterbilt, International, Hino, Ford, Isuzu, IC Bus, or Blue Bird; provides new and used commercial vehicles, and aftermarket parts, as well as service and repair, financing, and leasing and rental services; and offers property and casualty insurance, including collision and liability insurance on commercial vehicles, cargo insurance, and credit life insurance to its commercial vehicle customers. The company also offers equipment installation and repair, parts installation, and paint and body repair services; new vehicle pre-delivery inspection, truck modification, and natural gas fuel system installation services; body, chassis upfit, and component installation services, as well as sells tires for use on commercial vehicles, new and used trailers, and vehicle telematics products; and manufactures compressed natural gas fuel systems and related component parts for commercial vehicles. It serves regional and national truck fleets, corporations, local and state governments, and owner operators. The company operates a network of centers located in the states of Alabama, Arizona, California, Colorado, Florida, Georgia, Idaho, Illinois, Indiana, Kansas, Kentucky, Missouri, Nevada, Nebraska, New Mexico, North Carolina, Ohio, Oklahoma, Pennsylvania, Tennessee, Texas, Utah, and Virginia. Rush Enterprises, Inc. was founded in 1965 and is headquartered in New Braunfels, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "New Braunfels",
        "zipcode": "78130",
        "website": "http://www.rushenterprises.com",
        "market_cap": "Mid Cap"
    },
    "RWGI": {
        "short_name": "RODEDAWG INTERNATIONAL INDUSTRI",
        "long_name": "Rodedawg International Industries, Inc.",
        "summary": "Rodedawg International Industries, Inc. engages in manufacture and distribution of recreational, amphibious, and off road vehicles worldwide. It offers truck utility, sports utility, and convertible vehicles. The company was formerly known as E Jet Holdings, Inc. and changed its name to China Global Distribution Corporation. Later, the name was changed to Rodedawg International Industries, Inc. in 2005. Rodedawg International Industries is based in Hayward, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Hayward",
        "zipcode": "94544",
        "website": null,
        "market_cap": "Small Cap"
    },
    "RWI.F": {
        "short_name": "AUTONATION INC.  DL-,01",
        "long_name": "AutoNation, Inc.",
        "summary": "AutoNation, Inc., through its subsidiaries, operates as an automotive retailer in the United States. The company operates through three segments: Domestic, Import, and Premium Luxury. It offers a range of automotive products and services, including new and used vehicles; and parts and services, such as automotive repair and maintenance, and wholesale parts and collision services. The company also provides automotive finance and insurance products comprising vehicle services and other protection products, as well as arranges finance for vehicle purchases through third-party finance sources. As of December 31, 2020, it owned and operated 315 new vehicle franchises from 230 stores located primarily in metropolitan markets in the Sunbelt region. The company also owned and operated 74 AutoNation-branded collision centers, 5 AutoNation USA used vehicle stores, 4 AutoNation-branded automotive auction operations, and 3 parts distribution centers. AutoNation, Inc. was founded in 1991 and is headquartered in Fort Lauderdale, Florida.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "FL",
        "city": "Fort Lauderdale",
        "zipcode": "33301",
        "website": "http://www.autonation.com",
        "market_cap": "Mid Cap"
    },
    "SA8A.F": {
        "short_name": "SONIC AUTOMOTIVE A DL-,01",
        "long_name": "Sonic Automotive, Inc.",
        "summary": "Sonic Automotive, Inc. operates as an automotive retailer in the United States. It operates in two segments, Franchised Dealerships and EchoPark. The Franchised Dealerships segment is involved in the sale of new and used cars and light trucks, and replacement parts; provision of vehicle maintenance, manufacturer warranty repair, and paint and collision repair services; and arrangement of extended warranties, service contracts, financing, insurance, and other aftermarket products. The EchoPark segment sells used cars and light trucks; and arranges finance and insurance product sales in pre-owned vehicle specialty retail locations. As of December 31, 2020, the company operated 96 new vehicle franchises representing 21 brands of cars and light trucks; 14 collision repair centers in 12 states; and 16 EchoPark stores. Sonic Automotive, Inc. was founded in 1997 and is based in Charlotte, North Carolina.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NC",
        "city": "Charlotte",
        "zipcode": "28211",
        "website": "http://www.sonicautomotive.com",
        "market_cap": "Small Cap"
    },
    "SAH": {
        "short_name": "Sonic Automotive, Inc.",
        "long_name": "Sonic Automotive, Inc.",
        "summary": "Sonic Automotive, Inc. operates as an automotive retailer in the United States. It operates in two segments, Franchised Dealerships and EchoPark. The Franchised Dealerships segment is involved in the sale of new and used cars and light trucks, and replacement parts; provision of vehicle maintenance, manufacturer warranty repair, and paint and collision repair services; and arrangement of extended warranties, service contracts, financing, insurance, and other aftermarket products. The EchoPark segment sells used cars and light trucks; and arranges finance and insurance product sales in pre-owned vehicle specialty retail locations. As of December 31, 2020, the company operated 96 new vehicle franchises representing 21 brands of cars and light trucks; 14 collision repair centers in 12 states; and 16 EchoPark stores. Sonic Automotive, Inc. was founded in 1997 and is based in Charlotte, North Carolina.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NC",
        "city": "Charlotte",
        "zipcode": "28211",
        "website": "http://www.sonicautomotive.com",
        "market_cap": "Mid Cap"
    },
    "SPMI": {
        "short_name": "SPEEDEMISSIONS INC",
        "long_name": "Speedemissions, Inc.",
        "summary": "Speedemissions, Inc. provides vehicle emissions testing and safety inspection services in the United States. The company performs accelerated simulated model and on-board diagnostic emissions tests for the automobile fleets of the federal, state, and local governments; and various new and used car dealers in Atlanta, Georgia. As of March 24, 2017, it operated 21 vehicle emissions testing and safety inspection stations under the trade names of Speedemissions and Auto Emissions Express in Atlanta, Georgia, and St. Louis in Missouri. The company also operates 3 mobile testing units in Atlanta, Georgia. In addition, it sells automotive parts and supplies, such as windshield wipers, taillight bulbs, and gas caps; and offers oil change and other services. Further, the company provides Carbonga, an iPhone application that diagnoses an automobile's computer system using the on board diagnostic port on vehicles; and receives vehicle safety recalls and technical service bulletins. Speedemissions, Inc. was founded in 2001 and is based in Tyrone, Georgia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Tyrone",
        "zipcode": "30290",
        "website": "http://www.speedemissions.com",
        "market_cap": "Small Cap"
    },
    "UA9.F": {
        "short_name": "PENSKE AUTOMOTIVE DL-0001",
        "long_name": "Penske Automotive Group, Inc.",
        "summary": "Penske Automotive Group, Inc., a diversified transportation services company, operates automotive and commercial truck dealerships. The company operates through four segments: Retail Automotive, Retail Commercial Truck, Other, and Non-Automotive Investments. It operates dealerships under franchise agreements with various automotive manufacturers and distributors. The company engages in the sale of new and used motor vehicles, and related products and services comprise vehicle and collision repair services, as well as placement of finance and lease contracts, third-party insurance products, and other aftermarket products; and wholesale of parts. It also operates a heavy and medium duty truck dealership, which offers Freightliner and Western Star branded trucks, as well as a range of used trucks, and maintenance and repair services. In addition, it imports and distributes Western Star heavy-duty trucks, MAN heavy and medium duty trucks, buses, and Dennis Eagle refuse collection vehicles with associated parts in Australia, New Zealand, and portions of the Pacific. Further, the company distributes diesel and gas engines, and power systems. The company operates 304 retail automotive franchises, including 142 franchises located in the United States and 162 franchises located outside of the United States; 17 used vehicle supercenters in the United States and the United Kingdom; and 25 commercial truck dealerships in Texas, Oklahoma, Tennessee, Georgia, Utah, and Idaho, the United States, as well as Canada. Penske Automotive Group, Inc. was incorporated in 1990 and is headquartered in Bloomfield Hills, Michigan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MI",
        "city": "Bloomfield Hills",
        "zipcode": "48302-0954",
        "website": "http://www.penskeautomotive.com",
        "market_cap": "Mid Cap"
    },
    "VRM": {
        "short_name": "Vroom, Inc.",
        "long_name": "Vroom, Inc.",
        "summary": "Vroom, Inc. operates an e-commerce platform for buying and selling of new and used cars in the United States. It also offers financing solutions. The company was formerly known as Auto America, Inc. and changed its name to Vroom, Inc. in July 2015. The company was incorporated in 2012 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10018",
        "website": "http://www.vroom.com",
        "market_cap": "Mid Cap"
    },
    "XA4.F": {
        "short_name": "CARMAX INC.  DL-,50",
        "long_name": "CarMax, Inc.",
        "summary": "CarMax, Inc., through its subsidiaries, operates as a retailer of used vehicles in the United States. The company operates in two segments, CarMax Sales Operations and CarMax Auto Finance. It offers customers a range of makes and models of used vehicles, including domestic, imported, and luxury vehicles; vehicles that do not meet its retail standards to licensed dealers through on-site wholesale auctions; and extended protection plans to customers at the time of sale. The company also provides reconditioning and vehicle repair services; and financing alternatives for retail customers across a range of credit spectrum through its CarMax Auto Finance and arrangements with various financial institutions. As of February 29, 2020, it operated approximately 216 stores and 2 new car franchises. CarMax, Inc. was founded in 1993 and is based in Richmond, Virginia.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "VA",
        "city": "Richmond",
        "zipcode": "23238",
        "website": "http://www.carmax.com",
        "market_cap": "Large Cap"
    }
}