{
  "ACEL": {
    "city": "Burr Ridge",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Gambling",
    "long_name": "Accel Entertainment, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Accel Entertainment, Inc.",
    "state": "IL",
    "summary": "Accel Entertainment, Inc., together with its subsidiaries, operates as a distributed gaming operator in the United States. It is involved in the installation, maintenance, and operation of video game terminals; redemption devices that disburse winnings and contain automated teller machine (ATM) functionality; and other amusement devices in authorized non-casino locations, such as restaurants, bars, taverns, convenience stores, liquor stores, truck stops, and grocery stores. The company also provides licensed establishment partners with gaming solutions that appeal to players who patronize those businesses. In addition, it operates stand-alone ATMs in gaming and non-gaming locations, as well as amusement devices, including jukeboxes, dartboards, pool tables, pinball machines, and other related entertainment equipment. As of December 31, 2020, the company operated 12,247 video gaming terminals across 2,435 locations in Illinois. Accel Entertainment, Inc. is headquartered in Burr Ridge, Illinois.",
    "website": "http://www.accelentertainment.com",
    "zipcode": "60527"
  },
  "AGS": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Gambling",
    "long_name": "PlayAGS, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PlayAGS, Inc.",
    "state": "NV",
    "summary": "PlayAGS, Inc. designs and supplies gaming products and services for the gaming industry in the United States and internationally. It operates through three segments: Electronic Gaming Machines (EGM), Table Products, and Interactive Games (Interactive). The EGM segment offers various video slot titles for the marketplace; and EGM cabinets, including the Alora, Orion Portrait, Orion Rise, Orion Upright, ICON, Big Red, and Orion Slant. This segment also provides conversion kits that allow existing game titles to be converted to other game titles offered within that operating platform. It serves Class II Native American, Mexico, and the Philippines gaming jurisdictions, as well as Class III Native American, commercial, and charitable jurisdictions. The Table Products segment offers table products, including live felt table games, side bet offerings, progressives, card shufflers, signage, and other ancillary table game equipment, as well as table technology related to blackjack, poker, baccarat, craps, and roulette. This segment also provides Dex S, a single deck card shuffler for poker tables. Its brands include In Bet, Buster Blackjack, Double Draw Poker, and Criss Cross Poker. The Interactive segment offers a platform for business-to-business content aggregation used by real-money gaming and sports-betting partners; and business-to-consumer social casino games through its mobile app, Lucky Play Casino. The company was formerly known as AP Gaming Holdco, Inc. and changed its name to PlayAGS, Inc. in December 2017. PlayAGS, Inc. was incorporated in 2005 and is headquartered in Las Vegas, Nevada.",
    "website": "http://www.playags.com",
    "zipcode": "89118"
  },
  "BRVO": {
    "city": "Virginia Beach",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Gambling",
    "long_name": "Bravo Multinational Incorporated",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BRAVO MULTINATIONAL INCORPORATE",
    "state": "VA",
    "summary": "Bravo Multinational Incorporated engages in buying, leasing, and selling gaming equipment. The company was formerly known as Goldland Holdings Co. and changed its name to Bravo Multinational Incorporated in April 2016. Bravo Multinational Incorporated was founded in 1989 and is based in Virginia Beach, Virginia.",
    "website": "http://www.bravomultinational.com",
    "zipcode": "23454"
  },
  "CHDN": {
    "city": "Louisville",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Gambling",
    "long_name": "Churchill Downs Incorporated",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Churchill Downs, Incorporated",
    "state": "KY",
    "summary": "Churchill Downs Incorporated operates as a racing, online wagering, and gaming entertainment company in the United States. It operates through three segments: Churchill Downs, Online Wagering, and Gaming. As of March 18, 2021, the company owned and operated three pari-mutuel gaming entertainment venues with approximately 3,050 historical racing machines (HRMs) in Kentucky; TwinSpires, an online wagering platform for horse racing, sports, and iGaming; seven retail sportsbooks; and casino gaming in eight states with approximately 11,000 slot machines and video lottery terminals, and 200 table games. It also offers streaming video of live horse races, replays, and an assortment of racing and handicapping information; and provides the Bloodstock Research Information Services platform for horse racing statistical data. In addition, the company manufactures and operates pari-mutuel wagering systems for racetracks, off-track betting facilities, and other pari-mutuel wagering businesses; and provides totalizator services. Churchill Downs Incorporated was incorporated in 1928 and is headquartered in Louisville, Kentucky.",
    "website": "http://www.churchilldownsincorporated.com",
    "zipcode": "40222"
  },
  "CHR.F": {
    "city": "Louisville",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Gambling",
    "long_name": "Churchill Downs Incorporated",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CHURCHILL DOWNS INC.",
    "state": "KY",
    "summary": "Churchill Downs Incorporated operates as a racing, online wagering, and gaming entertainment company in the United States. It operates through three segments: Churchill Downs, Online Wagering, and Gaming. As of March 18, 2021, the company owned and operated three pari-mutuel gaming entertainment venues with approximately 3,050 historical racing machines (HRMs) in Kentucky; TwinSpires, an online wagering platform for horse racing, sports, and iGaming; seven retail sportsbooks; and casino gaming in eight states with approximately 11,000 slot machines and video lottery terminals, and 200 table games. It also offers streaming video of live horse races, replays, and an assortment of racing and handicapping information; and provides the Bloodstock Research Information Services platform for horse racing statistical data. In addition, the company manufactures and operates pari-mutuel wagering systems for racetracks, off-track betting facilities, and other pari-mutuel wagering businesses; and provides totalizator services. Churchill Downs Incorporated was incorporated in 1928 and is headquartered in Louisville, Kentucky.",
    "website": "http://www.churchilldownsincorporated.com",
    "zipcode": "40222"
  },
  "CHR.SG": {
    "city": "Louisville",
    "country": "United States",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Gambling",
    "long_name": "Churchill Downs Incorporated",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CHURCHILL DOWNS INC. Registered",
    "state": "KY",
    "summary": "Churchill Downs Incorporated operates as a racing, online wagering, and gaming entertainment company in the United States. It operates through three segments: Churchill Downs, Online Wagering, and Gaming. As of March 18, 2021, the company owned and operated three pari-mutuel gaming entertainment venues with approximately 3,050 historical racing machines (HRMs) in Kentucky; TwinSpires, an online wagering platform for horse racing, sports, and iGaming; seven retail sportsbooks; and casino gaming in eight states with approximately 11,000 slot machines and video lottery terminals, and 200 table games. It also offers streaming video of live horse races, replays, and an assortment of racing and handicapping information; and provides the Bloodstock Research Information Services platform for horse racing statistical data. In addition, the company manufactures and operates pari-mutuel wagering systems for racetracks, off-track betting facilities, and other pari-mutuel wagering businesses; and provides totalizator services. Churchill Downs Incorporated was incorporated in 1928 and is headquartered in Louisville, Kentucky.",
    "website": "http://www.churchilldownsincorporated.com",
    "zipcode": "40222"
  },
  "CPHC": {
    "city": "Shakopee",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Gambling",
    "long_name": "Canterbury Park Holding Corporation",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Canterbury Park Holding Corpora",
    "state": "MN",
    "summary": "Canterbury Park Holding Corporation hosts pari-mutuel wagering on horse races and unbanked card games at its Canterbury park racetrack and card casino facility in Shakopee, Minnesota. The company operates through four segments: Horse Racing, Card Casino, Food and Beverage, and Development. The Horse Racing segment operates year-round simulcasting of horse races and wagering on live thoroughbred; and quarter horse races on a seasonal basis. The Card Casino segment offers unbanked card games, such as poker and table games. The Food and Beverage segment operates concession stands, restaurants and buffets, bars, and other food venues; and café style restaurants and full service bars within the Card Casino and simulcast area. This segment also provides lounge services; buffet restaurant; various concession style food and beverages; and catering and events services. The Development segment engages in real estate development complementary with racetrack operations; and various development opportunities, such as residential development, office, restaurants, hotel, entertainment, and retail operations. It is also involved in related services and activities, such as parking, advertising signage, publication sales, and other entertainment events and activities. The company was founded in 1994 and is based in Shakopee, Minnesota.",
    "website": "http://www.canterburypark.com",
    "zipcode": "55379"
  },
  "D2KN34.SA": {
    "city": "Boston",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Gambling",
    "long_name": "DraftKings Inc.",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "DRAFTKINGS  DRN",
    "state": "MA",
    "summary": "DraftKings Inc. operates as a digital sports entertainment and gaming company in the United States. It operates through two segments, Business-to-Consumer and Business-to-Business. The company provides users with daily sports, sports betting, and iGaming opportunities. It is also involved in the design, development, and licensing of sports betting and casino gaming platform software for online and retail sportsbook, and casino gaming products. The company distributes its product offerings through various channels, including traditional websites, direct app downloads, and direct-to-consumer digital platforms. DraftKings Inc. is headquartered in Boston, Massachusetts.",
    "website": "http://www.draftkings.com",
    "zipcode": "02116"
  },
  "DKNG": {
    "city": "Boston",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Gambling",
    "long_name": "DraftKings Inc.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "DraftKings Inc.",
    "state": "MA",
    "summary": "DraftKings Inc. operates as a digital sports entertainment and gaming company in the United States. It operates through two segments, Business-to-Consumer and Business-to-Business. The company provides users with daily sports, sports betting, and iGaming opportunities. It is also involved in the design, development, and licensing of sports betting and casino gaming platform software for online and retail sportsbook, and casino gaming products. The company distributes its product offerings through various channels, including traditional websites, direct app downloads, and direct-to-consumer digital platforms. DraftKings Inc. is headquartered in Boston, Massachusetts.",
    "website": "http://www.draftkings.com",
    "zipcode": "02116"
  },
  "DKNG.MX": {
    "city": "Boston",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Gambling",
    "long_name": "DraftKings Inc.",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "DRAFTKINGS INC",
    "state": "MA",
    "summary": "DraftKings Inc. operates as a digital sports entertainment and gaming company in the United States. It operates through two segments, Business-to-Consumer and Business-to-Business. The company provides users with daily sports, sports betting, and iGaming opportunities. It is also involved in the design, development, and licensing of sports betting and casino gaming platform software for online and retail sportsbook, and casino gaming products. The company distributes its product offerings through various channels, including traditional websites, direct app downloads, and direct-to-consumer digital platforms. DraftKings Inc. is headquartered in Boston, Massachusetts.",
    "website": "http://www.draftkings.com",
    "zipcode": "02116"
  },
  "EBET": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Gambling",
    "long_name": "Esports Technologies, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Esports Technologies, Inc.",
    "state": "NV",
    "summary": "Esports Technologies, Inc., a technology company, develops and operates platforms that focuses on esports and competitive gaming worldwide. The company operates gogawi.com, a licensed online gambling platform, which is an esports/sportsbook that focuses on bettors located in Asia and Latin America. It also offers iGaming, which include online casino and table games, such as blackjack, virtual sport computer simulated games, and slot machines, as well as traditional sports betting. The company is based in Las Vegas, Nevada.",
    "website": "http://www.esportstechnologies.com",
    "zipcode": "89101"
  },
  "ELRA": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Gambling",
    "long_name": "Elray Resources, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ELRAY RESOURCES INC",
    "state": "NV",
    "summary": "Elray Resources, Inc., a technology company, owns and licenses gaming intellectual property, gaming content, gaming domains, and trademarks in the United States and internationally. It provides marketing tools and CRM systems for online gaming operators. The company is based in Las Vegas, Nevada.",
    "website": "http://www.elraytech.com",
    "zipcode": "89103"
  },
  "EMBR": {
    "city": "San Clemente",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Gambling",
    "long_name": "Embarr Downs, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "EMBARR DOWNS INC",
    "state": "CA",
    "summary": "Embarr Downs, Inc., through its subsidiaries, engages in buying, selling, and racing thoroughbreds in the United States. It also focuses on acquiring and renovating single-family and multi-family properties. In addition, the company provides consulting services to organizations in various industries; and develops various gourmet food products. Embarr Downs, Inc. is based in San Clemente, California.",
    "website": "http://www.embarrdowns.com",
    "zipcode": "92674"
  },
  "EPGG": {
    "city": "Bellport",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Gambling",
    "long_name": "Empire Global Gaming, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "EMPIRE GLOBAL GAMING INC",
    "state": "NY",
    "summary": "Empire Global Gaming, Inc. engages in gaming business worldwide. It develops, manufactures, and sells casino electronic and table games for the general-public and casinos. The company owns rights through license agreements to four patents consisting of 14 roulette games patents; and eight patented casino grade mechanical and electronic games. It also sells a line of public and casino grade gaming products for roulette, blackjack, craps, baccarat, mini baccarat, pinwheels, Sic Bo, slot machines, poker tables, and bingo games; and offers consulting and advisory services to the gaming industry. In addition, the company operates lottopick3.com, a Website that provides analytical data to consumers on various lottery type games, as well as focuses on operating a website that sells certain equipment and proprietary games. Empire Global Gaming, Inc. was incorporated in 2010 and is based in Bellport, New York.",
    "website": "http://www.empireglobalgaminginc.com",
    "zipcode": "11713"
  },
  "EVRI": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Gambling",
    "long_name": "Everi Holdings Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Everi Holdings Inc.",
    "state": "NV",
    "summary": "Everi Holdings Inc. provides entertainment and technology solutions for the casino and digital gaming industries in the United States, Canada, the United Kingdom, Europe, the Caribbean, Central America, and Asia. It operates in two segments, Games and FinTech. The company offers local and wide-area progressive gaming products, such as classic mechanical reel games and video reel games, as well as TournEvent, a slot tournament terminal and system machine; and sells player terminals, licenses, back office systems, and other related equipment. It also provides cash access services, such as ATM cash withdrawals, POS debit card cash access transactions, and credit card cash access transactions; check verification and warranty services; CashClub, a software payments platform that provides gaming establishments with a personal computer workstation software user interface and point-of-sale terminal; fully integrated kiosks that provide multiple functions to the casino floor; loyalty kiosk and related equipment; and other integrated kiosk solutions. In addition, the company offers non-ATM terminals that perform authorizations for credit card cash access and POS debit card transactions; database services. Further, it provides Everi Compliance solutions to assist casino operators with meeting regulatory requirements; Central Credit, a gaming patron credit bureau service; JackpotXpress, a jackpot payout and tax form management platform; and loyalty platform, as well as support and maintenance services. The company was formerly known as Global Cash Access Holdings, Inc. and changed its name to Everi Holdings Inc. in August 2015. Everi Holdings Inc. was founded in 1998 and is headquartered in Las Vegas, Nevada.",
    "website": "http://www.everi.com",
    "zipcode": "89113"
  },
  "FCNE": {
    "city": "Dallas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Gambling",
    "long_name": "Four Corners, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "FOUR CORNERS INC",
    "state": "TX",
    "summary": "Four Corners, Inc., an investment holding company, operates as a gaming and recreation company in Texas. The company distributes electronic bingo games and related equipment, supplies, and branded pull tabs to charity bingo licensees. It also distributes gaming machines and other gaming related equipment to the Native American casino market. The company is based in Dallas, Texas.",
    "website": "http://www.fourcornersinc.com",
    "zipcode": "75243"
  },
  "G2C.F": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Gambling",
    "long_name": "Everi Holdings Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "EVERI HLDGS INC.  DL-,001",
    "state": "NV",
    "summary": "Everi Holdings Inc. provides entertainment and technology solutions for the casino and digital gaming industries in the United States, Canada, the United Kingdom, Europe, the Caribbean, Central America, and Asia. It operates in two segments, Games and FinTech. The company offers local and wide-area progressive gaming products, such as classic mechanical reel games and video reel games, as well as TournEvent, a slot tournament terminal and system machine; and sells player terminals, licenses, back office systems, and other related equipment. It also provides cash access services, such as ATM cash withdrawals, POS debit card cash access transactions, and credit card cash access transactions; check verification and warranty services; CashClub, a software payments platform that provides gaming establishments with a personal computer workstation software user interface and point-of-sale terminal; fully integrated kiosks that provide multiple functions to the casino floor; loyalty kiosk and related equipment; and other integrated kiosk solutions. In addition, the company offers non-ATM terminals that perform authorizations for credit card cash access and POS debit card transactions; database services. Further, it provides Everi Compliance solutions to assist casino operators with meeting regulatory requirements; Central Credit, a gaming patron credit bureau service; JackpotXpress, a jackpot payout and tax form management platform; and loyalty platform, as well as support and maintenance services. The company was formerly known as Global Cash Access Holdings, Inc. and changed its name to Everi Holdings Inc. in August 2015. Everi Holdings Inc. was founded in 1998 and is headquartered in Las Vegas, Nevada.",
    "website": "http://www.everi.com",
    "zipcode": "89113"
  },
  "GAN": {
    "city": "Irvine",
    "country": "United States",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Gambling",
    "long_name": "GAN Limited",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GAN Limited",
    "state": "CA",
    "summary": "GAN Limited operates as a business-to-business supplier of internet gambling software-as-a-service solutions to online casino gaming and online sports betting applications in the United States, Italy, the United Kingdom and Channel Islands, and internationally. The company operates through Real Money iGaming (RMiG) and Simulated Gaming (SIM) segments. It offers and licenses GameSTACK, a proprietary internet gambling enterprise software system as a turnkey technology solution for regulated real-money internet gambling, encompassing internet gaming, internet sports gaming, and virtual simulated gaming. The company also offers sports betting, online casino game, and peer-to-peer poker services through its Coolbet.com website, as well as a range of professional and managed services designed to deploy and provide ongoing operational support for its software systems. It serves regional operators and individual tribal casino operators. The company was founded in 2002 and is headquartered in Irvine, California.",
    "website": "http://www.gan.com",
    "zipcode": "92618"
  },
  "GMER": {
    "city": "Kennett Square",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Gambling",
    "long_name": "Good Gaming, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GOOD GAMING INC",
    "state": "PA",
    "summary": "Good Gaming, Inc. operates tournament gaming platform and online destination targeting esports players and participants that want to compete at the high school or college level worldwide. The company is based in Kennett Square, Pennsylvania.",
    "website": "http://www.good-gaming.com",
    "zipcode": "19348"
  },
  "GNOG": {
    "city": "Houston",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Gambling",
    "long_name": "Golden Nugget Online Gaming, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Golden Nugget Online Gaming, In",
    "state": "TX",
    "summary": "Golden Nugget Online Gaming, Inc. operates as an online gaming and digital sports entertainment company. It offers patrons to play their favorite casino games and bet on live-action sports events in New Jersey and Michigan. The company is headquartered in Houston, Texas.",
    "website": "http://www.gnoginc.com",
    "zipcode": "77027"
  },
  "KNBA": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Gambling",
    "long_name": "Kinbasha Gaming International, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "KINBASHA GAMING INTERNATIONAL I",
    "state": "NV",
    "summary": "Kinbasha Gaming International, Inc. owns and operates retail gaming centers in Japan. The company operates pachinko parlors that offer customers to play the pachinko and pachislo games. As of March 31, 2013, it operated 21 pachinko parlors, including 18 parlors in the Japanese prefecture of Ibaraki, 2 parlors in the Tokyo metropolis, and 1 parlor in the Chiba prefecture. The company was founded in 1954 and is headquartered in Las Vegas, Nevada.",
    "website": "http://kinbashainc.com",
    "zipcode": "89169"
  },
  "LTFD": {
    "city": "Austin",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Gambling",
    "long_name": "Littlefield Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LITTLEFIELD CORP",
    "state": "TX",
    "summary": "Littlefield Corporation, through its subsidiaries, acquires and operates bingo halls in the United States. The company was formerly known as American Bingo & Gaming Corporation. Littlefield Corporation was founded in 1994 and is headquartered in Austin, Texas.",
    "website": "http://www.littlefield.com",
    "zipcode": "78705"
  },
  "NTGL": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Gambling",
    "long_name": "NanoTech Gaming, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NANOTECH GAMING INC",
    "state": "NV",
    "summary": "NanoTech Gaming, Inc. develops gaming products in the United States. It creates gaming experiences using patent pending math models and non-traditional designs in the land-based casino and arcade gaming markets. It offers gaming products to traditional players and gamblers. The company was formerly known as High Velocity Enterprises, Inc. and changed its name to NanoTech Gaming, Inc. in April 2015. The company was founded in 1989 and is headquartered in Las Vegas, Nevada. As of February 2, 2015, NanoTech Gaming, Inc. operates as a subsidiary of NanoTech Entertainment, Inc.",
    "website": "http://www.nanotechgaming.com",
    "zipcode": "89118"
  },
  "RSI": {
    "city": "Chicago",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Gambling",
    "long_name": "Rush Street Interactive, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Rush Street Interactive, Inc.",
    "state": "IL",
    "summary": "Rush Street Interactive, Inc. operates as an online casino and sports betting company in the United States and Latin America. It provides real-money online casino, online and retail sports wagering, and social gaming services. The company was founded in 2012 and is headquartered in Chicago, Illinois.",
    "website": "http://www.rushstreetinteractive.com",
    "zipcode": "60611"
  },
  "SGMS": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Gambling",
    "long_name": "Scientific Games Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Scientific Games Corp",
    "state": "NV",
    "summary": "Scientific Games Corporation develops technology-based products and services, and related content for the gaming, lottery, social and digital gaming industries in the United States and internationally. The company's Gaming segment sells new and used gaming machines, electronic table systems, video lottery terminals, conversion game kits, and spare parts; slot, casino, and table-management systems; table products, including shufflers; and perpetual licenses to proprietary table games. It also leases gaming machines; provides gaming operations and licensing arrangements; and installs and supports casino management systems, such as ongoing hardware and software maintenance and upgrade services of customer casino management systems. The company's Lottery segment designs, prints, and sells instant lottery products; designs and manufactures instant games tickets; offers instant products planning, monitoring, management system, warehousing, inventory management, distribution, marketing, and game support functions; supplies player loyalty programs, merchandising services, and interactive marketing campaigns; and sublicenses brands for lottery products and lottery-related promotional products. It also provides software, hardware, and related services for lottery operations; and lottery systems software maintenance and support services. The company's SciPlay segment sells virtual coins, chips, or bingo cards; and third-party branded games and original content through mobile and web platforms. Its Digital segment provides digital gaming, iLottery, and sports betting solutions and services, including digital RMG and sports wagering solutions, distribution platforms, content, products, and services; software design, development, licensing, maintenance, and support services; Open Platform Systems; and content aggregation platforms. The company was incorporated in 1984 and is headquartered in Las Vegas, Nevada.",
    "website": "http://www.scientificgames.com",
    "zipcode": "89119"
  },
  "TJW.F": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Gambling",
    "long_name": "Scientific Games Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SCIENT.GAMES  DL-,01",
    "state": "NV",
    "summary": "Scientific Games Corporation develops technology-based products and services, and related content for the gaming, lottery, social and digital gaming industries in the United States and internationally. The company's Gaming segment sells new and used gaming machines, electronic table systems, video lottery terminals, conversion game kits, and spare parts; slot, casino, and table-management systems; table products, including shufflers; and perpetual licenses to proprietary table games. It also leases gaming machines; provides gaming operations and licensing arrangements; and installs and supports casino management systems, such as ongoing hardware and software maintenance and upgrade services of customer casino management systems. The company's Lottery segment designs, prints, and sells instant lottery products; designs and manufactures instant games tickets; offers instant products planning, monitoring, management system, warehousing, inventory management, distribution, marketing, and game support functions; supplies player loyalty programs, merchandising services, and interactive marketing campaigns; and sublicenses brands for lottery products and lottery-related promotional products. It also provides software, hardware, and related services for lottery operations; and lottery systems software maintenance and support services. The company's SciPlay segment sells virtual coins, chips, or bingo cards; and third-party branded games and original content through mobile and web platforms. Its Digital segment provides digital gaming, iLottery, and sports betting solutions and services, including digital RMG and sports wagering solutions, distribution platforms, content, products, and services; software design, development, licensing, maintenance, and support services; Open Platform Systems; and content aggregation platforms. The company was incorporated in 1984 and is headquartered in Las Vegas, Nevada.",
    "website": "http://www.scientificgames.com",
    "zipcode": "89119"
  },
  "TNA.V": {
    "city": "Lakewood",
    "country": "United States",
    "currency": "CAD",
    "exchange": "VAN",
    "industry": "Gambling",
    "long_name": "Evergreen Gaming Corporation",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "EVERGREEN GAMING CORPORATION",
    "state": "WA",
    "summary": "Evergreen Gaming Corporation engages in the gaming operations in the United States. It operates Riverside casino in Tukwila; Goldies Casino in Shoreline; and Chips and Palace casinos in Lakewood. The company's casinos offer card games, such as Poker, Blackjack, Spanish 21, 4-Card Poker, PaiGow, and Baccarat; and pull tabs, a game in which the player can win specified prizes by matching certain combinations concealed under perforated strips on each paper game piece. It also operates bars and restaurants in its casinos. The company is based in Lakewood, Washington.",
    "website": "http://www.evergreengaming.com",
    "zipcode": "98499"
  },
  "WPFH": {
    "city": "Los Angeles",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Gambling",
    "long_name": "World Poker Fund Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "WORLD POKER FUND HOLDINGS INC",
    "state": "CA",
    "summary": "World Poker Fund Holdings, Inc. provides sponsorship tournaments, entertainment, Web gaming, and casino and resort services. It discovers and develops poker careers for up-and- coming poker players; and produces reality TV series that are also offered on online. World Poker Fund Holdings, Inc. was formerly known as World Poker Fund Inc. and changed its name to World Poker Fund Holdings, Inc. in January 2015. The company is based in Los Angeles, California.",
    "website": "http://www.worldpokerfund.com",
    "zipcode": "90017"
  },
  "WPKS": {
    "city": "Bloomington",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Gambling",
    "long_name": "The World Poker Store, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "WORLD POKER STORE INC",
    "state": "MN",
    "summary": "The World Poker Store, Inc. runs and manages poker tournaments in the United States and internationally. It offers playing cards, poker books, poker chips, poker DVDs, poker supplies, poker tables, poker chip sets, poker chip cases, and wood chip cases. The company sells products to casinos, card rooms, online poker sites, and players; and online. The World Poker Store, Inc. was founded in 2004 and is based in Bloomington, Minnesota.",
    "website": "http://www.thebarpokerleague.com",
    "zipcode": "55431"
  }
}
