{
    "06S.F": {
        "short_name": "SPORTSMANS WAREH.HO.DL-01",
        "long_name": "Sportsman's Warehouse Holdings, Inc.",
        "summary": "Sportsman's Warehouse Holdings, Inc., together with its subsidiaries, operates as an outdoor sporting goods retailer in the United States. It offers camping products, such as backpacks, camp essentials, canoes and kayaks, coolers, outdoor cooking equipment, sleeping bags, tents, and tools; and clothing products, including camouflage, jackets, hats, outerwear, sportswear, technical gear, and work wear. The company also provides fishing products comprising bait, electronics, fishing rods, flotation items, fly fishing products, lines, lures, reels, tackles, and small boats; and foot wear products consisting of hiking and work boots, socks, sport sandals, technical footwear, trial and casual shoes, and waders. In addition, it offers hunting and shooting products, such as ammunition, archery items, ATV accessories, blinds and tree stands, decoys, firearms, firearms safety and storage products, reloading equipment, and shooting gear products; and optics, electronics, and accessories, including gift items, GPS devices, knives, lighting, optics, and two-way radios. Further, the company's stores provide archery technician services, fishing-reel line winding, gun bore sighting and scope mounting, and cleaning services, as well as issues hunting and fishing licenses. Additionally, it offers various private label and special make-up offerings under the Rustic Ridge, Killik, Vital Impact, Yukon Gold, Lost Creek, and Sportsman's Warehouse brands. As of March 31, 2021, the company operated through 112 stores in 27 states. Sportsman's Warehouse Holdings, Inc. was founded in 1986 and is headquartered in West Jordan, Utah.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "West Jordan"
    },
    "163.F": {
        "short_name": "ACUSHNET HLDGS.CORP -,001",
        "long_name": "Acushnet Holdings Corp.",
        "summary": "Acushnet Holdings Corp. designs, develops, manufactures, and distributes golf products in the United States, Europe, the Middle East, Africa, Japan, Korea, and internationally. The company operates through four segments: Titleist Golf Balls, Titleist Golf Clubs, Titleist Golf Gear, and FootJoy Golf Wear. The Titleist Golf Balls segment offers golf balls, such as Pro V1, Pro V1x, AVX, Tour Soft, Velocity, and Pinnacle golf balls, as well as provides custom imprinted golf balls with corporate logos, tournament logos, country club or resort logos, and personalization on Titleist and Pinnacle golf balls. The Titleist Golf Clubs segment designs, assembles, and sells golf clubs, such as drivers, fairways, hybrids, and irons under the Titleist brand; wedges under the Vokey Design brand; and putters under Scotty Cameron brand. The Titleist Golf Gear segment designs and develops golf bags, headwear, golf gloves, travel products, head covers, and other golf accessories, as well as offers customization and personalization of products in Titleist golf gear. The FootJoy Golf Wear segment provides traditional, casual, athletic, and spikeless shoes; gloves that include leather construction, synthetic, and leather/synthetic combination, as well as specialty gloves comprising rain and winter specific offerings; and outerwear and apparels, such as golf outerwear, and men's and women's golf apparels. It sells its products through on-course golf shops and golf specialty retailers, as well as through representatives, other qualified retailers, and online. The company was formerly known as Alexandria Holdings Corp. and changed its name to Acushnet Holdings Corp. in March 2016. Acushnet Holdings Corp. was founded in 1910 and is headquartered in Fairhaven, Massachusetts.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Fairhaven"
    },
    "1YN.F": {
        "short_name": "YETI HOLDINGS INC  DL-,01",
        "long_name": "YETI Holdings, Inc.",
        "summary": "YETI Holdings, Inc. designs, markets, retails, and distributes products for the outdoor and recreation market under the YETI brand. The company offers hard and soft coolers, as well as storage, transport, outdoor living, and associated accessories. It also provides drinkware products, such as colsters, lowballs, wine tumblers, stackable pints, tumblers, mugs, bottles, and jugs, as well as accessories comprising bottle straw caps, tumbler handles, jug mounts, and bottle slings under the Rambler brand. In addition, the company offers YETI-branded gear products, such as hats, shirts, bottle openers, and ice substitutes. It sells its products through independent retailers, including outdoor specialty, hardware, sporting goods, and farm and ranch supply stores, as well as through Website. The company operates in the United States, Canada, Australia, New Zealand, Europe, Hong Kong, China, Singapore, and Japan. YETI Holdings, Inc. was founded in 2006 and is headquartered in Austin, Texas.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Austin"
    },
    "2ON.F": {
        "short_name": "PELOTON INTE.A DL-,000025",
        "long_name": "Peloton Interactive, Inc.",
        "summary": "Peloton Interactive, Inc. provides interactive fitness products in North America and internationally. It offers connected fitness products, such as the Peloton Bike and the Peloton Tread, which include touchscreen that streams live and on-demand classes. The company also provides connected fitness subscriptions for multiple household users, and access to all live and on-demand classes, as well as Peloton Digital app for connected fitness subscribers to provide access to its classes. As of December 09, 2020, it had approximately 3.6 million members. The company markets and sells its interactive fitness products directly through its retail showrooms and at onepeloton.com. Peloton Interactive, Inc. was founded in 2012 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "New York"
    },
    "6FE.F": {
        "short_name": "SIX FLAGS ENTERTAIN.DL-01",
        "long_name": "Six Flags Entertainment Corporation",
        "summary": "Six Flags Entertainment Corporation owns and operates regional theme and waterparks under the Six Flags name. Its parks offer various thrill rides, water attractions, themed areas, concerts and shows, restaurants, game venues, and retail outlets. As of March 18, 2021, the company operated 26 parks in the United States, Mexico, and Canada. The company was formerly known as Six Flags, Inc. and changed its name to Six Flags Entertainment Corporation in April 2010. Six Flags Entertainment Corporation was founded in 1961 and is based in Arlington, Texas.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Arlington"
    },
    "ABKB": {
        "short_name": "AMERICAN BASKETBALL ASSOCIATION",
        "long_name": "American Basketball Association, Inc.",
        "summary": "American Basketball Association, Inc. operates the American Basketball Association, a professional basketball league in the United States. The company was founded in 1967 and is based in Indianapolis, Indiana.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Indianapolis"
    },
    "AHFI": {
        "short_name": "ABSOLUTE HEALTH & FITNESS INC",
        "long_name": "Absolute Health and Fitness, Inc.",
        "summary": "Absolute Health and Fitness, Inc. owns and operates gyms. Absolute Health and Fitness, Inc. was formerly known as Ornate Holdings, Inc. and changed its name to Absolute Health and Fitness, Inc. in May 2004. The company is based in Carson City, Nevada.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Carson City"
    },
    "ALTD": {
        "short_name": "ALTITUDE INTERNATIONAL INC",
        "long_name": "Altitude International Holdings, Inc.",
        "summary": "Altitude International Holdings, Inc. provides custom built simulated altitude chambers and position specific protocols in the United States. The company's products include extreme environmental chambers that provide the exact range of extreme temperatures, humidity, and oxygen levels; and altitude training controls. It designs, develops, manufactures, and installs simulated altitude athletic equipment. The company was formerly known as Altitude International, Inc. and changed its name to Altitude International Holdings, Inc. in August 2020. Altitude International Holdings, Inc. is based in Port Saint Lucie, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Port Saint Lucie"
    },
    "AOUT": {
        "short_name": "American Outdoor Brands, Inc.",
        "long_name": "American Outdoor Brands, Inc.",
        "summary": "American Outdoor Brands, Inc. provides outdoor products and accessories for rugged outdoor enthusiasts in the United States and internationally. The company offers hunting, fishing, camping, shooting, and personal security and defense products. Its products include shooting supplies, rests, vaults, and other related accessories; premium sportsmen knives and tools for fishing and hunting; land management tools for hunting preparedness; harvesting products for post-hunt or post-fishing activities; electro-optical devices comprising hunting optics, firearm aiming devices, flashlights, and laser grips; reloading, gunsmithing, and firearm cleaning supplies; and survival, camping, and emergency preparedness products. The company sells its products through e-commerce and traditional distribution channels under the Marksman, Defender, Harvester, and Adventure brand lanes. American Outdoor Brands, Inc. was incorporated in 2020 and is headquartered in Columbia, Missouri.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Columbia"
    },
    "AVPI": {
        "short_name": "AVP INC",
        "long_name": "AVP, Inc.",
        "summary": "AVP, Inc. produces, markets, and distributes volleyball events worldwide. The company was founded in 1983 and is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "BBIG": {
        "short_name": "Vinco Ventures, Inc.",
        "long_name": "Vinco Ventures, Inc.",
        "summary": "Vinco Ventures, Inc. operates as a consumer product research and development, manufacturing, sales, and fulfillment company in North America, the Asia Pacific, and Europe. It offers toys, plush, homewares, and electronics to retailers, distributors, and manufacturers through e-commerce channels; and personal protective equipment to governmental agencies, hospitals, and distributors. The company was formerly known as Edison Nation, Inc. and changed its name to Vinco Ventures, Inc. in November 2020. Vinco Ventures, Inc. was incorporated in 2017 and is based in Bethlehem, Pennsylvania.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Bethlehem"
    },
    "BC": {
        "short_name": "Brunswick Corporation",
        "long_name": "Brunswick Corporation",
        "summary": "Brunswick Corporation designs, manufactures, and markets recreation products worldwide. It operates through Propulsion; Parts & Accessories; and Boat segments. The Propulsion segment provides outboard, sterndrive, and inboard engines for independent boat builders and governments through marine dealers and distributors, specialty marine retailers, and marine service centers; and propulsion-related controls, rigging, and propellers to original equipment manufacturers and aftermarket retailers, distributors, and distribution businesses. This segment offers its products under the Mercury Marine, Mercury, Mercury MerCruiser, Mariner, Mercury Racing, and Mercury Diesel brands. The Parts & Accessories segment provides engine parts and consumables, electrical products, boat parts and systems, engine oils and lubricants, marine electronics and control systems, instruments, trolling motors, fuel systems, and electrical systems, as well as specialty vehicle, mobile, and transportation aftermarket products for aftermarket retailers, distributors, and distribution businesses, as well for as for the original equipment manufacturers in marine and non-marine markets; and supplies parts and accessories through the distribution business. This segment offers its products under the under the Mercury, Mercury Precision Parts, Quicksilver, and Seachoice brands. The Boat segment provides Sea Ray sport boats and cruisers; Bayliner sport cruisers and runabouts; Boston Whaler fiberglass offshore boats; Lund fiberglass fishing boats; Crestliner, Cypress Cay, Harris, Lowe, Lund, and Princecraft aluminum fishing, utility, pontoon, and deck boats; Heyday tow/wake boats; and Thunder Jet heavy-gauge aluminum boats, as well as shared access boat club and dealer services to the marine industry through dealers and distributors. Brunswick Corporation was founded in 1845 and is headquartered in Mettawa, Illinois.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Mettawa"
    },
    "BRSE": {
        "short_name": "BROADSIDE ENTERPRISES INC",
        "long_name": "Broadside Enterprises, Inc.",
        "summary": "Broadside Enterprises, Inc. operates in media, branded goods, real estate, and blockchain technologies businesses. Its Media division focuses on the development, financing, acquisition, and distribution of media assets. The company's Branded Goods division focuses on discovering and building brands with stellar potential. This division utilizes information technology, as well as its media expertise to connect brands directly to consumers. Its Real Estate division seeks to finance, acquire, and develop long-term assets in residential and commercial real estate, as well as natural resources with focus on Africa and the Middle East. The company's Blockchain Technologies division focuses on crypto-mining operation, as well as developing token and blockchain applications for the media, branded goods, and real estate industries. Broadside Enterprises, Inc. was formerly known as Emaji, Inc. and changed its name to Broadside Enterprises, Inc. in December 2016. The company was incorporated in 1996 and is based in West Hollywood, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "West Hollywood"
    },
    "BTDG": {
        "short_name": "B2DIGITAL INC",
        "long_name": "B2Digital, Incorporated",
        "summary": "B2Digital, Incorporated operates as a live event sports company in the United States. It is creating and developing league champions; and developing systems and technologies for the operation of the B2 Fighting Series, including social media marketing, event management, digital ticketing sales, digital video distribution, digital marketing, PPV, free to view, merchandise sales, brand management, and financial control systems. The company was incorporated in 2004 and is based in Tampa, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Tampa"
    },
    "BTN": {
        "short_name": "Ballantyne Strong, Inc.",
        "long_name": "Ballantyne Strong, Inc",
        "summary": "Ballantyne Strong, Inc. operates in the entertainment industry worldwide. The company manufactures and sells projection screens and customized screen support systems directly, as well as through third-party distributors and integrators. It also manufactures and distributes curvilinear immersive screens to theme parks, museums, and schools, as well as for special events and military applications. In addition, the company provides digital projection equipment installations and after-sale maintenance and network support services directly to theater owners and other entertainment-related markets, as well as through dealers or value added reseller networks. Further, it distributes and supports third party products, including digital projectors, servers, library management systems, menu boards, sound systems, lenses, and lamps. Ballantyne Strong, Inc. was founded in 1932 and is headquartered in Charlotte, North Carolina.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "city": "Charlotte"
    },
    "BWI.F": {
        "short_name": "BRUNSWICK CORP.  DL-,75",
        "long_name": "Brunswick Corporation",
        "summary": "Brunswick Corporation designs, manufactures, and markets recreation products worldwide. It operates through Propulsion; Parts & Accessories; and Boat segments. The Propulsion segment provides outboard, sterndrive, and inboard engines for independent boat builders and governments through marine dealers and distributors, specialty marine retailers, and marine service centers; and propulsion-related controls, rigging, and propellers to original equipment manufacturers and aftermarket retailers, distributors, and distribution businesses. This segment offers its products under the Mercury Marine, Mercury, Mercury MerCruiser, Mariner, Mercury Racing, and Mercury Diesel brands. The Parts & Accessories segment provides engine parts and consumables, electrical products, boat parts and systems, engine oils and lubricants, marine electronics and control systems, instruments, trolling motors, fuel systems, and electrical systems, as well as specialty vehicle, mobile, and transportation aftermarket products for aftermarket retailers, distributors, and distribution businesses, as well for as for the original equipment manufacturers in marine and non-marine markets; and supplies parts and accessories through the distribution business. This segment offers its products under the under the Mercury, Mercury Precision Parts, Quicksilver, and Seachoice brands. The Boat segment provides Sea Ray sport boats and cruisers; Bayliner sport cruisers and runabouts; Boston Whaler fiberglass offshore boats; Lund fiberglass fishing boats; Crestliner, Cypress Cay, Harris, Lowe, Lund, and Princecraft aluminum fishing, utility, pontoon, and deck boats; Heyday tow/wake boats; and Thunder Jet heavy-gauge aluminum boats, as well as shared access boat club and dealer services to the marine industry through dealers and distributors. Brunswick Corporation was founded in 1845 and is headquartered in Mettawa, Illinois.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Mettawa"
    },
    "BWMG": {
        "short_name": "BROWNIES MARINE GROUP INC",
        "long_name": "Brownie's Marine Group, Inc.",
        "summary": "Brownie's Marine Group, Inc., together with its subsidiaries, designs, tests, manufactures, and distributes recreational hookah diving, yacht-based scuba air compressor and nitrox generation systems, and scuba and water safety products in the United States and internationally. The company operates through three segments: Legacy SSA Products, High Pressure Gas Systems, and Ultra Portable Tankless Dive Systems. It also manufactures and sells high pressure air and industrial gas compressor packages. In addition, the company offers battery operated and portable electric surface supply air diving systems and electric shallow dive systems. Further, it offers tankless dive systems, boat integrated air systems, and kayak diving hose kits, as well as fast float rescue harness products, hose systems, bell bottom flag bags, and garment integrated personal flotation devices. The company sells its products on wholesale basis to retail dive stores, marine stores, boat dealers, and builders; and retails its products to boat owners, recreational divers, and commercial divers, as well as through the Internet. Brownie's Marine Group, Inc. was founded in 1981 and is headquartered in Pompano Beach, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Pompano Beach"
    },
    "CCL.L": {
        "short_name": "CARNIVAL PLC ORD USD 1.66",
        "long_name": "Carnival Corporation & plc",
        "summary": "Carnival Corporation & plc operates as a leisure travel company. Its ships visit approximately 700 ports under the Carnival Cruise Line, Princess Cruises, Holland America Line, P&O Cruises (Australia), Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises (UK), and Cunard brand names. The company also provides port destinations and other services, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. It sells its cruises primarily through travel agents and tour operators. The company operates in the United States, Canada, Continental Europe, the United Kingdom, Australia, New Zealand, Asia, and internationally. It operates 87 ships with 223,000 lower berths. The company was incorporated in 1972 and is headquartered in Miami, Florida.",
        "currency": "GBp",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United States",
        "city": "Miami"
    },
    "CLAR": {
        "short_name": "Clarus Corporation",
        "long_name": "Clarus Corporation",
        "summary": "Clarus Corporation focuses on the outdoor and consumer industries in the United States, Canada, Europe, the Middle East, Asia, Australia, New Zealand, Africa, and South America. The company develops, manufactures, and distributes outdoor equipment and lifestyle products focusing on the climb, ski, mountain, sport, and skincare markets. It operates in two segments, Black Diamond and Sierra. The Black Diamond segment offers activity-based apparel, such as shells, insulation, midlayers, pants, and logowear; rock-climbing footwear and equipment, including carabiners, protection devices, harnesses, belay devices, helmets, and ice-climbing gears; technical backpacks and day packs; trekking poles; headlamps and lanterns; gloves and mittens; skincare and other sport-enhancing products; and skis, ski poles, ski skins, and snow safety products, such as avalanche airbag systems, avalanche transceivers, shovels, and probes. This segment offers its products for climbing, mountaineering, trail running, backpacking, skiing, and other outdoor recreation activities under the Black Diamond Equipment, PIEPS, and SKINourishment brands. The Sierra segment manufactures bullets and ammunition products for rifles and pistols, which are used for precision target shooting, hunting, and military and law enforcement purposes under the Sierra brand. The company sells its products to mountain, rock, ice, and gym climbers; and winter outdoor enthusiasts, backpackers, competitive shooters, hunters, and outdoor consumers. It markets and distributes its products through independent specialty stores and specialty chains, sporting goods and outdoor recreation stores, distributors, and original equipment manufacturers; and independent distributors, as well as directly to customers through its websites. The company was formerly known as Black Diamond, Inc. and changed its name to Clarus Corporation in August 2017. Clarus Corporation was incorporated in 1991 and is headquartered in Salt Lake City, Utah.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Salt Lake City"
    },
    "CLUBQ": {
        "short_name": "Town Sports International Holdi",
        "long_name": "Town Sports International Holdings, Inc.",
        "summary": "Town Sports International Holdings, Inc., together with its subsidiaries, owns and operates fitness clubs in the Northeast and Mid-Atlantic regions of the United States. The company's clubs offer special purpose rooms for group fitness classes; and other exercise programs, as well as accommodate cardiovascular and strength-training equipment. Its clubs also provide amenities, including swimming pools, racquet and basketball courts, and functional training zones, as well as babysitting services; and fee-based program services, which comprise personal and small group training, children's programs, and summer camps for kids. The company sells its memberships through direct sales at the club level, as well as corporate and group sales; and through its Websites. As of December 31, 2019, it owned and operated 186 fitness clubs. The company was founded in 1973 and is based in Jupiter, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Jupiter"
    },
    "CLVFA": {
        "short_name": "CLOVERLEAF KENNEL CLUB",
        "long_name": "Cloverleaf Kennel Club",
        "summary": "Cloverleaf Kennel Club operates facilities for greyhound dog races. The company is based in Loveland, Colorado.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Loveland"
    },
    "CLY.F": {
        "short_name": "CALLAWAY GOLF  DL-,01",
        "long_name": "Callaway Golf Company",
        "summary": "Callaway Golf Company, together with its subsidiaries, designs, manufactures, and sells golf clubs and golf balls, apparel, gear, and other products. It operates through two segments, Golf Equipment; and Apparel, Gear and Other. The Golf Equipment segment provides drivers, fairway woods, hybrids, irons, wedges and packaged sets, putters, and pre-owned golf clubs under the Callaway and Odyssey brands, as well as golf balls under the Callaway Golf and Strata brand names. The Apparel, Gear and Other segment offers golf apparel and footwear; golf accessories, including golf bags, golf gloves, headwear, and practice aids under the Callaway brand; and golf and lifestyle apparel, hats, luggage and accessories, footwear, belts, hats, socks, and underwear under the TravisMathew brand name. This segment also provides storage gear for sport and personal use, including backpacks; travel, duffel, and golf bags; and storage gear accessories, as well as outerwear, headwear, and accessories under the OGIO brand. In addition, it offers outdoor apparel, such as jackets, and trousers and tops; and footwear and outdoor equipment, including packs and bags, travel bags, tents, sleeping bags, and accessories. The company sells its products through golf retailers, sporting goods retailers, mass merchants, Internet retailers, department stores, field representatives, on-line retailers, mail order stores, and in-house sales representatives, as well as to third-party distributors in the United States and approximately 100 countries. It also offers pre-owned golf products through its Website callawaygolfpreowned.com; and OGIO and TravisMathew products through its Websites callawaygolf.com, odysseygolf.com, ogio.com, and travismathew.com. The company was incorporated in 1982 and is headquartered in Carlsbad, California.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Carlsbad"
    },
    "CUK": {
        "short_name": "Carnival Plc",
        "long_name": "Carnival Corporation & plc",
        "summary": "Carnival Corporation & plc operates as a leisure travel company. Its ships visit approximately 700 ports under the Carnival Cruise Line, Princess Cruises, Holland America Line, P&O Cruises (Australia), Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises (UK), and Cunard brand names. The company also provides port destinations and other services, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. It sells its cruises primarily through travel agents and tour operators. The company operates in the United States, Canada, Continental Europe, the United Kingdom, Australia, New Zealand, Asia, and internationally. It operates 87 ships with 223,000 lower berths. The company was incorporated in 1972 and is headquartered in Miami, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Miami"
    },
    "CUKPF": {
        "short_name": "CARNIVAL PLC",
        "long_name": "Carnival Corporation & plc",
        "summary": "Carnival Corporation & plc operates as a leisure travel company. Its ships visit approximately 700 ports under the Carnival Cruise Line, Princess Cruises, Holland America Line, P&O Cruises (Australia), Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises (UK), and Cunard brand names. The company also provides port destinations and other services, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. It sells its cruises primarily through travel agents and tour operators. The company operates in the United States, Canada, Continental Europe, the United Kingdom, Australia, New Zealand, Asia, and internationally. It operates 87 ships with 223,000 lower berths. The company was incorporated in 1972 and is headquartered in Miami, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Miami"
    },
    "DAAT": {
        "short_name": "DAC TECHNOLOGIES GROUP INTL INC",
        "long_name": "DAC Technologies Group International, Inc.",
        "summary": "DAC Technologies Group International, Inc. manufactures and markets consumer products for wholesale, retail, and OEM gun manufacturing markets. The company specializes in gun cleaning kits, gun safety devices, security items, and other outdoor products. It offers products in the categories of gun cleaning kits and accessories, other shooting and outdoor accessories, licensed products, gun locks, and safes. The company sells its products to mass merchants, retail chains, sporting goods retailers, distributors, and OEM gun manufacturers. It also markets its products through catalog companies. The company was formerly known as DAC Technologies of America, Inc. and changed its name to DAC Technologies Group International, Inc. in July 1999. The company was incorporated in 1993 and is based in Little Rock, Arkansas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Little Rock"
    },
    "DF3.F": {
        "short_name": "NAUTILUS INC.",
        "long_name": "Nautilus, Inc.",
        "summary": "Nautilus, Inc., a fitness solutions company, designs, develops, sources, and markets cardio and strength fitness products, and related accessories for consumer and commercial use in the United States, Canada, and internationally. The company operates in two segments, Direct and Retail. It offers specialized cardio products, treadmills, ellipticals, bike products, home gyms, dumbbells, barbells, and kettlebells primarily under the Nautilus, Bowflex, Octane Fitness, Schwinn, and Universal brands, as well as fitness digital platform under the JRNY brand. In addition, it engages in licensing its brands and intellectual properties. The company offers its products directly to consumers through television advertising, social media, websites, and catalogs; and through a network of retail companies consisting of sporting goods stores, Internet retailers, and large-format and warehouse stores, as well as specialty retailers and independent bike dealers. Nautilus, Inc. was founded in 1986 and is headquartered in Vancouver, Washington.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Vancouver"
    },
    "DS-PB": {
        "short_name": "Drive Shack Inc. Preferred Seri",
        "long_name": "Drive Shack Inc.",
        "summary": "Drive Shack Inc. owns and operates golf-related leisure and entertainment venue business. It operates through Entertainment Golf Venues and Traditional Golf Properties segments. The Entertainment Golf Venues segment operates entertainment golf venues in Raleigh, North Carolina; Richmond, Virginia; and Orlando and West Palm Beach, Florida. Its entertainment golf venues offer leisure and social entertainment services with gaming and golf technology, a chef-inspired menu, and craft cocktails, as well as social events. The Traditional Golf Properties segment owns and operates golf properties in the United States. As of December 31, 2020, it owned, leased, or managed 60 properties in 9 states. Drive Shack Inc. also invests in loans and securities. The company was formerly known as Newcastle Investment Corp. and changed its name to Drive Shack Inc. in December 2016. Drive Shack Inc. was founded in 2002 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Dallas"
    },
    "DS-PC": {
        "short_name": "Drive Shack Inc. Preferred Seri",
        "long_name": "Drive Shack Inc.",
        "summary": "Drive Shack Inc. owns and operates golf-related leisure and entertainment venue business. It operates through Entertainment Golf Venues and Traditional Golf Properties segments. The Entertainment Golf Venues segment operates entertainment golf venues in Raleigh, North Carolina; Richmond, Virginia; and Orlando and West Palm Beach, Florida. Its entertainment golf venues offer leisure and social entertainment services with gaming and golf technology, a chef-inspired menu, and craft cocktails, as well as social events. The Traditional Golf Properties segment owns and operates golf properties in the United States. As of December 31, 2020, it owned, leased, or managed 60 properties in 9 states. Drive Shack Inc. also invests in loans and securities. The company was formerly known as Newcastle Investment Corp. and changed its name to Drive Shack Inc. in December 2016. Drive Shack Inc. was founded in 2002 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Dallas"
    },
    "DS-PD": {
        "short_name": "Drive Shack Inc. Pfd Ser D",
        "long_name": "Drive Shack Inc.",
        "summary": "Drive Shack Inc. owns and operates golf-related leisure and entertainment venue business. It operates through Entertainment Golf Venues and Traditional Golf Properties segments. The Entertainment Golf Venues segment operates entertainment golf venues in Raleigh, North Carolina; Richmond, Virginia; and Orlando and West Palm Beach, Florida. Its entertainment golf venues offer leisure and social entertainment services with gaming and golf technology, a chef-inspired menu, and craft cocktails, as well as social events. The Traditional Golf Properties segment owns and operates golf properties in the United States. As of December 31, 2020, it owned, leased, or managed 60 properties in 9 states. Drive Shack Inc. also invests in loans and securities. The company was formerly known as Newcastle Investment Corp. and changed its name to Drive Shack Inc. in December 2016. Drive Shack Inc. was founded in 2002 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Dallas"
    },
    "DS": {
        "short_name": "Drive Shack Inc.",
        "long_name": "Drive Shack Inc.",
        "summary": "Drive Shack Inc. owns and operates golf-related leisure and entertainment venue business. It operates through Entertainment Golf Venues and Traditional Golf Properties segments. The Entertainment Golf Venues segment operates entertainment golf venues in Raleigh, North Carolina; Richmond, Virginia; and Orlando and West Palm Beach, Florida. Its entertainment golf venues offer leisure and social entertainment services with gaming and golf technology, a chef-inspired menu, and craft cocktails, as well as social events. The Traditional Golf Properties segment owns and operates golf properties in the United States. As of December 31, 2020, it owned, leased, or managed 60 properties in 9 states. Drive Shack Inc. also invests in loans and securities. The company was formerly known as Newcastle Investment Corp. and changed its name to Drive Shack Inc. in December 2016. Drive Shack Inc. was founded in 2002 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Dallas"
    },
    "DVD": {
        "short_name": "Dover Motorsports, Inc.",
        "long_name": "Dover Motorsports, Inc.",
        "summary": "Dover Motorsports, Inc. markets and promotes motorsports entertainment in the United States. It owns and operates Dover International Speedway in Dover, Delaware; and Nashville Superspeedway near Nashville, Tennessee. The company was formerly known as Dover Downs Entertainment, Inc. Dover Motorsports, Inc. was founded in 1969 and is based in Dover, Delaware.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Dover"
    },
    "ECMH": {
        "short_name": "ENCOMPASS HOLDINGS INC",
        "long_name": "Encompass Holdings, Inc.",
        "summary": "Encompass Holdings, Inc., through its subsidiaries, designs, manufactures, and markets recreational water sports equipment in the United States. It offers XBoard, a jet-powered personal watercraft that allows various skill level riders. The company provides information technology solutions to corporate clients, supporting business operations with applications, such as e-commerce, content management, software auditing, and customer relationship management. It sells forensic software under the name ATTEST Systems. The company's ATTEST Systems offers GASP, a software product that enables companies to discover the software and hardware assets deployed across their enterprise. The company was formerly known as Nova Communications LTD. and changed its name to Encompass Holdings, Inc. in January 2006. Encompass Holdings, Inc. was incorporated in 1985 and is based in Reno, Nevada.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Reno"
    },
    "ED9.F": {
        "short_name": "ESCALADE INC.",
        "long_name": "Escalade, Incorporated",
        "summary": "Escalade, Incorporated, together with its subsidiaries, manufactures and sells sporting goods in North America, Europe, and internationally. The company manufactures, imports, and distributes various sporting goods brands in basketball goals, archery, indoor and outdoor game recreation, and fitness products. It offers archery products under the Bear Archery, Trophy Ridge, Whisker Biscuit, Cajun Bowfishing, Karnage, Fletcher, SIK, BearX, and Rocket brand names; table tennis products under the STIGA and Ping-Pong brands; basketball goals under the Goalrilla, Goaliath, Silverback, Hoopstar, and Goalsetter brand names; and pickleball under the Onix, DURA, and Pickleball Now brands. The company also provides play systems under the Woodplay, Jack & June, and Childlife brands; fitness products under the STEP, Lifeline, Kettleworx, Natural Fitness, and PER4M brand names; safety and utility weights under the USWeight brand; hockey and soccer game tables under the Triumph Sports, Atomic, American Legend, and HJ Scott brands; and billiard accessories under the American Heritage Billiards, Cue&Case, Lucasi, Mizerak, PureX, Rage, and Players brand names. In addition, it offers darting products under the Unicorn, Accudart, Arachnid, Nodor, and Winmau brands; water sports under the RAVE Sports brand; and outdoor game products under the Victory Tailgate, Triumph Sports, Zume Games, and Viva Sol brand names. The company provides its products through sporting goods retailers, specialty dealers, online retailers, traditional department stores, and mass merchants. Escalade, Incorporated was founded in 1922 and is headquartered in Evansville, Indiana.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Evansville"
    },
    "EFLS": {
        "short_name": "EXERCISE FOR LIFE SYSTEMS",
        "long_name": "Exercise For Life Systems, Inc.",
        "summary": "Exercise For Life Systems, Inc. does not have significant operations. Previously, it provided personal fitness training services and products in Charlotte, North Carolina. The company is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "ELY": {
        "short_name": "Callaway Golf Company",
        "long_name": "Callaway Golf Company",
        "summary": "Callaway Golf Company, together with its subsidiaries, designs, manufactures, and sells golf clubs and golf balls, apparel, gear, and other products. It operates through two segments, Golf Equipment; and Apparel, Gear and Other. The Golf Equipment segment provides drivers, fairway woods, hybrids, irons, wedges and packaged sets, putters, and pre-owned golf clubs under the Callaway and Odyssey brands, as well as golf balls under the Callaway Golf and Strata brand names. The Apparel, Gear and Other segment offers golf apparel and footwear; golf accessories, including golf bags, golf gloves, headwear, and practice aids under the Callaway brand; and golf and lifestyle apparel, hats, luggage and accessories, footwear, belts, hats, socks, and underwear under the TravisMathew brand name. This segment also provides storage gear for sport and personal use, including backpacks; travel, duffel, and golf bags; and storage gear accessories, as well as outerwear, headwear, and accessories under the OGIO brand. In addition, it offers outdoor apparel, such as jackets, and trousers and tops; and footwear and outdoor equipment, including packs and bags, travel bags, tents, sleeping bags, and accessories. The company sells its products through golf retailers, sporting goods retailers, mass merchants, Internet retailers, department stores, field representatives, on-line retailers, mail order stores, and in-house sales representatives, as well as to third-party distributors in the United States and approximately 100 countries. It also offers pre-owned golf products through its Website callawaygolfpreowned.com; and OGIO and TravisMathew products through its Websites callawaygolf.com, odysseygolf.com, ogio.com, and travismathew.com. The company was incorporated in 1982 and is headquartered in Carlsbad, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Carlsbad"
    },
    "ESCA": {
        "short_name": "Escalade, Incorporated",
        "long_name": "Escalade, Incorporated",
        "summary": "Escalade, Incorporated, together with its subsidiaries, manufactures and sells sporting goods in North America, Europe, and internationally. The company manufactures, imports, and distributes various sporting goods brands in basketball goals, archery, indoor and outdoor game recreation, and fitness products. It offers archery products under the Bear Archery, Trophy Ridge, Whisker Biscuit, Cajun Bowfishing, Karnage, Fletcher, SIK, BearX, and Rocket brand names; table tennis products under the STIGA and Ping-Pong brands; basketball goals under the Goalrilla, Goaliath, Silverback, Hoopstar, and Goalsetter brand names; and pickleball under the Onix, DURA, and Pickleball Now brands. The company also provides play systems under the Woodplay, Jack & June, and Childlife brands; fitness products under the STEP, Lifeline, Kettleworx, Natural Fitness, and PER4M brand names; safety and utility weights under the USWeight brand; hockey and soccer game tables under the Triumph Sports, Atomic, American Legend, and HJ Scott brands; and billiard accessories under the American Heritage Billiards, Cue&Case, Lucasi, Mizerak, PureX, Rage, and Players brand names. In addition, it offers darting products under the Unicorn, Accudart, Arachnid, Nodor, and Winmau brands; water sports under the RAVE Sports brand; and outdoor game products under the Victory Tailgate, Triumph Sports, Zume Games, and Viva Sol brand names. The company provides its products through sporting goods retailers, specialty dealers, online retailers, traditional department stores, and mass merchants. Escalade, Incorporated was founded in 1922 and is headquartered in Evansville, Indiana.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "city": "Evansville"
    },
    "FNKO": {
        "short_name": "Funko, Inc.",
        "long_name": "Funko, Inc.",
        "summary": "Funko, Inc., a pop culture consumer products company, designs, sources, and distributes licensed pop culture products in the United States, Europe, and internationally. The company offers vinyl, blind-packed miniature, and action figures; plush products; accessories; apparels, such as t-shirts and hats; homewares, including drinkware, party lights and other home accessories, such as keychains, pens, and pins; and bags, purses and wallets, and board games. It offers its products under the Pop!, Loungefly, Mystery Minis, Paka Paka, Funko Soda, and Snapsies brand names; and licenses its properties under the classic evergreen, movie release, current TV, and current video game categories. The company sells its products to specialty retailers, mass-market retailers, e-commerce sites, and distributors; and at specialty licensing and comic book shows, conventions, and exhibitions, as well as through its e-commerce business. Funko, Inc. was incorporated in 2017 and is headquartered in Everett, Washington.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Everett"
    },
    "FTFY": {
        "short_name": "FIT AFTER FIFTY INC",
        "long_name": "Fit After Fifty, Inc.",
        "summary": "Fit After Fifty, Inc. franchises group exercise studios in the United States. These studios offer a thirty-minute moderately paced exercise program for mature adults. The company was founded in 2003 and is based in St. Augustine, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Melbourne"
    },
    "FU2.F": {
        "short_name": "FUNKO INC. CL.A DL -,0001",
        "long_name": "Funko, Inc.",
        "summary": "Funko, Inc., a pop culture consumer products company, designs, sources, and distributes licensed pop culture products in the United States, Europe, and internationally. The company offers vinyl, blind-packed miniature, and action figures; plush products; accessories; apparels, such as t-shirts and hats; homewares, including drinkware, party lights and other home accessories, such as keychains, pens, and pins; and bags, purses and wallets, and board games. It offers its products under the Pop!, Loungefly, Mystery Minis, Paka Paka, Funko Soda, and Snapsies brand names; and licenses its properties under the classic evergreen, movie release, current TV, and current video game categories. The company sells its products to specialty retailers, mass-market retailers, e-commerce sites, and distributors; and at specialty licensing and comic book shows, conventions, and exhibitions, as well as through its e-commerce business. Funko, Inc. was incorporated in 2017 and is headquartered in Everett, Washington.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Everett"
    },
    "FUN": {
        "short_name": "Cedar Fair, L.P.",
        "long_name": "Cedar Fair, L.P.",
        "summary": "Cedar Fair, L.P. owns and operates amusement and water parks, and complementary resort facilities in the United States and Canada. Its amusement parks include Cedar Point located on Lake Erie between Cleveland and Toledo in Sandusky, Ohio; Knott's Berry Farm near Los Angeles, California; Canada's Wonderland near Toronto, Ontario; Kings Island near Cincinnati, Ohio; Carowinds in Charlotte, North Carolina; Kings Dominion situated near Richmond, Virginia; California's Great America located in Santa Clara, California; Dorney Park & Wildwater Kingdom in Allentown, Pennsylvania; Worlds of Fun located in Kansas City, Missouri; Valleyfair situated near Minneapolis/St. Paul, Minnesota; Michigan's Adventure situated near Muskegon, Michigan; Schlitterbahn Waterpark & Resort New Braunfels in New Braunfels, Texas; and Schlitterbahn Waterpark Galveston in Galveston, Texas. The company also manages and operates Gilroy Gardens Family Theme Park in Gilroy, California; and owns and operates the Castaway Bay Indoor Waterpark Resort, Hotel Breakers, Cedar Point's Express Hotel, and Sawmill Creek Resort. As of February 17, 2021, the company operated 13 properties, which included 11 amusement parks, four separately gated outdoor water parks, and resort accommodations totaling approximately 2,300 rooms and 600 luxury RV sites; and an additional theme park in California under a management contract. Cedar Fair Management, Inc. serves as the general partner of Cedar Fair, L.P. The company was founded in 1983 and is headquartered in Sandusky, Ohio.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Sandusky"
    },
    "GBBT": {
        "short_name": "GLOBAL BOATWORKS HOLDINGS INC",
        "long_name": "Global Boatworks Holdings, Inc.",
        "summary": "R3 Score Technologies, Inc. develops a data driven scoring tool for criminal background screenings. The company offers a software-as-a-service (SaaS) software product, R3 Score, which predicts productivity, competency, and risk level of criminal-background individuals for lenders and employers. It serves banks, landlords, colleges and universities, and financial institutions. The company was founded in 2017 and is based in Baltimore, Maryland.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Baltimore"
    },
    "GLXZ": {
        "short_name": "GALAXY GAMING INC",
        "long_name": "Galaxy Gaming, Inc.",
        "summary": "Galaxy Gaming, Inc., a gaming company, designs, develops, acquires, assembles, markets, and licenses proprietary casino table games and associated technology, platforms, and systems for the gaming industry. The company's proprietary table games comprise side bets, which are proprietary features and wagering options added to public domain games, such as poker, baccarat, pai gow poker, craps, and blackjack table games; and premium games, which are stand-alone games with their own unique set of rules and strategies. It offers side bets under the Lucky Ladies, 21+3, and Bonus Craps titles; and premium games under the Heads Up Hold 'em, High Card Flush, Cajun Stud, and Three Card Poker. It also provides enhanced table systems, which include Bonus Jackpot System, an electronic system installed on gaming tables designed to collect data by detecting player wagers and other game activities. In addition, the company offers automated electronic tables and ancillary equipment, as well as relicenses various game titles to operators of online gaming systems. The company markets its products to online casinos worldwide; land-based casino gaming companies in North America, the Caribbean, Central America, the United Kingdom, Europe, and Africa; and cruise ship companies. Galaxy Gaming, Inc. is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "GOLF": {
        "short_name": "Acushnet Holdings Corp.",
        "long_name": "Acushnet Holdings Corp.",
        "summary": "Acushnet Holdings Corp. designs, develops, manufactures, and distributes golf products in the United States, Europe, the Middle East, Africa, Japan, Korea, and internationally. The company operates through four segments: Titleist Golf Balls, Titleist Golf Clubs, Titleist Golf Gear, and FootJoy Golf Wear. The Titleist Golf Balls segment offers golf balls, such as Pro V1, Pro V1x, AVX, Tour Soft, Velocity, and Pinnacle golf balls, as well as provides custom imprinted golf balls with corporate logos, tournament logos, country club or resort logos, and personalization on Titleist and Pinnacle golf balls. The Titleist Golf Clubs segment designs, assembles, and sells golf clubs, such as drivers, fairways, hybrids, and irons under the Titleist brand; wedges under the Vokey Design brand; and putters under Scotty Cameron brand. The Titleist Golf Gear segment designs and develops golf bags, headwear, golf gloves, travel products, head covers, and other golf accessories, as well as offers customization and personalization of products in Titleist golf gear. The FootJoy Golf Wear segment provides traditional, casual, athletic, and spikeless shoes; gloves that include leather construction, synthetic, and leather/synthetic combination, as well as specialty gloves comprising rain and winter specific offerings; and outerwear and apparels, such as golf outerwear, and men's and women's golf apparels. It sells its products through on-course golf shops and golf specialty retailers, as well as through representatives, other qualified retailers, and online. The company was formerly known as Alexandria Holdings Corp. and changed its name to Acushnet Holdings Corp. in March 2016. Acushnet Holdings Corp. was founded in 1910 and is headquartered in Fairhaven, Massachusetts.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Fairhaven"
    },
    "H1AS34.SA": {
        "short_name": "HASBRO INC  DRN",
        "long_name": "Hasbro, Inc.",
        "summary": "Hasbro, Inc., together with its subsidiaries, operates as a play and entertainment company. The company's U.S. and Canada segment markets and sells action figures, arts and crafts, and creative play products; electronic toys and related electronic interactive products; fashion and other dolls, infant products, play sets, preschool toys, plush products, and sports action blasters and accessories; and vehicles and toy-related specialty products, as well as traditional board games, and trading card and role-playing games primarily in the United States and Canada. Its International segment markets and sells toy and game products primarily in the Europe, the Asia Pacific, and Latin and South American regions. The company's Entertainment, Licensing and Digital segment engages in consumer products licensing, digital gaming, Hasbro legacy movie, and television entertainment operations. Its eOne segment acquires, finances, develops, produces, distributes, and sells entertainment content, including film, television, and music, as well as family programming, merchandising and licensing, digital content, and live entertainment. The company offers its products primarily under the MAGIC: THE GATHERING, MY LITTLE PONY, NERF, TRANSFORMERS, PLAY-DOH, MONOPOLY, BABY ALIVE, POWER RANGERS, PEPPA PIG, and PJ MASKS brands, as well as through premier partner brands. The company sells its products to wholesalers, distributors, chain stores, discount stores, drug stores, mail order houses, catalog stores, department stores, and other traditional retailers, as well as e-commerce retailers; and directly to customer through Hasbro PULSE e-commerce website. Hasbro, Inc. was founded in 1923 and is headquartered in Pawtucket, Rhode Island.",
        "currency": "BRL",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Pawtucket"
    },
    "HAS.DE": {
        "short_name": "HASBRO INC.  DL-,50",
        "long_name": "Hasbro, Inc.",
        "summary": "Hasbro, Inc., together with its subsidiaries, operates as a play and entertainment company. The company's U.S. and Canada segment markets and sells action figures, arts and crafts, and creative play products; electronic toys and related electronic interactive products; fashion and other dolls, infant products, play sets, preschool toys, plush products, and sports action blasters and accessories; and vehicles and toy-related specialty products, as well as traditional board games, and trading card and role-playing games primarily in the United States and Canada. Its International segment markets and sells toy and game products primarily in the Europe, the Asia Pacific, and Latin and South American regions. The company's Entertainment, Licensing and Digital segment engages in consumer products licensing, digital gaming, Hasbro legacy movie, and television entertainment operations. Its eOne segment acquires, finances, develops, produces, distributes, and sells entertainment content, including film, television, and music, as well as family programming, merchandising and licensing, digital content, and live entertainment. The company offers its products primarily under the MAGIC: THE GATHERING, MY LITTLE PONY, NERF, TRANSFORMERS, PLAY-DOH, MONOPOLY, BABY ALIVE, POWER RANGERS, PEPPA PIG, and PJ MASKS brands, as well as through premier partner brands. The company sells its products to wholesalers, distributors, chain stores, discount stores, drug stores, mail order houses, catalog stores, department stores, and other traditional retailers, as well as e-commerce retailers; and directly to customer through Hasbro PULSE e-commerce website. Hasbro, Inc. was founded in 1923 and is headquartered in Pawtucket, Rhode Island.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Pawtucket"
    },
    "HAS.F": {
        "short_name": "HASBRO INC.  DL-,50",
        "long_name": "Hasbro, Inc.",
        "summary": "Hasbro, Inc., together with its subsidiaries, operates as a play and entertainment company. The company's U.S. and Canada segment markets and sells action figures, arts and crafts, and creative play products; electronic toys and related electronic interactive products; fashion and other dolls, infant products, play sets, preschool toys, plush products, and sports action blasters and accessories; and vehicles and toy-related specialty products, as well as traditional board games, and trading card and role-playing games primarily in the United States and Canada. Its International segment markets and sells toy and game products primarily in the Europe, the Asia Pacific, and Latin and South American regions. The company's Entertainment, Licensing and Digital segment engages in consumer products licensing, digital gaming, Hasbro legacy movie, and television entertainment operations. Its eOne segment acquires, finances, develops, produces, distributes, and sells entertainment content, including film, television, and music, as well as family programming, merchandising and licensing, digital content, and live entertainment. The company offers its products primarily under the MAGIC: THE GATHERING, MY LITTLE PONY, NERF, TRANSFORMERS, PLAY-DOH, MONOPOLY, BABY ALIVE, POWER RANGERS, PEPPA PIG, and PJ MASKS brands, as well as through premier partner brands. The company sells its products to wholesalers, distributors, chain stores, discount stores, drug stores, mail order houses, catalog stores, department stores, and other traditional retailers, as well as e-commerce retailers; and directly to customer through Hasbro PULSE e-commerce website. Hasbro, Inc. was founded in 1923 and is headquartered in Pawtucket, Rhode Island.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Pawtucket"
    },
    "HAS.MX": {
        "short_name": "HASBRO INC",
        "long_name": "Hasbro, Inc.",
        "summary": "Hasbro, Inc., together with its subsidiaries, operates as a play and entertainment company. The company's U.S. and Canada segment markets and sells action figures, arts and crafts, and creative play products; electronic toys and related electronic interactive products; fashion and other dolls, infant products, play sets, preschool toys, plush products, and sports action blasters and accessories; and vehicles and toy-related specialty products, as well as traditional board games, and trading card and role-playing games primarily in the United States and Canada. Its International segment markets and sells toy and game products primarily in the Europe, the Asia Pacific, and Latin and South American regions. The company's Entertainment, Licensing and Digital segment engages in consumer products licensing, digital gaming, Hasbro legacy movie, and television entertainment operations. Its eOne segment acquires, finances, develops, produces, distributes, and sells entertainment content, including film, television, and music, as well as family programming, merchandising and licensing, digital content, and live entertainment. The company offers its products primarily under the MAGIC: THE GATHERING, MY LITTLE PONY, NERF, TRANSFORMERS, PLAY-DOH, MONOPOLY, BABY ALIVE, POWER RANGERS, PEPPA PIG, and PJ MASKS brands, as well as through premier partner brands. The company sells its products to wholesalers, distributors, chain stores, discount stores, drug stores, mail order houses, catalog stores, department stores, and other traditional retailers, as well as e-commerce retailers; and directly to customer through Hasbro PULSE e-commerce website. Hasbro, Inc. was founded in 1923 and is headquartered in Pawtucket, Rhode Island.",
        "currency": "MXN",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Pawtucket"
    },
    "HAS": {
        "short_name": "Hasbro, Inc.",
        "long_name": "Hasbro, Inc.",
        "summary": "Hasbro, Inc., together with its subsidiaries, operates as a play and entertainment company. The company's U.S. and Canada segment markets and sells action figures, arts and crafts, and creative play products; electronic toys and related electronic interactive products; fashion and other dolls, infant products, play sets, preschool toys, plush products, and sports action blasters and accessories; and vehicles and toy-related specialty products, as well as traditional board games, and trading card and role-playing games primarily in the United States and Canada. Its International segment markets and sells toy and game products primarily in the Europe, the Asia Pacific, and Latin and South American regions. The company's Entertainment, Licensing and Digital segment engages in consumer products licensing, digital gaming, Hasbro legacy movie, and television entertainment operations. Its eOne segment acquires, finances, develops, produces, distributes, and sells entertainment content, including film, television, and music, as well as family programming, merchandising and licensing, digital content, and live entertainment. The company offers its products primarily under the MAGIC: THE GATHERING, MY LITTLE PONY, NERF, TRANSFORMERS, PLAY-DOH, MONOPOLY, BABY ALIVE, POWER RANGERS, PEPPA PIG, and PJ MASKS brands, as well as through premier partner brands. The company sells its products to wholesalers, distributors, chain stores, discount stores, drug stores, mail order houses, catalog stores, department stores, and other traditional retailers, as well as e-commerce retailers; and directly to customer through Hasbro PULSE e-commerce website. Hasbro, Inc. was founded in 1923 and is headquartered in Pawtucket, Rhode Island.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Pawtucket"
    },
    "HAS.VI": {
        "short_name": "HASBRO INC",
        "long_name": "Hasbro, Inc.",
        "summary": "Hasbro, Inc., together with its subsidiaries, operates as a play and entertainment company. The company's U.S. and Canada segment markets and sells action figures, arts and crafts, and creative play products; electronic toys and related electronic interactive products; fashion and other dolls, infant products, play sets, preschool toys, plush products, and sports action blasters and accessories; and vehicles and toy-related specialty products, as well as traditional board games, and trading card and role-playing games primarily in the United States and Canada. Its International segment markets and sells toy and game products primarily in the Europe, the Asia Pacific, and Latin and South American regions. The company's Entertainment, Licensing and Digital segment engages in consumer products licensing, digital gaming, Hasbro legacy movie, and television entertainment operations. Its eOne segment acquires, finances, develops, produces, distributes, and sells entertainment content, including film, television, and music, as well as family programming, merchandising and licensing, digital content, and live entertainment. The company offers its products primarily under the MAGIC: THE GATHERING, MY LITTLE PONY, NERF, TRANSFORMERS, PLAY-DOH, MONOPOLY, BABY ALIVE, POWER RANGERS, PEPPA PIG, and PJ MASKS brands, as well as through premier partner brands. The company sells its products to wholesalers, distributors, chain stores, discount stores, drug stores, mail order houses, catalog stores, department stores, and other traditional retailers, as well as e-commerce retailers; and directly to customer through Hasbro PULSE e-commerce website. Hasbro, Inc. was founded in 1923 and is headquartered in Pawtucket, Rhode Island.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "Pawtucket"
    },
    "JAKK": {
        "short_name": "JAKKS Pacific, Inc.",
        "long_name": "JAKKS Pacific, Inc.",
        "summary": "JAKKS Pacific, Inc. develops, produces, and markets toys, consumables, and electronics and related products worldwide. The company operates through two segments, Toys/Consumer Products and Halloween. It offers action figures and accessories, such as licensed characters; toy vehicles and accessories; dolls and accessories, including small, large, fashion, and baby dolls based on licenses, as well as infant and pre-school products; private label products; and foot-to-floor ride-on products, inflatable environments, tents, and wagons. The company also provides role play, dress-up, pretend play, and novelty products for boys and girls based on brands and entertainment properties, as well as on its own proprietary brands; and indoor and outdoor kids' furniture, activity trays and tables, room dÃ©cor, kiddie pools, and seasonal and outdoor products. In addition, it offers Halloween and everyday costumes for various ages based on licensed and proprietary non-licensed brands, and related Halloween accessories; outdoor activity toys; and junior sports toys, including hyper-charged balls, sport sets, and toy hoops. The company sells its products through in-house sales staff and independent sales representatives to toy and mass-market retail chain stores, department stores, office supply stores, drug and grocery store chains, club stores, toy specialty stores, and wholesalers. JAKKS Pacific, Inc. was founded in 1995 and is headquartered in Santa Monica, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Santa Monica"
    },
    "JMIH": {
        "short_name": "JUPITER MARINE INTL HLDGS INC",
        "long_name": "Jupiter Marine International Holdings, Inc.",
        "summary": "Jupiter Marine International Holdings, Inc. manufactures and sells sport fishing boats in the United States. The company was founded in 1989 and is based in Palmetto, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Palmetto"
    },
    "JOUT": {
        "short_name": "Johnson Outdoors Inc.",
        "long_name": "Johnson Outdoors Inc.",
        "summary": "Johnson Outdoors Inc. designs, manufactures, and markets camping, diving, watercraft, and marine electronics products worldwide. The company's Fishing segment offers electric motors for trolling or primary propulsion, marine battery chargers, and shallow water anchors; sonar and GPS equipment for fish finding, navigation, and marine cartography; and downriggers for controlled-depth fishing. This segment sells its products under the Minn Kota, Humminbird, and Cannon brands through outdoor specialty and Internet retailers, retail store chains, marine products distributors, original equipment manufacturers, and distributors. Its Camping segment offers consumer, commercial, and military tents and accessories; camping furniture and stoves; other recreational camping products; and portable outdoor cooking systems, as well as acts as a subcontract manufacturer for other providers of military tents. This segment sells its products under the Eureka! and Jetboil brands through independent sales representatives and Internet retailers. The company's Watercraft Recreation segment provides kayaks, canoes, and paddles for family recreation, touring, angling, and tripping through independent specialty and outdoor retailers under the Ocean Kayaks, Old Town, and Carlisle brands. Its Diving segment manufactures and markets underwater diving and snorkeling equipment, including regulators, buoyancy compensators, dive computers and gauges, wetsuits, masks, fins, snorkels, and accessories under the SCUBAPRO brand name. This segment also provides regular maintenance, product repair, diving education, and travel program services; and sells diving gear to dive training centers, resorts, public safety units, and armed forces. It sells its products through independent specialty dive stores and diving magazines, as well as through Websites. Johnson Outdoors Inc. was founded in 1970 and is headquartered in Racine, Wisconsin.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Racine"
    },
    "KENS": {
        "short_name": "KENILWORTH SYSTEMS CORP",
        "long_name": "Kenilworth Systems Corp.",
        "summary": "Kenilworth Systems Corporation, a development stage company, engages in the development of terminals that would permit individuals to play with live in-progress casino table games at locations inside and outside the casino confines worldwide. It would provide games through television simulcast of digital satellite and digital cable broadcasts to individuals at homes, offices, and public gathering places, as well as television sets. The company is selecting lotteries to manage and operate the distribution and cash handling using the lotteries' existing databases for the sale of lottery tickets, and paying winnings at regular lottery licensed terminal locations. Kenilworth Systems Corporation was founded in 1968 and is based in Mineola, New York.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Mineola"
    },
    "KICK": {
        "short_name": "HPN HOLDINGS INC",
        "long_name": "HPN Holdings, Inc.",
        "summary": "HPN Holdings, Inc. does not have significant operations. Previously, it was engaged in the management and operation of Master Glazier Karate Centers in Pennsylvania. The company is based in Bartlesville, Oklahoma.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Bartlesville"
    },
    "LCLP": {
        "short_name": "LIFE CLIPS INC",
        "long_name": "Life Clips, Inc.",
        "summary": "Life Clips, Inc. develops, manufactures, and sells cameras and batteries in the United States. The company offers body cameras; and develops and distributes single-use and cordless batteries under the Mobeego brand for use in cellular phones and other mobile devices. It also develops an auditable software solution for law enforcement. The company sells its products through retailers and distributors. Life Clips, Inc. was incorporated in 2013 and is based in Aventura, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Aventura"
    },
    "MAT": {
        "short_name": "Mattel, Inc.",
        "long_name": "Mattel, Inc.",
        "summary": "Mattel, Inc., a children's entertainment company, designs and produces toys and consumer products worldwide. The company operates through North America, International, and American Girl segments. It offers dolls and accessories, as well as content, gaming, and lifestyle products for children under the Barbie, American Girl, Polly Pocket, Spirit, and Enchantimals brands; dolls and books under the American Girl brand name; die-cast vehicles, tracks, playsets, and accessories for kids, adults, and collectors under the Hot Wheels, Matchbox, CARS, and Mario Kart brand names; and infant, toddler, and preschool products comprising content, toys, live events, and other lifestyle products under the Fisher-Price and Thomas & Friends, Power wheels, and Fireman Sam brands. The company also provides action figures, building sets, and games under the Masters of the Universe, MEGA, UNO, Toy Story, Jurassic World, WWE, and Star Wars brands; and licensor partner brands, including Disney, NBCUniversal, WWE, Microsoft, Nickelodeon, Warner Bros, and Sanrio. It sells its products directly to consumers through its catalog, website, and proprietary retail stores; retailers, including discount and free-standing toy stores, chain stores, department stores, and other retail outlets; and wholesalers, as well as through agents and distributors. Mattel, Inc. was founded in 1945 and is headquartered in El Segundo, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "El Segundo"
    },
    "MAT.VI": {
        "short_name": "MATTEL INC",
        "long_name": "Mattel, Inc.",
        "summary": "Mattel, Inc., a children's entertainment company, designs and produces toys and consumer products worldwide. The company operates through North America, International, and American Girl segments. It offers dolls and accessories, as well as content, gaming, and lifestyle products for children under the Barbie, American Girl, Polly Pocket, Spirit, and Enchantimals brands; dolls and books under the American Girl brand name; die-cast vehicles, tracks, playsets, and accessories for kids, adults, and collectors under the Hot Wheels, Matchbox, CARS, and Mario Kart brand names; and infant, toddler, and preschool products comprising content, toys, live events, and other lifestyle products under the Fisher-Price and Thomas & Friends, Power wheels, and Fireman Sam brands. The company also provides action figures, building sets, and games under the Masters of the Universe, MEGA, UNO, Toy Story, Jurassic World, WWE, and Star Wars brands; and licensor partner brands, including Disney, NBCUniversal, WWE, Microsoft, Nickelodeon, Warner Bros, and Sanrio. It sells its products directly to consumers through its catalog, website, and proprietary retail stores; retailers, including discount and free-standing toy stores, chain stores, department stores, and other retail outlets; and wholesalers, as well as through agents and distributors. Mattel, Inc. was founded in 1945 and is headquartered in El Segundo, California.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "El Segundo"
    },
    "MLFB": {
        "short_name": "MAJOR LEAGUE FOOTBALL INC",
        "long_name": "Major League Football, Inc.",
        "summary": "Major League Football, Inc. focuses to establish, develop, and operate Major League Football, a professional spring/summer football league. It intends to establish franchises in cities overlooked by existing professional sports leagues and provide fans with professional football in the National Football League off-seasons. The company was formerly known as Universal Capital Management, Inc. and changed its name to Major League Football, Inc. in November 2014. Major League Football, Inc. was founded in 2004 and is headquartered in Lakewood Ranch, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Lakewood Ranch"
    },
    "MSET": {
        "short_name": "MADISON SPORTS & ENTMT GROUP IN",
        "long_name": "Madison Sports & Entertainment Inc.",
        "summary": "Madison Sports & Entertainment Inc. is a sports promotion and entertainment company that arranges appearances by pro athletes, autograph signings, and boxing matches. The company also offers sports and entertainment products; represents athletes and celebrities for endorsements, personal appearances, and investments; and provides security products in the computer field. Additionally, it develops and owns videos and television shows and distributes rights of entertainment products. The company's subsidiaries include All Sports USA Inc., All Sports USA Boxing Inc., National Media Inc., Ski Trails USA Inc. and Bizzare Snowboards, Inc. Madison Sports & Entertainment is based in Fort Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Fort Lauderdale"
    },
    "MTT.DE": {
        "short_name": "MATTEL INC.  DL 1",
        "long_name": "Mattel, Inc.",
        "summary": "Mattel, Inc., a children's entertainment company, designs and produces toys and consumer products worldwide. The company operates through North America, International, and American Girl segments. It offers dolls and accessories, as well as content, gaming, and lifestyle products for children under the Barbie, American Girl, Polly Pocket, Spirit, and Enchantimals brands; dolls and books under the American Girl brand name; die-cast vehicles, tracks, playsets, and accessories for kids, adults, and collectors under the Hot Wheels, Matchbox, CARS, and Mario Kart brand names; and infant, toddler, and preschool products comprising content, toys, live events, and other lifestyle products under the Fisher-Price and Thomas & Friends, Power wheels, and Fireman Sam brands. The company also provides action figures, building sets, and games under the Masters of the Universe, MEGA, UNO, Toy Story, Jurassic World, WWE, and Star Wars brands; and licensor partner brands, including Disney, NBCUniversal, WWE, Microsoft, Nickelodeon, Warner Bros, and Sanrio. It sells its products directly to consumers through its catalog, website, and proprietary retail stores; retailers, including discount and free-standing toy stores, chain stores, department stores, and other retail outlets; and wholesalers, as well as through agents and distributors. Mattel, Inc. was founded in 1945 and is headquartered in El Segundo, California.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "El Segundo"
    },
    "MTT.F": {
        "short_name": "MATTEL INC.  DL 1",
        "long_name": "Mattel, Inc.",
        "summary": "Mattel, Inc., a children's entertainment company, designs and produces toys and consumer products worldwide. The company operates through North America, International, and American Girl segments. It offers dolls and accessories, as well as content, gaming, and lifestyle products for children under the Barbie, American Girl, Polly Pocket, Spirit, and Enchantimals brands; dolls and books under the American Girl brand name; die-cast vehicles, tracks, playsets, and accessories for kids, adults, and collectors under the Hot Wheels, Matchbox, CARS, and Mario Kart brand names; and infant, toddler, and preschool products comprising content, toys, live events, and other lifestyle products under the Fisher-Price and Thomas & Friends, Power wheels, and Fireman Sam brands. The company also provides action figures, building sets, and games under the Masters of the Universe, MEGA, UNO, Toy Story, Jurassic World, WWE, and Star Wars brands; and licensor partner brands, including Disney, NBCUniversal, WWE, Microsoft, Nickelodeon, Warner Bros, and Sanrio. It sells its products directly to consumers through its catalog, website, and proprietary retail stores; retailers, including discount and free-standing toy stores, chain stores, department stores, and other retail outlets; and wholesalers, as well as through agents and distributors. Mattel, Inc. was founded in 1945 and is headquartered in El Segundo, California.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "El Segundo"
    },
    "NCI2.F": {
        "short_name": "DRIVE SHACK  DL-,01",
        "long_name": "Drive Shack Inc.",
        "summary": "Drive Shack Inc. owns and operates golf-related leisure and entertainment venue business. It operates through Entertainment Golf Venues and Traditional Golf Properties segments. The Entertainment Golf Venues segment operates entertainment golf venues in Raleigh, North Carolina; Richmond, Virginia; and Orlando and West Palm Beach, Florida. Its entertainment golf venues offer leisure and social entertainment services with gaming and golf technology, a chef-inspired menu, and craft cocktails, as well as social events. The Traditional Golf Properties segment owns and operates golf properties in the United States. As of December 31, 2020, it owned, leased, or managed 60 properties in 9 states. Drive Shack Inc. also invests in loans and securities. The company was formerly known as Newcastle Investment Corp. and changed its name to Drive Shack Inc. in December 2016. Drive Shack Inc. was founded in 2002 and is headquartered in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Dallas"
    },
    "NLS": {
        "short_name": "Nautilus, Inc.",
        "long_name": "Nautilus, Inc.",
        "summary": "Nautilus, Inc., a fitness solutions company, designs, develops, sources, and markets cardio and strength fitness products, and related accessories for consumer and commercial use in the United States, Canada, and internationally. The company operates in two segments, Direct and Retail. It offers specialized cardio products, treadmills, ellipticals, bike products, home gyms, dumbbells, barbells, and kettlebells primarily under the Nautilus, Bowflex, Octane Fitness, Schwinn, and Universal brands, as well as fitness digital platform under the JRNY brand. In addition, it engages in licensing its brands and intellectual properties. The company offers its products directly to consumers through television advertising, social media, websites, and catalogs; and through a network of retail companies consisting of sporting goods stores, Internet retailers, and large-format and warehouse stores, as well as specialty retailers and independent bike dealers. Nautilus, Inc. was founded in 1986 and is headquartered in Vancouver, Washington.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Vancouver"
    },
    "OART": {
        "short_name": "OHIO ART CO",
        "long_name": "The Ohio Art Company, Inc.",
        "summary": "The Ohio Art Company, Inc. offers lithography services for metal packaging and products. It provides custom metal signs, metal prints, custom tins, and metal packaging services. The company was founded in 1908 and is headquartered in Bryan, Ohio.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Bryan"
    },
    "OMWSD": {
        "short_name": "OMNIA WELLNESS INC",
        "long_name": "Omnia Wellness Inc.",
        "summary": "Omnia Wellness Inc. develops and markets products for wellness and physical therapy markets. The company offers SOLAJET, a massage system; and operates relaxation centers under the BodyStop name. It also develops AQUAVIVE, a recliner system; and SolaPro, a mobile deep-tissue massage gun. The company is headquartered in Denver, Colorado.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Denver"
    },
    "PLBY": {
        "short_name": "PLBY Group, Inc.",
        "long_name": "PLBY Group, Inc.",
        "summary": "PLBY Group, Inc. operates as a pleasure and leisure company worldwide. The company operates through three segments: Licensing, Direct-to-Consumer, and Digital Subscriptions and Content. It offers sexual wellness products, such as condoms, lubricants, libido enhancers, bedroom accessories and sex toys, intimates and lingerie, intimacy kits, CBD-based arousal offerings, and adult content; style and apparel products for men and women; gaming and lifestyle products, including digital casino and social games, and other home and hospitality offerings; and beauty and grooming products for men and women, such as skincare, haircare, bath and body, grooming, cosmetics, and fragrance. The company offers its products under its flagship brand, Playboy. It owns and operates digital commerce retail platforms, such as yandy.com, loversstores.com, pleasureforall.com, and playboy.com; and Lovers retail stores. In addition, the company licenses content for programming on Playboy television; trademarks under multi-year arrangements with consumer products, online gaming, and location-based entertainment businesses; and programming content to cable television operators and direct-to-home satellite television operators. Further, its business covers the subscription sale of PlayboyPlus.com and Playboy.tv, which are online content platforms. The company was founded in 1953 and is headquartered in Los Angeles, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "PLNT": {
        "short_name": "Planet Fitness, Inc.",
        "long_name": "Planet Fitness, Inc.",
        "summary": "Planet Fitness, Inc., together with its subsidiaries, franchises and operates fitness centers under the Planet Fitness brand. It operates through three segments: Franchise, Corporate-Owned Stores, and Equipment. The Franchise segment is involved in franchising business in the United States, Puerto Rico, Canada, Panama, Mexico, and Australia. The Corporate-Owned Stores segment operates corporate-owned stores in the United States and Canada. The Equipment segment engages in the sale of fitness equipment to franchisee-owned stores in the United States. As of December 31, 2020, the company had 2,124 stores, including 2,021 franchised and 103 corporate-owned stores in the District of Columbia, Puerto Rico, Canada, Panama, Mexico, and Australia. Planet Fitness, Inc. was founded in 1992 and is headquartered in Hampton, New Hampshire.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Hampton"
    },
    "POH1.F": {
        "short_name": "CARNIVAL PLC  DL 1,66",
        "long_name": "Carnival Corporation & plc",
        "summary": "Carnival Corporation & plc operates as a leisure travel company. Its ships visit approximately 700 ports under the Carnival Cruise Line, Princess Cruises, Holland America Line, P&O Cruises (Australia), Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises (UK), and Cunard brand names. The company also provides port destinations and other services, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. It sells its cruises primarily through travel agents and tour operators. The company operates in the United States, Canada, Continental Europe, the United Kingdom, Australia, New Zealand, Asia, and internationally. It operates 87 ships with 223,000 lower berths. The company was incorporated in 1972 and is headquartered in Miami, Florida.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Miami"
    },
    "POH3.F": {
        "short_name": "CARNIVAL PLC ADR/1 DL1,66",
        "long_name": "Carnival Corporation & plc",
        "summary": "Carnival Corporation & plc operates as a leisure travel company. Its ships visit approximately 700 ports under the Carnival Cruise Line, Princess Cruises, Holland America Line, P&O Cruises (Australia), Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises (UK), and Cunard brand names. The company also provides port destinations and other services, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. It sells its cruises primarily through travel agents and tour operators. The company operates in the United States, Canada, Continental Europe, the United Kingdom, Australia, New Zealand, Asia, and internationally. It operates 87 ships with 223,000 lower berths. The company was incorporated in 1972 and is headquartered in Miami, Florida.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Miami"
    },
    "POOL": {
        "short_name": "Pool Corporation",
        "long_name": "Pool Corporation",
        "summary": "Pool Corporation distributes swimming pool supplies, equipment, and related leisure products in the United States and internationally. The company offers maintenance products, including chemicals, supplies, and pool accessories; repair and replacement parts for pool equipment, such as cleaners, filters, heaters, pumps, and lights; fiberglass pools, and hot tubs and packaged pool kits comprising walls, liners, braces, and coping for in-ground and above-ground pools; pool equipment and components for new pool construction and the remodeling of existing pools; and irrigation and related products consisting of irrigation system components, and professional lawn care equipment and supplies. It also provides building materials, such as concrete, plumbing and electrical components, functional and decorative pool surfaces, decking materials, tiles, hardscapes, and natural stones for use in pool installations and remodeling; and commercial products, such as heaters, safety equipment, and commercial pumps and filters. In addition, the company offers discretionary recreational and related outdoor living products that enhance consumers' use and enjoyment of outdoor living spaces, such as hot tubs, grills, and components for outdoor kitchens. It serves swimming pool remodelers and builders; specialty retailers that sell swimming pool supplies; swimming pool repair and service businesses; irrigation construction and landscape maintenance contractors; golf courses; and commercial customers that serve hotels, universities, and community recreational facilities. As of December 31, 2020, the company operated 398 sales centers in North America, Europe, and Australia. Pool Corporation was incorporated in 1993 and is headquartered in Covington, Louisiana.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Covington"
    },
    "PRKA": {
        "short_name": "PARKS AMERICA INC",
        "long_name": "Parks! America, Inc.",
        "summary": "Parks! America, Inc., through its subsidiaries, engages in acquiring, developing, and operating local and regional theme parks and attractions in the United States. It owns and operates three Wild Animal Safari theme parks located in Pine Mountain, Georgia; Strafford, Missouri; and Bryan/College Station, Texas. The company was formerly known as Great American Family Parks, Inc. and changed its name to Parks! America, Inc. in June 2008. Parks! America, Inc. is based in Pine Mountain, Georgia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Pine Mountain"
    },
    "PRXIQ": {
        "short_name": "PREMIER EXHIBITIONS INC",
        "long_name": "Premier Exhibitions, Inc.",
        "summary": "Premier Exhibitions, Inc., together with its subsidiaries, engages in presenting museum-quality touring exhibitions to public worldwide. It operates through two segments, Exhibition Management and RMS Titanic. It develops, deploys, operates, and presents exhibition products in exhibition centers, museums, and non-traditional venues. The company operates and manages various exhibitions, such as Â\u0091Titanic: The Artifact Exhibition' that features the artifacts recovered from the wreck site; Titanic: The Experience, a Titanic-themed exhibition; and Â\u0091Bodies...The Exhibition' and Â\u0091Bodies Revealed', which display multiple human anatomy sets that contain a collection of whole human body specimens, and single human organs and body parts. It also operates and manages Â\u0091Pompeii: One Day in Pompeii', which features the artifacts recovered from the debris of the city of Pompeii; Â\u0091Real Pirates' that tells the story of the Whydah, the first authenticated pirate shipwreck in U.S. waters, and the stories of the people whose lives converged on the vessel; and Â\u0091The Discovery of King Tut', an exhibition based on King Tutankhamun. In addition, the company sells merchandise, such as apparel, posters, gifts, and jewelry related to its shows over the Internet; publishes exhibition catalogs; and provides ancillary services, such as audio tours, as well as sells visitor exhibition themed photographs at its exhibition gift shops. Premier Exhibitions, Inc. was founded in 1987 and is based in Peachtree Corners, Georgia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Peachtree Corners"
    },
    "PTON.MX": {
        "short_name": "PELOTON INTERACTIVE INC",
        "long_name": "Peloton Interactive, Inc.",
        "summary": "Peloton Interactive, Inc. provides interactive fitness products in North America and internationally. It offers connected fitness products, such as the Peloton Bike and the Peloton Tread, which include touchscreen that streams live and on-demand classes. The company also provides connected fitness subscriptions for multiple household users, and access to all live and on-demand classes, as well as Peloton Digital app for connected fitness subscribers to provide access to its classes. As of December 09, 2020, it had approximately 3.6 million members. The company markets and sells its interactive fitness products directly through its retail showrooms and at onepeloton.com. Peloton Interactive, Inc. was founded in 2012 and is headquartered in New York, New York.",
        "currency": "MXN",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "New York"
    },
    "PTON": {
        "short_name": "Peloton Interactive, Inc.",
        "long_name": "Peloton Interactive, Inc.",
        "summary": "Peloton Interactive, Inc. provides interactive fitness products in North America and internationally. It offers connected fitness products, such as the Peloton Bike and the Peloton Tread, which include touchscreen that streams live and on-demand classes. The company also provides connected fitness subscriptions for multiple household users, and access to all live and on-demand classes, as well as Peloton Digital app for connected fitness subscribers to provide access to its classes. As of December 09, 2020, it had approximately 3.6 million members. The company markets and sells its interactive fitness products directly through its retail showrooms and at onepeloton.com. Peloton Interactive, Inc. was founded in 2012 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "QRSM": {
        "short_name": "QRS MUSIC TECHNOLOGIES INC",
        "long_name": "QRS Music Technologies, Inc.",
        "summary": "QRS Music Technologies, Inc. manufactures and distributes pianos and piano accessories; musical instrument digital interface (MIDI) systems for acoustic pianos; and digital content and music rolls for player pianos in the United States. The company provides Pianomation, a MIDI system to combine analog and digital technology to turn any piano into a reproducing player piano. Its products include PNOmation II, a player piano system; PNOscan MIDI record strip; QSync, a video audio sequencer; PNOmation II Demo Bag; PLAYOLA, a portable player for piano system; and digital hymnal. The company was founded in 1900 and is based in Seneca, Pennsylvania.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Seneca"
    },
    "SCRH": {
        "short_name": "SCORES HOLDING COMPANY INC",
        "long_name": "Scores Holding Company, Inc.",
        "summary": "Scores Holding Company, Inc., together with its subsidiaries, licenses the Scores trademarks and other intellectual property to gentlemen's nightclubs with adult entertainment in the United States. It licenses its trademark to 10 clubs, which are operating under the Scores name in New York, Chicago, Tampa, New Orleans, Harvey, Mooresville, Palm Springs, Buffalo, Atlantic City, and Las Vegas. The company was founded in 1981 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "SEAS": {
        "short_name": "SeaWorld Entertainment, Inc.",
        "long_name": "SeaWorld Entertainment, Inc.",
        "summary": "SeaWorld Entertainment, Inc., together with its subsidiaries, operates as a theme park and entertainment company in the United States. The company operates SeaWorld theme parks in Orlando, Florida; San Antonio, Texas; and San Diego, California, as well as Busch Gardens theme parks in Tampa, Florida, and Williamsburg, Virginia. It also operates water park attractions in Orlando, Florida; San Antonio, Texas; Chula Vista, California; Tampa, Florida; and Williamsburg, Virginia. In addition, the company operates a reservations-only theme park in Orlando, Florida and a seasonal park in Langhorne, Pennsylvania. It operates a portfolio of twelve theme parks under the SeaWorld, Busch Gardens, Aquatica, Discovery Cove, Water Country USA, Adventure Island, and Sesame Place brands. The company was formerly known as SW Holdco, Inc. and changed its name to SeaWorld Entertainment, Inc. in December 2012. SeaWorld Entertainment, Inc. was founded in 1959 and is headquartered in Orlando, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Orlando"
    },
    "SIX": {
        "short_name": "Six Flags Entertainment Corpora",
        "long_name": "Six Flags Entertainment Corporation",
        "summary": "Six Flags Entertainment Corporation owns and operates regional theme and waterparks under the Six Flags name. Its parks offer various thrill rides, water attractions, themed areas, concerts and shows, restaurants, game venues, and retail outlets. As of March 18, 2021, the company operated 26 parks in the United States, Mexico, and Canada. The company was formerly known as Six Flags, Inc. and changed its name to Six Flags Entertainment Corporation in April 2010. Six Flags Entertainment Corporation was founded in 1961 and is based in Arlington, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Arlington"
    },
    "SLBG": {
        "short_name": "SLINGER BAG INC",
        "long_name": "Slinger Bag Inc.",
        "summary": "Slinger Bag Inc. operates in the sporting and athletic goods business. The company owns Slinger Launcher, a portable tennis ball launcher. It allows to control the speed, frequency, and elevation of balls that are launched for practice and training or fitness purposes. Slinger Bag Inc. is headquartered in Baltimore, Maryland.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Baltimore"
    },
    "SP1.DE": {
        "short_name": "POOL CORP.  DL-,001",
        "long_name": "Pool Corporation",
        "summary": "Pool Corporation distributes swimming pool supplies, equipment, and related leisure products in the United States and internationally. The company offers maintenance products, including chemicals, supplies, and pool accessories; repair and replacement parts for pool equipment, such as cleaners, filters, heaters, pumps, and lights; fiberglass pools, and hot tubs and packaged pool kits comprising walls, liners, braces, and coping for in-ground and above-ground pools; pool equipment and components for new pool construction and the remodeling of existing pools; and irrigation and related products consisting of irrigation system components, and professional lawn care equipment and supplies. It also provides building materials, such as concrete, plumbing and electrical components, functional and decorative pool surfaces, decking materials, tiles, hardscapes, and natural stones for use in pool installations and remodeling; and commercial products, such as heaters, safety equipment, and commercial pumps and filters. In addition, the company offers discretionary recreational and related outdoor living products that enhance consumers' use and enjoyment of outdoor living spaces, such as hot tubs, grills, and components for outdoor kitchens. It serves swimming pool remodelers and builders; specialty retailers that sell swimming pool supplies; swimming pool repair and service businesses; irrigation construction and landscape maintenance contractors; golf courses; and commercial customers that serve hotels, universities, and community recreational facilities. As of December 31, 2020, the company operated 398 sales centers in North America, Europe, and Australia. Pool Corporation was incorporated in 1993 and is headquartered in Covington, Louisiana.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Covington"
    },
    "SP1.F": {
        "short_name": "POOL CORP.  DL-,001",
        "long_name": "Pool Corporation",
        "summary": "Pool Corporation distributes swimming pool supplies, equipment, and related leisure products in the United States and internationally. The company offers maintenance products, including chemicals, supplies, and pool accessories; repair and replacement parts for pool equipment, such as cleaners, filters, heaters, pumps, and lights; fiberglass pools, and hot tubs and packaged pool kits comprising walls, liners, braces, and coping for in-ground and above-ground pools; pool equipment and components for new pool construction and the remodeling of existing pools; and irrigation and related products consisting of irrigation system components, and professional lawn care equipment and supplies. It also provides building materials, such as concrete, plumbing and electrical components, functional and decorative pool surfaces, decking materials, tiles, hardscapes, and natural stones for use in pool installations and remodeling; and commercial products, such as heaters, safety equipment, and commercial pumps and filters. In addition, the company offers discretionary recreational and related outdoor living products that enhance consumers' use and enjoyment of outdoor living spaces, such as hot tubs, grills, and components for outdoor kitchens. It serves swimming pool remodelers and builders; specialty retailers that sell swimming pool supplies; swimming pool repair and service businesses; irrigation construction and landscape maintenance contractors; golf courses; and commercial customers that serve hotels, universities, and community recreational facilities. As of December 31, 2020, the company operated 398 sales centers in North America, Europe, and Australia. Pool Corporation was incorporated in 1993 and is headquartered in Covington, Louisiana.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Covington"
    },
    "SPQS": {
        "short_name": "SPORTSQUEST INC",
        "long_name": "SportsQuest, Inc.",
        "summary": "SportsQuest, Inc., through its subsidiaries, operates as a wholesale supplier of vegetable chips, fruit chips, mixed nuts, and cracked corn to distributors, restaurants, and ethnic grocery stores in Central Florida. It also owns 2 multifamily mobile home communities, such as Augusta Mobile Manor, a 70-unit mobile home community comprising 10.36 acres of area located in Richmond County, Augusta, Georgia; and Cooper Lake, a 79-unit mobile home community consisting of 12.2 acres of land located in Putnam County, Interlachen, Florida. The company was formerly known as Air Brook Airport Express, Inc. and changed its name to SportsQuest, Inc. in September 2007. SportsQuest, Inc. was founded in 1986 and is based in Lake Mary, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Lake Mary"
    },
    "SPWH": {
        "short_name": "Sportsman's Warehouse Holdings,",
        "long_name": "Sportsman's Warehouse Holdings, Inc.",
        "summary": "Sportsman's Warehouse Holdings, Inc., together with its subsidiaries, operates as an outdoor sporting goods retailer in the United States. It offers camping products, such as backpacks, camp essentials, canoes and kayaks, coolers, outdoor cooking equipment, sleeping bags, tents, and tools; and clothing products, including camouflage, jackets, hats, outerwear, sportswear, technical gear, and work wear. The company also provides fishing products comprising bait, electronics, fishing rods, flotation items, fly fishing products, lines, lures, reels, tackles, and small boats; and foot wear products consisting of hiking and work boots, socks, sport sandals, technical footwear, trial and casual shoes, and waders. In addition, it offers hunting and shooting products, such as ammunition, archery items, ATV accessories, blinds and tree stands, decoys, firearms, firearms safety and storage products, reloading equipment, and shooting gear products; and optics, electronics, and accessories, including gift items, GPS devices, knives, lighting, optics, and two-way radios. Further, the company's stores provide archery technician services, fishing-reel line winding, gun bore sighting and scope mounting, and cleaning services, as well as issues hunting and fishing licenses. Additionally, it offers various private label and special make-up offerings under the Rustic Ridge, Killik, Vital Impact, Yukon Gold, Lost Creek, and Sportsman's Warehouse brands. As of March 31, 2021, the company operated through 112 stores in 27 states. Sportsman's Warehouse Holdings, Inc. was founded in 1986 and is headquartered in West Jordan, Utah.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "West Jordan"
    },
    "TONR": {
        "short_name": "TONNER ONE WORLD HOLDINGS INC",
        "long_name": "Tonner-One World Holdings, Inc.",
        "summary": "Tonner-One World Holdings, Inc., through its wholly owned subsidiary, The One World Doll Project, Inc., designs, manufactures, and markets dolls under the Prettie Girls! brand name. The company was formerly known as One World Holdings, Inc. and changed its name to Tonner-One World Holdings, Inc. in April 2016. Tonner-One World Holdings, Inc. is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "TRBX": {
        "short_name": "TRB SYSTEMS INTERNATIONAL INC",
        "long_name": "TRB Systems International Inc.",
        "summary": "TRB Systems International Inc., through its subsidiary, Alenax Parts Mfr (Tianjin) Corp., develops, markets, and manufactures a line of Alenax- bicycles including Alenax-Exercise Bicycle, Alenax -Electric Bicycle, and Alenax-Wheelchair. The company offers various models of bicycles comprising Mountain Bikes (MTB); leisure bikes, BMX (children); ATB (all-terrain); and cross trading bikes. TRB Systems International Inc. intends to offers its products to stepper users, health and fitness facilities, and senior citizens, as well as rehabilitation and therapeutic markets through regional distributors in Japan, India, Nigeria, Benin, Canada, Ivory Coast, Tanzania, Brazil, Vietnam, Korea, Taiwan, and the United States. The company was founded in 1997 and is based in Piscataway, New Jersey.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Piscataway"
    },
    "TSRR": {
        "short_name": "TRADESTAR RESOURCES CORPORATION",
        "long_name": "Tradestar Resources Corporation",
        "summary": "Tradestar Resources Corporation, an independent energy company, engages in the exploration, development, exploitation, and acquisition of on-shore oil and natural gas properties in the United States. The company was formerly known as Tradestar Corporation and changed its name to Tradestar Resources Corporation in 2006. Tradestar Resources Corporation was founded in 1966 and is based in Hot Springs, Arkansas. Tradestar Resources Corporation operates as a subsidiary of Artfest International, Inc.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Hot Springs"
    },
    "TVPC": {
        "short_name": "TWIN VEE POWERCATS INC",
        "long_name": "Twin Vee PowerCats, Inc.",
        "summary": "Twin Vee PowerCats, Inc. designs, manufactures, and markets recreational power catamaran boats. The company sell its boats through a network of independent dealers in North America and the Caribbean. The company is based in Fort Pierce, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Fort Pierce"
    },
    "USPS": {
        "short_name": "ULTIMATE SPORTS INC",
        "long_name": "Ultimate Sports, Inc.",
        "summary": "Ultimate Sports, Inc. designs and assembles snowmobile skis and related products in the United States. Its products include banners/emblems, mount shoes, ski bottom kits, Stud Boy studs, and Stud Boy wear bars; tools, such as studders, track hole cutters, studding templates, spindle alignment bars, ski alignment kits, and chassis scales; and accessories comprising shaper plates, view guards, snow flaps, snow eater fin stages, power steering plates, mountain riding and racing 301 aluminum shaper bars, hammerheads, Dasco inclinometers, adjustable bar risers, and 301 racing handles. Ultimate Sports, Inc. was founded in 1988 and is headquartered in West Lafayette, Indiana.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "West Lafayette"
    },
    "VIRA": {
        "short_name": "VIRATECH CORP",
        "long_name": "Viratech Corp.",
        "summary": "Viratech Corp., through its subsidiary, Cambridge Golf LLC, operates as a sports lifestyle company. It designs and manufactures various nutritional products, sporting goods, and accessories to the sports, nutrition, and golf markets. The company is based in Suwanee, Georgia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Suwanee"
    },
    "VMHG": {
        "short_name": "VICTORY MARINE HOLDINGS CORP",
        "long_name": "Victory Marine Holdings Corp.",
        "summary": "Victory Marine Holdings Corp., through its subsidiary, Victory Yacht Sales Corp., engages in selling luxury vessels worldwide. It provides new and used boats, as well as financing, insurance, documentation, accessories, brokerage, and consulting services. The company was formerly known as China Good Electric, Inc. and changed its name to Victory Marine Holdings Corp. in May 2018. Victory Marine Holdings Corp. was incorporated in 1954 and is based in Miami, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Miami"
    },
    "VSTO": {
        "short_name": "Vista Outdoor Inc.",
        "long_name": "Vista Outdoor Inc.",
        "summary": "Vista Outdoor Inc. designs, manufactures, and markets consumer products in the outdoor sports and recreation markets in the United States and internationally. It has a portfolio of brands that provides consumers with a range of products for individual outdoor recreational pursuits. The company operates through two segments, Shooting Sports and Outdoor Products. The Shooting Sports segment offers ammunition products, including centerfire ammunition, rimfire ammunition, shotshell ammunition, and reloading components; and hunting and shooting accessories comprising high-performance hunting arrows, game calls, hunting blinds, game cameras, decoys, reloading equipment, clay targets, premium gun care products, holsters, duty gear, bags, packs, binoculars, riflescopes, and telescopes. The Outdoor Products segment offers sports protection products, such as helmets, goggles, and accessories for cycling, snow sports, action sports, and powersports; outdoor cooking products that include grills and stoves; golf products, which comprise laser rangefinders and other golf technology products; and hydration products, including hydration packs and water bottles. The company sells its products to outdoor enthusiasts, hunters and recreational shooters, athletes, law enforcement, and military professionals through various mass, specialty, and independent retailers and distributors, as well as directly to consumers through brand's website and third party e-tail websites. Vista Outdoor Inc. was incorporated in 2014 and is headquartered in Anoka, Minnesota.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Anoka"
    },
    "VTMB": {
        "short_name": "VITAMIN BLUE INC",
        "long_name": "Vitamin Blue, Inc.",
        "summary": "Vitamin Blue, Inc. designs, develops, produces, and distributes water boardsports apparel and related products primarily in the United States. The company offers board shorts and T-shirts. It also provides water boardsports accessories, including board bags, paddle bags, and rack pads. The company was formerly known as Under The Influence, Inc. and changed its name to Vitamin Blue, Inc. in May 2007. Vitamin Blue, Inc. was founded in 1999 and is based in Costa Mesa, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Costa Mesa"
    },
    "W2L.F": {
        "short_name": "SEAWORLD ENTERTAIN.DL-,01",
        "long_name": "SeaWorld Entertainment, Inc.",
        "summary": "SeaWorld Entertainment, Inc., together with its subsidiaries, operates as a theme park and entertainment company in the United States. The company operates SeaWorld theme parks in Orlando, Florida; San Antonio, Texas; and San Diego, California, as well as Busch Gardens theme parks in Tampa, Florida, and Williamsburg, Virginia. It also operates water park attractions in Orlando, Florida; San Antonio, Texas; Chula Vista, California; Tampa, Florida; and Williamsburg, Virginia. In addition, the company operates a reservations-only theme park in Orlando, Florida and a seasonal park in Langhorne, Pennsylvania. It operates a portfolio of twelve theme parks under the SeaWorld, Busch Gardens, Aquatica, Discovery Cove, Water Country USA, Adventure Island, and Sesame Place brands. The company was formerly known as SW Holdco, Inc. and changed its name to SeaWorld Entertainment, Inc. in December 2012. SeaWorld Entertainment, Inc. was founded in 1959 and is headquartered in Orlando, Florida.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Orlando"
    },
    "WSGF": {
        "short_name": "WORLD SERIES OF GOLF INC",
        "long_name": "WSOG LLC",
        "summary": "WSOG LLC, a sports entertainment company, hosts amateur golf tournaments and events. The company focuses on creating branded products, games, media, and entertainment. It organizes a hole-by-hole hit and bet amateur prize tournament played on a professional 18-hole golf course. The company is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "XFTB": {
        "short_name": "XFIT BRANDS INC",
        "long_name": "XFit Brands, Inc.",
        "summary": "XFit Brands, Inc. designs, develops, markets, and sells functional equipment, training gears, and apparel and accessories for the impact sports market and fitness industry worldwide. It offers functional fitness stations, including XTC, CTC, and UTC training equipment, as well as mobile fitness training stations used in set up for mobile events, such as mobile boot camps, community events, trade shows, and outdoor competitions. The company also provides training and protective gears comprising mixed martial arts and boxing gloves, punching mitts, thai pads, body shields, and heavy bags; cages and rings to ultimate fighting championship gyms; and bag rack systems. In addition, it offers apparel; functional training equipment and accessories consisting of weight plates, kettle bells, resistance bands, weight bars and dumbbells, jump ropes, slam balls, and plyometrix boxes used in cross training and other related fitness regimens; and fitness training programs. The company provides its products under the Throwdown, XFit Brands, and Transformations brand names. XFit Brands, Inc. markets and sells its products through various channels, including gyms, fitness facilities, third party catalogues, independent distributors, and licensees, as well as directly to consumers through its Website. The company was founded in 2003 and is based in Lake Forest, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Lake Forest"
    },
    "YETI": {
        "short_name": "YETI Holdings, Inc.",
        "long_name": "YETI Holdings, Inc.",
        "summary": "YETI Holdings, Inc. designs, markets, retails, and distributes products for the outdoor and recreation market under the YETI brand. The company offers hard and soft coolers, as well as storage, transport, outdoor living, and associated accessories. It also provides drinkware products, such as colsters, lowballs, wine tumblers, stackable pints, tumblers, mugs, bottles, and jugs, as well as accessories comprising bottle straw caps, tumbler handles, jug mounts, and bottle slings under the Rambler brand. In addition, the company offers YETI-branded gear products, such as hats, shirts, bottle openers, and ice substitutes. It sells its products through independent retailers, including outdoor specialty, hardware, sporting goods, and farm and ranch supply stores, as well as through Website. The company operates in the United States, Canada, Australia, New Zealand, Europe, Hong Kong, China, Singapore, and Japan. YETI Holdings, Inc. was founded in 2006 and is headquartered in Austin, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Austin"
    }
}