{
    "AVEW": {
        "short_name": "AVEW HOLDINGS INC",
        "long_name": "AVEW Holdings Inc.",
        "summary": "AVEW Holdings Inc., together with its subsidiaries, operates as a pool, spa, and landscape design and construction company. The company engages in the design and construction of residential and commercial pools and spas; design and fabrication of patios, decks, arbors, enclosures, outdoor kitchens, and living rooms; and design and installation of lighting, plumbing audio, and visual fixtures, as well as provides repair, renovation, and maintenance services. It is also involved in the business of new home construction and remodeling of existing homes, including excavation, grading, drainage, foundation, framing doors, windows, electrical, plumbing, HVAC, insulation, drywall, tape and bed, texture, millwork and countertops, tile, wood flooring, and carpeting. In addition, it provides home improvement loans, home equity lines of credit, and home refinancing. The company was formerly known as ActionView International Inc. and changed its name to AVEW Holdings Inc. in June, 2014. AVEW Holdings Inc. is based in Austin, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Austin",
        "zipcode": "78750",
        "website": "http://www.avewholdings.com",
        "market_cap": "Small Cap"
    },
    "BANI": {
        "short_name": "BANNEKER INC",
        "long_name": "Banneker, Inc.",
        "summary": "Banneker, Inc., through its subsidiary, Banneker Enterprises Inc., manufactures and distributes watches and fine jewelry. It offers watches, clocks, and watch cases and parts. The company was founded in 2003 and is headquartered in Sunrise, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Sunrise",
        "zipcode": "33351",
        "website": "http://www.bannekerstore.com",
        "market_cap": "Small Cap"
    },
    "BRGO": {
        "short_name": "BERGIO INTL INC",
        "long_name": "Bergio International, Inc.",
        "summary": "Bergio International, Inc. designs, manufactures, and distributes fine jewelry primarily in the United States. It offers a range of products made from precious metals, such as gold, platinum, and Karat gold, as well as diamonds and other precious stones. The company provides a collection of charms, crosses, and other add-on pieces; fashion jewelry, such as necklaces, pendants, earrings, bracelets, and rings; couture line of products; and bridal line, which comprises wedding sets, engagement rings, and wedding bands for men and women, as well as handbags. It also operates two retail stores. The company offers its products under the Bergio brand name. Bergio International, Inc. is headquartered in Fairfield, New Jersey.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Fairfield",
        "zipcode": "07007",
        "website": "http://www.bergio.com",
        "market_cap": "Small Cap"
    },
    "CCPR": {
        "short_name": "CASEYCORP ENTERPRISES INC",
        "long_name": "CaseyCorp Enterprises, Inc.",
        "summary": "CaseyCorp Enterprises, Inc., through its subsidiaries, operates as a wholesale buyer and seller of gold, diamonds, and precious metals in the United States. The company acts as a middleman aggregating the gold, diamonds, and other precious metals, which are purchased primarily from retail jewelers and selling it to refiners. It also engages in purchasing gold and diamonds from consumers. The company was incorporated in 2007 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022",
        "website": null,
        "market_cap": "Small Cap"
    },
    "CDR.F": {
        "short_name": "CHARLES + COLVARD LTD.",
        "long_name": "Charles & Colvard, Ltd.",
        "summary": "Charles & Colvard, Ltd. manufactures, markets, and distributes moissanite jewels and finished jewelries worldwide. It operates through Online Channels, and Traditional segments. The company offers stud earrings, solitaire and three stone rings, pendants, and bracelets. It also provides colorless moissanite jewel with 27 cuts and in sizes ranging from .002 carats to 6.13 carats, under the brand name Forever One, as well as gemstones under the brand name Moissanite by Charles & Colvard. In addition, the company offers Exotics product line with 15.55 carats diamond equivalent weight. It sells its products through distributors, manufacturers, retailers, and designers; and at retail to end consumers through its e-commerce site, charlesandcolvard.com, as well as third-party online marketplaces, drop-ship, and e-commerce outlets. Charles & Colvard, Ltd. was founded in 1995 and is based in Morrisville, North Carolina.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NC",
        "city": "Morrisville",
        "zipcode": "27560",
        "website": "http://www.charlesandcolvard.com",
        "market_cap": "Small Cap"
    },
    "COY.F": {
        "short_name": "TAPESTRY INC.  DL-,01",
        "long_name": "Tapestry, Inc.",
        "summary": "Tapestry, Inc. provides luxury accessories and branded lifestyle products in the United States, Japan, Greater China, Other Asia, and internationally. The company operates through three segments: Coach, Kate Spade, and Stuart Weitzman. The company offers women's accessories, including handbags, such as wallets, money pieces, wristlets, and cosmetic cases; novelty accessories comprising address books, time management and travel accessories, sketchbooks, and portfolios; and key rings and charms. It also provides bag collections, including business cases, computer bags, messenger-style bags, backpacks, and totes; small leather goods, such as wallets, card cases, travel organizers, and belts; and footwear, watches, sunglasses, novelty accessories, and ready-to-wear for men. In addition, the company offers women's footwear; sunglasses; bracelets, necklaces, rings, and earrings; fragrances and watches; women's seasonal lifestyle apparel collections that include outerwear and ready-to-wear, and cold weather accessories, which comprise gloves, scarves, and hats. Further, it provides ready-to-wear and footwear items for kids; fashion bedding and tableware; and stationery and gifts. Additionally, the company licenses rights to market and distribute its eyewear, watches, fragrances, and tech accessories under the Coach brand; and fashion beddings, tableware, eyewear, watches, stationery and gifts, and tech accessories under the Kate Spade brand. It sells its products to consumers through a network of 958 Coach stores, 420 Kate Spade stores, and 131 Stuart Weitzman stores, including the Internet and concession shop-in-shops; and wholesale customers, as well as through independent third party distributors. The company was formerly known as Coach, Inc. and changed its name to Tapestry, Inc. in October 2017. Tapestry, Inc. was founded in 1941 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10001",
        "website": "http://www.tapestry.com",
        "market_cap": "Mid Cap"
    },
    "CTHR": {
        "short_name": "Charles & Colvard Ltd.",
        "long_name": "Charles & Colvard, Ltd.",
        "summary": "Charles & Colvard, Ltd. manufactures, markets, and distributes moissanite jewels and finished jewelries worldwide. It operates through Online Channels, and Traditional segments. The company offers stud earrings, solitaire and three stone rings, pendants, and bracelets. It also provides colorless moissanite jewel with 27 cuts and in sizes ranging from .002 carats to 6.13 carats, under the brand name Forever One, as well as gemstones under the brand name Moissanite by Charles & Colvard. In addition, the company offers Exotics product line with 15.55 carats diamond equivalent weight. It sells its products through distributors, manufacturers, retailers, and designers; and at retail to end consumers through its e-commerce site, charlesandcolvard.com, as well as third-party online marketplaces, drop-ship, and e-commerce outlets. Charles & Colvard, Ltd. was founded in 1995 and is based in Morrisville, North Carolina.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "NC",
        "city": "Morrisville",
        "zipcode": "27560",
        "website": "http://www.charlesandcolvard.com",
        "market_cap": "Small Cap"
    },
    "EATR": {
        "short_name": "EASTERN ASTERIA INC",
        "long_name": "Eastern Asteria, Inc.",
        "summary": "Eastern Asteria, Inc., through its subsidiaries, engages in the wholesale and retail of gemstones, jewelry, minerals, and accessories in the United States and internationally. The company offers finished and non finished jewelry and accessories, and gemstone materials through its Website, www.thegemstore.com, as well as through retail outlets. It also provides Web development, multimedia, and Internet services, including the Internet Web hosting of in-house and client domains; monitoring security and technical operations, and custom application development; provision of virtual servers for offsite security; and networking and application support to internal and external clients, as well as offers business-to-business extranet services. The company was formerly known as Winmax Trading Group, Inc. and changed its name to Eastern Asteria, Inc. in April 2010. Eastern Asteria, Inc. was incorporated in 1996 and is headquartered in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Boca Raton",
        "zipcode": "33498",
        "website": null,
        "market_cap": "Small Cap"
    },
    "FOSL": {
        "short_name": "Fossil Group, Inc.",
        "long_name": "Fossil Group, Inc.",
        "summary": "Fossil Group, Inc., together with its subsidiaries, designs, develops, markets, and distributes consumer fashion accessories in the United States, Europe, Asia, and internationally. The company's products include traditional watches, smartwatches, jewelry, handbags, small leather goods, belts, and sunglasses. It also manufactures and distributes private label brands, as well as purchases and resells branded products in non-FOSSIL branded retail stores. The company offers its products under its proprietary brands, such as FOSSIL, SKAGEN, MICHELE, RELIC, and ZODIAC; and under the licensed brands, including ARMANI EXCHANGE, DIESEL, DKNY, EMPORIO ARMANI, KATE SPADE NEW YORK, MICHAEL KORS, PUMA, TORY BURCH, Skechers, and BMW. The company sells its products through company-owned retail and outlet stores, department stores, specialty retail stores, specialty watch and jewelry stores, mass market stores, e-commerce sites, licensed and franchised FOSSIL retail stores, and retail concessions, as well as sells its products on airlines and cruise ships. As of January 2, 2021, it operated 421 stores worldwide. The company was formerly known as Fossil, Inc. and changed its name to Fossil Group, Inc. in May 2013. Fossil Group, Inc. was founded in 1984 and is headquartered in Richardson, Texas.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Richardson",
        "zipcode": "75080",
        "website": "http://www.fossilgroup.com",
        "market_cap": "Small Cap"
    },
    "FOSL.VI": {
        "short_name": "FOSSIL GROUP INC",
        "long_name": "Fossil Group, Inc.",
        "summary": "Fossil Group, Inc., together with its subsidiaries, designs, develops, markets, and distributes consumer fashion accessories in the United States, Europe, Asia, and internationally. The company's products include traditional watches, smartwatches, jewelry, handbags, small leather goods, belts, and sunglasses. It also manufactures and distributes private label brands, as well as purchases and resells branded products in non-FOSSIL branded retail stores. The company offers its products under its proprietary brands, such as FOSSIL, SKAGEN, MICHELE, RELIC, and ZODIAC; and under the licensed brands, including ARMANI EXCHANGE, DIESEL, DKNY, EMPORIO ARMANI, KATE SPADE NEW YORK, MICHAEL KORS, PUMA, TORY BURCH, Skechers, and BMW. The company sells its products through company-owned retail and outlet stores, department stores, specialty retail stores, specialty watch and jewelry stores, mass market stores, e-commerce sites, licensed and franchised FOSSIL retail stores, and retail concessions, as well as sells its products on airlines and cruise ships. As of January 2, 2021, it operated 421 stores worldwide. The company was formerly known as Fossil, Inc. and changed its name to Fossil Group, Inc. in May 2013. Fossil Group, Inc. was founded in 1984 and is headquartered in Richardson, Texas.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "TX",
        "city": "Richardson",
        "zipcode": "75080",
        "website": "http://www.fossilgroup.com",
        "market_cap": "Small Cap"
    },
    "FSL.F": {
        "short_name": "FOSSIL GROUP INC.  DL-,01",
        "long_name": "Fossil Group, Inc.",
        "summary": "Fossil Group, Inc., together with its subsidiaries, designs, develops, markets, and distributes consumer fashion accessories in the United States, Europe, Asia, and internationally. The company's products include traditional watches, smartwatches, jewelry, handbags, small leather goods, belts, and sunglasses. It also manufactures and distributes private label brands, as well as purchases and resells branded products in non-FOSSIL branded retail stores. The company offers its products under its proprietary brands, such as FOSSIL, SKAGEN, MICHELE, RELIC, and ZODIAC; and under the licensed brands, including ARMANI EXCHANGE, DIESEL, DKNY, EMPORIO ARMANI, KATE SPADE NEW YORK, MICHAEL KORS, PUMA, TORY BURCH, Skechers, and BMW. The company sells its products through company-owned retail and outlet stores, department stores, specialty retail stores, specialty watch and jewelry stores, mass market stores, e-commerce sites, licensed and franchised FOSSIL retail stores, and retail concessions, as well as sells its products on airlines and cruise ships. As of January 2, 2021, it operated 421 stores worldwide. The company was formerly known as Fossil, Inc. and changed its name to Fossil Group, Inc. in May 2013. Fossil Group, Inc. was founded in 1984 and is headquartered in Richardson, Texas.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Richardson",
        "zipcode": "75080",
        "website": "http://www.fossilgroup.com",
        "market_cap": "Small Cap"
    },
    "GMZP": {
        "short_name": "GEMZ CORPORATION",
        "long_name": "GEMZ Corporation",
        "summary": "GEMZ Corporation owns marketing rights of NanoSign technology. Its technology NanoSign, an illuminated address sign based on photovoltaic nanofilms. The company also acquires and develops consumer-oriented products with a nanotechnology edge. It primarily operates in the United States. The company was formerly known as MSM Jewelry Corp. and changed its name to GEMZ Corporation in September 2003. The company was founded in 1996 and is based in Monsey, New York.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Monsey",
        "zipcode": "10952",
        "website": null,
        "market_cap": "Small Cap"
    },
    "MASN": {
        "short_name": "MAISON LUXE INC",
        "long_name": "Maison Luxe Inc.",
        "summary": "Clikia Corp., through its subsidiary, Maison Luxe LLC, engages in retailing luxury goods. It primarily focuses on offering fine timepieces and jewelry on wholesale and business-to-consumer basis. The company is based in Baton Rouge, Louisiana.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "LA",
        "city": "Baton Rouge",
        "zipcode": "70806",
        "website": "http://www.maisonluxeny.com",
        "market_cap": "Small Cap"
    },
    "MDNL": {
        "short_name": "MAIDEN LANE JEWELRY LTD",
        "long_name": "Maiden Lane Jewelry, Ltd.",
        "summary": "Maiden Lane Jewelry, Ltd. engages in the manufacture and wholesale of jewelry in the United States. The company offers fashion rings, pendants, necklaces, bracelets, and earrings with stones, such as diamonds, rubies, and emeralds; and a line of bridal engagement rings, pendants, and earrings under the Aspiri brand name. It sells its products to independent jewelry retailers. The company was formerly known as Romantique Ltd. and changed its name to Maiden Lane Jewelry, Ltd. in May 2014. Maiden Lane Jewelry, Ltd. was founded in 2012 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10036",
        "website": "http://www.maidenlaneltd.com",
        "market_cap": "Small Cap"
    },
    "MOV": {
        "short_name": "Movado Group Inc.",
        "long_name": "Movado Group, Inc.",
        "summary": "Movado Group, Inc. designs, sources, markets, and distributes watches worldwide. It operates in two segments, Watch and Accessory Brands, and Company Stores. The company offers its watches under the Movado, Concord, Ebel, Olivia Burton, and MVMT brands, as well as licensed brands, such as Coach, Tommy Hilfiger, HUGO BOSS, Lacoste, and Scuderia Ferrari. It also provides after-sales and shipping services. As of January 31, 2021, the company operated 47 retail outlet locations. Its customers include jewelry store chains, department stores, independent regional jewelers, licensors' retail stores, and a network of independent distributors. The company also sells directly to consumers via its e-commerce platforms. The company was formerly known as North American Watch Corporation and changed its name to Movado Group, Inc. in 1996. Movado Group, Inc. was founded in 1961 and is based in Paramus, New Jersey.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Paramus",
        "zipcode": "07652-3556",
        "website": "http://www.movadogroup.com",
        "market_cap": "Small Cap"
    },
    "MV4.F": {
        "short_name": "MOVADO GRP INC.  DL-,01",
        "long_name": "Movado Group, Inc.",
        "summary": "Movado Group, Inc. designs, sources, markets, and distributes watches worldwide. It operates in two segments, Watch and Accessory Brands, and Company Stores. The company offers its watches under the Movado, Concord, Ebel, Olivia Burton, and MVMT brands, as well as licensed brands, such as Coach, Tommy Hilfiger, HUGO BOSS, Lacoste, and Scuderia Ferrari. It also provides after-sales and shipping services. As of January 31, 2021, the company operated 47 retail outlet locations. Its customers include jewelry store chains, department stores, independent regional jewelers, licensors' retail stores, and a network of independent distributors. The company also sells directly to consumers via its e-commerce platforms. The company was formerly known as North American Watch Corporation and changed its name to Movado Group, Inc. in 1996. Movado Group, Inc. was founded in 1961 and is based in Paramus, New Jersey.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NJ",
        "city": "Paramus",
        "zipcode": "07652-3556",
        "website": "http://www.movadogroup.com",
        "market_cap": "Small Cap"
    },
    "SSOK": {
        "short_name": "SUNSTOCK INC",
        "long_name": "Sunstock, Inc.",
        "summary": "Sunstock, Inc. engages in the buying, selling, and distributing gold and precious metals. The company secures and/or acquires mining assets, as well as rights to purchase mining production and sells these metals primarily through retail channels, including branded coins. It owns and operates retail store, which engages in buying and selling of gold, silver, and rare coins in the greater Sacramento metropolitan area. The company was formerly known as Sandgate Acquisition Corporation and changed its name to Sunstock, Inc. in July 2013. Sunstock, Inc. was incorporated in 2012 and is based in Sacramento, California.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Sacramento",
        "zipcode": "95835",
        "website": "http://www.sunstockinc.com",
        "market_cap": "Small Cap"
    },
    "TPR": {
        "short_name": "Tapestry, Inc.",
        "long_name": "Tapestry, Inc.",
        "summary": "Tapestry, Inc. provides luxury accessories and branded lifestyle products in the United States, Japan, Greater China, Other Asia, and internationally. The company operates through three segments: Coach, Kate Spade, and Stuart Weitzman. The company offers women's accessories, including handbags, such as wallets, money pieces, wristlets, and cosmetic cases; novelty accessories comprising address books, time management and travel accessories, sketchbooks, and portfolios; and key rings and charms. It also provides bag collections, including business cases, computer bags, messenger-style bags, backpacks, and totes; small leather goods, such as wallets, card cases, travel organizers, and belts; and footwear, watches, sunglasses, novelty accessories, and ready-to-wear for men. In addition, the company offers women's footwear; sunglasses; bracelets, necklaces, rings, and earrings; fragrances and watches; women's seasonal lifestyle apparel collections that include outerwear and ready-to-wear, and cold weather accessories, which comprise gloves, scarves, and hats. Further, it provides ready-to-wear and footwear items for kids; fashion bedding and tableware; and stationery and gifts. Additionally, the company licenses rights to market and distribute its eyewear, watches, fragrances, and tech accessories under the Coach brand; and fashion beddings, tableware, eyewear, watches, stationery and gifts, and tech accessories under the Kate Spade brand. It sells its products to consumers through a network of 958 Coach stores, 420 Kate Spade stores, and 131 Stuart Weitzman stores, including the Internet and concession shop-in-shops; and wholesale customers, as well as through independent third party distributors. The company was formerly known as Coach, Inc. and changed its name to Tapestry, Inc. in October 2017. Tapestry, Inc. was founded in 1941 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10001",
        "website": "http://www.tapestry.com",
        "market_cap": "Large Cap"
    },
    "TPRY34.SA": {
        "short_name": "TAPESTRY INCDRN",
        "long_name": "Tapestry, Inc.",
        "summary": "Tapestry, Inc. provides luxury accessories and branded lifestyle products in the United States, Japan, Greater China, Other Asia, and internationally. The company operates through three segments: Coach, Kate Spade, and Stuart Weitzman. The company offers women's accessories, including handbags, such as wallets, money pieces, wristlets, and cosmetic cases; novelty accessories comprising address books, time management and travel accessories, sketchbooks, and portfolios; and key rings and charms. It also provides bag collections, including business cases, computer bags, messenger-style bags, backpacks, and totes; small leather goods, such as wallets, card cases, travel organizers, and belts; and footwear, watches, sunglasses, novelty accessories, and ready-to-wear for men. In addition, the company offers women's footwear; sunglasses; bracelets, necklaces, rings, and earrings; fragrances and watches; women's seasonal lifestyle apparel collections that include outerwear and ready-to-wear, and cold weather accessories, which comprise gloves, scarves, and hats. Further, it provides ready-to-wear and footwear items for kids; fashion bedding and tableware; and stationery and gifts. Additionally, the company licenses rights to market and distribute its eyewear, watches, fragrances, and tech accessories under the Coach brand; and fashion beddings, tableware, eyewear, watches, stationery and gifts, and tech accessories under the Kate Spade brand. It sells its products to consumers through a network of 958 Coach stores, 420 Kate Spade stores, and 131 Stuart Weitzman stores, including the Internet and concession shop-in-shops; and wholesale customers, as well as through independent third party distributors. The company was formerly known as Coach, Inc. and changed its name to Tapestry, Inc. in October 2017. Tapestry, Inc. was founded in 1941 and is headquartered in New York, New York.",
        "currency": "BRL",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10001",
        "website": "http://www.tapestry.com",
        "market_cap": "Large Cap"
    }
}