{
  "0WJ.MU": {
    "city": "Chino",
    "country": "United States",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Packaging & Containers",
    "long_name": "Karat Packaging Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "KARAT PACKAGING  DL -,001",
    "state": "CA",
    "summary": "Karat Packaging Inc. manufactures and distributes single-use disposable products in plastic, paper, biopolymer-based and other compostable forms primarily used in restaurants and foodservice areas. It offers food and take-out containers, bags, tableware, cups, lids, cutlery, and straws under the Karat and Karat Earth names. The company offers its products to domestic and regional distributors, restaurant chains, retail establishments, and online customers. It also provides new product development, design, printing, and logistics services. Karat Packaging Inc. was founded in 2000 and is headquartered in Chino, California.",
    "website": "http://www.karatpackaging.com",
    "zipcode": "91708"
  },
  "0ZA.F": {
    "city": "Concord Township",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "Ranpak Holdings Corp.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "RANPAK HLD. CL.A DL-,0001",
    "state": "OH",
    "summary": "Ranpak Holdings Corp., together with its subsidiaries, provide product protection solutions for e-commerce and industrial supply chains in North America, Europe, and Asia. The company manufactures and assembles proprietary protective systems that convert kraft paper into a range of packaging and cushioning products to address its customers' needs. It also offers protective packaging solutions, such as void-fill protective systems that convert paper to fill empty spaces in secondary packages and protect objects; cushioning protective systems, which convert paper into cushioning pads; and wrapping protective systems that create pads or paper mesh to wrap and protect fragile items, as well as to line boxes and provide separation when shipping various objects. The company's products also include line automation solutions, which comprise capital equipment that can size, pad, fill, flap, lid, tape, and/or label the product in an integrated fashion with the speed and flow of the customer's packaging line. It sells its products to end users primarily through a distributor network, and directly to select end users. Ranpak Holdings Corp. was founded in 1972 and is headquartered in Concord Township, Ohio.",
    "website": "http://www.ranpak.com",
    "zipcode": "44077"
  },
  "1WR.DE": {
    "city": "Atlanta",
    "country": "United States",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Packaging & Containers",
    "long_name": "WestRock Company",
    "market": "de_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "WESTROCK CO.  DL-,01",
    "state": "GA",
    "summary": "WestRock Company manufactures and sells paper and packaging solutions in North America, South America, Europe, Asia, and Australia. The company operates through Corrugated Packaging and Consumer Packaging segments. The Corrugated Packaging segment produces containerboards, corrugated sheets, corrugated packaging, and preprinted linerboards for sale to consumer and industrial products manufacturers, and corrugated box manufacturers. It also provides structural and graphic design, engineering services and custom, and automated packaging machines; offers a machinery solution that creates pouches to replace single-use plastics, including bubble mailers; distributes corrugated packaging materials and other specialty packaging products, including stretch films, void fills, carton sealing tapes, and other specialty tapes; operates recycling facilities that collect, sort, grade, and bale recovered paper; and provides lithographic laminated packaging products, as well as contract packing services. The Consumer Packaging segment manufactures and sells folding cartons that are used to package food, paper, beverages, dairy products, tobacco, confectionery, health and beauty, other household consumer, and commercial and industrial products; and express mail packages for the overnight courier industry. It also offers inserts and labels, as well as rigid packaging and other printed packaging products, such as transaction cards, brochures, product literature, marketing materials, and grower tags and plant stakes for the horticultural market; and secondary packages and paperboard packaging for over-the-counter and prescription drugs. In addition, this segment manufactures and sells solid fiber and corrugated partitions, and die-cut paperboard components principally to glass container manufacturers, producers of beer, food, wine, spirits, cosmetics and pharmaceuticals, and the automotive industry. WestRock Company is based in Atlanta, Georgia.",
    "website": "http://www.westrock.com",
    "zipcode": "30328"
  },
  "1WR.F": {
    "city": "Atlanta",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "WestRock Company",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "WESTROCK CO.  DL-,01",
    "state": "GA",
    "summary": "WestRock Company manufactures and sells paper and packaging solutions in North America, South America, Europe, Asia, and Australia. The company operates through Corrugated Packaging and Consumer Packaging segments. The Corrugated Packaging segment produces containerboards, corrugated sheets, corrugated packaging, and preprinted linerboards for sale to consumer and industrial products manufacturers, and corrugated box manufacturers. It also provides structural and graphic design, engineering services and custom, and automated packaging machines; offers a machinery solution that creates pouches to replace single-use plastics, including bubble mailers; distributes corrugated packaging materials and other specialty packaging products, including stretch films, void fills, carton sealing tapes, and other specialty tapes; operates recycling facilities that collect, sort, grade, and bale recovered paper; and provides lithographic laminated packaging products, as well as contract packing services. The Consumer Packaging segment manufactures and sells folding cartons that are used to package food, paper, beverages, dairy products, tobacco, confectionery, health and beauty, other household consumer, and commercial and industrial products; and express mail packages for the overnight courier industry. It also offers inserts and labels, as well as rigid packaging and other printed packaging products, such as transaction cards, brochures, product literature, marketing materials, and grower tags and plant stakes for the horticultural market; and secondary packages and paperboard packaging for over-the-counter and prescription drugs. In addition, this segment manufactures and sells solid fiber and corrugated partitions, and die-cut paperboard components principally to glass container manufacturers, producers of beer, food, wine, spirits, cosmetics and pharmaceuticals, and the automotive industry. WestRock Company is based in Atlanta, Georgia.",
    "website": "http://www.westrock.com",
    "zipcode": "30328"
  },
  "3ZT.F": {
    "city": "Lake Forest",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "Reynolds Consumer Products Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "REYNOLDS CONS.PROD.DL-001",
    "state": "IL",
    "summary": "Reynolds Consumer Products Inc. produces and sells products in cooking, waste and storage, and tableware product categories in the United States and internationally. It operates through four segments: Reynolds Cooking & Baking, Hefty Waste & Storage, Hefty Tableware, and Presto Products. The Reynolds Cooking & Baking segment produces foil, disposable aluminum pans, parchment paper, freezer paper, wax paper, plastic wrap, baking cups, oven bags, and slow cooker liners under the Reynolds Wrap, Reynolds KITCHENS, and E-Z Foil brands in the United States, as well as under the ALCAN brand in Canada and under the Diamond brand internationally. The Hefty Waste & Storage segment sells trash and food storage bags under the Hefty Ultra Strong, Hefty Strong Trash Bags, Hefty Renew, and Hefty Slider Bags brands. It offers a suite of indoor and outdoor trash bags and contractor bags, including blue and clear recycling bags, compostable bags, bags made from recycled materials, and the Hefty EnergyBag Program. The Hefty Tableware segment provides disposable and compostable plates, bowls, platters, cups, and cutlery under the Hefty brand. The Presto Products segment primarily sells store brand products in food storage bags, trash bags, reusable storage containers, and plastic wrap categories. Reynolds Consumer Products Inc. offers both branded and store brand products to grocery stores, mass merchants, warehouse clubs, discount chains, dollar stores, drug stores, home improvement stores, military outlets, and eCommerce retailers. The company was founded in 1947 and is headquartered in Lake Forest, Illinois. Reynolds Consumer Products Inc. is a subsidiary of Packaging Finance Limited.",
    "website": "http://www.reynoldsconsumerproducts.com",
    "zipcode": "60045"
  },
  "4W8.F": {
    "city": "Atlanta",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "Graphic Packaging Holding Company",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GRAPHIC PACK.HLDG  DL-,01",
    "state": "GA",
    "summary": "Graphic Packaging Holding Company, together with its subsidiaries, provides paper-based packaging solutions to food, beverage, foodservice, and other consumer products companies. It operates through three segments: Paperboard Mills, Americas Paperboard Packaging, and Europe Paperboard Packaging. The company offers coated unbleached kraft (CUK), coated recycled paperboard (CRB), and solid bleached sulfate paperboard (SBS) to various paperboard packaging converters and brokers; and paperboard packaging products, such as folding cartons, cups, lids, and food containers primarily to consumer packaged goods, quick-service restaurants, and foodservice companies; and barrier packaging products that protect against moisture, hot and cold temperature, grease, oil, oxygen, sunlight, insects, and other potential product-damaging factors. It also offers various laminated, coated, and printed packaging structures that are produced from its CUK, CRB, and SBS, as well as other grades of paperboards that are purchased from third-party suppliers; designs and manufactures specialized packaging machines that package bottles and cans, and non-beverage consumer products; and installs its packaging machines at customer plants and provides support, service, and performance monitoring of the machines. The company markets its products primarily through sales offices and broker arrangements with third parties in the Americas, Europe, and the Asia Pacific. Graphic Packaging Holding Company was incorporated in 2007 and is headquartered in Atlanta, Georgia.",
    "website": "http://www.graphicpkg.com",
    "zipcode": "30328"
  },
  "ACTX": {
    "city": "Corona",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaging & Containers",
    "long_name": "Advanced Container Technologies, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ADVANCED CONTAINER TECHNOLOGIES",
    "state": "CA",
    "summary": "Advanced Container Technologies Inc. engages in designing, manufacturing, and selling plastic medical grade containers. The company is based in Corona, California.",
    "website": null,
    "zipcode": "92880"
  },
  "AGT.F": {
    "city": "Crystal Lake",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "AptarGroup, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "APTARGRP INC.  DL-,01",
    "state": "IL",
    "summary": "AptarGroup, Inc. provides a range of packaging, dispensing, and sealing solutions primarily for the beauty, personal care, home care, prescription drug, consumer health care, injectable, and food and beverage markets. The company operates through three segments: Pharma, Beauty + Home, and Food + Beverage. The Pharma segment provides pumps for nasal allergy treatments; and metered dose inhaler valves for respiratory ailments, such as asthma and chronic obstructive pulmonary diseases in pharmaceutical market; elastomer for injectable primary packaging components; and active packaging products. The Beauty + Home segment primarily sells pumps, closures, aerosol valves, accessories, and sealing solutions to the personal care and home care markets; and pumps and decorative components to the beauty market. The Food + Beverage segment offers dispensing and non-dispensing closures, elastomeric flow control components, spray pumps, and aerosol valves to the food and beverage markets. The company sells its products through own sales force, as well as independent representatives and distributors in Asia, Europe, Latin America, and North America. AptarGroup, Inc. has a strategic partnership with PureCycle Technologies LLC to develop ultra-pure recycled polypropylene into dispensing applications; and a collaboration with Sonmol for developing a digital therapies and services platform targeting respiratory and other diseases. The company was incorporated in 1992 and is headquartered in Crystal Lake, Illinois.",
    "website": "http://www.aptar.com",
    "zipcode": "60014"
  },
  "ATR": {
    "city": "Crystal Lake",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaging & Containers",
    "long_name": "AptarGroup, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "AptarGroup, Inc.",
    "state": "IL",
    "summary": "AptarGroup, Inc. provides a range of packaging, dispensing, and sealing solutions primarily for the beauty, personal care, home care, prescription drug, consumer health care, injectable, and food and beverage markets. The company operates through three segments: Pharma, Beauty + Home, and Food + Beverage. The Pharma segment provides pumps for nasal allergy treatments; and metered dose inhaler valves for respiratory ailments, such as asthma and chronic obstructive pulmonary diseases in pharmaceutical market; elastomer for injectable primary packaging components; and active packaging products. The Beauty + Home segment primarily sells pumps, closures, aerosol valves, accessories, and sealing solutions to the personal care and home care markets; and pumps and decorative components to the beauty market. The Food + Beverage segment offers dispensing and non-dispensing closures, elastomeric flow control components, spray pumps, and aerosol valves to the food and beverage markets. The company sells its products through own sales force, as well as independent representatives and distributors in Asia, Europe, Latin America, and North America. AptarGroup, Inc. has a strategic partnership with PureCycle Technologies LLC to develop ultra-pure recycled polypropylene into dispensing applications; and a collaboration with Sonmol for developing a digital therapies and services platform targeting respiratory and other diseases. The company was incorporated in 1992 and is headquartered in Crystal Lake, Illinois.",
    "website": "http://www.aptar.com",
    "zipcode": "60014"
  },
  "B1LL34.SA": {
    "city": "Westminster",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Packaging & Containers",
    "long_name": "Ball Corporation",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BALL CORP   DRN",
    "state": "CO",
    "summary": "Ball Corporation supplies aluminum packaging products for the beverage, personal care, and household products industries in the United States, Brazil, and internationally. It operates through four segments: Beverage Packaging, North and Central America; Beverage Packaging, Europe, Middle East and Africa; Beverage Packaging, South America; and Aerospace. The company manufactures and sells aluminum beverage containers to fillers of carbonated soft drinks, beer, energy drinks, and other beverages. It also develops spacecraft, sensors and instruments, radio frequency systems, and other technologies and products for the civil, commercial, and national security aerospace markets, as well as offers defense hardware, antenna and video tactical solutions, civil and operational space hardware, and systems engineering services. In addition, the company designs, manufactures, and tests satellites, remote sensors, and ground station control hardware and software; and provides launch vehicle integration and satellite operational services. Further, it provides target identification, warning, and attitude control systems and components; cryogenic systems and associated sensor cooling devices; star trackers; and fast-steering mirrors to the government agencies and prime contractors. Additionally, the company manufactures and sells extruded aluminum aerosol containers, aluminum cups, and aluminum slugs. Ball Corporation was founded in 1880 and is headquartered in Westminster, Colorado.",
    "website": "http://www.ball.com",
    "zipcode": "80021-2510"
  },
  "BERY": {
    "city": "Evansville",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaging & Containers",
    "long_name": "Berry Global Group, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Berry Global Group, Inc.",
    "state": "IN",
    "summary": "Berry Global Group, Inc. manufactures and supplies non-woven, flexible, and rigid products in consumer and industrial end markets. Its Consumer Packaging International segment offers closures, dispensing systems, and applicators; inhalers and dose counters; polythene films; packaging solutions for consumer and industrial applications in personal care, beverage, and food markets; injection molded and thermoformed containers, and lids; and molds and molded components, as well as recycles rigid and flexible end of life materials from industrial and consumer sources. Its Consumer Packaging North America segment provides containers and pails for branded and private label customers; lightweight polypropylene cups and lids for hot and cold beverages; child-resistant, continuous-thread, and tamper closures, as well as aerosol overcaps; bottles and prescription vials; and extruded and laminate tubes. Its Engineered Materials segment offers engineered materials, including stretch and shrink films, and converter films; trash-can liners and food bags; cloth and foil, splicing and laminating, flame-retardant, flashing and seaming tapes, double-faced cloth, masking, mounting, OEM, and medical and specialty tapes; and food and consumer films, retail bags, and agriculture films. Its Health, Hygiene & Specialties segment provides medical garment materials, surgical drapes, household cleaning wipes, and face masks for infection prevention; components for baby diapers, adult incontinence, and other absorbent hygiene products, elastic films and laminates, and substrates for dryer sheets; and products and components for geosynthetics and filtration products. The company sells its products through direct sales force of professionals and distributors in the United States, Canada, Europe, and internally. The company was formerly known as Berry Plastics Group, Inc. and changed its name to Berry Global Group, Inc. in April 2017. Berry Global Group, Inc. was founded in 1967 and is headquartered in Evansville, Indiana.",
    "website": "http://www.berryglobal.com",
    "zipcode": "47710"
  },
  "BL8.F": {
    "city": "Westminster",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "Ball Corporation",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BALL CORP.",
    "state": "CO",
    "summary": "Ball Corporation supplies aluminum packaging products for the beverage, personal care, and household products industries in the United States, Brazil, and internationally. It operates through four segments: Beverage Packaging, North and Central America; Beverage Packaging, Europe, Middle East and Africa; Beverage Packaging, South America; and Aerospace. The company manufactures and sells aluminum beverage containers to fillers of carbonated soft drinks, beer, energy drinks, and other beverages. It also develops spacecraft, sensors and instruments, radio frequency systems, and other technologies and products for the civil, commercial, and national security aerospace markets, as well as offers defense hardware, antenna and video tactical solutions, civil and operational space hardware, and systems engineering services. In addition, the company designs, manufactures, and tests satellites, remote sensors, and ground station control hardware and software; and provides launch vehicle integration and satellite operational services. Further, it provides target identification, warning, and attitude control systems and components; cryogenic systems and associated sensor cooling devices; star trackers; and fast-steering mirrors to the government agencies and prime contractors. Additionally, the company manufactures and sells extruded aluminum aerosol containers, aluminum cups, and aluminum slugs. Ball Corporation was founded in 1880 and is headquartered in Westminster, Colorado.",
    "website": "http://www.ball.com",
    "zipcode": "80021-2510"
  },
  "BLL": {
    "city": "Westminster",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaging & Containers",
    "long_name": "Ball Corporation",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Ball Corporation",
    "state": "CO",
    "summary": "Ball Corporation supplies aluminum packaging products for the beverage, personal care, and household products industries in the United States, Brazil, and internationally. It operates through four segments: Beverage Packaging, North and Central America; Beverage Packaging, Europe, Middle East and Africa; Beverage Packaging, South America; and Aerospace. The company manufactures and sells aluminum beverage containers to fillers of carbonated soft drinks, beer, energy drinks, and other beverages. It also develops spacecraft, sensors and instruments, radio frequency systems, and other technologies and products for the civil, commercial, and national security aerospace markets, as well as offers defense hardware, antenna and video tactical solutions, civil and operational space hardware, and systems engineering services. In addition, the company designs, manufactures, and tests satellites, remote sensors, and ground station control hardware and software; and provides launch vehicle integration and satellite operational services. Further, it provides target identification, warning, and attitude control systems and components; cryogenic systems and associated sensor cooling devices; star trackers; and fast-steering mirrors to the government agencies and prime contractors. Additionally, the company manufactures and sells extruded aluminum aerosol containers, aluminum cups, and aluminum slugs. Ball Corporation was founded in 1880 and is headquartered in Westminster, Colorado.",
    "website": "http://www.ball.com",
    "zipcode": "80021-2510"
  },
  "BP0.F": {
    "city": "Evansville",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "Berry Global Group, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BERRY GLOBAL GRP  DL-,01",
    "state": "IN",
    "summary": "Berry Global Group, Inc. manufactures and supplies non-woven, flexible, and rigid products in consumer and industrial end markets. Its Consumer Packaging International segment offers closures, dispensing systems, and applicators; inhalers and dose counters; polythene films; packaging solutions for consumer and industrial applications in personal care, beverage, and food markets; injection molded and thermoformed containers, and lids; and molds and molded components, as well as recycles rigid and flexible end of life materials from industrial and consumer sources. Its Consumer Packaging North America segment provides containers and pails for branded and private label customers; lightweight polypropylene cups and lids for hot and cold beverages; child-resistant, continuous-thread, and tamper closures, as well as aerosol overcaps; bottles and prescription vials; and extruded and laminate tubes. Its Engineered Materials segment offers engineered materials, including stretch and shrink films, and converter films; trash-can liners and food bags; cloth and foil, splicing and laminating, flame-retardant, flashing and seaming tapes, double-faced cloth, masking, mounting, OEM, and medical and specialty tapes; and food and consumer films, retail bags, and agriculture films. Its Health, Hygiene & Specialties segment provides medical garment materials, surgical drapes, household cleaning wipes, and face masks for infection prevention; components for baby diapers, adult incontinence, and other absorbent hygiene products, elastic films and laminates, and substrates for dryer sheets; and products and components for geosynthetics and filtration products. The company sells its products through direct sales force of professionals and distributors in the United States, Canada, Europe, and internally. The company was formerly known as Berry Plastics Group, Inc. and changed its name to Berry Global Group, Inc. in April 2017. Berry Global Group, Inc. was founded in 1967 and is headquartered in Evansville, Indiana.",
    "website": "http://www.berryglobal.com",
    "zipcode": "47710"
  },
  "CCK": {
    "city": "Yardley",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaging & Containers",
    "long_name": "Crown Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Crown Holdings, Inc.",
    "state": "PA",
    "summary": "Crown Holdings, Inc. designs, manufactures, and sells packaging products and equipment for consumer goods and industrial products in the Americas, Europe, and the Asia Pacific. It offers products for consumer goods, including steel and aluminum cans for food, beverage, household, and other consumer products; glass bottles for beverage product; and metal vacuum closures and steel crowns through its sales organization to the soft drink, food, citrus, brewing, household products, personal care, and various other industries. The company also provides products for industrial products, such as steel and plastic strap consumables and equipment, paper-based protective packaging, and plastic film consumables and equipment to metals, food and beverage, construction, agricultural, corrugated, and general industries. In addition, it offers aerosol cans and ends; and promotional and specialty packaging containers with various lid and closure variations. Further, the company provides industrial film and other related products; transit protection products, such as airbags, edge protectors, and honeycombs; and equipment and tools, such as manual, semi-automatic, and automatic equipment and tools used in end of line manufacturing applications to apply consumables. Crown Holdings, Inc. was founded in 1892 and is headquartered in Yardley, Pennsylvania.",
    "website": "http://www.crowncork.com",
    "zipcode": "19067-4232"
  },
  "CCK.MX": {
    "city": "Yardley",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Packaging & Containers",
    "long_name": "Crown Holdings, Inc.",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CROWN HOLDINGS INC",
    "state": "PA",
    "summary": "Crown Holdings, Inc. designs, manufactures, and sells packaging products and equipment for consumer goods and industrial products in the Americas, Europe, and the Asia Pacific. It offers products for consumer goods, including steel and aluminum cans for food, beverage, household, and other consumer products; glass bottles for beverage product; and metal vacuum closures and steel crowns through its sales organization to the soft drink, food, citrus, brewing, household products, personal care, and various other industries. The company also provides products for industrial products, such as steel and plastic strap consumables and equipment, paper-based protective packaging, and plastic film consumables and equipment to metals, food and beverage, construction, agricultural, corrugated, and general industries. In addition, it offers aerosol cans and ends; and promotional and specialty packaging containers with various lid and closure variations. Further, the company provides industrial film and other related products; transit protection products, such as airbags, edge protectors, and honeycombs; and equipment and tools, such as manual, semi-automatic, and automatic equipment and tools used in end of line manufacturing applications to apply consumables. Crown Holdings, Inc. was founded in 1892 and is headquartered in Yardley, Pennsylvania.",
    "website": "http://www.crowncork.com",
    "zipcode": "19067-4232"
  },
  "CWN.F": {
    "city": "Yardley",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "Crown Holdings, Inc.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CROWN HOLDINGS INC.  DL 5",
    "state": "PA",
    "summary": "Crown Holdings, Inc. designs, manufactures, and sells packaging products and equipment for consumer goods and industrial products in the Americas, Europe, and the Asia Pacific. It offers products for consumer goods, including steel and aluminum cans for food, beverage, household, and other consumer products; glass bottles for beverage product; and metal vacuum closures and steel crowns through its sales organization to the soft drink, food, citrus, brewing, household products, personal care, and various other industries. The company also provides products for industrial products, such as steel and plastic strap consumables and equipment, paper-based protective packaging, and plastic film consumables and equipment to metals, food and beverage, construction, agricultural, corrugated, and general industries. In addition, it offers aerosol cans and ends; and promotional and specialty packaging containers with various lid and closure variations. Further, the company provides industrial film and other related products; transit protection products, such as airbags, edge protectors, and honeycombs; and equipment and tools, such as manual, semi-automatic, and automatic equipment and tools used in end of line manufacturing applications to apply consumables. Crown Holdings, Inc. was founded in 1892 and is headquartered in Yardley, Pennsylvania.",
    "website": "http://www.crowncork.com",
    "zipcode": "19067-4232"
  },
  "GB6B.F": {
    "city": "Delaware",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "Greif, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GREIF INC. CL.B",
    "state": "OH",
    "summary": "Greif, Inc. produces and sells industrial packaging products and services worldwide. It operates through four segments: Rigid Industrial Packaging & Services; Paper Packaging & Services; Flexible Products & Services; and Land Management. The Rigid Industrial Packaging & Services segment offers rigid industrial packaging products, including steel, fiber, and plastic drums; rigid intermediate bulk containers; closure systems for industrial packaging products; transit protection products; water bottles, and remanufactured and reconditioned industrial containers; and services, such as container life cycle management, filling, logistics, warehousing, and other packaging services. This segment sells its products to customers in the chemicals, paints and pigments, food and beverage, petroleum, industrial coatings, agricultural, pharmaceutical and minerals, and other industries. The Paper Packaging & Services segment provides containerboards, corrugated sheets, corrugated containers, and other corrugated and specialty products to customers in the packaging, automotive, food, and building products markets. This segment's corrugated container products are used to ship various products, such as home appliances, small machinery, grocery products, automotive components, books, and furniture, as well as various other applications. The Flexible Products & Services segment offers flexible intermediate bulk containers comprising polypropylene-based woven fabric, as well as related services to the agricultural, food, and other industries. The Land Management segment engages in harvesting and regeneration of timber properties; and sale of timberland and special use land. As of October 31, 2020, this segment owned approximately 244,000 acres of timber property in the southeastern United States. The company was formerly known as Greif Bros. Corporation and changed its name to Greif, Inc. in 2001. Greif, Inc. was founded in 1877 and is based in Delaware, Ohio.",
    "website": "http://www.greif.com",
    "zipcode": "43015"
  },
  "GEF": {
    "city": "Delaware",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaging & Containers",
    "long_name": "Greif, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Greif Inc.",
    "state": "OH",
    "summary": "Greif, Inc. produces and sells industrial packaging products and services worldwide. It operates through four segments: Rigid Industrial Packaging & Services; Paper Packaging & Services; Flexible Products & Services; and Land Management. The Rigid Industrial Packaging & Services segment offers rigid industrial packaging products, including steel, fiber, and plastic drums; rigid intermediate bulk containers; closure systems for industrial packaging products; transit protection products; water bottles, and remanufactured and reconditioned industrial containers; and services, such as container life cycle management, filling, logistics, warehousing, and other packaging services. This segment sells its products to customers in the chemicals, paints and pigments, food and beverage, petroleum, industrial coatings, agricultural, pharmaceutical and minerals, and other industries. The Paper Packaging & Services segment provides containerboards, corrugated sheets, corrugated containers, and other corrugated and specialty products to customers in the packaging, automotive, food, and building products markets. This segment's corrugated container products are used to ship various products, such as home appliances, small machinery, grocery products, automotive components, books, and furniture, as well as various other applications. The Flexible Products & Services segment offers flexible intermediate bulk containers comprising polypropylene-based woven fabric, as well as related services to the agricultural, food, and other industries. The Land Management segment engages in harvesting and regeneration of timber properties; and sale of timberland and special use land. As of October 31, 2020, this segment owned approximately 244,000 acres of timber property in the southeastern United States. The company was formerly known as Greif Bros. Corporation and changed its name to Greif, Inc. in 2001. Greif, Inc. was founded in 1877 and is based in Delaware, Ohio.",
    "website": "http://www.greif.com",
    "zipcode": "43015"
  },
  "GEF-B": {
    "city": "Delaware",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaging & Containers",
    "long_name": "Greif, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Greif, Inc. Corporation",
    "state": "OH",
    "summary": "Greif, Inc. produces and sells industrial packaging products and services worldwide. It operates through four segments: Rigid Industrial Packaging & Services; Paper Packaging & Services; Flexible Products & Services; and Land Management. The Rigid Industrial Packaging & Services segment offers rigid industrial packaging products, including steel, fiber, and plastic drums; rigid intermediate bulk containers; closure systems for industrial packaging products; transit protection products; water bottles, and remanufactured and reconditioned industrial containers; and services, such as container life cycle management, filling, logistics, warehousing, and other packaging services. This segment sells its products to customers in the chemicals, paints and pigments, food and beverage, petroleum, industrial coatings, agricultural, pharmaceutical and minerals, and other industries. The Paper Packaging & Services segment provides containerboards, corrugated sheets, corrugated containers, and other corrugated and specialty products to customers in the packaging, automotive, food, and building products markets. This segment's corrugated container products are used to ship various products, such as home appliances, small machinery, grocery products, automotive components, books, and furniture, as well as various other applications. The Flexible Products & Services segment offers flexible intermediate bulk containers comprising polypropylene-based woven fabric, as well as related services to the agricultural, food, and other industries. The Land Management segment engages in harvesting and regeneration of timber properties; and sale of timberland and special use land. As of October 31, 2020, this segment owned approximately 244,000 acres of timber property in the southeastern United States. The company was formerly known as Greif Bros. Corporation and changed its name to Greif, Inc. in 2001. Greif, Inc. was founded in 1877 and is based in Delaware, Ohio.",
    "website": "http://www.greif.com",
    "zipcode": "43015"
  },
  "GPK": {
    "city": "Atlanta",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaging & Containers",
    "long_name": "Graphic Packaging Holding Company",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Graphic Packaging Holding Compa",
    "state": "GA",
    "summary": "Graphic Packaging Holding Company, together with its subsidiaries, provides paper-based packaging solutions to food, beverage, foodservice, and other consumer products companies. It operates through three segments: Paperboard Mills, Americas Paperboard Packaging, and Europe Paperboard Packaging. The company offers coated unbleached kraft (CUK), coated recycled paperboard (CRB), and solid bleached sulfate paperboard (SBS) to various paperboard packaging converters and brokers; and paperboard packaging products, such as folding cartons, cups, lids, and food containers primarily to consumer packaged goods, quick-service restaurants, and foodservice companies; and barrier packaging products that protect against moisture, hot and cold temperature, grease, oil, oxygen, sunlight, insects, and other potential product-damaging factors. It also offers various laminated, coated, and printed packaging structures that are produced from its CUK, CRB, and SBS, as well as other grades of paperboards that are purchased from third-party suppliers; designs and manufactures specialized packaging machines that package bottles and cans, and non-beverage consumer products; and installs its packaging machines at customer plants and provides support, service, and performance monitoring of the machines. The company markets its products primarily through sales offices and broker arrangements with third parties in the Americas, Europe, and the Asia Pacific. Graphic Packaging Holding Company was incorporated in 2007 and is headquartered in Atlanta, Georgia.",
    "website": "http://www.graphicpkg.com",
    "zipcode": "30328"
  },
  "GR3.F": {
    "city": "Delaware",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "Greif, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GREIF INC. CL.A",
    "state": "OH",
    "summary": "Greif, Inc. produces and sells industrial packaging products and services worldwide. It operates through four segments: Rigid Industrial Packaging & Services; Paper Packaging & Services; Flexible Products & Services; and Land Management. The Rigid Industrial Packaging & Services segment offers rigid industrial packaging products, including steel, fiber, and plastic drums; rigid intermediate bulk containers; closure systems for industrial packaging products; transit protection products; water bottles, and remanufactured and reconditioned industrial containers; and services, such as container life cycle management, filling, logistics, warehousing, and other packaging services. This segment sells its products to customers in the chemicals, paints and pigments, food and beverage, petroleum, industrial coatings, agricultural, pharmaceutical and minerals, and other industries. The Paper Packaging & Services segment provides containerboards, corrugated sheets, corrugated containers, and other corrugated and specialty products to customers in the packaging, automotive, food, and building products markets. This segment's corrugated container products are used to ship various products, such as home appliances, small machinery, grocery products, automotive components, books, and furniture, as well as various other applications. The Flexible Products & Services segment offers flexible intermediate bulk containers comprising polypropylene-based woven fabric, as well as related services to the agricultural, food, and other industries. The Land Management segment engages in harvesting and regeneration of timber properties; and sale of timberland and special use land. As of October 31, 2020, this segment owned approximately 244,000 acres of timber property in the southeastern United States. The company was formerly known as Greif Bros. Corporation and changed its name to Greif, Inc. in 2001. Greif, Inc. was founded in 1877 and is based in Delaware, Ohio.",
    "website": "http://www.greif.com",
    "zipcode": "43015"
  },
  "I1PC34.SA": {
    "city": "Memphis",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Packaging & Containers",
    "long_name": "International Paper Company",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "INTERNATIONADRN",
    "state": "TN",
    "summary": "International Paper Company operates as a paper and packaging company primarily in United States, the Middle East, Europe, Africa, Pacific Rim, Asia, and rest of the Americas. It operates through three segments: Industrial Packaging, Global Cellulose Fibers, and Printing Papers. The Industrial Packaging segment manufactures containerboards, including linerboard, medium, whitetop, recycled linerboard, recycled medium, and saturating kraft. The Global Cellulose Fibers segment provides fluff, market, and specialty pulps that are used in absorbent hygiene products, such as baby diapers, feminine care, adult incontinence, and other non-woven products; tissue and paper products; and non-absorbent end applications, including textiles, filtration, construction material, paints and coatings, reinforced plastics, and other applications. The Printing Papers segment produces printing and writing papers, such as uncoated papers for end-use applications comprising brochures, pamphlets, greeting cards, books, annual reports, and direct mail, as well as envelopes, tablets, business forms, and file folders. It sells its uncoated papers under the Hammermill, Springhill, Williamsburg, Postmark, Accent, Great White, Chamex, Ballet, Rey, Pol, and Svetocopy brands. The company sells its products directly to end users and converters, as well as through agents, resellers, and paper distributors. International Paper Company was founded in 1898 and is headquartered in Memphis, Tennessee.",
    "website": "http://www.internationalpaper.com",
    "zipcode": "38197"
  },
  "IDND": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaging & Containers",
    "long_name": "International Dispensing Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "INTERNATIONAL DISPENSING CORP",
    "state": "NY",
    "summary": "International Dispensing Corporation designs, manufactures, and sells proprietary packaging and dispensing solutions for the flowable food, beverage, medical, pharmaceutical, and chemical industries. The company's products include The Answer, a low-acid and aseptic tap that can dispense liquid foods and beverages continuously without refrigeration; and IDC/Cryovac SpeedFlex BIB filler, an ultra-high-speed filler for bag-in-box (BIB) products. The company offers its products in China, Korea, Mexico, Pakistan, India, Dubai, Saudi Arabia, Israel, Germany, and Italy. International Dispensing Corporation was incorporated in 1995 and is headquartered in New York, New York.",
    "website": "http://www.idcinnovation.com",
    "zipcode": "10028"
  },
  "INP.DE": {
    "city": "Memphis",
    "country": "United States",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Packaging & Containers",
    "long_name": "International Paper Company",
    "market": "de_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "INTL PAPER  DL 1",
    "state": "TN",
    "summary": "International Paper Company operates as a paper and packaging company primarily in United States, the Middle East, Europe, Africa, Pacific Rim, Asia, and rest of the Americas. It operates through three segments: Industrial Packaging, Global Cellulose Fibers, and Printing Papers. The Industrial Packaging segment manufactures containerboards, including linerboard, medium, whitetop, recycled linerboard, recycled medium, and saturating kraft. The Global Cellulose Fibers segment provides fluff, market, and specialty pulps that are used in absorbent hygiene products, such as baby diapers, feminine care, adult incontinence, and other non-woven products; tissue and paper products; and non-absorbent end applications, including textiles, filtration, construction material, paints and coatings, reinforced plastics, and other applications. The Printing Papers segment produces printing and writing papers, such as uncoated papers for end-use applications comprising brochures, pamphlets, greeting cards, books, annual reports, and direct mail, as well as envelopes, tablets, business forms, and file folders. It sells its uncoated papers under the Hammermill, Springhill, Williamsburg, Postmark, Accent, Great White, Chamex, Ballet, Rey, Pol, and Svetocopy brands. The company sells its products directly to end users and converters, as well as through agents, resellers, and paper distributors. International Paper Company was founded in 1898 and is headquartered in Memphis, Tennessee.",
    "website": "http://www.internationalpaper.com",
    "zipcode": "38197"
  },
  "INP.F": {
    "city": "Memphis",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "International Paper Company",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "INTL PAPER  DL 1",
    "state": "TN",
    "summary": "International Paper Company operates as a paper and packaging company primarily in United States, the Middle East, Europe, Africa, Pacific Rim, Asia, and rest of the Americas. It operates through three segments: Industrial Packaging, Global Cellulose Fibers, and Printing Papers. The Industrial Packaging segment manufactures containerboards, including linerboard, medium, whitetop, recycled linerboard, recycled medium, and saturating kraft. The Global Cellulose Fibers segment provides fluff, market, and specialty pulps that are used in absorbent hygiene products, such as baby diapers, feminine care, adult incontinence, and other non-woven products; tissue and paper products; and non-absorbent end applications, including textiles, filtration, construction material, paints and coatings, reinforced plastics, and other applications. The Printing Papers segment produces printing and writing papers, such as uncoated papers for end-use applications comprising brochures, pamphlets, greeting cards, books, annual reports, and direct mail, as well as envelopes, tablets, business forms, and file folders. It sells its uncoated papers under the Hammermill, Springhill, Williamsburg, Postmark, Accent, Great White, Chamex, Ballet, Rey, Pol, and Svetocopy brands. The company sells its products directly to end users and converters, as well as through agents, resellers, and paper distributors. International Paper Company was founded in 1898 and is headquartered in Memphis, Tennessee.",
    "website": "http://www.internationalpaper.com",
    "zipcode": "38197"
  },
  "IP": {
    "city": "Memphis",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaging & Containers",
    "long_name": "International Paper Company",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "International Paper Company",
    "state": "TN",
    "summary": "International Paper Company operates as a paper and packaging company primarily in United States, the Middle East, Europe, Africa, Pacific Rim, Asia, and rest of the Americas. It operates through three segments: Industrial Packaging, Global Cellulose Fibers, and Printing Papers. The Industrial Packaging segment manufactures containerboards, including linerboard, medium, whitetop, recycled linerboard, recycled medium, and saturating kraft. The Global Cellulose Fibers segment provides fluff, market, and specialty pulps that are used in absorbent hygiene products, such as baby diapers, feminine care, adult incontinence, and other non-woven products; tissue and paper products; and non-absorbent end applications, including textiles, filtration, construction material, paints and coatings, reinforced plastics, and other applications. The Printing Papers segment produces printing and writing papers, such as uncoated papers for end-use applications comprising brochures, pamphlets, greeting cards, books, annual reports, and direct mail, as well as envelopes, tablets, business forms, and file folders. It sells its uncoated papers under the Hammermill, Springhill, Williamsburg, Postmark, Accent, Great White, Chamex, Ballet, Rey, Pol, and Svetocopy brands. The company sells its products directly to end users and converters, as well as through agents, resellers, and paper distributors. International Paper Company was founded in 1898 and is headquartered in Memphis, Tennessee.",
    "website": "http://www.internationalpaper.com",
    "zipcode": "38197"
  },
  "IP.MX": {
    "city": "Memphis",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Packaging & Containers",
    "long_name": "International Paper Company",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "INTERNATIONAL PAPER CO",
    "state": "TN",
    "summary": "International Paper Company operates as a paper and packaging company primarily in United States, the Middle East, Europe, Africa, Pacific Rim, Asia, and rest of the Americas. It operates through three segments: Industrial Packaging, Global Cellulose Fibers, and Printing Papers. The Industrial Packaging segment manufactures containerboards, including linerboard, medium, whitetop, recycled linerboard, recycled medium, and saturating kraft. The Global Cellulose Fibers segment provides fluff, market, and specialty pulps that are used in absorbent hygiene products, such as baby diapers, feminine care, adult incontinence, and other non-woven products; tissue and paper products; and non-absorbent end applications, including textiles, filtration, construction material, paints and coatings, reinforced plastics, and other applications. The Printing Papers segment produces printing and writing papers, such as uncoated papers for end-use applications comprising brochures, pamphlets, greeting cards, books, annual reports, and direct mail, as well as envelopes, tablets, business forms, and file folders. It sells its uncoated papers under the Hammermill, Springhill, Williamsburg, Postmark, Accent, Great White, Chamex, Ballet, Rey, Pol, and Svetocopy brands. The company sells its products directly to end users and converters, as well as through agents, resellers, and paper distributors. International Paper Company was founded in 1898 and is headquartered in Memphis, Tennessee.",
    "website": "http://www.internationalpaper.com",
    "zipcode": "38197"
  },
  "KRT": {
    "city": "Chino",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaging & Containers",
    "long_name": "Karat Packaging Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Karat Packaging Inc.",
    "state": "CA",
    "summary": "Karat Packaging Inc. manufactures and distributes single-use disposable products in plastic, paper, biopolymer-based and other compostable forms primarily used in restaurants and foodservice areas. It offers food and take-out containers, bags, tableware, cups, lids, cutlery, and straws under the Karat and Karat Earth names. The company offers its products to domestic and regional distributors, restaurant chains, retail establishments, and online customers. It also provides new product development, design, printing, and logistics services. Karat Packaging Inc. was founded in 2000 and is headquartered in Chino, California.",
    "website": "http://www.karatpackaging.com",
    "zipcode": "91708"
  },
  "KSHB": {
    "city": "Cypress",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaging & Containers",
    "long_name": "KushCo Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "KUSHCO HOLDINGS INC",
    "state": "CA",
    "summary": "KushCo Holdings, Inc. markets and sells packaging products, vaporizers, solvents, accessories, and branding solutions to customers operating in the regulated medical and adult recreational cannabis and hemp-derived cannabidiol (CBD) industries in the United States, Canada, and internationally. Its principal products include bottles, jars, bags, tubes, containers, vape cartridges, vape batteries and accessories, labels and processing supplies, solvents, natural products, stainless steel tanks, and custom branded anti-counterfeit and authentication labels. The company also offers hemp trading and retail services. The company sells products to the business-to-business market, which includes brand owners, farmers, growers, processors, producers, distributors, and licensed retailers in states with legal medical and/or adult recreational use cannabis programs and legal CBD programs through its direct sales force and e-commerce website. The company was formerly known as Kush Bottles, Inc. and changed its name to KushCo Holdings, Inc. in September 2018. KushCo Holdings, Inc. was founded in 2010 and is headquartered in Cypress, California.",
    "website": "http://www.kushco.com",
    "zipcode": "90630"
  },
  "MJF.F": {
    "city": "Akron",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "Myers Industries, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MYERS IND. INC.",
    "state": "OH",
    "summary": "Myers Industries, Inc. manufactures and sells polymer products for industrial, agricultural, automotive, commercial, and consumer markets in the United States and internationally. It operates through two segments, Material Handling and Distribution. The Material Handling segment designs, manufactures, and markets various plastic and metal products, including plastic reusable material handling containers and small parts storage bins, plastic recreational vehicle tanks and parts, marine tanks and parts, portable plastic fuel tanks and water containers, portable marine fuel containers, ammunition containers, storage totes, bulk shipping containers, and metal carts and cabinets. It serves industrial manufacturing, food processing, retail/wholesale products distribution, agriculture, automotive, recreational vehicles, marine vehicles, healthcare, appliance, bakery, electronics, textiles, consumer, and other markets under the Buckhorn, Akro-Mils, Jamco, Ameri-Kart, and Scepter brands directly, as well as through distributors. The Distribution segment engages in the distribution of tools, equipment, and supplies for tire, wheel, and undervehicle service on passenger, heavy truck, and off-road vehicles; and manufacture and sale of tire repair materials and custom rubber products, as well as reflective highway marking tapes. This segment serves retail and truck tire dealers, commercial auto and truck fleets, auto dealers, general service and repair centers, tire retreaders, and government agencies. The company was founded in 1933 and is headquartered in Akron, Ohio.",
    "website": "http://www.myersindustries.com",
    "zipcode": "44301"
  },
  "MYE": {
    "city": "Akron",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaging & Containers",
    "long_name": "Myers Industries, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Myers Industries, Inc.",
    "state": "OH",
    "summary": "Myers Industries, Inc. manufactures and sells polymer products for industrial, agricultural, automotive, commercial, and consumer markets in the United States and internationally. It operates through two segments, Material Handling and Distribution. The Material Handling segment designs, manufactures, and markets various plastic and metal products, including plastic reusable material handling containers and small parts storage bins, plastic recreational vehicle tanks and parts, marine tanks and parts, portable plastic fuel tanks and water containers, portable marine fuel containers, ammunition containers, storage totes, bulk shipping containers, and metal carts and cabinets. It serves industrial manufacturing, food processing, retail/wholesale products distribution, agriculture, automotive, recreational vehicles, marine vehicles, healthcare, appliance, bakery, electronics, textiles, consumer, and other markets under the Buckhorn, Akro-Mils, Jamco, Ameri-Kart, and Scepter brands directly, as well as through distributors. The Distribution segment engages in the distribution of tools, equipment, and supplies for tire, wheel, and undervehicle service on passenger, heavy truck, and off-road vehicles; and manufacture and sale of tire repair materials and custom rubber products, as well as reflective highway marking tapes. This segment serves retail and truck tire dealers, commercial auto and truck fleets, auto dealers, general service and repair centers, tire retreaders, and government agencies. The company was founded in 1933 and is headquartered in Akron, Ohio.",
    "website": "http://www.myersindustries.com",
    "zipcode": "44301"
  },
  "OI": {
    "city": "Perrysburg",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaging & Containers",
    "long_name": "O-I Glass, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "O-I Glass, Inc.",
    "state": "OH",
    "summary": "O-I Glass, Inc., through its subsidiaries, manufactures and sells glass containers to food and beverage manufacturers primarily in the Americas, Europe, and the Asia Pacific. The company produces glass containers for alcoholic beverages, including beer, flavored malt beverages, spirits, and wine. It is also involved in the production of glass packaging for various food items, soft drinks, tea, juices, and pharmaceuticals. The company offers glass containers in a range of sizes, shapes, and colors. It sells its products directly to customers under annual or multi-year supply agreements, as well as through distributors. The company was founded in 1903 and is headquartered in Perrysburg, Ohio.",
    "website": "http://www.o-i.com",
    "zipcode": "43551-2999"
  },
  "OI.MX": {
    "city": "Perrysburg",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Packaging & Containers",
    "long_name": "O-I Glass, Inc.",
    "market": "mx_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "O-I GLASS INC",
    "state": "OH",
    "summary": "O-I Glass, Inc., through its subsidiaries, manufactures and sells glass containers to food and beverage manufacturers primarily in the Americas, Europe, and the Asia Pacific. The company produces glass containers for alcoholic beverages, including beer, flavored malt beverages, spirits, and wine. It is also involved in the production of glass packaging for various food items, soft drinks, tea, juices, and pharmaceuticals. The company offers glass containers in a range of sizes, shapes, and colors. It sells its products directly to customers under annual or multi-year supply agreements, as well as through distributors. The company was founded in 1903 and is headquartered in Perrysburg, Ohio.",
    "website": "http://www.o-i.com",
    "zipcode": "43551-2999"
  },
  "P1KG34.SA": {
    "city": "Lake Forest",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Packaging & Containers",
    "long_name": "Packaging Corporation of America",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PACKAGING CODRN",
    "state": "IL",
    "summary": "Packaging Corporation of America manufactures and sells containerboard and corrugated packaging products in the United States. The company operates through Packaging and Paper segments. The Packaging segment offers various containerboard and corrugated packaging products, such as conventional shipping containers used to protect and transport manufactured goods; multi-color boxes and displays that help to merchandise the packaged product in retail locations; and honeycomb protective packaging products, as well as packaging for meat, fresh fruit and vegetables, processed food, beverages, and other industrial and consumer products. This segment sells its corrugated products through a direct sales and marketing organization, independent brokers, and distribution partners. The Paper segment manufactures and sells commodity and specialty papers, as well as communication-based papers, including cut-size office papers, and printing and converting papers. This segment sells white papers through its sales and marketing organization. Packaging Corporation of America was founded in 1867 and is headquartered in Lake Forest, Illinois.",
    "website": "http://www.packagingcorp.com",
    "zipcode": "60045"
  },
  "PACK": {
    "city": "Concord Township",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaging & Containers",
    "long_name": "Ranpak Holdings Corp.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Ranpak Holdings Corp",
    "state": "OH",
    "summary": "Ranpak Holdings Corp., together with its subsidiaries, provide product protection solutions for e-commerce and industrial supply chains in North America, Europe, and Asia. The company manufactures and assembles proprietary protective systems that convert kraft paper into a range of packaging and cushioning products to address its customers' needs. It also offers protective packaging solutions, such as void-fill protective systems that convert paper to fill empty spaces in secondary packages and protect objects; cushioning protective systems, which convert paper into cushioning pads; and wrapping protective systems that create pads or paper mesh to wrap and protect fragile items, as well as to line boxes and provide separation when shipping various objects. The company's products also include line automation solutions, which comprise capital equipment that can size, pad, fill, flap, lid, tape, and/or label the product in an integrated fashion with the speed and flow of the customer's packaging line. It sells its products to end users primarily through a distributor network, and directly to select end users. Ranpak Holdings Corp. was founded in 1972 and is headquartered in Concord Township, Ohio.",
    "website": "http://www.ranpak.com",
    "zipcode": "44077"
  },
  "PEG.F": {
    "city": "Lake Forest",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "Pactiv Evergreen Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PACTIV EVERGREEN  DL-,001",
    "state": "IL",
    "summary": "Pactiv Evergreen Inc. manufactures and distributes fresh foodservice and food merchandising products, and fresh beverage cartons in North America. It operates through three segments: Foodservice, Food Merchandising, and Beverage Merchandising. The Foodservice segment offers food containers, hot and cold cups, lids, dinnerware, and other products. The Food Merchandising segment provides clear rigid-display containers, containers for prepared and ready-to-eat food, trays for meat and poultry, and molded fiber cartons. The Beverage Merchandising segment offers cartons for fresh refrigerated beverage products. This segment also provides integrated fresh carton systems, which include printed cartons with high-impact graphics, spouts, and filling machines, as well as fiber-based liquid packaging board and range of paper-based products. The company serves full-service restaurants, quick service restaurants, foodservice distributors, supermarkets, grocery and healthy eating retailers, other food stores, food and beverage producers, and food packers and food processors. The company was formerly known as Reynolds Group Holdings Limited. Pactiv Evergreen Inc. was founded in 1880 and is headquartered in Lake Forest, Illinois. Pactiv Evergreen Inc. is a subsidiary of Packaging Finance Limited.",
    "website": "http://www.pactivevergreen.com",
    "zipcode": "60045"
  },
  "PEG.MU": {
    "city": "Lake Forest",
    "country": "United States",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Packaging & Containers",
    "long_name": "Pactiv Evergreen Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PACTIV EVERGREEN  DL-,001",
    "state": "IL",
    "summary": "Pactiv Evergreen Inc. manufactures and distributes fresh foodservice and food merchandising products, and fresh beverage cartons in North America. It operates through three segments: Foodservice, Food Merchandising, and Beverage Merchandising. The Foodservice segment offers food containers, hot and cold cups, lids, dinnerware, and other products. The Food Merchandising segment provides clear rigid-display containers, containers for prepared and ready-to-eat food, trays for meat and poultry, and molded fiber cartons. The Beverage Merchandising segment offers cartons for fresh refrigerated beverage products. This segment also provides integrated fresh carton systems, which include printed cartons with high-impact graphics, spouts, and filling machines, as well as fiber-based liquid packaging board and range of paper-based products. The company serves full-service restaurants, quick service restaurants, foodservice distributors, supermarkets, grocery and healthy eating retailers, other food stores, food and beverage producers, and food packers and food processors. The company was formerly known as Reynolds Group Holdings Limited. Pactiv Evergreen Inc. was founded in 1880 and is headquartered in Lake Forest, Illinois. Pactiv Evergreen Inc. is a subsidiary of Packaging Finance Limited.",
    "website": "http://www.pactivevergreen.com",
    "zipcode": "60045"
  },
  "PKA.F": {
    "city": "Lake Forest",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "Packaging Corporation of America",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PACKAGING CORP. OF AMER.",
    "state": "IL",
    "summary": "Packaging Corporation of America manufactures and sells containerboard and corrugated packaging products in the United States. The company operates through Packaging and Paper segments. The Packaging segment offers various containerboard and corrugated packaging products, such as conventional shipping containers used to protect and transport manufactured goods; multi-color boxes and displays that help to merchandise the packaged product in retail locations; and honeycomb protective packaging products, as well as packaging for meat, fresh fruit and vegetables, processed food, beverages, and other industrial and consumer products. This segment sells its corrugated products through a direct sales and marketing organization, independent brokers, and distribution partners. The Paper segment manufactures and sells commodity and specialty papers, as well as communication-based papers, including cut-size office papers, and printing and converting papers. This segment sells white papers through its sales and marketing organization. Packaging Corporation of America was founded in 1867 and is headquartered in Lake Forest, Illinois.",
    "website": "http://www.packagingcorp.com",
    "zipcode": "60045"
  },
  "PKG": {
    "city": "Lake Forest",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaging & Containers",
    "long_name": "Packaging Corporation of America",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Packaging Corporation of Americ",
    "state": "IL",
    "summary": "Packaging Corporation of America manufactures and sells containerboard and corrugated packaging products in the United States. The company operates through Packaging and Paper segments. The Packaging segment offers various containerboard and corrugated packaging products, such as conventional shipping containers used to protect and transport manufactured goods; multi-color boxes and displays that help to merchandise the packaged product in retail locations; and honeycomb protective packaging products, as well as packaging for meat, fresh fruit and vegetables, processed food, beverages, and other industrial and consumer products. This segment sells its corrugated products through a direct sales and marketing organization, independent brokers, and distribution partners. The Paper segment manufactures and sells commodity and specialty papers, as well as communication-based papers, including cut-size office papers, and printing and converting papers. This segment sells white papers through its sales and marketing organization. Packaging Corporation of America was founded in 1867 and is headquartered in Lake Forest, Illinois.",
    "website": "http://www.packagingcorp.com",
    "zipcode": "60045"
  },
  "PTVE": {
    "city": "Lake Forest",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaging & Containers",
    "long_name": "Pactiv Evergreen Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Pactiv Evergreen Inc.",
    "state": "IL",
    "summary": "Pactiv Evergreen Inc. manufactures and distributes fresh foodservice and food merchandising products, and fresh beverage cartons in North America. It operates through three segments: Foodservice, Food Merchandising, and Beverage Merchandising. The Foodservice segment offers food containers, hot and cold cups, lids, dinnerware, and other products. The Food Merchandising segment provides clear rigid-display containers, containers for prepared and ready-to-eat food, trays for meat and poultry, and molded fiber cartons. The Beverage Merchandising segment offers cartons for fresh refrigerated beverage products. This segment also provides integrated fresh carton systems, which include printed cartons with high-impact graphics, spouts, and filling machines, as well as fiber-based liquid packaging board and range of paper-based products. The company serves full-service restaurants, quick service restaurants, foodservice distributors, supermarkets, grocery and healthy eating retailers, other food stores, food and beverage producers, and food packers and food processors. The company was formerly known as Reynolds Group Holdings Limited. Pactiv Evergreen Inc. was founded in 1880 and is headquartered in Lake Forest, Illinois. Pactiv Evergreen Inc. is a subsidiary of Packaging Finance Limited.",
    "website": "http://www.pactivevergreen.com",
    "zipcode": "60045"
  },
  "RDVA": {
    "city": "Radford",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaging & Containers",
    "long_name": "RDVA, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "RDVA INC",
    "state": "VA",
    "summary": "RDVA, Inc. designs and manufactures foam packaging and products in the United States. The company offers various custom protective packaging products; packaging products, including corner pads, edge pads, and specialty items; standard and specialty insulated containers; and specialty components and shapes. Its products are used in various industries, which include high technology, agriculture, telecommunications, consumer electronics, automotive, appliances, building products, military, textile, furniture, pharmaceuticals, agriculture, medical, perishable foods, wine and beer, food and beverage, and manufacturing industries. RDVA, Inc. was founded in 1962 and is based in Radford, Virginia.",
    "website": "http://www.radva.com",
    "zipcode": "24143"
  },
  "REYN": {
    "city": "Lake Forest",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaging & Containers",
    "long_name": "Reynolds Consumer Products Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Reynolds Consumer Products Inc.",
    "state": "IL",
    "summary": "Reynolds Consumer Products Inc. produces and sells products in cooking, waste and storage, and tableware product categories in the United States and internationally. It operates through four segments: Reynolds Cooking & Baking, Hefty Waste & Storage, Hefty Tableware, and Presto Products. The Reynolds Cooking & Baking segment produces foil, disposable aluminum pans, parchment paper, freezer paper, wax paper, plastic wrap, baking cups, oven bags, and slow cooker liners under the Reynolds Wrap, Reynolds KITCHENS, and E-Z Foil brands in the United States, as well as under the ALCAN brand in Canada and under the Diamond brand internationally. The Hefty Waste & Storage segment sells trash and food storage bags under the Hefty Ultra Strong, Hefty Strong Trash Bags, Hefty Renew, and Hefty Slider Bags brands. It offers a suite of indoor and outdoor trash bags and contractor bags, including blue and clear recycling bags, compostable bags, bags made from recycled materials, and the Hefty EnergyBag Program. The Hefty Tableware segment provides disposable and compostable plates, bowls, platters, cups, and cutlery under the Hefty brand. The Presto Products segment primarily sells store brand products in food storage bags, trash bags, reusable storage containers, and plastic wrap categories. Reynolds Consumer Products Inc. offers both branded and store brand products to grocery stores, mass merchants, warehouse clubs, discount chains, dollar stores, drug stores, home improvement stores, military outlets, and eCommerce retailers. The company was founded in 1947 and is headquartered in Lake Forest, Illinois. Reynolds Consumer Products Inc. is a subsidiary of Packaging Finance Limited.",
    "website": "http://www.reynoldsconsumerproducts.com",
    "zipcode": "60045"
  },
  "S1EA34.SA": {
    "city": "Charlotte",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Packaging & Containers",
    "long_name": "Sealed Air Corporation",
    "market": "br_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SEALED AIR CDRN",
    "state": "NC",
    "summary": "Sealed Air Corporation provides food safety and security, and product protection solutions and equipment in North America, South America, Europe, the Middle East, Africa, and the Asia Pacific. It operates in two segments, Food and Protective. The Food segment offers integrated packaging materials and automation equipment solutions to provide food safety and shelf life extension, automate processes, and optimize total cost for perishable food processors in the fresh red meat, smoked and processed meats, poultry, seafood, plant-based, and dairy markets under the Cryovac, Cryovac Grip & Tear, Cryovac Darfresh, Cryovac Mirabella, Simple Steps, and Optidure brands. This segment sells its solutions directly to customers through its sales, marketing, and customer service personnel. The Protective segment provides foam, corrugated, molded pulp, and wood packaging solutions to protect goods in shipping for the e-commerce, consumer goods, pharmaceutical and medical devices, and industrial manufacturing markets under the Bubble Wrap, Autobag, Sealed Air, Instapak, Korrvu, Kevothermal, and TempGuard brands. This segment sells its solutions through supply distributors, as well as directly to fabricators, original equipment manufacturers, contract manufacturers, third-party logistics partners, e-commerce/fulfillment operations, and retail centers. Sealed Air Corporation was founded in 1960 and is headquartered in Charlotte, North Carolina.",
    "website": "http://www.sealedair.com",
    "zipcode": "28208"
  },
  "SDA.F": {
    "city": "Charlotte",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "Sealed Air Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SEALED AIR CORP.  DL-,10",
    "state": "NC",
    "summary": "Sealed Air Corporation provides food safety and security, and product protection solutions and equipment in North America, South America, Europe, the Middle East, Africa, and the Asia Pacific. It operates in two segments, Food and Protective. The Food segment offers integrated packaging materials and automation equipment solutions to provide food safety and shelf life extension, automate processes, and optimize total cost for perishable food processors in the fresh red meat, smoked and processed meats, poultry, seafood, plant-based, and dairy markets under the Cryovac, Cryovac Grip & Tear, Cryovac Darfresh, Cryovac Mirabella, Simple Steps, and Optidure brands. This segment sells its solutions directly to customers through its sales, marketing, and customer service personnel. The Protective segment provides foam, corrugated, molded pulp, and wood packaging solutions to protect goods in shipping for the e-commerce, consumer goods, pharmaceutical and medical devices, and industrial manufacturing markets under the Bubble Wrap, Autobag, Sealed Air, Instapak, Korrvu, Kevothermal, and TempGuard brands. This segment sells its solutions through supply distributors, as well as directly to fabricators, original equipment manufacturers, contract manufacturers, third-party logistics partners, e-commerce/fulfillment operations, and retail centers. Sealed Air Corporation was founded in 1960 and is headquartered in Charlotte, North Carolina.",
    "website": "http://www.sealedair.com",
    "zipcode": "28208"
  },
  "SEE": {
    "city": "Charlotte",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaging & Containers",
    "long_name": "Sealed Air Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Sealed Air Corporation",
    "state": "NC",
    "summary": "Sealed Air Corporation provides food safety and security, and product protection solutions and equipment in North America, South America, Europe, the Middle East, Africa, and the Asia Pacific. It operates in two segments, Food and Protective. The Food segment offers integrated packaging materials and automation equipment solutions to provide food safety and shelf life extension, automate processes, and optimize total cost for perishable food processors in the fresh red meat, smoked and processed meats, poultry, seafood, plant-based, and dairy markets under the Cryovac, Cryovac Grip & Tear, Cryovac Darfresh, Cryovac Mirabella, Simple Steps, and Optidure brands. This segment sells its solutions directly to customers through its sales, marketing, and customer service personnel. The Protective segment provides foam, corrugated, molded pulp, and wood packaging solutions to protect goods in shipping for the e-commerce, consumer goods, pharmaceutical and medical devices, and industrial manufacturing markets under the Bubble Wrap, Autobag, Sealed Air, Instapak, Korrvu, Kevothermal, and TempGuard brands. This segment sells its solutions through supply distributors, as well as directly to fabricators, original equipment manufacturers, contract manufacturers, third-party logistics partners, e-commerce/fulfillment operations, and retail centers. Sealed Air Corporation was founded in 1960 and is headquartered in Charlotte, North Carolina.",
    "website": "http://www.sealedair.com",
    "zipcode": "28208"
  },
  "SL3.F": {
    "city": "Stamford",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "Silgan Holdings Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SILGAN HLDGS INC.  DL-,01",
    "state": "CT",
    "summary": "Silgan Holdings Inc., together with its subsidiaries, manufactures and sells rigid packaging for consumer goods products in North America, Europe, and internationally. It operates through three segments: Metal Containers, Closures, and Plastic Containers. The Metal Containers segment manufactures and sells steel and aluminum containers for food products, such as pet food, vegetables, soups, proteins, tomato based products, adult nutritional drinks, fruits, and other miscellaneous food products, as well as general line metal containers primarily for chemicals. The Closures segment offers a range of metal and plastic closures, and dispensing systems for use in food, beverage, health care, garden, home, personal care, and beauty products, as well as capping/sealing equipment and detection systems. The Plastic Containers segment manufactures and sells custom designed and stock plastic containers for use in personal care and health care; food and beverage; household and industrial chemical; pharmaceutical; pet food and care; agricultural; automotive; and marine chemical products. This segment also provides plastic thermoformed barrier and non-barrier bowls, and trays for food products, such as soups, other ready-to-eat meals, and pet food products; and plastic closures, caps, sifters, and fitments, as well as thermoformed plastic tubs for food, household, and personal care products, including soft fabric wipes. The company markets its products primarily through direct sales force, as well as through a network of distributors and an online shopping catalog. Silgan Holdings Inc. was founded in 1987 and is headquartered in Stamford, Connecticut.",
    "website": "http://www.silganholdings.com",
    "zipcode": "06901"
  },
  "SLGN": {
    "city": "Stamford",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaging & Containers",
    "long_name": "Silgan Holdings Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Silgan Holdings Inc.",
    "state": "CT",
    "summary": "Silgan Holdings Inc., together with its subsidiaries, manufactures and sells rigid packaging for consumer goods products in North America, Europe, and internationally. It operates through three segments: Metal Containers, Closures, and Plastic Containers. The Metal Containers segment manufactures and sells steel and aluminum containers for food products, such as pet food, vegetables, soups, proteins, tomato based products, adult nutritional drinks, fruits, and other miscellaneous food products, as well as general line metal containers primarily for chemicals. The Closures segment offers a range of metal and plastic closures, and dispensing systems for use in food, beverage, health care, garden, home, personal care, and beauty products, as well as capping/sealing equipment and detection systems. The Plastic Containers segment manufactures and sells custom designed and stock plastic containers for use in personal care and health care; food and beverage; household and industrial chemical; pharmaceutical; pet food and care; agricultural; automotive; and marine chemical products. This segment also provides plastic thermoformed barrier and non-barrier bowls, and trays for food products, such as soups, other ready-to-eat meals, and pet food products; and plastic closures, caps, sifters, and fitments, as well as thermoformed plastic tubs for food, household, and personal care products, including soft fabric wipes. The company markets its products primarily through direct sales force, as well as through a network of distributors and an online shopping catalog. Silgan Holdings Inc. was founded in 1987 and is headquartered in Stamford, Connecticut.",
    "website": "http://www.silganholdings.com",
    "zipcode": "06901"
  },
  "SNS.F": {
    "city": "Hartsville",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "Sonoco Products Company",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SONOCO PROD. CO.",
    "state": "SC",
    "summary": "Sonoco Products Company manufactures and sells industrial and consumer packaging products in North and South America, Europe, Australia, and Asia. The company operates through four segments: Consumer Packaging, Display and Packaging, Paper and Industrial Converted Products, and Protective Solutions. The Consumer Packaging segment provides paper and thermoformed plastic round and shaped rigid containers and trays; extruded and injection-molded plastic products; printed flexible packaging products; brand artwork management; and metal and peelable membrane ends and closures. The Display and Packaging segment offers temporary and semi-permanent point-of-purchase displays; supply chain management services comprising contract packing, fulfillment, and scalable service centers; retail packaging, including printed backer cards, thermoformed blisters, and heat sealing equipment; and paper amenities, such as coasters and glass covers. The Paper and Industrial Converted Products segment provides paperboard tubes, cones, and cores; fiber-based construction tubes; wooden, metal, and composite wire and cable reels and spools; and recycled paperboard, corrugating medium, recovered paper, and material recycling services. The Protective Solutions segment provides custom-engineered, paperboard-based, and molded foam protective packaging and components; and temperature-assured packaging products. The company sells its products in various markets, which include paper, textile, film, food, chemical, packaging, construction, and wire and cable. Sonoco Products Company was founded in 1899 and is headquartered in Hartsville, South Carolina.",
    "website": "http://www.sonoco.com",
    "zipcode": "29550"
  },
  "SON": {
    "city": "Hartsville",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaging & Containers",
    "long_name": "Sonoco Products Company",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Sonoco Products Company",
    "state": "SC",
    "summary": "Sonoco Products Company manufactures and sells industrial and consumer packaging products in North and South America, Europe, Australia, and Asia. The company operates through four segments: Consumer Packaging, Display and Packaging, Paper and Industrial Converted Products, and Protective Solutions. The Consumer Packaging segment provides paper and thermoformed plastic round and shaped rigid containers and trays; extruded and injection-molded plastic products; printed flexible packaging products; brand artwork management; and metal and peelable membrane ends and closures. The Display and Packaging segment offers temporary and semi-permanent point-of-purchase displays; supply chain management services comprising contract packing, fulfillment, and scalable service centers; retail packaging, including printed backer cards, thermoformed blisters, and heat sealing equipment; and paper amenities, such as coasters and glass covers. The Paper and Industrial Converted Products segment provides paperboard tubes, cones, and cores; fiber-based construction tubes; wooden, metal, and composite wire and cable reels and spools; and recycled paperboard, corrugating medium, recovered paper, and material recycling services. The Protective Solutions segment provides custom-engineered, paperboard-based, and molded foam protective packaging and components; and temperature-assured packaging products. The company sells its products in various markets, which include paper, textile, film, food, chemical, packaging, construction, and wire and cable. Sonoco Products Company was founded in 1899 and is headquartered in Hartsville, South Carolina.",
    "website": "http://www.sonoco.com",
    "zipcode": "29550"
  },
  "TUP": {
    "city": "Orlando",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaging & Containers",
    "long_name": "Tupperware Brands Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Tupperware Brands Corporation",
    "state": "FL",
    "summary": "Tupperware Brands Corporation operates as a consumer products company worldwide. The company manufactures, markets, and sells design-centric preparation, storage, and serving solutions for the kitchen and home, as well as a line of cookware, knives, microwave products, microfiber textiles, water-filtration related items, and an array of products for on-the-go consumers under the Tupperware brand name. It also manufactures and distributes beauty and personal care products, skin care, cosmetics, toiletries, fragrances, and nutritional products under the Fuller, NaturCare, Nutrimetics, and Nuvo brands. The company distributes its products to approximately 80 countries primarily through independent sales force members, including independent distributors, directors, managers, and dealers. The company was formerly known as Tupperware Corporation and changed its name to Tupperware Brands Corporation in December 2005. Tupperware Brands Corporation was founded in 1946 and is headquartered in Orlando, Florida.",
    "website": "http://www.tupperwarebrands.com",
    "zipcode": "32837"
  },
  "TUP.F": {
    "city": "Orlando",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "Tupperware Brands Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "TUPPERW.BRAND.CORP.DL-,01",
    "state": "FL",
    "summary": "Tupperware Brands Corporation operates as a consumer products company worldwide. The company manufactures, markets, and sells design-centric preparation, storage, and serving solutions for the kitchen and home, as well as a line of cookware, knives, microwave products, microfiber textiles, water-filtration related items, and an array of products for on-the-go consumers under the Tupperware brand name. It also manufactures and distributes beauty and personal care products, skin care, cosmetics, toiletries, fragrances, and nutritional products under the Fuller, NaturCare, Nutrimetics, and Nuvo brands. The company distributes its products to approximately 80 countries primarily through independent sales force members, including independent distributors, directors, managers, and dealers. The company was formerly known as Tupperware Corporation and changed its name to Tupperware Brands Corporation in December 2005. Tupperware Brands Corporation was founded in 1946 and is headquartered in Orlando, Florida.",
    "website": "http://www.tupperwarebrands.com",
    "zipcode": "32837"
  },
  "TZPC": {
    "city": "Theodore",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaging & Containers",
    "long_name": "ThermaFreeze Products Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "THERMAFREEZE PRODUCTS CORPORATI",
    "state": "AL",
    "summary": "ThermaFreeze Products Corporation manufactures and distributes hydratable ice sheets. The company offers ThermaFreeze, a reusable ice solution for various applications. It also provides industrial gel pack rolls, 1 ounce cubes, 4 ounce cubes, Therma-wraps and accessories, and retail packaged products. The company offers its products for perishable shipping, sports therapy, personal use, outdoors, medical, and equestrian applications. ThermaFreeze Products Corporation was founded in 1968 and is based in Theodore, Alabama.",
    "website": "http://www.thermafreeze.com",
    "zipcode": "36582"
  },
  "UFPT": {
    "city": "Newburyport",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaging & Containers",
    "long_name": "UFP Technologies, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "UFP Technologies, Inc.",
    "state": "MA",
    "summary": "UFP Technologies, Inc. designs and converts foams, films, and plastics materials for the medical, automotive, consumer, electronics, industrial, and aerospace and defense markets in the United States. It offers single patient use surfaces, advanced wound care, infection prevention, and disposables for surgical procedures, endoscopic procedures, orthopedic implants, orthopedic appliances, biopharma drug manufacturing, etc.; molded components for automotive, aerospace, and defense markets; recycled protective packaging for B2C brands; and reusable cases and custom inserts. The company markets and sells its products through direct sales forces and independent manufacturer representatives. UFP Technologies, Inc. was founded in 1963 and is headquartered in Newburyport, Massachusetts.",
    "website": "http://www.ufpt.com",
    "zipcode": "01950-3504"
  },
  "VKSC": {
    "city": "Lombard",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaging & Containers",
    "long_name": "Viskase Companies, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "VISKASE COMPANIES INC",
    "state": "IL",
    "summary": "Viskase Companies, Inc., together with its subsidiaries, produces and sells nonedible cellulosic, fibrous, and plastic casings for preparing and packaging processed meat products in North America, South America, Europe, Asia, and internationally. The company offers NOJAX cellulose casings for use in the automated production of hot dogs, dry mini salamis, cooked sausages, and coarse ground fresh sausages; and large cellulose casings for giving cylindrical or oval shape to the processed meats that are used in bologna, mortadella, deli ham, bierwurst, and dry sausages. It also provides fibrous casings for use in a range of applications, including pepperoni, salami, luncheon meats, boneless hams, and other deli-style processed meats, as well as for processed and smoked cheeses; color transfer casings for a range of natural and synthetic shades; flavor transfer casings for taste profiles; smoke transfer casings for processed meat or cheese products; and spice transfer casings for processing facility. In addition, the company offers POLYJAX casings for the production of hot dog, sausage, chorizo products, and meat snack sticks; VISCOAT casings for a range of applications, including turkey, ham, and roast beef products; VISMOKE casings for cooked and smoked meat products, semi-dry sausages, and spreadable dry sausages; and VISLON for meat, poultry, and cheese applications. Further, it provides VISFLEX casings for a range of meat, poultry and cheese applications; and VISMAX casings for molded and formed processed meat and poultry applications. Additionally, the company offers MEMBRA-CEL, a hydrophilic material made from regenerated cellulose for use in dialysis purposes in the laboratory. The company was founded in 1925 and is based in Lombard, Illinois. Viskase Companies, Inc. is a subsidiary of Icahn Enterprises L.P.",
    "website": "http://www.viskase.com",
    "zipcode": "60148"
  },
  "W1RK34.SA": {
    "city": "Atlanta",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Packaging & Containers",
    "long_name": "WestRock Company",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "WESTROCK CO DRN",
    "state": "GA",
    "summary": "WestRock Company manufactures and sells paper and packaging solutions in North America, South America, Europe, Asia, and Australia. The company operates through Corrugated Packaging and Consumer Packaging segments. The Corrugated Packaging segment produces containerboards, corrugated sheets, corrugated packaging, and preprinted linerboards for sale to consumer and industrial products manufacturers, and corrugated box manufacturers. It also provides structural and graphic design, engineering services and custom, and automated packaging machines; offers a machinery solution that creates pouches to replace single-use plastics, including bubble mailers; distributes corrugated packaging materials and other specialty packaging products, including stretch films, void fills, carton sealing tapes, and other specialty tapes; operates recycling facilities that collect, sort, grade, and bale recovered paper; and provides lithographic laminated packaging products, as well as contract packing services. The Consumer Packaging segment manufactures and sells folding cartons that are used to package food, paper, beverages, dairy products, tobacco, confectionery, health and beauty, other household consumer, and commercial and industrial products; and express mail packages for the overnight courier industry. It also offers inserts and labels, as well as rigid packaging and other printed packaging products, such as transaction cards, brochures, product literature, marketing materials, and grower tags and plant stakes for the horticultural market; and secondary packages and paperboard packaging for over-the-counter and prescription drugs. In addition, this segment manufactures and sells solid fiber and corrugated partitions, and die-cut paperboard components principally to glass container manufacturers, producers of beer, food, wine, spirits, cosmetics and pharmaceuticals, and the automotive industry. WestRock Company is based in Atlanta, Georgia.",
    "website": "http://www.westrock.com",
    "zipcode": "30328"
  },
  "WRK": {
    "city": "Atlanta",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaging & Containers",
    "long_name": "WestRock Company",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Westrock Company",
    "state": "GA",
    "summary": "WestRock Company manufactures and sells paper and packaging solutions in North America, South America, Europe, Asia, and Australia. The company operates through Corrugated Packaging and Consumer Packaging segments. The Corrugated Packaging segment produces containerboards, corrugated sheets, corrugated packaging, and preprinted linerboards for sale to consumer and industrial products manufacturers, and corrugated box manufacturers. It also provides structural and graphic design, engineering services and custom, and automated packaging machines; offers a machinery solution that creates pouches to replace single-use plastics, including bubble mailers; distributes corrugated packaging materials and other specialty packaging products, including stretch films, void fills, carton sealing tapes, and other specialty tapes; operates recycling facilities that collect, sort, grade, and bale recovered paper; and provides lithographic laminated packaging products, as well as contract packing services. The Consumer Packaging segment manufactures and sells folding cartons that are used to package food, paper, beverages, dairy products, tobacco, confectionery, health and beauty, other household consumer, and commercial and industrial products; and express mail packages for the overnight courier industry. It also offers inserts and labels, as well as rigid packaging and other printed packaging products, such as transaction cards, brochures, product literature, marketing materials, and grower tags and plant stakes for the horticultural market; and secondary packages and paperboard packaging for over-the-counter and prescription drugs. In addition, this segment manufactures and sells solid fiber and corrugated partitions, and die-cut paperboard components principally to glass container manufacturers, producers of beer, food, wine, spirits, cosmetics and pharmaceuticals, and the automotive industry. WestRock Company is based in Atlanta, Georgia.",
    "website": "http://www.westrock.com",
    "zipcode": "30328"
  }
}
