{
    "AUG1L.VS": {
        "short_name": "AUGA group",
        "long_name": "Auga Group AB",
        "summary": "Auga Group AB, together with its subsidiaries, operates an organic food production company in Lithuania. It operates through Crop-Growing, Mushroom Growing, Dairy, and End-Consumer Packaged Goods segments. The company is involved in the mushroom growing; organic milk production, and cattle raising and sale activities; and growing of various crops such as organic wheat, legumes, rapeseed, sugar beets, oat, and barley as well as other crops, including grasses and corn for feed. It also offers ready-to-eat soups, preserved mushrooms, packaged vegetables, bottled milk, milk-shakes, eggs, poultry, flour, and other products. The company provides human resource management, trade and logistics, IT system development, machinery leasing, land rental, and agricultural services. The company manages approximately 39,000 hectares of organically certified arable land, as well as uses proprietary and contracted manufacturing to produce a range of organic food products for the end consumer, as well as organic commodities purchasers. It also exports its products to Scandinavian and Baltic countries, Poland, Germany, and France, as well as in the United States, the United Arab Emirates, and Japan. The company was founded in 2003 and is headquartered in Vilnius, Lithuania. Auga Group AB is a subsidiary of Baltic Champs Group, UAB.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "08130",
        "website": "http://www.auga.lt",
        "market_cap": 118256312
    },
    "LNA1L.VS": {
        "short_name": "Linas Agro Group",
        "long_name": "AB Linas Agro Group",
        "summary": "AB Linas Agro Group, through its subsidiaries, engages in the production, handling, and merchandise of agricultural and food products in Lithuania, Scandinavian, rest of Europe, Africa, Asia, and CIS countries. The company operates through five segments: Grain and Feedstuff Handling and Merchandising; Products and Services for Farming; Agricultural Production; Food Products; and Other Products and Services. The Grain and Feedstuff Handling and Merchandising segment trades in wheat, rapeseed, barley, and other grains; oilseeds; suncake and sunmeal; and sugar beet pulp, soymeal, vegetable oils, rapecake, and other feedstuffs, as well as provides grain storage and logistics services. The Products and Services for Farming segment sells fertilizers, seeds, plant protection products, agricultural machinery and equipment, spare parts, and other equipment, as well as offers grain storage facilities to agricultural produce growers and grain storage companies. The Agricultural Production segment cultivates cereals, oilseed rape, sugar beet, and other crops; harvests, breeds, and sells livestock; and produces and sells milk, as well as engages in the beef cattle farming business. The Food Products segment is involved in the egg incubation, chicken hatching, broiler breeding, production of poultry and processed products, and slaughtering and sale of chicken. This segment offers its products under the Kekava and Bauska brand names. The Other Products and Services segment sells biofuels and other products and services. The company also rents and manages agricultural purposes land; and provides expedition and ship's agency, and management services. The company was founded in 1991 and is based in PaneveÂ\u009eys, Lithuania. AB Linas Agro Group is a subsidiary of Akola ApS.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "state": null,
        "city": "PaneveÅ¾ys",
        "zipcode": "35143",
        "website": "http://www.linasagrogroup.lt",
        "market_cap": 128434040
    },
    "W9Z.SG": {
        "short_name": "Auga Group AB Registered Shares",
        "long_name": "Auga Group AB",
        "summary": "Auga Group AB, together with its subsidiaries, operates an organic food production company in Lithuania. It operates through Crop-Growing, Mushroom Growing, Dairy, and End-Consumer Packaged Goods segments. The company is involved in the mushroom growing; organic milk production, and cattle raising and sale activities; and growing of various crops such as organic wheat, legumes, rapeseed, sugar beets, oat, and barley as well as other crops, including grasses and corn for feed. It also offers ready-to-eat soups, preserved mushrooms, packaged vegetables, bottled milk, milk-shakes, eggs, poultry, flour, and other products. The company provides human resource management, trade and logistics, IT system development, machinery leasing, land rental, and agricultural services. The company manages approximately 39,000 hectares of organically certified arable land, as well as uses proprietary and contracted manufacturing to produce a range of organic food products for the end consumer, as well as organic commodities purchasers. It also exports its products to Scandinavian and Baltic countries, Poland, Germany, and France, as well as in the United States, the United Arab Emirates, and Japan. The company was founded in 2003 and is headquartered in Vilnius, Lithuania. Auga Group AB is a subsidiary of Baltic Champs Group, UAB.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Lithuania",
        "state": null,
        "city": "Vilnius",
        "zipcode": "08130",
        "website": "http://www.auga.lt",
        "market_cap": 119671456
    }
}