{
    "PUBN.MX": {
        "short_name": "PUBLICIS GROUPE SA",
        "long_name": "Publicis Groupe S.A.",
        "summary": "Publicis Groupe S.A. provides marketing, communication, and digital transformation services in North America, Europe, Asia Pacific, Latin America, Africa, and the Middle East. The company operates as advertising agencies that offer billboard, television, radio, and press advertising services, as well as advertising solutions through digital channels under the Publicis Worldwide, Saatchi & Saatchi, Leo Burnett, Marcel, Fallon, and BBH brands; and provides crisis communications, media relations, public affairs, financial communications, and strategy and event management services, as well as digital marketing services. It also engages in the conception and supply of brand content for television, print media, radio, cinema, billboards, display, social networks, online video, etc.; and provision of media consulting, planning, and buying services. In addition, the company operates Publicis Sapient, a technological, digital, and consulting platform for automotive, consumer products, energy and raw materials, retail, financial services, healthcare, media-telecoms, and travel and hospitality sectors. Further, it provides healthcare communication services under the Digitas Health and Publicis Health Media brands for the healthcare and well-being sectors. The company serves clients in the non-food consumer products, finance, automobile, TMT, healthcare, food and beverage, leisure/energy/luxury, retail, and other sectors. Publicis Groupe S.A. was founded in 1926 and is headquartered in Paris, France.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Advertising Agencies",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75008",
        "website": "http://www.publicisgroupe.com",
        "full_time_employees": 74229
    }
}