{
  "CENTR.AT": {
    "city": "Moschato",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "Gaming Activities",
    "long_name": "Centric Holdings S.A.",
    "market": "gr_market",
    "market_cap": "Nano Cap",
    "sector": "Services",
    "short_name": "CENTRIC HOLDINGS S.A.",
    "state": null,
    "summary": "Centric Holdings S.A. provides on-board entertainment services on vessels, hotels, and yachts. It also offers mass catering and tourist accommodation services, as well as technology services at sea. In addition, the company engages in renewable energy and commercial real estate business. Centric Holdings S.A. was founded in 1995 and is headquartered in Moschato, Greece.",
    "website": "http://www.centric.gr",
    "zipcode": "18344"
  },
  "INLOT.AT": {
    "city": "Athens",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "Gaming Activities",
    "long_name": "Intralot S.A. Integrated Lottery Systems and Services",
    "market": "gr_market",
    "market_cap": "Nano Cap",
    "sector": "Services",
    "short_name": "INTRALOT S.A. (CR)",
    "state": null,
    "summary": "Intralot S.A. Integrated Lottery Systems and Services supplies integrated gaming and transaction processing systems, game content, sports betting management, and interactive gaming services to state-licensed gaming organizations worldwide. The company supplies hardware and software, including gaming machines, central computer systems, gaming software, communication systems, etc., as well as offers installation, technical support, and maintenance services to lotteries. It is also involved in the design, organization, and/or management of games; advertising and sales promotion activities; establishment of sales network; and provision of risk management for fixed odds games, etc., as well as game operating services. The company was founded in 1992 and is headquartered in Athens, Greece.",
    "website": "http://www.intralot.com",
    "zipcode": "151 25"
  },
  "OPAP.AT": {
    "city": "Athens",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "Gaming Activities",
    "long_name": "Greek Organization of Football Prognostics S.A.",
    "market": "gr_market",
    "market_cap": "Mid Cap",
    "sector": "Services",
    "short_name": "OPAP S.A. (CR)",
    "state": null,
    "summary": "Greek Organization of Football Prognostics S.A., together with its subsidiaries, operates and manages numerical lottery and sports betting games. It operates through Lotteries, Sports Betting, Instant & Passives, VLTs, Telecommunication & eMoney Services, and Other segments. The company holds rights to conduct, manage, organize, and operate six numerical lottery games comprising TZOKER, LOTTO, PROTO, EXTRA 5, SUPER 3, and KINO; three sports and other betting games, such as PAME STOIXIMA, PAME STOIXIMA Virtual Sports, PROPO, PROPOGOAL, and HORSE RACING STOIXIMA; three lottery games, including LAIKO, ETHNIKO, and STATE; and Instant SCRATCH games. It also holds license for the instalment and operation of 35,000 video lottery terminals. In addition, the company provides transaction services through electronic means; and intangible talk time selling and bill payments services. Further, it organizes and conducts terrestrial, land-based, and online horseracing mutual betting; and provides software services. The company offers its products and services through online and distribution networks, including agents, street vendors, retailers, wholesalers, and 9,468 points of sales in Greece; 428 play stores; and 199 stores in Cyprus. Greek Organisation of Football Prognostics S.A. was founded in 1958 and is based in Athens, Greece.",
    "website": "http://www.opap.gr",
    "zipcode": "104 42"
  }
}
