{"GEBKA.AT": {"short_name": "GEN.COMMERCIAL & IND (CR)", "long_name": "General Commercial & Industrial S.A.", "summary": "General Commercial & Industrial S.A. supplies industrial and hydraulic equipment in Greece and East European countries. It trades in ready-made clothing, underwear, and linen and children's items. The company is also involved in producing, marketing, and supplying energy from renewable energy sources and conventional fuels for domestic, industrial, and other uses. It serves customers in construction, industrial, shipping, and oil industries. The company was founded in 1966 and is based in Aspropyrgos, Greece.", "currency": "EUR", "sector": "Services", "industry": "Industrial Equipment Wholesale", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Aspropyrgos"}, "RME.TO": {"short_name": "ROCKY MOUNTAIN DEALERSHIPS INC.", "long_name": "Rocky Mountain Equipment Alberta Ltd", "summary": "Rocky Mountain Dealerships Inc., through its subsidiaries, sells, rents, leases, and provides support services for new and used agriculture and industrial equipment. The company provides tractors, planters, air drills and carts, sprayers, floaters, liquid nutrient applicators, balers, combines and combine heads, tillage, loaders and attachments, mowers and conditioners, and windrowers, as well as used equipment and replacement parts for agriculture and construction applications. It also offers third-party equipment financing and insurance services; and in-branch and mobile/on-site repair and maintenance services, as well as provides or arranges other ancillary offerings, such as GPS signal subscriptions. The company offers products of various brands, such as Case IH Agriculture, Case Construction, New Holland, Bourgault, Seed Hawk, MacDon, and Claas through its store and online. As of March 10, 2020, it operated a dealership network of 37 branches under the Rocky Mountain Equipment and RME Deal Zone USA trade names in Alberta, Manitoba, and Saskatchewan, Western Canada, as well as Tonganoxie, Kansas. Rocky Mountain Dealerships Inc. was incorporated in 2007 and is headquartered in Calgary, Canada. As of December 22, 2020, Rocky Mountain Dealerships Inc. was taken private.", "currency": "CAD", "sector": "Services", "industry": "Industrial Equipment Wholesale", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "SLTZ": {"short_name": "SOLAR THIN FILMS INC", "long_name": "Solar Thin Films, Inc.", "summary": "Solar Thin Films, Inc. designs, develops, manufactures, and installs thin-film amorphous silicon photovoltaic manufacturing equipment used in plants that produce photovoltaic thin-film a-Si solar panels or modules. The company serves businesses and investment partnerships engaged in the production of photovoltaic thin-film modules; and corporations and governments involved in the construction of solar power plants principally in the United States, Europe, Russia, Ukraine, and Asia. Solar Thin Films, Inc. was founded in 1993 and is based in New York, New York.", "currency": "USD", "sector": "Services", "industry": "Industrial Equipment Wholesale", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}}