{"PVHO": {"short_name": "PROVISION HOLDING INC", "long_name": "Provision Holding, Inc.", "summary": "Provision Holding, Inc. focuses on the development and distribution of three-dimensional (3D) holographic interactive video displays primarily for advertising and product merchandising markets. The company's products include HoloVision displays and 3D Savings Center kiosks that offer advertisers and customers to reach captive audience in grocery stores, malls, convenience stores, gas stations, banks, and other retail locations. Its HoloVision displays are also used in education, medical, entertainment, and consumer applications. Provision Holding, Inc. has a strategic alliance agreement with Coinstar, LLC to develop and integrate HoloVision display systems into Coinstar's kiosks. The company is headquartered in Chatsworth, California.", "currency": "USD", "sector": "Services", "industry": "Marketing Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Chatsworth"}, "TPNI": {"short_name": "PULSE NETWORK INC", "long_name": "The Pulse Network, Inc.", "summary": "The Pulse Network, Inc. provides a cloud-based platform that focuses on content marketing and event solutions in the United States. It operates a cloud-based content marketing platform, which enables corporate marketers and event groups in their campaign efforts. The company's platform includes Content Marketing Platform that provides newsletters for outreach and engagement; Digital Publication Platform Creator, which develops digital publications; Video Webcast Production Platform that engages the audience with live video production, and enhances participation with live polls and chats; and Event Management Platform, which creates interactive customer experiences through registration and online engagement. Its platform also enhances registration counts through engagement and social sharing, and verification counts through connecting with the audience. In addition, the company offers ICTG platform, a marketing and follow up automation software; event management solution, an end-to-end tool for event groups worldwide; and HostMyLeads.com for lead management, as well as event technology, registration, lead generation, Web, and lead management program services for businesses, event organizers, and associations to engage with their community across channels, such as online, mobile, or face to face. Further, it provides Event Database Solutions comprising a multi-channel software-as-a-service platform for marketing support, registration, housing, management reporting, lead retrieval, online production, event Websites, and continuing education unit tracking, as well as services for marketing and event management. Additionally, the company offers content marketing tools that include syndication and distribution, social sharing, newsletter creation, analytics and reporting, prospect management, and other tools, as well as a content curation tool, which support the cloud-based platform. The Pulse Network, Inc. was founded in 1994 and is based in Norwood, Massachusetts.", "currency": "USD", "sector": "Services", "industry": "Marketing Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Norwood"}}