{
    "CPGN.MX": {
        "short_name": "COMPASS GROUP PLC",
        "long_name": "Compass Group PLC",
        "summary": "Compass Group PLC, together with its subsidiaries, operates as a food and support services company in North America, Europe, and internationally. It serves business and industry; healthcare and senior living market; education; sports and leisure; and defense, offshore, and remote sectors. The company also offers support services, such as cleaning in hospitals; reception services at corporate headquarters; managing remote camps; grounds and facilities services at schools and universities; and others. Compass Group PLC was founded in 1941 and is based in Chertsey, the United Kingdom.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Restaurants",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "city": "Chertsey"
    },
    "QSRN.MX": {
        "short_name": "RESTAURANT BRANDS INTL INC",
        "long_name": "Restaurant Brands International Inc.",
        "summary": "Restaurant Brands International Inc. owns, operates, and franchises quick service restaurants under the Tim Hortons (TH), Burger King (BK), and Popeyes (PLK) brand names. The company operates through three segments: TH, BK, and PLK. Its restaurants offer blend coffee, tea, espresso-based hot and cold specialty drinks, donuts, Timbits, bagels, muffins, cookies and pastries, grilled paninis, classic sandwiches, wraps, soups, hamburgers, chicken and other specialty sandwiches, french fries, soft drinks, chicken, chicken tenders, fried shrimp and other seafood, red beans and rice, and other food items. As of December 31, 2019, the company owned or franchised a total of 4,932 TH restaurants, 18,838 BK restaurants, and 3,316 PLK restaurants in approximately 100 countries worldwide and U.S. territories. Restaurant Brands International Inc. was founded in 1954 and is headquartered in Toronto, Canada.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Restaurants",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "YUM.MX": {
        "short_name": "YUM BRANDS INC",
        "long_name": "Yum! Brands, Inc.",
        "summary": "YUM! Brands, Inc., together with its subsidiaries, develops, operates, and franchises quick service restaurants worldwide. It operates in three segments: the KFC Division, the Pizza Hut Division, and the Taco Bell Division. The company operates restaurants under the KFC, Pizza Hut, and Taco Bell brands, which specialize in chicken, pizza, and Mexican-style food categories. As of December 31, 2018, it had 22,621 KFC units; 18,431 Pizza Hut units; and 7,072 Taco Bell units in approximately 140 countries and territories. The company was formerly known as TRICON Global Restaurants, Inc. and changed its name to YUM! Brands, Inc. in May 2002. YUM! Brands, Inc. was incorporated in 1997 and is headquartered in Louisville, Kentucky.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Restaurants",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Louisville"
    }
}