{
    "0R87N.MX": {
        "short_name": "ASSA ABLOY",
        "long_name": "ASSA ABLOY AB (publ)",
        "summary": "ASSA ABLOY AB (publ) provides door opening products, solutions, and services for the institutional, commercial, and residential markets in Europe, the Middle East, Africa, North and South America, Asia, and Oceania. The company offers mechanical and electromechanical locks, digital door locks, cylinders, door fittings, security doors, door frames, access control devices, and fire doors, as well as hardware products. It also provides identity solutions, including identity and access management, biometrics, authenticity and brand protection products, contactless RFID tags and transponders, and government IDs to companies, and government and state institutions, as well as healthcare, education, and financial industries; and secure access solutions for hotels, cruise ships, student accommodations, and elderly care facilities. In addition, the company offers entrance automation products, services, and components, such as automatic swing, sliding, and revolving doors; industrial doors; garage doors; high-performance doors; docking solutions; hangar doors; gate automation products; components for overhead sectional doors and sensors; and high security fencings and gates. The company provides its products primarily under the ASSA ABLOY, Yale, and HID brands. It sells its products through distributors, wholesalers, and home improvement stores. ASSA ABLOY AB (publ) was incorporated in 1954 and is based in Stockholm, Sweden.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Security & Protection Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Sweden",
        "state": null,
        "city": "Stockholm",
        "zipcode": null,
        "website": "http://www.assaabloy.com",
        "market_cap": "Large Cap"
    },
    "ALLEN.MX": {
        "short_name": "ALLEGION PLC",
        "long_name": "Allegion plc",
        "summary": "Allegion plc manufactures and sells mechanical and electronic security products and solutions worldwide. The company offers door closers and controls; doors and door systems; electronic security products; electronic, biometric, and mobile access control systems; exit devices; locks, locksets, portable locks, and key systems; time, attendance, and workforce productivity systems; and other accessories. The company sells its products and solutions to end-users in commercial, institutional, and residential facilities, including education, healthcare, government, hospitality, commercial office, and single and multi-family residential markets under the CISA, Interflex, LCN, Schlage, SimonsVoss, and Von Duprin brands. It sells its products and solutions through distribution and retail channels, such as specialty distribution, e-commerce, and wholesalers, as well as through various retail channels comprising do-it-yourself home improvement centers, on-line and e-commerce platforms, and small specialty showroom outlets. Allegion plc was incorporated in 2013 and is headquartered in Dublin, Ireland.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Security & Protection Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "D02 VH94",
        "website": "http://www.allegion.com",
        "market_cap": "Large Cap"
    },
    "PCPZ": {
        "short_name": "LEEWARD GROUP HLDGS INC",
        "long_name": "Leeward Group Holdings Inc.",
        "summary": "Leeward Group Holdings Inc. provides retail insurance agency and risk consulting services in the United States. The company sells various categories of insurance products to commercial, professional, and individual customers, which include property insurance relating to physical damage to property; casualty insurance relating to legal liabilities, workers' compensation, and commercial and private passenger automobile coverages; and fidelity and surety bonds. It also sells and services group and individual life, accident, disability, health, hospitalization, medical, and dental insurance products. In addition, the company provides specialty products and services to associations, industries, and businesses, which comprise umbrella insurance policies for limited service franchise hotels and motels; personal umbrella insurance for lawyers; and mobile phone insurance program for telecommunications companies, which offers coverage for the loss, theft, or accidental damage of cell phones. Further, it creates and administers risk management services, such as reinsurance brokerage. The company distributes its products through retail agencies and insurance producers, as well as insurance programs through non-affiliated insurance agencies and associations. Leeward Group Holdings Inc. is headquartered in Pennington, New Jersey.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Security & Protection Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Pennington",
        "zipcode": "08543",
        "website": null,
        "market_cap": "Nano Cap"
    }
}