{
    "0P0T.L": {
        "short_name": "WILH WILHELMSEN HOLDING ASA WIL",
        "long_name": "Wilh. Wilhelmsen Holding ASA",
        "summary": "Wilh. Wilhelmsen Holding ASA provides maritime products and services in Europe, the Americas, Asia, Africa, and Oceania. It operates in Maritime Services and Supply Services segments. The Maritime Services segment offers marine products, ship agency services, and logistics to the merchant fleet, as well as ship management services, including manning for various vessel types. The Supply Services segment engages in the operation of supply bases for the offshore industry; development and operation of real estate properties on and off the supply bases; and maintenance of rigs and handling of logistics related to international pipeline projects and windmill parks. The company's marine products include Unitor chemicals and equipment to clean vessels; Unitor fuel treatment chemicals; Unitor oil spill kits and other damage control solutions; Unitor cylinders; Timm ropes; Unitor equipment for the maintenance and performance vessels; and Nalfleet water treatment products to treat and protect on board systems, as well as Unicool refrigerants. It also provides marine and non-marine insurance services; and maritime training solutions. The company was founded in 1861 and is headquartered in Lysaker, Norway. Wilh. Wilhelmsen Holding ASA is a subsidiary of Tallyman AS.",
        "currency": "NOK",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Norway",
        "state": null,
        "city": "Lysaker",
        "zipcode": "1366",
        "website": "http://www.wilhelmsen.com",
        "market_cap": 10347027456
    },
    "ANEK.AT": {
        "short_name": "ANEK LINES S.A.(CR)",
        "long_name": "Anonimi Naftiliaki Etaria Kritis S.A.",
        "summary": "Anonimi Naftiliaki Etareia Kritis S.A. operates in the passenger shipping sector. It also transports cargo. The company owns and charters vessels in routes of Adriatic Sea, Crete, Dodecanese, and Cyclades. It provides transportation services to approximately 1,044 thousand passengers. The company also produces and trades in plastic bottles and packaging products; and offers tourism and consulting services. Anonimi Naftiliaki Etareia Kritis S.A. was founded in 1967 and is based in Chania, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Chania",
        "zipcode": "73100",
        "website": "http://www.anek.gr",
        "market_cap": 8351552
    },
    "ANEP.AT": {
        "short_name": "ANEK LINES S.A.(PR, issue '90)",
        "long_name": "Anonimi Naftiliaki Etaria Kritis S.A.",
        "summary": "Anonimi Naftiliaki Etareia Kritis S.A. operates in the passenger shipping sector. It also transports cargo. The company owns and charters vessels in routes of Adriatic Sea, Crete, Dodecanese, and Cyclades. It provides transportation services to approximately 1,044 thousand passengers. The company also produces and trades in plastic bottles and packaging products; and offers tourism and consulting services. Anonimi Naftiliaki Etareia Kritis S.A. was founded in 1967 and is based in Chania, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Chania",
        "zipcode": "73100",
        "website": "http://www.anek.gr",
        "market_cap": 14045759
    },
    "ANEPO.AT": {
        "short_name": "ANEK LINES S.A.(PR, issue '96)",
        "long_name": "Anonimi Naftiliaki Etaria Kritis S.A.",
        "summary": "Anonimi Naftiliaki Etareia Kritis S.A. operates in the passenger shipping sector. It also transports cargo. The company owns and charters vessels in routes of Adriatic Sea, Crete, Dodecanese, and Cyclades. It provides transportation services to approximately 1,044 thousand passengers. The company also produces and trades in plastic bottles and packaging products; and offers tourism and consulting services. Anonimi Naftiliaki Etareia Kritis S.A. was founded in 1967 and is based in Chania, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Chania",
        "zipcode": "73100",
        "website": "http://www.anek.gr",
        "market_cap": 11377098
    },
    "ATTICA.AT": {
        "short_name": "ATTICA HOLDINGS SA",
        "long_name": "Attica Holdings S.A.",
        "summary": "Attica Holdings S.A., through its subsidiaries, provides passenger shipping and travel agency services in Greece and internationally. The company's vessels offer transportation services to passengers, private vehicles, and freight. It owns and operates 30 vessels, 20 Ro-Pax ferries, 9 high-speed vessels, and 1 Ro-Ro vessel under the Superfast Ferries, Blue Star Ferries, and Hellenic Seaways brands. The company was founded in 1918 and is headquartered in Kallithea, Greece. Attica Holdings S.A. is a subsidiary of MIG Shipping S.A.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Kallithea",
        "zipcode": "17674",
        "website": "http://www.attica-group.com",
        "market_cap": 215806000
    },
    "GLNGN.MX": {
        "short_name": "GOLAR LNG LIMITED",
        "long_name": "Golar LNG Limited",
        "summary": "Golar LNG Limited provides infrastructure for the liquefaction, transportation, and regasification of LNG. It operates through Shipping, FLNG, and Power segments. The company engages in the acquisition, ownership, operation, and chartering of LNG carriers, Floating Liquefaction Natural Gas Vessel (FLNG), and floating storage regasification units (FSRUs), as well as operates external vessels. As of April 16, 2021, it operated ten LNG carriers, one FSRU, and two FLNGs. The company was founded in 1946 and is headquartered in Hamilton, Bermuda.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM 11",
        "website": "http://www.golarlng.com",
        "market_cap": 25700931584
    },
    "GLOBOFFS.NS": {
        "short_name": "GLOBAL OFFSHORE SE",
        "long_name": "Global Offshore Services Limited",
        "summary": "Global Offshore Services Limited engages in the charter of offshore support vessels in India, the North Sea, Brazil, and West Africa. Its vessels provide support services to the oil and gas exploration activities, including transporting personnel to rigs/platforms from/to onshore bases; delivering cargo/material to rigs/platforms; anchor handling; and towing of rigs, as well as support services for offshore/underwater construction projects. The company was formerly known as Garware Offshore Services Limited and changed its name to Global Offshore Services Limited in March 2011. Global Offshore Services Limited was incorporated in 1976 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400028",
        "website": "http://www.globaloffshore.in",
        "market_cap": 159910400
    },
    "INHC": {
        "short_name": "INNOLOG HLDGS CORP",
        "long_name": "Innolog Holdings Corporation",
        "summary": "Innolog Holdings Corporation, through its subsidiary, Innovative Logistics Techniques, Inc., provides supply chain logistics and information technology solutions to clients in the public and private sectors. The company offers its services and solutions to various clients comprising the Department of Defense, Department of Homeland Security, and civilian agencies in the federal government, as well as state and local municipalities and commercial organizations. Innolog Holdings Corporation is headquartered in Fairfax, Virginia with an additional office in Washington D.C.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Fairfax",
        "zipcode": "22033",
        "website": "http://www.innologholdings.com",
        "market_cap": 2735
    },
    "OLTH.AT": {
        "short_name": "THESSALONIKI PORT AUTHORITY",
        "long_name": "Thessaloniki Port Authority Societe Anonyme",
        "summary": "Thessaloniki Port Authority Societe Anonyme engages in the management and exploitation of the port of Thessaloniki located in Greece. It operates through four segments: Container Terminal, Conventional Cargo, Passenger Traffic, and Utilization of Facilities. The company provides conventional cargo handling services, including loading and unloading services, and SILO services; and containerized cargo handling services. It also offers ships anchoring, mooring, berthing, and other services; and services to passengers on coastal and cruise ships and in transit. In addition, it offers spaces for commercial and other uses; and operates car parking stations. The company primarily serves industries, shipping agents, container transportation companies, and freight transport companies. Thessaloniki Port Authority Societe Anonyme was established in 1999 and is based in Thessaloniki, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Thessaloniki",
        "zipcode": "546 25",
        "website": "http://www.thpa.gr",
        "market_cap": 285264000
    },
    "PPA.AT": {
        "short_name": "PIREUS PORT AUTHORITY S.A (CR)",
        "long_name": "Piraeus Port Authority S.A.",
        "summary": "Piraeus Port Authority S.A. provides port services at the port of Piraeus, Greece. The company operates through Container Terminal, Handling Car, Coasting, Cruise, Ship Repairing, and Other segments. It offers anchoring services of vessels, cargo handling, loading, and unloading services, as well as goods storage and car transportation services. The company is also involved in maintenance of port facilities. In addition, it offers port services, including water, electricity, space management, merchandise management, and telephone connection to ships; and services to travelers, as well as rents space to third parties. The company was founded in 1930 and is based in Piraeus, Greece. Piraeus Port Authority S.A. is a subsidiary of COSCO SHIPPING (Hong Kong) Limited.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Piraeus",
        "zipcode": null,
        "website": "http://www.olp.gr",
        "market_cap": 496999968
    }
}