{
  "0122.HK": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Crocodile Garments Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CROCODILE",
    "state": null,
    "summary": "Crocodile Garments Limited, together with its subsidiaries, engages in the manufacture, retail, and wholesale of garments and related accessories in Hong Kong and the People's Republic of China. The company operates in three segments: Garment and Related Accessories Business, Property Investment and Letting Business, and Trading of Securities. It offers menswear, ladies wear, children's clothing, including shirts, tees and polos, sweaters and knitwear, outerwear, pants, roomwear, and underwear; and accessories, such as bags and wallets, belts, shoes, scarves, socks, ties, and umbrellas, as well as distributes LACOSTE branded apparel. As of July 31, 2019, the company operated 21 shops under the Crocodile brand and 6 shops under the Lacoste brand in Hong Kong and Macau, as well as 13 shops, including 5 self-operated and 8 franchisee operated shops in Mainland China. Crocodile Garments Limited also sells its products through CROCODILE online shop and other e-channels. In addition, it is involved in the property investment and letting, and trading of securities. The company was is based in Kwun Tong, Hong Kong. Crocodile Garments Limited is a subsidiary of Rich Promise Limited.",
    "website": "http://www.crocodile.com.hk",
    "zipcode": null
  },
  "0130.HK": {
    "city": "North Point",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Moiselle International Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MOISELLE INT'L",
    "state": null,
    "summary": "Moiselle International Holdings Limited, an investment holding company, engages in the design, manufacture, retail, and wholesale of fashion apparel and accessories for men and women. The company operates house brands, including MOISELLE, m.d.m.s., GERMAIN, and Rosamund MOISELLE; and distributes international brands, such as LANCASTER. As of March 31, 2020, it operated 44 stores and counters under the MOISELLE, m.d.m.s., LANCASTER, and M CONCEPT brands in Hong Kong, Mainland China, Macau, Taiwan, and Singapore. The company also offers its products through online shopping websites. In addition, it engages in sourcing of materials and property holding activities. The company was founded in 1997 and is headquartered in North Point, Hong Kong. Moiselle International Holdings Limited is a subsidiary of Super Result Consultants Limited.",
    "website": "http://www.moiselle.com.hk",
    "zipcode": null
  },
  "0294.HK": {
    "city": "San Po Kong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Yangtzekiang Garment Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "YANGTZEKIANG",
    "state": null,
    "summary": "Yangtzekiang Garment Limited engages in the manufacturing, sourcing, and trading of garment and textiles. It operates through three segments: Manufacture and Sale of Garments and Textiles; Interests in Joint Ventures; and Property Leasing. Its products include men's and ladies' shirts, trousers, shorts, polo shirts, T-shirts, skirts, loungewear, underwear and pyjamas, suits and jackets, knitted outerwear, blouses, etc. The company engages in the manufacture and sale of textile yarn products, as well as knitting and dyeing fabrics. In addition, it provides garment processing services; and leases commercial and industrial premises. The company sells its products and services primarily in Hong Kong, the United Kingdom, Italy, Spain, Germany, and other European countries; Mainland China; the United States; Canada; and internationally. The company was formerly known as Yangtzekiang Garment Mfg. Co., Ltd. and changed its name to Yangtzekiang Garment Limited in 2005. Yangtzekiang Garment Limited was founded in 1949 and is based in San Po Kong, Hong Kong.",
    "website": "http://www.ygm.com.hk",
    "zipcode": null
  },
  "0311.HK": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Luen Thai Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LUEN THAI",
    "state": null,
    "summary": "Luen Thai Holdings Limited, an investment holding company, manufactures and trades in apparels and accessories in the People's Republic of China, the United States, Europe, Japan, Singapore, Canada, and internationally. It offers fashion and sleepwear, sportswear, sweaters and outerwear, casual knits and woven wear, accessories, and fabrics. The company also provides subcontracting services; sources, manufactures, and trades in textile and garment products; processes, trades in, imports, exports, and distributes garment products; and manufactures and trades in money pieces. In addition, it manufactures bags; offers technical services; and manufactures and trades in handbags. The company was incorporated in 2004 and is headquartered in Kwun Tong, Hong Kong. Luen Thai Holdings Limited is a subsidiary of Shangtex (Hong Kong) Limited.",
    "website": "http://www2.luenthai.com",
    "zipcode": null
  },
  "0393.HK": {
    "city": "Kowloon Bay",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Glorious Sun Enterprises Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GLORIOUS SUN",
    "state": null,
    "summary": "Glorious Sun Enterprises Limited, an investment holding company, engages in interior decoration and renovation business, and retail and export of casual wear in Mainland China, Hong Kong, Australia, New Zealand, Canada, the United States, and internationally. It operates through four segments: Interior Decoration and Renovation; Retail, Franchise and Others; Export Operations; and Financial Investments. The Interior Decoration and Renovation segment engages in the interior decoration and renovation businesses, as well as sale of furniture. The Retail, Franchise and Others segment engages in the retail operation in Hong Kong, as well as franchise sale activities under the Jeanswest brand in casual wear and apparel domain. The Export Operations segment exports apparel. The Financial Investments segment is involved in the treasury management and consulting business. The company also offers garment design and agency services. As of December 31, 2020, it operated 10 Jeanswest branded stores in Hong Kong. Glorious Sun Enterprises Limited was founded in 1974 and is headquartered in Kowloon Bay, Hong Kong.",
    "website": "http://www.glorisun.com",
    "zipcode": null
  },
  "0458.HK": {
    "city": "Kwai Chung",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Tristate Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "TRISTATE HOLD",
    "state": null,
    "summary": "Tristate Holdings Limited, an investment holding company, designs, manufactures, and trades in garments in the People's Republic of China, Canada, the United States, and the United Kingdom. It offers military, work, and sportswear; outerwear; and womenswear under the C.P. Company, Cissonne, Nautica, and Spyder brand names. The company also engages in the branded product distribution, retail, and trading. In addition, it offers sales liaison, general administrative and supporting, factory facilities leasing, nominee and secretarial, technical, and design and customer support services. Further, the company is involved in trademark holding and licensing, retail store operation, and trading of apparel and accessories, as well as general trading and marketing, and product design and development activities. It also exports its products. The company was founded in 1937 and is headquartered in Kwai Chung, Hong Kong. Tristate Holdings Limited operates as a subsidiary of Silver Tree Holdings Inc.",
    "website": "http://www.tristateww.com",
    "zipcode": null
  },
  "0518.HK": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Tungtex (Holdings) Company Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "TUNGTEX (HOLD)",
    "state": null,
    "summary": "Tungtex (Holdings) Company Limited, an investment holding company, manufactures, sells, retails, and trades in garments in North America, Asia, Europe, and internationally. The company manufactures and exports ladies sportswear, casual wear, and suit pieces; and various ladies career and casual sportswear for department stores, chain stores, specialty stores, catalogs, and designer labels, as well as silk-blended, linen, cotton, and synthetic apparel products. As at 31 March 2020, it operated 169 Betu brand shops in the Mainland China. Tungtex (Holdings) Company Limited was founded in 1977 and is based in Kwun Tong, Hong Kong.",
    "website": "http://www.tungtex.com",
    "zipcode": null
  },
  "0844.HK": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Greatime International Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GREATIME INTL",
    "state": null,
    "summary": "Greatime International Holdings Limited, an investment holding company, manufactures and sells innerwear products and knitted fabrics for infants and adults in the People's Republic of China, Japan, the United States, Africa, Italy, and Myanmar. The company operates through Innerwear Products and Knitted Fabrics segments. It is involved in the functional and customized fabrics for lingerie and apparel brands; and provision of a range of innerwear for men, women, toddlers, and infants, including T-shirts, vests, long-sleeves pullovers, men's and boxer briefs, women's panties, long johns, and toddlers' and infants' body suits and bibs. The company also manufactures and trades in garments; and offers fabric weaving knitting, printing, and dyeing services. It primarily sells its products to the sourcing agents, wholesalers, and brand owners. The company was formerly known as Grand Concord International Holdings Limited and changed its name to Greatime International Holdings Limited in June 2017. The company was founded in 2000 and is headquartered in Wan Chai, Hong Kong. Greatime International Holdings Limited is a subsidiary of Junfun Investment Limited.",
    "website": "http://www.greatimeintl.com",
    "zipcode": null
  },
  "1025.HK": {
    "city": "Tsuen Wan",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "KNT Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "KNT HOLDINGS",
    "state": null,
    "summary": "KNT Holdings Limited, an investment holding company, engages in the manufacture and trading of garments in Hong Kong, the People's Republic of China, the United States, Europe, Australia, and internationally. The company offers bridesmaid dresses, bridal gowns, and special occasion dresses to apparel companies. It also provides value-added services, including fashion trend analysis, product design and development, raw material procurement, design and development, production, quality assurance, and inventory management. The company was founded in 1993 and is headquartered in Tsuen Wan, Hong Kong.",
    "website": "http://www.kntholdings.com",
    "zipcode": null
  },
  "1388.HK": {
    "city": "Kwai Chung",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Embry Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "EMBRY HOLDINGS",
    "state": null,
    "summary": "Embry Holdings Limited, an investment holding company, designs, researches, develops, manufactures, trades in, and sells ladies brassieres, panties, swimwear, and sleepwear. The company sells its lingerie products primarily under the EMBRY FORM, FANDECIE, COMFIT, E-BRA, IVU, IADORE, and LIZA CHENG brands. It also holds trademark and invests in properties. As of December 31, 2020, the company had 1,398 retail outlets comprising 1,177 concessionary counters and 221 retail stores in Mainland China, Hong Kong, and Macau. It also operates an online shop. The company was founded in 1975 and is headquartered in Kwai Chung, Hong Kong. Embry Holdings Limited is a subsidiary of Harmonious World Limited.",
    "website": "http://www.embrygroup.com",
    "zipcode": null
  },
  "1433.HK": {
    "city": "Lai Chi Kok",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Cirtek Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CIRTEK HLDGS",
    "state": null,
    "summary": "Cirtek Holdings Limited, an investment holding company, manufactures and sells printing products. It offers apparel labels and trim products, such as hang tags, woven labels, printed labels, and heat transfer products. The company garment brand companies. It operates in Hong Kong, Mainland China, Bangladesh, Vietnam, the United States, and internationally. The company was incorporated in 2019 and is headquartered in Hong Kong. Cirtek Holdings Limited is a subsidiary of Charming International Limited.",
    "website": "http://www.cirtek.com/tc/aboutus.html",
    "zipcode": null
  },
  "1520.HK": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "CEFC Hong Kong Financial Investment Company Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CEFC FIN INV",
    "state": null,
    "summary": "CEFC Hong Kong Financial Investment Company Limited, an investment holding company, designs, manufactures, and trades in apparels in the United States, Hong Kong, and internationally. The company provides its products under private labels and own brands. It also provides designing, marketing, and advertising services; and money lending services to individual consumers and small businesses. The company was formerly known as Runway Global Holdings Company Limited and changed its name to CEFC Hong Kong Financial Investment Company Limited in October 2017. CEFC Hong Kong Financial Investment Company Limited was founded in 2001 and is headquartered in Wanchai, Hong Kong.",
    "website": "http://www.cefcfi.com.hk",
    "zipcode": null
  },
  "1906.HK": {
    "city": "Hong Kong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Bonny International Holding Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BONNY HLDG",
    "state": null,
    "summary": "Bonny International Holding Limited, an investment holding company, manufactures, trades, and sells intimate wear products and functional sportswear. It operates through two segments, Original Design Manufacture (ODM) Products and Brand Products. The ODM Products segment manufactures and sells underwear or other ODM products to overseas customers or their agents. The Brand Products segment manufactures and sells ladies brassieres, panties, thermal underwear under the Bonny brand name. The company operates in Mainland China, the United States, Germany, Japan, the Netherlands, and internationally. Bonny International Holding Limited was incorporated in 2017 and is headquartered in Hong Kong, Hong Kong.",
    "website": "http://www.bonnychina.com",
    "zipcode": null
  },
  "1982.HK": {
    "city": "Tai Po",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Nameson Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NAMESON HLDGS",
    "state": null,
    "summary": "Nameson Holdings Limited, an investment holding company, designs, manufactures, and sells knitwear products, knitted upper for footwear, and knitted upper shoes. The company offers women's wear and men's wear products; and other products, such as children's wear, scarfs, hats, and gloves. It provides its products to apparel brands in Japan, North America, Europe, Mainland China, and internationally. The company was founded in 1990 and is headquartered in Tai Po, Hong Kong. Nameson Holdings Limited is a subsidiary of Nameson Investments Limited.",
    "website": "http://www.namesonholdings.com",
    "zipcode": null
  },
  "2199.HK": {
    "city": "Kwai Chung",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Regina Miracle International (Holdings) Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "REGINA MIRACLE",
    "state": null,
    "summary": "Regina Miracle International (Holdings) Limited, an investment holding company, designs, manufactures, and trades in a range of intimate wear and functional sports products. It operates through three segments: Bras and Intimate Wear, Bra Pads and Other Molded Products, and Functional Sports Products. The company offers bras, sports bras, bra pads, panties, shapewear, functional sports apparel and footwear, and other molded products. It also provides sales agency and information technology services. The company operates in Hong Kong, the United States, the People's Republic of China, Europe, Japan, Korea, Malaysia, Indonesia, Singapore, the Philippines, Vietnam, Thailand, Bangladesh, Sri Lanka, India, Taiwan, Turkey, Australia, Colombia, and internationally. The company was founded in 1998 and is headquartered in Kwai Chung, Hong Kong. Regina Miracle International (Holdings) Limited is a subsidiary of Regent Marvel Investment Holdings Limited.",
    "website": "http://www.reginamiracleholdings.com",
    "zipcode": null
  },
  "2232.HK": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Crystal International Group Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CRYSTAL INTL",
    "state": null,
    "summary": "Crystal International Group Limited, an investment holding company, manufactures and trades in garments in the Asia Pacific, the United States, Europe, and internationally. The company offers lifestyle wear, denim, intimate, sweater, and sportswear and outdoor apparel. It serves various apparel brands. The company was formerly known as Crystal International Limited and changed its name to Crystal International Group Limited in March 2017. Crystal International Group Limited was founded in 1970 and is headquartered in Kwun Tong, Hong Kong.",
    "website": "http://www.crystalgroup.com",
    "zipcode": "417940"
  },
  "2368.HK": {
    "city": "Kwai Chung",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Eagle Nice (International) Holdings Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "EAGLE NICE",
    "state": null,
    "summary": "Eagle Nice (International) Holdings Limited, an investment holding company, manufactures and trades in sportswear and garments for men, women, and children. Its sportswear include down jackets, tracksuits, sweaters, sports pants, etc. It has operations in Mainland China, the United States, Europe, Japan, and internationally. The company was founded in 1993 and is headquartered in Kwai Chung, Hong Kong.",
    "website": "http://www.eaglenice.com.hk",
    "zipcode": null
  },
  "3322.HK": {
    "city": "Kowloon",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Win Hanverky Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "WIN HANVERKY",
    "state": null,
    "summary": "Win Hanverky Holdings Limited, together with its subsidiaries, manufactures and sells sportswear, outerwear, fashion apparel, and related accessories in Mainland China, Europe, other Asian countries, the United States, Hong Kong, Canada, and internationally. It operates through Manufacturing and High-end Fashion Retailing segments. The company also retails high-end fashion products. It operates fashion retail networks, including D-mop and J-01 stores; Y-3, Thomas Sabo, Tara Jarmon, and Heron Preston brands under distribution rights; and licensed stores under the Champion, DAKS, Marcelo Burlon, and New Era brand names. As of December 31, 2020, the company operated 233 stores, including 192 stores in Mainland China, 31 stores in Hong Kong and Macau, and 10 stores in Taiwan and Singapore. In addition, it engages in property holding business. The company was incorporated in 2005 and is headquartered in Kowloon, Hong Kong. Win Hanverky Holdings Limited is a subsidiary of Quinta Asia Limited.",
    "website": "http://winhanverky.com",
    "zipcode": null
  },
  "3398.HK": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "China Ting Group Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CHINA TING",
    "state": null,
    "summary": "China Ting Group Holdings Limited, an investment holding company, manufactures, exports, and retails garments in the People's Republic of China, North America, the European Union, Hong Kong, and internationally. The company operates through four segments: Original Equipment Manufacturer (OEM), Retail, Property Development, and Property Investment. It manufactures and sells garments on an OEM basis; and manufactures and retails branded fashion apparel. The company is also involved in the manufacture of wool textile and knitwear; printing and dyeing silk and other fabrics; and weaving silk fabrics, home textile, and spun silk fabrics. In addition, it develops and invests in properties; and trades in garment products. The company retails its products primarily under the FINITY, ELANIE RIESE, RIVERSTONE, CALVIN KLEIN PERFORMANCE, and VINCE CAMUTO brands. It operates approximately 500 retail stores. China Ting Group Holdings Limited was founded in 1992 and is headquartered in Kwun Tong, Hong Kong. China Ting Group Holdings Limited is a subsidiary of Longerview Investments Limited.",
    "website": "http://www.chinating.com.hk",
    "zipcode": null
  },
  "38N.F": {
    "city": "Tai Po",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Apparel Manufacturing",
    "long_name": "Nameson Holdings Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NAMESON HLDNGS LTD HD-,01",
    "state": null,
    "summary": "Nameson Holdings Limited, an investment holding company, designs, manufactures, and sells knitwear products, knitted upper for footwear, and knitted upper shoes. The company offers women's wear and men's wear products; and other products, such as children's wear, scarfs, hats, and gloves. It provides its products to apparel brands in Japan, North America, Europe, Mainland China, and internationally. The company was founded in 1990 and is headquartered in Tai Po, Hong Kong. Nameson Holdings Limited is a subsidiary of Nameson Investments Limited.",
    "website": "http://www.namesonholdings.com",
    "zipcode": null
  },
  "3998.HK": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Bosideng International Holdings Limited",
    "market": "hk_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BOSIDENG",
    "state": null,
    "summary": "Bosideng International Holdings Limited researches, designs, develops, manufactures, markets, and distributes branded down apparel products, original equipment manufacturing (OEM) products, and non-down apparel products. The company operates through four segments: Down Apparels, OEM Management, Ladieswear Apparels, and Diversified Apparels. It engages in the business of sourcing and distributing branded down and ladieswear apparels; and non-seasonal apparels, including branded menswear, school uniform, and children's wear. The company provides down apparel products under the Bosideng, Snow Flying, and Bengen brands; ladies wear products under the JESSIE, BUOU BUOU, KOREANO, and KLOVA brands; and school uniforms under the Sameite brands. It also offers network consulting and e-business of down and non-down apparel; logistics and storage services; and brand design and development services, as well as operates as an advertisement agent. As of March 31, 2020, it operated 499 ladieswear retail outlets; and 373 self-operated retail outlets in the People's Republic of China. Bosideng International Holdings Limited was founded in 1976 and is based in Central, Hong Kong.",
    "website": "http://www.bosideng.com",
    "zipcode": null
  },
  "3BD.F": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Apparel Manufacturing",
    "long_name": "Bosideng International Holdings Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BOSIDENG INTL HL.DL-00001",
    "state": null,
    "summary": "Bosideng International Holdings Limited researches, designs, develops, manufactures, markets, and distributes branded down apparel products, original equipment manufacturing (OEM) products, and non-down apparel products. The company operates through four segments: Down Apparels, OEM Management, Ladieswear Apparels, and Diversified Apparels. It engages in the business of sourcing and distributing branded down and ladieswear apparels; and non-seasonal apparels, including branded menswear, school uniform, and children's wear. The company provides down apparel products under the Bosideng, Snow Flying, and Bengen brands; ladies wear products under the JESSIE, BUOU BUOU, KOREANO, and KLOVA brands; and school uniforms under the Sameite brands. It also offers network consulting and e-business of down and non-down apparel; logistics and storage services; and brand design and development services, as well as operates as an advertisement agent. As of March 31, 2020, it operated 499 ladieswear retail outlets; and 373 self-operated retail outlets in the People's Republic of China. Bosideng International Holdings Limited was founded in 1976 and is based in Central, Hong Kong.",
    "website": "http://www.bosideng.com",
    "zipcode": null
  },
  "8041.HK": {
    "city": "Cheung Sha Wan",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Luxey International (Holdings) Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LUXEY INT'L",
    "state": null,
    "summary": "Luxey International (Holdings) Limited, an investment holding company, manufactures and trades in swimwear and garment products. The company operates through three segments: Swimwear and Garment, E-Commerce and On-line Shopping Related, and Money Lending. It also engages in the buying, refurbishing, and selling of second hand mobile phones through online platforms; and trading of cameras and electronic parts, as well as acts as an agents for suppliers. In addition, the company engages in microfinance business. It sells its products in the People's Republic of China, the Kingdom of Cambodia, the United Kingdom, Spain, Sweden, the United States, the Netherlands, Israel, France, Italy, and internationally. The company was formerly known as China Post E-Commerce (Holdings) Limited and changed its name to Luxey International (Holdings) Limited in May 2012. Luxey International (Holdings) Limited is headquartered in Cheung Sha Wan, Hong Kong.",
    "website": "http://www.luxey.com.hk",
    "zipcode": null
  },
  "8297.HK": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "My Heart Bodibra Group Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BODIBRA",
    "state": null,
    "summary": "My Heart Bodibra Group Limited, an investment holding company, designs, manufactures, and sells lingerie products. It offers bras, body shaping underwear, and chest support vests, as well as complementary and ancillary products, including breast creams, panties, nude bras, swimwear, bra straps and pads, and waist bands under the Bodibra, June, ooobiki, Bodicare, and invisi brands. The company is also involved in trading of garments; and the provision of beauty and lingerie alteration services. It operates retail stores in Hong Kong, Macau, and the People's Republic of China. The company was founded in 2003 and is headquartered in Kwun Tong, Hong Kong. My Heart Bodibra Group Limited is a subsidiary of Global Succeed Group Limited.",
    "website": "http://www.bodibra.com",
    "zipcode": null
  },
  "8456.HK": {
    "city": "Kwai Chung",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "Mansion International Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MANSION INTL",
    "state": null,
    "summary": "Mansion International Holdings Limited, an investment holding company, manufactures and sells baby clothing and clothing accessories for infants and toddlers. The company offers underwear products; basic garments, such as rompers, robes, coats, pyjamas, windbreakers, vests, reversible jackets, pants, and leggings; and outdoor garments. It also provides sleeping accessories, including baby urine pads, blankets, receiving blankets, sleeping bags, and swaddles; and fabric accessories comprising bibs, hats, mittens, booties, and towels. The company offers its products through its original equipment manufacturing business directly to the brand companies or designated sourcing companies primarily located in Hong Kong, the United Kingdom, and the United States; and original brand manufacturing business under its mides brand name and complementary third party brand products through its 12 self-operated retail stores and 11 department store counters in Hong Kong, as well as wholesale in Hong Kong, the People's Republic of China, and Macau. Mansion International Holdings Limited was founded in 1993 and is headquartered in Kwai Chung, Hong Kong.",
    "website": "http://www.mansionintl.com",
    "zipcode": null
  },
  "8507.HK": {
    "city": "Lai Chi Kok",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Apparel Manufacturing",
    "long_name": "i.century Holding Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "I.CENTURY HLDG",
    "state": null,
    "summary": "i.century Holding Limited, an investment holding company, provides apparel products and apparel supply chain management services in the United States, France, other European countries, Australia, Canada, Japan, and Internationally. The company offers jackets, woven shirts, pullovers, pants, shorts, and T-shirts; and other products, including dresses and vests, as well as accessories, such as socks and bags. It also provides sales consulting and support services; and merchandising quality control and sourcing services. The company was founded in 2008 and is headquartered in Lai Chi Kok, Hong Kong. i.century Holding Limited is a subsidiary of Giant Treasure Development Limited.",
    "website": "http://icenturyholding.com",
    "zipcode": null
  },
  "BSDGF": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Apparel Manufacturing",
    "long_name": "Bosideng International Holdings Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BOSIDENG INTERNATIONAL HLDGS",
    "state": null,
    "summary": "Bosideng International Holdings Limited researches, designs, develops, manufactures, markets, and distributes branded down apparel products, original equipment manufacturing (OEM) products, and non-down apparel products. The company operates through four segments: Down Apparels, OEM Management, Ladieswear Apparels, and Diversified Apparels. It engages in the business of sourcing and distributing branded down and ladieswear apparels; and non-seasonal apparels, including branded menswear, school uniform, and children's wear. The company provides down apparel products under the Bosideng, Snow Flying, and Bengen brands; ladies wear products under the JESSIE, BUOU BUOU, KOREANO, and KLOVA brands; and school uniforms under the Sameite brands. It also offers network consulting and e-business of down and non-down apparel; logistics and storage services; and brand design and development services, as well as operates as an advertisement agent. As of March 31, 2020, it operated 499 ladieswear retail outlets; and 373 self-operated retail outlets in the People's Republic of China. Bosideng International Holdings Limited was founded in 1976 and is based in Central, Hong Kong.",
    "website": "http://www.bosideng.com",
    "zipcode": null
  },
  "BSDGY": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Apparel Manufacturing",
    "long_name": "Bosideng International Holdings Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BOSIDENG INTERNATIONAL HLDGS",
    "state": null,
    "summary": "Bosideng International Holdings Limited researches, designs, develops, manufactures, markets, and distributes branded down apparel products, original equipment manufacturing (OEM) products, and non-down apparel products. The company operates through four segments: Down Apparels, OEM Management, Ladieswear Apparels, and Diversified Apparels. It engages in the business of sourcing and distributing branded down and ladieswear apparels; and non-seasonal apparels, including branded menswear, school uniform, and children's wear. The company provides down apparel products under the Bosideng, Snow Flying, and Bengen brands; ladies wear products under the JESSIE, BUOU BUOU, KOREANO, and KLOVA brands; and school uniforms under the Sameite brands. It also offers network consulting and e-business of down and non-down apparel; logistics and storage services; and brand design and development services, as well as operates as an advertisement agent. As of March 31, 2020, it operated 499 ladieswear retail outlets; and 373 self-operated retail outlets in the People's Republic of China. Bosideng International Holdings Limited was founded in 1976 and is based in Central, Hong Kong.",
    "website": "http://www.bosideng.com",
    "zipcode": null
  },
  "C8T.F": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Apparel Manufacturing",
    "long_name": "China Ting Group Holdings Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CHINA TING G.HLDGS HD-,10",
    "state": null,
    "summary": "China Ting Group Holdings Limited, an investment holding company, manufactures, exports, and retails garments in the People's Republic of China, North America, the European Union, Hong Kong, and internationally. The company operates through four segments: Original Equipment Manufacturer (OEM), Retail, Property Development, and Property Investment. It manufactures and sells garments on an OEM basis; and manufactures and retails branded fashion apparel. The company is also involved in the manufacture of wool textile and knitwear; printing and dyeing silk and other fabrics; and weaving silk fabrics, home textile, and spun silk fabrics. In addition, it develops and invests in properties; and trades in garment products. The company retails its products primarily under the FINITY, ELANIE RIESE, RIVERSTONE, CALVIN KLEIN PERFORMANCE, and VINCE CAMUTO brands. It operates approximately 500 retail stores. China Ting Group Holdings Limited was founded in 1992 and is headquartered in Kwun Tong, Hong Kong. China Ting Group Holdings Limited is a subsidiary of Longerview Investments Limited.",
    "website": "http://www.chinating.com.hk",
    "zipcode": null
  },
  "CIND": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Apparel Manufacturing",
    "long_name": "China Industrial Group, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CHINA INDUSTRIAL GROUP INC",
    "state": null,
    "summary": "China Industrial Group, Inc. through its subsidiary, Cashmere International Holdings Limited, manufactures cashmere products. The company has its principal executive offices in Wan Chai, Hong Kong.",
    "website": null,
    "zipcode": null
  },
  "EDSFF": {
    "city": "Kowloon",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Apparel Manufacturing",
    "long_name": "Exceed Company Ltd.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "EXCEED COMPANY LTD",
    "state": null,
    "summary": "Exceed Company Ltd. is engaged in the design, development, and wholesale of footwear, apparel, and accessories under the brand name of Xidelong in the People's Republic of China. It provides footwear products, including running, leisure, basketball, skateboarding, canvas, tennis, and outdoor footwear products; apparel products comprising sports tops, pants, jackets, track suits, and coats; and accessories, such as bags, socks, hats, and caps. The company offers its products for the customers aging between 15 to 35 years through various distributors. Exceed Company Ltd. was founded in 2001 and is based in Kowloon, Hong Kong.",
    "website": "http://www.ir.xdlong.cn",
    "zipcode": null
  },
  "FEH1.SG": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Apparel Manufacturing",
    "long_name": "Far East Holdings International Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Far East Holdings Intl Ltd. Reg",
    "state": null,
    "summary": "Far East Holdings International Limited, an investment holding company, engages in the property and securities investment businesses in Hong Kong. It invests in commercial properties and short-term securities. The company was formerly known as Far East Technology International Limited and changed its name to Far East Holdings International Limited in 2007. Far East Holdings International Limited is based in Central, Hong Kong.",
    "website": "http://www.0036.com.hk",
    "zipcode": null
  },
  "GLH.F": {
    "city": "Sha Tin",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Apparel Manufacturing",
    "long_name": "Goldlion Holdings Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GOLDLION HLDGS LTD",
    "state": null,
    "summary": "Goldlion Holdings Limited, an investment holding company, manufactures and distributes apparel. It operates through three segments: Apparel in China Mainland and Hong Kong SAR, Apparel in Singapore and Malaysia, and Property Investment and Development. The company offers garments, leather goods, and accessories, as well as licenses its brand name; and invests in, develops, and manages properties. It markets its products through distributors, self-operated retail shops, and factory outlets, as well as through e-commerce. The company operates approximately 846 retail outlets in China Mainland comprising 104 self-operated outlets. Goldlion Holdings Limited was founded in 1968 and is based in Shatin, Hong Kong.",
    "website": "http://www.goldlion.com",
    "zipcode": null
  },
  "GLLHF": {
    "city": "Sha Tin",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Apparel Manufacturing",
    "long_name": "Goldlion Holdings Limited",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GOLDLION HLDGS",
    "state": null,
    "summary": "Goldlion Holdings Limited, an investment holding company, manufactures and distributes apparel. It operates through three segments: Apparel in China Mainland and Hong Kong SAR, Apparel in Singapore and Malaysia, and Property Investment and Development. The company offers garments, leather goods, and accessories, as well as licenses its brand name; and invests in, develops, and manages properties. It markets its products through distributors, self-operated retail shops, and factory outlets, as well as through e-commerce. The company operates approximately 846 retail outlets in China Mainland comprising 104 self-operated outlets. Goldlion Holdings Limited was founded in 1968 and is based in Shatin, Hong Kong.",
    "website": "http://www.goldlion.com",
    "zipcode": null
  },
  "GLSEF": {
    "city": "Kowloon Bay",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Apparel Manufacturing",
    "long_name": "Glorious Sun Enterprises Limited",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GLORIOUS SUN ENTERPRISE",
    "state": null,
    "summary": "Glorious Sun Enterprises Limited, an investment holding company, engages in interior decoration and renovation business, and retail and export of casual wear in Mainland China, Hong Kong, Australia, New Zealand, Canada, the United States, and internationally. It operates through four segments: Interior Decoration and Renovation; Retail, Franchise and Others; Export Operations; and Financial Investments. The Interior Decoration and Renovation segment engages in the interior decoration and renovation businesses, as well as sale of furniture. The Retail, Franchise and Others segment engages in the retail operation in Hong Kong, as well as franchise sale activities under the Jeanswest brand in casual wear and apparel domain. The Export Operations segment exports apparel. The Financial Investments segment is involved in the treasury management and consulting business. The company also offers garment design and agency services. As of December 31, 2020, it operated 10 Jeanswest branded stores in Hong Kong. Glorious Sun Enterprises Limited was founded in 1974 and is headquartered in Kowloon Bay, Hong Kong.",
    "website": "http://www.glorisun.com",
    "zipcode": null
  },
  "GLV.F": {
    "city": "Kowloon Bay",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Apparel Manufacturing",
    "long_name": "Glorious Sun Enterprises Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GLORIOUS SUN ENT.  HD-,10",
    "state": null,
    "summary": "Glorious Sun Enterprises Limited, an investment holding company, engages in interior decoration and renovation business, and retail and export of casual wear in Mainland China, Hong Kong, Australia, New Zealand, Canada, the United States, and internationally. It operates through four segments: Interior Decoration and Renovation; Retail, Franchise and Others; Export Operations; and Financial Investments. The Interior Decoration and Renovation segment engages in the interior decoration and renovation businesses, as well as sale of furniture. The Retail, Franchise and Others segment engages in the retail operation in Hong Kong, as well as franchise sale activities under the Jeanswest brand in casual wear and apparel domain. The Export Operations segment exports apparel. The Financial Investments segment is involved in the treasury management and consulting business. The company also offers garment design and agency services. As of December 31, 2020, it operated 10 Jeanswest branded stores in Hong Kong. Glorious Sun Enterprises Limited was founded in 1974 and is headquartered in Kowloon Bay, Hong Kong.",
    "website": "http://www.glorisun.com",
    "zipcode": null
  },
  "LTJ.F": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Apparel Manufacturing",
    "long_name": "Luen Thai Holdings Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LUEN THAI HLDGS  DL-,01",
    "state": null,
    "summary": "Luen Thai Holdings Limited, an investment holding company, manufactures and trades in apparels and accessories in the People's Republic of China, the United States, Europe, Japan, Singapore, Canada, and internationally. It offers fashion and sleepwear, sportswear, sweaters and outerwear, casual knits and woven wear, accessories, and fabrics. The company also provides subcontracting services; sources, manufactures, and trades in textile and garment products; processes, trades in, imports, exports, and distributes garment products; and manufactures and trades in money pieces. In addition, it manufactures bags; offers technical services; and manufactures and trades in handbags. The company was incorporated in 2004 and is headquartered in Kwun Tong, Hong Kong. Luen Thai Holdings Limited is a subsidiary of Shangtex (Hong Kong) Limited.",
    "website": "http://www2.luenthai.com",
    "zipcode": null
  },
  "RMT.F": {
    "city": "Kwai Chung",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Apparel Manufacturing",
    "long_name": "Regina Miracle International (Holdings) Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "REGINA MIR.INTL HLD.DL-01",
    "state": null,
    "summary": "Regina Miracle International (Holdings) Limited, an investment holding company, designs, manufactures, and trades in a range of intimate wear and functional sports products. It operates through three segments: Bras and Intimate Wear, Bra Pads and Other Molded Products, and Functional Sports Products. The company offers bras, sports bras, bra pads, panties, shapewear, functional sports apparel and footwear, and other molded products. It also provides sales agency and information technology services. The company operates in Hong Kong, the United States, the People's Republic of China, Europe, Japan, Korea, Malaysia, Indonesia, Singapore, the Philippines, Vietnam, Thailand, Bangladesh, Sri Lanka, India, Taiwan, Turkey, Australia, Colombia, and internationally. The company was founded in 1998 and is headquartered in Kwai Chung, Hong Kong. Regina Miracle International (Holdings) Limited is a subsidiary of Regent Marvel Investment Holdings Limited.",
    "website": "http://www.reginamiracleholdings.com",
    "zipcode": null
  }
}
