{"0128.HK": {"short_name": "ENM HOLDINGS", "long_name": "ENM Holdings Limited", "summary": "ENM Holdings Limited, an investment holding company, engages in the wholesale and retail of fashion wear and accessories. It operates through three segments: Wholesale and Retail of Fashion Wear and Accessories; Resort and Recreational Club Operations; and Investments. The company operates a chain of multi-label stores, as well as mono-brand boutiques under The Swank brand in Hong Kong and China; and Hilltop Country Club that provides conferences, dining, lodging, recreational, and outdoor activities for its members in Hong Kong; as well as offers menswear fashion products under the Cesare di Pino brand. It also holds and trades in investments for short term and long term investment returns. The company was formerly known as e-New Media Company Limited and changed its name to ENM Holdings Limited in June 2005. ENM Holdings Limited was incorporated in 1966 and is based in Tsuen Wan, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Apparel Retail", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Tsuen Wan"}, "0375.HK": {"short_name": "YGM TRADING", "long_name": "YGM Trading Limited", "summary": "YGM Trading Limited, an investment holding company, engages in the wholesale and retail of garments and accessories in Hong Kong, the People's Republic of China, Taiwan, the United Kingdom, and internationally. It operates through four segments: Sales of Garments; Licensing of Trademarks; Printing and Related Services; and Property Rental. The company offers various men's and ladies' wear products, such as shirts, blouses, trousers and casual pants, blousons, polo shirts, T-shirts, etc.; bags; golf and ski wears; perfume, watches, eyewear, leather goods, and home fashion products; and suits and casual wears. It is also involved in the managing and licensing trademarks; investment and leasing of properties; provision of security and general business printing services; trading of printing products; and development of authentication and electronic forgery detection solutions. The company offers its products primarily under the Ashworth, Black Clover, Guy Laroche, Harmont & Blaine, MICHEL RENÃ\u0089, Save My Bag, Tommy Bahama, and J.Lindeberg brands. It serves customers through a distribution network of 86 points of sales in Hong Kong, Macau, Mainland China, Taiwan, and Paris. The company was founded in 1949 and is based in San Po Kong, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Apparel Retail", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "San Po Kong"}, "0483.HK": {"short_name": "BAUHAUS INT'L", "long_name": "Bauhaus International (Holdings) Limited", "summary": "Bauhaus International (Holdings) Limited, an investment holding company, engages in the design and retail of apparel, bags, and fashion accessories for men and women. As of December 31, 2019, the company operated 21 stores in Mainland China and 65 stores/counters in Taiwan. It also sells its products through online channels. In addition, the company engages in the property holding activities; trading of garments and accessories; and provision of management services. The company was founded in 1991 and is headquartered in Kowloon Bay, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Apparel Retail", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kowloon Bay"}, "0592.HK": {"short_name": "BOSSINI INT'L", "long_name": "Bossini International Holdings Limited", "summary": "Bossini International Holdings Limited, an investment holding company, engages in the retail, distribution, and wholesale of garments. It offers casual wear apparel products, including men's, ladies', and kids' wear. As of June 30, 2020, the company operated 209 directly managed stores in Hong Kong and Macau, Mainland China, and Singapore; and 773 export franchised stores in Southeast Asia, the Middle East, Europe, and Central America. It is also involved in property holding and letting activities, as well as licensing trademarks. The company was founded in 1987 and is headquartered in Kowloon, Hong Kong. Bossini International Holdings Limited is a subsidiary of Viva China Holdings Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Apparel Retail", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kowloon"}, "0709.HK": {"short_name": "GIORDANO INT'L", "long_name": "Giordano International Limited", "summary": "Giordano International Limited, an investment holding company, engages in the retail and distribution of men's, women's, and children's fashion apparel and accessories worldwide. It operates through two segments, Retail and Distribution; and Wholesales to Overseas Franchisees. The company sells its products under the Giordano, Giordano Junior, Giordano Ladies, BSX, and other owned and licensed brands through its own stores, as well as third party franchisees. As of December 31, 2019, the company operated a network of 2,375 stores. The company is also involved in the manufacture and retail of apparel and accessories; provision of management services; and licensing of trademarks. Giordano International Limited was founded in 1981 and is based in Kowloon, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Apparel Retail", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kowloon"}, "1367.HK": {"short_name": "SFUND INTL HLDG", "long_name": "SFund International Holdings Limited", "summary": "SFund International Holdings Limited, an investment holding company, provides apparel supply chain management services in the United States, Mainland China, Hong Kong, and internationally. It operates through four segments: Apparel Trading and Related Services, Financial Services, Money Lending, and Securities Investment. The Apparel Trading and Related Services segment engages in the trading of apparel products and provision of apparel supply chain management services. The Financial Services segment engages in the securities dealing business, as well as the provision of asset management, corporate finance, and related advisory services. The Money Lending segment provides loan financing. The Securities Investment segment investing in listed and unlisted investments. The company also provides property investment, securities brokerage, fund management, and management services. The company's apparel supply chain management services include sourcing of raw materials and third-party manufacturers, sample creation, product design and development, production management, merchandising, quality control, logistics management, and social compliance monitoring for woven wear, such as shirts, pants, jeans, and jackets, as well as accessories. The company was formerly known as Hanbo Enterprises Holdings Limited and changed its name to SFund International Holdings Limited in December 2017. SFund International Holdings Limited was founded in 1991 and is based in Wanchai, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Apparel Retail", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "DKW.F": {"short_name": "BAUHAUS INTL HLDGS HD-,10", "long_name": "Bauhaus International (Holdings) Limited", "summary": "Bauhaus International (Holdings) Limited, an investment holding company, engages in the design and retail of apparel, bags, and fashion accessories for men and women. As of December 31, 2019, the company operated 21 stores in Mainland China and 65 stores/counters in Taiwan. It also sells its products through online channels. In addition, the company engages in the property holding activities; trading of garments and accessories; and provision of management services. The company was founded in 1991 and is headquartered in Kowloon Bay, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Apparel Retail", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Kowloon Bay"}, "ENMHF": {"short_name": "ENM HOLDINGS LTD", "long_name": "ENM Holdings Limited", "summary": "ENM Holdings Limited, an investment holding company, engages in the wholesale and retail of fashion wear and accessories. It operates through three segments: Wholesale and Retail of Fashion Wear and Accessories; Resort and Recreational Club Operations; and Investments. The company operates a chain of multi-label stores, as well as mono-brand boutiques under The Swank brand in Hong Kong and China; and Hilltop Country Club that provides conferences, dining, lodging, recreational, and outdoor activities for its members in Hong Kong; as well as offers menswear fashion products under the Cesare di Pino brand. It also holds and trades in investments for short term and long term investment returns. The company was formerly known as e-New Media Company Limited and changed its name to ENM Holdings Limited in June 2005. ENM Holdings Limited was incorporated in 1966 and is based in Tsuen Wan, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Apparel Retail", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Tsuen Wan"}, "GIO.F": {"short_name": "GIORDANO INTL  HD-,05", "long_name": "Giordano International Limited", "summary": "Giordano International Limited, an investment holding company, engages in the retail and distribution of men's, women's, and children's fashion apparel and accessories worldwide. It operates through two segments, Retail and Distribution; and Wholesales to Overseas Franchisees. The company sells its products under the Giordano, Giordano Junior, Giordano Ladies, BSX, and other owned and licensed brands through its own stores, as well as third party franchisees. As of December 31, 2019, the company operated a network of 2,375 stores. The company is also involved in the manufacture and retail of apparel and accessories; provision of management services; and licensing of trademarks. Giordano International Limited was founded in 1981 and is based in Kowloon, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Apparel Retail", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Kowloon"}, "ITJ.F": {"short_name": "IT LTD  HD-,10", "long_name": "I.T Limited", "summary": "I.T Limited, an investment holding company, retails and trades in fashion wear and accessories. It operates multi-brand stores and single-brand shops, which offer men's and women's ready-to-wear casual wear, footwear, and accessories. The company's brands include A Bathing Ape, AAPE, izzue, b+ab, 5cm, fingercroxx, CHOCOOLATE, MUSIUM DIV., and Venilla suite; and licensed brands comprise MLB, as know as de Rue, and X-Large. It operates a retail network of approximately 790 self-managed retail stores in Hong Kong, Mainland China, Taiwan, Macau, Japan, and the United States, as well as franchised stores in France, Thailand, England, Singapore, Indonesia, South Korea, Canada, Saudi Arabia, Russia, and Dubai. The company also provides administrative and financing services; and retails food and beverages, eyewear, and chocolates and cakes. I.T Limited was founded in 1988 and is headquartered in Wong Chuk Hang, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Apparel Retail", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wong Chuk Hang"}, "YMP3.F": {"short_name": "SYMPHONY HLDGS  HD -,10", "long_name": "Symphony Holdings Limited", "summary": "Symphony Holdings Limited, an investment holding company, primarily operates as a retailing company. The company is involved in the retailing and provision of sourcing services for branded apparel, swimwear, and accessories; manufacturing and trading of healthcare products; and development and management of PONY and SKINS trademarks. It also manages and operates outlet malls, duty free shops, and fashion stores; and provides financial services, including securities brokerage, margin financing, underwriting and placing, financial consulting, and money lending services. In addition, the company offers information, technology, corporate, and portfolio management services; accountancy, legal, secretarial, and cruiser services; and online trading platform support services. Further, it engages in the trading, retailing, and distribution of swimming apparel and accessories; property investment and holding activities; holding of club debentures; sub-licensing of trademark rights; and trading and wholesaling of sportswear. Symphony Holdings Limited operates in the People's Republic of China, Hong Kong, other Asian countries, the United States, and internationally. The company was formerly known as Liang Shing (Holdings) Limited and changed its name to Symphony Holdings Limited in 1997. Symphony Holdings Limited was founded in 1990 and is base in North Point, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Apparel Retail", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "North Point"}}