{"ALTB": {"short_name": "ALPINE AUTO BROKERS INC", "long_name": "Balincan International Inc.", "summary": "Balincan International Inc., through its subsidiary, BKG International Limited, operates a retail shop that sells skincare and cosmetic products in Hong Kong and China. The company's skincare and cosmetic products include skin lotions, cleansers, toners, eye creams, moisturizers, and lipsticks. It also engages in the online business, which sells consumer products, such as skincare and cosmetic products, as well as milk powder, organic honey, health and beauty food, hair care, and baby care products for the female and family markets. The company was formerly known as Alpine Auto Brokers, Inc. and changed its name to Balincan International Inc. in July 2016. Balincan International Inc. was founded in 2010 and is based in Kowloon, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Auto & Truck Dealerships", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Kowloon"}, "T15.SI": {"short_name": "h TCIL HK$", "long_name": "Tan Chong International Limited", "summary": "Tan Chong International Limited, an investment holding company, distributes and retails motor vehicles in Singapore, Malaysia, the People's Republic of China, the Philippines, Cambodia, Vietnam, Thailand, Japan, and internationally. The company distributes various models of Nissan and Subaru passenger cars; and Nissan light commercial vehicles. It also distributes heavy commercial vehicles and industrial equipment, including Nissan forklift trucks, as well as auto spare parts. In addition, the company engages in the rental of machinery and provision of workshop services; trading of used cars; and investment, development, and sale of properties. Further, it manufactures vehicle seats; and provides vehicle transportation and maintenance, cargo logistics, human resource, hire purchase financing, leasing, and insurance agency services. The company was founded in 1957 and is based in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Auto & Truck Dealerships", "exchange": "SES", "market": "sg_market", "country": "Hong Kong", "city": "Wan Chai"}}