{
    "0551.HK": {
        "short_name": "YUE YUEN IND",
        "long_name": "Yue Yuen Industrial (Holdings) Limited",
        "summary": "Yue Yuen Industrial (Holdings) Limited, an investment holding company, engages in manufacturing, marketing, and retailing athletic footwear, athletic leisure footwear, and casual and outdoor footwear in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. It operates as an original design manufacturer/original equipment manufacturer for various international brand names, such as adidas, Asics, Converse, New Balance, Nike, Puma, Reebok, Salomon, and Timberland, as well as retails and distributes sportswear and apparel products. The company engages in the manufacture and sale of leather products, apparels, and sports sandals, as well as soles, components, and others. As of December 31, 2020, it had 5,240 directly operated stores and 3,835 stores operated by sub-distributors in the Greater China region. The company was founded in 1969 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.yueyuen.com",
        "market_cap": "Mid Cap"
    },
    "0676.HK": {
        "short_name": "PEGASUS INT'L",
        "long_name": "Pegasus International Holdings Limited",
        "summary": "Pegasus International Holdings Limited, an investment holding company, manufactures, trades in, and sells footwear in the North America, Asia, Europe, and internationally. It operates through Manufacture and Sales of Footwear Products; and Lease of Properties segments. The company offers fashion and outdoor casual, skateboard, aqua sport, athletic, and golf shoes, as well as hiking and snow-board boots, sports sandals, and slippers for man, woman, and child. It also engages in the manufacture and trading of footwear materials; and leasing of investment properties. The company was founded in 1956 and is headquartered in Kowloon, Hong Kong. Pegasus International Holdings Limited is a subsidiary of Pegasus Footgear Management Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.pegasusinternationalholdings.com",
        "market_cap": "Small Cap"
    },
    "0738.HK": {
        "short_name": "LE SAUNDA",
        "long_name": "Le Saunda Holdings Limited",
        "summary": "Le Saunda Holdings Limited, an investment holding company, manufactures and sells footwear and accessories in Mainland China, Hong Kong, and Macau. It designs, develops, manufactures, and retails ladies' and men's footwear, handbags, and fashionable accessories under the le saunda, le saunda MEN, LINEA ROSA, PITTI DONNA, and CNE brand names. The company also sells its products through online. As of February 29, 2020, it operated 441 stores. In addition, the company is involved in the property holding business; provision of management services; holding and licensing of trade-marks and names; and wholesale and trading of shoes. Le Saunda Holdings Limited was founded in 1977 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.lesaunda.com.hk",
        "market_cap": "Small Cap"
    },
    "1023.HK": {
        "short_name": "SITOY GROUP",
        "long_name": "Sitoy Group Holdings Limited",
        "summary": "Sitoy Group Holdings Limited, an investment holding company, designs, researches, develops, manufactures, sells, wholesale, and retails handbags, small leather goods, travel goods, and footwear under the TUSCAN'S, Fashion & Joy, Kenneth Cole, and Cole Haan brands. It operates in three segments: Retail, Manufacturing, and Property Investment. The company offers travel luggage and business accessories. It also provides advertising and marketing services; and invests in office spaces. In addition, the company provides treasury management services; acts as a trade agency; and operates shops, boutiques, and department stores. Further, it is involved in online sale of leather goods, clothing and accessories, and goods for daily use; retail and wholesale of shoes, clothes, belts, stationaries, glasses, bags, and other fashion products. The company offers its products in Mainland China, Hong Kong, Macau, Taiwan, North America, Europe, other Asian countries, and internationally. Sitoy Group Holdings Limited was founded in 1968 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.sitoy.com",
        "market_cap": "Small Cap"
    },
    "1028.HK": {
        "short_name": "C.BANNER",
        "long_name": "C.banner International Holdings Limited",
        "summary": "C.banner International Holdings Limited, an investment holding company, manufactures, sells, and retails women's formal and casual footwear primarily in the People's Republic of China, the United Kingdom, and the United States. The company operates through three segments: Retail and Wholesale of Shoes, Contract Manufacturing of Shoes, and Retail of Toys. It also acts as the OEM or ODM manufacturer for shoes companies in export markets, as well as retailer of toys. The company offers its products under the self-developed brands, including C.banner, EBLAN, Sundance, MIO, Badgley Mischka, and Natursun, as well as under the licensed brands, such as United Nude and Steve Madden. The company distributes its self-developed and licensed brands products primarily through department stores and independent retail stores. The company was formerly known as Hongguo International Holdings Limited and changed its name to C.banner International Holdings Limited in February 2012. C.banner International Holdings Limited was founded in 1995 and is based in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.cbanner.com.cn",
        "market_cap": "Small Cap"
    },
    "1058.HK": {
        "short_name": "GUANGDONG TANN",
        "long_name": "Guangdong Tannery Limited",
        "summary": "Guangdong Tannery Limited, an investment holding company, processes and sells semi-finished and finished leather in Mainland China. The company is also involved in leasing plant and machinery; processing cowhides; and trading leather. It serves leather product manufacturers primarily branded shoes manufacturers. The company was founded in 1995 and is based in Central, Hong Kong. Guangdong Tannery Limited is a subsidiary of GDH Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.gdtann.com.hk",
        "market_cap": "Small Cap"
    },
    "1100.HK": {
        "short_name": "MAINLAND HOLD",
        "long_name": "Mainland Headwear Holdings Limited",
        "summary": "Mainland Headwear Holdings Limited, an investment holding company, designs, manufactures, trades in, and distributes casual headwear products in the United States, Europe, the People's Republic of China, Hong Kong, and internationally. The company operates through Manufacturing Business and Trading Business segments. Its casual headwear products include baseball caps, bucket hats, winter caps, gatsby hats, headbands, and sun visors. The company also offers headwear products for sports and racing, lifestyle and fashion, fishing/hunting and golf, and corporate events; character and entertainment, and O.D.M. headwear products; and knitted and winter hats. In addition, it is involved in the trading of apparels and accessories; provision of digitizing services; property holding; and trading of machineries, fabric, and accessory materials, as well as e-commerce business. The company was founded in 1986 and is headquartered in Kowloon Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon Bay",
        "zipcode": null,
        "website": "http://www.mainland.com.hk",
        "market_cap": "Small Cap"
    },
    "1170.HK": {
        "short_name": "KINGMAKER",
        "long_name": "Kingmaker Footwear Holdings Limited",
        "summary": "Kingmaker Footwear Holdings Limited, an investment holding company, manufactures and sells footwear products in the United States, Europe, Asia, and internationally. The company's products include athletic footwear; lifestyle shoes, such as casual shoes, ath-leisure shoes, etc.; rugged footwear, including moutain climbing shoes, waterproof shoes, steel-toed shoes, hand-stitched shoes, boots, etc.; and children's shoes, such as boy's shoes, girl's shoes, infant shoes, etc. It also engages in the business of property holding and the provision of administrative services. Kingmaker Footwear Holdings Limited was founded in 1980 and is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.kingmaker-footwear.com",
        "market_cap": "Small Cap"
    },
    "1386.HK": {
        "short_name": "VESTATE GROUP",
        "long_name": "Vestate Group Holdings Limited",
        "summary": "Vestate Group Holdings Limited, an investment holding company, engages in the production and retail of footwear products in Hong Kong, the People's Republic of China, and Taiwan. The company sells products under the ARTEMIS, COUBER.G, FORLERIA, A+A2, TRU-NARI, MY WALKER, and WALACI brands through its self-managed retail shops and e-commerce platforms. It also provides financial services, including money lending and other financial services to institutional and retail clients; and renders franchises and management services to convenience stores. In addition, the company is involved in the e-commerce and e-payment business; holding of trademarks; trading and investment; corporate secretary; information technology; and sales and marketing activities. The company was formerly known as Walker Group Holdings Limited and changed its name to Vestate Group Holdings Limited in February 2017. Vestate Group Holdings Limited was incorporated in 2006 and is headquartered in Kowloon Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon Bay",
        "zipcode": null,
        "website": "http://www.vestategroup.com",
        "market_cap": "Small Cap"
    },
    "1731.HK": {
        "short_name": "PROSPEROUS IND",
        "long_name": "Prosperous Industrial (Holdings) Limited",
        "summary": "Prosperous Industrial (Holdings) Limited, an investment holding company, designs, develops, manufactures, and sells recreational bags and packs. Its products include luggage bags, sport bags, laptop cases, and cosmetic bags. The company also trades in and retails sport bags, handbags, and luggage bags; and provides supply chain management services for sports and lifestyle brands. It has operations in the United States, Mainland China, Belgium, Japan, the Netherlands, Hong Kong, and internationally. The company was founded in 1970 and is headquartered in Kwai Chung, Hong Kong. Prosperous Industrial (Holdings) Limited is a subsidiary of Prosperous Holdings (Overseas) Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.pihl.hk",
        "market_cap": "Small Cap"
    },
    "1836.HK": {
        "short_name": "STELLA HOLDINGS",
        "long_name": "Stella International Holdings Limited",
        "summary": "Stella International Holdings Limited designs, develops, manufactures, sells, and retails footwear products and leather goods for men and women. It operates in two segments, Manufacturing, and Footwear Retailing and Wholesaling segments. The company is involved in holding of intellectual property rights; and the provision of secretary and accounting services. It also engages in the sale of handbags. The company operates its stores under the Stella Luna and What For brands name. It operates in North America, the People's Republic of China, Europe, Asia, and internationally. The company was founded in 1982 and is based in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.stella.com.hk",
        "market_cap": "Small Cap"
    },
    "1842.HK": {
        "short_name": "GROWN UP GROUP",
        "long_name": "Grown Up Group Investment Holdings Limited",
        "summary": "Grown Up Group Investment Holdings Limited, together with its subsidiaries, develops, designs, manufactures, trades in, and sells bags and luggage products. It operates through Private Label Products and Branded Label Products segments. The company also provides product development and supply chain services for bags and luggage products. It sells its products under the Ellehammer brand name primarily for kids, teen, sports, leisure, business, travel, and technical segments, as well as under the licensed brands. The company also serves private label customers, distributors, wholesalers, and retailers in Europe, North America, the Peoples Republic of China, the Middle East, and internationally. The company was founded in 1989 and is headquartered in Tai Po, Hong Kong. Grown Up Group Investment Holdings Limited is a subsidiary of GP Group investment Holding Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tai Po",
        "zipcode": null,
        "website": "http://www.grown-up.com",
        "market_cap": "Small Cap"
    },
    "2683.HK": {
        "short_name": "WAHSUN HANDBAGS",
        "long_name": "Wah Sun Handbags International Holdings Limited",
        "summary": "Wah Sun Handbags International Holdings Limited, an investment holding company, manufactures and trades in non-leather hand-bag products in the United States, Spain, and internationally. Its hand-bag products are made of PU, PVC, and various textile materials. The company was founded in 1989 and is headquartered in Shatin, Hong Kong. Wah Sun Handbags International Holdings Limited is a subsidiary of Wah Sun International Holdings Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://www.wahsun.com.hk",
        "market_cap": "Small Cap"
    },
    "8187.HK": {
        "short_name": "JIMU GROUP",
        "long_name": "Jimu Group Limited",
        "summary": "Jimu Group Limited, an investment holding company, designs, develops, sources, markets, and sells footwear and apparel to wholesalers and retailers in Hong Kong, the People's Republic of China, Australia, the United Kingdom, New Zealand, Belgium, the United Arab Emirates, the United States, Chile, and internationally. It operates through Footwear and Apparel Businesses, and Loan Facilitation and Credit Assessment Services segments. The company offers formal and casual footwear for men, women, and children, as well as provides logistics management services. In addition, it provides pre-loan and post-loan facilitation services, which assist the qualified borrowers to obtain financing from various financial institutions or investors who have registered with online information intermediary service platforms. The company's pre-loan and post-loan facilitation services comprise business consulting, credit assessment services, and repayment management services. The company was formerly known as Ever Smart International Holdings Limited and changed its name to Jimu Group Limited in February 2018. The company was founded in 2009 and is headquartered in Central, Hong Kong. Jimu Group Limited is a subsidiary of Jimu Group Holdings Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.jimugroup.hk",
        "market_cap": "Small Cap"
    },
    "8285.HK": {
        "short_name": "SLING GROUP",
        "long_name": "Sling Group Holdings Limited",
        "summary": "Sling Group Holdings Limited, an investment holding company, designs, sources, procures, promotes, and sells women's handbags, small leather goods, luggage products, and travel goods in the People's Republic of China. The company provides handle bags, clutch bags, wallets, coin cases, card holders, and suitcases under the ELLE, and Jessie & Jane brands. It also wholesales and retails clothes and accessories. The company offers its products to end customers through 1 self-operated store and 27 offline retail points; and third party retailers, as well as through online platforms. It also exports its products. The company was founded in 1999 and is headquartered in Kwun Tong, Hong Kong. Sling Group Holdings Limited is a subsidiary of Yen Sheng Investment Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.sling-inc.com.hk",
        "market_cap": "Small Cap"
    },
    "8SY.F": {
        "short_name": "SITOY GROUP HLDGS  HD-,10",
        "long_name": "Sitoy Group Holdings Limited",
        "summary": "Sitoy Group Holdings Limited, an investment holding company, designs, researches, develops, manufactures, sells, wholesale, and retails handbags, small leather goods, travel goods, and footwear under the TUSCAN'S, Fashion & Joy, Kenneth Cole, and Cole Haan brands. It operates in three segments: Retail, Manufacturing, and Property Investment. The company offers travel luggage and business accessories. It also provides advertising and marketing services; and invests in office spaces. In addition, the company provides treasury management services; acts as a trade agency; and operates shops, boutiques, and department stores. Further, it is involved in online sale of leather goods, clothing and accessories, and goods for daily use; retail and wholesale of shoes, clothes, belts, stationaries, glasses, bags, and other fashion products. The company offers its products in Mainland China, Hong Kong, Macau, Taiwan, North America, Europe, other Asian countries, and internationally. Sitoy Group Holdings Limited was founded in 1968 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.sitoy.com",
        "market_cap": "Small Cap"
    },
    "ATYM": {
        "short_name": "ASIA TIME CORP",
        "long_name": "Asia Time Corporation",
        "summary": "Asia Time Corporation, together with its subsidiaries, distributes watch movements components used in the manufacture and assembly of watches. It also designs watches for manufacturers and exporters of watches, as well as manufactures and distributes watches primarily to Internet marketers. In addition, the company provides a range of value-added services, including automated inventory management services; and integration, design, development, management, and extended and post-sale support services. It serves wholesalers, and medium-to-large sized watch manufacturers that produce watches for consumer sale primarily in Hong Kong and China. The company was founded in 2001 and is based in Kowloon, Hong Kong.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "CHSH": {
        "short_name": "CHINA SHOE HOLDINGS INC",
        "long_name": "China Shoe Holdings, Inc.",
        "summary": "China Shoe Holdings, Inc., through its subsidiaries, engages in the development, manufacture, and sale of proprietary additives; and marketing and trading of biodegradable food containers and packaging products in North America, Asia, Europe, and internationally. It offers plates, bowls, trays, lunch boxes, and mini containers used in the foodservice disposable packaging market, including quick-service restaurants, food and facilities management companies, governments, universities/colleges, and retail operations. The company markets and sells its product line to foodservice distributors through its in-house direct sales force. China Shoe Holdings, Inc. is based in Kwun Tong, Hong Kong.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "KMSWF": {
        "short_name": "KINGMAKER FOOTWEAR HLDGS",
        "long_name": "Kingmaker Footwear Holdings Limited",
        "summary": "Kingmaker Footwear Holdings Limited, an investment holding company, manufactures and sells footwear products in the United States, Europe, Asia, and internationally. The company's products include athletic footwear; lifestyle shoes, such as casual shoes, ath-leisure shoes, etc.; rugged footwear, including moutain climbing shoes, waterproof shoes, steel-toed shoes, hand-stitched shoes, boots, etc.; and children's shoes, such as boy's shoes, girl's shoes, infant shoes, etc. It also engages in the business of property holding and the provision of administrative services. Kingmaker Footwear Holdings Limited was founded in 1980 and is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.kingmaker-footwear.com",
        "market_cap": "Small Cap"
    },
    "P5C.F": {
        "short_name": "POU SHENG INTL HLD.HD-,25",
        "long_name": "Pou Sheng International (Holdings) Limited",
        "summary": "Pou Sheng International (Holdings) Limited, an investment holding company, engages in retailing sportswear in the People's Republic of China. It is involved in the distribution and retail of sportswear and footwear products; and lease of commercial spaces to retailers and distributors for concessionaire sales. The company also distributes licensed products; and manufactures sportswear. In addition, it is involved in the property leasing and management activities; organization of sports events; and provision of sports services. As of December 31, 2020, it had 5,240 directly operated stores and 3,835 sub-distributor stores. The company was founded in 1992 and is based in Kwun Tong, Hong Kong. Pou Sheng International (Holdings) Limited is a subsidiary of Major Focus Management Limited.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.pousheng.com",
        "market_cap": "Small Cap"
    },
    "YUE1.F": {
        "short_name": "YUE YUEN IND.HLDGS HD-,25",
        "long_name": "Yue Yuen Industrial (Holdings) Limited",
        "summary": "Yue Yuen Industrial (Holdings) Limited, an investment holding company, engages in manufacturing, marketing, and retailing athletic footwear, athletic leisure footwear, and casual and outdoor footwear in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. It operates as an original design manufacturer/original equipment manufacturer for various international brand names, such as adidas, Asics, Converse, New Balance, Nike, Puma, Reebok, Salomon, and Timberland, as well as retails and distributes sportswear and apparel products. The company engages in the manufacture and sale of leather products, apparels, and sports sandals, as well as soles, components, and others. As of December 31, 2020, it had 5,240 directly operated stores and 3,835 stores operated by sub-distributors in the Greater China region. The company was founded in 1969 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.yueyuen.com",
        "market_cap": "Mid Cap"
    },
    "YUEIF": {
        "short_name": "YUE YUEN INDUSTRIAL HLDGS",
        "long_name": "Yue Yuen Industrial (Holdings) Limited",
        "summary": "Yue Yuen Industrial (Holdings) Limited, an investment holding company, engages in manufacturing, marketing, and retailing athletic footwear, athletic leisure footwear, and casual and outdoor footwear in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. It operates as an original design manufacturer/original equipment manufacturer for various international brand names, such as adidas, Asics, Converse, New Balance, Nike, Puma, Reebok, Salomon, and Timberland, as well as retails and distributes sportswear and apparel products. The company engages in the manufacture and sale of leather products, apparels, and sports sandals, as well as soles, components, and others. As of December 31, 2020, it had 5,240 directly operated stores and 3,835 stores operated by sub-distributors in the Greater China region. The company was founded in 1969 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.yueyuen.com",
        "market_cap": "Mid Cap"
    },
    "YUEIY": {
        "short_name": "YUE YUEN INDUSTRIAL HLDGS",
        "long_name": "Yue Yuen Industrial (Holdings) Limited",
        "summary": "Yue Yuen Industrial (Holdings) Limited, an investment holding company, engages in manufacturing, marketing, and retailing athletic footwear, athletic leisure footwear, and casual and outdoor footwear in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. It operates as an original design manufacturer/original equipment manufacturer for various international brand names, such as adidas, Asics, Converse, New Balance, Nike, Puma, Reebok, Salomon, and Timberland, as well as retails and distributes sportswear and apparel products. The company engages in the manufacture and sale of leather products, apparels, and sports sandals, as well as soles, components, and others. As of December 31, 2020, it had 5,240 directly operated stores and 3,835 stores operated by sub-distributors in the Greater China region. The company was founded in 1969 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.yueyuen.com",
        "market_cap": "Mid Cap"
    }
}