{"0551.HK": {"short_name": "YUE YUEN IND", "long_name": "Yue Yuen Industrial (Holdings) Limited", "summary": "Yue Yuen Industrial (Holdings) Limited, an investment holding company, engages in manufacturing, marketing, and retailing athletic footwear, athletic style leisure footwear, and casual and outdoor footwear in the People's Republic of China, the United States, Europe, and internationally. It operates as an original design manufacturer/original equipment manufacturer for various international brand names, such as adidas, Asics, Converse, New Balance, Nike, Puma, Reebok, Salomon, and Timberland, as well as retails and distributes sportswear and apparel products. The company engages in the manufacture and sale of leather products, apparels, and sports sandals, as well as soles, components, and others; distribution of licensed products; and property leasing and management activities. The company was founded in 1969 and is headquartered in Kwun Tong, Hong Kong. Yue Yuen Industrial (Holdings) Limited operates as a subsidiary of Pou Chen Corporation.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kwun Tong"}, "0738.HK": {"short_name": "LE SAUNDA", "long_name": "Le Saunda Holdings Limited", "summary": "Le Saunda Holdings Limited, an investment holding company, manufactures and sells footwear and accessories in Mainland China, Hong Kong, and Macau. It designs, develops, manufactures, and retails ladies' and men's footwear, handbags, and fashionable accessories under the le saunda, le saunda MEN, LINEA ROSA, PITTI DONNA, and CNE brand names. The company also sells its products through online. As of February 29, 2020, it operated 441 stores. In addition, the company is involved in the property holding business; provision of management services; holding and licensing of trade-marks and names; and wholesale and trading of shoes. Le Saunda Holdings Limited was founded in 1977 and is headquartered in Quarry Bay, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Quarry Bay"}, "1023.HK": {"short_name": "SITOY GROUP", "long_name": "Sitoy Group Holdings Limited", "summary": "Sitoy Group Holdings Limited, an investment holding company, designs, researches, develops, manufactures, sells, wholesale, and retails handbags, small leather goods, travel goods, and footwear under the TUSCAN'S, Fashion & Joy, Kenneth Cole, and Cole Haan brands. It operates in three segments: Retail, Manufacturing, and Property Investment. The company offers travel luggage and business accessories. It also provides advertising and marketing services; and invests in office spaces. In addition, the company provides treasury management services; acts as a trade agency; and operates shops, boutiques, and department stores. Further, it is involved in online sale of leather goods, clothing and accessories, and goods for daily use; retail and wholesale of shoes, clothes, belts, stationaries, glasses, bags, and other fashion products. The company offers its products in Mainland China, Hong Kong, Macau, Taiwan, North America, Europe, other Asian countries, and internationally. Sitoy Group Holdings Limited was founded in 1968 and is headquartered in Kwun Tong, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kwun Tong"}, "1058.HK": {"short_name": "GUANGDONG TANN", "long_name": "Guangdong Tannery Limited", "summary": "Guangdong Tannery Limited, an investment holding company, processes and sells semi-finished and finished leather in Mainland China. The company is also involved in leasing plant and machinery; processing cowhides; and trading leather. It serves leather product manufacturers primarily branded shoes manufacturers. The company was founded in 1995 and is based in Central, Hong Kong. Guangdong Tannery Limited is a subsidiary of GDH Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "1100.HK": {"short_name": "MAINLAND HOLD", "long_name": "Mainland Headwear Holdings Limited", "summary": "Mainland Headwear Holdings Limited, an investment holding company, designs, manufactures, trades in, and distributes casual headwear products in the United States, Europe, the People's Republic of China, Hong Kong, and internationally. The company operates through Manufacturing Business and Trading Business segments. Its casual headwear products include baseball caps, bucket hats, winter caps, gatsby hats, headbands, and sun visors. The company also offers headwear products for sports and racing, lifestyle and fashion, fishing/hunting and golf, and corporate events; character and entertainment, and O.D.M. headwear products; and knitted and winter hats. In addition, it is involved in the trading of apparels and accessories; provision of digitizing, research and development, quality control, and administrative services; property holding; and trading of machineries, fabric, and accessory materials, as well as e-commerce business. The company was founded in 1986 and is headquartered in Kowloon Bay, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kowloon Bay"}, "1170.HK": {"short_name": "KINGMAKER", "long_name": "Kingmaker Footwear Holdings Limited", "summary": "Kingmaker Footwear Holdings Limited, an investment holding company, manufactures and sells footwear products in the United States, Europe, Asia, and internationally. The company's products include athletic footwear; lifestyle shoes, such as casual shoes, ath-leisure shoes, etc.; rugged footwear, including moutain climbing shoes, waterproof shoes, steel-toed shoes, hand-stitched shoes, boots, etc.; and children's shoes, such as boy's shoes, girl's shoes, infant shoes, etc. It also engages in the business of property holding and the provision of administrative services. Kingmaker Footwear Holdings Limited was founded in 1980 and is headquartered in Tsim Sha Tsui, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Tsim Sha Tsui"}, "1386.HK": {"short_name": "VESTATE GROUP", "long_name": "Vestate Group Holdings Limited", "summary": "Vestate Group Holdings Limited, an investment holding company, engages in the production and retail of footwear products in Hong Kong, the People's Republic of China, and Taiwan. The company sells products under the ARTEMIS, COUBER.G, FORLERIA, A+A2, TRU-NARI, MY WALKER, and WALACI brands through its self-managed retail shops and e-commerce platforms. It also provides financial services, including money lending and other financial services to institutional and retail clients; and renders franchises and management services to convenience stores. In addition, the company is involved in the e-commerce and e-payment business; holding of trademarks; trading and investment; corporate secretary; information technology; and sales and marketing activities. The company was formerly known as Walker Group Holdings Limited and changed its name to Vestate Group Holdings Limited in February 2017. Vestate Group Holdings Limited was incorporated in 2006 and is headquartered in Kowloon Bay, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kowloon Bay"}, "1842.HK": {"short_name": "GROWN UP GROUP", "long_name": "Grown Up Group Investment Holdings Limited", "summary": "Grown Up Group Investment Holdings Limited, together with its subsidiaries, develops, designs, manufactures, trades in, and sells bags and luggage products. It operates through Private Label Products and Branded Label Products segments. The company also provides product development and supply chain services for bags and luggage products. It sells its products under the Ellehammer brand name primarily for kids, teen, sports, leisure, business, travel, and technical segments, as well as under the licensed brands. The company also serves private label customers, distributors, wholesalers, and retailers in Europe, North America, the Peoples Republic of China, the Middle East, and internationally. The company was founded in 1989 and is headquartered in Tai Po, Hong Kong. Grown Up Group Investment Holdings Limited is a subsidiary of GP Group investment Holding Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Tai Po"}, "2683.HK": {"short_name": "WAHSUN HANDBAGS", "long_name": "Wah Sun Handbags International Holdings Limited", "summary": "Wah Sun Handbags International Holdings Limited, an investment holding company, manufactures and trades in non-leather hand-bag products in the United States, Spain, and internationally. Its hand-bag products are made of PU, PVC, and various textile materials. The company was founded in 1989 and is headquartered in Shatin, Hong Kong. Wah Sun Handbags International Holdings Limited is a subsidiary of Wah Sun International Holdings Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Sha Tin"}, "3813.HK": {"short_name": "POU SHENG INT'L", "long_name": "Pou Sheng International (Holdings) Limited", "summary": "Pou Sheng International (Holdings) Limited, an investment holding company, engages in retailing sportswear in the People's Republic of China. It is involved in the retail and distribution of sportswear products, including footwear; and lease of commercial spaces to retailers and distributors for concessionaire sales. The company also distributes licensed products; and manufactures sportswear. In addition, the company is involved in the property leasing and management activities; organisation of sports events; and provision of sports services. As of December 31, 2019, it had 5,883 directly operated stores and 3,950 sub-distributor stores. The company is based in Kwun Tong, Hong Kong. Pou Sheng International (Holdings) Limited is a subsidiary of Major Focus Management Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kwun Tong"}, "8187.HK": {"short_name": "JIMU GROUP", "long_name": "Jimu Group Limited", "summary": "Jimu Group Limited, an investment holding company, designs, develops, sources, markets, and sells footwear to wholesalers and retailers in Hong Kong, the People's Republic of China, Australia, the United Kingdom, New Zealand, Belgium, the United Arab Emirates, the United States, Chile, and internationally. It operates through Footwear Business and Loan Facilitation Service segments. The company offers formal and casual footwear for men, women, and children, as well as provides logistics management services. In addition, it provides loan facilitation services, which assist the qualified borrowers to obtain financing from various financial institutions or investors who have registered with online information intermediary service platforms. The company's pre-loan and post-loan facilitation services comprise business consulting and credit assessment services. As of December 31, 2019, it offered its loan facilitation services to individual customers through approximately 50 branch offices in the People's Republic of China. The company was formerly known as Ever Smart International Holdings Limited and changed its name to Jimu Group Limited in February 2018. The company was founded in 2009 and is headquartered in Central, Hong Kong. Jimu Group Limited is a subsidiary of Jimu Group Holdings Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "8285.HK": {"short_name": "SLING GROUP", "long_name": "Sling Group Holdings Limited", "summary": "Sling Group Holdings Limited, an investment holding company, designs, sources, procures, promotes, and sells women's handbags, small leather goods, luggage products, and travel goods in the People's Republic of China. The company provides handle bags, clutch bags, wallets, coin cases, card holders, and suitcases under the ELLE, and Jessie & Jane brands. It also wholesales and retails clothes and accessories. The company offers its products to end customers through 3 self-operated stores and 86 offline retail points; and 35 third party retailers, as well as through online platforms. It also exports its products. The company was founded in 1999 and is headquartered in Kwun Tong, Hong Kong. Sling Group Holdings Limited is a subsidiary of Yen Sheng Investment Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kwun Tong"}, "8SY.F": {"short_name": "SITOY GROUP HLDGS  HD-,10", "long_name": "Sitoy Group Holdings Limited", "summary": "Sitoy Group Holdings Limited, an investment holding company, designs, researches, develops, manufactures, sells, wholesale, and retails handbags, small leather goods, travel goods, and footwear under the TUSCAN'S, Fashion & Joy, Kenneth Cole, and Cole Haan brands. It operates in three segments: Retail, Manufacturing, and Property Investment. The company offers travel luggage and business accessories. It also provides advertising and marketing services; and invests in office spaces. In addition, the company provides treasury management services; acts as a trade agency; and operates shops, boutiques, and department stores. Further, it is involved in online sale of leather goods, clothing and accessories, and goods for daily use; retail and wholesale of shoes, clothes, belts, stationaries, glasses, bags, and other fashion products. The company offers its products in Mainland China, Hong Kong, Macau, Taiwan, North America, Europe, other Asian countries, and internationally. Sitoy Group Holdings Limited was founded in 1968 and is headquartered in Kwun Tong, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Kwun Tong"}, "CHSH": {"short_name": "CHINA SHOE HOLDINGS INC", "long_name": "China Shoe Holdings, Inc.", "summary": "China Shoe Holdings, Inc., through its subsidiaries, engages in the development, manufacture, and sale of proprietary additives; and marketing and trading of biodegradable food containers and packaging products in North America, Asia, Europe, and internationally. It offers plates, bowls, trays, lunch boxes, and mini containers used in the foodservice disposable packaging market, including quick-service restaurants, food and facilities management companies, governments, universities/colleges, and retail operations. The company markets and sells its product line to foodservice distributors through its in-house direct sales force. China Shoe Holdings, Inc. is based in Kwun Tong, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Kwun Tong"}, "KMSWF": {"short_name": "KINGMAKER FOOTWEAR HLDGS", "long_name": "Kingmaker Footwear Holdings Limited", "summary": "Kingmaker Footwear Holdings Limited, an investment holding company, manufactures and sells footwear products in the United States, Europe, Asia, and internationally. The company's products include athletic footwear; lifestyle shoes, such as casual shoes, ath-leisure shoes, etc.; rugged footwear, including moutain climbing shoes, waterproof shoes, steel-toed shoes, hand-stitched shoes, boots, etc.; and children's shoes, such as boy's shoes, girl's shoes, infant shoes, etc. It also engages in the business of property holding and the provision of administrative services. Kingmaker Footwear Holdings Limited was founded in 1980 and is headquartered in Tsim Sha Tsui, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Tsim Sha Tsui"}, "W4G.F": {"short_name": "VESTATE GP HOLDINGS LTD", "long_name": "Vestate Group Holdings Limited", "summary": "Vestate Group Holdings Limited, an investment holding company, engages in the production and retail of footwear products in Hong Kong, the People's Republic of China, and Taiwan. The company sells products under the ARTEMIS, COUBER.G, FORLERIA, A+A2, TRU-NARI, MY WALKER, and WALACI brands through its self-managed retail shops and e-commerce platforms. It also provides financial services, including money lending and other financial services to institutional and retail clients; and renders franchises and management services to convenience stores. In addition, the company is involved in the e-commerce and e-payment business; holding of trademarks; trading and investment; corporate secretary; information technology; and sales and marketing activities. The company was formerly known as Walker Group Holdings Limited and changed its name to Vestate Group Holdings Limited in February 2017. Vestate Group Holdings Limited was incorporated in 2006 and is headquartered in Kowloon Bay, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Kowloon Bay"}, "YUE1.F": {"short_name": "YUE YUEN IND.HLDGS HD-,25", "long_name": "Yue Yuen Industrial (Holdings) Limited", "summary": "Yue Yuen Industrial (Holdings) Limited, an investment holding company, engages in manufacturing, marketing, and retailing athletic footwear, athletic style leisure footwear, and casual and outdoor footwear in the People's Republic of China, the United States, Europe, and internationally. It operates as an original design manufacturer/original equipment manufacturer for various international brand names, such as adidas, Asics, Converse, New Balance, Nike, Puma, Reebok, Salomon, and Timberland, as well as retails and distributes sportswear and apparel products. The company engages in the manufacture and sale of leather products, apparels, and sports sandals, as well as soles, components, and others; distribution of licensed products; and property leasing and management activities. The company was founded in 1969 and is headquartered in Kwun Tong, Hong Kong. Yue Yuen Industrial (Holdings) Limited operates as a subsidiary of Pou Chen Corporation.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Kwun Tong"}, "YUEIF": {"short_name": "YUE YUEN INDUSTRIAL HLDGS", "long_name": "Yue Yuen Industrial (Holdings) Limited", "summary": "Yue Yuen Industrial (Holdings) Limited, an investment holding company, engages in manufacturing, marketing, and retailing athletic footwear, athletic style leisure footwear, and casual and outdoor footwear in the People's Republic of China, the United States, Europe, and internationally. It operates as an original design manufacturer/original equipment manufacturer for various international brand names, such as adidas, Asics, Converse, New Balance, Nike, Puma, Reebok, Salomon, and Timberland, as well as retails and distributes sportswear and apparel products. The company engages in the manufacture and sale of leather products, apparels, and sports sandals, as well as soles, components, and others; distribution of licensed products; and property leasing and management activities. The company was founded in 1969 and is headquartered in Kwun Tong, Hong Kong. Yue Yuen Industrial (Holdings) Limited operates as a subsidiary of Pou Chen Corporation.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Kwun Tong"}, "YUEIY": {"short_name": "YUE YUEN INDUSTRIAL HLDGS", "long_name": "Yue Yuen Industrial (Holdings) Limited", "summary": "Yue Yuen Industrial (Holdings) Limited, an investment holding company, engages in manufacturing, marketing, and retailing athletic footwear, athletic style leisure footwear, and casual and outdoor footwear in the People's Republic of China, the United States, Europe, and internationally. It operates as an original design manufacturer/original equipment manufacturer for various international brand names, such as adidas, Asics, Converse, New Balance, Nike, Puma, Reebok, Salomon, and Timberland, as well as retails and distributes sportswear and apparel products. The company engages in the manufacture and sale of leather products, apparels, and sports sandals, as well as soles, components, and others; distribution of licensed products; and property leasing and management activities. The company was founded in 1969 and is headquartered in Kwun Tong, Hong Kong. Yue Yuen Industrial (Holdings) Limited operates as a subsidiary of Pou Chen Corporation.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Kwun Tong"}}