{"1371.HK": {"short_name": "CHINA LOTSYN", "long_name": "China LotSynergy Holdings Limited", "summary": "China LotSynergy Holdings Limited, an investment holding company, provides technology and operation services for lottery systems, terminal equipment, and game products in the lottery market in the People's Republic of China and internationally. The company offers video lottery systems, computer-generated ticket games (CTG), and KENO-type lottery systems. It is also involved in the research, development, and manufacture of lottery ticket scanners and terminal equipment, as well as lottery systems and equipment; and research and development, processing, production, and sale of natural and health food. In addition, the company provides treasury management services, as well as develops lottery transaction and management systems. It provides its CTG terminals primarily to welfare lottery and sports lottery authorities. China LotSynergy Holdings Limited was incorporated in 2000 and is headquartered in Wanchai, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Gambling", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "8198.HK": {"short_name": "LOTO INTERACT", "long_name": "Loto Interactive Limited", "summary": "Loto Interactive Limited, an investment holding company, engages in the lottery business in the People's Republic of China. The company operates through three segments: Big Data Centre Services, Online Game Business, and Lottery Business. It provides lottery-related technologies, systems, and solutions to state-run lottery operators, including the China Welfare Lottery Issuance Centre and China Sports Lottery Administration Centre. The company distributes online mobile games; and trades in lottery terminals and parts, as well as provides services and solutions for the distribution of lottery products. It also offers data analysis, storage, and ancillary administrative and consulting services. The company was formerly known as MelcoLot Limited and changed its name to Loto Interactive Limited in September 2017. Loto Interactive Limited is headquartered in Central, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Gambling", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "MFNC.SG": {"short_name": "CENTURY ENT INTL HLDGS LTD", "long_name": "Century Entertainment International Holdings Limited", "summary": "Century Entertainment International Holdings Limited, an investment holding company, engages in the gaming and entertainment related businesses in Macau, Hong Kong, and the Kingdom of Cambodia. It operates through two segments, Gaming and Entertainment Related business, and AR/VR and Mobile Games Solutions. The company is involved in the operation of VIP rooms; and VIP gaming tables and slot machines related operations. It also develops mobile game and augmented reality/virtual reality applications for clients. The company was formerly known as Amax International Holdings Limited and changed its name to Century Entertainment International Holdings Limited in December 2019. Century Entertainment International Holdings Limited is headquartered in Wan Chai, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Gambling", "exchange": "STU", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "WOR1.F": {"short_name": "CHINA LOTSYN.SUB.HD-0,025", "long_name": "China LotSynergy Holdings Limited", "summary": "China LotSynergy Holdings Limited, an investment holding company, provides technology and operation services for lottery systems, terminal equipment, and game products in the lottery market in the People's Republic of China and internationally. The company offers video lottery systems, computer-generated ticket games (CTG), and KENO-type lottery systems. It is also involved in the research, development, and manufacture of lottery ticket scanners and terminal equipment, as well as lottery systems and equipment; and research and development, processing, production, and sale of natural and health food. In addition, the company provides treasury management services, as well as develops lottery transaction and management systems. It provides its CTG terminals primarily to welfare lottery and sports lottery authorities. China LotSynergy Holdings Limited was incorporated in 2000 and is headquartered in Wanchai, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Gambling", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}}