{"0136.HK": {"short_name": "HENGTEN NET", "long_name": "HengTen Networks Group Limited", "summary": "HengTen Networks Group Limited, an investment holding company, engages in internet community and related businesses in the People's Republic of China, Hong Kong, Europe, and internationally. It operates HengTen Mimi, a smart community services platform to support communities through its property services platform by providing support to property fee payment, event reporting, repair reporting, and community intelligentisation. The company is also involved in internet home furnishing business; and internet materials logistics business that covers building materials, furniture, customization, home appliances, and various soft decorations for consumers, small and medium-sized properties, and decoration companies. In addition, it invests and trades in securities; provides loan financing services; and manufactures, sells, and trades in accessories for photographic, electrical, and multimedia products. The company was formerly known as Mascotte Holdings Limited and changed its name to HengTen Networks Group Limited in October 2015. HengTen Networks Group Limited is headquartered in Wanchai, Hong Kong. HengTen Networks Group Limited is a subsidiary of China Evergrande Group.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Internet Retail", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "0620.HK": {"short_name": "DTXS SILK ROAD", "long_name": "DTXS Silk Road Investment Holdings Company Limited", "summary": "DTXS Silk Road Investment Holdings Company Limited, an investment holding company, engages in the arts and collections, auction, vineyard, and merchandise trading businesses in Hong Kong, Mainland China, Southeast Asia, the Middle East, rest of Europe, France, and internationally. The company operates through Arts and Cultural, Winery, and e-Commerce divisions. The Arts and Cultural division engages in the sale of antique, bronze mirrors, ancient coins, and jewelry items; and art financing and art central district business. The Winery division produces and sells wines and related products. The e-Commerce division trades in electronic devices, cosmetics, and other consumer products. It also engages in property investment and development activities. The company was formerly known as UDL Holdings Limited and changed its name to DTXS Silk Road Investment Holdings Company Limited in February 2016. The company was incorporated in 1991 and is headquartered in Central, Hong Kong. DTXS Silk Road Investment Holdings Company Limited is a subsidiary of Da Tang Xi Shi International Holdings Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Internet Retail", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "1QH.F": {"short_name": "TAKUNA ART NEW DL -,001", "long_name": "Takung Art Co., Ltd.", "summary": "Takung Art Co., Ltd., through its subsidiaries, operates an electronic online platform for artists, art dealers, and art investors to offer and trade in valuable artwork primarily in the People's Republic of China. Its electronic online platform is located at www.takungae.com. The company offers online listing and trading services that allow artists/art dealers/owners to access art trading market where they can engage with a range of investors. Its platform offers and trades in various artwork, such as calligraphy, paintings, sculptures, crafts, jade, jewelry, metal ware, ceramics, and antique furniture. The company serves traders, original owners, and offering agents. Takung Art Co., Ltd. was founded in 2012 and is headquartered in Tsim Sha Tsui, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Internet Retail", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Tsim Sha Tsui"}, "BCNN": {"short_name": "BALINCAN USA INC", "long_name": "Balincan USA, Inc.", "summary": "Balincan USA, Inc. operates an e-commerce platform. Its e-commerce platform sells beauty products to affluent female consumers utilizing its Â\u0091promotion trio' of WeChat, Apps, and videos on smartphones in the People's Republic of China. The company was formerly known as Moqizone Holding Corp. and changed its name to Balincan USA, Inc. in August 2015 to reflect its ongoing business operations. Balincan USA, Inc. is based in Hong Kong, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Internet Retail", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Hong Kong"}, "HKTVY": {"short_name": "HONG KONG TELEVISION NETWORK LT", "long_name": "Hong Kong Television Network Limited", "summary": "Hong Kong Television Network Limited, together with its subsidiaries, engages in the multimedia business in Hong Kong. The company is involved in the multimedia production, content distribution, and other multimedia related activities; and operation of e-shopping mall, providing a Â\u0091one-stop shop' platform, including online shopping and delivery services. It also engages in the property investment and trading activities; and provision of marketing and advertising management, and artistes' management and agency services. The company was formerly known as City Telecom (H.K.) Limited and changed its name to Hong Kong Television Network Limited in January 2013. Hong Kong Television Network Limited was founded in 1992 and is headquartered in Tseung Kwan O, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Internet Retail", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Tseung Kwan O"}, "NHTC": {"short_name": "Natural Health Trends Corp. - C", "long_name": "Natural Health Trends Corp.", "summary": "Natural Health Trends Corp., a direct-selling and e-commerce company, provides personal care, wellness, and lifestyle products under the NHT Global brand. The company offers wellness products, including liquid, encapsulated, tableted, and powder dietary and nutritional supplements, as well as vitamins and minerals; and herbal products comprising herbal supplements. It also provides beauty products, such as anti-aging and hydrating cleansers, creams, lotions, serums, and toners; lifestyle products, which include weight management, intimacy support, and energy enhancing supplements; and dietary supplement drink mixes. In addition, the company offers home and car appliances; and infant and toddler bath and body care products. It sells its products directly to consumers through an e-commerce retail platform in the United States, Canada, Cayman Islands, Mexico, Peru, Hong Kong, Taiwan, China, Singapore, Malaysia, Thailand, Vietnam, South Korea, Japan, India, Russia, Kazakhstan, and Europe. Natural Health Trends Corp. was founded in 1988 and is headquartered in Tsimshatsui, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Internet Retail", "exchange": "NCM", "market": "us_market", "country": "Hong Kong", "city": "Tsim Sha Tsui"}, "RTTO": {"short_name": "RITO GROUP CORP", "long_name": "Rito Group Corp.", "summary": "Rito Group Corp. engages in trading of retail goods in Hong Kong. It intends to operate Rito Online Mall, an online to offline platform that provides handmade accessories, deep-processed food products, cleansing and skin care products, brown rice drinks, natural spring water, dendrobium candidum, electric kettles and stainless cookware, necklaces, and watches. The company also offers agriculture technology consulting services. It operates five retail stores in Sheung Shui and Lai Chi Kok in Hong Kong; and Shenzhen, Dongguan, and Qingyuan in mainland China. The company was founded in 2014 and is based in Lai Chi Kok, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Internet Retail", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Lai Chi Kok"}, "TKAT": {"short_name": "Takung Art Co., Ltd.", "long_name": "Takung Art Co., Ltd.", "summary": "Takung Art Co., Ltd., through its subsidiaries, operates an electronic online platform for artists, art dealers, and art investors to offer and trade in valuable artwork primarily in the People's Republic of China. Its electronic online platform is located at www.takungae.com. The company offers online listing and trading services that allow artists/art dealers/owners to access art trading market where they can engage with a range of investors. Its platform offers and trades in various artwork, such as calligraphy, paintings, sculptures, crafts, jade, jewelry, metal ware, ceramics, and antique furniture. The company serves traders, original owners, and offering agents. Takung Art Co., Ltd. was founded in 2012 and is headquartered in Tsim Sha Tsui, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Internet Retail", "exchange": "ASE", "market": "us_market", "country": "Hong Kong", "city": "Tsim Sha Tsui"}, "XHNA.F": {"short_name": "HK TELEVIS.NETW.ADR HD-10", "long_name": "Hong Kong Television Network Limited", "summary": "Hong Kong Television Network Limited, together with its subsidiaries, engages in the multimedia business in Hong Kong. The company is involved in the multimedia production, content distribution, and other multimedia related activities; and operation of e-shopping mall, providing a Â\u0091one-stop shop' platform, including online shopping and delivery services. It also engages in the property investment and trading activities; and provision of marketing and advertising management, and artistes' management and agency services. The company was formerly known as City Telecom (H.K.) Limited and changed its name to Hong Kong Television Network Limited in January 2013. Hong Kong Television Network Limited was founded in 1992 and is headquartered in Tseung Kwan O, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Internet Retail", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Tseung Kwan O"}}