{
    "0114.HK": {
        "short_name": "HERALD HOLD",
        "long_name": "Herald Holdings Limited",
        "summary": "Herald Holdings Limited, an investment holding company, manufactures, sells, and distributes toys, computer products, housewares, clocks, watches, and electronic and gift products. The company offers a range of toys, including action figures, electronic radio-controlled toy cars and boats, electronic games, and pre-school toys; battery-operated and electronic toys, radio-controlled vehicles, transformers, and model kits and gift items; and housewares, such as non-stick aluminium cookware and aluminium hard anodized cookware products under the Pilot and Chefmate trademarks. It also provides computer products, including magnetic tape heads for computer storage drives, thin-film magnetic recording heads, and motor actuator assemblies, as well as smart connected devices for Internet of Things comprising thermostats and various connected sensor devices; and manufactures and sells watches under the Braun, Vivienne Westwood, and Lambretta brands. In addition, the company is involved in the property investment and leasing activities; provision of marketing services; and debt and equity securities, and managed funds investment activities. Herald Holdings Limited operates in Hong Kong, North America, the United Kingdom, rest of Europe, rest of Asia, Mainland China, and internationally. Herald Holdings Limited was incorporated in 1992 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.heraldgroup.com.hk",
        "market_cap": "Micro Cap"
    },
    "0180.HK": {
        "short_name": "KADER HOLDINGS",
        "long_name": "Kader Holdings Company Limited",
        "summary": "Kader Holdings Company Limited, an investment holding company, manufactures, trades in, and sells plastic, electronic, and stuffed toys and model trains in Hong Kong, Mainland China, North America, Europe, and internationally. It operates through three segments: Toys and Model Trains, Property Investment, and Investment Holding. The company produces model train locomotives; other hobby items comprising electronic slot racing cars and digital controls, as well as accessories, such as scenery, promotional cars, and trucks; and scale locomotives, coach cars, rolling stockcars, cabooses, and other accessories under the Bachmann brand. It also provides original design manufacture services in model railroads; offers engineering and design solutions comprising product design and development, mould design and development, and electronic and production process engineering; and designs and manufactures plush and educational toys for babies under the Tinco brand, as well as provides a range of original equipment manufacturing services. In addition, the company leases office premises and industrial buildings; and invests in and develops properties. Further, it invests in securities; provides management services; and manufactures and sells moulds, as well as operates as an agent for sale of toys. Additionally, the company engages in sub-letting a wine cellar. Kader Holdings Company Limited was founded in 1948 and is headquartered in Kowloon Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon Bay",
        "zipcode": null,
        "website": "http://www.kaderholdings.com",
        "market_cap": "Micro Cap"
    },
    "0209.HK": {
        "short_name": "WINSHINE SCI",
        "long_name": "Winshine Science Company Limited",
        "summary": "Winshine Science Company Limited, an investment holding company, manufactures and trades in hard and stuffed toys in Hong Kong, the United States, Mainland China, Japan, and Europe. The company operates through three segments: Securities Investments, Toys, and Medical and Health. It engages in the securities investment and trading activities; provision of credit finance and management services; property leasing activities; and research and development of medical and health technology solutions, as well as manufactures and sells beverage products. The company was formerly known as Winshine Entertainment & Media Holding Company Limited and changed its name to Winshine Science Company Limited in February 2016. Winshine Science Company is headquartered in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.winshine.com",
        "market_cap": "Nano Cap"
    },
    "0348.HK": {
        "short_name": "CHINAHEALTHWISE",
        "long_name": "China Healthwise Holdings Limited",
        "summary": "China Healthwise Holdings Limited, an investment holding company, engages in the sale of own brand toys. It also sells Chinese and other pharmaceutical products, health products, ginseng, and dried seafood products to wholesalers and retailers. In addition, the company invests in financial instruments; and lends money. It primarily operates in the United States, Canada, Europe, China, Australia, Hong Kong, and Indonesia. The company was formerly known as Haier Healthwise Holdings Limited and changed its name to China Healthwise Holdings Limited in January 2017. China Healthwise Holdings Limited is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.healthwisehk.com",
        "market_cap": "Nano Cap"
    },
    "0361.HK": {
        "short_name": "SINO GOLF HOLD",
        "long_name": "Sino Golf Holdings Limited",
        "summary": "Sino Golf Holdings Limited, an investment holding company, designs, develops, manufactures, and sells golf equipment, and related components and parts in Japan, North America, Europe, rest of Asia, and internationally. The company operates through Golf Equipment, Golf Bags, and Hospitality segments. It offers assembled and packaged golf clubs, club heads, shafts and golf bags, and accessories on an original equipment manufacturing and original design manufacturing basis to golf companies. The company also develops an integrated resort in Saipan. In addition, it trades in golf equipment, golf bags, and accessories, as well as related components and parts; and holds properties. The company was founded in 1988 and is based in Tsuen Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.sinogolf.com",
        "market_cap": "Micro Cap"
    },
    "0419.HK": {
        "short_name": "HUAYI TENCENT",
        "long_name": "Huayi Tencent Entertainment Company Limited",
        "summary": "Huayi Tencent Entertainment Company Limited, a media company, engages in the entertainment and media business in the People's Republic of China, Hong Kong, and internationally. It operates through two segments, Entertainment and Media Businesses; and Healthcare and Wellness Services. The company produces films, animations, and TV dramas, as well as invests in international entertainment companies. It is also involved in the licensing of films and TV dramas; advertising agency activities; and the provision of health and wellness services through operation of wellness center. In addition, the company engages in the hotel management business. The company was formerly known as China Jiuhao Health Industry Corporation Limited and changed its name to Huayi Tencent Entertainment Company Limited in May 2016. Huayi Tencent Entertainment Company Limited was incorporated in 2002 and is based in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.huayitencent.com",
        "market_cap": "Small Cap"
    },
    "0635.HK": {
        "short_name": "PLAYMATES",
        "long_name": "Playmates Holdings Limited",
        "summary": "Playmates Holdings Limited, an investment holding company, primarily engages in the creation, design, development, marketing, and distribution of toys in Hong Kong, the Americas, Europe, rest of the Asia Pacific, and internationally. It operates through three segments: Property Investments and Associated Businesses, Investment Business, and Toy Business. The Property Investments and Associated Businesses segment invests in and leases commercial, industrial, and residential premises for rent; provides property management services, such as repair and maintenance, building security, general cleaning for common areas, hand-over and take-over of premises, and the monitoring of reinstatement and refurbishment works; and operates restaurants. The Investment Business segment invests in financial instruments, including listed equity and managed funds. The Toy Business segment designs, develops, markets, and distributes toys and family entertainment activity products. The company was founded in 1966 and is based in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.playmates.net/eng/global/home.htm",
        "market_cap": "Micro Cap"
    },
    "0765.HK": {
        "short_name": "PERFECTECH INTL",
        "long_name": "Perfectech International Holdings Limited",
        "summary": "Perfectech International Holdings Limited, an investment holding company, manufactures and sells novelties, and festival decoration and toy products in Hong Kong, other Asian countries, Europe, the United States, and internationally. It also manufactures and distributes molds; and provides management services. In addition, the company engages in the securities and property investment activities; and trades in paper bags. Perfectech International Holdings Limited was founded in 1978 and is headquartered in Aberdeen, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Aberdeen",
        "zipcode": null,
        "website": "http://www.perfectech.hk",
        "market_cap": "Nano Cap"
    },
    "0869.HK": {
        "short_name": "PLAYMATES TOYS",
        "long_name": "Playmates Toys Limited",
        "summary": "Playmates Toys Limited, an investment holding company, engages in the design, development, marketing, and distribution of toys and family entertainment activity products worldwide. It offers its products under the Godzilla vs. Kong, Miraculous, Spy Ninjas, Vlad & Niki, Pikwik Pack, Ben 10, Billie Eilish, Disney, Power Players, Classic Godzilla Titans, and Rise of the Teenage Mutant Ninja Turtles brands. The company was founded in 1966 and is based in Tsimshatsui, Hong Kong. Playmates Toys Limited is a subsidiary of PIL Toys Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://playmatestoys.com",
        "market_cap": "Micro Cap"
    },
    "1005.HK": {
        "short_name": "MATRIX HOLDINGS",
        "long_name": "Matrix Holdings Limited",
        "summary": "Matrix Holdings Limited, an investment holding company, manufactures and trades in toys and lighting products. It offers plastic, die-cast, and plush toys. The company also engages in the purchase and trading of toys; trading of lighting products; import and wholesale distribution of toys, and sale of accessories connected with its products; and provision of management services. It has operations in the United States, Europe, Canada, Mexico, South America, Australia, New Zealand, and internationally. The company was founded in 1979 and is headquartered in Kowloon, Hong Kong. Matrix Holdings Limited is a subsidiary of Smart Forest Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.matrix.hk.com",
        "market_cap": "Micro Cap"
    },
    "2309.HK": {
        "short_name": "BIRMINGHAM SPTS",
        "long_name": "Birmingham Sports Holdings Limited",
        "summary": "Birmingham Sports Holdings Limited, an investment holding company, operates a professional football club in the United Kingdom. It also invests in residential and commercial properties in Cambodia. In addition, it provides lottery system and online payment system service solutions. The company was formerly known as Birmingham International Holdings Limited and changed its name to Birmingham Sports Holdings Limited in May 2017. Birmingham Sports Holdings Limited is based in Wong Chuk Hang, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wong Chuk Hang",
        "zipcode": null,
        "website": "http://www.bshl.com.hk",
        "market_cap": "Small Cap"
    },
    "3830.HK": {
        "short_name": "KIDDIELAND",
        "long_name": "Kiddieland International Limited",
        "summary": "Kiddieland International Limited, an investment holding company, manufactures, sells, imports, and exports plastic toy products targeting the toddlers' age group in the United States, Europe, the Asia Pacific and Oceania, and Africa. The company operates in two segments, Outdoor-and-Sports Toy and Infant-and-Preschool Toy. The Outdoor-and-Sports Toy segment manufactures and distributes ride-ons, rockers, trikes, scooters, and walkers. The Infant-and-Preschool Toy segment manufactures and distributes interactive playsets, activity toys, musical toys, and action vehicles. The company also provides design services for various graphic design requirements in production of toys, as well as merchandises production materials for toys. Kiddieland International Limited was founded in 1998 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.kiddieland.com.hk",
        "market_cap": "Nano Cap"
    },
    "45P.F": {
        "short_name": "PLAYMATES TOYS GROUP LTD",
        "long_name": "Playmates Toys Limited",
        "summary": "Playmates Toys Limited, an investment holding company, engages in the design, development, marketing, and distribution of toys and family entertainment activity products worldwide. It offers its products under the Godzilla vs. Kong, Miraculous, Spy Ninjas, Vlad & Niki, Pikwik Pack, Ben 10, Billie Eilish, Disney, Power Players, Classic Godzilla Titans, and Rise of the Teenage Mutant Ninja Turtles brands. The company was founded in 1966 and is based in Tsimshatsui, Hong Kong. Playmates Toys Limited is a subsidiary of PIL Toys Limited.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://playmatestoys.com",
        "market_cap": "Micro Cap"
    },
    "6880.HK": {
        "short_name": "TEMPUS HOLD",
        "long_name": "Tempus Holdings Limited",
        "summary": "Tempus Holdings Limited, an investment holding company, researches, develops, and sells health and wellness products under the OTO brand. The company operates through Sales of Health and Wellness Products Business; and Trading and Logistics Business segments. It sells relaxation, fitness, therapeutic, diagnostic, and cookware products to financial institutions, retail chain stores, and professional bodies. The company is also involved in the trading and distribution of consumer products; property investment; and provision of transportation, warehousing, supply chain, loading and uploading, and storage management services. As of December 31, 2019, it operated 24 retail outlets in Hong Kong and Macau; 113 retail outlets in Mainland China; and 15 retail outlets in Singapore and Malaysia, as well as internet and corporate sales channels. In addition, Tempus Holdings Limited exports its products to distributors or wholesalers in Eastern Europe and the Middle East. The company was formerly known as OTO Holdings Limited and changed its name to Tempus Holdings Limited in March 2015. Tempus Holdings Limited was founded in 1978 and is headquartered in Hong Kong, Hong Kong. Tempus Holdings Limited is a subsidiary of Tempus Holdings (Hong Kong) Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.tempushold.com",
        "market_cap": "Nano Cap"
    },
    "8545.HK": {
        "short_name": "AMUSE GROUP",
        "long_name": "Amuse Group Holding Limited",
        "summary": "Amuse Group Holding Limited, an investment holding company, designs, markets, distributes, and sells toys and related products in Hong Kong, Japan, the United States, China, and internationally. It operates through Sale of ODM Toys, Distribution of Imported Toys, and Sale of Own Licensed Toys segments. The company offers various premium and general class figures based on third party owned ACG characters; and other related products, such as pens and hair ties. It also produces and sells ODM toys according to customers' specifications and requirements; distributes imported toys; and develops and sells own licensed toys based on license rights. The company offers its own licensed toys under the SENTINEL, TOPI, and FLAME TOYS brands. Amuse Group Holding Limited was founded in 2004 and is headquartered in Tsuen Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://amusegroupholding.com",
        "market_cap": "Nano Cap"
    },
    "CTI.F": {
        "short_name": "CHINA TRAVEL INTL",
        "long_name": "China Travel International Investment Hong Kong Limited",
        "summary": "China Travel International Investment Hong Kong Limited, an investment holding company, provides travel and tourism services. Its Tourist Attraction and Related Operations segment operates theme parks, natural and cultural scenic spots, cable car systems, skiing facilities, golf clubs, hot spring resorts, and other resorts, as well as engages in arts performance and tourism property development activities in Mainland China. The company's Travel Agency, Travel Document, and Related Operations segment provides travel agency, travel document, and related services in Hong Kong, Mainland China, South East Asia, Oceania, the United States, and countries in the European Union. Its Hotel Operations segment offers hotel accommodation, and food and beverage services in Hong Kong, Macau, and Mainland China. The company's Passenger Transportation Operations segment provides cross-border transportation services to individuals travelling between Hong Kong, Macau, and Mainland China; and vehicle and vessel rental and charter services in Hong Kong, Macau, and Mainland China. It also trades in computer equipment and provides computer services; and offers travel and air ticketing agency, printing and advertising agency, entry permit handling agency, fuel supply, ship repairing, and logistics and courier services. In addition, the company is involved in property investment; software system development; and shipping and shipping management activities, as well as conference and exhibition operations. The company was incorporated in 1992 and is based in Central, Hong Kong. China Travel International Investment Hong Kong Limited is a subsidiary of China Travel Service (Holdings) Hong Kong Limited.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "CTVIF": {
        "short_name": "CHINA TRAVEL INTERNATIONAL",
        "long_name": "China Travel International Investment Hong Kong Limited",
        "summary": "China Travel International Investment Hong Kong Limited, an investment holding company, provides travel and tourism services. Its Tourist Attraction and Related Operations segment operates theme parks, natural and cultural scenic spots, cable car systems, skiing facilities, golf clubs, hot spring resorts, and other resorts, as well as engages in arts performance and tourism property development activities in Mainland China. The company's Travel Agency, Travel Document, and Related Operations segment provides travel agency, travel document, and related services in Hong Kong, Mainland China, South East Asia, Oceania, the United States, and countries in the European Union. Its Hotel Operations segment offers hotel accommodation, and food and beverage services in Hong Kong, Macau, and Mainland China. The company's Passenger Transportation Operations segment provides cross-border transportation services to individuals travelling between Hong Kong, Macau, and Mainland China; and vehicle and vessel rental and charter services in Hong Kong, Macau, and Mainland China. It also trades in computer equipment and provides computer services; and offers travel and air ticketing agency, printing and advertising agency, entry permit handling agency, fuel supply, ship repairing, and logistics and courier services. In addition, the company is involved in property investment; software system development; and shipping and shipping management activities, as well as conference and exhibition operations. The company was incorporated in 1992 and is based in Central, Hong Kong. China Travel International Investment Hong Kong Limited is a subsidiary of China Travel Service (Holdings) Hong Kong Limited.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "GTHKF": {
        "short_name": "GENTING HONG KONG LIMITED",
        "long_name": "Genting Hong Kong Limited",
        "summary": "Genting Hong Kong Limited, an investment holding company, engages in the operation of passenger cruise ships in the Asia Pacific, the United States, Europe, and internationally. It operates through three segments: Cruise and Cruise-Related Activities, Shipyard, and Non-Cruise Activities. The company primarily operates cruise ships under the Star Cruises, Dream Cruises, and Crystal Cruises brands; and MV Werften and Lloyd Werft shipyards, as well as docking facilities. It also operates Resorts World Manila, an integrated resort in the Philippines. In addition, the company is involved in the bareboat chartering business; operation and management of hotels; development of hospitality facilities; development and sale of commercial properties; lease of properties; provision of property management, catering, and management services; and operation of entertainment business. Further, it provides cruise sales, marketing, and support services; newbuilding, conversion, and maintenance services for ships; travel agency services; and owns vessels under construction. The company was formerly known as Star Cruises Limited and changed its name to Genting Hong Kong Limited in 2010. Genting Hong Kong Limited was incorporated in 1993 and is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.gentinghk.com",
        "market_cap": "Small Cap"
    },
    "HH3.SG": {
        "short_name": "HERALD HOLDINGS LTD. Registered",
        "long_name": "Herald Holdings Limited",
        "summary": "Herald Holdings Limited, an investment holding company, manufactures, sells, and distributes toys, computer products, housewares, clocks, watches, and electronic and gift products. The company offers a range of toys, including action figures, electronic radio-controlled toy cars and boats, electronic games, and pre-school toys; battery-operated and electronic toys, radio-controlled vehicles, transformers, and model kits and gift items; and housewares, such as non-stick aluminium cookware and aluminium hard anodized cookware products under the Pilot and Chefmate trademarks. It also provides computer products, including magnetic tape heads for computer storage drives, thin-film magnetic recording heads, and motor actuator assemblies, as well as smart connected devices for Internet of Things comprising thermostats and various connected sensor devices; and manufactures and sells watches under the Braun, Vivienne Westwood, and Lambretta brands. In addition, the company is involved in the property investment and leasing activities; provision of marketing services; and debt and equity securities, and managed funds investment activities. Herald Holdings Limited operates in Hong Kong, North America, the United Kingdom, rest of Europe, rest of Asia, Mainland China, and internationally. Herald Holdings Limited was incorporated in 1992 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.heraldgroup.com.hk",
        "market_cap": "Nano Cap"
    },
    "PDR.F": {
        "short_name": "PERFECTECH INTL  HD-,10",
        "long_name": "Perfectech International Holdings Limited",
        "summary": "Perfectech International Holdings Limited, an investment holding company, manufactures and sells novelties, and festival decoration and toy products in Hong Kong, other Asian countries, Europe, the United States, and internationally. It also manufactures and distributes molds; and provides management services. In addition, the company engages in the securities and property investment activities; and trades in paper bags. Perfectech International Holdings Limited was founded in 1978 and is headquartered in Aberdeen, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Aberdeen",
        "zipcode": null,
        "website": "http://www.perfectech.hk",
        "market_cap": "Nano Cap"
    },
    "PLJ2.F": {
        "short_name": "PLAYMATES HLDGS NEW HD-10",
        "long_name": "Playmates Holdings Limited",
        "summary": "Playmates Holdings Limited, an investment holding company, primarily engages in the creation, design, development, marketing, and distribution of toys in Hong Kong, the Americas, Europe, rest of the Asia Pacific, and internationally. It operates through three segments: Property Investments and Associated Businesses, Investment Business, and Toy Business. The Property Investments and Associated Businesses segment invests in and leases commercial, industrial, and residential premises for rent; provides property management services, such as repair and maintenance, building security, general cleaning for common areas, hand-over and take-over of premises, and the monitoring of reinstatement and refurbishment works; and operates restaurants. The Investment Business segment invests in financial instruments, including listed equity and managed funds. The Toy Business segment designs, develops, markets, and distributes toys and family entertainment activity products. The company was founded in 1966 and is based in Tsim Sha Tsui, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.playmates.net/eng/global/home.htm",
        "market_cap": "Micro Cap"
    },
    "PMTYF": {
        "short_name": "PLAYMATES TOYS LIMITED",
        "long_name": "Playmates Toys Limited",
        "summary": "Playmates Toys Limited, an investment holding company, engages in the design, development, marketing, and distribution of toys and family entertainment activity products worldwide. It offers its products under the Godzilla vs. Kong, Miraculous, Spy Ninjas, Vlad & Niki, Pikwik Pack, Ben 10, Billie Eilish, Disney, Power Players, Classic Godzilla Titans, and Rise of the Teenage Mutant Ninja Turtles brands. The company was founded in 1966 and is based in Tsimshatsui, Hong Kong. Playmates Toys Limited is a subsidiary of PIL Toys Limited.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://playmatestoys.com",
        "market_cap": "Micro Cap"
    },
    "PYHOF": {
        "short_name": "PLAYMATES HOLDINGS",
        "long_name": "Playmates Holdings Limited",
        "summary": "Playmates Holdings Limited, an investment holding company, primarily engages in the creation, design, development, marketing, and distribution of toys in Hong Kong, the Americas, Europe, the rest of the Asia Pacific, and internationally. It operates through three segments: Property Investments and Associated Businesses, Investment Business, and Toy Business. The Property Investments and Associated Businesses segment invests in and leases commercial, industrial, and residential premises for rent; provides property management services, such as repair and maintenance, building security, general cleaning for common areas, hand-over and take-over of premises, and the monitoring of reinstatement and refurbishment works; and operates restaurants. The Investment Business segment invests in financial instruments, including listed equity and managed funds. The Toy Business segment designs, develops, markets, and distributes toys and family entertainment activity products. Playmates Holdings Limited was founded in 1966 and is based in Tsim Sha Tsui, Hong Kong.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.playmates.net",
        "market_cap": "Micro Cap"
    },
    "SZHB.SG": {
        "short_name": "South China Holdings Co. Ltd. R",
        "long_name": "South China Holdings Company Limited",
        "summary": "South China Holdings Company Limited, an investment holding company, engages in the manufacture and trading of toys, property investment and development, and agriculture and forestry businesses. The company operates through Trading and Manufacturing, Property Investment and Development, and Agriculture and Forestry segments. The Trading and Manufacturing segment is involved in the manufacturing and trading of merchandises, including toys, footwear, and leather products. The Property Investment and Development segment engages in the property investment and development activities. This segment has a property portfolio with total floor area of approximately 630,000 square meters in Mainland China; and 26,000 square meters in Hong Kong. The Agriculture and Forestry segment is involved in the cultivation of fruit trees and crops; rearing of livestock and aquatic products; and forestation and sale of relevant agricultural produce. The company also manufactures and trades in electronic products; and manufactures and sells leather chemical and sports products. In addition, it invests in, develops, and manages properties. Further, the company is involved in the woods plantation business. It operates in the People's Republic of China, the United States, Europe, Japan, and internationally. The company was formerly known as South China (China) Limited and changed its name to South China Holdings Company Limited in June 2015. South China Holdings Company Limited was founded in 1976 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.scchina.co",
        "market_cap": "Micro Cap"
    },
    "TJY.F": {
        "short_name": "GENTING HONG KONG DL -,10",
        "long_name": "Genting Hong Kong Limited",
        "summary": "Genting Hong Kong Limited, an investment holding company, engages in the operation of passenger cruise ships in the Asia Pacific, the United States, Europe, and internationally. It operates through three segments: Cruise and Cruise-Related Activities, Shipyard, and Non-Cruise Activities. The company primarily operates cruise ships under the Star Cruises, Dream Cruises, and Crystal Cruises brands; and MV Werften and Lloyd Werft shipyards, as well as docking facilities. It also operates an entertainment club under the Zouk brand name; and Resorts World Manila, which is an integrated resort in the Philippines. In addition, the company is involved in the bareboat chartering business; operation and management of hotels; development of hospitality facilities; development and sale of commercial properties; lease of properties; provision of property management, catering, and management services; operation of entertainment business; and sale of residential property units. Further, it provides cruise sales, marketing, and support services; newbuilding, conversion, and maintenance services for ships; travel agency services; air cruise and air-related services; and owns vessels under construction. The company was formerly known as Star Cruises Limited and changed its name to Genting Hong Kong Limited in 2010. Genting Hong Kong Limited was founded in 1993 and is headquartered in Tsimshatsui, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.gentinghk.com",
        "market_cap": "Small Cap"
    }
}