{"0022.HK": {"short_name": "MEXAN", "long_name": "Mexan Limited", "summary": "Mexan Limited, an investment holding company, operates a Winland 800 Hotel in Tsing Yi, Hong Kong. Winland 800 Hotel consists of 800 rooms. The company also invests in and holds properties. Mexan Limited was incorporated in 1991 and is based in Tsing Yi, Hong Kong. Mexan Limited is a subsidiary of Winland Wealth (BVI) Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Tsing Yi"}, "0045.HK": {"short_name": "HK&S HOTELS", "long_name": "The Hongkong and Shanghai Hotels, Limited", "summary": "The Hongkong and Shanghai Hotels, Limited, an investment holding company, engages in the ownership, development, and management of hotels, and commercial and residential properties in Asia, the United States, and Europe. It operates through three divisions: Hotels, Commercial Properties, and Clubs and Services. The Hotels division is involved in the operation of hotels; and lease of commercial shopping arcades and office premises located within the hotel buildings. The Commercial Properties division engages in the development, lease, and sale of luxury residential apartments; and lease of retail and office premises, as well as operation of food and beverage outlets in such premises. The Clubs and Services division operates golf courses, as well as The Peak Tram, a tramway; wholesales and retails food and beverage products; and offers laundry, and management and consultancy services for clubs. The company is also involved in the wholesale and retail of merchandise; provision of dry cleaning, and marketing services; lending and borrowing of funds; and operation of golf clubs, as well as in the resort and property investment activities. In addition, it offers tourism, leisure, and other services; and operates Peninsula Boutiques. The company was formerly known as The Hongkong Hotel Company, Limited. The Hongkong and Shanghai Hotels, Limited was founded in 1866 and is headquartered in Central, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0078.HK": {"short_name": "REGAL INT'L", "long_name": "Regal Hotels International Holdings Limited", "summary": "Regal Hotels International Holdings Limited, an investment holding company, owns, operates, and manages hotels in Hong Kong, Mainland China, and internationally. It operates through six segments: Hotel Operation and Management and Hotel Ownership, Asset Management, Property Development and Investment, Financial Assets Investments, Aircraft Ownership and Leasing, and Others. The company is also involved in the provision of hotel management services; and ownership of hotel properties for rental income. In addition, it invests in, develops, sells, and rents properties, as well as offers property agency and management services. Further, the company is involved in the development and distribution of multimedia entertainment and digital educational content, and multi-platform social games; operation and management of restaurants; operation of security storage lounge; provision of housekeeping services; security and guarding services; room reservation services; and sale of food products, as well as securities trading and investment, and aircraft ownership and leasing activities. Additionally, it offers nominee, financing, and contracting agency; and asset management services. The company is headquartered in Causeway Bay, Hong Kong. Regal Hotels International Holdings Limited is a subsidiary of Century City International Holdings Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Causeway Bay"}, "0184.HK": {"short_name": "KECK SENG INV", "long_name": "Keck Seng Investments (Hong Kong) Limited", "summary": "Keck Seng Investments (Hong Kong) Limited, an investment holding company, engages in the hotel and club operations, and property investment and development activities. It operates through three segments: Hotel, Property, and Investment and Corporate. The Hotel segment offers hotel room accommodation services; and food and beverages at hotel restaurant outlets, as well as operates slot machines. The Property segment leases investment properties, which primarily consist of retail, commercial, and office properties; and develops, sells, and markets trading properties, as well as offers management services. The Investment and Corporate segment is involved in the non-trading and trading securities; financial instruments; and other treasury operations. It has operations primarily in Macau, Vietnam, the People's Republic of China, Japan, Canada, the United States, and Hong Kong. The company was incorporated in 1973 and is based in Central, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0559.HK": {"short_name": "DETAI NEWENERGY", "long_name": "DeTai New Energy Group Limited", "summary": "DeTai New Energy Group Limited, an investment holding company, engages in the hotel hospitality business. It operates the hotel, One Niseko Resort Towers located in the Niseko, Hokkaido, Japan. The company also provides money lending services; trades in and distributes liquor and wine; invests in funds; and develops, manufactures, and distributes EuroAd, a vegetable of additive. It primarily operates in Hong Kong, Sweden, Japan, and the People's Republic of China. The company was formerly known as Guocang Group Limited and changed its name to DeTai New Energy Group Limited in December 2015. DeTai New Energy Group Limited is headquartered in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "0617.HK": {"short_name": "PALIBURG HOLD", "long_name": "Paliburg Holdings Limited", "summary": "Paliburg Holdings Limited, through its subsidiaries, engages in the property investment and development, construction and building related, and hotel ownership businesses in Hong Kong, Mainland China, and internationally. The company's Property Development and Investment segment develops, sells, and leases properties; and provides estate agency services. Its Construction and Building Related Businesses segment engages in the construction works and building related businesses, including the provision of development consultancy and project management services, and property management services. This segment also develops and distributes security systems and products, and other software. The company's Hotel Operation and Management and Hotel Ownership segment owns, operates, and rents hotels; and provides hotel management services. Its Asset Management segment provides asset management services to Regal REIT. The company's Financial Assets Investments segment trades in financial assets at fair value through profit or loss; and other financial assets investments. Its Aircraft Ownership and Leasing segment owns, leases, and rents aircraft. The company's Others segment provides financing services, sells food products, operates and manages restaurants, operates security storage lounge, offers housekeeping and related services, and develops and distributes multimedia entertainment and digital educational content and multi-platform social games. Paliburg Holdings Limited also offers securities investment, management, financing, nominee, lighting technology, mechanical and electrical engineering, contracting agency, and trademark holding services. The company is headquartered in Causeway Bay, Hong Kong. Paliburg Holdings Limited is a subsidiary of Century City International Holdings Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Causeway Bay"}, "1189.HK": {"short_name": "GBA DYNAMIC", "long_name": "Greater Bay Area Dynamic Growth Holding Limited", "summary": "Greater Bay Area Dynamic Growth Holding Limited, an investment holding company, owns, operates, and manages hotels in the People's Republic of China and Hong Kong. The company operates through two segments, Hotel Operations and Securities Trading. It operates three hotels under the Rosedale brand, including the Rosedale Hotel in Hong Kong, the Rosedale Hotel & Suites in Guangzhou, and the Rosedale Hotel Shenyang, as well as the Luoyang Golden Gulf Hotel. The company is also involved in the trading of equity securities; and property investment business. In addition, it engages in the rental of shop units in hotels. The company was formerly known as Rosedale Hotel Holdings Limited. The company was incorporated in 1997 and is headquartered in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "1270.HK": {"short_name": "LANGHAM-SS", "long_name": "Langham Hospitality Investments Limited", "summary": "Langham Hospitality Investments Limited, an investment holding company, engages in the property investment business in Hong Kong. It owns and invests in a portfolio of hotels under The Langham, Hong Kong; Cordis, Hong Kong; and Eaton HK brands. The company manages 23 hotels. It also engages in the provision of administrative, financing, and treasury management services. The company was incorporated in 2013 and is based in Wanchai, Hong Kong. Langham Hospitality Investments Limited is a subsidiary of LHIL Assets Holdings Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wanchai"}, "CQA2.F": {"short_name": "CENTURY CITY INTL  HD-,10", "long_name": "Century City International Holdings Limited", "summary": "Century City International Holdings Limited, an investment holding company, engages in property development and investment, construction and building related, hotel ownership, hotel operation and management, asset management, financial assets investments, aircraft ownership and leasing, and other investment businesses. The company's Property Development and Investment segment develops and sells properties; leases properties; and provides estate agency services. Its Construction and Building Related Businesses segment is involved in construction works and building related businesses, including the provision of development consultancy and project management services, property management, security systems and products, and other software development and distribution services. The company's Hotel Operation and Management and Hotel Ownership segment engages in hotel operations and providing hotel management services, and the ownership of hotel properties for rental. Its Asset Management segment offers asset management services to Regal REIT. The company's Financial Assets Investments segment is involved in trading financial assets, and other financial assets investments. Its Aircraft Ownership and leasing segment owns and leases aircrafts. The company's Others segment provides financing, housekeeping, logistics, and related services; sells food products; operates and manages restaurants; operates security storage lounges; and develops and distributes multimedia entertainment, and digital educational content, as well as multi-platform social games. It also offers mechanical and electrical engineering services; and nominee, secretarial, and management services. The company operates in Hong Kong, Mainland China, and internationally. Century City International Holdings Limited is headquartered in Causeway Bay, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Causeway Bay"}, "G80.F": {"short_name": "DETAI NEW ENERGY GR.HD-05", "long_name": "DeTai New Energy Group Limited", "summary": "DeTai New Energy Group Limited, an investment holding company, engages in the hotel hospitality business. It operates the hotel, One Niseko Resort Towers located in the Niseko, Hokkaido, Japan. The company also provides money lending services; trades in and distributes liquor and wine; invests in funds; and develops, manufactures, and distributes EuroAd, a vegetable of additive. It primarily operates in Hong Kong, Sweden, Japan, and the People's Republic of China. The company was formerly known as Guocang Group Limited and changed its name to DeTai New Energy Group Limited in December 2015. DeTai New Energy Group Limited is headquartered in Wan Chai, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "GEAHF": {"short_name": "GREAT EAGLE HLDGS", "long_name": "Great Eagle Holdings Limited", "summary": "Great Eagle Holdings Limited, an investment holding company, invests in, develops, and manages residential, office, retail, and hotel properties in Asia, North America, Australasia, and Europe. It operates through Hotel Operation, Property Investment, Property Development, Other Operations, Champion REIT, Langham, and US Real Estate Fund segments. The company engages in leasing furnished apartments; and workspace, asset management, hotel accommodation, food and banquet, and restaurant operations. It also owns and operates a portfolio of hotels under The Langham, Langham Place, and Cordis brand names. In addition, the company offers property management services, including facilities management, security services, cleanliness and hygiene, financial management, staff training, green and risk management, maintenance and repairs, building survey, car park management, consultancy, and club house management services, as well as property maintenance and agency services. Further, it sells building materials; invests in securities; offers real estate investment trust, project, treasury, investment, and investment fund management services, as well as procurement and financing services; and issues medium term notes. Great Eagle Holdings Limited was founded in 1963 and is headquartered in Wanchai, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wanchai"}, "GHK.F": {"short_name": "GREAT EAGLE HLDGS  HD-,50", "long_name": "Great Eagle Holdings Limited", "summary": "Great Eagle Holdings Limited, an investment holding company, invests in, develops, and manages residential, office, retail, and hotel properties in Asia, North America, Australasia, and Europe. It operates through Hotel Operation, Property Investment, Property Development, Other Operations, Champion REIT, Langham, and US Real Estate Fund segments. The company engages in leasing furnished apartments; and workspace, asset management, hotel accommodation, food and banquet, and restaurant operations. It also owns and operates a portfolio of hotels under The Langham, Langham Place, and Cordis brand names. In addition, the company offers property management services, including facilities management, security services, cleanliness and hygiene, financial management, staff training, green and risk management, maintenance and repairs, building survey, car park management, consultancy, and club house management services, as well as property maintenance and agency services. Further, it sells building materials; invests in securities; offers real estate investment trust, project, treasury, investment, and investment fund management services, as well as procurement and financing services; and issues medium term notes. Great Eagle Holdings Limited was founded in 1963 and is headquartered in Wanchai, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wanchai"}, "HKSHY": {"short_name": "HONG KONG & SHANGHAI HOTELS", "long_name": "The Hongkong and Shanghai Hotels, Limited", "summary": "The Hongkong and Shanghai Hotels, Limited, an investment holding company, engages in the ownership, development, and management of hotels, and commercial and residential properties in Asia, the United States, and Europe. It operates through three divisions: Hotels, Commercial Properties, and Clubs and Services. The Hotels division is involved in the operation of hotels; and lease of commercial shopping arcades and office premises located within the hotel buildings. The Commercial Properties division engages in the development, lease, and sale of luxury residential apartments; and lease of retail and office premises, as well as operation of food and beverage outlets in such premises. The Clubs and Services division operates golf courses, as well as The Peak Tram, a tramway; wholesales and retails food and beverage products; and offers laundry, and management and consultancy services for clubs. The company is also involved in the wholesale and retail of merchandise; provision of dry cleaning, and marketing services; lending and borrowing of funds; and operation of golf clubs, as well as in the resort and property investment activities. In addition, it offers tourism, leisure, and other services; and operates Peninsula Boutiques. The company was formerly known as The Hongkong Hotel Company, Limited. The Hongkong and Shanghai Hotels, Limited was founded in 1866 and is headquartered in Central, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "HSG.F": {"short_name": "H.K. SHANGHAI HOT.", "long_name": "The Hongkong and Shanghai Hotels, Limited", "summary": "The Hongkong and Shanghai Hotels, Limited, an investment holding company, engages in the ownership, development, and management of hotels, and commercial and residential properties in Asia, the United States, and Europe. It operates through three divisions: Hotels, Commercial Properties, and Clubs and Services. The Hotels division is involved in the operation of hotels; and lease of commercial shopping arcades and office premises located within the hotel buildings. The Commercial Properties division engages in the development, lease, and sale of luxury residential apartments; and lease of retail and office premises, as well as operation of food and beverage outlets in such premises. The Clubs and Services division operates golf courses, as well as The Peak Tram, a tramway; wholesales and retails food and beverage products; and offers laundry, and management and consultancy services for clubs. The company is also involved in the wholesale and retail of merchandise; provision of dry cleaning, and marketing services; lending and borrowing of funds; and operation of golf clubs, as well as in the resort and property investment activities. In addition, it offers tourism, leisure, and other services; and operates Peninsula Boutiques. The company was formerly known as The Hongkong Hotel Company, Limited. The Hongkong and Shanghai Hotels, Limited was founded in 1866 and is headquartered in Central, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "KCKSF": {"short_name": "KECK SENG INVESTMENTS(HONK KONG", "long_name": "Keck Seng Investments (Hong Kong) Limited", "summary": "Keck Seng Investments (Hong Kong) Limited, an investment holding company, engages in the hotel and club operations, and property investment and development activities. It operates through three segments: Hotel, Property, and Investment and Corporate. The Hotel segment offers hotel room accommodation services; and food and beverages at hotel restaurant outlets, as well as operates slot machines. The Property segment leases investment properties, which primarily consist of retail, commercial, and office properties; and develops, sells, and markets trading properties, as well as offers management services. The Investment and Corporate segment is involved in the non-trading and trading securities; financial instruments; and other treasury operations. It has operations primarily in Macau, Vietnam, the People's Republic of China, Japan, Canada, the United States, and Hong Kong. The company was incorporated in 1973 and is based in Central, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "KEC.F": {"short_name": "KECK SENG INV.", "long_name": "Keck Seng Investments (Hong Kong) Limited", "summary": "Keck Seng Investments (Hong Kong) Limited, an investment holding company, engages in the hotel and club operations, and property investment and development activities. It operates through three segments: Hotel, Property, and Investment and Corporate. The Hotel segment offers hotel room accommodation services; and food and beverages at hotel restaurant outlets, as well as operates slot machines. The Property segment leases investment properties, which primarily consist of retail, commercial, and office properties; and develops, sells, and markets trading properties, as well as offers management services. The Investment and Corporate segment is involved in the non-trading and trading securities; financial instruments; and other treasury operations. It has operations primarily in Macau, Vietnam, the People's Republic of China, Japan, Canada, the United States, and Hong Kong. The company was incorporated in 1973 and is based in Central, Hong Kong.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "M04.SI": {"short_name": "Man Oriental USD", "long_name": "Mandarin Oriental International Limited", "summary": "Mandarin Oriental International Limited, together with its subsidiaries, owns and operates hotels, resorts, and residences in Asia, Europe, the Middle East, Africa, and the Americas. The company operates 33 hotels and seven residences in 23 countries and territories. It is also involved in the hotel and residences branding, and management; and property development activities. The company was founded in 1963 and is based in Quarry Bay, Hong Kong. Mandarin Oriental International Limited is a subsidiary of Jardine Strategic Holdings Limited.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "SES", "market": "sg_market", "country": "Hong Kong", "city": "Quarry Bay"}, "MAORF": {"short_name": "MANDARIN ORIENTAL INTERNATIONAL", "long_name": "Mandarin Oriental International Limited", "summary": "Mandarin Oriental International Limited, together with its subsidiaries, owns and operates hotels, resorts, and residences in Asia, Europe, the Middle East, Africa, and the Americas. The company operates 33 hotels and seven residences in 23 countries and territories. It is also involved in the hotel and residences branding, and management; and property development activities. The company was founded in 1963 and is based in Quarry Bay, Hong Kong. Mandarin Oriental International Limited is a subsidiary of Jardine Strategic Holdings Limited.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Quarry Bay"}, "MNOIY": {"short_name": "MANDARIN ORIENTAL INTERNATIONAL", "long_name": "Mandarin Oriental International Limited", "summary": "Mandarin Oriental International Limited, together with its subsidiaries, owns and operates hotels, resorts, and residences in Asia, Europe, the Middle East, Africa, and the Americas. The company operates 33 hotels and seven residences in 23 countries and territories. It is also involved in the hotel and residences branding, and management; and property development activities. The company was founded in 1963 and is based in Quarry Bay, Hong Kong. Mandarin Oriental International Limited is a subsidiary of Jardine Strategic Holdings Limited.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Quarry Bay"}, "RH6B.F": {"short_name": "REGAL HOTELS INTL  HD-,10", "long_name": "Regal Hotels International Holdings Limited", "summary": "Regal Hotels International Holdings Limited, an investment holding company, owns, operates, and manages hotels in Hong Kong, Mainland China, and internationally. It operates through six segments: Hotel Operation and Management and Hotel Ownership, Asset Management, Property Development and Investment, Financial Assets Investments, Aircraft Ownership and Leasing, and Others. The company is also involved in the provision of hotel management services; and ownership of hotel properties for rental income. In addition, it invests in, develops, sells, and rents properties, as well as offers property agency and management services. Further, the company is involved in the development and distribution of multimedia entertainment and digital educational content, and multi-platform social games; operation and management of restaurants; operation of security storage lounge; provision of housekeeping services; security and guarding services; room reservation services; and sale of food products, as well as securities trading and investment, and aircraft ownership and leasing activities. Additionally, it offers nominee, financing, and contracting agency; and asset management services. The company is headquartered in Causeway Bay, Hong Kong. Regal Hotels International Holdings Limited is a subsidiary of Century City International Holdings Limited.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Causeway Bay"}, "SHALF": {"short_name": "SHANGRI-LA ASIA", "long_name": "Shangri-La Asia Limited", "summary": "Shangri-La Asia Limited, an investment holding company, owns/leases, operates, and manages hotels and associated properties worldwide. It operates through four segments: Hotel Properties, Hotel Management and Related Services, Investment Properties, and Property Development for Sale. The company develops, owns, and operates office and commercial properties, and serviced apartments/residences; and operates restaurants. It is also involved in the hotel ownership, and property rental and sale business; and property investment, as well as wines trading activities. The company operates hotels under the Shangri-La Hotels and Resorts, Kerry Hotels, JEN by Shangri-La, Traders Hotel, Rasa, Summer Palace, and Shang Palace, as well as CHI, The Spa at Shangri-La brand names. As of December 31, 2019, it had equity interests in 78 operating hotels with 34,996 rooms. Shangri-La Asia Limited was founded in 1971 and is headquartered in Quarry Bay, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Quarry Bay"}, "SHALY": {"short_name": "SHANGRI-LA ASIA", "long_name": "Shangri-La Asia Limited", "summary": "Shangri-La Asia Limited, an investment holding company, owns/leases, operates, and manages hotels and associated properties worldwide. It operates through four segments: Hotel Properties, Hotel Management and Related Services, Investment Properties, and Property Development for Sale. The company develops, owns, and operates office and commercial properties, and serviced apartments/residences; and operates restaurants. It is also involved in the hotel ownership, and property rental and sale business; and property investment, as well as wines trading activities. The company operates hotels under the Shangri-La Hotels and Resorts, Kerry Hotels, JEN by Shangri-La, Traders Hotel, Rasa, Summer Palace, and Shang Palace, as well as CHI, The Spa at Shangri-La brand names. As of December 31, 2019, it had equity interests in 78 operating hotels with 34,996 rooms. Shangri-La Asia Limited was founded in 1971 and is headquartered in Quarry Bay, Hong Kong.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Quarry Bay"}}