{
    "0084.HK": {
        "short_name": "STELUX HOLDINGS",
        "long_name": "Stelux Holdings International Limited",
        "summary": "Stelux Holdings International Limited, an investment holding company, engages in the retail of watches under the City Chain brand name. It is also involved in the wholesale of watches, including the Seiko and Grand Seiko brands; watch supply chain management; and manufacture of watch movement related to its house brands, such as Solvil et Titus. The company operates in Hong Kong, Macau, Mainland china, Europe, and rest of Asia. Stelux Holdings International Limited was founded in 1963 and is headquartered in San Po Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "San Po Kong",
        "zipcode": null,
        "website": "http://www.stelux.com",
        "market_cap": 94182304
    },
    "0113.HK": {
        "short_name": "DICKSON CONCEPT",
        "long_name": "Dickson Concepts (International) Limited",
        "summary": "Dickson Concepts (International) Limited, an investment holding company, engages in the sale of luxury goods. It operates in two segments, Sale of Luxury Goods and Securities Investment. The company sells fashion and accessories, watches and jewelry, cosmetics and beauty products, lighters, writing instruments, leather goods, and luxury tableware. It also provides interior design, management consultancy and professional, trademarks agency, and import services. In addition, it engages in securities and property investment activities; arrangement of property tenancy agreements; and operation of Harvey Nichols, beauty avenues, and beauty bazaar stores. As of March 31, 2020, the company operated 61 stores comprising 8 stores in Hong Kong, 29 stores in China, and 24 stores in Taiwan. Dickson Concepts (International) Limited was founded in 1980 and is headquartered in Tsim Sha Tsui East, Hong Kong. Dickson Concepts (International) Limited is a subsidiary of Dickson Investment Holding Corporation.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.dickson.com.hk",
        "market_cap": 1667478784
    },
    "0116.HK": {
        "short_name": "CHOW SANG SANG",
        "long_name": "Chow Sang Sang Holdings International Limited",
        "summary": "Chow Sang Sang Holdings International Limited, an investment holding company, manufactures and retails jewellery. The company operates through four segments: Retail of Jewellery and Watches, Wholesale of Precious Metals, Securities and Futures Broking, and Other Businesses. It produces and sells jewellery products; distributes watches; and operates retail stores in Hong Kong, Macau, Mainland China, and Taiwan. The company also trades in precious metals for wholesale customers; and offers brokering and dealing services for securities and futures. In addition, it is involved in the sale of corporate gift products; provision of marketing and nominee services; and property investment activities, as well as diamond polishing and trading activities. The company also sells its products online. Chow Sang Sang Holdings International Limited was founded in 1934 and is based in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.chowsangsang.com",
        "market_cap": 8061464064
    },
    "0256.HK": {
        "short_name": "CITYCHAMP",
        "long_name": "Citychamp Watch & Jewellery Group Limited",
        "summary": "Citychamp Watch & Jewellery Group Limited, an investment holding company, manufactures, sells, and distributes watches and timepieces in Hong Kong, the People's Republic of China, Switzerland, the United Kingdom, Liechtenstein, and internationally. The company operates through Manufacturing and Distribution of Watches and Timepieces, Property Investments, and Banking and Financial Businesses segments. It offers watches and timepieces under the Rossini, Corum, Eterna, Dreyfuss & Co, J&T Windmills, Ernest Borel, and Rotary brands. The company is also involved in the property investment activities; distribution of glasses; and issuance of bonds. In addition, it operates a bank in Liechtenstein that offers financial services, including accepting client deposits and granting loans; and investment advice, asset management, and transaction banking services for entrepreneurial families and individuals. Further, the company provides investment counselling services; acts as technical administrator of fund units; dealing and advising in securities; and watch maintenance and repairment, and technical advisory services, as well as acts as an alternative investment fund manager. The company was formerly known as China Haidian Holdings Limited and changed its name to Citychamp Watch & Jewellery Group Limited in May 2014. Citychamp Watch & Jewellery Group Limited is based in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.citychampwj.com",
        "market_cap": 6701910528
    },
    "0398.HK": {
        "short_name": "ORIENTAL WATCH",
        "long_name": "Oriental Watch Holdings Limited",
        "summary": "Oriental Watch Holdings Limited, an investment holding company, trades in watches in Hong Kong, Macau, Taiwan, and the People's Republic of China. It primarily offers various Swiss brands comprising Rolex, Tudor, Piaget, Vacheron Constantin, Audemars Piguet, IWC, Jaeger-LeCoultre, Girard Perregaux, Longines, Omega, etc. The company is also involved in the property holding activities, as well as provision of watch repair and maintenance services. As of March 31, 2019, it operated through 61 retail and wholesale points, which included associate retail stores in the Greater China region. Oriental Watch Holdings Limited was founded in 1961 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.orientalwatch.com",
        "market_cap": 1452326912
    },
    "0417.HK": {
        "short_name": "TSE SUI LUEN",
        "long_name": "Tse Sui Luen Jewellery (International) Limited",
        "summary": "Tse Sui Luen Jewellery (International) Limited, an investment holding company, manufactures, sells, and markets jewelry products in Hong Kong, Macau, Mainland China, Malaysia, and other countries. The company operates through Retail Business, Wholesale Business, and Other Businesses segments. It is also involved in the retail and wholesale of jewelry; property holding and investment businesses; and management and administrative services, as well as logistic and supply chain management activities. The company is based in Hung Hom, Hong Kong. Tse Sui Luen Jewellery (International) Limited is a subsidiary of Partner Logistics Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hung Hom",
        "zipcode": null,
        "website": "http://www.tslj.com",
        "market_cap": 256657456
    },
    "0442.HK": {
        "short_name": "HIFOOD GROUP",
        "long_name": "Hifood Group Holdings Co., Limited",
        "summary": "Hifood Group Holdings Co., Limited, an investment holding company, designs, manufactures, exports, and sells fine jewelry and related products in the Americas, Mainland China, Russia, rest of Asia, rest of Europe, and internationally. The company offers a range of fine jewelry products in karat gold, including rings, earrings, pendants, necklaces, bracelets, bangles, cufflinks, brooches, and anklets. It offers its jewelry products to wholesalers and retailers. The company was formerly known as KTL International Holdings Group Limited and changed its name to Hifood Group Holdings Co., Limited in October 2017. Hifood Group Holdings Co., Limited was incorporated in 2014 and is headquartered in Central, Hong Kong. Hifood Group Holdings Co., Limited is a subsidiary of HNA Aviation Investment Holding Company Ltd.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.ktl.com.hk",
        "market_cap": 120820000
    },
    "0444.HK": {
        "short_name": "SINCEREWATCH HK",
        "long_name": "Sincere Watch (Hong Kong) Limited",
        "summary": "Sincere Watch (Hong Kong) Limited, an investment holding company, distributes branded luxury watches, timepieces, and accessories in Hong Kong, Macau, Mainland China, and internationally. It operates in two segments, Watch Distribution and Property Investment. The company primarily provides Franck Muller watches and accessories. It offers its products under the CVSTOS, Pierre Kunz, European Company Watch, and Backes & Strauss brands. The company also engages in the property investment activities. It operates a distribution network of 51 retail points of sales and 10 boutiques. The company was incorporated in 2004 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.sincerewatch.com.hk",
        "market_cap": 374724896
    },
    "0590.HK": {
        "short_name": "LUK FOOK HOLD",
        "long_name": "Luk Fook Holdings (International) Limited",
        "summary": "Luk Fook Holdings (International) Limited, an investment holding company, engages in sourcing, designing, wholesaling, trademark licensing, and retailing various gold and platinum jewelry, and gem-set jewelry products. The company is also involved in gold bullion trading; wholesaling polished diamonds; property holding; wholesaling and retailing watches; electronic retailing of gold and jewelry products; and the provision of quality examination services, as well as the authentication of gemstones. In addition, it provides software development and Internet related services, as well as engages in the brand building and promotion activities. As of March 31, 2020, the company operated a total of 2,120 shops under the Lukfook, Goldstyle, Dear Q, and 3D-GOLD names in Hong Kong, Macau, Mainland China, Singapore, Malaysia, Cambodia, the Philippines, the United States, Canada, and Australia. Luk Fook Holdings (International) Limited was founded in 1991 and is headquartered in Shatin, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://www.lukfook.com",
        "market_cap": 13386060800
    },
    "0789.HK": {
        "short_name": "ARTINI HLDG",
        "long_name": "Artini Holdings Limited",
        "summary": "Artini Holdings Limited, an investment holding company, sells fashion accessories products in Hong Kong, Macao, the People's Republic of China, Russia, the United States, Africa, Europe, the Middle East, Australia, and the rest of Asia. The company engages in the wholesale of various fashion accessories products through integrated fashion accessories online platform. It is also involved in the retail and distribution of fashion accessories products through third-party retail online platforms for retail customers; trading of fashion accessories products through offline wholesale channels; and third party physical points of sale through distributors and consignees. In addition, the company offers management services. It distributes its products under the Artini brand. The company was formerly known as Primeview Holdings Limited and changed its name to Artini Holdings Limited in September 2019. Artini Holdings Limited was founded in 1992 and is based in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.artini-china.com",
        "market_cap": 145724048
    },
    "0887.HK": {
        "short_name": "EMPEROR WATCH&J",
        "long_name": "Emperor Watch & Jewellery Limited",
        "summary": "Emperor Watch & Jewellery Limited, an investment holding company, engages in the sale of watches and jewelry products. It is involved in retailing European-made watches and self-designed fine jewelry products under the Emperor Jewellery brand name. As of December 31, 2019, the company operated 104 stores in Hong Kong, Macau, Mainland China, Singapore, and Malaysia. It sells its products through self-branded stores, watch boutiques, and multi-brand watch stores, as well as through an online shopping platform. The company was founded in 1942 and is based in Wanchai, Hong Kong. Emperor Watch & Jewellery Limited is a subsidiary of Emperor Watch & Jewellery Group Holdings Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.emperorwatchjewellery.com",
        "market_cap": 1518599168
    },
    "1150.HK": {
        "short_name": "MILAN STATION",
        "long_name": "Milan Station Holdings Limited",
        "summary": "Milan Station Holdings Limited, an investment holding company, engages in the retail of handbags, fashion accessories, embellishments, and spa and wellness products in Hong Kong, Macau, and the People's Republic of China. The company operates retail shops under the Milan Station and France Station brands that offer unused and second-hand handbags, clothing, shoes, watches, and other accessories; and natural aroma and skin care products under the THANN brand. It also sells its products online. In addition, the company provides money lending services. Milan Station Holdings Limited was incorporated in 2007 and is headquartered in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.milanstation.shop",
        "market_cap": 163743680
    },
    "1327.HK": {
        "short_name": "LUXXU GROUP",
        "long_name": "Luxxu Group Limited",
        "summary": "Luxxu Group Limited, an investment holding company, manufactures, trades in, retails, and sells watches and jewelries in the People's Republic of China, rest of Asia, and Europe. The company offers diamond watches, tourbillon watches and luxury jewelry accessories, OEM watches, and third-party watches. It sells prestige and high-end watches, as well as accessories; and designs, produces, and assembles watches for its OEM customers. The company sells its products under the Jonquet, Extreme, M.O.D., LUXXU, and Nordic Design brands. The company was formerly known as Time2u International Holding Limited and changed its name to Luxxu Group Limited in August 2019. Luxxu Group Limited was founded in 2010 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.luxxu.hk",
        "market_cap": 48107520
    },
    "1466.HK": {
        "short_name": "AFFLUENTPARTNER",
        "long_name": "Affluent Partners Holdings Limited",
        "summary": "Affluent Partners Holdings Limited, an investment holding company, engages in the purchase, processing, design, production, assembling, trading, and wholesale distribution of pearls and jewelry products. The company operates in two segments, Sale of Pearls and Jewellery, and Strategic Investment and Financial Services. It offers South Sea, Tahitian, and freshwater pearls; and a range of jewelry products on ODM and OEM basis. The company is also involved in the real estate financial assets investment business. It has operations in Hong Kong, the United Kingdom, the United States, Japan, Europe, and the People's Republic of China. The company was formerly known as Man Sang Jewellery Holdings Limited and changed its name to Affluent Partners Holdings Limited in February 2017. Affluent Partners Holdings Limited was incorporated in 2014 and is based in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.affluent-partners.com",
        "market_cap": 39956552
    },
    "1856.HK": {
        "short_name": "ERNEST BOREL",
        "long_name": "Ernest Borel Holdings Limited",
        "summary": "Ernest Borel Holdings Limited, an investment holding company, designs, manufactures, markets, and sells Swiss-made mechanical and quartz premium watches for men and women under the Ernest Borel brand. The company sells its products in the People's Republic of China, Southeast Asia, the United States, and Europe. Ernest Borel Holdings Limited was founded in 1856 and is headquartered in Mongkok, Hong Kong. As of September 18, 2018, Ernest Borel Holdings Limited operates as a subsidiary of VGB Limiited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Mong Kok",
        "zipcode": null,
        "website": "http://www.ernestborel.ch",
        "market_cap": 934605504
    },
    "1929.HK": {
        "short_name": "CHOW TAI FOOK",
        "long_name": "Chow Tai Fook Jewellery Group Limited",
        "summary": "Chow Tai Fook Jewellery Group Limited, an investment holding company, manufactures and sells jewelry products. The company offers high-end luxury, mass luxury, and youth line jewelry products, including gem-set, gold, and platinum/karat gold products under the CHOW TAI FOOK, HEARTS ON FIRE, T MARK, MONOLOGUE, and SOINLOVE brands. It also distributes watches of various brands. In addition, the company is involved in the trading of diamonds. The company also sells its products through online platforms. As of March 31, 2019, it had 3,134 points of sale in Mainland China, Hong Kong, Macau, Taiwan, Cambodia, Korea, Japan, Malaysia, Singapore, the United States, and Vietnam. It also operates Chow Tai Fook North America, a business hub that engages in the wholesale of diamond jewellery brands, such as HEARTS ON FIRE and MÃ\u0089MOIRE located in Boston, Massachusetts. The company was founded in 1929 and is headquartered in Central, Hong Kong. Chow Tai Fook Jewellery Group Limited operates as a subsidiary of Chow Tai Fook (Holding) Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.ctfjewellerygroup.com",
        "market_cap": 153400000512
    },
    "1CT.F": {
        "short_name": "CHOW TAI FOOK JEWEL. HD 1",
        "long_name": "Chow Tai Fook Jewellery Group Limited",
        "summary": "Chow Tai Fook Jewellery Group Limited, an investment holding company, manufactures and sells jewelry products. The company offers high-end luxury, mass luxury, and youth line jewelry products, including gem-set, gold, and platinum/karat gold products under the CHOW TAI FOOK, HEARTS ON FIRE, T MARK, MONOLOGUE, and SOINLOVE brands. It also distributes watches of various brands. In addition, the company is involved in the trading of diamonds. The company also sells its products through online platforms. As of March 31, 2019, it had 3,134 points of sale in Mainland China, Hong Kong, Macau, Taiwan, Cambodia, Korea, Japan, Malaysia, Singapore, the United States, and Vietnam. It also operates Chow Tai Fook North America, a business hub that engages in the wholesale of diamond jewellery brands, such as HEARTS ON FIRE and MÃ\u0089MOIRE located in Boston, Massachusetts. The company was founded in 1929 and is headquartered in Central, Hong Kong. Chow Tai Fook Jewellery Group Limited operates as a subsidiary of Chow Tai Fook (Holding) Limited.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.ctfjewellerygroup.com",
        "market_cap": 16436593664
    },
    "2033.HK": {
        "short_name": "TIME WATCH",
        "long_name": "Time Watch Investments Limited",
        "summary": "Time Watch Investments Limited, an investment holding company, operates as a manufacturer, brand-owner, and retailer of watches in the People's Republic of China. The company operates through four segments: Tian Wang Watch, Balco Watch, Watch Movements Trading, and Other Brands (PRC). It designs, manufactures, assembles, trades, sells, and retails watches under the Tian Wang and Balco brand names. In addition, the company trades in watch movements to other watch manufacturers and distributors; imports and retails watches of other brands; distributes owned and licensed international watch brands; and provides marketing and consulting services. Further, it is involved in the property investment business. As of June 30, 2020, the company operated 2,738 point of sales stores. The company was founded in 1988 and is headquartered in Kowloon, Hong Kong. Time Watch Investments Limited is a subsidiary of Red Glory Investments Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Cheung Sha Wan",
        "zipcode": null,
        "website": "http://www.timewatch.com.hk",
        "market_cap": 1868804992
    },
    "3389.HK": {
        "short_name": "HENGDELI",
        "long_name": "Hengdeli Holdings Limited",
        "summary": "Hengdeli Holdings Limited, together with its subsidiaries, engages in the manufacture of watch accessories and packaging products. It is also involved in the design, production, and decoration of commercial spaces. The company was founded in 1957 and is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.hengdeligroup.com",
        "market_cap": 1406415104
    },
    "6838.HK": {
        "short_name": "WINOX",
        "long_name": "Winox Holdings Limited",
        "summary": "Winox Holdings Limited, an investment holding company, develops, manufactures, and sells stainless steel products. Its products include watch bracelets, mobile phone cases and parts, smart wearable cases and parts, costume jewelry, and leather and other fashion accessories. The company also provides management and administration services; and holds properties. It operates in Switzerland, the People's Republic of China, Liechtenstein and other European countries, Taiwan, Hong Kong, and internationally. The company was founded in 1999 and is headquartered in Yau Tong, Hong Kong. Winox Holdings Limited is a subsidiary of Ming Fung Investment Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Yau Tong",
        "zipcode": null,
        "website": "http://www.winox.com",
        "market_cap": 820000000
    },
    "8026.HK": {
        "short_name": "CB GLOBAL",
        "long_name": "China Brilliant Global Limited",
        "summary": "China Brilliant Global Limited, an investment holding company, engages in the research and development, design, wholesale, and retail of gold and jewelry, and related ancillary businesses in Hong Kong and the Peoples' Republic of China. The company operates through Trading and Retailing of Gold and Jewellery, Lending Business, and Pharmaceutical and Healthcare Products segments. It is also involved in the distribution and retail of Chinese herbal medicines and drugs; internet artificial intelligence research, management, and consultancy activities; network and data services; and money lending business. The company was formerly known as Prosten Health Holdings Limited and changed its name to China Brilliant Global Limited in May 2018. China Brilliant Global Limited was incorporated in 1989 and is headquartered in Sheung Wan, Hong Kong. China Brilliant Global Limited is a subsidiary of Brilliant Chapter Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": null,
        "website": "http://www.cbg.com.hk",
        "market_cap": 1020068032
    },
    "8219.HK": {
        "short_name": "HANVEY GROUP",
        "long_name": "Hanvey Group Holdings Limited",
        "summary": "Hanvey Group Holdings Limited, an investment holding company, designs, develops, manufactures, and distributes watch products on an original design manufacturing basis. The company offers female and male watches, metal and non-metal banded, mechanical, and quartz movement watches; and semi-knocked-down kits and watch parts. It serves watch manufacturers, brand owners, and watch importers. It operates in Indonesia, Hong Kong, Brazil, India, the Kingdom of Saudi Arabia, Australia, the United Arab Emirates, Turkey, Germany, Thailand, the United Kingdom, Switzerland, Bangladesh, and Colombia. The company was founded in 1986 and is headquartered in Kwai Chung, Hong Kong. Hanvey Group Holdings Limited is a subsidiary of Million Easy Enterprises Ltd.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.hanveygroup.com.hk",
        "market_cap": 184000000
    },
    "CEBTF": {
        "short_name": "CITYCHAMP WATCH & JEWELLERY GP ",
        "long_name": "Citychamp Watch & Jewellery Group Limited",
        "summary": "Citychamp Watch & Jewellery Group Limited, an investment holding company, manufactures, sells, and distributes watches and timepieces in Hong Kong, the People's Republic of China, Switzerland, the United Kingdom, Liechtenstein, and internationally. The company operates through Watches and Timepieces, Property Investments, and Banking and Financial Businesses segments. It offers watches and timepieces under the Rossini, EBOHR, Corum, Eterna, Dreyfuss & Co, J&T Windmills, Kana, Ernest Borel, and Rotary brands. The company is also involved in the property investment activities; distribution of glasses; and issuance of bonds. In addition, it operates a bank in Liechtenstein that offers financial services, including accepting client deposits and granting loans; and investment advice, asset management, and transaction banking services for entrepreneurial families and individuals. Further, the company provides investment-counselling services; acts as technical administrator of fund units; dealing and advising in securities; and watch maintenance and repairment, and technical advisory services. It operates through a network of approximately 2,000 point of sales/sales outlets; and 280 self-owned retail shops and distribution outlets in Mainland China. The company was formerly known as China Haidian Holdings Limited and changed its name to Citychamp Watch & Jewellery Group Limited in May 2014. Citychamp Watch & Jewellery Group Limited is based in Kowloon, Hong Kong.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.citychampwj.com",
        "market_cap": 935758016
    },
    "CJEWF": {
        "short_name": "CHOW TAI FOOK JEWELLERY GROUP L",
        "long_name": "Chow Tai Fook Jewellery Group Limited",
        "summary": "Chow Tai Fook Jewellery Group Limited, an investment holding company, manufactures and sells jewelry products. The company offers high-end luxury, mass luxury, and youth line jewelry products, including gem-set, gold, and platinum/karat gold products under the CHOW TAI FOOK, HEARTS ON FIRE, T MARK, MONOLOGUE, and SOINLOVE brands. It also distributes watches of various brands. In addition, the company is involved in the trading of diamonds. The company also sells its products through online platforms. As of March 31, 2019, it had 3,134 points of sale in Mainland China, Hong Kong, Macau, Taiwan, Cambodia, Korea, Japan, Malaysia, Singapore, the United States, and Vietnam. It also operates Chow Tai Fook North America, a business hub that engages in the wholesale of diamond jewellery brands, such as HEARTS ON FIRE and MÃ\u0089MOIRE located in Boston, Massachusetts. The company was founded in 1929 and is headquartered in Central, Hong Kong. Chow Tai Fook Jewellery Group Limited operates as a subsidiary of Chow Tai Fook (Holding) Limited.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.ctfjewellerygroup.com",
        "market_cap": 18426988544
    },
    "CJEWY": {
        "short_name": "CHOW TAI FOOK JEWELLERY GROUP L",
        "long_name": "Chow Tai Fook Jewellery Group Limited",
        "summary": "Chow Tai Fook Jewellery Group Limited, an investment holding company, manufactures and sells jewelry products. The company offers high-end luxury, mass luxury, and youth line jewelry products, including gem-set, gold, and platinum/karat gold products under the CHOW TAI FOOK, HEARTS ON FIRE, T MARK, MONOLOGUE, and SOINLOVE brands. It also distributes watches of various brands. In addition, the company is involved in the trading of diamonds. The company also sells its products through online platforms. As of March 31, 2019, it had 3,134 points of sale in Mainland China, Hong Kong, Macau, Taiwan, Cambodia, Korea, Japan, Malaysia, Singapore, the United States, and Vietnam. It also operates Chow Tai Fook North America, a business hub that engages in the wholesale of diamond jewellery brands, such as HEARTS ON FIRE and MÃ\u0089MOIRE located in Boston, Massachusetts. The company was founded in 1929 and is headquartered in Central, Hong Kong. Chow Tai Fook Jewellery Group Limited operates as a subsidiary of Chow Tai Fook (Holding) Limited.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.ctfjewellerygroup.com",
        "market_cap": 19690072064
    },
    "CJR.F": {
        "short_name": "CITYCHAMP W.+J.GRP HD-,10",
        "long_name": "Citychamp Watch & Jewellery Group Limited",
        "summary": "Citychamp Watch & Jewellery Group Limited, an investment holding company, manufactures, sells, and distributes watches and timepieces in Hong Kong, the People's Republic of China, Switzerland, the United Kingdom, Liechtenstein, and internationally. The company operates through Watches and Timepieces, Property Investments, and Banking and Financial Businesses segments. It offers watches and timepieces under the Rossini, EBOHR, Corum, Eterna, Dreyfuss & Co, J&T Windmills, Kana, Ernest Borel, and Rotary brands. The company is also involved in the property investment activities; distribution of glasses; and issuance of bonds. In addition, it operates a bank in Liechtenstein that offers financial services, including accepting client deposits and granting loans; and investment advice, asset management, and transaction banking services for entrepreneurial families and individuals. Further, the company provides investment-counselling services; acts as technical administrator of fund units; dealing and advising in securities; and watch maintenance and repairment, and technical advisory services. It operates through a network of approximately 2,000 point of sales/sales outlets; and 280 self-owned retail shops and distribution outlets in Mainland China. The company was formerly known as China Haidian Holdings Limited and changed its name to Citychamp Watch & Jewellery Group Limited in May 2014. Citychamp Watch & Jewellery Group Limited is based in Kowloon, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.citychampwj.com",
        "market_cap": 712629248
    },
    "CJW1.F": {
        "short_name": "CHOW SANG SANG LTD HD-,25",
        "long_name": "Chow Sang Sang Holdings International Limited",
        "summary": "Chow Sang Sang Holdings International Limited, an investment holding company, manufactures and retails jewellery. The company operates through four segments: Retail of Jewellery and Watches, Wholesale of Precious Metals, Securities and Futures Broking, and Other Businesses. It produces and sells jewellery products; distributes watches; and operates retail stores in Hong Kong, Macau, Mainland China, and Taiwan. The company also trades in precious metals for wholesale customers; and offers brokering and dealing services for securities and futures. In addition, it is involved in the sale of corporate gift products; provision of marketing and nominee services; and property investment activities, as well as diamond polishing and trading activities. The company also sells its products online. Chow Sang Sang Holdings International Limited was founded in 1934 and is based in Kowloon, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.chowsangsang.com",
        "market_cap": 1020745664
    },
    "DCOHF": {
        "short_name": "DICKSONS CONCEPT INTERNATIONAL",
        "long_name": "Dickson Concepts (International) Limited",
        "summary": "Dickson Concepts (International) Limited, an investment holding company, engages in the sale of luxury goods. It operates in two segments, Sale of Luxury Goods and Securities Investment. The company sells fashion and accessories, watches and jewelry, cosmetics and beauty products, lighters, writing instruments, leather goods, and luxury tableware. It also provides interior design, management consultancy and professional, trademarks agency, and import services. In addition, it engages in securities and property investment activities; arrangement of property tenancy agreements; and operation of Harvey Nichols, beauty avenues, and beauty bazaar stores. As of March 31, 2020, the company operated 61 stores comprising 8 stores in Hong Kong, 29 stores in China, and 24 stores in Taiwan. Dickson Concepts (International) Limited was founded in 1980 and is headquartered in Tsim Sha Tsui East, Hong Kong. Dickson Concepts (International) Limited is a subsidiary of Dickson Investment Holding Corporation.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.dickson.com.hk",
        "market_cap": 208100400
    },
    "EPU.F": {
        "short_name": "EMPEROR W.+JEWELL.",
        "long_name": "Emperor Watch & Jewellery Limited",
        "summary": "Emperor Watch & Jewellery Limited, an investment holding company, engages in the sale of watches and jewelry products. It is involved in retailing European-made watches and self-designed fine jewelry products under the Emperor Jewellery brand name. As of December 31, 2019, the company operated 104 stores in Hong Kong, Macau, Mainland China, Singapore, and Malaysia. It sells its products through self-branded stores, watch boutiques, and multi-brand watch stores, as well as through an online shopping platform. The company was founded in 1942 and is based in Wanchai, Hong Kong. Emperor Watch & Jewellery Limited is a subsidiary of Emperor Watch & Jewellery Group Holdings Limited.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.emperorwatchjewellery.com",
        "market_cap": 153496000
    },
    "FJHL": {
        "short_name": "FOVEA JEWELRY HOLDINGS LTD",
        "long_name": "Fovea Jewelry Holdings, Ltd.",
        "summary": "Fovea Jewelry Holdings, Ltd. engages in the online sale of diamond jewelry in Hong Kong. The company is based in Tsim Sha Tsui, Hong Kong.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.fovea-jewellery.com",
        "market_cap": 14317839
    },
    "LKFLF": {
        "short_name": "LUK FOOK HLDGS",
        "long_name": "Luk Fook Holdings (International) Limited",
        "summary": "Luk Fook Holdings (International) Limited, an investment holding company, engages in sourcing, designing, wholesaling, trademark licensing, and retailing various gold and platinum jewelry, and gem-set jewelry products. The company is also involved in gold bullion trading; wholesaling polished diamonds; property holding; wholesaling and retailing watches; electronic retailing of gold and jewelry products; and the provision of quality examination services, as well as the authentication of gemstones. In addition, it provides software development and Internet related services, as well as engages in the brand building and promotion activities. As of March 31, 2020, the company operated a total of 2,120 shops under the Lukfook, Goldstyle, Dear Q, and 3D-GOLD names in Hong Kong, Macau, Mainland China, Singapore, Malaysia, Cambodia, the Philippines, the United States, Canada, and Australia. Luk Fook Holdings (International) Limited was founded in 1991 and is headquartered in Shatin, Hong Kong.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://www.lukfook.com",
        "market_cap": 1710481664
    },
    "LUY1.SG": {
        "short_name": "Luk Fook Holdings (Intl.) Ltd.R",
        "long_name": "Luk Fook Holdings (International) Limited",
        "summary": "Luk Fook Holdings (International) Limited, an investment holding company, engages in sourcing, designing, wholesaling, trademark licensing, and retailing various gold and platinum jewelry, and gem-set jewelry products. The company is also involved in gold bullion trading; wholesaling polished diamonds; property holding; wholesaling and retailing watches; electronic retailing of gold and jewelry products; and the provision of quality examination services, as well as the authentication of gemstones. In addition, it provides software development and Internet related services, as well as engages in the brand building and promotion activities. As of March 31, 2020, the company operated a total of 2,120 shops under the Lukfook, Goldstyle, Dear Q, and 3D-GOLD names in Hong Kong, Macau, Mainland China, Singapore, Malaysia, Cambodia, the Philippines, the United States, Canada, and Australia. Luk Fook Holdings (International) Limited was founded in 1991 and is headquartered in Shatin, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://www.lukfook.com",
        "market_cap": 1388427136
    },
    "M19B.F": {
        "short_name": "ARTINI HLDGS LTD  HD -,05",
        "long_name": "Artini Holdings Limited",
        "summary": "Artini Holdings Limited, an investment holding company, sells fashion accessories products in Hong Kong, Macao, the People's Republic of China, Russia, the United States, Africa, Europe, the Middle East, Australia, and the rest of Asia. The company engages in the wholesale of various fashion accessories products through integrated fashion accessories online platform. It is also involved in the retail and distribution of fashion accessories products through third-party retail online platforms for retail customers; trading of fashion accessories products through offline wholesale channels; and third party physical points of sale through distributors and consignees. In addition, the company offers management services. It distributes its products under the Artini brand. The company was formerly known as Primeview Holdings Limited and changed its name to Artini Holdings Limited in September 2019. Artini Holdings Limited was founded in 1992 and is based in Tsim Sha Tsui, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.artini-china.com",
        "market_cap": 15327269
    },
    "S7F1.F": {
        "short_name": "SINCERE WATCH HK  HD-,02",
        "long_name": "Sincere Watch (Hong Kong) Limited",
        "summary": "Sincere Watch (Hong Kong) Limited, an investment holding company, distributes branded luxury watches, timepieces, and accessories in Hong Kong, Macau, Mainland China, and internationally. It operates in two segments, Watch Distribution and Property Investment. The company primarily provides Franck Muller watches and accessories. It offers its products under the CVSTOS, Pierre Kunz, European Company Watch, and Backes & Strauss brands. The company also engages in the property investment activities. It operates a distribution network of 51 retail points of sales and 10 boutiques. The company was incorporated in 2004 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.sincerewatch.com.hk",
        "market_cap": 36516096
    },
    "XYUA.F": {
        "short_name": "HENGDELI HLDG.SUB.HD-,005",
        "long_name": "Hengdeli Holdings Limited",
        "summary": "Hengdeli Holdings Limited, together with its subsidiaries, engages in the manufacture of watch accessories and packaging products. It is also involved in the design, production, and decoration of commercial spaces. The company was founded in 1957 and is headquartered in Tsim Sha Tsui, Hong Kong.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.hengdeligroup.com",
        "market_cap": 160932160
    }
}