{
    "004690.KS": {
        "short_name": "Samchully",
        "long_name": "Samchully Co.,Ltd",
        "summary": "Samchully Co., Ltd. produces and supplies electric power to electricity sellers on the electric power market in Korea. It is also involved in the compressed natural gas (CNG) fueling stations for natural gas vehicles, and energy consulting businesses. In addition, the company generates and supplies electricity for heating and cooling systems. Further, the company engages in fuel cell, biogas, and renewable energy businesses. As of December 31, 2019, it supplied 3.88 billion m city gas to approximately 3.23 million households with a pipeline network of 6,341 km in 13 cities of Gyeonggi-do province, as well as in the 5 districts of Incheon, as well as operated approximately twelve CNG fueling stations. The company was formerly known as Samchully Industry Co., Ltd. and changed its name to Samchully Co., Ltd. in October 1984. Samchully Co., Ltd. was founded in 1955 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "006890.KS": {
        "short_name": "TAEKYUNGCHEMICAL",
        "long_name": "Taekyung Chemical Co., Ltd.",
        "summary": "Taekyung Chemical Co., Ltd. manufactures and sells industrialized liquid gases and dry ice in Korea. The company offers liquid and solid carbon dioxide, magnesium hydroxide, gas carburetor, and organic compounds, as well as processing machine tools. It is also involved in the re-inspection of special equipment; installation of high pressure gas utilities; and trading activities. In addition, the company provides ethylene, liquid oxygen, liquid nitrogen, and liquid argon. Its products are primarily used for welding, food conduction, cutting, oxidation inhibition, inflation, and semiconductor mechanical oxidation and nitride prevention purposes; in steel and metal refinery industries; and as food additive, refrigerant, chemosynthesis, and plant stimulant. The company was formerly known as Daeduk Industry Co., Ltd. and changed its name to Taekyung Chemical Co., Ltd. in 2000. Taekyung Chemical Co., Ltd. was founded in 1970 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "012320.KS": {
        "short_name": "KYUNGDONG INVEST",
        "long_name": "Kyungdong Invest Co., Ltd",
        "summary": "Kyungdong Invest Co., Ltd primarily engages in the supply of city gas in South Korea. The company supplies gas to households through pipeline of approximately 2,099 kilometeres, as well as compressed natual gas fuel to natural gas bus vehicles in Ulsan and Yangsan. It also produces anthracite coal and biomass, as well as offers energy diagnosis systems, gas heating and cooling systems, and gas cogeneration systems. In addition, the company is involved in the waste heat generation and pneumatic power generation activities, as well as construction of gas facilities, industrial plants, and civil/architectural buildings. Further, it engages in the maritime/air transportation, inland transportation, and export transportation; and operation of warehouses, container yards, and container freight stations, as well as port unloading/shipping activities. Kyungdong Invest Co., Ltd was founded in 1977 and is headquartered in Seongnam-si, South Korea.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seongnam-si"
    },
    "015350.KS": {
        "short_name": "BusanCtyGas",
        "long_name": "Busan City Gas. Co. Ltd.",
        "summary": "Busan City Gas. Co. Ltd. operates as a city gas distributor in South Korea. The company offers city gas for domestic, commercial, business, industrial, and power business purposes, including business or commercial buildings, house heating and cooking, combined heat and power generation, cooling, and vehicle CNG. It also provides district energy and energy diagnosis services; CNG fuel systems that include compressors, control panels, storage tanks, and fuel dispensers; small-scale co-generation systems that produces heat and energy; gas-engine driven heat pumps for cooling and heating; and fuel cell co-generation systems, which produces electricity and hot water. The company was founded in 1981 and is based in Busan, South Korea. Busan City Gas. Co. Ltd. is a subsidiary of SK E&S Co., Ltd.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Busan"
    },
    "015360.KS": {
        "short_name": "Yesco Holdings",
        "long_name": "Yesco Holdings Co., Ltd.",
        "summary": "Yesco Holdings Co., Ltd. engages in the supply of city gas. It also offers gas equipment, tank terminals, air-conditioning and heating equipment, CNG chargers, gas equipment, and water treatment construction solutions, as well as biogas. It supplies LNG to 1.14 million households in the Seoul metropolitan area. The company also produces and sells precast concrete; and engages in housing design and wood processing activities. The company was founded in 1981 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "016710.KS": {
        "short_name": "DAESUNG HOLDINGS",
        "long_name": "Daesung Holdings Co., Ltd.",
        "summary": "Daesung Holdings Co., Ltd. engages in the energy, educational content, and information and communication businesses in South Korea. It supplies city gas to household, business, and industrial customers; and operates power generation, heat supply, landfill gas resource facilities, as well as acts as a consignment agent for city gas customer management, safety management of city gas facilities, construction of city gas supply and facilities, and gas connection construction. The company is also involved in the vehicle fuel retail business; call center outsourcing CRM, ASP, and talent dispatch businesses; and investment business. In addition, it provides distance education services for professionals in the companies and education sites; customized professional training courses for parents, instructors, prospective teachers, and companies; and various courses for foreign language, humanities, leadership, OA, and liberal arts through PC and mobile devices, as well as develops education programs for cooperative learning, strategic thinking, and insight and problem solving. Further, the company offers IT integrated management services, IT outsourcing and system integration services, oracle transaction based recovery solutions, RFID-based CNG charging POS systems, and apartment management ASP services, as well as supplies mobile terminals to retailers. Additionally, it provides VOIP service; and manages Skype services. The company was formerly known as Daegu City Gas Co., Ltd. and changed its name to Daesung Holdings Co., Ltd. in 2009. Daesung Holdings Co., Ltd. was founded in 1983 and is headquartered in Daegu, South Korea.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Daegu"
    },
    "017390.KS": {
        "short_name": "SeoulCtyGas",
        "long_name": "Seoul City Gas Co., Ltd.",
        "summary": "Seoul City Gas Co., Ltd. supplies natural gas to residential, commercial, and industrial customers in South Korea. The company operates 4,441 kilometers of distribution pipelines covering a total distribution area of 1,249 square kilometers. It serves approximately 2.47 million families in the 11 areas of North Western Seoul, as well as the cities of Gyunggi-do. The company was founded in 1970 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "034590.KS": {
        "short_name": "INCHEON CITY GAS",
        "long_name": "Incheon City Gas Co., Ltd.",
        "summary": "Incheon City Gas Co., Ltd. supplies gas in South Korea. The company operates through a pipeline network of 1,534 kilometers. It also supplies electricity. The company was founded in 1983 and is headquartered in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Incheon"
    },
    "117580.KS": {
        "short_name": "DAESUNGENERGY",
        "long_name": "Daesung Energy Co., Ltd.",
        "summary": "Daesung Energy Co., Ltd. supplies natural gas primarily in Daegu metropolitan area, South Korea. It develops and offers SolaWin system, a hybrid wind and solar system; solid refuse fuel systems; and community energy systems for the generation of renewable energy and power generation. The company also operates 12 compressed natural gas stations. Daesung Energy Co., Ltd. supplies natural gas to residential, commercial, and industrial customers. The company was founded in 1983 and is based in Daegu, South Korea. Daesung Energy Co., Ltd. is a subsidiary of Daesung Holdings Co., Ltd.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Daegu"
    },
    "267290.KS": {
        "short_name": "KYUNGDONG CITY GAS",
        "long_name": "Kyungdong City Gas Co., Ltd",
        "summary": "Kyungdong City Gas Co., Ltd engages in the manufacture and supply of liquefied natural gas through its piping to consumers. It also operates city gas safety agency services and gas construction through customer service companies; manufactures and sells gas equipment; retails vehicle fuel; provides natural gas related engineering services; provides gas cooling and heating, and power generation facilities services; offers plumbing rental services; and provides data analysis, development, sale, maintenance and exchange, and transmission services. The company was founded in 2017 and is headquartered in Ulsan, South Korea.",
        "currency": "KRW",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Ulsan"
    },
    "KEP": {
        "short_name": "Korea Electric Power Corporatio",
        "long_name": "Korea Electric Power Corporation",
        "summary": "Korea Electric Power Corporation, an integrated electric utility company, generates, transmits, and distributes electricity in South Korea and internationally. The company operates through Transmission and Distribution, Electric Power Generation (Nuclear), Electric Power Generation (Non-nuclear), Plant Maintenance & Engineering Service, and Others segments. It generates power from nuclear, coal, oil, liquefied natural gas, internal combustion, combined-cycle, integrated gasification combined cycle, hydro, wind, solar, fuel cell, biogas, and other sources. As of December 31, 2019, the company had a total of 671 generation units, including nuclear, thermal, hydroelectric, and internal combustion units with an installed generation capacity of 83,672 megawatts. Its transmission system consisted of 34,440 circuit kilometers of lines of 765 kilovolts and others, including high-voltage direct current lines, as well as 864 substations with an installed transformer capacity of 326,329 megavolt-amperes; and distribution system included 125,067 megavolt-amperes of transformer capacity and 9,641,891 units of support with a total line length of 504,402 circuit kilometers. The company provides electricity to residential, commercial, educational, industrial, agricultural, street lighting, and overnight power usage. It also offers utility plant maintenance and architectural engineering, information, communication line leasing, resources development, and fly ashes recycling services, as well as sells nuclear fuel. Korea Electric Power Corporation was founded in 1961 and is headquartered in Naju, South Korea.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "South Korea",
        "city": "Naju-Si"
    }
}