{
    "3629.TWO": {
        "short_name": "GRAVITY CO. LTD. (TAIWAN)",
        "long_name": "Gravitytai Co.,Ltd.",
        "summary": "Gravitytai Co.,Ltd. manufactures and distributes indium tin oxide (ITO) conductive films. Its products are used in the manufacture of touch panels of mobile phones, personal digital assistants, and other consumer electronic products, as well as navigation systems, laptops, keyboards, and other areas. The company distributes its products in Taiwan, Mainland China, South Korea, and Japan. Gravitytai Co.,Ltd. is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11075",
        "website": "http://www.gravitytw.com",
        "market_cap": 1210813952
    },
    "6136.TW": {
        "short_name": "FULLERTON TECHNOLOGY CO",
        "long_name": "Fullerton Technology Co., Ltd.",
        "summary": "Fullerton Technology Co., Ltd. provides activity management services; and operates an online booking service platform in Taiwan. It also operates an Ez Booking, a cross-cinema ticket booking platform that offers movie booking and online e-ticketing services; and Niceday Play Experience, a reservation platform for a few hours of activity experience, or a small day trip. In addition, the company provides a digital imaging service platform; and prepaid card communication services, as well as operates telecom communications exchange platform. Further, it engages in combining software and hardware applications to create a convenient and smart life. Fullerton Technology Co., Ltd. was founded in 1992 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.fullerton.com.tw",
        "market_cap": 2125862400
    }
}