{
    "4994.TW": {
        "short_name": "X-LEGEND ENTERTAINMENT CO LTD",
        "long_name": "X-Legend Entertainment Co., Ltd.",
        "summary": "X-Legend Entertainment Co., Ltd., together with its subsidiaries, researches, develops, publishes, operates, markets, and services online and mobile games. The company publishes games in approximately 14 language versions in Taiwan, Hong Kong, Japan, China, North America, Korea, Germany, France, Malaysia, Thailand, Indonesia, Portugal, Spain, Italy, and Russia. It offers multiplayer online role-playing games, casual and puzzle games, and data and software services, as well as engages in international trading business. In addition, the company engages in the manufacture of computer and peripheral devices; wholesale and retail of information software; information software, information processing, electronic information supply, general advertising, and online certification services; intellectual property right business; and management consultation business. X-Legend Entertainment Co., Ltd. was founded in 2002 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "GIFN.F": {
        "short_name": "GIGAMEDIA LTD  TA 10",
        "long_name": "GigaMedia Limited",
        "summary": "GigaMedia Limited provides digital entertainment services in Taiwan and Hong Kong. The company operates FunTown, a digital entertainment portal that offers mobile and browser-based casual games through -branded platform. It offers MahJong, a traditional Chinese tile based game; casual card and table games; online card games; and chance-based games, including bingo, lotto, horse racing, Sic-Bo, slots, and various casual games. The company also provides sports games and role-playing games, such as Tales Runner, a multi-player online obstacle running game; Yume 100, a story -based game that targets female players; Akaseka, a female-oriented game; and Shinobi Master New Link, a male-oriented game. GigaMedia Limited was founded in 1998 and is headquartered in Taipei, Taiwan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "GIGM": {
        "short_name": "GigaMedia Limited",
        "long_name": "GigaMedia Limited",
        "summary": "GigaMedia Limited provides digital entertainment services in Taiwan and Hong Kong. The company operates FunTown, a digital entertainment portal that offers mobile and browser-based casual games through -branded platform. It offers MahJong, a traditional Chinese tile based game; casual card and table games; online card games; and chance-based games, including bingo, lotto, horse racing, Sic-Bo, slots, and various casual games. The company also provides sports games and role-playing games, such as Tales Runner, a multi-player online obstacle running game; Yume 100, a story -based game that targets female players; Akaseka, a female-oriented game; and Shinobi Master New Link, a male-oriented game. GigaMedia Limited was founded in 1998 and is headquartered in Taipei, Taiwan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Taiwan",
        "city": "Taipei"
    }
}