{
  "4803.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Entertainment",
    "long_name": "VHQ Media Holdings Ltd",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "VHQ MEDIA HOLDINGS LTD",
    "state": null,
    "summary": "VHQ Media Holdings Ltd, together with its subsidiaries, engages in the multimedia innovation and creativity, post production, visual effects, and related services for TV advertising, TV drama, online drama, movies, and animation in Taiwan and internationally. The company operates in four segment: Singapore, Malaysia, Indonesia, and Beijing. It is involved in the content development and performance optimization business; provision of post production services for commercials and feature films; and multimedia shooting and planning for dramas and movies. VHQ Media Holdings Ltd was founded in 1987 and is based in Taipei City, Taiwan.",
    "website": "http://www.vhqmedia.com",
    "zipcode": "114"
  },
  "4806.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Entertainment",
    "long_name": "ShengHua Entertainment Communication co.,Ltd.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "SHENGHUA ENTERTAINMENT COMMUNIC",
    "state": null,
    "summary": "ShengHua Entertainment Communication co.,Ltd. engages in the television program production and screenwriting, film production and distribution, and art performing activities in Taiwan and China. It also provides drama series, as well as engages in the literary and artistic creation, corporate image planning, actor brokerage, and graphic system businesses. In addition, it is involved in the investment consulting, business management consulting, and business information consulting activities. The company was formerly known as Shenghua Entertainment Production Co., Ltd. and changed its name to ShengHua Entertainment Communication co.,Ltd. in June 2012. ShengHua Entertainment Communication co.,Ltd. was founded in 2000 and is based in Taipei, Taiwan.",
    "website": "http://www.shec.com.tw",
    "zipcode": null
  },
  "6144.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Entertainment",
    "long_name": "Deltamac(Taiwan) Co.,Ltd.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "DELTAMAC(TAIWAN) CO LTD",
    "state": null,
    "summary": "Deltamac(Taiwan) Co.,Ltd. produces, distributes, and franchises audio and video products in Taiwan. The company engages in production, recording, publication, rental, distribution, and export/import of TV and film program DVD, BD and 4K UHD discs, and music CDs. It is also involved in the agency and sale of physical and digital copyrights of movies; operation of TSUTAYA bookstores and Wired Tokyo cafés; and provision of catering services. In addition, the company sells stationery products and delicatessen. Deltamac(Taiwan) Co.,Ltd. was founded in 1995 and is headquartered in Taipei City, Taiwan.",
    "website": "http://www.deltamac.com.tw",
    "zipcode": null
  },
  "6184.TW": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Entertainment",
    "long_name": "Dafeng TV Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "DAFENG TV LIMITED",
    "state": null,
    "summary": "Dafeng TV Ltd. provides digital cable TV services. It also offers CATV cable services. The company was formerly known as Dah Fung CATV Co. Ltd. and changed its name to Dafeng TV Ltd. in December 2009. Dafeng TV Ltd. was founded in 1996 and is based in New Taipei City, Taiwan.",
    "website": "http://www.dafeng.tv",
    "zipcode": null
  },
  "6464.TW": {
    "city": "Taichung City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Entertainment",
    "long_name": "Taiwan Optical Platform Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "TAIWAN OPTICAL PLATFORM CO LTD",
    "state": null,
    "summary": "Taiwan Optical Platform Co., Ltd. operates as a multiple system operator of cable television in Taiwan. It offers cable TV-related services, including broadcasting, installation, advertisements, channel leasing, paid channels, etc. The company also provides telecommunication services, such as broadband Internet, urban networks, and circuit leasing. In addition, it operates television channels; and produces and broadcasts local news and public forum programs. The company was formerly known as Bao Yue Investment Co., Ltd. and changed its name to Taiwan Optical Platform Co., Ltd. in January 2013. Taiwan Optical Platform Co., Ltd. was founded in 2006 and is based in Taichung City, Taiwan.",
    "website": "http://www.topmso.com.tw",
    "zipcode": "407"
  },
  "6583.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Entertainment",
    "long_name": "Jason's Entertainment Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "JTV",
    "state": null,
    "summary": "Jason's Entertainment Co., Ltd. produces television shows and dramas in Taiwan. The company also distributes and brokerages artists; and offers project marketing services. The company was founded in 1996 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.jtv.com.tw",
    "zipcode": null
  },
  "6595.TWO": {
    "city": "Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Entertainment",
    "long_name": "Julien's International Entertainment Group",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "Juliens Group",
    "state": null,
    "summary": "Julien's International Entertainment Group provides digital multimedia technology solutions worldwide. Its activities include theme park development and project management; digital content development, production, and distribution; floating theater and theme park equipment development; and investment in and development of Xingyu Cinema Park. The company was founded in 2013 and is headquartered in Taipei City, Taiwan.",
    "website": "http://www.juliensgroup.com",
    "zipcode": null
  },
  "6596.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Entertainment",
    "long_name": "Kuang Hong Arts Management Incorporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "KUANG HONG ARTS MANAGEMENT INC",
    "state": null,
    "summary": "Kuang Hong Arts Management Incorporation engages in the promotion of art and cultural activities in Taiwan and internationally. It provides services in the areas of music, dance, exhibition, concert, drama, physical education, parenting, lecture, film, commodity, and package goods. The company was formerly known as Yucai International Marketing Co., Ltd. and changed its name to Kuang Hong Arts Management Incorporation in July 2014. Kuang Hong Arts Management Incorporation was founded in 2004 and is based in Taipei, Taiwan.",
    "website": "http://www.kham.com.tw",
    "zipcode": null
  },
  "6622.TWO": {
    "city": "Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Entertainment",
    "long_name": "Bossdom Digiinnovation Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "Bossdom Digi",
    "state": null,
    "summary": "Bossdom Digiinnovation Co., Ltd. provides various content encoding services. It offers filming production, full feature post-production, VFX, animation, digital production, movie content aggregator, text localization, and digital color grading services. The company was founded in 1991 and is based in Taipei City, Taiwan.",
    "website": "http://www.bossdom.com",
    "zipcode": "11492"
  },
  "6688.TWO": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Entertainment",
    "long_name": "Deepjoy Picture Corporation",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "Deepjoy",
    "state": null,
    "summary": "Deepjoy Picture Corporation engages in the film distribution, digital and TV copyright licensing, home video and audio distribution, and film investment businesses in Taiwan. It operates 100 DVD-owned cooperation channels; 92 movie theaters; and 5 cable TV channels, as well as OTT digital platforms. The company was founded in 2004 and is based in Taipei City, Taiwan.",
    "website": "http://www.deepjoy.com.tw",
    "zipcode": "241"
  },
  "8450.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Entertainment",
    "long_name": "Pili International Multimedia Co.,Ltd.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "PILI INTL MULTIMEDIA CO LTD",
    "state": null,
    "summary": "Pili International Multimedia Co.,Ltd. produces and distributes dramatic puppetry series in Taiwan. It is also involved in the Pili satellite television station; production and distribution of DVD's and soundtrack; performance and movie activities; publications and posters, etc.; and licensing development of peripheral products. In addition, the company fan club and cosplay activity; operates puppetry community Website; manages allied counters and boutiques in Taiwan; and produces and distributes 3D animation. The company was formerly known as Da Chih Entertainment Co., Ltd. and changed its name to Pili International Multimedia Co.,Ltd. in August 2000. Pili International Multimedia Co.,Ltd. was founded in 1996 and is headquartered in Taipei City, Taiwan.",
    "website": "http://www.pili.com.tw",
    "zipcode": "115"
  },
  "8487.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Entertainment",
    "long_name": "ELTA Technology Co.,Ltd.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Communication Services",
    "short_name": "ELTA",
    "state": null,
    "summary": "ELTA Technology Co.,Ltd. operates platform for digital content in Taiwan. The company has library of digital content and broadband-delivered AV materials. It offers IP/TV (STB or MOD), PC/TV, VOD, and mobile TV, as well as large-sized data transfer technology and wireless communications support services. The company was founded in 2000 and is based in Taipei City, Taiwan.",
    "website": "http://www.elta.com.tw",
    "zipcode": "100"
  }
}
