{
    "1957.HK": {
        "short_name": "MBV INTL",
        "long_name": "MBV International Limited",
        "summary": "MBV International Limited, an investment holding company, engages in sourcing, wholesaling, supplying, and marketing imprintable apparel and gift products in Malaysia and Singapore. It provides a portfolio of imprintable apparel, including T-shirts, uniforms, and jackets, as well as other casual wear and accessories The company sells its products through direct selling by its sales representatives, as well as from its printed product catalogues and online platform. It serves shop retailers, garment trading and processing companies, and end consumers and others. The company was founded in 1995 and is headquartered in Johor Bahru, Malaysia. MBV International Limited is a subsidiary of MBV Capital Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Malaysia",
        "state": null,
        "city": "Johor Bahru",
        "zipcode": "81100",
        "website": "http://www.orensport.com",
        "full_time_employees": 410
    },
    "5EL.SI": {
        "short_name": "$ Lasseters Intl",
        "long_name": "Lasseters International Holdings Limited",
        "summary": "Lasseters International Holdings Limited, an investment holding company, engages in the land-based gaming and hospitality businesses under The Golden Door brand in Australia and Malaysia. The company operates through three segments: Casino, Spa and Wellness, and Property Development. The Casino segment offers gaming facilities, accommodation, a convention centre, food and beverages outlets, bars, commercial gym, and spa. The Spa and Wellness segment provides spa and wellness programs, gym, and retail outlets. The Property Development segment is involved in the property investment and management, and property and hospitality development activities. Lasseters International Holdings Limited was founded in 2004 and is based in Petaling Jaya, Malaysia.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "state": null,
        "city": "Petaling Jaya",
        "zipcode": "46100",
        "website": "http://www.lasseters-intl.com",
        "full_time_employees": null
    },
    "6163.HK": {
        "short_name": "GEMILANG INTL",
        "long_name": "Gemilang International Limited",
        "summary": "Gemilang International Limited designs, manufactures, and assembles buses and bus bodies in Malaysia and Singapore. Its products include single deck, double deck, and articulated city buses, as well as single deck, double deck, and high deck coaches. The company is also involved in the fabrication of body works for buses; and trading of body kits and spare parts for buses, as well as provides after-sales and maintenance services for buses. It serves public and private bus transportation operators, chassis principals and their purchasing agents, bus assemblers, and manufacturers. The company also exports its products to Australia, Hong Kong, Uzbekistan, the United Arab Emirates, and internationally. Gemilang International Limited was founded in 1989 and is headquartered in Senai, Malaysia.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Malaysia",
        "state": null,
        "city": "Senai",
        "zipcode": "81400",
        "website": "http://www.gml.com.my",
        "full_time_employees": 332
    },
    "8383.HK": {
        "short_name": "LINOCRAFT HLDGS",
        "long_name": "Linocraft Holdings Limited",
        "summary": "Linocraft Holdings Limited, an investment holding company, provides integrated offset printing and packaging solutions to direct customers and contract manufacturers in Malaysia, Singapore, and the Philippines. Its products include packaging boxes, rigid boxes, paper-board inserts, instruction manuals and books, and printed labels, as well as blister packs and box fillers, folding cartons, and case covers. The company was founded in 1972 and is headquartered in Johor Bahru, Malaysia. Linocraft Holdings Limited is a subsidiary of Linocraft Investment Pte Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Malaysia",
        "state": null,
        "city": "Johor Bahru",
        "zipcode": "81300",
        "website": "http://www.linocraftprinters.com",
        "full_time_employees": 894
    },
    "8480.HK": {
        "short_name": "FURNIWEB",
        "long_name": "Furniweb Holdings Limited",
        "summary": "Furniweb Holdings Limited, an investment holding company, manufactures and sells elastic textile, webbings, and polyvinyl chloride (PVC) related products in Malaysia, Vietnam, rest of the Asia Pacific, Europe, North America, and internationally. It operates in two segments, Manufacturing and Retail. The company offers upholstery, safety, rigid, and furniture webbing products, as well as covered elastic yarns; and rubber strips and sheets. It is also involved in the trading of machinery and accessories; retail sale of clothing, footwear, and ancillary products; and property holding business, as well as trades in and sells PVC and other plastic products. The company's products are used in the apparel, intimate apparel, food packaging, furniture, automotive, household appliance, and health care industries, as well as in PVC related products. Furniweb Holdings Limited was founded in 1987 and is headquartered in Seri Kembangan, Malaysia. Furniweb Holdings Limited is a subsidiary of PRG Holdings Berhad.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Malaysia",
        "state": null,
        "city": "Seri Kembangan",
        "zipcode": "43300",
        "website": "http://furniweb.com.my",
        "full_time_employees": 559
    },
    "GEBHF": {
        "short_name": "GENTING BERHAD",
        "long_name": "Genting Berhad",
        "summary": "Genting Berhad, an investment holding company, engages in leisure and hospitality, oil palm plantation, power generation, oil and gas, property development and management, life sciences, and biotechnology businesses in Malaysia and internationally. Its Leisure & Hospitality segment is involved in gaming, hotels, food and beverages, theme parks, retail, entertainment and attractions, and tours and travel related businesses; the development and operation of resorts; and provision of other support services. The company's Plantation segment operates oil palm plantations, and palm oil milling and related activities. Its Power segment generates and supplies electric power. The company's Property segment develops and invests in properties. Its Oil & Gas segment explores for, develops, and produces oil and gas. The company also offers offshore financing; advisory, technical, and administrative services to oil and gas companies; and risk and insurance management consultancy services, as well as issues private debt securities and licenses intellectual property rights. In addition, it manufactures and sells biodiesel; and processes fresh fruit bunches. Further, the company provides project management, technical, and other management services; researches and develops technologies for genetic analysis and sequencing for oncology applications. Additionally, it creates platform for early diagnosis and treatment of Alzheimer's and other neurodegenerative diseases; and undertakes the collection, analysis, and testing of specimens, samples, and/or data for research and evaluation activities. It also engages in the leasing of land rigs; provision of information technology services relating to the gaming and resort industry; and provision of international sales and marketing services, and corporate services. Genting Berhad was founded in 1965 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50250",
        "website": "http://www.genting.com",
        "full_time_employees": null
    },
    "GEBHY": {
        "short_name": "GENTING BERHAD",
        "long_name": "Genting Berhad",
        "summary": "Genting Berhad, an investment holding company, engages in leisure and hospitality, oil palm plantation, power generation, oil and gas, property development and management, life sciences, and biotechnology businesses in Malaysia and internationally. Its Leisure & Hospitality segment is involved in gaming, hotels, food and beverages, theme parks, retail, entertainment and attractions, and tours and travel related businesses; the development and operation of resorts; and provision of other support services. The company's Plantation segment operates oil palm plantations, and palm oil milling and related activities. Its Power segment generates and supplies electric power. The company's Property segment develops and invests in properties. Its Oil & Gas segment explores for, develops, and produces oil and gas. The company also offers offshore financing; advisory, technical, and administrative services to oil and gas companies; and risk and insurance management consultancy services, as well as issues private debt securities and licenses intellectual property rights. In addition, it manufactures and sells biodiesel; and processes fresh fruit bunches. Further, the company provides project management, technical, and other management services; researches and develops technologies for genetic analysis and sequencing for oncology applications. Additionally, it creates platform for early diagnosis and treatment of Alzheimer's and other neurodegenerative diseases; and undertakes the collection, analysis, and testing of specimens, samples, and/or data for research and evaluation activities. It also engages in the leasing of land rigs; provision of information technology services relating to the gaming and resort industry; and provision of international sales and marketing services, and corporate services. Genting Berhad was founded in 1965 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50250",
        "website": "http://www.genting.com",
        "full_time_employees": null
    },
    "GMALF": {
        "short_name": "GENTING MALAYSIA BHD",
        "long_name": "Genting Malaysia Berhad",
        "summary": "Genting Malaysia Berhad engages in the leisure and hospitality business in Malaysia, the United Kingdom, Egypt, the United States, and the Bahamas. It operates through Leisure & Hospitality, and Properties segments. The Leisure & Hospitality segment comprises integrated resort activities, which include gaming, hotels, food and beverage, theme parks, and retail and entertainment attractions, as well as tours and travel related, and other supporting services. The Properties segment is involved in the development and sale of land and properties, as well as letting of apartment units; and property investment and management activities. It also engages in the operation of casinos; and provision of information technology and consultancy services. In addition, the company provides investment, marketing, private debt securities issuance, training, administrative, show agency, condotel, golf resort, cable car and related support, creative and art, project and construction management, offshore financing, karaoke, payment and collection agency, online gaming, loyalty programme, garbage collection and disposal, sewerage, investment trading, reinsurance, and resort management services. Further, it offers electricity supply, water, liquefied petroleum gas, and other services at Genting Highlands; operates sportsbooks; owns and operates aircraft; owns sea vessels; researches and develops software; and operates a video lottery facility. The company was formerly known as Resorts World Bhd. Genting Malaysia Berhad was incorporated in 1980 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50250",
        "website": "http://www.gentingmalaysia.com",
        "full_time_employees": null
    },
    "GMALY": {
        "short_name": "GENTING MALAYSIA BHD",
        "long_name": "Genting Malaysia Berhad",
        "summary": "Genting Malaysia Berhad engages in the leisure and hospitality business in Malaysia, the United Kingdom, Egypt, the United States, and the Bahamas. It operates through Leisure & Hospitality, and Properties segments. The Leisure & Hospitality segment comprises integrated resort activities, which include gaming, hotels, food and beverage, theme parks, and retail and entertainment attractions, as well as tours and travel related, and other supporting services. The Properties segment is involved in the development and sale of land and properties, as well as letting of apartment units; and property investment and management activities. It also engages in the operation of casinos; and provision of information technology and consultancy services. In addition, the company provides investment, marketing, private debt securities issuance, training, administrative, show agency, condotel, golf resort, cable car and related support, creative and art, project and construction management, offshore financing, karaoke, payment and collection agency, online gaming, loyalty programme, garbage collection and disposal, sewerage, investment trading, reinsurance, and resort management services. Further, it offers electricity supply, water, liquefied petroleum gas, and other services at Genting Highlands; operates sportsbooks; owns and operates aircraft; owns sea vessels; researches and develops software; and operates a video lottery facility. The company was formerly known as Resorts World Bhd. Genting Malaysia Berhad was incorporated in 1980 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50250",
        "website": "http://www.gentingmalaysia.com",
        "full_time_employees": null
    },
    "HWGG": {
        "short_name": "HWGG ENTMT LTD",
        "long_name": "HWGG Entertainment Limited",
        "summary": "HWGG Entertainment Limited engages in promoting entertainment membership, junket operating, and marketing of real estate property activities. It promotes travel and entertainment services to resorts and cruises in the Asia region; and develops and invests in real estate properties. The company was formerly known as Ho Wah Genting Group Limited and changed its name to HWGG Entertainment Limited in September 2020. HWGG Entertainment Limited was incorporated in 2014 and is based in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50150",
        "website": "http://www.hwgg.com.my",
        "full_time_employees": 11
    },
    "SMEBF": {
        "short_name": "SIME DARBY BERHAD",
        "long_name": "Sime Darby Berhad",
        "summary": "Sime Darby Berhad, an investment holding company, operates in the industrial, motors, logistics, healthcare, and other businesses in Malaysia and internationally. It manufactures, assembles, and sells generators, and agricultural and industrial machineries; markets, installs, rents, and services security products; markets and installs electronic and electro-mechanical equipment, instruments, and systems integration; sells, rents, and assembles Caterpillar equipment and spare parts; reconditions used equipment and machineries; supplies global positioning systems/digital work site positioning, and machine control products for heavy and highway construction applications; sells lift trucks and spare parts, and services other material handling equipment; imports and sells technical, nautical, and scientific instruments, as well as mechanical, electrical, and electronic equipment; and sells, hires, and services survey and marine equipment. The company also provides heat exchangers, radiators, process equipment modules, filters, and separators; training and security services; and consultancy and other services for installation, operation, repair, and maintenance of industrial machines, equipment, and vehicles. In addition, it manufactures, sells, and distributes passenger and light commercial vehicles, and spare parts; imports and distributes motor vehicles; offers vehicle rental services; and engages in general investment activities. Further, the company provides port and warehousing services; tugboat pilot, container, property management, and childcare services; and owns and manages logistics parks. Additionally, it operates hospitals; provides insurance and reinsurance brokerage, and advisory services; and sells Trimble technical solutions, as well as provides engineering, procurement, construction, installation, hook-up, and commissioning services related to oil and gas industry. The company was founded in 1910 and is headquartered in Petaling Jaya, Malaysia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Petaling Jaya",
        "zipcode": "47301",
        "website": "http://www.simedarby.com",
        "full_time_employees": 20920
    },
    "UMHL": {
        "short_name": "UMATRIN HOLDING LIMITED",
        "long_name": "Umatrin Holding Limited",
        "summary": "Umatrin Holding Limited, together with its subsidiaries, sells and trades in non-toxic beauty, personal care, health, and wellness products in Malaysia. Its products include Akero Afatelo, a nutrient product which contains telomerase and spirulina; Akero Karela that provides human body with the desired nutrient balance, activate cells, and strengthen the body organs; Unibersih for the treatment of constipation, pigmentation, overweight, bad breath, unsound sleep, lack of physical strength, indigestion, abdominal swelling, dry and pale skin, poor immune system, etc.; Sophielicous, an anti-aging supplement to enhance the longevity of skin cells; and AKERO SECRET, an anti-aging skin care series that include moisturizing cleansing foams, facial toners, brightening serums, soothing emulsions, and ageless and protective sunscreen creams. The company also offers Akero beauty serum to neutralize and repair the effects of emotional and environmental stress on the skin; Resveratrol, a natural antioxidant to reduce blood viscosity, inhibit platelet aggregation and vasodilation, maintain blood flow, and prevent the occurrence and development of various cardiovascular problems; Akero Gold Mask helps to renew skin and improve blood circulation, and is high in antioxidants and minerals; Akero Warming Lipstick; and Akero Feminine Wash, a specially designed sulfate-free intimate wash for a woman's special cleansing needs. It markets its products to retail-based end-users and dealers through an online platform; and a retail shop. The company is based in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "57000",
        "website": "http://www.akero.club",
        "full_time_employees": 22
    },
    "URR.SI": {
        "short_name": "$ Sim Leisure",
        "long_name": "Sim Leisure Group Ltd.",
        "summary": "Sim Leisure Group Ltd., an investment holding company, develops and operates theme parks in Penang, Malaysia. The company operates ESCAPE Adventureplay, a theme park; ESCAPE Waterplay, a water park; and ESCAPE Gravityplay, a theme park. Sim Leisure Group Ltd. was incorporated in 2018 and is based in Teluk Bahang, Malaysia.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "state": null,
        "city": "Teluk Bahang",
        "zipcode": "11050",
        "website": "http://www.simleisure.com",
        "full_time_employees": null
    },
    "VXEL": {
        "short_name": "VITAXEL GROUP LIMITED",
        "long_name": "Vitaxel Group Limited",
        "summary": "Vitaxel Group Limited, through its subsidiaries, operates as a direct selling and multi-level marketing company primarily in Malaysia. It offers travel, entertainment, lifestyle, and other products and services primarily through electronic commerce. The company operates Vionmarket, a rebate website that provides retail sales direct to consumers; VTrips, a platform that offers concessionary and travel packages; and VMall, an e-commerce platform. Vitaxel Group Limited is based in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50150",
        "website": "http://www.vitaxel.com",
        "full_time_employees": 10
    }
}