{
    "UMHL": {
        "short_name": "UMATRIN HOLDING LIMITED",
        "long_name": "Umatrin Holding Limited",
        "summary": "Umatrin Holding Limited, together with its subsidiaries, sells and trades in non-toxic beauty, personal care, health, and wellness products in Malaysia. Its products include Akero Afatelo, a nutrient product which contains telomerase and spirulina; Akero Karela that provides human body with the desired nutrient balance, activate cells, and strengthen the body organs; Unibersih for the treatment of constipation, pigmentation, overweight, bad breath, unsound sleep, lack of physical strength, indigestion, abdominal swelling, dry and pale skin, poor immune system, etc.; Sophielicous, an anti-aging supplement to enhance the longevity of skin cells; and AKERO SECRET, an anti-aging skin care series that include moisturizing cleansing foams, facial toners, brightening serums, soothing emulsions, and ageless and protective sunscreen creams. The company also offers Akero beauty serum to neutralize and repair the effects of emotional and environmental stress on the skin; Resveratrol, a natural antioxidant to reduce blood viscosity, inhibit platelet aggregation and vasodilation, maintain blood flow, and prevent the occurrence and development of various cardiovascular problems; Akero Gold Mask helps to renew skin and improve blood circulation, and is high in antioxidants and minerals; Akero Warming Lipstick; and Akero Feminine Wash, a specially designed sulfate-free intimate wash for a woman's special cleansing needs. It markets its products to retail-based end-users and dealers through an online platform; and a retail shop. The company is based in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "57000",
        "website": "http://www.akero.club",
        "market_cap": 4196212
    }
}