{
    "038.F": {
        "short_name": "NOVOCURE LTD",
        "long_name": "NovoCure Limited",
        "summary": "NovoCure Limited, an oncology company, engages in the development, manufacture, and commercialization of Optune for the treatment of a variety of solid tumors. The company markets Optune and Optune Lua, a Tumor Treating Fields delivery system for use as a monotherapy treatment for adult patients with glioblastoma. It is also developing products for brain metastases, non-small cell lung cancer, pancreatic cancer, gastric cancer, ovarian cancer, liver cancer, and mesothelioma. The company markets its products in the European Union, Japan, and internationally. It has a clinical trial collaboration agreement with MSD to evaluate tumor treating fields together with KEYTRUDA, an anti-PD-1 therapy; and a strategic alliance with the NYU Grossman School of Medicine's Department of Radiation Oncology that provides a framework for preclinical and clinical development projects studying Tumor Treating Fields. NovoCure Limited was founded in 2000 and is based in Saint Helier, Jersey.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Jersey",
        "state": null,
        "city": "Saint Helier",
        "zipcode": "JE2 4UF",
        "website": "http://www.novocure.com",
        "market_cap": "Large Cap"
    },
    "IDHC.L": {
        "short_name": "INTEGRATED DIAGNOSTICS HOLDINGS",
        "long_name": "Integrated Diagnostics Holdings plc",
        "summary": "Integrated Diagnostics Holdings plc, a consumer healthcare company, provides various medical diagnostics services to patients. It offers approximately 2,000 diagnostic test services, including immunology, microbiology, hematology, endocrinology, clinical chemistry, molecular biology, cytogenetics, histopathology, and radiology. The company operates in Egypt, Jordan, Sudan, and Nigeria. As of December 31, 2020, it operated a network of 481 branch labs. The company was founded in 1979 and is headquartered in Saint Helier, Jersey.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Jersey",
        "state": null,
        "city": "Saint Helier",
        "zipcode": "JE2 3RT",
        "website": "http://www.idhcorp.com",
        "market_cap": "Small Cap"
    },
    "IQAI.L": {
        "short_name": "IQ-AI LIMITED ORD GBP0.01",
        "long_name": "IQ-AI Limited",
        "summary": "IQ-AI Limited, through its subsidiaries, develops software applications for the healthcare industry in Jersey and the United States. Its products include IB Clinic, a toolkit of post-processing software plug-ins for integrating into existing medical image visualization applications; IB Rad Tech, a workflow engine that processes customized workflows; IB Neuro, which analyzes MR data sets and generates parametric perfusion maps quantifying changes in contrast over time; and IB Delta Suite that performs a various fundamental radiology operations, including image co-registration, subtraction, class map generation, and export. The company also offers IB DCE, which analyzes conventional T1 weighted images and generates an array of relevant perfusion and permeability parameters; IB Diffusion that analyzes MR diffusion-weighted images and generates apparent diffusion coefficient, extrapolated b-value, IVIM, and other parameter maps; and StoneChecker, a medical software tool to aid clinical decision making by providing information about a patient's kidney stone. In addition, it provides consulting services. The company was formerly known as Flying Brands Limited and changed its name to IQ-AI Limited in October 2018. IQ-AI Limited is based in Saint Helier, Jersey.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Jersey",
        "state": null,
        "city": "Saint Helier",
        "zipcode": "JE4 8TQ",
        "website": "http://www.imagingbiometrics.com/iq-ai-ltd",
        "market_cap": null
    },
    "NVCR": {
        "short_name": "NovoCure Limited",
        "long_name": "NovoCure Limited",
        "summary": "NovoCure Limited, an oncology company, engages in the development, manufacture, and commercialization of Optune for the treatment of a variety of solid tumors. The company markets Optune and Optune Lua, a Tumor Treating Fields delivery system for use as a monotherapy treatment for adult patients with glioblastoma. It is also developing products for brain metastases, non-small cell lung cancer, pancreatic cancer, gastric cancer, ovarian cancer, liver cancer, and mesothelioma. The company markets its products in the European Union, Japan, and internationally. It has a clinical trial collaboration agreement with MSD to evaluate tumor treating fields together with KEYTRUDA, an anti-PD-1 therapy; and a strategic alliance with the NYU Grossman School of Medicine's Department of Radiation Oncology that provides a framework for preclinical and clinical development projects studying Tumor Treating Fields. NovoCure Limited was founded in 2000 and is based in Saint Helier, Jersey.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Jersey",
        "state": null,
        "city": "Saint Helier",
        "zipcode": "JE2 4UF",
        "website": "http://www.novocure.com",
        "market_cap": "Large Cap"
    }
}