{
    "1183.HK": {
        "short_name": "MECOM POWER",
        "long_name": "MECOM Power and Construction Limited",
        "summary": "MECOM Power and Construction Limited, an investment holding company, operates as an integrated construction engineering contractor in Macau. The company operates through three segments: Construction and Fitting Out Works; High Voltage Power Substation Construction and Its System Installation Works; and Facilities Management Services. It provides steel structure erection services, including structural steelworks, concreting and builder works, and combination of various other services; civil engineering construction services, such as demolition, ground field investigation, site formation, and foundation works, as well as substructures and superstructures, roads, and drainage works; and fitting out and renovation works comprising alteration, renovation, and upgrading works. The company also undertakes high voltage power substation construction and its system installation works, including planning, scheduling, project management, and construction of customized high voltage substations and power transmission infrastructure with installation of high voltage power systems. In addition, it offers facilities operation and maintenance management, alteration, upgrading, maintenance works, and emergency repair of various buildings, properties, and their components, as well as high voltage power substations and related systems. The company was founded in 2000 and is headquartered in Macau. MECOM Power and Construction Limited is a subsidiary of MECOM Holding Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Macau",
        "city": "Macau"
    },
    "1408.HK": {
        "short_name": "MACAU E&M",
        "long_name": "Macau E&M Holding Limited",
        "summary": "Macau E&M Holding Limited, an investment holding company, offers electrical and mechanical engineering contract works in Macau. The company supplies and installs LV systems, such as cables, earthing, lighting systems, power cables, electrical wiring, switchboards, power outlets, and other related electrical equipment for power supply and distribution in a building; and HVAC systems, including variable refrigerant volume units, and ventilation and exhaust air systems for buildings, as well as related pipes, ducts, air-conditioning units, ventilation fans, and other related equipment. It also procures and installs ELV systems comprising telephones, CCTVs, and other systems in a building that require a transmission signal; and offers related testing and commissioning works. The company was founded in 2011 and is headquartered in Macau.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Macau",
        "city": "Macau"
    },
    "1615.HK": {
        "short_name": "AB BUILDERS",
        "long_name": "AB Builders Group Limited",
        "summary": "AB Builders Group Limited, an investment holding company, provides structural and fitting-out works services in Macau. It also offers building construction and engineering services in Hong Kong. The company was founded in 1998 and is headquartered in Macau.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Macau",
        "city": "Macau"
    },
    "1722.HK": {
        "short_name": "KIN PANG HLDGS",
        "long_name": "Kin Pang Holdings Limited",
        "summary": "Kin Pang Holdings Limited, an investment holding company, engages in the civil engineering business in Macau and Hong Kong. It operates through Building and Ancillary Services, and Emergency Repair Services segments. The Building and Ancillary Services segment is involved in the foundation associated works, hard landscaping, alteration and addition works, road works, water pipe works, electrical and mechanical works, and other ancillary building works. The Emergency Repair Services segment provides repair services for infrastructure of electricity and water supply on a term contract basis. The company also engages in the management of machineries. The company was founded in 2006 and is headquartered in Macau. Kin Pang Holdings Limited is a subsidiary of Fortunate Year Investments Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Macau",
        "city": "Macau"
    },
    "2296.HK": {
        "short_name": "HUARCHI GLOBAL",
        "long_name": "Huarchi Global Group Holdings Limited",
        "summary": "Huarchi Global Group Holdings Limited operates as a fitting-out contracting company in Macau. It offers fitting-out services to new and existing buildings; construction works, including foundation works, and buildings services systems installation; structural calculation and shop drawing, procurement of materials, site supervision, management of subcontractors, and project management services; and repair and maintenance services, including repair or replacement of interior decorative parts, and installation of CCTV and air-conditioning systems. The company was founded in 2003 and is headquartered in Macau. Huarchi Global Group Holdings Limited is a subsidiary Seong Wa Holdings Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Macau",
        "city": "Macau"
    }
}