{"AIMIRT.BK": {"short_name": "AIM INDUSTRIAL GROWTH FREEHOLD ", "long_name": "AIM Industrial Growth Freehold and Leasehold Real Estate Investment Trust", "summary": "AIM Industrial Growth Freehold and Leasehold Real Estate Investment Trust focuses on investing in freehold right of land, cold storage buildings, and immovable assets related to cold storage and warehouses in Thailand. These are located in Samut Sakhon and Chachoengsao areas with total leasable area of 36,908.00 sq.m. It also intends to invest in freehold right of land and warehouses, including 5 units of warehouses with total leasable area of 21,651 sq.m. in Bang Phi, Samut Prakan. The company is based in Bangkok, Thailand.", "currency": "THB", "sector": "Real Estate", "industry": "REIT—Industrial", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "AMATAR.BK": {"short_name": "AMATA SUMMIT GROWTH FREEHOLD", "long_name": "Amata Summit Growth Freehold and Leasehold Real Estate Investment Trust", "summary": "Amata Summit Growth Freehold and Leasehold Real Estate Investment Trust is a real estate investment trust externally managed by Amata Summit REIT Management Co., Ltd. It invests in the real estate markets. Amata Summit Growth Freehold and Leasehold Real Estate Investment Trust is based in Bangkok, Thailand.", "currency": "THB", "sector": "Real Estate", "industry": "REIT—Industrial", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "FTREIT.BK": {"short_name": "FRASERS PROPERTY THAILAND INDUS", "long_name": "Ticon Freehold and Leasehold Real Estate Investment Trust", "summary": "Ticon Freehold and Leasehold Real Estate Investment Trust is a real estate investment trust externally managed by TICON Management Company Limited. The firm acquire, lease and/or sub-lease of immovable properties. It will take the transfer of the ownership and/or leasehold rights and/or sub-leasehold rights therein and seek benefits from those properties by way of lease, sub-lease, transferring and/or disposing of immovable properties the Trust invests in or acquires. Ticon Freehold and Leasehold Real Estate Investment Trust was formed on December 12, 2014 and is based in Bangkok, Thailand.", "currency": "THB", "sector": "Real Estate", "industry": "REIT—Industrial", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "Bangkok"}, "SSTRT.BK": {"short_name": "SUB SRI THAI REAL ESTATE INVEST", "long_name": "Sub Sri Thai Real Estate Investment Trust", "summary": "Sub Sri Thai Real Estate Investment Trust is a real estate investment trust externally managed by SST REIT Management Company Limited. The firm policy is to invest in main assets that are immovable property or lease rights of immovable property (including sub-lease right to of immovable property) and assets that are the fixtures or accessories of such immovable property, including constructions and other assets that are the fixtures of the land and buildings, instruments, accessories, working systems in the building and other asset released, connected and necessary for exploration of such immovable property. Sub Sri Thai Real Estate Investment Trust was formed on December 13, 2017 and is based in Bangkok, Thailand.", "currency": "THB", "sector": "Real Estate", "industry": "REIT—Industrial", "exchange": "SET", "market": "th_market", "country": "Thailand", "city": "None"}}