{
    "LHSC.BK": {
        "short_name": "LH SHOPPING CENTERS LEASEHOLD",
        "long_name": "LH Shopping Centers Leasehold Real Estate Investment Trust",
        "summary": "LH Shopping Centers Leasehold Real Estate Investment Trust is a real estate investment trust externally managed by Land and Houses Fund Management Company Limited. The firm invest in the leasehold right in the immovable properties and the ownership in the movable properties in Terminal 21 Shopping Center from L&H Property Company Limited in an approximate total area of 97,905 square meters, for an approximate term of 26 years ending on 31 August 2040. LH Shopping Centers Leasehold Real Estate Investment Trust is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10120",
        "website": "http://www.lhscreit.com",
        "full_time_employees": null
    },
    "SPRIME.BK": {
        "short_name": "S PRIME GROWTH LEASEHOLD REAL E",
        "long_name": "S Prime Growth Leasehold Real Estate Investment Trust",
        "summary": "S Prime Growth Leasehold Real Estate Investment Trust operates as a real estate investment trust in Thailand. It invests in office buildings. The company qualifies as a real estate investment trust for federal income tax purposes. It generally would not be subject to federal corporate income taxes if it distributes at least 90% of its taxable income to its stockholders. S Prime Growth Leasehold Real Estate Investment Trust is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10900",
        "website": "http://www.sprimegrowth.com",
        "full_time_employees": null
    },
    "WHART.BK": {
        "short_name": "WHA PREMIUM GROWTH FREEHOLD",
        "long_name": "WHA Premium Growth Freehold And Leasehold Real Estate Investment Trust",
        "summary": "WHA Premium Growth Freehold And Leasehold Real Estate Investment Trust is a real estate investment trust externally managed by WHA Real Estate Management Company Limited. The firm invests mostly in property or property leasehold rights and generate benefit from such properties including to improve, alter, develop or dispose other assets in which the Trust invest or possess whatsoever lease, sub-lease or sale or other process for the benefit of the property and create the revenue and return to the Trust and the unitholders. WHA Premium Growth Freehold And Leasehold Real Estate Investment Trust was formed on December 8, 2014 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10270",
        "website": "http://www.whareit.com/th/home",
        "full_time_employees": null
    }
}