{
    "1341.TW": {
        "short_name": "FULIN PLASTIC INDUSTRY(CAYMAN) ",
        "long_name": "Fulin Plastic Industry (Cayman) Holding Co., Ltd.",
        "summary": "Fulin Plastic Industry (Cayman) Holding Co., Ltd. engages in the production and sale of various polyvinyl chloride artificial leather materials in Vietnam and internationally. It offers latex leather products for furniture, leather handbags, balls, and automobile cushions. The company also provides various tapes, such as transparent, grainy, and other tapes for construction materials, electrical systems, raincoats, curtains, stationary, printing products, etc. In addition, it offers soft leather for furniture, leather handbags, and cushions of bicycles, including laminated fabrics, non-woven fabrics, etc. The company was founded in 1997 and is headquartered in Hai Phong, Vietnam.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Vietnam",
        "state": null,
        "city": "Hai phong",
        "zipcode": null,
        "website": "http://www.fulinvn.com",
        "market_cap": "Mid Cap"
    },
    "8480.TW": {
        "short_name": "TAISUN INT.L (HOLDING) CO",
        "long_name": "Taisun Int'l (Holding) Corporation",
        "summary": "Taisun Int'l (Holding) Corporation, together with its subsidiaries, manufactures and sells disposable baby diapers, adult incontinent, feminine sanitary napkins, and wet tissues products. Its brands include UniDry, Sunmed, SunMate, Yo Yo, Sunfree, and Unifresh. The company exports its products to approximately 20 countries worldwide. Taisun Int'l (Holding) Corporation was founded in 2001 and is headquartered in Ho Chi Minh City, Vietnam.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Vietnam",
        "state": null,
        "city": "Ho Chi Minh City",
        "zipcode": null,
        "website": "http://www.taisunholding.com",
        "market_cap": "Mid Cap"
    },
    "900140.KS": {
        "short_name": "LVMC Holdings",
        "long_name": "LVMC Holdings",
        "summary": "LVMC Holdings manufactures and distributes automobiles and motorcycles in Vietnam and internationally. The company sells automobiles, commercial trucks, and heavy equipment, as well as provides after-sales and installment finance services; and manufactures, sells, and exports DAEHAN brand cars. It also manufactures, sells, exports, and services motorcycles under the KOLAO name; sells parts and accessories of automobiles and motorcycles; and provides maintenance services for automobiles and motorcycles. In addition, LVMC Holdings engages in used car trading business; and providing rental services. The company was formerly known as KOLAO Holdings and changed its name to LVMC Holdings in 2018. LVMC Holdings was founded in 1997 and is based in Ho Chi Minh City, Vietnam.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "Vietnam",
        "state": null,
        "city": "Ho Chi Minh City",
        "zipcode": null,
        "website": "http://www.lvmcholdings.net",
        "market_cap": "Large Cap"
    }
}