{
    "DAVAN.MX": {
        "short_name": "ENDAVA PLC",
        "long_name": "Endava plc",
        "summary": "Endava plc provides technology services for clients in the consumer products, healthcare, logistics, and retail verticals in Europe, Latin America, and North America. It offers technology and digital advisory services for financial services, healthcare, manufacturing, retail and consumer, business and support services, and TMT sectors; IT strategies; business analysis services in payments, financial services, asset and wealth management, insurance, telecommunications, and digital media areas; program management services; digital product strategy services; and architecture, extended reality, machine learning and artificial intelligence, product design, and user experience and visual design services. The company also engages in the identifying, defining, and embedding collaborative data and analytics; and provision of automated testing, cloud native software engineering, continuous delivery, distributed agile delivery, intelligent automation, secure development, agile applications management, cloud infrastructure, DevSecOps, service delivery, smart desk, and telemetry and monitoring services. The company was founded in 2000 and is headquartered in London, United Kingdom.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Business Software & Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "ECOS": {
        "short_name": "ECOLOCAP SOLUTIONS INC",
        "long_name": "EcoloCap Solutions Inc.",
        "summary": "EcoloCap Solutions Inc. operates a network of environmentally focused technology companies that utilize advanced nanotechnology to design, develop, manufacture, and sell cleaner alternative energy products in the United States. It offers M-Fuel, an emulsion fuel; NPW series biodiesel processing machines; and ECOS/Bio/ART, an integrated aerobic digestion technology that remediates various organic wastes. The company was formerly known as XL Generation International Inc. and changed its name to Ecolocap Solutions Inc. in November 2007. EcoloCap Solutions Inc. is based in Barrington, Illinois.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Business Software & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Barrington"
    },
    "EVTCN.MX": {
        "short_name": "EVERTEC INC",
        "long_name": "EVERTEC, Inc.",
        "summary": "EVERTEC, Inc. engages in transaction processing business in Latin America and the Caribbean. The company operates through four segments: Payment Services - Puerto Rico & Caribbean; Payment Services - Latin America; Merchant Acquiring; and Business Solutions. It provides merchant acquiring services, which enable point of sales and e-commerce merchants to accept and process electronic methods of payment, such as debit, credit, prepaid, and electronic benefit transfer (EBT) cards. The company also offers payment processing services that enable financial institutions and other issuers to manage, support, and facilitate the processing for credit, debit, prepaid, automated teller machines and EBT card programs; credit and debit card processing, authorization and settlement, and fraud monitoring and control services to debit or credit issuers; and EBT services. In addition, it provides business process management solutions comprising core bank processing, network hosting and management, IT consulting services, business process outsourcing, item and cash processing, and fulfillment solutions to financial institutions, and corporate and government customers. Further, the company owns and operates the ATH network, a personal identification number debit networks in Latin America. It manages a system of electronic payment networks that process approximately two billion transactions. The company sells and distributes its services primarily through a proprietary direct sales force. It serves financial institutions, merchants, corporations, and government agencies. The company was formerly known as Carib Latam Holdings, Inc. EVERTEC, Inc. was founded in 1988 and is headquartered in San Juan, Puerto Rico.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Business Software & Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "San Juan"
    },
    "MFGPN.MX": {
        "short_name": "MICRO FOCUS INTERNATIONAL PLC",
        "long_name": "Micro Focus International plc",
        "summary": "Micro Focus International plc develops, sells, and supports software products and solutions to small and medium size enterprises. The company offers infrastructure software products that are managed on an investment portfolio. Its product portfolio includes application modernization and connectivity, application delivery management, and IT operations management, as well as security, information management, and Governance. Micro Focus International plc was founded in 1976 and is headquartered in Newbury, the United Kingdom.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Business Software & Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "city": "Newbury"
    }
}