{
    "000630.SZ": {
        "short_name": "TONGLING NONFERROU",
        "long_name": "Tongling Nonferrous Metals Group Co.,Ltd.",
        "summary": "Tongling Nonferrous Metals Group Co., Ltd. engages in the exploration, mining, smelting, and processing of copper. The company offers copper cathodes, copper processing materials, copper flat wires, low oxygen copper rods, anodic phosphor bronzes, enameled round copper wires, cables, brass bars, precision copper and copper alloy plates, paper bag flat wires, enameled copper flat wires, transposed wires, and electronic copper foils. It also provides silver, sulfur concentrate products, monosulfide, sulfuric acid, crude nickel sulfate, mineral products, gold and concentrates, iron powder and pellets, and converter slag iron products. The company was founded in 1992 and is based in Tongling, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tongling",
        "zipcode": "244000",
        "website": "http://www.tlys.cn",
        "market_cap": "Mid Cap"
    },
    "002203.SZ": {
        "short_name": "ZHEJIANG HAILIANG",
        "long_name": "Zhe Jiang Hai Liang Co., Ltd",
        "summary": "Zhe Jiang Hai Liang Co., Ltd researches, develops, fabricates, sells, and services copper products in China. The company offers copper tubes, bars, and fittings; aluminum products; and copper-aluminum compound bars, including copper alloy tubes, HVAC tubes, seamless copper water/gas tubes, precision copper bars, copper/brass fittings, aluminum multi-port extrusions, aluminum profiles, and copper-aluminum compound bars, as well as inner grooved copper coils, copper alloy tubes, and lead-free copper bars. It also provides copper pipes, rods, pipe connectors, new conductor materials, copper processing equipment, etc.; and copper coil tubes; copper, brass, and copper-nickle straight tubes; copper, brass, and electrical conduct fittings; copper and brass bars; copper bus bars; aluminum tubes; and denitration catalysts, as well as equipment manufacturing services. The company's products are used in various applications, such as air conditioning and refrigeration, HAVC, water desalination, nuclear power, thermal power, equipment manufacturing, automotive industry, electrical, transportation, hardware machinery, and other industries. It also exports copper pipes and their connectors. The company was founded in 2001 and is based in Zhuji, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuji",
        "zipcode": "311835",
        "website": "http://www.hailiang.com",
        "market_cap": "Mid Cap"
    },
    "005810.KS": {
        "short_name": "POONGSAN HOLDINGS",
        "long_name": "Poongsan Holdings Corporation",
        "summary": "Poongsan Holdings Corporation manufactures and sells copper and nonferrous metal products worldwide. The company offers copper, brozen, bronze alloyed, magnetic, and copper alloyed powders; nickel-based brazing alloys; nano, coated, aluminum, tin, and copper silver powders; and inspection apparatus. It also provides industrial equipment and special tools, such as rolling mill, rolling equipment, and steel pipe equipment; defense industry, civilian industry, and power plant equipment; and automobile molds for automobile transmission. Poongsan Holdings Corporation was founded in 1968 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "120-837",
        "website": "http://www.poongsanhc.co.kr",
        "market_cap": "Small Cap"
    },
    "0358.HK": {
        "short_name": "JIANGXI COPPER",
        "long_name": "Jiangxi Copper Company Limited",
        "summary": "Jiangxi Copper Company Limited engages in exploring, mining, smelting, and refining copper in Mainland China, Hong Kong, and internationally. It offers copper cathodes, copper rods and wires, sulphuric acid, and other products, as well as deposit, loan, guarantee, and financing consultation services. It is involved in the processing and sale of copper and hardware electric products; collection and sale of scrap metals; production and sale of non-ferrous metals, rare metals and non-metals, electrolytic copper foil, spiral and copper tubes, copper and enameled wires, other copper pipe products, and cast iron grinding balls; provision of repair, consulting, and transportation services; exploration, mining, selection, and smelting of gold and chemical; project, industrial, and fund investment, investment management, and investment and economic information advisory services; metallurgical chemistry; equipment manufacturing and maintenance services; and development and production of thermo-electronic semiconductors and appliances. In addition, it engages in the development of chemical technologies; contracting for mining constructions; production and sale of casting products; maintenance of mechanical and electrical equipment; installation and debugging of equipment; sale of building materials; production of copper sulfate and electrolytic copper; scrap of base metals; and geological investigation and survey, and construction and engineering measurement. Further, it is involved in the sale of mineral processing, fine chemical, and other industrial and domestic products; trading of metal products; machinery processing; manufacture and sale of wear resistant materials; corporate asset and operation management, exhibition services, etc.; and trade and settlement of import-export business, offshore investment and financing, cross-border RMB settlement, and research and development activities. The company was incorporated in 1997 and is headquartered in Nanchang, China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330096",
        "website": "http://www.jxcc.com",
        "market_cap": "Large Cap"
    },
    "0505.HK": {
        "short_name": "XINGYE ALLOY",
        "long_name": "Xingye Alloy Materials Group Limited",
        "summary": "Xingye Alloy Materials Group Limited manufactures, sells, and trades in high precision copper plates and strips in Mainland China, Thailand, Taiwan, and internationally. It operates through Copper Products and Online Games segments. The company's products include high precision tin-phosphor bronze strips, copper tin zinc alloys, brass strips, zinc copper strips, multicomponent copper alloys, copper alloy strips, copper alloys, and red copper strips. It also trades in raw materials; develops, publishes, and operates online games and provides related services; and provides processing and property services. The company's products are used in electronic equipment, automobile, and electric power and household appliances. It also exports its products to Southeast Asia, India, and other countries. The company was formerly known as Huan Yue Interactive Holdings Limited and changed its name to Xingye Alloy Materials Group Limited in July 2020. Xingye Alloy Materials Group Limited was founded in 1985 and is headquartered in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.xingyealloy.com",
        "market_cap": "Small Cap"
    },
    "0661.HK": {
        "short_name": "CDAYENONFER",
        "long_name": "China Daye Non-Ferrous Metals Mining Limited",
        "summary": "China Daye Non-Ferrous Metals Mining Limited, an investment holding company, engages in the exploration, development, mining, and processing of mineral ores in the People's Republic of China, Hong Kong, and the Republic of Mongolia. It explores for copper, gold, silver, iron, and molybdenum deposits. The company holds interests in the Tonglvshan and Tongshankou mines located in Daye City; Fengshan and Chimashan mines located in Yangxin County; and Sareke copper mine located in Wuqia County. It is also involved in the trading of metals, minerals, and concentrates; quality testing of construction projects; and provision of research and development services. The company is headquartered in Kowloon, Hong Kong. China Daye Non-Ferrous Metals Mining Limited is a subsidiary of China Times Development Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.hk661.com",
        "market_cap": "Small Cap"
    },
    "1258.HK": {
        "short_name": "CHINFMINING",
        "long_name": "China Nonferrous Mining Corporation Limited",
        "summary": "China Nonferrous Mining Corporation Limited, an investment holding company, engages in the exploration, mining, ore processing, leaching, smelting, and sale of copper cathodes, blister copper, copper anodes, copper-cobalt alloy, cobaltous hydroxide, and sulfuric acid. It offers copper concentrate for use as raw materials for copper smelter; blister copper for use as raw materials for electrolytic copper plant; copper cathode for use in the production of wires and cables, electrical and electronic products, industrial machinery and equipment, etc.; and sulfuric acid for producing chemical fertilizers. The company also engages in the farming activities. It has operations in Mainland China, Hong Kong, Switzerland, Singapore, Africa, and Luxemburg. The company was incorporated in 2011 and is based in Beijing, China. China Nonferrous Mining Corporation Limited is a subsidiary of China Nonferrous Mining Development Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.cnmcl.net",
        "market_cap": "Small Cap"
    },
    "2362.HK": {
        "short_name": "JINCHUAN INTL",
        "long_name": "Jinchuan Group International Resources Co. Ltd",
        "summary": "Jinchuan Group International Resources Co. Ltd, an investment holding company, engages in the mining operations. The company primarily explores for copper, cobalt, copper concentrates, and copper blisters. It operates Ruashi mine, a copper and cobalt mine located in Lubumbashi and Kinsenda mine, a copper mine located in Haut-Katanga Province, the Democratic Republic of the Congo; and Chibuluma South mine located in Zambia, as well as Musonoi and Lubembe projects located in the Democratic Republic of the Congo. The company also trades in copper concentrates, cathode, and blister; cobalt; and other related raw materials. It has operations in Hong Kong, South Africa, the Democratic Republic of the Congo, Switzerland, Zambia, Singapore, and South Korea. The company was founded in 1958 and is headquartered in Admiralty, Hong Kong. Jinchuan Group International Resources Co. Ltd is a subsidiary of Jinchuan (BVI) Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.jinchuan-intl.com",
        "market_cap": "Small Cap"
    },
    "2TU.F": {
        "short_name": "TARUGA MINERALS LTD.",
        "long_name": "Taruga Minerals Limited",
        "summary": "Taruga Minerals Limited explores for mineral properties in Australia. It primarily explores for gold, copper, silver, lithium, and base metal deposits. The company holds a 100% interest in the Yagahong North project located in the Murchison region of Western Australia. It also holds an option to acquire a 100% interest in the Torrens iron-oxide-copper-gold project situated in the Gawler Craton, South Australia; and the Flinders project, which covers an area of approximately 647 square kilometers located in the north of Port Augusta, South Australia. The company was formerly known as Taruga Gold Limited and changed its name to Taruga Minerals Limited in June 2018. Taruga Minerals Limited was incorporated in 2011 and is based in Perth, Australia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6000",
        "website": "http://www.tarugaminerals.com.au",
        "market_cap": "Small Cap"
    },
    "300618.SZ": {
        "short_name": "NANJING HANRUI COB",
        "long_name": "Nanjing Hanrui Cobalt Co.,Ltd.",
        "summary": "Nanjing Hanrui Cobalt Co.,Ltd. engages in the extraction of cobalt and copper ores. The company is also involved in the smelting, research and development, production, and sale of cobalt powder and other cobalt-based powder. Its products include cobalt metal powder, cobalt concentrates, cobalt hydroxide, cobalt salts, copper cathode, etc. The company sells its products in China, South Korea, Japan, Germany, Switzerland, Israel, India, and the United States. Nanjing Hanrui Cobalt Co.,Ltd. was founded in 1997 and is headquartered in Nanjing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "211100",
        "website": "http://www.hrcobalt.com",
        "market_cap": "Mid Cap"
    },
    "300697.SZ": {
        "short_name": "JIANGYIN ELECTRICA",
        "long_name": "Jiangyin Electrical Alloy Co.,Ltd",
        "summary": "Jiangyin Electrical Alloy Co., Ltd. engages in the research and development, production, and sale of non-ferrous metal alloy products in China. The company offers copper rods, copper bars, flat copper bars, profile coil materials, contact wires, messenger wires, forging series products, stamping series products, CNC series products, and electromagnetic wires. Its products are used in medium and low voltage electric, hydropower station, architecture, nuclear power plant, spaceflight, high-speed rail, wind power generation, motor, vessel, and voltage transformer applications. The company was founded in 1985 and is based in Jiangyin, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiangyin",
        "zipcode": "214423",
        "website": "http://www.cn-dghj.com",
        "market_cap": "Small Cap"
    },
    "3N4.SG": {
        "short_name": "China Nonferrous Mining Corp. R",
        "long_name": "China Nonferrous Mining Corporation Limited",
        "summary": "China Nonferrous Mining Corporation Limited, an investment holding company, engages in the exploration, mining, ore processing, leaching, smelting, and sale of copper cathodes, blister copper, copper anodes, copper-cobalt alloy, cobaltous hydroxide, and sulfuric acid. It offers copper concentrate for use as raw materials for copper smelter; blister copper for use as raw materials for electrolytic copper plant; copper cathode for use in the production of wires and cables, electrical and electronic products, industrial machinery and equipment, etc.; and sulfuric acid for producing chemical fertilizers. The company also engages in the farming activities. It has operations in Mainland China, Hong Kong, Switzerland, Singapore, Africa, and Luxemburg. The company was incorporated in 2011 and is based in Beijing, China. China Nonferrous Mining Corporation Limited is a subsidiary of China Nonferrous Mining Development Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.cnmcl.net",
        "market_cap": "Small Cap"
    },
    "4989.TW": {
        "short_name": "LCY TECHNOLOGY CORP",
        "long_name": "LCY Technology Corp.",
        "summary": "LCY Technology Corp. produces and sells copper foil products for the printed circuit board and copper clad laminate manufacturers in Taiwan and internationally. It offers 4oz, 3oz, 2oz, 1oz, 1/2oz, 1/3oz, and 9Âµm copper foils, as well as thin, very low profile, double treatment, and reverse treatment copper foils. The company was founded in 1997 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "105",
        "website": "http://www.lcyt.com.tw",
        "market_cap": "Small Cap"
    },
    "5753.T": {
        "short_name": "NIPPON SHINDO CO",
        "long_name": "Nippon Shindo Co., Ltd.",
        "summary": "Nippon Shindo Co., Ltd. manufactures and sells copper and brass bars, and forged products. The company offers brass rods and bars, as well as wires. Its products are used in gas equipment, plumbing products, and air conditioners in the housing industry; screws, bolts, and nuts in the auto industry; and connectors for personal computers and audio equipment in the electronics industry. Nippon Shindo Co., Ltd. was founded in 1938 and is based in Sakai, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sakai",
        "zipcode": "590-0908",
        "website": "http://www.nippon-shindo.co.jp",
        "market_cap": "Small Cap"
    },
    "5D5.F": {
        "short_name": "ARANJIN RES LTD",
        "long_name": "Aranjin Resources Ltd.",
        "summary": "Aranjin Resources Ltd., together with its subsidiaries, engages in the exploration and development of mineral properties in Mongolia. The company explores for copper deposits. Its flagship asset is the Bayan Undur project located in Bayankhongor province, Mongolia. The company was formerly known as Five Star Diamonds Limited and changed its name to Aranjin Resources Ltd. in June 2020. Aranjin Resources Ltd. was incorporated in 2012 and is based in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T5",
        "website": "http://aranjinresources.com",
        "market_cap": "Small Cap"
    },
    "600255.SS": {
        "short_name": "ANHUI XINKE NEW MATERIALS CO LT",
        "long_name": "Anhui Xinke New Materials Co., Ltd.",
        "summary": "Anhui Xinke New Materials Co., Ltd. engages in the copper processing business in China. It is also involved in the film and television production activities. The company was formerly known as Kingswood Enterprise Co., Ltd. in August 2017. Anhui Xinke New Materials Co., Ltd. was founded in 1998 and is based in Wuhu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhu",
        "zipcode": "241006",
        "website": "http://www.anhuikingswood.com",
        "market_cap": "Small Cap"
    },
    "600362.SS": {
        "short_name": "JIANGXI COPPER CO",
        "long_name": "Jiangxi Copper Company Limited",
        "summary": "Jiangxi Copper Company Limited engages in exploring, mining, smelting, and refining copper in Mainland China, Hong Kong, and internationally. It offers copper cathodes, copper rods and wires, sulphuric acid, and other products, as well as deposit, loan, guarantee, and financing consultation services. It is involved in the processing and sale of copper and hardware electric products; collection and sale of scrap metals; production and sale of non-ferrous metals, rare metals and non-metals, electrolytic copper foil, spiral and copper tubes, copper and enameled wires, other copper pipe products, and cast iron grinding balls; provision of repair, consulting, and transportation services; exploration, mining, selection, and smelting of gold and chemical; project, industrial, and fund investment, investment management, and investment and economic information advisory services; metallurgical chemistry; equipment manufacturing and maintenance services; and development and production of thermo-electronic semiconductors and appliances. In addition, it engages in the development of chemical technologies; contracting for mining constructions; production and sale of casting products; maintenance of mechanical and electrical equipment; installation and debugging of equipment; sale of building materials; production of copper sulfate and electrolytic copper; scrap of base metals; and geological investigation and survey, and construction and engineering measurement. Further, it is involved in the sale of mineral processing, fine chemical, and other industrial and domestic products; trading of metal products; machinery processing; manufacture and sale of wear resistant materials; corporate asset and operation management, exhibition services, etc.; and trade and settlement of import-export business, offshore investment and financing, cross-border RMB settlement, and research and development activities. The company was incorporated in 1997 and is headquartered in Nanchang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330096",
        "website": "http://www.jxcc.com",
        "market_cap": "Large Cap"
    },
    "601137.SS": {
        "short_name": "NINGBO BOWAY ALLOY MATERIAL CO ",
        "long_name": "Ningbo Boway Alloy Material Company Limited",
        "summary": "Ningbo Boway Alloy Material Company Limited researches, develops, manufactures, and sells non-ferrous alloy materials in Asia, Europe, North America, and internationally. It offers alloy bars and wires, such as copper alloys for precision molds; special alloy pen materials; brass alloy materials; nickel-silver alloy materials; bronze alloy materials; special alloy materials; high-strength high conductivity alloy materials; and environmental alloy materials. The company also provides alloy plates and strips, such as high-strength high-conductivity copper chromium zirconium alloy strips; high precision copper nickel tin strips; high-strength high-conductivity copper nickel silicon strips; high-conductivity high-softening Cu-Fe strips; high precision nickel silver strips; and high precision phosphor bronze strips. In addition, it offers monocrystalline black components, polycrystalline series solar cells, components, and other products. The company's products are used in aerospace, high-speed rail, electronics, telecommunication, automobile, ship, engineering machine, precision molding, lead frame, household appliance, and bathroom hardware industries. Ningbo Boway Alloy Material Company Limited was founded in 1993 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": null,
        "website": "http://www.bowayalloy.com",
        "market_cap": "Small Cap"
    },
    "601609.SS": {
        "short_name": "NINGBO JINTIAN COPPER GROUP CO ",
        "long_name": "Ningbo Jintian Copper(Group) Co., Ltd.",
        "summary": "Ningbo Jintian Copper(Group) Co., Ltd. processes copper in China. The company offers copper wires and bars, copper cathodes, enameled copper wires, and magnetic materials, as well as copper alloy stripes, sheets, and alloy pipes under the Zhejiang brand name; and copper tubes, stripes, stick, sheets, and plates. It also provides high precision wires, valves, electrolytic copper, and water meters. In addition, the company involves in the high-tech materials, non-ferrous metal trading, and other businesses. It was formerly known as Ningbo Jintian Copper (Group) Company and changed its name to Ningbo Jintian Copper(Group) Co., Ltd. in December, 2000. Ningbo Jintian Copper (Group) Co., Ltd. was founded in 1986 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315034",
        "website": "http://www.jtgroup.com.cn",
        "market_cap": "Mid Cap"
    },
    "688388.SS": {
        "short_name": "GUANGDONG JIA YUAN TECHNOLOGY S",
        "long_name": "Guangdong Jiayuan Technology Co.Ltd.",
        "summary": "Guangdong Jiayuan Technology Co.Ltd. manufactures and sells electrolytic copper foils. It offers single-sided matte copper foils, and double-sided light and roughened copper foils. The company was founded in 2001 and is based in Meizhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Meizhou",
        "zipcode": null,
        "website": "http://www.gdjygf.com",
        "market_cap": "Mid Cap"
    },
    "9CM.F": {
        "short_name": "COPPERBANK RES. CORP.",
        "long_name": "Copperbank Resources Corp.",
        "summary": "Copperbank Resources Corp., an exploration stage company, engages in the acquisition and development of mineral properties in the United States. It holds a 100% interest in the Copper Creek project that covers an area of 16 square miles located in Pinal County, Arizona; and the Contact copper project consisting of 156 patented claims covering an area of approximately 2,650 acres and 219 unpatented claims covering an area of approximately 3,285 acres situated in Elko County, Nevada. CopperBank Resources Corp. was incorporated in 2014 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1T2",
        "website": "http://www.copperbankcorp.com",
        "market_cap": "Small Cap"
    },
    "A7R1.F": {
        "short_name": "SRHI INC.  ON",
        "long_name": "SRHI Inc.",
        "summary": "SRHI Inc. invests in mining and agriculture sectors. The company operates through the Minera Tres Valles SpA and Corporate segments. Its principal asset is its 70% owned Minera Tres Valles copper mine located in Salamanca, Chile. It also engages in the organic protein production and retail; and holds interests in the Lac Otelnuk iron ore project located in Nunavik, Canada. The company was formerly known as Sprott Resource Holdings Inc. and changed its name to SRHI Inc. in June 2020. SRHI Inc. is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2J1",
        "website": "http://www.srhi.ca",
        "market_cap": "Small Cap"
    },
    "AIAGY": {
        "short_name": "AURUBIS AG",
        "long_name": "Aurubis AG",
        "summary": "Aurubis AG provides non-ferrous metals worldwide. It processes complex metal concentrates, scrap metals, and organic and inorganic metal-bearing recycling materials, and industrial residues to produce metals. The company produces continuous cast, directly cast, and oxygen-free copper rods, as well as various drawn products; a range of materials in round and square cross-sections, and various dimensions under the AURUBIS SHAPES brand; and copper-based architectural products and services for the building and construction industry, such as flat copper sheets, as well as prefabricated systems for facades, roofs, and rainwater systems. It also provides industrial rolled products, including connector strips, radiator strips, sheets, plates and circles, and pre-rolled strips; cathodes; bars and profiles comprising flat bars, round bars, segments, profiles, and hollow profiles; copper bars and profiles; precious metals consisting of gold and silver; and sulfuric acid, iron silicate, selenium, and lead. In addition, the company engages in the recycling of copper, precious metals, and other non-ferrous metals; and material recycling activity for copper. Further, it offers metals comprising tellurium metal, tellurium dioxide, selenium, lead-bismuth, and lead-antimony alloys. The company serves cable and wire, construction, machinery and plant engineering, transport, chemistry, and other industries. The company was formerly known as Norddeutsche Affinerie AG and changed its name to Aurubis AG in April 2009. Aurubis AG was founded in 1866 and is headquartered in Hamburg, Germany.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Germany",
        "state": null,
        "city": "Hamburg",
        "zipcode": "20539",
        "website": "http://www.aurubis.com",
        "market_cap": "Mid Cap"
    },
    "AN.V": {
        "short_name": "ARENA MINERALS INC",
        "long_name": "Arena Minerals Inc.",
        "summary": "Arena Minerals Inc., a copper and lithium exploration company, engages in the acquisition, exploration, and development of mineral properties in South America. It holds interest in the Atacama copper property covering an area of approximately 7,061 hectares located within the Antofagasta region ll of Chile. The company also owns Antofalla lithium brine projects, which cover an area of 4,000 hectares located in Salar de Antofalla, Argentina. The company was formerly known as Antofagasta Gold Inc. and changed its name to Arena Minerals Inc. in December 2013. Arena Minerals Inc. was incorporated in 1995 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 1T1",
        "website": "http://www.arenaminerals.com",
        "market_cap": "Small Cap"
    },
    "ANFGF": {
        "short_name": "ANTOFAGASTA",
        "long_name": "Antofagasta plc",
        "summary": "Antofagasta plc, through its subsidiaries, primarily engages in the exploration, evaluation, development, and mining of copper properties in Chile and internationally. It operates through Los Pelambres, Centinela, Antucoya, ZaldÃ­var, Exploration and Evaluation, and Transport segments. The company explores for copper concentrates containing by-products, such as molybdenum, gold, and silver; and copper cathodes. It holds a 60% interest in the Los Pelambres mine; a 70% interest in the Centinela mine; a 50% interest in the ZaldÃ­var mine; and a 70% interest in the Antucoya mine located in Chile. The company also provides rail and road cargo, and other ancillary services. In addition, it offers rail and truck services to the mining industry in the Antofagasta Region. The company was incorporated in 1888 and is based in London, the United Kingdom. Antofagasta plc is a subsidiary of Metalinvest Establishment.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SW1Y 6RJ",
        "website": "http://www.antofagasta.co.uk",
        "market_cap": "Large Cap"
    },
    "ANTO.L": {
        "short_name": "ANTOFAGASTA PLC ORD 5P",
        "long_name": "Antofagasta plc",
        "summary": "Antofagasta plc, through its subsidiaries, primarily engages in the exploration, evaluation, development, and mining of copper properties in Chile and internationally. It operates through Los Pelambres, Centinela, Antucoya, ZaldÃ­var, Exploration and Evaluation, and Transport segments. The company explores for copper concentrates containing by-products, such as molybdenum, gold, and silver; and copper cathodes. It holds a 60% interest in the Los Pelambres mine; a 70% interest in the Centinela mine; a 50% interest in the ZaldÃ­var mine; and a 70% interest in the Antucoya mine located in Chile. The company also provides rail and road cargo, and other ancillary services. In addition, it offers rail and truck services to the mining industry in the Antofagasta Region. The company was incorporated in 1888 and is based in London, the United Kingdom. Antofagasta plc is a subsidiary of Metalinvest Establishment.",
        "currency": "GBp",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SW1Y 6RJ",
        "website": "http://www.antofagasta.co.uk",
        "market_cap": null
    },
    "ARG.TO": {
        "short_name": "AMERIGO RESOURCES LTD.",
        "long_name": "Amerigo Resources Ltd.",
        "summary": "Amerigo Resources Ltd., through its subsidiary, Minera Valle Central S.A., produces and sells copper and molybdenum concentrates from Codelco's El Teniente underground mine in Chile. The company was formerly known as Golden Temple Mining Corp. and changed its name to Amerigo Resources Ltd. in March 2002. Amerigo Resources Ltd. was incorporated in 1984 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2G8",
        "website": "http://www.amerigoresources.com",
        "market_cap": "Small Cap"
    },
    "ARJN.V": {
        "short_name": "ARANJIN RESOURCES LTD",
        "long_name": "Aranjin Resources Ltd.",
        "summary": "Aranjin Resources Ltd., together with its subsidiaries, engages in the exploration and development of mineral properties in Mongolia. The company explores for copper deposits. Its flagship asset is the Bayan Undur project located in Bayankhongor province, Mongolia. The company was formerly known as Five Star Diamonds Limited and changed its name to Aranjin Resources Ltd. in June 2020. Aranjin Resources Ltd. was incorporated in 2012 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T5",
        "website": "http://aranjinresources.com",
        "market_cap": "Small Cap"
    },
    "ARREF": {
        "short_name": "AMERIGO RESOURCES CORP",
        "long_name": "Amerigo Resources Ltd.",
        "summary": "Amerigo Resources Ltd., through its subsidiary, Minera Valle Central S.A., produces and sells copper and molybdenum concentrates from Codelco's El Teniente underground mine in Chile. The company was formerly known as Golden Temple Mining Corp. and changed its name to Amerigo Resources Ltd. in March 2002. Amerigo Resources Ltd. was incorporated in 1984 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2G8",
        "website": "http://www.amerigoresources.com",
        "market_cap": "Small Cap"
    },
    "ATYM.L": {
        "short_name": "ATALAYA MINING PLC ORD 7.5P",
        "long_name": "Atalaya Mining Plc",
        "summary": "Atalaya Mining Plc, together with its subsidiaries, engages in the mineral exploration and development in Spain. The company holds interest in the Proyecto Riotinto project, an open-pit copper mine located in the Andalusia region of Spain. It produces copper concentrates, including silver by-products. The company also holds interest in Proyecto Touro, a brownfield copper project located in the northwest Spain. Atalaya Mining Plc has an agreement to acquire 100% of the Masa Valverde polymetallic project located in Huelva, Spain. The company was formerly known as EMED Mining Public Limited and changed its name to Atalaya Mining Plc in October 2015. Atalaya Mining Plc was incorporated in 2004 and is based in Nicosia, Cyprus.",
        "currency": "GBp",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Cyprus",
        "state": null,
        "city": "Nicosia",
        "zipcode": "1095",
        "website": "http://www.atalayamining.com",
        "market_cap": null
    },
    "AYM.TO": {
        "short_name": "ATALAYA MINING PLC",
        "long_name": "Atalaya Mining Plc",
        "summary": "Atalaya Mining Plc, together with its subsidiaries, engages in the mineral exploration and development in Spain. The company holds interest in the Proyecto Riotinto project, an open-pit copper mine located in the Andalusia region of Spain. It produces copper concentrates, including silver by-products. The company also holds interest in Proyecto Touro, a brownfield copper project located in the northwest Spain. Atalaya Mining Plc has an agreement to acquire 100% of the Masa Valverde polymetallic project located in Huelva, Spain. The company was formerly known as EMED Mining Public Limited and changed its name to Atalaya Mining Plc in October 2015. Atalaya Mining Plc was incorporated in 2004 and is based in Nicosia, Cyprus.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Cyprus",
        "state": null,
        "city": "Nicosia",
        "zipcode": "1095",
        "website": "http://www.atalayamining.com",
        "market_cap": "Small Cap"
    },
    "BBR.CN": {
        "short_name": "BamBamRes",
        "long_name": "Bam Bam Resources Corp.",
        "summary": "Bam Bam Resources Corp. engages in the acquisition and exploration of mineral property assets. The company primarily explores for gold, silver, and copper deposits. Its flagship property is the Majuba Hill project situated in Nevada, the United States. The company was formerly known as KOPR Point Ventures Inc. and changed its name to Bam Bam Resources Corp. in December 2019. Bam Bam Resources Corp. was incorporated in 2017 and is headquartered in North Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 0A6",
        "website": "http://www.bambamresources.com",
        "market_cap": "Small Cap"
    },
    "BCU.V": {
        "short_name": "BELL COPPER CORPORATION",
        "long_name": "Bell Copper Corporation",
        "summary": "Bell Copper Corporation, together with its subsidiaries, engages in the acquisition, exploration, and evaluation of mineral properties in North America. Its principal property is the Perseverance porphyry copper/molybdenum project that covers an area of approximately 14,100 acres located in northwestern Arizona. The company was formerly known as Bell Resources Corporation and changed its name to Bell Copper Corporation in April 2008. Bell Copper Corporation was incorporated in 1991 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3A6",
        "website": "http://www.bellcopper.net",
        "market_cap": "Small Cap"
    },
    "BHAGYANGR.NS": {
        "short_name": "BHAGYANAGAR INDIA",
        "long_name": "Bhagyanagar India Limited",
        "summary": "Bhagyanagar India Limited manufactures copper products in India. It operates through Manufacturing of Copper Products and Wind Power segments. The company offers copper bus bars, wires and rods, foils and sheets, paper covered strips, nuggets, and tubes and pipes, as well paper insulated copper conductors. It also provides solar flat plate collectors, commutators, solar fins, field coils and armature pins, submersible wires, and heating elements/thermostats/immersion heaters. The company primarily serves original equipment manufacturers in the auto and electrical component, solar, and electrical engineering industries. In addition, it operates a wind power project with an installed capacity of 9 megawatts at Kapatigudda, Karnataka. Bhagyanagar India Limited was founded in 1985 and is based in Secunderabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Secunderabad",
        "zipcode": "500003",
        "website": "http://www.bhagyanagarindia.com",
        "market_cap": "Small Cap"
    },
    "BRVRF": {
        "short_name": "BLUE RIVER RESOURC",
        "long_name": "Blue River Resources Ltd.",
        "summary": "Blue River Resources Ltd. engages in the acquisition, exploration, and development of mineral properties. It holds 100% interests in Castle copper project located in British Colombia. The company was incorporated in 2008 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 3H7",
        "website": "http://www.blueriv.com",
        "market_cap": "Small Cap"
    },
    "BS4A.F": {
        "short_name": "KINCORA COPPER LTD",
        "long_name": "Kincora Copper Limited",
        "summary": "Kincora Copper Limited acquires, explores for, and develops mineral properties in Mongolia and Australia. The company primarily explores for copper and gold deposits. It owns interests in the Bronze Fox project located in Mongolia; Nyngan project covering an area of 762 square kilometers located in the Lachlan fold belt in central New South Wales, Australia; and Nevertire project totaling an area of 382 square kilometers located in New South Wales, Australia. The company was formerly known as Brazilian Diamonds Limited and changed its name to Kincora Copper Limited in January 2011. Kincora Copper Limited was incorporated in 1983 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3N6",
        "website": "http://www.kincoracopper.com",
        "market_cap": "Small Cap"
    },
    "BXR.V": {
        "short_name": "BLUE RIVER RESOURCES LTD",
        "long_name": "Blue River Resources Ltd.",
        "summary": "Blue River Resources Ltd. engages in the acquisition, exploration, and development of mineral properties. It holds 100% interests in Castle copper project located in British Colombia. The company was incorporated in 2008 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 3H7",
        "website": "http://www.blueriv.com",
        "market_cap": "Small Cap"
    },
    "C3H1.F": {
        "short_name": "HIGHLAND COPPER CO.",
        "long_name": "Highland Copper Company Inc.",
        "summary": "Highland Copper Company Inc., together with its subsidiaries, engages in the acquisition, exploration, and development of mineral projects in the United States. The company explores for copper deposits. It owns the Copperwood copper project; and the White Pine copper project located in the Upper Peninsula of Michigan. The company was formerly known as Highland Resources Inc. and changed its name to Highland Copper Company Inc. in October 2012. Highland Copper Company Inc. is based in Longueuil, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "QC",
        "city": "Longueuil",
        "zipcode": "J4K 5G4",
        "website": "http://www.highlandcopper.com",
        "market_cap": "Small Cap"
    },
    "C6C.AX": {
        "short_name": "COPPERMTN CDI 1:1",
        "long_name": "Copper Mountain Mining Corporation",
        "summary": "Copper Mountain Mining Corporation operates as a mining company in Canada. The company explores for copper, gold, and silver deposits. Its flagship asset is the Copper Mountain mine that comprise 138 crown granted mineral claims, 149 located mineral claims, 14 mining leases, and 12 fee simple properties covering an area of 6,702 hectares located to the south of Princeton, British Columbia. The company was founded in 2006 and is headquartered in Vancouver, Canada.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1G8",
        "website": "http://www.cumtn.com",
        "market_cap": "Small Cap"
    },
    "C730.F": {
        "short_name": "US COPPER CORP.",
        "long_name": "US Copper Corp.",
        "summary": "US Copper Corp., an exploration stage company, engages in the exploration and evaluation of mineral properties in Canada and the United States. The company explores for copper, nickel, gold, and silver deposits. It has 100% interests in the Moonlight-Superior copper project located in the Plumas County, California; and the Black Warrior project that include 2 patented claims located in the Esmeralda County, Nevada. The company also holds 100% interests in the Timore project located in Ontario; and the Warren Whiteside project that include 14 patented mining claims located in Whiteside Township in Ontario. It also has interests in exploration properties in Nevada and California. The company was formerly known as Crown Mining Corp. and changed its name to US Copper Corp. in April 2021. US Copper Corp. is based in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5V OR2",
        "website": "http://crownminingcorp.com",
        "market_cap": "Small Cap"
    },
    "CAML.L": {
        "short_name": "CENTRAL ASIA METALS PLC ORD USD",
        "long_name": "Central Asia Metals plc",
        "summary": "Central Asia Metals plc, together with its subsidiaries, mines and explores for mineral properties. It primarily explores for copper, zinc, lead, and silver deposits. It holds 100% interests in the solvent extraction- electrowinning copper plant located near the city of Balkhash in central Kazakhstan; and Sasa mine located in north eastern Macedonia. The company was incorporated in 2005 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1J 0DR",
        "website": "http://www.centralasiametals.com",
        "market_cap": null
    },
    "CBK.CN": {
        "short_name": "CopperbankRes",
        "long_name": "Copperbank Resources Corp.",
        "summary": "Copperbank Resources Corp., an exploration stage company, engages in the acquisition and development of mineral properties in the United States. It holds a 100% interest in the Copper Creek project that covers an area of 16 square miles located in Pinal County, Arizona; and the Contact copper project consisting of 156 patented claims covering an area of approximately 2,650 acres and 219 unpatented claims covering an area of approximately 3,285 acres situated in Elko County, Nevada. CopperBank Resources Corp. was incorporated in 2014 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1T2",
        "website": "http://www.copperbankcorp.com",
        "market_cap": "Small Cap"
    },
    "CCOXF": {
        "short_name": "CANDENTE COPPER CORP",
        "long_name": "Candente Copper Corp.",
        "summary": "Candente Copper Corp., a mineral exploration company, engages in the acquisition, exploration, and development of mineral properties. The company primarily explores for copper, gold, and silver deposits. Its principal property is the CaÃ±ariaco project consisting of 5 CaÃ±ariaco concessions covering a total area of 4,289.50 hectares located in Northern Peru. The company was formerly known as Candente Resource Corp. and changed its name to Candente Copper Corp. in December 2009. Candente Copper Corp. was incorporated in 1997 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 2S1",
        "website": "http://www.candentecopper.com",
        "market_cap": "Small Cap"
    },
    "CHC.SG": {
        "short_name": "Hot Chili Ltd. Registered Share",
        "long_name": "Hot Chili Limited",
        "summary": "Hot Chili Limited operates as a mineral exploration company in Australia and Chile. The company explores for copper, gold, and molybdenum, as well as silver deposits. Its flagship property is the Cortadera Copper-Gold Project located along the Chilean coastal range, Chile. The company was incorporated in 2008 and is based in Applecross, Australia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Australia",
        "state": "WA",
        "city": "Applecross",
        "zipcode": "6153",
        "website": "http://www.hotchili.net.au",
        "market_cap": "Small Cap"
    },
    "CMMC.TO": {
        "short_name": "COPPER MOUNTAIN MINING CORP",
        "long_name": "Copper Mountain Mining Corporation",
        "summary": "Copper Mountain Mining Corporation operates as a mining company in Canada. The company explores for copper, gold, and silver deposits. Its flagship asset is the Copper Mountain mine that comprise 138 crown granted mineral claims, 149 located mineral claims, 14 mining leases, and 12 fee simple properties covering an area of 6,702 hectares located to the south of Princeton, British Columbia. The company was founded in 2006 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1G8",
        "website": "http://www.cumtn.com",
        "market_cap": "Small Cap"
    },
    "COQ.F": {
        "short_name": "COPPER MOUNTAIN MINING",
        "long_name": "Copper Mountain Mining Corporation",
        "summary": "Copper Mountain Mining Corporation operates as a mining company in Canada. The company explores for copper, gold, and silver deposits. Its flagship asset is the Copper Mountain mine that comprise 138 crown granted mineral claims, 149 located mineral claims, 14 mining leases, and 12 fee simple properties covering an area of 6,702 hectares located to the south of Princeton, British Columbia. The company was founded in 2006 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1G8",
        "website": "http://www.cumtn.com",
        "market_cap": "Small Cap"
    },
    "COQA.F": {
        "short_name": "COPPER MOUNT.MIN. CDI",
        "long_name": "Copper Mountain Mining Corporation",
        "summary": "Copper Mountain Mining Corporation operates as a mining company in Canada. The company explores for copper, gold, and silver deposits. Its flagship asset is the Copper Mountain mine that comprise 138 crown granted mineral claims, 149 located mineral claims, 14 mining leases, and 12 fee simple properties covering an area of 6,702 hectares located to the south of Princeton, British Columbia. The company was founded in 2006 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1G8",
        "website": "http://www.cumtn.com",
        "market_cap": "Small Cap"
    },
    "CPFXF": {
        "short_name": "COPPER FOX METALS INC",
        "long_name": "Copper Fox Metals Inc.",
        "summary": "Copper Fox Metals Inc., a resource company, engages in the exploration and development of copper mineral properties in Canada and the United States. Its principal asset is the Schaft Creek copper-gold-molybdenum-silver project located in northwestern British Columbia. The company also holds interest in the Eaglehead porphyry copper project located in northern British Columbia. Copper Fox Metals Inc. was incorporated in 2004 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2R 1L5",
        "website": "http://www.copperfoxmetals.com",
        "market_cap": "Small Cap"
    },
    "CPPKF": {
        "short_name": "COPPERBANK RESOURCES CORP",
        "long_name": "Copperbank Resources Corp.",
        "summary": "Copperbank Resources Corp., an exploration stage company, engages in the acquisition and development of mineral properties in the United States. It holds a 100% interest in the Copper Creek project that covers an area of 16 square miles located in Pinal County, Arizona; and the Contact copper project consisting of 156 patented claims covering an area of approximately 2,650 acres and 219 unpatented claims covering an area of approximately 3,285 acres situated in Elko County, Nevada. CopperBank Resources Corp. was incorporated in 2014 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1T2",
        "website": "http://www.copperbankcorp.com",
        "market_cap": "Small Cap"
    },
    "CPPMF": {
        "short_name": "COPPER MOUNTAIN MINING CORPORAT",
        "long_name": "Copper Mountain Mining Corporation",
        "summary": "Copper Mountain Mining Corporation operates as a mining company in Canada. The company explores for copper, gold, and silver deposits. Its flagship asset is the Copper Mountain mine that comprise 138 crown granted mineral claims, 149 located mineral claims, 14 mining leases, and 12 fee simple properties covering an area of 6,702 hectares located to the south of Princeton, British Columbia. The company was founded in 2006 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1G8",
        "website": "http://www.cumtn.com",
        "market_cap": "Small Cap"
    },
    "CROJF": {
        "short_name": "MARIMACA COPPER CORP",
        "long_name": "Marimaca Copper Corp.",
        "summary": "Marimaca Copper Corp. engages in the acquisition, exploration, and exploitation of mineral properties and projects in Chile. The company explores for copper, iron ore, gold, and other base and precious metals. Its flagship project is the Marimaca Copper project located in the Antofagasta Region of Chile. The company was formerly known as Coro Mining Corp. and changed its name to Marimaca Copper Corp. in May 2020. Marimaca Copper Corp. was incorporated in 2004 and is headquartered in Las Condes, Chile.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Chile",
        "state": null,
        "city": "Las Condes",
        "zipcode": "7560742",
        "website": "http://www.marimaca.com",
        "market_cap": "Small Cap"
    },
    "CS.TO": {
        "short_name": "CAPSTONE MINING CORP.",
        "long_name": "Capstone Mining Corp.",
        "summary": "Capstone Mining Corp. engages in the exploration and production of base metals in the United States, Mexico, Canada, and Chile. The company explores for copper, molybdenum, silver, zinc, lead, iron, and gold deposits. It holds interests in the Pinto Valley, an open pit copper mine located in Arizona, the United States; and the Cozamin, an underground, copper-silver mine located in the state of Zacatecas, Mexico. The company also owns a 70% interest in copper-iron-gold Santo Domingo development project in Region III, Chile. The company was incorporated in 2009 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 0M3",
        "website": "http://www.capstonemining.com",
        "market_cap": "Small Cap"
    },
    "CSE.AX": {
        "short_name": "COPSTRIKE FPO",
        "long_name": "Copper Strike Limited",
        "summary": "Copper Strike Limited operates, a mineral exploration and development company, focuses on reviewing potential exploration and development resource acquisitions in Australia. The company also engages in the investment management business. Copper Strike Limited was founded in 2004 and is headquartered in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3205",
        "website": "http://www.copperstrike.com.au",
        "market_cap": "Small Cap"
    },
    "CSFFF": {
        "short_name": "CAPSTONE MINING CORP",
        "long_name": "Capstone Mining Corp.",
        "summary": "Capstone Mining Corp. engages in the exploration and production of base metals in the United States, Mexico, Canada, and Chile. The company explores for copper, molybdenum, silver, zinc, lead, iron, and gold deposits. It holds interests in the Pinto Valley, an open pit copper mine located in Arizona, the United States; and the Cozamin, an underground, copper-silver mine located in the state of Zacatecas, Mexico. The company also owns a 70% interest in copper-iron-gold Santo Domingo development project in Region III, Chile. The company was incorporated in 2009 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 0M3",
        "website": "http://www.capstonemining.com",
        "market_cap": "Mid Cap"
    },
    "CUBEXTUB.NS": {
        "short_name": "CUBEX TUBINGS",
        "long_name": "Cubex Tubings Limited",
        "summary": "Cubex Tubings Limited produces and sells copper and copper based alloy products in India and internationally. It offers seamless solid drawn tubes, rods, bus bars, and wires of copper and copper based alloys, such as cupronickel, admiralty and aluminum brass, etc. The company serves power plants, power plants manufacturers, switchgears, refineries, furnace manufacturers, sugar plants, automobiles, and electrical equipment and ship building industries. Cubex Tubings Limited was incorporated in 1979 and is based in Secunderabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Secunderabad",
        "zipcode": "500003",
        "website": "http://www.cubextubings.com",
        "market_cap": "Small Cap"
    },
    "CUU.V": {
        "short_name": "COPPER FOX METALS INC",
        "long_name": "Copper Fox Metals Inc.",
        "summary": "Copper Fox Metals Inc., a resource company, engages in the exploration and development of copper mineral properties in Canada and the United States. Its principal asset is the Schaft Creek copper-gold-molybdenum-silver project located in northwestern British Columbia. The company also holds interest in the Eaglehead porphyry copper project located in northern British Columbia. Copper Fox Metals Inc. was incorporated in 2004 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2R 1L5",
        "website": "http://www.copperfoxmetals.com",
        "market_cap": "Small Cap"
    },
    "CVV.AX": {
        "short_name": "CARAVELMIN FPO",
        "long_name": "Caravel Minerals Limited",
        "summary": "Caravel Minerals Limited, together with its subsidiaries, operates as a copper exploration and development company in Western Australia. The company's flagship property is the Caravel Copper project located to the north-east of Perth. It also explores for gold, copper, and molybdenum deposits. The company was formerly known as Silver Swan Group Limited and changed its name to Caravel Minerals Limited in November 2012. Caravel Minerals Limited was incorporated in 2006 and is based in Subiaco, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Subiaco",
        "zipcode": "6010",
        "website": "http://caravelminerals.com.au",
        "market_cap": "Small Cap"
    },
    "DCM.F": {
        "short_name": "DORE COPPER MINING CORP.",
        "long_name": "Doré Copper Mining Corp.",
        "summary": "DorÃ© Copper Mining Corp. operates as a copperÂ\u0096gold explorer and developer in Canada. The company holds a 100% interest in the exploration-stage Corner Bay and Cedar Bay projects located in the vicinity of Chibougamau, QuÃ©bec. It also has an option agreement to acquire a 100% interest in the Joe Mann property located in QuÃ©bec. The company was formerly known as ChaiNode Opportunities Corp. and changed its name to DorÃ© Copper Mining Corp. DorÃ© Copper Mining Corp. was incorporated in 2017 and is based in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2L3",
        "website": "http://www.dorecopper.com",
        "market_cap": "Small Cap"
    },
    "DCMC.V": {
        "short_name": "DORE COPPER MINING CORP",
        "long_name": "Doré Copper Mining Corp.",
        "summary": "DorÃ© Copper Mining Corp. operates as a copperÂ\u0096gold explorer and developer in Canada. The company holds a 100% interest in the exploration-stage Corner Bay and Cedar Bay projects located in the vicinity of Chibougamau, QuÃ©bec. It also has an option agreement to acquire a 100% interest in the Joe Mann property located in QuÃ©bec. The company was formerly known as ChaiNode Opportunities Corp. and changed its name to DorÃ© Copper Mining Corp. DorÃ© Copper Mining Corp. was incorporated in 2017 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2L3",
        "website": "http://www.dorecopper.com",
        "market_cap": "Small Cap"
    },
    "DNT.TO": {
        "short_name": "CANDENTE COPPER CORP",
        "long_name": "Candente Copper Corp.",
        "summary": "Candente Copper Corp., a mineral exploration company, engages in the acquisition, exploration, and development of mineral properties. The company primarily explores for copper, gold, and silver deposits. Its principal property is the CaÃ±ariaco project consisting of 5 CaÃ±ariaco concessions covering a total area of 4,289.50 hectares located in Northern Peru. The company was formerly known as Candente Resource Corp. and changed its name to Candente Copper Corp. in December 2009. Candente Copper Corp. was incorporated in 1997 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 2S1",
        "website": "http://www.candentecopper.com",
        "market_cap": "Small Cap"
    },
    "DRCMF": {
        "short_name": "DORE COPPER MINING CORP",
        "long_name": "Doré Copper Mining Corp.",
        "summary": "DorÃ© Copper Mining Corp. operates as a copperÂ\u0096gold explorer and developer in Canada. The company holds a 100% interest in the exploration-stage Corner Bay and Cedar Bay projects located in the vicinity of Chibougamau, QuÃ©bec. It also has an option agreement to acquire a 100% interest in the Joe Mann property located in QuÃ©bec. The company was formerly known as ChaiNode Opportunities Corp. and changed its name to DorÃ© Copper Mining Corp. DorÃ© Copper Mining Corp. was incorporated in 2017 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2L3",
        "website": "http://www.dorecopper.com",
        "market_cap": "Small Cap"
    },
    "E0B.F": {
        "short_name": "ERO COPPER CORP.",
        "long_name": "Ero Copper Corp.",
        "summary": "Ero Copper Corp., a mining company, focuses on the production, exploration, and development of mining projects in Brazil. The company also explores for copper, gold, and silver deposits. Its principal property is the Vale do CuraÃ§Ã¡ property covering an area of approximately 153,741 hectares located in the northeastern Bahia State, Brazil. The company also holds interests in the Boa EsperanÃ§a project covering an area of approximately 4,034 hectares located in ParÃ¡, Brazil; and NX gold mine covering an area of approximately 31,096 located in Mato Grosso, Brazil. Ero Copper Corp. was incorporated in 2016 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T6",
        "website": "http://www.erocopper.com",
        "market_cap": "Small Cap"
    },
    "E2E1.F": {
        "short_name": "MARIMACA COPPER CORP.",
        "long_name": "Marimaca Copper Corp.",
        "summary": "Marimaca Copper Corp. engages in the acquisition, exploration, and exploitation of mineral properties and projects in Chile. The company explores for copper, iron ore, gold, and other base and precious metals. Its flagship project is the Marimaca Copper project located in the Antofagasta Region of Chile. The company was formerly known as Coro Mining Corp. and changed its name to Marimaca Copper Corp. in May 2020. Marimaca Copper Corp. was incorporated in 2004 and is headquartered in Las Condes, Chile.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Chile",
        "state": null,
        "city": "Las Condes",
        "zipcode": "7560742",
        "website": "http://www.marimaca.com",
        "market_cap": "Small Cap"
    },
    "E5S1.F": {
        "short_name": "ATALAYA MNG PLC LS-,075",
        "long_name": "Atalaya Mining Plc",
        "summary": "Atalaya Mining Plc, together with its subsidiaries, engages in the mineral exploration and development in Spain. The company holds interest in the Proyecto Riotinto project, an open-pit copper mine located in the Andalusia region of Spain. It produces copper concentrates, including silver by-products. The company also holds interest in Proyecto Touro, a brownfield copper project located in the northwest Spain. Atalaya Mining Plc has an agreement to acquire 100% of the Masa Valverde polymetallic project located in Huelva, Spain. The company was formerly known as EMED Mining Public Limited and changed its name to Atalaya Mining Plc in October 2015. Atalaya Mining Plc was incorporated in 2004 and is based in Nicosia, Cyprus.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cyprus",
        "state": null,
        "city": "Nicosia",
        "zipcode": "1095",
        "website": "http://www.atalayamining.com",
        "market_cap": "Small Cap"
    },
    "ECU.V": {
        "short_name": "ELEMENT 29 RESOURCES INC",
        "long_name": "Element 29 Resources Inc.",
        "summary": "Element 29 Resources Inc. acquires, explores for, evaluates, and develops mineral properties in Peru. The company primarily explores for copper, molybdenum, gold, silver, lead, zinc, and other deposits. It owns 100% interests in the Flor de Cobre project comprising seven mining concessions and two concession applications totaling an area of 1,927 hectares located in the Southern Peru; and Elida project that includes 28 mining concessions covering an area of 19,210 hectares located in the province of Ocros. The company also holds interests in the Pahuay Copper Skarn project totaling 700 hectares located to the south of Lima; and MuÃ±aorjo copper project totaling 1,000 hectares in Peru. Element 29 Resources Inc. was incorporated in 2017 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 2X2",
        "website": "http://www.e29copper.com",
        "market_cap": "Small Cap"
    },
    "ERO.TO": {
        "short_name": "ERO COPPER CORP",
        "long_name": "Ero Copper Corp.",
        "summary": "Ero Copper Corp., a mining company, focuses on the production, exploration, and development of mining projects in Brazil. The company also explores for copper, gold, and silver deposits. Its principal property is the Vale do CuraÃ§Ã¡ property covering an area of approximately 153,741 hectares located in the northeastern Bahia State, Brazil. The company also holds interests in the Boa EsperanÃ§a project covering an area of approximately 4,034 hectares located in ParÃ¡, Brazil; and NX gold mine covering an area of approximately 31,096 located in Mato Grosso, Brazil. Ero Copper Corp. was incorporated in 2016 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T6",
        "website": "http://www.erocopper.com",
        "market_cap": "Small Cap"
    },
    "ERRPF": {
        "short_name": "ERO COPPER CORP",
        "long_name": "Ero Copper Corp.",
        "summary": "Ero Copper Corp., a mining company, focuses on the production, exploration, and development of mining projects in Brazil. The company also explores for copper, gold, and silver deposits. Its principal property is the Vale do CuraÃ§Ã¡ property covering an area of approximately 153,741 hectares located in the northeastern Bahia State, Brazil. The company also holds interests in the Boa EsperanÃ§a project covering an area of approximately 4,034 hectares located in ParÃ¡, Brazil; and NX gold mine covering an area of approximately 31,096 located in Mato Grosso, Brazil. Ero Copper Corp. was incorporated in 2016 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T6",
        "website": "http://www.erocopper.com",
        "market_cap": "Mid Cap"
    },
    "FCX.BA": {
        "short_name": "FREEPORT-MCMORAN",
        "long_name": "Freeport-McMoRan Inc.",
        "summary": "Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. The company primarily explores for copper, gold, molybdenum, silver, and other metals, as well as oil and gas. Its assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Tyrone and Chino in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company also operates a portfolio of oil and gas properties primarily located in offshore California and the Gulf of Mexico. As of December 31, 2020, it operated approximately 165 wells. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.",
        "currency": "ARS",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85004-2189",
        "website": "http://fcx.com",
        "market_cap": "Large Cap"
    },
    "FCX.MX": {
        "short_name": "FREEPORT-MCMORAN INC",
        "long_name": "Freeport-McMoRan Inc.",
        "summary": "Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. The company primarily explores for copper, gold, molybdenum, silver, and other metals, as well as oil and gas. Its assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Tyrone and Chino in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company also operates a portfolio of oil and gas properties primarily located in offshore California and the Gulf of Mexico. As of December 31, 2020, it operated approximately 165 wells. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85004-2189",
        "website": "http://fcx.com",
        "market_cap": "Large Cap"
    },
    "FCX": {
        "short_name": "Freeport-McMoRan, Inc.",
        "long_name": "Freeport-McMoRan Inc.",
        "summary": "Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. The company primarily explores for copper, gold, molybdenum, silver, and other metals, as well as oil and gas. Its assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Tyrone and Chino in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company also operates a portfolio of oil and gas properties primarily located in offshore California and the Gulf of Mexico. As of December 31, 2020, it operated approximately 165 wells. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85004-2189",
        "website": "http://fcx.com",
        "market_cap": "Large Cap"
    },
    "FCX.SN": {
        "short_name": "FREEPORT-MCMORAN",
        "long_name": "Freeport-McMoRan Inc.",
        "summary": "Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. The company primarily explores for copper, gold, molybdenum, silver, and other metals, as well as oil and gas. Its assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Tyrone and Chino in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company also operates a portfolio of oil and gas properties primarily located in offshore California and the Gulf of Mexico. As of December 31, 2020, it operated approximately 165 wells. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85004-2189",
        "website": "http://fcx.com",
        "market_cap": "Large Cap"
    },
    "FCX.VI": {
        "short_name": "FREEPORT-MCMORAN INC",
        "long_name": "Freeport-McMoRan Inc.",
        "summary": "Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. The company primarily explores for copper, gold, molybdenum, silver, and other metals, as well as oil and gas. Its assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Tyrone and Chino in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company also operates a portfolio of oil and gas properties primarily located in offshore California and the Gulf of Mexico. As of December 31, 2020, it operated approximately 165 wells. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85004-2189",
        "website": "http://fcx.com",
        "market_cap": "Large Cap"
    },
    "FCXO34.SA": {
        "short_name": "FREEPORT    DRN",
        "long_name": "Freeport-McMoRan Inc.",
        "summary": "Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. The company primarily explores for copper, gold, molybdenum, silver, and other metals, as well as oil and gas. Its assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Tyrone and Chino in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company also operates a portfolio of oil and gas properties primarily located in offshore California and the Gulf of Mexico. As of December 31, 2020, it operated approximately 165 wells. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85004-2189",
        "website": "http://fcx.com",
        "market_cap": "Large Cap"
    },
    "FG1.F": {
        "short_name": "ANTOFAGASTA PLC  LS-,05",
        "long_name": "Antofagasta plc",
        "summary": "Antofagasta plc, through its subsidiaries, primarily engages in the exploration, evaluation, development, and mining of copper properties in Chile and internationally. It operates through Los Pelambres, Centinela, Antucoya, ZaldÃ­var, Exploration and Evaluation, and Transport segments. The company explores for copper concentrates containing by-products, such as molybdenum, gold, and silver; and copper cathodes. It holds a 60% interest in the Los Pelambres mine; a 70% interest in the Centinela mine; a 50% interest in the ZaldÃ­var mine; and a 70% interest in the Antucoya mine located in Chile. The company also provides rail and road cargo, and other ancillary services. In addition, it offers rail and truck services to the mining industry in the Antofagasta Region. The company was incorporated in 1888 and is based in London, the United Kingdom. Antofagasta plc is a subsidiary of Metalinvest Establishment.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SW1Y 6RJ",
        "website": "http://www.antofagasta.co.uk",
        "market_cap": "Large Cap"
    },
    "FG5.F": {
        "short_name": "METALS X LTD",
        "long_name": "Metals X Limited",
        "summary": "Metals X Limited engages in the production of tin in Australia. It operates through Renison Tin Operations, Mt Bischoff Tin Project, Nifty Copper Operations, Maroochydore Copper Project, and Wingellina Nickel Project segments. Its products include copper, tin, cobalt, and nickel. The company holds a 50% interest in the Renison tin project located on the west coast of Tasmania; and a 100% interest in the Nifty copper project in Western Australia. It also holds in the Central Musgrave project that covers an area of 2,000 square kilometers of exploration tenure, including the Wingellina nickel-cobalt limonite deposit, the Claude Hills nickel deposit, and the Mt Davies exploration prospects located in the Central Musgrave ranges. The company was incorporated in 2004 and is based in Perth, Australia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6000",
        "website": "http://www.metalsx.com.au",
        "market_cap": "Small Cap"
    },
    "FM.TO": {
        "short_name": "FIRST QUANTUM MINERALS LTD",
        "long_name": "First Quantum Minerals Ltd.",
        "summary": "First Quantum Minerals Ltd. engages in the exploration, development, and production of mineral properties. It primarily explores for copper, nickel, pyrite, gold, silver, and zinc ores, as well as produces acid. The company holds 100% interests in the Ravensthorpe nickel and cobalt mine in Australia; the Sentinel copper project in North Western Province of Zambia; the Las Cruces copper mine in Spain; the Guelb Moghrein copper-gold mine in Mauritania; the PyhÃ¤salmi copper, pyrite, zinc mine in Finland; and the Ã\u0087ayeli copper-zinc mine in Turkey. It also holds an 80% interest in the Kansanshi copper-gold mine and copper smelter in Zambia; and a 90% interest in the Cobre Panama project located in Panama. In addition, the company has interests in copper, gold, and molybdenum projects at various stages of development located in Argentina, Peru, and Zambia. The company was formerly known as First Quantum Ventures Ltd. and changed its name to First Quantum Minerals Ltd. in July 1996. First Quantum Minerals Ltd. was incorporated in 1983 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2S8",
        "website": "http://www.first-quantum.com",
        "market_cap": "Large Cap"
    },
    "FPMB.DE": {
        "short_name": "FREEPORT-MCMORAN INC.",
        "long_name": "Freeport-McMoRan Inc.",
        "summary": "Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. The company primarily explores for copper, gold, molybdenum, silver, and other metals, as well as oil and gas. Its assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Tyrone and Chino in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company also operates a portfolio of oil and gas properties primarily located in offshore California and the Gulf of Mexico. As of December 31, 2020, it operated approximately 165 wells. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85004-2189",
        "website": "http://fcx.com",
        "market_cap": "Large Cap"
    },
    "FPMB.F": {
        "short_name": "FREEPORT-MCMORAN INC.",
        "long_name": "Freeport-McMoRan Inc.",
        "summary": "Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. The company primarily explores for copper, gold, molybdenum, silver, and other metals, as well as oil and gas. Its assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Tyrone and Chino in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company also operates a portfolio of oil and gas properties primarily located in offshore California and the Gulf of Mexico. As of December 31, 2020, it operated approximately 165 wells. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85004-2189",
        "website": "http://fcx.com",
        "market_cap": "Large Cap"
    },
    "FQVLF": {
        "short_name": "FIRST QUANTUM MINERALS",
        "long_name": "First Quantum Minerals Ltd.",
        "summary": "First Quantum Minerals Ltd. engages in the exploration, development, and production of mineral properties. It primarily explores for copper, nickel, pyrite, gold, silver, and zinc ores, as well as produces acid. The company holds 100% interests in the Ravensthorpe nickel and cobalt mine in Australia; the Sentinel copper project in North Western Province of Zambia; the Las Cruces copper mine in Spain; the Guelb Moghrein copper-gold mine in Mauritania; the PyhÃ¤salmi copper, pyrite, zinc mine in Finland; and the Ã\u0087ayeli copper-zinc mine in Turkey. It also holds an 80% interest in the Kansanshi copper-gold mine and copper smelter in Zambia; and a 90% interest in the Cobre Panama project located in Panama. In addition, the company has interests in copper, gold, and molybdenum projects at various stages of development located in Argentina, Peru, and Zambia. The company was formerly known as First Quantum Ventures Ltd. and changed its name to First Quantum Minerals Ltd. in July 1996. First Quantum Minerals Ltd. was incorporated in 1983 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2S8",
        "website": "http://www.first-quantum.com",
        "market_cap": "Large Cap"
    },
    "GDZD.F": {
        "short_name": "JINCHUAN GR.INT.RES.HD-01",
        "long_name": "Jinchuan Group International Resources Co. Ltd",
        "summary": "Jinchuan Group International Resources Co. Ltd, an investment holding company, engages in the mining operations. The company primarily explores for copper, cobalt, copper concentrates, and copper blisters. It operates Ruashi mine, a copper and cobalt mine located in Lubumbashi and Kinsenda mine, a copper mine located in Haut-Katanga Province, the Democratic Republic of the Congo; and Chibuluma South mine located in Zambia, as well as Musonoi and Lubembe projects located in the Democratic Republic of the Congo. The company also trades in copper concentrates, cathode, and blister; cobalt; and other related raw materials. It has operations in Hong Kong, South Africa, the Democratic Republic of the Congo, Switzerland, Zambia, Singapore, and South Korea. The company was founded in 1958 and is headquartered in Admiralty, Hong Kong. Jinchuan Group International Resources Co. Ltd is a subsidiary of Jinchuan (BVI) Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.jinchuan-intl.com",
        "market_cap": "Small Cap"
    },
    "GW4N.F": {
        "short_name": "CANDENTE COPPER CORP. NEW",
        "long_name": "Candente Copper Corp.",
        "summary": "Candente Copper Corp., a mineral exploration company, engages in the acquisition, exploration, and development of mineral properties. The company primarily explores for copper, gold, and silver deposits. Its principal property is the CaÃ±ariaco project consisting of 5 CaÃ±ariaco concessions covering a total area of 4,289.50 hectares located in Northern Peru. The company was formerly known as Candente Resource Corp. and changed its name to Candente Copper Corp. in December 2009. Candente Copper Corp. was incorporated in 1997 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 2S1",
        "website": "http://www.candentecopper.com",
        "market_cap": "Small Cap"
    },
    "GXD.F": {
        "short_name": "LUNDIN MINING CORP.",
        "long_name": "Lundin Mining Corporation",
        "summary": "Lundin Mining Corporation, a diversified base metals mining company, engages in the exploration, development, and mining of mineral properties in Brazil, Chile, Portugal, Sweden, and the United States. It primarily produces copper, zinc, nickel, and gold, as well as lead, silver, and other metals. The company holds 100% interests in the Chapada mine located in Brazil; the Eagle mine located in the United States; the Neves-Corvo mine located in Portugal; and the Zinkgruvan mine located in Sweden. It also holds 80% interests in the Candelaria and Ojos del Salado mining complex located in Chile. The company was formerly known as South Atlantic Ventures Ltd. and changed its name to Lundin Mining Corporation in August 2004. Lundin Mining Corporation was incorporated in 1994 and is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 1J9",
        "website": "http://www.lundinmining.com",
        "market_cap": "Mid Cap"
    },
    "HBM": {
        "short_name": "Hudbay Minerals Inc.",
        "long_name": "Hudbay Minerals Inc.",
        "summary": "Hudbay Minerals Inc., a diversified mining company, together with its subsidiaries, focuses on the discovery, production, and marketing of base and precious metals in North and South America. It produces copper concentrates containing copper, gold, and silver; molybdenum concentrates; and zinc metals. The company owns three polymetallic mines, four ore concentrators, and a zinc production facility in northern Manitoba and Saskatchewan, Canada, as well as in Cusco, Peru; and copper projects in Arizona and Nevada, the United States. HudBay Minerals Inc. was founded in 1927 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2V5",
        "website": "http://www.hudbayminerals.com",
        "market_cap": "Mid Cap"
    },
    "HBM.TO": {
        "short_name": "HUDBAY MINERALS INC.",
        "long_name": "Hudbay Minerals Inc.",
        "summary": "Hudbay Minerals Inc., a diversified mining company, together with its subsidiaries, focuses on the discovery, production, and marketing of base and precious metals in North and South America. It produces copper concentrates containing copper, gold, and silver; molybdenum concentrates; and zinc metals. The company owns three polymetallic mines, four ore concentrators, and a zinc production facility in northern Manitoba and Saskatchewan, Canada, as well as in Cusco, Peru; and copper projects in Arizona and Nevada, the United States. HudBay Minerals Inc. was founded in 1927 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2V5",
        "website": "http://www.hudbayminerals.com",
        "market_cap": "Small Cap"
    },
    "HCH.AX": {
        "short_name": "HOT CHILI FPO",
        "long_name": "Hot Chili Limited",
        "summary": "Hot Chili Limited operates as a mineral exploration company in Australia and Chile. The company explores for copper, gold, and molybdenum, as well as silver deposits. Its flagship property is the Cortadera Copper-Gold Project located along the Chilean coastal range, Chile. The company was incorporated in 2008 and is based in Applecross, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Applecross",
        "zipcode": "6153",
        "website": "http://www.hotchili.net.au",
        "market_cap": "Small Cap"
    },
    "HDRSF": {
        "short_name": "HIGHLAND COPPER CO INC",
        "long_name": "Highland Copper Company Inc.",
        "summary": "Highland Copper Company Inc., together with its subsidiaries, engages in the acquisition, exploration, and development of mineral projects in the United States. The company explores for copper deposits. It owns the Copperwood copper project; and the White Pine copper project located in the Upper Peninsula of Michigan. The company was formerly known as Highland Resources Inc. and changed its name to Highland Copper Company Inc. in October 2012. Highland Copper Company Inc. is based in Longueuil, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "QC",
        "city": "Longueuil",
        "zipcode": "J4K 5G4",
        "website": "http://www.highlandcopper.com",
        "market_cap": "Small Cap"
    },
    "HGO.AX": {
        "short_name": "HILLGROVE FPO",
        "long_name": "Hillgrove Resources Limited",
        "summary": "Hillgrove Resources Limited operates as a mining company in Australia. The company explores for copper, gold, and silver deposits. Its flagship project is 100% owned Kanmantoo Copper mine located approximately 55km from Adelaide, South Australia. The company was incorporated in 1952 and is headquartered in Unley, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "SA",
        "city": "Unley",
        "zipcode": "5061",
        "website": "http://www.hillgroveresources.com.au",
        "market_cap": "Small Cap"
    },
    "HHLKF": {
        "short_name": "HOT CHILI LTD",
        "long_name": "Hot Chili Limited",
        "summary": "Hot Chili Limited operates as a mineral exploration company in Australia and Chile. The company explores for copper, gold, and molybdenum, as well as silver deposits. Its flagship property is the Cortadera Copper-Gold Project located along the Chilean coastal range, Chile. The company was incorporated in 2008 and is based in Applecross, Australia.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "WA",
        "city": "Applecross",
        "zipcode": "6153",
        "website": "http://www.hotchili.net.au",
        "market_cap": "Small Cap"
    },
    "HI.V": {
        "short_name": "HIGHLAND COPPER COMPANY INC",
        "long_name": "Highland Copper Company Inc.",
        "summary": "Highland Copper Company Inc., together with its subsidiaries, engages in the acquisition, exploration, and development of mineral projects in the United States. The company explores for copper deposits. It owns the Copperwood copper project; and the White Pine copper project located in the Upper Peninsula of Michigan. The company was formerly known as Highland Resources Inc. and changed its name to Highland Copper Company Inc. in October 2012. Highland Copper Company Inc. is based in Longueuil, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Longueuil",
        "zipcode": "J4K 5G4",
        "website": "http://www.highlandcopper.com",
        "market_cap": "Small Cap"
    },
    "HIN.F": {
        "short_name": "HILLGROVE RESOURCES LTD.",
        "long_name": "Hillgrove Resources Limited",
        "summary": "Hillgrove Resources Limited operates as a mining company in Australia. The company explores for copper, gold, and silver deposits. Its flagship project is 100% owned Kanmantoo Copper mine located approximately 55km from Adelaide, South Australia. The company was incorporated in 1952 and is headquartered in Unley, Australia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "SA",
        "city": "Unley",
        "zipcode": "5061",
        "website": "http://www.hillgroveresources.com.au",
        "market_cap": "Small Cap"
    },
    "HINDCOPPER.NS": {
        "short_name": "HINDUSTAN COPPER",
        "long_name": "Hindustan Copper Limited",
        "summary": "Hindustan Copper Limited manufactures and sells copper products in India. Its activities include exploration, exploitation, mining, beneficiation, smelting, refining, and casting of refined copper metal. The company offers continuous cast copper wire rod, continuous cast copper rods, copper cathodes, copper concentrates, copper sulfate, sulphuric acid, copper reverts, anode slime, and nickel cathodes. It also exports its products. The company was founded in 1967 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700019",
        "website": "http://www.hindustancopper.com",
        "market_cap": "Mid Cap"
    },
    "HPU.F": {
        "short_name": "COPPER FOX METALS INC.",
        "long_name": "Copper Fox Metals Inc.",
        "summary": "Copper Fox Metals Inc., a resource company, engages in the exploration and development of copper mineral properties in Canada and the United States. Its principal asset is the Schaft Creek copper-gold-molybdenum-silver project located in northwestern British Columbia. The company also holds interest in the Eaglehead porphyry copper project located in northern British Columbia. Copper Fox Metals Inc. was incorporated in 2004 and is headquartered in Calgary, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2R 1L5",
        "website": "http://www.copperfoxmetals.com",
        "market_cap": "Small Cap"
    },
    "IHM1.F": {
        "short_name": "TURQUOISE HILL RES",
        "long_name": "Turquoise Hill Resources Ltd.",
        "summary": "Turquoise Hill Resources Ltd., together with its subsidiaries, operates as a mining company. The company explores for copper, gold, and silver deposits. It develops and operates the Oyu Tolgoi copper-gold mine located in Southern Mongolia. The company was formerly known as Ivanhoe Mines Ltd. and changed its name to Turquoise Hill Resources Ltd. in August 2012. Turquoise Hill Resources Ltd. was incorporated in 1994 and is headquartered in Montreal, Canada. Turquoise Hill Resources Ltd. is a subsidiary of Rio Tinto plc.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3B 3P2",
        "website": "http://www.turquoisehill.com",
        "market_cap": "Mid Cap"
    },
    "III.TO": {
        "short_name": "IMPERIAL METALS CORP",
        "long_name": "Imperial Metals Corporation",
        "summary": "Imperial Metals Corporation, a mining company, engages in the acquisition, exploration, development, mining, and production of base and precious metals in Canada. It holds 100% interest in the Mount Polley copper-gold mine covering an area of 23,369 hectares consisting of seven mining leases and 50 mineral claims; the Huckleberry copper mines covering an area of 23,241 hectares consisting of two mining leases and 44 mineral claims. The company, through Red Chris Development Company Ltd, owns a 30% interest in the Red Chris copper-gold mine. It also holds a 45.3% interest in the Ruddock Creek lead/zinc property in British Columbia, as well as holds a portfolio of 25 greenfield exploration properties in British Columbia. The company was founded in 1959 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3B6",
        "website": "http://www.imperialmetals.com",
        "market_cap": "Small Cap"
    },
    "IKG.MI": {
        "short_name": "INTEK GROUP",
        "long_name": "Intek Group S.p.A.",
        "summary": "Intek Group S.p.A. produces and sells semi-finished copper and copper-alloy products in Europe and internationally. The company is also involved in the alternative energy, private equity, and real estate businesses. It offers products for maritime use and tube bundles. The company was formerly known as KME Group S.p.A. and changed its name to Intek Group S.p.A. in November 2012. Intek Group S.p.A. was founded in 1886 and is headquartered in Milan, Italy.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20121",
        "website": "http://www.itkgroup.it",
        "market_cap": "Small Cap"
    },
    "IKGR.MI": {
        "short_name": "INTEK GROUP RSP",
        "long_name": "Intek Group S.p.A.",
        "summary": "Intek Group S.p.A. produces and sells semi-finished copper and copper-alloy products in Europe and internationally. The company is also involved in the alternative energy, private equity, and real estate businesses. It offers products for maritime use and tube bundles. The company was formerly known as KME Group S.p.A. and changed its name to Intek Group S.p.A. in November 2012. Intek Group S.p.A. was founded in 1886 and is headquartered in Milan, Italy.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20121",
        "website": "http://www.itkgroup.it",
        "market_cap": "Small Cap"
    },
    "IPMLF": {
        "short_name": "IMPERIAL METALS CORPORATION",
        "long_name": "Imperial Metals Corporation",
        "summary": "Imperial Metals Corporation, a mining company, engages in the acquisition, exploration, development, mining, and production of base and precious metals in Canada. It holds 100% interest in the Mount Polley copper-gold mine covering an area of 23,369 hectares consisting of seven mining leases and 50 mineral claims; the Huckleberry copper mines covering an area of 23,241 hectares consisting of two mining leases and 44 mineral claims. The company, through Red Chris Development Company Ltd, owns a 30% interest in the Red Chris copper-gold mine. It also holds a 45.3% interest in the Ruddock Creek lead/zinc property in British Columbia, as well as holds a portfolio of 25 greenfield exploration properties in British Columbia. The company was founded in 1959 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3B6",
        "website": "http://www.imperialmetals.com",
        "market_cap": "Small Cap"
    },
    "IZ1.F": {
        "short_name": "FIRST QUANTUM MINLS",
        "long_name": "First Quantum Minerals Ltd.",
        "summary": "First Quantum Minerals Ltd. engages in the exploration, development, and production of mineral properties. It primarily explores for copper, nickel, pyrite, gold, silver, and zinc ores, as well as produces acid. The company holds 100% interests in the Ravensthorpe nickel and cobalt mine in Australia; the Sentinel copper project in North Western Province of Zambia; the Las Cruces copper mine in Spain; the Guelb Moghrein copper-gold mine in Mauritania; the PyhÃ¤salmi copper, pyrite, zinc mine in Finland; and the Ã\u0087ayeli copper-zinc mine in Turkey. It also holds an 80% interest in the Kansanshi copper-gold mine and copper smelter in Zambia; and a 90% interest in the Cobre Panama project located in Panama. In addition, the company has interests in copper, gold, and molybdenum projects at various stages of development located in Argentina, Peru, and Zambia. The company was formerly known as First Quantum Ventures Ltd. and changed its name to First Quantum Minerals Ltd. in July 1996. First Quantum Minerals Ltd. was incorporated in 1983 and is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2S8",
        "website": "http://www.first-quantum.com",
        "market_cap": "Large Cap"
    },
    "JIAXF": {
        "short_name": "JIANGXI COPPER CO",
        "long_name": "Jiangxi Copper Company Limited",
        "summary": "Jiangxi Copper Company Limited engages in exploring, mining, smelting, and refining copper in Mainland China, Hong Kong, and internationally. It offers copper cathodes, copper rods and wires, sulphuric acid, and other products, as well as deposit, loan, guarantee, and financing consultation services. It is involved in the processing and sale of copper and hardware electric products; collection and sale of scrap metals; production and sale of non-ferrous metals, rare metals and non-metals, electrolytic copper foil, spiral and copper tubes, copper and enameled wires, other copper pipe products, and cast iron grinding balls; provision of repair, consulting, and transportation services; exploration, mining, selection, and smelting of gold and chemical; project, industrial, and fund investment, investment management, and investment and economic information advisory services; metallurgical chemistry; equipment manufacturing and maintenance services; and development and production of thermo-electronic semiconductors and appliances. In addition, it engages in the development of chemical technologies; contracting for mining constructions; production and sale of casting products; maintenance of mechanical and electrical equipment; installation and debugging of equipment; sale of building materials; production of copper sulfate and electrolytic copper; scrap of base metals; and geological investigation and survey, and construction and engineering measurement. Further, it is involved in the sale of mineral processing, fine chemical, and other industrial and domestic products; trading of metal products; machinery processing; manufacture and sale of wear resistant materials; corporate asset and operation management, exhibition services, etc.; and trade and settlement of import-export business, offshore investment and financing, cross-border RMB settlement, and research and development activities. The company was incorporated in 1997 and is headquartered in Nanchang, China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330096",
        "website": "http://www.jxcc.com",
        "market_cap": "Large Cap"
    },
    "JIX.F": {
        "short_name": "JIANGXI COPPER CO. -H-YC1",
        "long_name": "Jiangxi Copper Company Limited",
        "summary": "Jiangxi Copper Company Limited engages in exploring, mining, smelting, and refining copper in Mainland China, Hong Kong, and internationally. It offers copper cathodes, copper rods and wires, sulphuric acid, and other products, as well as deposit, loan, guarantee, and financing consultation services. It is involved in the processing and sale of copper and hardware electric products; collection and sale of scrap metals; production and sale of non-ferrous metals, rare metals and non-metals, electrolytic copper foil, spiral and copper tubes, copper and enameled wires, other copper pipe products, and cast iron grinding balls; provision of repair, consulting, and transportation services; exploration, mining, selection, and smelting of gold and chemical; project, industrial, and fund investment, investment management, and investment and economic information advisory services; metallurgical chemistry; equipment manufacturing and maintenance services; and development and production of thermo-electronic semiconductors and appliances. In addition, it engages in the development of chemical technologies; contracting for mining constructions; production and sale of casting products; maintenance of mechanical and electrical equipment; installation and debugging of equipment; sale of building materials; production of copper sulfate and electrolytic copper; scrap of base metals; and geological investigation and survey, and construction and engineering measurement. Further, it is involved in the sale of mineral processing, fine chemical, and other industrial and domestic products; trading of metal products; machinery processing; manufacture and sale of wear resistant materials; corporate asset and operation management, exhibition services, etc.; and trade and settlement of import-export business, offshore investment and financing, cross-border RMB settlement, and research and development activities. The company was incorporated in 1997 and is headquartered in Nanchang, China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330096",
        "website": "http://www.jxcc.com",
        "market_cap": "Mid Cap"
    },
    "JIXAY": {
        "short_name": "JIANGXI COPPER CO",
        "long_name": "Jiangxi Copper Company Limited",
        "summary": "Jiangxi Copper Company Limited engages in exploring, mining, smelting, and refining copper in Mainland China, Hong Kong, and internationally. It offers copper cathodes, copper rods and wires, sulphuric acid, and other products, as well as deposit, loan, guarantee, and financing consultation services. It is involved in the processing and sale of copper and hardware electric products; collection and sale of scrap metals; production and sale of non-ferrous metals, rare metals and non-metals, electrolytic copper foil, spiral and copper tubes, copper and enameled wires, other copper pipe products, and cast iron grinding balls; provision of repair, consulting, and transportation services; exploration, mining, selection, and smelting of gold and chemical; project, industrial, and fund investment, investment management, and investment and economic information advisory services; metallurgical chemistry; equipment manufacturing and maintenance services; and development and production of thermo-electronic semiconductors and appliances. In addition, it engages in the development of chemical technologies; contracting for mining constructions; production and sale of casting products; maintenance of mechanical and electrical equipment; installation and debugging of equipment; sale of building materials; production of copper sulfate and electrolytic copper; scrap of base metals; and geological investigation and survey, and construction and engineering measurement. Further, it is involved in the sale of mineral processing, fine chemical, and other industrial and domestic products; trading of metal products; machinery processing; manufacture and sale of wear resistant materials; corporate asset and operation management, exhibition services, etc.; and trade and settlement of import-export business, offshore investment and financing, cross-border RMB settlement, and research and development activities. The company was incorporated in 1997 and is headquartered in Nanchang, China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330096",
        "website": "http://www.jxcc.com",
        "market_cap": "Large Cap"
    },
    "KAZ.L": {
        "short_name": "KAZ MINERALS PLC ORD 20P",
        "long_name": "KAZ Minerals PLC",
        "summary": "KAZ Minerals PLC, together with its subsidiaries, engages in mining and processing copper and other metals primarily in Kazakhstan, Russia, and Kyrgyzstan. It operates through Bozshakol, Aktogay, East Region and Bozymchak, and Mining Projects segments. The company operates the Aktogay and Bozshakol open pit copper mines in the east region and Pavlodar region of Kazakhstan; three underground mines in the east region of Kazakhstan; and the Bozymchak copper-gold mine in Kyrgyzstan. It also develops greenfield metal deposits; operates Koksay deposit in Kazakhstan, and the Baimskaya licence area in the Chukotka region of Russia; and produces and sells various by-products, such as gold, silver, molybdenum, and zinc. In addition, the company supplies and distributes heat, water, and electricity; and offers construction, project management, financing, management, sales and logistics, and repairs and maintenance services. The company was formerly known as Kazakhmys PLC and changed its name to KAZ Minerals PLC in October 2014. KAZ Minerals PLC was founded in 1930 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SW1E 5JL",
        "website": "http://www.kazminerals.com",
        "market_cap": null
    },
    "KCC.AX": {
        "short_name": "KINCORACOP CDI 1:1",
        "long_name": "Kincora Copper Limited",
        "summary": "Kincora Copper Limited acquires, explores for, and develops mineral properties in Mongolia and Australia. The company primarily explores for copper and gold deposits. It owns interests in the Bronze Fox project located in Mongolia; Nyngan project covering an area of 762 square kilometers located in the Lachlan fold belt in central New South Wales, Australia; and Nevertire project totaling an area of 382 square kilometers located in New South Wales, Australia. The company was formerly known as Brazilian Diamonds Limited and changed its name to Kincora Copper Limited in January 2011. Kincora Copper Limited was incorporated in 1983 and is headquartered in Vancouver, Canada.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3N6",
        "website": "http://www.kincoracopper.com",
        "market_cap": "Small Cap"
    },
    "KCC.V": {
        "short_name": "KINCORA COPPER LIMITED",
        "long_name": "Kincora Copper Limited",
        "summary": "Kincora Copper Limited acquires, explores for, and develops mineral properties in Mongolia and Australia. The company primarily explores for copper and gold deposits. It owns interests in the Bronze Fox project located in Mongolia; Nyngan project covering an area of 762 square kilometers located in the Lachlan fold belt in central New South Wales, Australia; and Nevertire project totaling an area of 382 square kilometers located in New South Wales, Australia. The company was formerly known as Brazilian Diamonds Limited and changed its name to Kincora Copper Limited in January 2011. Kincora Copper Limited was incorporated in 1983 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3N6",
        "website": "http://www.kincoracopper.com",
        "market_cap": "Small Cap"
    },
    "KGH.PR": {
        "short_name": "KGHM POLSKA-MIEDZ",
        "long_name": "KGHM Polska Miedz S.A.",
        "summary": "KGHM Polska Miedz S.A. mines, produces, and sells copper, precious metals, and non-ferrous metals in Poland and internationally. It offers copper cathodes, wire rods, Cu-Ofe and Cu-Ag wires, and granule products; silver in bullion bar and granule forms; gold bars; molybdenum; ammonium perrhenate, metallic rhenium, and rhenium powder; and lead, sulphuric acid, copper and nickel sulphate, and selenium products, as well as platinum, palladium, and rock salt. The company also generates, transmits, and distributes electrical and heating energy; trades in oil-based products, consumer goods, and chemicals; constructs mine, and roadway/railway tunnels; transports roadway and railway cargo; and measures imissions and emissions. In addition, it produces and sells mining and construction machinery and equipment, explosives, Nitrocet 50, initiating systems, electrical and hydraulic cables, automated equipment, communication systems, graphene, and building materials. Further, the company engages in the industrial research, drilling and blasting works, medical practice, and consulting and technical activities; certifies and attests machinery and equipment; trades in and processes non-ferrous metals scrap and shaft slag; recovers rhenium, copper, and silver metals; recycles waste; and sells metallurgical products. Additionally, it offers specialist construction and drilling, steel construction, machinery repair and maintenance, logistics, passenger roadway transport, rolling, gastronomic, electrical engineering, catering, hotel, recreation, rehabilitation, health tourism, wellness, spa-healing, sanatorium, preventative and occupational medicine, biological renewal, hospital, water sewage management, design, real estate market, construction, financing, and insurance services; manages railway infrastructure; manages investment funds; manages a football club; and organizes professional sporting events. The company was founded in 1961 and is headquartered in Lubin, Poland.",
        "currency": "CZK",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PRA",
        "market": "cz_market",
        "country": "Poland",
        "state": null,
        "city": "Lubin",
        "zipcode": "59-301",
        "website": "http://kghm.com",
        "market_cap": "Large Cap"
    },
    "KGHA.F": {
        "short_name": "KGHM POLSKA MIEDZ  ZY 10",
        "long_name": "KGHM Polska Miedz S.A.",
        "summary": "KGHM Polska Miedz S.A. mines, produces, and sells copper, precious metals, and non-ferrous metals in Poland and internationally. It offers copper cathodes, wire rods, Cu-Ofe and Cu-Ag wires, and granule products; silver in bullion bar and granule forms; gold bars; molybdenum; ammonium perrhenate, metallic rhenium, and rhenium powder; and lead, sulphuric acid, copper and nickel sulphate, and selenium products, as well as platinum, palladium, and rock salt. The company also generates, transmits, and distributes electrical and heating energy; trades in oil-based products, consumer goods, and chemicals; constructs mine, and roadway/railway tunnels; transports roadway and railway cargo; and measures imissions and emissions. In addition, it produces and sells mining and construction machinery and equipment, explosives, Nitrocet 50, initiating systems, electrical and hydraulic cables, automated equipment, communication systems, graphene, and building materials. Further, the company engages in the industrial research, drilling and blasting works, medical practice, and consulting and technical activities; certifies and attests machinery and equipment; trades in and processes non-ferrous metals scrap and shaft slag; recovers rhenium, copper, and silver metals; recycles waste; and sells metallurgical products. Additionally, it offers specialist construction and drilling, steel construction, machinery repair and maintenance, logistics, passenger roadway transport, rolling, gastronomic, electrical engineering, catering, hotel, recreation, rehabilitation, health tourism, wellness, spa-healing, sanatorium, preventative and occupational medicine, biological renewal, hospital, water sewage management, design, real estate market, construction, financing, and insurance services; manages railway infrastructure; manages investment funds; manages a football club; and organizes professional sporting events. The company was founded in 1961 and is headquartered in Lubin, Poland.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "state": null,
        "city": "Lubin",
        "zipcode": "59-301",
        "website": "http://kghm.com",
        "market_cap": "Mid Cap"
    },
    "KQ1.F": {
        "short_name": "KAZ MINERALS PLC  LS -,20",
        "long_name": "KAZ Minerals PLC",
        "summary": "KAZ Minerals PLC, together with its subsidiaries, engages in mining and processing copper and other metals primarily in Kazakhstan, Russia, and Kyrgyzstan. It operates through Bozshakol, Aktogay, East Region and Bozymchak, and Mining Projects segments. The company operates the Aktogay and Bozshakol open pit copper mines in the east region and Pavlodar region of Kazakhstan; three underground mines in the east region of Kazakhstan; and the Bozymchak copper-gold mine in Kyrgyzstan. It also develops greenfield metal deposits; operates Koksay deposit in Kazakhstan, and the Baimskaya licence area in the Chukotka region of Russia; and produces and sells various by-products, such as gold, silver, molybdenum, and zinc. In addition, the company supplies and distributes heat, water, and electricity; and offers construction, project management, financing, management, sales and logistics, and repairs and maintenance services. The company was formerly known as Kazakhmys PLC and changed its name to KAZ Minerals PLC in October 2014. KAZ Minerals PLC was founded in 1930 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SW1E 5JL",
        "website": "http://www.kazminerals.com",
        "market_cap": "Mid Cap"
    },
    "KZMYF": {
        "short_name": "KAZ MINERALS PLC",
        "long_name": "KAZ Minerals PLC",
        "summary": "KAZ Minerals PLC, together with its subsidiaries, engages in mining and processing copper and other metals primarily in Kazakhstan, Russia, and Kyrgyzstan. It operates through Bozshakol, Aktogay, East Region and Bozymchak, and Mining Projects segments. The company operates the Aktogay and Bozshakol open pit copper mines in the east region and Pavlodar region of Kazakhstan; three underground mines in the east region of Kazakhstan; and the Bozymchak copper-gold mine in Kyrgyzstan. It also develops greenfield metal deposits; operates Koksay deposit in Kazakhstan, and the Baimskaya licence area in the Chukotka region of Russia; and produces and sells various by-products, such as gold, silver, molybdenum, and zinc. In addition, the company supplies and distributes heat, water, and electricity; and offers construction, project management, financing, management, sales and logistics, and repairs and maintenance services. The company was formerly known as Kazakhmys PLC and changed its name to KAZ Minerals PLC in October 2014. KAZ Minerals PLC was founded in 1930 and is based in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SW1E 5JL",
        "website": "http://www.kazminerals.com",
        "market_cap": "Mid Cap"
    },
    "KZMYY": {
        "short_name": "KAZ MINERALS PLC",
        "long_name": "KAZ Minerals PLC",
        "summary": "KAZ Minerals PLC, together with its subsidiaries, engages in mining and processing copper and other metals primarily in Kazakhstan, Russia, and Kyrgyzstan. It operates through Bozshakol, Aktogay, East Region and Bozymchak, and Mining Projects segments. The company operates the Aktogay and Bozshakol open pit copper mines in the east region and Pavlodar region of Kazakhstan; three underground mines in the east region of Kazakhstan; and the Bozymchak copper-gold mine in Kyrgyzstan. It also develops greenfield metal deposits; operates Koksay deposit in Kazakhstan, and the Baimskaya licence area in the Chukotka region of Russia; and produces and sells various by-products, such as gold, silver, molybdenum, and zinc. In addition, the company supplies and distributes heat, water, and electricity; and offers construction, project management, financing, management, sales and logistics, and repairs and maintenance services. The company was formerly known as Kazakhmys PLC and changed its name to KAZ Minerals PLC in October 2014. KAZ Minerals PLC was founded in 1930 and is based in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SW1E 5JL",
        "website": "http://www.kazminerals.com",
        "market_cap": "Mid Cap"
    },
    "L7D.F": {
        "short_name": "IMPERIAL METALS CORP.",
        "long_name": "Imperial Metals Corporation",
        "summary": "Imperial Metals Corporation, a mining company, engages in the acquisition, exploration, development, mining, and production of base and precious metals in Canada. It holds 100% interest in the Mount Polley copper-gold mine covering an area of 23,369 hectares consisting of seven mining leases and 50 mineral claims; the Huckleberry copper mines covering an area of 23,241 hectares consisting of two mining leases and 44 mineral claims. The company, through Red Chris Development Company Ltd, owns a 30% interest in the Red Chris copper-gold mine. It also holds a 45.3% interest in the Ruddock Creek lead/zinc property in British Columbia, as well as holds a portfolio of 25 greenfield exploration properties in British Columbia. The company was founded in 1959 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3B6",
        "website": "http://www.imperialmetals.com",
        "market_cap": "Small Cap"
    },
    "LUMI.ST": {
        "short_name": "Lundin Mining Corporation",
        "long_name": "Lundin Mining Corporation",
        "summary": "Lundin Mining Corporation, a diversified base metals mining company, engages in the exploration, development, and mining of mineral properties in Brazil, Chile, Portugal, Sweden, and the United States. It primarily produces copper, zinc, nickel, and gold, as well as lead, silver, and other metals. The company holds 100% interests in the Chapada mine located in Brazil; the Eagle mine located in the United States; the Neves-Corvo mine located in Portugal; and the Zinkgruvan mine located in Sweden. It also holds 80% interests in the Candelaria and Ojos del Salado mining complex located in Chile. The company was formerly known as South Atlantic Ventures Ltd. and changed its name to Lundin Mining Corporation in August 2004. Lundin Mining Corporation was incorporated in 1994 and is headquartered in Toronto, Canada.",
        "currency": "SEK",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "STO",
        "market": "se_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 1J9",
        "website": "http://www.lundinmining.com",
        "market_cap": "Mid Cap"
    },
    "LUN.TO": {
        "short_name": "LUNDIN MINING CORP.",
        "long_name": "Lundin Mining Corporation",
        "summary": "Lundin Mining Corporation, a diversified base metals mining company, engages in the exploration, development, and mining of mineral properties in Brazil, Chile, Portugal, Sweden, and the United States. It primarily produces copper, zinc, nickel, and gold, as well as lead, silver, and other metals. The company holds 100% interests in the Chapada mine located in Brazil; the Eagle mine located in the United States; the Neves-Corvo mine located in Portugal; and the Zinkgruvan mine located in Sweden. It also holds 80% interests in the Candelaria and Ojos del Salado mining complex located in Chile. The company was formerly known as South Atlantic Ventures Ltd. and changed its name to Lundin Mining Corporation in August 2004. Lundin Mining Corporation was incorporated in 1994 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 1J9",
        "website": "http://www.lundinmining.com",
        "market_cap": "Mid Cap"
    },
    "LUNMF": {
        "short_name": "LUNDIN MINING CORP",
        "long_name": "Lundin Mining Corporation",
        "summary": "Lundin Mining Corporation, a diversified base metals mining company, engages in the exploration, development, and mining of mineral properties in Brazil, Chile, Portugal, Sweden, and the United States. It primarily produces copper, zinc, nickel, and gold, as well as lead, silver, and other metals. The company holds 100% interests in the Chapada mine located in Brazil; the Eagle mine located in the United States; the Neves-Corvo mine located in Portugal; and the Zinkgruvan mine located in Sweden. It also holds 80% interests in the Candelaria and Ojos del Salado mining complex located in Chile. The company was formerly known as South Atlantic Ventures Ltd. and changed its name to Lundin Mining Corporation in August 2004. Lundin Mining Corporation was incorporated in 1994 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 1J9",
        "website": "http://www.lundinmining.com",
        "market_cap": "Mid Cap"
    },
    "MARI.TO": {
        "short_name": "MARIMACA COPPER CORP",
        "long_name": "Marimaca Copper Corp.",
        "summary": "Marimaca Copper Corp. engages in the acquisition, exploration, and exploitation of mineral properties and projects in Chile. The company explores for copper, iron ore, gold, and other base and precious metals. Its flagship project is the Marimaca Copper project located in the Antofagasta Region of Chile. The company was formerly known as Coro Mining Corp. and changed its name to Marimaca Copper Corp. in May 2020. Marimaca Copper Corp. was incorporated in 2004 and is headquartered in Las Condes, Chile.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Chile",
        "state": null,
        "city": "Las Condes",
        "zipcode": "7560742",
        "website": "http://www.marimaca.com",
        "market_cap": "Small Cap"
    },
    "MCL.NS": {
        "short_name": "Madhav Copper Limited",
        "long_name": "Madhav Copper Limited",
        "summary": "Madhav Copper Limited manufactures and sells copper products in India. The company offers copper fabricated products, enameled copper wires, paper covered copper conductors, poly wrap submersible winding wires, fiberglass copper conductors, tapped insulated copper conductors, and bare copper wires, as well as copper bus bars, strips, rods, and profiles. Its products are used in pumps, motors, transformers, generators, hydro generators, alternators, wind generators, panels, and switch gears; automatic coil winding machines; and to fabricate in automatic CNC machines. Madhav Copper Limited was incorporated in 2012 and is based in Bhavnagar, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bhavnagar",
        "zipcode": "364001",
        "website": "http://www.madhavcopper.com",
        "market_cap": "Small Cap"
    },
    "MLX.AX": {
        "short_name": "METALS X FPO",
        "long_name": "Metals X Limited",
        "summary": "Metals X Limited engages in the production of tin in Australia. It operates through Renison Tin Operations, Mt Bischoff Tin Project, Nifty Copper Operations, Maroochydore Copper Project, and Wingellina Nickel Project segments. Its products include copper, tin, cobalt, and nickel. The company holds a 50% interest in the Renison tin project located on the west coast of Tasmania; and a 100% interest in the Nifty copper project in Western Australia. It also holds in the Central Musgrave project that covers an area of 2,000 square kilometers of exploration tenure, including the Wingellina nickel-cobalt limonite deposit, the Claude Hills nickel deposit, and the Mt Davies exploration prospects located in the Central Musgrave ranges. The company was incorporated in 2004 and is based in Perth, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6000",
        "website": "http://www.metalsx.com.au",
        "market_cap": "Small Cap"
    },
    "MLXEF": {
        "short_name": "METALS X LIMITED",
        "long_name": "Metals X Limited",
        "summary": "Metals X Limited engages in the production of tin in Australia. It operates through Renison Tin Operations, Mt Bischoff Tin Project, Nifty Copper Operations, Maroochydore Copper Project, and Wingellina Nickel Project segments. Its products include copper, tin, cobalt, and nickel. The company holds a 50% interest in the Renison tin project located on the west coast of Tasmania; and a 100% interest in the Nifty copper project in Western Australia. It also holds in the Central Musgrave project that covers an area of 2,000 square kilometers of exploration tenure, including the Wingellina nickel-cobalt limonite deposit, the Claude Hills nickel deposit, and the Mt Davies exploration prospects located in the Central Musgrave ranges. The company was incorporated in 2004 and is based in Perth, Australia.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6000",
        "website": "http://www.metalsx.com.au",
        "market_cap": "Small Cap"
    },
    "MTJ3.F": {
        "short_name": "INTEK GROUP S.P.A.",
        "long_name": "Intek Group S.p.A.",
        "summary": "Intek Group S.p.A. produces and sells semi-finished copper and copper-alloy products in Europe and internationally. The company is also involved in the alternative energy, private equity, and real estate businesses. It offers products for maritime use and tube bundles. The company was formerly known as KME Group S.p.A. and changed its name to Intek Group S.p.A. in November 2012. Intek Group S.p.A. was founded in 1886 and is headquartered in Milan, Italy.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20121",
        "website": "http://www.itkgroup.it",
        "market_cap": "Small Cap"
    },
    "NCU.TO": {
        "short_name": "NEVADA COPPER CORP.",
        "long_name": "Nevada Copper Corp.",
        "summary": "Nevada Copper Corp. engages in the exploration, development, and operation of mineral properties in Nevada. The company explores for copper, gold, and silver ores. Its holds 100% interests in the Pumpkin Hollow property located in Nevada, the United States. Nevada Copper Corp. is based in Reno, Nevada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "United States",
        "state": "NV",
        "city": "Reno",
        "zipcode": "89501",
        "website": "http://www.nevadacopper.com",
        "market_cap": "Small Cap"
    },
    "NDA.DE": {
        "short_name": "AURUBIS AG",
        "long_name": "Aurubis AG",
        "summary": "Aurubis AG provides non-ferrous metals worldwide. It processes complex metal concentrates, scrap metals, and organic and inorganic metal-bearing recycling materials, and industrial residues to produce metals. The company produces continuous cast, directly cast, and oxygen-free copper rods, as well as various drawn products; a range of materials in round and square cross-sections, and various dimensions under the AURUBIS SHAPES brand; and copper-based architectural products and services for the building and construction industry, such as flat copper sheets, as well as prefabricated systems for facades, roofs, and rainwater systems. It also provides industrial rolled products, including connector strips, radiator strips, sheets, plates and circles, and pre-rolled strips; cathodes; bars and profiles comprising flat bars, round bars, segments, profiles, and hollow profiles; copper bars and profiles; precious metals consisting of gold and silver; and sulfuric acid, iron silicate, selenium, and lead. In addition, the company engages in the recycling of copper, precious metals, and other non-ferrous metals; and material recycling activity for copper. Further, it offers metals comprising tellurium metal, tellurium dioxide, selenium, lead-bismuth, and lead-antimony alloys. The company serves cable and wire, construction, machinery and plant engineering, transport, chemistry, and other industries. The company was formerly known as Norddeutsche Affinerie AG and changed its name to Aurubis AG in April 2009. Aurubis AG was founded in 1866 and is headquartered in Hamburg, Germany.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "state": null,
        "city": "Hamburg",
        "zipcode": "20539",
        "website": "http://www.aurubis.com",
        "market_cap": "Mid Cap"
    },
    "NDA.F": {
        "short_name": "AURUBIS AG",
        "long_name": "Aurubis AG",
        "summary": "Aurubis AG provides non-ferrous metals worldwide. It processes complex metal concentrates, scrap metals, and organic and inorganic metal-bearing recycling materials, and industrial residues to produce metals. The company produces continuous cast, directly cast, and oxygen-free copper rods, as well as various drawn products; a range of materials in round and square cross-sections, and various dimensions under the AURUBIS SHAPES brand; and copper-based architectural products and services for the building and construction industry, such as flat copper sheets, as well as prefabricated systems for facades, roofs, and rainwater systems. It also provides industrial rolled products, including connector strips, radiator strips, sheets, plates and circles, and pre-rolled strips; cathodes; bars and profiles comprising flat bars, round bars, segments, profiles, and hollow profiles; copper bars and profiles; precious metals consisting of gold and silver; and sulfuric acid, iron silicate, selenium, and lead. In addition, the company engages in the recycling of copper, precious metals, and other non-ferrous metals; and material recycling activity for copper. Further, it offers metals comprising tellurium metal, tellurium dioxide, selenium, lead-bismuth, and lead-antimony alloys. The company serves cable and wire, construction, machinery and plant engineering, transport, chemistry, and other industries. The company was formerly known as Norddeutsche Affinerie AG and changed its name to Aurubis AG in April 2009. Aurubis AG was founded in 1866 and is headquartered in Hamburg, Germany.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "state": null,
        "city": "Hamburg",
        "zipcode": "20539",
        "website": "http://www.aurubis.com",
        "market_cap": "Mid Cap"
    },
    "NDA.VI": {
        "short_name": "AURUBIS AG",
        "long_name": "Aurubis AG",
        "summary": "Aurubis AG provides non-ferrous metals worldwide. It processes complex metal concentrates, scrap metals, and organic and inorganic metal-bearing recycling materials, and industrial residues to produce metals. The company produces continuous cast, directly cast, and oxygen-free copper rods, as well as various drawn products; a range of materials in round and square cross-sections, and various dimensions under the AURUBIS SHAPES brand; and copper-based architectural products and services for the building and construction industry, such as flat copper sheets, as well as prefabricated systems for facades, roofs, and rainwater systems. It also provides industrial rolled products, including connector strips, radiator strips, sheets, plates and circles, and pre-rolled strips; cathodes; bars and profiles comprising flat bars, round bars, segments, profiles, and hollow profiles; copper bars and profiles; precious metals consisting of gold and silver; and sulfuric acid, iron silicate, selenium, and lead. In addition, the company engages in the recycling of copper, precious metals, and other non-ferrous metals; and material recycling activity for copper. Further, it offers metals comprising tellurium metal, tellurium dioxide, selenium, lead-bismuth, and lead-antimony alloys. The company serves cable and wire, construction, machinery and plant engineering, transport, chemistry, and other industries. The company was formerly known as Norddeutsche Affinerie AG and changed its name to Aurubis AG in April 2009. Aurubis AG was founded in 1866 and is headquartered in Hamburg, Germany.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Germany",
        "state": null,
        "city": "Hamburg",
        "zipcode": "20539",
        "website": "http://www.aurubis.com",
        "market_cap": "Mid Cap"
    },
    "NDA1.F": {
        "short_name": "AURUBIS AG UNSP.ADR 1/2",
        "long_name": "Aurubis AG",
        "summary": "Aurubis AG provides non-ferrous metals worldwide. It processes complex metal concentrates, scrap metals, and organic and inorganic metal-bearing recycling materials, and industrial residues to produce metals. The company produces continuous cast, directly cast, and oxygen-free copper rods, as well as various drawn products; a range of materials in round and square cross-sections, and various dimensions under the AURUBIS SHAPES brand; and copper-based architectural products and services for the building and construction industry, such as flat copper sheets, as well as prefabricated systems for facades, roofs, and rainwater systems. It also provides industrial rolled products, including connector strips, radiator strips, sheets, plates and circles, and pre-rolled strips; cathodes; bars and profiles comprising flat bars, round bars, segments, profiles, and hollow profiles; copper bars and profiles; precious metals consisting of gold and silver; and sulfuric acid, iron silicate, selenium, and lead. In addition, the company engages in the recycling of copper, precious metals, and other non-ferrous metals; and material recycling activity for copper. Further, it offers metals comprising tellurium metal, tellurium dioxide, selenium, lead-bismuth, and lead-antimony alloys. The company serves cable and wire, construction, machinery and plant engineering, transport, chemistry, and other industries. The company was formerly known as Norddeutsche Affinerie AG and changed its name to Aurubis AG in April 2009. Aurubis AG was founded in 1866 and is headquartered in Hamburg, Germany.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "state": null,
        "city": "Hamburg",
        "zipcode": "20539",
        "website": "http://www.aurubis.com",
        "market_cap": "Mid Cap"
    },
    "NEVDF": {
        "short_name": "NEVADA COPPER CORP",
        "long_name": "Nevada Copper Corp.",
        "summary": "Nevada Copper Corp. engages in the exploration, development, and operation of mineral properties in Nevada. The company explores for copper, gold, and silver ores. Its holds 100% interests in the Pumpkin Hollow property located in Nevada, the United States. Nevada Copper Corp. is based in Reno, Nevada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Reno",
        "zipcode": "89501",
        "website": "http://www.nevadacopper.com",
        "market_cap": "Small Cap"
    },
    "NPEZF": {
        "short_name": "BAM BAM RESOURCES CORP",
        "long_name": "Bam Bam Resources Corp.",
        "summary": "Bam Bam Resources Corp. engages in the acquisition and exploration of mineral property assets. The company primarily explores for gold, silver, and copper deposits. Its flagship property is the Majuba Hill project situated in Nevada, the United States. The company was formerly known as KOPR Point Ventures Inc. and changed its name to Bam Bam Resources Corp. in December 2019. Bam Bam Resources Corp. was incorporated in 2017 and is headquartered in North Vancouver, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 0A6",
        "website": "http://www.bambamresources.com",
        "market_cap": "Small Cap"
    },
    "NRX.AX": {
        "short_name": "NORONEXLTD FPO",
        "long_name": "Noronex Limited",
        "summary": "Noronex Limited, a mineral exploration company, engages in identifying exploration projects in Australia. It primarily holds interests in the Consuelo project that comprises three coal exploration permits located in the Bowen Basin of Queensland. The company was formerly known as Lustrum Minerals Limited and changed its name to Noronex Limited in November 2020. Noronex Limited was incorporated in 2015 and is based in Subiaco, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Subiaco",
        "zipcode": "6008",
        "website": "http://www.noronexlimited.com.au",
        "market_cap": "Small Cap"
    },
    "OCKA.F": {
        "short_name": "HUDBAY MINERALS INC.",
        "long_name": "Hudbay Minerals Inc.",
        "summary": "Hudbay Minerals Inc., a diversified mining company, together with its subsidiaries, focuses on the discovery, production, and marketing of base and precious metals in North and South America. It produces copper concentrates containing copper, gold, and silver; molybdenum concentrates; and zinc metals. The company owns three polymetallic mines, four ore concentrators, and a zinc production facility in northern Manitoba and Saskatchewan, Canada, as well as in Cusco, Peru; and copper projects in Arizona and Nevada, the United States. HudBay Minerals Inc. was founded in 1927 and is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2V5",
        "website": "http://www.hudbayminerals.com",
        "market_cap": "Small Cap"
    },
    "OUW.F": {
        "short_name": "CAPSTONE MINING CORP.",
        "long_name": "Capstone Mining Corp.",
        "summary": "Capstone Mining Corp. engages in the exploration and production of base metals in the United States, Mexico, Canada, and Chile. The company explores for copper, molybdenum, silver, zinc, lead, iron, and gold deposits. It holds interests in the Pinto Valley, an open pit copper mine located in Arizona, the United States; and the Cozamin, an underground, copper-silver mine located in the state of Zacatecas, Mexico. The company also owns a 70% interest in copper-iron-gold Santo Domingo development project in Region III, Chile. The company was incorporated in 2009 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 0M3",
        "website": "http://www.capstonemining.com",
        "market_cap": "Small Cap"
    },
    "OXR.F": {
        "short_name": "OZ MINERALS LTD",
        "long_name": "OZ Minerals Limited",
        "summary": "OZ Minerals Limited engages in the exploration, development, mining, and processing of mining projects in Australia. The company primarily explores for copper, gold, silver, nickel, iron oxide, zinc, and lead deposits. It owns and operates the Prominent Hill mine located in northern South Australia; the Carrapateena project located in South Australia; and the Antas mine located in the state of ParÃ¡ in the northern region of Brazil. The company also holds interests in the West Musgrave copper-nickel project located in the Musgrave Province, Western Australia; Pedra Branca project located in the southern part of the CarajÃ¡s in the state of ParÃ¡ in the North of Brazil; and the CentroGold project located in the state of MaranhÃ£o in northern Brazil. In addition, it has interests in the Paraiso, Pantera, Lannavaara, Coompana, and Eloise properties. The company was incorporated in 1932 and is headquartered in Adelaide, Australia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "SA",
        "city": "Adelaide",
        "zipcode": "5950",
        "website": "http://www.ozminerals.com",
        "market_cap": "Mid Cap"
    },
    "OZL.AX": {
        "short_name": "OZMINER FPO",
        "long_name": "OZ Minerals Limited",
        "summary": "OZ Minerals Limited engages in the exploration, development, mining, and processing of mining projects in Australia. The company primarily explores for copper, gold, silver, nickel, iron oxide, zinc, and lead deposits. It owns and operates the Prominent Hill mine located in northern South Australia; the Carrapateena project located in South Australia; and the Antas mine located in the state of ParÃ¡ in the northern region of Brazil. The company also holds interests in the West Musgrave copper-nickel project located in the Musgrave Province, Western Australia; Pedra Branca project located in the southern part of the CarajÃ¡s in the state of ParÃ¡ in the North of Brazil; and the CentroGold project located in the state of MaranhÃ£o in northern Brazil. In addition, it has interests in the Paraiso, Pantera, Lannavaara, Coompana, and Eloise properties. The company was incorporated in 1932 and is headquartered in Adelaide, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "SA",
        "city": "Adelaide",
        "zipcode": "5950",
        "website": "http://www.ozminerals.com",
        "market_cap": "Mid Cap"
    },
    "OZMLF": {
        "short_name": "OZ MINERALS LTD",
        "long_name": "OZ Minerals Limited",
        "summary": "OZ Minerals Limited engages in the exploration, development, mining, and processing of mining projects in Australia. The company primarily explores for copper, gold, silver, nickel, iron oxide, zinc, and lead deposits. It owns and operates the Prominent Hill mine located in northern South Australia; the Carrapateena project located in South Australia; and the Antas mine located in the state of ParÃ¡ in the northern region of Brazil. The company also holds interests in the West Musgrave copper-nickel project located in the Musgrave Province, Western Australia; Pedra Branca project located in the southern part of the CarajÃ¡s in the state of ParÃ¡ in the North of Brazil; and the CentroGold project located in the state of MaranhÃ£o in northern Brazil. In addition, it has interests in the Paraiso, Pantera, Lannavaara, Coompana, and Eloise properties. The company was incorporated in 1932 and is headquartered in Adelaide, Australia.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "SA",
        "city": "Adelaide",
        "zipcode": "5950",
        "website": "http://www.ozminerals.com",
        "market_cap": "Mid Cap"
    },
    "PCU.F": {
        "short_name": "SOUTHERN COPPER  DL-,01",
        "long_name": "Southern Copper Corporation",
        "summary": "Southern Copper Corporation engages in mining, exploring, smelting, and refining copper and other minerals in Peru, Mexico, Argentina, Ecuador, and Chile. The company is involved in the mining, milling, and flotation of copper ore to produce copper and molybdenum concentrates; smelting of copper concentrates to produce blister and anode copper; refining of anode copper to produce copper cathodes; production of molybdenum concentrate and sulfuric acid; production of refined silver, gold, and other materials; and mining and processing of zinc and lead. It operates the Toquepala and Cuajone open-pit mines, and a smelter and refinery in Peru; and La Caridad, an open-pit copper mine, as well as a copper ore concentrator, a SX-EW plant, a smelter, refinery, and a rod plant in Mexico. The company also operates Buenavista, an open-pit copper mine, as well as two copper concentrators and two operating SX-EW plants in Mexico. In addition, it operates five underground mines that produce zinc, lead, copper, silver, and gold; a coal mine that produces coal and coke; and a zinc refinery. The company has interests in 59,252 hectares of exploration concessions in Peru; 503,104 hectares of exploration concessions in Mexico; 229,312 hectares of exploration concessions in Argentina; 27,353 hectares of exploration concessions in Chile; and 7,299 hectares of exploration concessions in Ecuador. Southern Copper Corporation was incorporated in 1952 and is based in Phoenix, Arizona. Southern Copper Corporation is a subsidiary of Americas Mining Corporation.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85014",
        "website": "http://www.southerncoppercorp.com",
        "market_cap": "Large Cap"
    },
    "PMAM3.SA": {
        "short_name": "PARANAPANEMAON      NM",
        "long_name": "Paranapanema S.A.",
        "summary": "Paranapanema S.A. produces and sells electrolytically refined copper, its byproducts, and related services in Brazil and internationally. Its products include cathodes, wire rod, drawn wire, sulfuric acid, oleum, iron silicate, and anode sludge from which precious metals are extracted; and copper and bronze connections for hot and cold-water plumbing systems, as well as pipes for industrial, residential gas, and fire-fighting systems. The company also offers semi-finished products of copper and copper alloys; and copper and copper alloy laminates, wires, bars, and profiles that are used for manufacturing parts and components in automotive, electronics, apparel, hardware, bathroom fixture, stamping, machining, and other industries. In addition, it provides copper tubes for use in air conditioning systems, compressors, components, refrigeration systems, and civil construction. The company offers its products under the CaraÃ­ba, Eluma, and Paranapanema brand names. Paranapanema S.A. was founded in 1961 and is headquartered in Dias D'Ã¡vila, Brazil.",
        "currency": "BRL",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": "BA",
        "city": "Dias d`Ã\u0081vila",
        "zipcode": "42850-000",
        "website": "http://www.paranapanema.com.br",
        "market_cap": "Small Cap"
    },
    "PUCOBRE.SN": {
        "short_name": "SOCIEDAD PUNTA DEL",
        "long_name": "Sociedad Punta del Cobre S.A.",
        "summary": "Sociedad Punta del Cobre S.A., a mining company, engages in the exploitation of copper deposits primarily in the Atacama Region. It holds interest in Punta del Cobre, Copper Mantle Mine, Mina Granate, San Jose, and Biocobre mines located in the Atacama Region. The company also holds interests in the El Espino project located in Coquimbo region; and the Tovaku project located in Antofagasta region. Sociedad Punta del Cobre S.A. was founded in 1989 and is based in CopiapÃ³, Chile.",
        "currency": "CLP",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "state": null,
        "city": "CopiapÃ³",
        "zipcode": null,
        "website": "http://www.pucobre.cl",
        "market_cap": "Small Cap"
    },
    "QCCU.V": {
        "short_name": "QC COPPER AND GOLD INC",
        "long_name": "QC Copper and Gold Inc.",
        "summary": "QC Copper and Gold Inc. owns a diversified portfolio of battery metal and electric vehicle metal assets in Canada. The company primarily explores for copper, gold, and uranium deposits. It holds 100% interests in the Opemiska copper mine complex covering an area of 12,782 hectares located in the Chibougamau region of Quebec; and the Shadow and Hook properties situated in the Athabasca Basin area of northern Saskatchewan. The company also holds an interest in the Scott property located in Scott and Levy townships, Chibougamau region of Quebec. In addition, it has an option to acquire an interest in the Cooke- Robitaille property that consists of 175 claims covering an area of 9,064 hectares situated in Chapais, Quebec; and a 50% interest in the Roger gold-copper project located in the Chibougamau District of Quebec. The company was formerly known as PowerOre Inc. and changed its name to QC Copper and Gold Inc. in September 2020. QC Copper and Gold Inc. was incorporated in 2018 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2H7",
        "website": "http://qccopper.com",
        "market_cap": "Small Cap"
    },
    "QCCUF": {
        "short_name": "QC COPPER AND GOLD INC",
        "long_name": "QC Copper and Gold Inc.",
        "summary": "QC Copper and Gold Inc. owns a diversified portfolio of battery metal and electric vehicle metal assets in Canada. The company primarily explores for copper, gold, and uranium deposits. It holds 100% interests in the Opemiska copper mine complex covering an area of 12,782 hectares located in the Chibougamau region of Quebec; and the Shadow and Hook properties situated in the Athabasca Basin area of northern Saskatchewan. The company also holds an interest in the Scott property located in Scott and Levy townships, Chibougamau region of Quebec. In addition, it has an option to acquire an interest in the Cooke- Robitaille property that consists of 175 claims covering an area of 9,064 hectares situated in Chapais, Quebec; and a 50% interest in the Roger gold-copper project located in the Chibougamau District of Quebec. The company was formerly known as PowerOre Inc. and changed its name to QC Copper and Gold Inc. in September 2020. QC Copper and Gold Inc. was incorporated in 2018 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2H7",
        "website": "http://qccopper.com",
        "market_cap": "Small Cap"
    },
    "RCLF.CN": {
        "short_name": "RockcliffMtls",
        "long_name": "Rockcliff Metals Corporation",
        "summary": "Rockcliff Metals Corporation operates as a resource development and exploration company and near-term copper-zinc producer in Canada. It holds interests in various advance stage, copper and zinc dominant volcanogenic massive sulphide deposits in the Snow Lake area of Manitoba. The company holds a 51% interest in its flagship project, the Talbot Property. It also holds a 100% interest in Tower Property covering an area of approximately 9,530 hectares; and 100% interest in the Rail Property. The company is a principal landholder in the Flin Flon-Snow Lake greenstone belt, which is home to the Paleoproterozoic VMS district, hosting mines and deposits containing copper, zinc, gold, and silver. It holds an extensive portfolio of properties that totals approximately 4,500 square kilometers and include eight undeveloped VMS deposits, and five lode-gold properties held through its subsidiary, Goldpath Resources Corp., including the historic Rex-Laguna gold mine. The company was formerly known as Rockcliff Copper Corporation and changed its name to Rockcliff Metals Corporation in November 2017. Rockcliff Metals Corporation was founded in 2005 and is headquartered in Sudbury, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Sudbury",
        "zipcode": "P3E 5H3",
        "website": "http://rockcliffmetals.com",
        "market_cap": "Small Cap"
    },
    "RCP.AX": {
        "short_name": "REDBANK FPO",
        "long_name": "Redbank Copper Limited",
        "summary": "Redbank Copper Limited engages in the exploration, development, and evaluation of copper resources in Australia. It focuses on the development of the Redbank copper project located in the northeast of the Northern Territory in Australia; and the Millers Creek Project situated in the Gawler Craton of South Australia. The company was formerly known as Redbank Mines Limited and changed its name to Redbank Copper Limited in 2009. Redbank Copper Limited was founded in 1993 and is based in Subiaco, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Subiaco",
        "zipcode": "6008",
        "website": "http://www.redbankcopper.com.au",
        "market_cap": "Small Cap"
    },
    "RDS.AX": {
        "short_name": "REDSTONE FPO",
        "long_name": "Redstone Resources Limited",
        "summary": "Redstone Resources Limited explores for mineral properties in Australia. The company explores for copper and gold deposits. It holds a 100% interest in the Tollu project located in the southeast portion of the West Musgrave region of Western Australia. The company also holds an 80% interest in the Hantails Gold project situated in the Kalgoorlie-Boulder, Western Australia. Redstone Resources Limited was incorporated in 1999 and is based in West Perth, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "West Perth",
        "zipcode": "6005",
        "website": "http://www.redstone.com.au",
        "market_cap": "Small Cap"
    },
    "RE8.F": {
        "short_name": "AMERIGO RESOURCES LTD",
        "long_name": "Amerigo Resources Ltd.",
        "summary": "Amerigo Resources Ltd., through its subsidiary, Minera Valle Central S.A., produces and sells copper and molybdenum concentrates from Codelco's El Teniente underground mine in Chile. The company was formerly known as Golden Temple Mining Corp. and changed its name to Amerigo Resources Ltd. in March 2002. Amerigo Resources Ltd. was incorporated in 1984 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2G8",
        "website": "http://www.amerigoresources.com",
        "market_cap": "Small Cap"
    },
    "RKCLF": {
        "short_name": "ROCKCLIFF METALS CORPORATION",
        "long_name": "Rockcliff Metals Corporation",
        "summary": "Rockcliff Metals Corporation operates as a resource development and exploration company and near-term copper-zinc producer in Canada. It holds interests in various advance stage, copper and zinc dominant volcanogenic massive sulphide deposits in the Snow Lake area of Manitoba. The company holds a 51% interest in its flagship project, the Talbot Property. It also holds a 100% interest in Tower Property covering an area of approximately 9,530 hectares; and 100% interest in the Rail Property. The company is a principal landholder in the Flin Flon-Snow Lake greenstone belt, which is home to the Paleoproterozoic VMS district, hosting mines and deposits containing copper, zinc, gold, and silver. It holds an extensive portfolio of properties that totals approximately 4,500 square kilometers and include eight undeveloped VMS deposits, and five lode-gold properties held through its subsidiary, Goldpath Resources Corp., including the historic Rex-Laguna gold mine. The company was formerly known as Rockcliff Copper Corporation and changed its name to Rockcliff Metals Corporation in November 2017. Rockcliff Metals Corporation was founded in 2005 and is headquartered in Sudbury, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Sudbury",
        "zipcode": "P3E 5H3",
        "website": "http://rockcliffmetals.com",
        "market_cap": "Small Cap"
    },
    "RO0A.F": {
        "short_name": "ROCKCLIFF METALS CORP.",
        "long_name": "Rockcliff Metals Corporation",
        "summary": "Rockcliff Metals Corporation operates as a resource development and exploration company and near-term copper-zinc producer in Canada. It holds interests in various advance stage, copper and zinc dominant volcanogenic massive sulphide deposits in the Snow Lake area of Manitoba. The company holds a 51% interest in its flagship project, the Talbot Property. It also holds a 100% interest in Tower Property covering an area of approximately 9,530 hectares; and 100% interest in the Rail Property. The company is a principal landholder in the Flin Flon-Snow Lake greenstone belt, which is home to the Paleoproterozoic VMS district, hosting mines and deposits containing copper, zinc, gold, and silver. It holds an extensive portfolio of properties that totals approximately 4,500 square kilometers and include eight undeveloped VMS deposits, and five lode-gold properties held through its subsidiary, Goldpath Resources Corp., including the historic Rex-Laguna gold mine. The company was formerly known as Rockcliff Copper Corporation and changed its name to Rockcliff Metals Corporation in November 2017. Rockcliff Metals Corporation was founded in 2005 and is headquartered in Sudbury, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Sudbury",
        "zipcode": "P3E 5H3",
        "website": "http://rockcliffmetals.com",
        "market_cap": "Small Cap"
    },
    "RO0A.SG": {
        "short_name": "Rockcliff Metals Corp. Register",
        "long_name": "Rockcliff Metals Corporation",
        "summary": "Rockcliff Metals Corporation operates as a resource development and exploration company and near-term copper-zinc producer in Canada. It holds interests in various advance stage, copper and zinc dominant volcanogenic massive sulphide deposits in the Snow Lake area of Manitoba. The company holds a 51% interest in its flagship project, the Talbot Property. It also holds a 100% interest in Tower Property covering an area of approximately 9,530 hectares; and 100% interest in the Rail Property. The company is a principal landholder in the Flin Flon-Snow Lake greenstone belt, which is home to the Paleoproterozoic VMS district, hosting mines and deposits containing copper, zinc, gold, and silver. It holds an extensive portfolio of properties that totals approximately 4,500 square kilometers and include eight undeveloped VMS deposits, and five lode-gold properties held through its subsidiary, Goldpath Resources Corp., including the historic Rex-Laguna gold mine. The company was formerly known as Rockcliff Copper Corporation and changed its name to Rockcliff Metals Corporation in November 2017. Rockcliff Metals Corporation was founded in 2005 and is headquartered in Sudbury, Canada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Sudbury",
        "zipcode": "P3E 5H3",
        "website": "http://rockcliffmetals.com",
        "market_cap": "Small Cap"
    },
    "S2Z.F": {
        "short_name": "SANDFIRE RESOURCES LTD.",
        "long_name": "Sandfire Resources Limited",
        "summary": "Sandfire Resources Limited explores for, evaluates, and develops mineral tenements and projects in Australia and internationally. It primarily explores for copper, gold, and silver, as well as volcanogenic massive sulphide deposits. The company owns 100% interest in the DeGrussa copper-gold mine located in the Bryah Basin mineral province of Western Australia; and 85% interest in the Black Butte copper project located in central Montana, the United States. It also holds interest in the Tshukudu Project located in Botswana and Namibia within the Kalahari Copper Belt. Sandfire Resources Limited was incorporated in 2003 and is based in West Perth, Australia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "WA",
        "city": "West Perth",
        "zipcode": "6005",
        "website": "http://www.sandfire.com.au",
        "market_cap": "Small Cap"
    },
    "SAGARDEEP.NS": {
        "short_name": "SAGARDEEP ALLOYS L",
        "long_name": "Sagardeep Alloys Limited",
        "summary": "Sagardeep Alloys Limited manufactures and sells basic precious and non-ferrous alloys in India. The company supplies copper pipes and tubes, flats, coils, rods, anodes/nuggets, and plates, as well as oxygen free copper; red, yellow, cartridge, and low brass; gilding metals, commercial bronzes, and muntz metals; cupro nickel tubes, pipes, and rods; and stainless steel scrap grades, pipes, tubes, sheets/plates, coils, and bars. It is also involved in the wholesale of metals and metal ores. The company also exports its products to the United States, the United Kingdom, Korea, etc. Sagardeep Alloys Limited was founded in 1972 and is based in Gandhinagar, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gandhinagar",
        "zipcode": "382721",
        "website": "http://www.sdalloys.com",
        "market_cap": "Small Cap"
    },
    "SARKY.IS": {
        "short_name": "SARKUYSAN",
        "long_name": "Sarkuysan Elektrolitik Bakir Sanayi ve Ticaret A.S.",
        "summary": "Sarkuysan Elektrolitik Bakir Sanayi ve Ticaret A.S., together with its subsidiaries, produces and trades in electrolytic copper wire, copper, and copper alloys in Turkey. It offers electrolytic copper cathode products; oxygen free and ETP wire rods; DHP and ETP copper billets; bare, tin plated, and nickel plated copper single wires; bare and tin plated, and nickel plated multi wires, as well as bare and tin plated multi wires on braider bobbins; and bare, tin plated, and nickel plated bunched conductors. The company also provides flat wires and profiles, and PV ribbon wires; copper and copper alloy contact wires, and stranded copper and copper alloy conductors; copper tubes and busbars; and copper nuggets. In addition, it manufactures, imports, and exports steel spool packaging materials and machineries; and offers marketing and distribution services, as well as rents properties. The company's products are used in various industries, including electro technique, electronic, motor, communication, power generation and distribution, solar and renewable energy, home appliances, measurement instruments, defense, automotive, chemical, construction, heating, air-conditioning, and sanitary plumbing. It also exports its products to approximately 70 countries worldwide. The company was founded in 1972 and is headquartered in Darica, Turkey.",
        "currency": "TRY",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Darica",
        "zipcode": "41700",
        "website": "http://www.sarkuysan.com",
        "market_cap": "Small Cap"
    },
    "SCCO.MX": {
        "short_name": "SOUTHERN COPPER CORPORATION",
        "long_name": "Southern Copper Corporation",
        "summary": "Southern Copper Corporation engages in mining, exploring, smelting, and refining copper and other minerals in Peru, Mexico, Argentina, Ecuador, and Chile. The company is involved in the mining, milling, and flotation of copper ore to produce copper and molybdenum concentrates; smelting of copper concentrates to produce blister and anode copper; refining of anode copper to produce copper cathodes; production of molybdenum concentrate and sulfuric acid; production of refined silver, gold, and other materials; and mining and processing of zinc and lead. It operates the Toquepala and Cuajone open-pit mines, and a smelter and refinery in Peru; and La Caridad, an open-pit copper mine, as well as a copper ore concentrator, a SX-EW plant, a smelter, refinery, and a rod plant in Mexico. The company also operates Buenavista, an open-pit copper mine, as well as two copper concentrators and two operating SX-EW plants in Mexico. In addition, it operates five underground mines that produce zinc, lead, copper, silver, and gold; a coal mine that produces coal and coke; and a zinc refinery. The company has interests in 59,252 hectares of exploration concessions in Peru; 503,104 hectares of exploration concessions in Mexico; 229,312 hectares of exploration concessions in Argentina; 27,353 hectares of exploration concessions in Chile; and 7,299 hectares of exploration concessions in Ecuador. Southern Copper Corporation was incorporated in 1952 and is based in Phoenix, Arizona. Southern Copper Corporation is a subsidiary of Americas Mining Corporation.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85014",
        "website": "http://www.southerncoppercorp.com",
        "market_cap": "Large Cap"
    },
    "SCCO": {
        "short_name": "Southern Copper Corporation",
        "long_name": "Southern Copper Corporation",
        "summary": "Southern Copper Corporation engages in mining, exploring, smelting, and refining copper and other minerals in Peru, Mexico, Argentina, Ecuador, and Chile. The company is involved in the mining, milling, and flotation of copper ore to produce copper and molybdenum concentrates; smelting of copper concentrates to produce blister and anode copper; refining of anode copper to produce copper cathodes; production of molybdenum concentrate and sulfuric acid; production of refined silver, gold, and other materials; and mining and processing of zinc and lead. It operates the Toquepala and Cuajone open-pit mines, and a smelter and refinery in Peru; and La Caridad, an open-pit copper mine, as well as a copper ore concentrator, a SX-EW plant, a smelter, refinery, and a rod plant in Mexico. The company also operates Buenavista, an open-pit copper mine, as well as two copper concentrators and two operating SX-EW plants in Mexico. In addition, it operates five underground mines that produce zinc, lead, copper, silver, and gold; a coal mine that produces coal and coke; and a zinc refinery. The company has interests in 59,252 hectares of exploration concessions in Peru; 503,104 hectares of exploration concessions in Mexico; 229,312 hectares of exploration concessions in Argentina; 27,353 hectares of exploration concessions in Chile; and 7,299 hectares of exploration concessions in Ecuador. Southern Copper Corporation was incorporated in 1952 and is based in Phoenix, Arizona. Southern Copper Corporation is a subsidiary of Americas Mining Corporation.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85014",
        "website": "http://www.southerncoppercorp.com",
        "market_cap": "Large Cap"
    },
    "SFR.AX": {
        "short_name": "SANDFIRE FPO",
        "long_name": "Sandfire Resources Limited",
        "summary": "Sandfire Resources Limited explores for, evaluates, and develops mineral tenements and projects in Australia and internationally. It primarily explores for copper, gold, and silver, as well as volcanogenic massive sulphide deposits. The company owns 100% interest in the DeGrussa copper-gold mine located in the Bryah Basin mineral province of Western Australia; and 85% interest in the Black Butte copper project located in central Montana, the United States. It also holds interest in the Tshukudu Project located in Botswana and Namibia within the Kalahari Copper Belt. Sandfire Resources Limited was incorporated in 2003 and is based in West Perth, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "West Perth",
        "zipcode": "6005",
        "website": "http://www.sandfire.com.au",
        "market_cap": "Small Cap"
    },
    "SFRRF": {
        "short_name": "SANDFIRE RESOURCES LTD",
        "long_name": "Sandfire Resources Limited",
        "summary": "Sandfire Resources Limited explores for, evaluates, and develops mineral tenements and projects in Australia and internationally. It primarily explores for copper, gold, and silver, as well as volcanogenic massive sulphide deposits. The company owns 100% interest in the DeGrussa copper-gold mine located in the Bryah Basin mineral province of Western Australia; and 85% interest in the Black Butte copper project located in central Montana, the United States. It also holds interest in the Tshukudu Project located in Botswana and Namibia within the Kalahari Copper Belt. Sandfire Resources Limited was incorporated in 2003 and is based in West Perth, Australia.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "WA",
        "city": "West Perth",
        "zipcode": "6005",
        "website": "http://www.sandfire.com.au",
        "market_cap": "Small Cap"
    },
    "SRHIF": {
        "short_name": "SRHI INC",
        "long_name": "SRHI Inc.",
        "summary": "SRHI Inc. invests in mining and agriculture sectors. The company operates through the Minera Tres Valles SpA and Corporate segments. Its principal asset is its 70% owned Minera Tres Valles copper mine located in Salamanca, Chile. It also engages in the organic protein production and retail; and holds interests in the Lac Otelnuk iron ore project located in Nunavik, Canada. The company was formerly known as Sprott Resource Holdings Inc. and changed its name to SRHI Inc. in June 2020. SRHI Inc. is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2J1",
        "website": "http://www.srhi.ca",
        "market_cap": "Small Cap"
    },
    "TAR.AX": {
        "short_name": "TARUGAMIN FPO",
        "long_name": "Taruga Minerals Limited",
        "summary": "Taruga Minerals Limited explores for mineral properties in Australia. It primarily explores for gold, copper, silver, lithium, and base metal deposits. The company holds a 100% interest in the Yagahong North project located in the Murchison region of Western Australia. It also holds an option to acquire a 100% interest in the Torrens iron-oxide-copper-gold project situated in the Gawler Craton, South Australia; and the Flinders project, which covers an area of approximately 647 square kilometers located in the north of Port Augusta, South Australia. The company was formerly known as Taruga Gold Limited and changed its name to Taruga Minerals Limited in June 2018. Taruga Minerals Limited was incorporated in 2011 and is based in Perth, Australia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6000",
        "website": "http://www.tarugaminerals.com.au",
        "market_cap": "Small Cap"
    },
    "TFTB.F": {
        "short_name": "CN DAYE NON-FE.M.M.HD-,05",
        "long_name": "China Daye Non-Ferrous Metals Mining Limited",
        "summary": "China Daye Non-Ferrous Metals Mining Limited, an investment holding company, engages in the exploration, development, mining, and processing of mineral ores in the People's Republic of China, Hong Kong, and the Republic of Mongolia. It explores for copper, gold, silver, iron, and molybdenum deposits. The company holds interests in the Tonglvshan and Tongshankou mines located in Daye City; Fengshan and Chimashan mines located in Yangxin County; and Sareke copper mine located in Wuqia County. It is also involved in the trading of metals, minerals, and concentrates; quality testing of construction projects; and provision of research and development services. The company is headquartered in Kowloon, Hong Kong. China Daye Non-Ferrous Metals Mining Limited is a subsidiary of China Times Development Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.hk661.com",
        "market_cap": "Small Cap"
    },
    "TRQ": {
        "short_name": "Turquoise Hill Resources Ltd.",
        "long_name": "Turquoise Hill Resources Ltd.",
        "summary": "Turquoise Hill Resources Ltd., together with its subsidiaries, operates as a mining company. The company explores for copper, gold, and silver deposits. It develops and operates the Oyu Tolgoi copper-gold mine located in Southern Mongolia. The company was formerly known as Ivanhoe Mines Ltd. and changed its name to Turquoise Hill Resources Ltd. in August 2012. Turquoise Hill Resources Ltd. was incorporated in 1994 and is headquartered in Montreal, Canada. Turquoise Hill Resources Ltd. is a subsidiary of Rio Tinto plc.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3B 3P2",
        "website": "http://www.turquoisehill.com",
        "market_cap": "Mid Cap"
    },
    "TRQ.TO": {
        "short_name": "TURQUOISE HILL RESOURCES LTD",
        "long_name": "Turquoise Hill Resources Ltd.",
        "summary": "Turquoise Hill Resources Ltd., together with its subsidiaries, operates as a mining company. The company explores for copper, gold, and silver deposits. It develops and operates the Oyu Tolgoi copper-gold mine located in Southern Mongolia. The company was formerly known as Ivanhoe Mines Ltd. and changed its name to Turquoise Hill Resources Ltd. in August 2012. Turquoise Hill Resources Ltd. was incorporated in 1994 and is headquartered in Montreal, Canada. Turquoise Hill Resources Ltd. is a subsidiary of Rio Tinto plc.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3B 3P2",
        "website": "http://www.turquoisehill.com",
        "market_cap": "Mid Cap"
    },
    "USCU.V": {
        "short_name": "US COPPER CORP",
        "long_name": "US Copper Corp.",
        "summary": "US Copper Corp., an exploration stage company, engages in the exploration and evaluation of mineral properties in Canada and the United States. The company explores for copper, nickel, gold, and silver deposits. It has 100% interests in the Moonlight-Superior copper project located in the Plumas County, California; and the Black Warrior project that include 2 patented claims located in the Esmeralda County, Nevada. The company also holds 100% interests in the Timore project located in Ontario; and the Warren Whiteside project that include 14 patented mining claims located in Whiteside Township in Ontario. It also has interests in exploration properties in Nevada and California. The company was formerly known as Crown Mining Corp. and changed its name to US Copper Corp. in April 2021. US Copper Corp. is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5V OR2",
        "website": "http://crownminingcorp.com",
        "market_cap": "Small Cap"
    },
    "USCUF": {
        "short_name": "US COPPER CORP",
        "long_name": "US Copper Corp.",
        "summary": "US Copper Corp., an exploration stage company, engages in the exploration and evaluation of mineral properties in Canada and the United States. The company explores for copper, nickel, gold, and silver deposits. It has 100% interests in the Moonlight-Superior copper project located in the Plumas County, California; and the Black Warrior project that include 2 patented claims located in the Esmeralda County, Nevada. The company also holds 100% interests in the Timore project located in Ontario; and the Warren Whiteside project that include 14 patented mining claims located in Whiteside Township in Ontario. It also has interests in exploration properties in Nevada and California. The company was formerly known as Crown Mining Corp. and changed its name to US Copper Corp. in April 2021. US Copper Corp. is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5V OR2",
        "website": "http://crownminingcorp.com",
        "market_cap": "Small Cap"
    },
    "WCU.V": {
        "short_name": "WORLD COPPER LTD",
        "long_name": "World Copper Ltd.",
        "summary": "Wealth Copper Ltd. engages in copper mining operations. The company is based in British Columbia, Canada. Wealth Copper Ltd. operates as a subsidiary of Wealth Minerals Ltd.",
        "currency": "CAD",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1S4",
        "website": "http://www.worldcopperltd.com",
        "market_cap": "Small Cap"
    },
    "ZYT.F": {
        "short_name": "NEVADA COPPER CORP.",
        "long_name": "Nevada Copper Corp.",
        "summary": "Nevada Copper Corp. engages in the exploration, development, and operation of mineral properties in Nevada. The company explores for copper, gold, and silver ores. Its holds 100% interests in the Pumpkin Hollow property located in Nevada, the United States. Nevada Copper Corp. is based in Reno, Nevada.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Copper",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NV",
        "city": "Reno",
        "zipcode": "89501",
        "website": "http://www.nevadacopper.com",
        "market_cap": "Small Cap"
    }
}