{
    "INTET.AT": {
        "short_name": "INTERTECH S.A. INTER TECH",
        "long_name": "Intertech S.A. Inter. Technologies",
        "summary": "Intertech S.A. Inter. Technologies distributes technology products in Greece. It operates as a distributor of various brands, such as Panasonic, iLuv, Ricoh, Gestetner, and Satellite. The company was founded in 1988 and is based in Elliniko, Greece. Intertech S.A. Inter. Technologies was formerly a subsidiary of Demco Group.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Diversified Electronics",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Elliniko",
        "zipcode": "16777",
        "website": "http://www.intertech.gr",
        "market_cap": 4571912
    },
    "LEBEK.AT": {
        "short_name": "N. Levederis (C)",
        "long_name": "N. Leventeris S.A.",
        "summary": "N. Leventeris S.A. manufactures and sells wires and wire ropes in Greece. The company offers steel wires, steel wire ropes, combination ropes, fiber and mooring ropes, wire rope slings, chains, anchors, fiber slings, crosby products, and agricultural wire ropes, as well as accessories comprising hooks, turnbuckles, shackles, and wire rope thimbles. It also provides mooring, synthetic, and natural fiber ropes. N. Leventeris S.A. was founded in 1948 and is headquartered in Piraeus, Greece.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Diversified Electronics",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Piraeus",
        "zipcode": "18545",
        "website": "http://www.leventeris.gr",
        "market_cap": 4515854
    },
    "LEBEP.AT": {
        "short_name": "N. Levederis (P)",
        "long_name": "N. Leventeris S.A.",
        "summary": "N. Leventeris S.A. manufactures and sells wires and wire ropes in Greece. The company offers steel wires, steel wire ropes, combination ropes, fiber and mooring ropes, wire rope slings, chains, anchors, fiber slings, crosby products, and agricultural wire ropes, as well as accessories comprising hooks, turnbuckles, shackles, and wire rope thimbles. It also provides mooring, synthetic, and natural fiber ropes. N. Leventeris S.A. was founded in 1948 and is headquartered in Piraeus, Greece.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Diversified Electronics",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Piraeus",
        "zipcode": "18545",
        "website": "http://www.leventeris.gr",
        "market_cap": 1486940
    },
    "MITSN.MX": {
        "short_name": "MITSUBISHI ELECTRIC CORP",
        "long_name": "Mitsubishi Electric Corporation",
        "summary": "Mitsubishi Electric Corporation develops, manufactures, distributes, and sells electrical and electronic equipment worldwide. The company offers turbine generators, hydraulic turbine generators, nuclear power plant and power electronics equipment, motors, transformers, circuit breakers, gas insulated switchgears, switch controls, display devices, surveillance-system control and security systems, transmission and distribution ICT systems, large display devices, locomotive and rolling stock electrical equipment, elevators, escalators, building security and management systems, and others. It also provides programmable logic controllers, inverters, servomotors, human-machine interfaces, hoists, magnetic switches, circuit breakers, time and power meters, uninterruptible power supply, industrial fans, computerized numerical controllers, electrical-discharge and laser processing machines, industrial robots, clutches, automotive electrical equipment, car electronics and mechatronics, car multimedia, and others. In addition, the company offers wireless and wired communications systems, network camera systems, satellite communications and radar equipment, satellites, antennas, missile and fire control systems, broadcasting and information systems equipment, data transmission devices, network security systems, systems integration products, and others; and power modules, high-frequency devices, optical and LCD devices, and others. Further, it provides air conditioners, chillers, showcases, compressors, refrigeration units, air-to-water heat pump boilers, ventilators, hot water supply systems, IH cooking heaters, LED lamps, indoor lighting, LCD televisions, refrigerators, electric fans, dehumidifiers, air purifiers, cleaners, jar rice cookers, microwave ovens, and others. Additionally, the company offers procurement, logistics, real estate, advertising, finance, and other services. Mitsubishi Electric Corporation was founded in 1921 and is headquartered in Tokyo, Japan.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Diversified Electronics",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8310",
        "website": "http://www.mitsubishielectric.com",
        "market_cap": 736626278400
    },
    "MRNNV.PA": {
        "short_name": "MERSEN NV21",
        "long_name": "Mersen SA",
        "summary": "Mersen SA manufactures and sells electrical power products and advanced materials in France, North America, rest of Europe, the Asia-Pacific, and internationally. It operates through Advanced Materials and Electrical Power segments. The company offers electrical protection and control products, such as IEC and UL/CSA low voltage general purpose fuses and fuse gears, high and medium voltage fuses, and power transfer solutions for rail vehicles, as well as surge protection, lightning protection, and power monitoring solutions; and power management solutions, including high speed fuses, DC protection for electric vehicles and battery, cooling solutions, bus bars, and aluminum electrolytic and film capacitors. It also provides anticorrosion equipment comprising heat exchangers; columns, reactors, and pressure vessels; PTFE, PFA, and FRP lined piping and fitting; graphite bursting discs; corrosion resistant materials; and after-sales and maintenance services, as well as graphite specialties, such as isostatic and extruded graphite, carbon insulation, carbon/carbon composites, silicon carbide, and flexible graphite. In addition, the company offers carbon brushes, brush-holders, brush-rockers and brush gear housings, slip ring assemblies, signal and power transmission systems, current collectors, wheel flange lubrication solutions, carbon dust collection systems, and monitoring solutions. The company serves energy, electronics, transportation/EV, corrosive chemicals, and process industries, as well as other markets comprising building, elevator, defense, HVAC, and outdoor LED lighting markets. The company was formerly known as Groupe Carbone Lorraine SA and changed its name to Mersen SA in 2010. Mersen SA was founded in 1889 and is headquartered in Paris, France.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Diversified Electronics",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "92066",
        "website": "http://www.mersen.com",
        "market_cap": null
    },
    "NEXS": {
        "short_name": "NEXUS BIOPHARMA INC",
        "long_name": "Nexus BioPharma, Inc.",
        "summary": "Nexus BioPharma, Inc., a life science company, focuses on the development and commercialization of a pharmaceutical preparation to treat obesity and the symptoms of type 2 diabetes. The company is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Diversified Electronics",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77021-2040",
        "website": "http://www.nexusbiopharma.com",
        "market_cap": 292836
    },
    "OMRNN.MX": {
        "short_name": "OMRON CORP",
        "long_name": "OMRON Corporation",
        "summary": "OMRON Corporation engages in industrial automation, electronic and mechanical components, social systems, and healthcare businesses worldwide. The company's Industrial Automation Business offers sensors, switches, safety and control components, relays, automation systems, motion/drives, robotics, energy conservation support/environment measure equipment, and power supplies. Its Electronic and Mechanical Components Business provides relays, switches, connectors, sensors, and components/units for amusement equipment. The company's Social Systems, Solutions and Service Business offers terminals and systems, including PV inverters and storage batteries; railway station systems, such as automated ticket gates and ticket vending machines, traffic and road management systems, payment systems, and UPS that protect equipment from unexpected power disruption; and transport management systems and infrastructure monitoring systems, as wells provides a range of solutions comprising software development and maintenance services to support the social infrastructure. Its Healthcare Business offers blood pressure monitors, nebulizers, electrotherapy TENS devices, digital thermometers, body composition monitors, and other products, such as activity monitors, AEDs, etc. The company was formerly known as OMRON Tateisi Electronics Co. and changed its name to OMRON Corporation in January 1990. OMRON Corporation was founded in 1933 and is headquartered in Kyoto, Japan.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Diversified Electronics",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "600-8530",
        "website": "http://www.omron.com",
        "market_cap": 300878397440
    },
    "OPTRON.AT": {
        "short_name": "OPTRONICS TECHNOLOGIES S.A",
        "long_name": "Optronics Technologies S.A.",
        "summary": "Optronics Technologies S.A. provides services in the fiber optics, optoelectronics, and laser applications markets in Greece. It provides fiber-net products, such as fiber optic cables, patch panels, patchcord-pigtails, adaptors-connectors, racks, cable raceways parts, joint closures, and WDMs-splitters; and FTTH products, including cables, cabinets, distribution boxes, outlets, and splitter panels. The company also offers cabling products consisting of copper cables, outlets-faceplates, patch panels, and jacks-patchcords; network products, such as converters and switches, as well as industrial, fiber optic, CDWM-DWDM, and live fiber monitoring products; and surveillance products, including analog and IP cameras, and DVRs-NVRs. In addition, it provides tools and instruments comprising strippers, cleavers, polishers, fault locators, and blowing machines; splicers; measuring instruments consisting of OTDRs, mini OTDRs, power meter-light sources, and cable testers; labelling solutions that include handheld and desktop printers, and label types and materials; video over fiber products that comprise converters, transmitters, receivers, and amplifiers; and scientific instruments comprising lasers, optics, laser safety, spectrometers, laser meters, and microscopes. Further, the company offers network studies and design, FTTH design, turn-key telecom network, fiber optic network installation, IT integration and control networks, technical support and maintenance, projects and installations, and communication services development services. It serves telecommunication and fiber optic cable manufacturers, PTTs, alternative carriers, universities, institutes, OEM manufacturers, contractors, private companies, and other optoelectronics users. The company was founded in 1990 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Diversified Electronics",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "183 46",
        "website": "http://www.optronics.gr",
        "market_cap": 7867059
    },
    "YASKYN.MX": {
        "short_name": "YASKAWA ELECTRIC CORP",
        "long_name": "YASKAWA Electric Corporation",
        "summary": "YASKAWA Electric Corporation engages in motion control, robotics, system engineering, and other businesses worldwide. It manufactures and sells various AC drives, including general purpose AC drives, medium-voltage AC drives, system-use AC drives, and power regenerative units for use in cranes, fans, pumps, machine tools, conveyors, automated warehouses, and metal working machinery; and rotary servo motors, direct drive servo motors, linear servo motors, machine controllers, and machine vision systems that are used in chip mounters, robots, and metal working machinery. The company also offers arc and spot welding, handling/assembling, collaborative, biomedical, palletizing, press handling, sealing/cutting/laser machining, deburring, painting, glass substrates transfer, and semiconductor wafer transfer robots for use in semiconductor/liquid crystal manufacturing, arc welding, spot welding, palletizing, painting, and handling and assembly applications. In addition, it provides industrial system electrical products, such as medium-voltage AC drives, system use AC drives, and system controllers for use in iron and steel systems, water and wastewater treatment, and paper-making/film/port cargo handling/fiber/printing applications. Further, the company offers equipment for energy saving and creation comprising PV inverters, systems for large wind turbines, control equipment for small-scale power generation, and motor drive systems for use in photovoltaic power generation and electric vehicles. YASKAWA Electric Corporation was founded in 1915 and is headquartered in Kitakyushu, Japan.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Diversified Electronics",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "state": null,
        "city": "Kitakyushu",
        "zipcode": "806-0004",
        "website": "http://www.yaskawa.co.jp",
        "market_cap": 227150069760
    }
}