{
    "BC94.L": {
        "short_name": "SAMSUNG ELECTRONICS CO LTD (ATT",
        "long_name": "Samsung Electronics Co., Ltd.",
        "summary": "Samsung Electronics Co., Ltd. engages in the consumer electronics, information technology and mobile communications, and device solutions businesses worldwide. It offers digital TVs, monitors, air conditioners, refrigerators, mobile phones, communication systems, and computers; semiconductor products, such as memory, foundry, and system LSI; and display products comprising LCD and OLED panels, as well as connected car systems, audio and visual products, enterprise automation solutions, and connected services. The company is also involved in the technology and venture capital investment businesses; manufacture of semiconductor equipment and components; and provision of repair services for electronic devices. In addition, it provides medical equipment; software development and supply; toll processing of semiconductors and display panels; general logistics agency, financing, marketing, consulting, and AI technology and cloud services; enterprise automation solutions and connected services; and digital advertising platforms. Further, the company offers mobile payment services; and designs and develops software products. It serves retail, hospitality, finance, transportation, education, government, and healthcare industries. Samsung Electronics Co., Ltd. was founded in 1938 and is based in Suwon, South Korea.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Electronic Equipment",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "South Korea",
        "state": null,
        "city": "Suwon-si",
        "zipcode": "443-742",
        "website": "http://www.samsung.com",
        "market_cap": "Large Cap"
    },
    "GPRO.MX": {
        "short_name": "GOPRO INC.",
        "long_name": "GoPro, Inc.",
        "summary": "GoPro, Inc. develops and sells cameras, drones, and mountable and wearable accessories in the United States and internationally. The company offers cloud connected HERO7 Silver, HERO7 Black, HERO8 Black, and HERO9 Black waterproof cameras; MAX, a 360-degree waterproof camera; GoPro, a subscription service that offers cloud-based storage solutions and enables subscribers to access, edit, and share content, as well camera protection plans; Quik, a video editing application; and GoPro App, a mobile app that allows users to share and edit their photos and videos. It also offers mounts and accessories comprising equipment-based mounts consisting of helmet, handlebar, roll bar, and tripod mounts that enable consumers to wear the mount on their bodies, such as wrist housings, magnetic swivel clips, chest harnesses, and head straps; media, display, and light mods; spare batteries, dive filters, and charging accessories and cables; and lifestyle gears. In addition, the company provides mobile, desktop, and web applications that provides media workflow for archiving, editing, multi-clip story creation, and sharing content on the fly. GoPro, Inc. markets and sells its products through retailers and distributors, as well as through its website. The company was formerly known as Woodman Labs, Inc. and changed its name to GoPro, Inc. in February 2014. GoPro, Inc. was founded in 2002 and is headquartered in San Mateo, California.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Electronic Equipment",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "San Mateo",
        "zipcode": "94402",
        "website": "http://www.gopro.com",
        "market_cap": "Large Cap"
    },
    "PHIA.DE": {
        "short_name": "KONINKL. PHILIPS ADR -,20",
        "long_name": "Koninklijke Philips N.V.",
        "summary": "Koninklijke Philips N.V. operates as a health technology company in North America, Greater China, and internationally. It operates through Diagnosis & Treatment, Connected Care, and Personal Health segments. It provides magnetic resonance imaging, computed tomography, advanced molecular imaging, diagnostic X-ray, and imaging components as well as integrated clinical solutions; integrated interventional systems, including interventional diagnostic and therapeutic devices; imaging products focused on diagnosis, treatment planning and guidance for cardiology, general imaging, obstetrics/gynecology, and point-of-care applications; proprietary software to enable diagnostics and intervention; and enterprise diagnostic informatics products and services. The company also offers monitoring and analytics solutions; sleep and respiratory care solutions; emergency care and resuscitation, and patient management solutions; data, analytics, and actionable workflow solutions; and connected care informatics solutions. In addition, it provides power toothbrushes, brush heads, and interdental cleaning and teeth whitening products; infant feeding and digital parental solutions; male grooming and beauty products and solutions; and kitchen appliances, home care, and garment care products, as well as coffee machines. Koninklijke Philips N.V. has a partnership with openDoctor to deliver an integrated radiology patient engagement platform that leverages openDoctor's real-time online appointment scheduling services as part of its patient management solution; and a strategic collaboration with Ibex Medical Analytics Ltd. to jointly promote the digital pathology and AI solutions to hospitals, health networks, and pathology laboratories worldwide. The company was formerly known as Koninklijke Philips Electronics N.V. and changed its name to Koninklijke Philips N.V. in May 2013. Koninklijke Philips N.V. was founded in 1891 and is headquartered in Amsterdam, the Netherlands.",
        "currency": "EUR",
        "sector": "Consumer Goods",
        "industry": "Electronic Equipment",
        "exchange": "GER",
        "market": "de_market",
        "country": "Netherlands",
        "state": null,
        "city": "Amsterdam",
        "zipcode": "1096 BC",
        "website": "http://www.philips.com",
        "market_cap": "Large Cap"
    },
    "SCE.DE": {
        "short_name": "SCHWEIZER ELECTR. NA O.N.",
        "long_name": "Schweizer Electronic AG",
        "summary": "Schweizer Electronic AG, together with its subsidiaries, develops, produces, and distributes printed circuit boards (PCBs) worldwide. The company offers sportive PCBs; and power electronics, including heavy copper, inlay, power combi, and IMS boards. It also provides embedding products and solutions, such as integrated interposer board for the embedding of logic semiconductors; power PCB; cavity boards for various solutions; and ÂµÂ² Pack for smallest, thinnest, and multi-chip semiconductor packages, as well as modules with direct pad contacting. In addition, the company offers system cost reduction solutions, including FR4 Flex with restricted installation possibilities; resistor print for integration of resistors as a passive component through thick-film technology carried out by screen printing process; high frequency PCBs for safety engineering for vehicles; electroless nickel-electroless palladium-autocatalytic gold surface finishes for automotive and industrial applications; and all in one PCBs for power electronics, embedding, and system cost reduction applications. It provides its products for the automotive, solar, aviation, and general industries; and electronic control units, motor drives, DC/DC and AC/DC converters, and consumer and mobile applications, as well as semiconductor packaging. Schweizer Electronic AG was founded in 1849 and is headquartered in Schramberg, Germany.",
        "currency": "EUR",
        "sector": "Consumer Goods",
        "industry": "Electronic Equipment",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "state": null,
        "city": "Schramberg",
        "zipcode": "78713",
        "website": "http://www.schweizer.ag",
        "market_cap": "Small Cap"
    }
}