{
    "EIX1.MX": {
        "short_name": "EDISON INTERNATIONAL",
        "long_name": "Edison International",
        "summary": "Edison International, through its subsidiaries, engages in the generation, transmission, and distribution of electricity in the United States. The company generates electricity through hydroelectric, diesel/liquid petroleum gas, natural gas, nuclear, and photovoltaic sources. It supplies electricity primarily to residential, commercial, industrial, agricultural, and other customers, as well as public authorities through transmission and distribution networks. The company's transmission facilities consist of lines ranging from 33 kV to 500 kV and substations; and distribution system comprises approximately 53,000 line miles of overhead lines, 38,000 line miles of underground lines, and 800 substations located in California. It serves approximately 5 million customers. The company was founded in 1886 and is based in Rosemead, California.",
        "currency": "MXN",
        "sector": "Utilities",
        "industry": "Electric Utilities",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Rosemead"
    },
    "TENERGY.AT": {
        "short_name": "TERNA ENERGY S.A. (CR)",
        "long_name": "Terna Energy Societe Anonyme Commercial Technical Company",
        "summary": "Terna Energy Societe Anonyme Commercial Technical Company operates in the renewable energy sources (RES), construction, trading of electric energy, and concessions sectors in Balkans, Eastern Europe, and North America. The company constructs, exploits, and installs renewable energy projects. It also owns and operates wind farm, hydroelectric, pumped storage, hybrid, solar energy, and photovoltaic park, as well as biogas and waste management projects. In addition, the company engages in the construction and operation of infrastructure and public sector projects, such as unified automatic collection system and municipal waste treatment facilities in Epirus region. As of December 31, 2019, the company had operational power of 1,361.9 MW and installed capacity of 1.386.5 MW. Terna Energy Societe Anonyme Commercial Technical Company was founded in 1949 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Electric Utilities",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "XEL.MX": {
        "short_name": "XCEL ENERGY INC",
        "long_name": "Xcel Energy Inc.",
        "summary": "Xcel Energy Inc., through its subsidiaries, generates, purchases, transmits, distributes, and sells electricity. It operates through Regulated Electric Utility, Regulated Natural Gas Utility, and All Other segments. The company generates electricity through coal, nuclear, natural gas, hydroelectric, solar, biomass, oil, wood/refuse, and wind energy sources. It also purchases, transports, distributes, and sells natural gas to retail customers, as well as transports customer-owned natural gas. In addition, the company develops and leases natural gas pipelines, and storage and compression facilities; and invests in rental housing projects, as well as procures equipment for construction of renewable generation facilities. It serves residential, commercial, and industrial customers in the portions of Colorado, Michigan, Minnesota, New Mexico, North Dakota, South Dakota, Texas, and Wisconsin. The company sells electricity to approximately 3.7 million customers; and natural gas to approximately 2.1 million customers. Xcel Energy Inc. was founded in 1909 and is headquartered in Minneapolis, Minnesota.",
        "currency": "MXN",
        "sector": "Utilities",
        "industry": "Electric Utilities",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Minneapolis"
    }
}