{
    "000938.SZ": {
        "short_name": "UNISPLENDOUR CO. L",
        "long_name": "Unisplendour Corporation Limited",
        "summary": "Unisplendour Corporation Limited, a technology company, provides electronics and information technology (IT) solutions in China and internationally. The company offers cloud computing, mobile Internet, big data processing, and other services for IT applications; and research and development, building, operation, and maintenance of information systems. It also provides equipment, such as intelligent network equipment, storage systems, and servers; desktop and mobile software solutions; and technical consulting, infrastructure solutions, and support services. The company was founded in 1999 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100084",
        "website": "http://www.thunis.com",
        "full_time_employees": 15497
    },
    "002819.SZ": {
        "short_name": "BEIJING ORIENTAL J",
        "long_name": "Beijing Oriental Jicheng Co., Ltd.",
        "summary": "Beijing Oriental Jicheng Co., Ltd. offers products and solutions for test and measurement applications in China. The company provides services, including consultations on the value-added sales, system integration, technical rental, equipment testing and calibration, maintenance and repair, outsourcing management of scientific assets, etc. It also operates jicheng.net.cn, an e-business platform for instrumentation industry. The company serves customers in various sectors, such as industrial electronics manufacturing, telecommunications and information technology, R&D, education and scientific research, electric power, petroleum and chemical, aviation and aerospace, microelectronics, new energy, biological pharmacy and environmental protection, etc. Beijing Oriental Jicheng Co., Ltd. was founded in 2000 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100142",
        "website": "http://www.jicheng.net",
        "full_time_employees": 306
    },
    "002953.SZ": {
        "short_name": "GUANGDONG RIFENG E",
        "long_name": "GuangDong Rifeng Electric Cable Co., Ltd.",
        "summary": "GuangDong Rifeng Electric Cable Co., Ltd. engages in the manufacture and sale of cables in the People's Republic of China and internationally. The company provides rubber cables, housing wires, PVC/LSOH cables, power cables, instrumentation cables, shipboard and marine cables, plugs and connectors, control cables, heavy machinery cables, communication cables, connector cables, and power cords. Its products are used in household appliances, electrical engineering, petroleum chemical industry, metallurgy, construction machinery, communications engineering, wind power, environmental protection engineering, dam embankment engineering, instrumentation, computer communications, control, and other fields. The company was founded in 2009 and is based in Zhongshan, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhongshan",
        "zipcode": "528401",
        "website": "http://www.rfcable.com.cn",
        "full_time_employees": 1903
    },
    "0186.HK": {
        "short_name": "NIMBLE HOLDINGS",
        "long_name": "Nimble Holdings Company Limited",
        "summary": "Nimble Holdings Company Limited, an investment holding company, distributes houseware and audio products in the People's Republic of China, rest of Asia, the United States, Canada, and Europe. The company also holds and licenses brands and trademarks, such as Akai, Sansui, and Nakamichi worldwide. In addition, it trades in household appliances, wires, and cables; provides management, corporate finance, and information technology system development and related services; and engages in the property development and operation activities. The company was formerly known as The Grande Holdings Limited and changed its name to Nimble Holdings Company Limited in February 2018. The company is based in Tsuen Wan, Hong Kong. Nimble Holdings Company Limited is a subsidiary of Wealth Warrior Global Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.nimbleholding.com",
        "full_time_employees": 69
    },
    "0400.HK": {
        "short_name": "COGOBUY",
        "long_name": "Cogobuy Group",
        "summary": "Cogobuy Group operates as an e-commerce company serving the electronics manufacturing industry in the People's Republic of China and Hong Kong. It sells integrated circuits and other electronic components comprising microcontrollers/processors, sensors and converters, signal and interface products, amplifiers, filters, optoelectronic devices, resistors, inductors, discrete devices, connectors, switches, relays, circuit protection devices, development tools and systems, multimedia ICs, and dedicated and motor control ICs, as well as FPGA/CPLD, DSP, memory, wireless and RF, power management, capacitance, timer, and clock products. The company offers its products through its e-commerce platform, cogobuy.com, which includes a direct sales platform, as well as through an online marketplace, and a team of technical consultants and professional sales representatives. It also provides media communication and collaboration platforms and solutions; supply chain financing services; and develops e-commerce software technology. In addition, the company develops and sells electronic communication products; operates the INGDAN.com platform; and holds Internet content provider license. It serves electronics manufacturers, including small and medium enterprise, and blue-chip customers. The company was founded in 2000 and is headquartered in Shenzhen, the People's Republic of China. Cogobuy Group is a subsidiary of Envision Global Investments Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.cogobuy.com",
        "full_time_employees": 454
    },
    "0471.HK": {
        "short_name": "CMMB VISION",
        "long_name": "CMMB Vision Holdings Limited",
        "summary": "CMMB Vision Holdings Limited, an investment holding company, engages in the convergent mobile multimedia broadcasting (CMMB) business in the United States and Taiwan. The company operates through CMMB Business and Trading Business segments. It delivers digital mobile television (TV) and multimedia contents through terrestrial and satellite networks directly to mobile and wireless devices, such as smartphones, tablets, pocket TVs, laptops, automobile digital receivers, and personal media players. The company also engages in the free-to-air digital TV programming activities; and procurement and distribution of PCB materials. In addition, it provides convergent satellite-mobile multimedia infotainment broadcasting services. The company was formerly known as Global Flex Holdings Limited and changed its name to CMMB Vision Holdings Limited in May 2010. CMMB Vision Holdings Limited was incorporated in 2004 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.cmmbvision.com",
        "full_time_employees": 25
    },
    "077500.KS": {
        "short_name": "Uniquest",
        "long_name": "Uniquest Corporation",
        "summary": "Uniquest Corporation distributes electronic components in South Korea and internationally. The company offers 3D multimedia, sensor, and wireless solutions; power products, and communication ICs and PLDs for networking system and communications; and semiconductor solutions for digital consumers, such as media center, smart TV, and smart home. It also provides design, logistics, and technical support services, as well as consulting and training services. The company was formerly known as Uniquest Korea, Co. Ltd. and changed its name to Uniquest Corporation in 2003. The company was founded in 1993 and is headquartered in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seongnam-si",
        "zipcode": "13591",
        "website": "http://www.uniquest.co.kr",
        "full_time_employees": null
    },
    "0854.HK": {
        "short_name": "WILLAS-ARRAY",
        "long_name": "Willas-Array Electronics (Holdings) Limited",
        "summary": "Willas-Array Electronics (Holdings) Limited, an investment holding company, distributes electronic components for industrial, audio and video, telecommunication, home appliances, lighting, electronic manufacturing, and automotive segments. The company distributes automotive, infotainment, internet of things, motor control, SMPS, smart LED products, etc. It also provides technical solutions, including wireless module, automotive, motor control, smart meter, white goods, power/LED lighting, and audio solutions. In addition, the company engages in the property holding activities; and provision of transportation, and management and consultancy services. The company operates in the Northern China Region, Southern China Region, and Taiwan. Willas-Array Electronics (Holdings) Limited was founded in 1981 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.willas-array.com",
        "full_time_employees": 361
    },
    "0856.HK": {
        "short_name": "VSTECS",
        "long_name": "VSTECS Holdings Limited",
        "summary": "VSTECS Holdings Limited, an investment holding company, develops information technology (IT) product channel and provides technical solution integration services in North Asia and South East Asia. It operates through three segments: Enterprise Systems, Consumer Electronics, and Cloud Computing. The Enterprise Systems segment provides enterprise system tools, such as middleware, operating systems, Unix/NT servers, databases, and storage equipment for IT infrastructure; and IT infrastructure design and implementation, training, maintenance, and support services. The Consumer Electronics segment offers finished IT products, including computers, mobile phones, drones, smart sports watches, 3D printers, game consoles, etc. The Cloud Computing segment provides cloud computing solutions and services. The company is also involved in the retail of IT products, equipment, and accessories; import and export of IT products; and provision of supply chains management and warehouse transport, electronic settlement business center, and project investment and marketing research services. It serves individuals, small and medium enterprises, large corporations, and government entities through a distribution network of resellers comprising retailers, system integrators, and corporate dealers. The company was formerly known as VST Holdings Limited and changed its name to VSTECS Holdings Limited in June 2017. VSTECS Holdings Limited was founded in 1991 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.vstecs.com",
        "full_time_employees": 3414
    },
    "0997.HK": {
        "short_name": "CHINLINK INTL",
        "long_name": "Chinlink International Holdings Limited",
        "summary": "Chinlink International Holdings Limited, an investment holding company, engages in the trading of consumer goods and electronic products in the People's Republic of China. It also trades in furniture and fixtures, and chinese medicine; and provides interior decoration, logistics, finance lease and guarantee, and advisory services. In addition, the company is involved in the property investment business, including the leasing of properties; and provision of property management and asset management services. Further, it offers corporate financing guarantee services and related consultancy services; factoring; and supply chain finance to small and medium-sized enterprises. The company was formerly known as Decca Holdings Limited and changed its name to Chinlink International Holdings Limited in February 2012. The company was founded in 1973 and is headquartered in Central, Hong Kong. Chinlink International Holdings Limited is a subsidiary of Wealth Keeper International Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.chinlinkint.com",
        "full_time_employees": 270
    },
    "1213.HK": {
        "short_name": "MOBICON GROUP",
        "long_name": "Mobicon Group Limited",
        "summary": "Mobicon Group Limited, an investment holding company, trades in and distributes electronic components, automation parts, and equipment in Hong Kong and other Asia-Pacific countries, South Africa, Europe, and internationally. The company operates through three segments: Electronic Trading Business, Computer Business, and Cosmetic and Online Retail Business. It is also involved in the trading and distribution, and retail of computer products, smartphone accessories, and consumer products; and provision of information technology outsourcing and solution services. In addition, the company trades in, distributes, and retails cosmetic products through a network of 10 retail shops, as well as online channels. Mobicon Group Limited offers its products under the brand name of MOBICON, VideoCom, APower, and wishh brand names. Mobicon Group Limited was founded in 1983 and is based in San Po Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "San Po Kong",
        "zipcode": null,
        "website": "http://www.mobicon.com",
        "full_time_employees": 388
    },
    "1214.SR": {
        "short_name": "Al Hassan Ghazi Ibrahim Shaker ",
        "long_name": "Al Hassan Ghazi Ibrahim Shaker Company",
        "summary": "Al Hassan Ghazi Ibrahim Shaker Company, together with its subsidiaries, engages in the trading, wholesale, and maintenance of spare parts, electronic equipment, household equipment, and air-conditioners in Saudi Arabia, Jordan, and the United Arab Emirates. The company operates through three segments: Heating, Ventilation and Air-Conditioning Solutions; Home Appliances; and All Other. The Heating, Ventilation and Air-Conditioning Solutions segment offers residential and commercial air conditioners, including chillers and related services. The Home Appliances segment provides televisions, washing machines, dryers, refrigerators, irons, gas cookers, and floor care. The All Other segment offers energy solutions and mobiles. The company provides agency services to LG air conditioners, as well as other home appliances brands, including Indesit, Ariston, Maytag, Bompani, Midea, and Panasonic. In addition, it engages in importing, manufacturing, and distributing service of air conditioners and home appliances. The company offers its products through a network of sales outlets, service centers, warehousing facilities, and training academies, as well as a network of distributors, such as specialty retailers and hypermarkets. Al Hassan Ghazi Ibrahim Shaker Company was founded in 1950 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11422",
        "website": "http://www.shaker.com.sa",
        "full_time_employees": null
    },
    "1617.TW": {
        "short_name": "JUNG SHING WIRE CO",
        "long_name": "Jung Shing Wire Co., Ltd.",
        "summary": "Jung Shing Wire Co., Ltd. manufactures and sells magnet wires in Taiwan. The company offers general magnet wires for motors, transformers, generators, telecommunication, mobiles, auto-controlling, in-house products, electronic apparatus, and aerospace and aviation related equipment; self-bonding magnet wires; and special magnet wires, including ribbon wires, parallel-laid multi-wires, copper-clad aluminum wires, aluminum wires, litz wires, high-tension magnet wires, silver magnet wires, silver- plate magnet wires, and surge resistance magnet wires. Its products are used in motors, coils, and transformers. Jung Shing Wire Co., Ltd. was founded in 1971 and is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "71757",
        "website": "http://www.jswire.com.tw",
        "full_time_employees": null
    },
    "1632.HK": {
        "short_name": "MSCTECH",
        "long_name": "Minshang Creative Technology Holdings Limited",
        "summary": "Minshang Creative Technology Holdings Limited operates a chain of restaurants. It operates through two segments, Vietnamese-Style Restaurant Business and Trading Business. As of March 31, 2020, the company operated 15 restaurants under the Viet's Choice brand name, and 1 restaurant under the Five Spice brand name in Hong Kong. It also trades in 3C electronic products, including smartphones; frozen foods, including dumplings, glutinous rice balls, seafood, and agricultural products, as well as meat, such as poultry, pork, beef, and lamb; and grains and oil products in the People's Republic of China. The company was formerly known as Food Wise Holdings Limited and changed its name to Minshang Creative Technology Holdings Limited in October 2018. The company was founded in 2003 and is headquartered in Admiralty, Hong Kong. Minshang Creative Technology Holdings Limited is a subsidiary of MSEC Holdings Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.minshangct.com",
        "full_time_employees": 148
    },
    "1W2.F": {
        "short_name": "INNELEC MULT.IMMINHEO1,53",
        "long_name": "Innelec Multimédia SA",
        "summary": "Innelec MultimÃ©dia SA distributes various multimedia products in Europe, Africa, Oceania, and internationally. It offers console and PC games; games consoles; gaming accessories; mobility accessories, such as chargers, power bank, Bluetooth speakers, selfie sticks, travel adapters, USB micro cables, lightning cable, and waterproof cases; spin-off products; urban mobility and connected products; storage and audio accessories; and utility and professional software. Innelec MultimÃ©dia SA primarily sells its products to the retailers. The company was founded in 1983 and is based in Pantin, France.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "state": null,
        "city": "Pantin",
        "zipcode": "93692",
        "website": "http://corporate.innelec.com",
        "full_time_employees": 96
    },
    "2302.HK": {
        "short_name": "CNNC INT'L",
        "long_name": "CNNC International Limited",
        "summary": "CNNC International Limited, an investment holding company, explores for and trades in mineral properties in Mongolia and the People's Republic of China. It operates through Trading of Mineral Property, Exploration and Selling of Mineral Properties, and Supply Chain segments. The company holds interests in uranium projects located in Mongolia. It also sells electronics and other products, including liquid crystal displays, flash drives, memory cards, metal raw materials, etc.; and offers supply chain services. The company was formerly known as United Metals Holdings Limited and changed its name to CNNC International Limited in August 2008. The company was incorporated in 2002 and is headquartered in Hong Kong, Hong Kong. CNNC International Limited is a subsidiary of CNNC Overseas Uranium Holding Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.cnncintl.com",
        "full_time_employees": 23
    },
    "2715.T": {
        "short_name": "ELEMATEC CORPORATION",
        "long_name": "Elematec Corporation",
        "summary": "Elematec Corporation supplies electronic parts, materials, and modules for manufacturers of electronic products in Japan and internationally. It offers a range of products that are applied in various electronic products, such as smartphone camera modules, cameras, household electric appliances, video equipment, semiconductors, OA equipment, super computers, health care equipment, automotive equipment, construction equipment, housing equipment, industrial equipment, medical equipment, infrastructure and energy equipment, and toys and hobbies. The company also distributes other products, such as adhesives, tapes, and peltiers. In addition, it offers procurement agency services; processing services comprising screen printing, cutting, and assembling; planning and development services; and quality and environmental services, including inspection of environmentally hazardous substances, identifying and analyzing defects, and quality follow-up services. The company was founded in 1947 and is headquartered in Tokyo, Japan. Elematec Corporation is a subsidiary of Toyota Tsusho Corporation.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-6319",
        "website": "http://www.elematec.com",
        "full_time_employees": null
    },
    "284740.KS": {
        "short_name": "CUCKOO HOMESYS",
        "long_name": "CUCKOO Homesys Co., Ltd",
        "summary": "Cuckoo Homesys Co., Ltd. engages in the manufacture, sale, and rental of household appliances. It sells and rents water purifiers, bidets, air purifiers, and water softeners. The company was founded in 2017 and is headquartered in Siheung, South Korea. Cuckoo Homesys Co., Ltd. operates independently of Cuckoo Holdings Co., Ltd. as of January 12, 2018.",
        "currency": "KRW",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Siheung-Si",
        "zipcode": null,
        "website": "http://www.cuckoorental.co.kr",
        "full_time_employees": null
    },
    "2XH.F": {
        "short_name": "LARGO  EO 0,02",
        "long_name": "Largo SA",
        "summary": "Largo SA refurbishes smartphones, tablets, and laptops in France. The company was founded in 2016 and is headquartered in Sainte-Luce-Sur-Loire, France.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "state": null,
        "city": "Sainte-Luce-sur-Loire",
        "zipcode": "44980",
        "website": "http://www.largo-france.fr",
        "full_time_employees": 38
    },
    "300563.SZ": {
        "short_name": "SHENYU COMMUNICATI",
        "long_name": "Shenyu Communication Technology Inc.",
        "summary": "Shenyu Communication Technology Inc. engages in the research and development, production, and sale of radio frequency coaxial cables in China. The company offers high-end stationary phase, microwave low loss, semi rigid, fine coaxial radio frequency, and very thin radio frequency coaxial cables; high speed data lines; radio frequency cable components; AF high temperature installation cables; and various high-frequency low-loss steady-phase cable assemblies and low-loss flexible microwave feeders. Its products are used in aerospace, ship, consumer electronics, medical equipment, communication base station, and high-frequency test instrument applications. Shenyu Communication Technology Inc. was founded in 2003 and is based in Jiangyin, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiangyin",
        "zipcode": null,
        "website": "http://www.shenyucable.com",
        "full_time_employees": 492
    },
    "3020.T": {
        "short_name": "APPLIED CO.LTD",
        "long_name": "Applied Co.,Ltd.",
        "summary": "Applied Co.,Ltd. sells personal computers, peripheral equipment, and digital products in Japan. It is also involved in the planning, development, manufacture, sale, and wholesale of private brand PCs and digital products. The company also engages in the procurement, advertising, and sale of products of other manufacturers. In addition, it provides network system construction and maintenance, and remote services. The company was founded in 1977 and is headquartered in Fukuoka City, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka City",
        "zipcode": "812-0007",
        "website": "http://www.applied-g.jp",
        "full_time_employees": 400
    },
    "3048.TW": {
        "short_name": "EDOM TECHNOLOGY CO",
        "long_name": "EDOM Technology Co., Ltd.",
        "summary": "EDOM Technology Co., Ltd. engages in the distribution of electronic parts, computer hardware, software, and equipment in Taiwan and internationally. The company offers analog ICs, batteries, connectors, digital logic ICs, discrete products, embedded modules, memory products, micro components, non-optical sensors, optoelectronics, passive components, test and measurement products, and other products. It has strategic partnership with PollenTech to enable the delivery of integrated HW & SW system solutions. The company serves Internet of things, mobile, consumer electronics, industrial, and automotive sectors. EDOM Technology Co., Ltd. was founded in 1996 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.edomtech.com/tw",
        "full_time_employees": null
    },
    "3131.T": {
        "short_name": "SHINDEN HIGHTEX CORPORATION",
        "long_name": "Shinden Hightex Corporation",
        "summary": "Shinden Hightex Corporation sells various electronic components primarily in Japan. The company manufactures ICs and liquid crystal displays; electronic component printed circuit board packaging, BGA/CSP re-work/re-ball, and outsourcing; flash storage and DRAM modules; graphics cards; and hardware and software products comprising cellular communication modules and the global navigation satellite system products. It also provides CF cards and SSD products; e-mail security software; directional speakers; defense against pirate, bird deterrent devices, industrial warning surveillance, tunnel safety, and pedestrian safety products; Gateways, modules for LoRa, LTE-M1, and private LTE; automotive connectivity modules for cellular and V2X communication; server and data centers; and Li-ion batteries. In addition, the company offers semiconductor components, such as memory products; accelerated processing units and GPUs; LCD controllers, MCUs for remote controllers, power supply MCUs, ARM CPU-based 32bit MCUs, and segment driver ICs; ARM core SoC; ASICs; CMOS image sensor and flat panel display driver products; LEDs, wireless modules, touch windows, and PCBs; foundry products and services; semiconductor packaging and test solutions; bumping services; memory controllers; and speakers/receivers/vibration motors/actuators for automobile. The company was founded in 1995 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0042",
        "website": "http://www.shinden.co.jp",
        "full_time_employees": 120
    },
    "3232.TWO": {
        "short_name": "SENTRONIC INTERNATIONAL CORP",
        "long_name": "Sentronic International Corp.",
        "summary": "Sentronic International Corp. provides semiconductor components, liquid crystal displays, optical pickups, light-emitting diodes, micro motors, decentralized components, etc. The company was founded in 1987 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.sentronic.com.tw",
        "full_time_employees": null
    },
    "3287.TWO": {
        "short_name": "KWORLD COMPUTER CO",
        "long_name": "Kworld Computer Co.,Ltd",
        "summary": "Kworld Computer Co., Ltd provides digital entertainment products in Taiwan and internationally. It offers gaming earphones; and wall and car chargers, as well as TV/video drivers, analog TV tuner cards, and hybrid TV tuner sticks. The company was founded in 1999 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23585",
        "website": "http://www.kworld-global.com",
        "full_time_employees": null
    },
    "3325.TWO": {
        "short_name": "CASING MACRON TECHNOLOGY CO",
        "long_name": "Casing Macron Technology Co., Ltd.",
        "summary": "Casing Macron Technology Co., Ltd. designs, manufactures, markets, and sells computing products. It offers PC chassis and switching power supply products; peripheral devices, such as card readers, mouse, speakers, and barebone systems; and PC cases, including slim, mini tower, middle tower, mini ITX, server, and gamming PC cases. The company also provides water filter systems and temperature drinking water devices. In addition, it offers OEM and ODM services. The company was founded in 1994 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.casing.com.tw",
        "full_time_employees": null
    },
    "3375.T": {
        "short_name": "ZOA CORPORATION",
        "long_name": "Zoa Corporation",
        "summary": "Zoa Corporation engages in the retail sale of computer and related equipment, motorcycle supplies, etc. It also provides various support, iPhone repair, personal computer repair Web reception, and smartphone data recovery services. The company was founded in 1984 and is headquartered in Numazu, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Numazu",
        "zipcode": "410-0873",
        "website": "http://www.zoa.co.jp",
        "full_time_employees": 77
    },
    "3444.TWO": {
        "short_name": "NICHING INDUSTRIAL CORP",
        "long_name": "Niching Industrial Corporation",
        "summary": "Niching Industrial Corporation markets and sells semiconductor, flat panel display, light-emitting diode (LED), green energy, and nanotechnology products worldwide. The company provides PCB for solid-state drives and memory modules, substrates for IC packaging, capillary wedges, die collet needles, special gas, dispensing nozzles, and die attach films, as well as reclaim, Al coating, dummy, and daisy chain wafers. It also offers screen printing silver paste, Nano imprint silver paste, gravure off set silver paste, low-temperature sintering Ag paste, and low temp adhesive silver paste, as well as printing paste for laser etching and silver ink; chip trays, ABS reels, sputtering targets, and emboss spacers for the LCD industry; and LED tabs and lead frames for the LED industry. In addition, the company provides adhesives for temporary bonding, metal springs for VCM, CPD dryers, and Nano porous materials, substrate for stretchable and flexible modules, and wireless power charging coils. Further, it manufactures and sells touch Nano silver products. Niching Industrial Corporation was founded in 1993 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "40755",
        "website": "http://www.niching.com.tw",
        "full_time_employees": null
    },
    "3483.TWO": {
        "short_name": "FORCECON TECH. CO. LTD",
        "long_name": "Forcecon Technology Co., Ltd.",
        "summary": "Forcecon Technology Co., Ltd. engages in the research, development, production, and sale of thermal management products in Taiwan and internationally. The company offers DC axial and blower fans, thermal module active and passive products, vapor chambers, and heat pipes for use in computers, VGA, LED lightings, servers, automobiles, smart-phones, and bio-technology science fields. It serves ODM and OEM customers. The company was founded in 1997 and is headquartered in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "30252",
        "website": "http://www.forcecon.com",
        "full_time_employees": null
    },
    "3528.TW": {
        "short_name": "ANSWER TECHNOLOGY CO. LTD.",
        "long_name": "Answer Technology Co., Ltd.",
        "summary": "Answer Technology Co., Ltd. provides analog, mixed-signal, and digital signal processing integrated circuits (IC) in Taiwan. It also provides USB3.0/3.1, PCIe bridge, and switch ICs; and fabless IC design services, as well as various reference design and technology background for supporting services. In addition, the company designs, manufactures, and ships discrete and embedded magnetoresistive RAM (MRAM) and spin-torque MRAM; and offers circuit protection components and antenna products for computing, communication, consumer electronics, and automotive electronics. Further, it provides optical communications product; broadcast test and measurement equipment; design and consultancy services to broadcast, professional A/V, and image processing companies; packaged infrared sensors used for gas detection, flame detection, and gensture/motion/presence detection; and FPGAs, SoCs, MPSoCs, and 3D ICs, as well as develops various silicon intellectual properties and integrated technologies of system software/hardware. Additionally, the company offers sensor solutions for applications in various industries; Valens HDBaseT technology that provides plug-and-play digital connectivity between HD video sources and remote displays; and design services, and original IP core and application specific solutions, as well as develops ASSPs for motion control of fractional horse power stepper motors and brushless DC motors. Answer Technology Co., Ltd. was founded in 2000 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.anstek.com.tw",
        "full_time_employees": 157
    },
    "3702.TW": {
        "short_name": "WPG HOLDINGS LIMITED",
        "long_name": "WPG Holdings Limited",
        "summary": "WPG Holdings Limited distributes semiconductor, electronic, and electrical components in Taiwan, Mainland China, and internationally. The company provides core components, such as chipsets, graphics/audio/video controllers, smartphone chips, network/modem chipsets, CPU/MPU, RISC CPU, etc.; analog IC and mixed signal components, including bipolar, CMOS operational amplifiers, comparators, digital/analog converters, power supply controllers, audio and video amplifiers or controllers, etc.; and discrete logic IC components comprising of diodes, rectifiers, transistors, thyristors, insulated-gate bipolar transistors, optical transistors, logic ICs, etc. It also offers memory components, such as DRAM, SRAM, EPROM, EEPROM, flash, MCP, etc.; optical components, which includes LCD, sensor, LED, etc.; and passive components, connectors, and magnetic components, including resistors, capacitors, inductors, magnetic components, cables, connectors, mechanics, electro mechanics, circuit protection, materials, batteries, filters, oscillators, etc., as well as non-electronic components. In addition, the company operates children theme parks; and engages in the investment activities and general trading business. Further, it offers various value-added services, such as special delivery, market information, technical support and tools, financial support, turnkey solution, warehousing, logistics, and e-commerce services; and computer software, computer and its peripherals, and information products. WPG Holdings Limited was founded in 2005 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.wpgholdings.com",
        "full_time_employees": null
    },
    "3702A.TW": {
        "short_name": "WPG HOLDINGS LIMITED",
        "long_name": "WPG Holdings Limited",
        "summary": "WPG Holdings Limited distributes semiconductor, electronic, and electrical components in Taiwan, Mainland China, and internationally. The company provides core components, such as chipsets, graphics/audio/video controllers, smartphone chips, network/modem chipsets, CPU/MPU, RISC CPU, etc.; analog IC and mixed signal components, including bipolar, CMOS operational amplifiers, comparators, digital/analog converters, power supply controllers, audio and video amplifiers or controllers, etc.; and discrete logic IC components comprising of diodes, rectifiers, transistors, thyristors, insulated-gate bipolar transistors, optical transistors, logic ICs, etc. It also offers memory components, such as DRAM, SRAM, EPROM, EEPROM, flash, MCP, etc.; optical components, which includes LCD, sensor, LED, etc.; and passive components, connectors, and magnetic components, including resistors, capacitors, inductors, magnetic components, cables, connectors, mechanics, electro mechanics, circuit protection, materials, batteries, filters, oscillators, etc., as well as non-electronic components. In addition, the company operates children theme parks; and engages in the investment activities and general trading business. Further, it offers various value-added services, such as special delivery, market information, technical support and tools, financial support, turnkey solution, warehousing, logistics, and e-commerce services; and computer software, computer and its peripherals, and information products. WPG Holdings Limited was founded in 2005 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.wpgholdings.com",
        "full_time_employees": null
    },
    "3991.HK": {
        "short_name": "CHANGHONG JH",
        "long_name": "Changhong Jiahua Holdings Limited",
        "summary": "Changhong Jiahua Holdings Limited, an investment holding company, distributes information technology (IT) consumer products, IT corporate products, and other products in the People's Republic of China. The company's IT Consumer Products segment distributes personal computers, digital products, and IT accessories. Its IT Corporate Products segment distributes storage products, minicomputers, networking products, personal computer servers, intelligent building management system products, and unified communication and contact center products. The company's Others segment distributes smartphones; develops own brand products, such as mobile location-based service products; sells warranty packages; and provides professional integrated IT solutions and services. The company was formerly known as China Data Broadcasting Holdings Limited and changed its name to Changhong Jiahua Holdings Limited in January 2013. Changhong Jiahua Holdings Limited is headquartered in Central, Hong Kong. Changhong Jiahua Holdings Limited is a subsidiary of Sichuan Changhong Electronic Co., Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://en.changhongit.com",
        "full_time_employees": 1259
    },
    "42E.SI": {
        "short_name": "$ Choo Chiang",
        "long_name": "Choo Chiang Holdings Ltd.",
        "summary": "Choo Chiang Holdings Ltd., an investment holding company, engages in the retail and distribution of electrical products and accessories in Singapore. It operates through two segments, Distribution Business and Property Investment Business. The company offers electrical cables and cable accessories; light switches, circuit breakers, and accessories; lightning accessories; trunking and pipe products; air-conditioner accessories; light fixtures and accessories; ventilating, wall-mounted, and ceiling fans; and power drills and handheld tools. It also provides electrical products and accessories under the CCM and CRM brands. In addition, the company is involved in the assembly of lighting fittings and fixtures; and property investment and real estate management activities. It offers its products for residential and industrial use through 10 retail branches. The company was incorporated in 2014 and is headquartered in Singapore. Choo Chiang Holdings Ltd. is a subsidiary of TL Investment Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "738388",
        "website": "http://www.ccm.sg",
        "full_time_employees": null
    },
    "4420.T": {
        "short_name": "ESOL CO LTD",
        "long_name": "eSOL Co.,Ltd.",
        "summary": "eSOL Co.,Ltd. designs, plans, operates, and maintains embedded software solutions and logistics systems in Japan. The company offers real-time operating systems(RTOS) that include Extended T-Kernel, RTOS for embedded systems; POSIX, a compliant RTOS that provides support for pthread, signal, and inter process communication on the system level; process model-based RTOS with memory protection; compact RTOS with small footprint; and RTOS for multi-core processors, as well as software development kit for many-core processors. It also provides eBinder, a development suite for embedded software; FAT12/16/32, VFAT, and exFAT-compatible file systems for embedded systems; software platforms; and evaluation kits. In addition, the company offers application middleware, including graphical user interface (GUI), computer vision, and embedded database solutions; automotive software, such as AUBIST classic and adaptive platforms, and ECU diagnostics and reprogramming. Further, it develops and sells devices primarily focused on portable terminals, automotive printers, and sensor device products; and software systems to solve diversifying issues on the ground. The company was formerly known as ERG Co., Ltd. and changed its name to eSOL Co.,Ltd. in May 2001. eSOL Co.,Ltd. was founded in 1975 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "164-8721",
        "website": "http://www.esol.com",
        "full_time_employees": 484
    },
    "4768.T": {
        "short_name": "OTSUKA CORPORATION",
        "long_name": "Otsuka Corporation",
        "summary": "Otsuka Corporation provides system integration, support, and other services in Japan. The company operates through two segments, System Integration Business, and Service and Support Business. The System Integration Business segment offers system services ranging from consulting, system design and development, transport and installation work, and network construction. It also provides management systems and collaborative software to cover a range of specialized fields, including CAD and web technologies; and software, hardware, intranet, and security products for the construction and expansion of computer networks. In addition, this segment sells computers, copiers, and communications equipment and software; and develops consigned software. The Service and Support Business segment offers supplies, hardware and software maintenance, telephone support, and outsourcing services; emergency computer rescue services for corporate and individual clients; and network support and services for the planning, design, construction, and operation of corporate information systems, as well as out-sources system engineers. It also provides educational support services. The company was incorporated in 1961 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-8573",
        "website": "http://www.otsuka-shokai.co.jp",
        "full_time_employees": 9119
    },
    "573.SI": {
        "short_name": "Challenger",
        "long_name": "Challenger Technologies Limited",
        "summary": "Challenger Technologies Limited operates a chain of information technology (IT) retail stores under the Challenger brand name in Singapore. The company operates through IT Products and Services, Electronic Signage, and Telephonic Call Centre and Data Management Services segments. The IT Products and Services segment retails a selection of IT products, including personal computers, notebooks, printers, scanners, digital imaging solutions, personal digital assistants, mobile and wireless connectivity solutions, audio-visual and projection equipment, and related peripherals. The Electronic Signage segment supplies and installs electronic signages; and provides electronic signage services. The Telephonic Call Centre and Data Management Services segment is involved in the provision of telephonic call center, data management, and direct marketing services. The company also offers procurement services for IT products. In addition, it engages in the online sale of computer hardware, software, and accessories, as well as mobile phones and accessories. As of February 13, 2020, the company operated retail network of 41 stores. Challenger Technologies Limited was founded in 1982 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408553",
        "website": "http://www.challengerasia.com",
        "full_time_employees": 284
    },
    "5EF.SI": {
        "short_name": "$ Adventus",
        "long_name": "Adventus Holdings Limited",
        "summary": "Adventus Holdings Limited, an investment holding company, operates as a property development and management consulting company in Singapore and Vietnam. The company is also developing two 5-star hotels under the name Da Nang 5-Star Hotel Development and Hoi An 5-Star Resort projects. In addition, it offers management consulting and construction management services; invests in properties; and operates in commodities and mineral resources businesses. The company was formerly known as SNF Corporation Ltd. and changed its name to Adventus Holdings Limited in January 2009. Adventus Holdings Limited was founded in 2003 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "100052",
        "website": "http://www.adventusholdings.com",
        "full_time_employees": 24
    },
    "600149.SS": {
        "short_name": "LANGFANG DEVELOPMENT CO. LTD.",
        "long_name": "Langfang Development Co., Ltd.",
        "summary": "Langfang Development Co., Ltd. distributes electronic products and provides network technology services in China. It also offers real estate consulting services; and leases properties. The company was formerly known as C&T Technology Development CO., LTD. Langfang Development Co., Ltd. is based in Langfang, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Langfang",
        "zipcode": "065000",
        "website": null,
        "full_time_employees": 130
    },
    "601616.SS": {
        "short_name": "SHANGHAI GUANGDIAN ELECTRIC GRO",
        "long_name": "Shanghai Guangdian Electric Group Co., Ltd.",
        "summary": "Shanghai Guangdian Electric Group Co., Ltd. manufactures and sells electrical equipment in China. It provides switchgears; voltage core components, such as voltage circuit breakers and intelligent control terminal series; solar grid connection devices; and high-voltage frequency converter devices. The company offers its products under the SGEG, GE, AE, Honeywell, and AEG brands. Shanghai Guangdian Electric Group Co., Ltd. was founded in 1986 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201401",
        "website": "http://www.sgeg.cn",
        "full_time_employees": null
    },
    "603516.SS": {
        "short_name": "BEIJING TRICOLOR TECHNOLOGY CO ",
        "long_name": "Beijing Tricolor Technology Co., Ltd",
        "summary": "Beijing Tricolor Technology Co., Ltd manufactures and sells professional audio and video products worldwide. The company offers matrix switcher, video wall controller, KVM switches, signal transceiver, and accessories. Its products are used in multimedia video scenarios, such as command and control centers, conference rooms, big data centers, and exhibitions. Beijing Tricolor Technology Co., Ltd was founded in 2011 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100095",
        "website": "http://www.chinargb.com.cn",
        "full_time_employees": 600
    },
    "6036.HK": {
        "short_name": "APEX ACE HLDG",
        "long_name": "Apex Ace Holding Limited",
        "summary": "Apex Ace Holding Limited, an investment holding company, distributes semiconductors and other electronic components the People's Republic of China and internationally. The company operates through two segments: Digital Storage Products and General Components. It supplies digital storage products, including DRAM, flash, and MCP memory products for multimedia and mobile devices, such as set-top boxes, smart TVs, wearables devices, mobile phones, etc. The company also offers general electronic components comprising switches, connectors, passive components, main chips, sensors, power semiconductors, and analog-to-digital converters for use in the mobile and multimedia devices. In addition, it provides property holding, technical development, and related supporting services, as well as sells computer hardware and software, and accessories. The company was founded in 2005 and is headquartered in Kowloon, Hong Kong. Apex Ace Holding Limited is a subsidiary of Best Sheen Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://apexace.com",
        "full_time_employees": 128
    },
    "6118.TWO": {
        "short_name": "XANDER INTERNATIONAL CORP",
        "long_name": "Xander International Corp.",
        "summary": "Xander International Corp. sells information and commercial products in Taiwan. It offers audio and video multimedia products, DIY components, computer peripherals, computer systems, network/monitoring/software products, storage devices, transaction equipment, car/outdoor products, living appliances, and combination goods. The company was founded in 1997 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.xander.com.tw",
        "full_time_employees": null
    },
    "6123.TWO": {
        "short_name": "GRANDTECH C.G. SYSTEMS INC",
        "long_name": "GrandTech C.G. Systems Inc.",
        "summary": "GrandTech C.G. Systems Inc. operates as a distributor of graphics, imaging, and multimedia design software. The company distributes 2D and 3D professional software products; digital printing equipment and solutions; and IT software and hardware products for enterprises, as well as IT integration and cloud services. It operates in Taiwan, Hong Kong, China, Singapore, Malaysia, Indonesia, and internationally. The company was founded in 1991 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.grandtech.com",
        "full_time_employees": null
    },
    "6150.TWO": {
        "short_name": "TUL CORPORATION",
        "long_name": "TUL Corporation",
        "summary": "TUL Corporation develops and markets hardware solutions in IT industry worldwide. The company offers gaming and embedded graphics cards, SoC based mainboards and systems, FPGA products, thunderbolt adopters, and SSD storage solutions. It serves OEMs, distributors, VARs, and system integrators. The company was formerly known as C.P. Technologies and changed its name to TUL Corporation in March 2004. TUL Corporation was founded in 1997 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.tul.com.tw",
        "full_time_employees": null
    },
    "6154.TWO": {
        "short_name": "SUNFAR COMPUTER CO",
        "long_name": "Sunfar Computer Co., Ltd",
        "summary": "Sunfar Computer Co., Ltd sells various goods for consumers in Taiwan. It offers home appliances, personal computer hardware and peripheral equipment, computer supplies and consumables, computer software and books, consumer electronics and communications, etc., as well as OA merchandise and maintenance services. The company provides its products through 64 stores and online shopping platform. Sunfar Computer Co., Ltd was founded in 1982 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "80750",
        "website": "http://www.sunfar.com.tw",
        "full_time_employees": null
    },
    "6189.TW": {
        "short_name": "PROMATE ELECTRONIC CO",
        "long_name": "Promate Electronic Co.,Ltd.",
        "summary": "Promate Electronic Co.,Ltd. operates as a franchised distributor of semi-conductor products in Taiwan. The company distributes electronic components, such as integrated circuits for analog, communication, computer, consumer, display, and LED solutions; and value added design-in services for IT, industrial, communication, consumer electronic, and automotive industries. It also provides system integration solutions in the areas of software, optical, mechanical, and electrical engineering integration, as well as product development and manufacturing. In addition, the company offers consumer electronics, such as TFT LCD monitors and TVs, and Netbooks, as well as display and embedded solutions. Promate Electronic Co.,Ltd. was founded in 1986 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11442",
        "website": "http://www.promate.com.tw",
        "full_time_employees": null
    },
    "6192.TW": {
        "short_name": "LUMAX INTERNATIONAL CORP",
        "long_name": "Lumax International Corp., Ltd.",
        "summary": "Lumax International Corp., Ltd. engages in the wholesale of electronic materials in Taiwan and China. It sells and installs process-control devices or systems, as well as provides maintenance services. The company also offers process automation consultancy during plant buildup, hardware/system installation, project management, and control valve maintenance for petrochemical, electronic, steel, and other non-tech enterprises; hardware product portfolio for calibration, inspection, and maintenance of control valves, switch valves, measurement instruments, analyzing instruments, and others; and control valve repair services, Lumax valves, and VOC anti-leakage solutions. In addition, it provides telecommunication materials and electronic components. Further, the company engages in international and transit trade, warehousing, and processing activities; producing insulating materials, power supplies, and computer connectors with thermostat and bearing high pressure; and processing thermal transfer materials, tape materials, LCD, etc., as well as provides installation and maintenance services for valves and calibration instruments. Additionally, it manufactures and designs computer systems and measuring appliance industry automation instruments; installs mechanical and electrical equipment; imports and exports goods and technology products; and provides assembly, repair, and instrument calibration of mechanical/electrical products. Lumax International Corp., Ltd. was founded in 1975 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "115",
        "website": "http://www.elumax.com",
        "full_time_employees": null
    },
    "6227.TWO": {
        "short_name": "MACNICA GALAXY INC",
        "long_name": "Macnica Galaxy Inc.",
        "summary": "Macnica Galaxy Inc. distributes IC products and services in Taiwan and internationally. It offers software, artificial intelligence, and Internet of Things products, as well as semiconductors to customers in the cloud, Internet of Things, communication, industrial electronics, and automotive industries. The company was formerly known as Galaxy Far East Corporation and changed its name to Macnica Galaxy Inc. in July 2017. The company was founded in 1979 and is headquartered in New Taipei City, Taiwan. Macnica Galaxy Inc. is a subsidiary of Macnica Chungju Co., Ltd.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.macnica.com.tw",
        "full_time_employees": null
    },
    "6265.TWO": {
        "short_name": "KUEN CHAANG UPPERTECH CORP",
        "long_name": "Kuen Chaang Uppertech Corp.",
        "summary": "Kuen Chaang Uppertech Corp. engages in the electronic component channel business in Taiwan. It is also involved in the semiconductor business. The company was founded in 1987 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "231",
        "website": "http://www.kc-uppertech.com",
        "full_time_employees": null
    },
    "6638.T": {
        "short_name": "MIMAKI ENGINEERING CO.LTD",
        "long_name": "Mimaki Engineering Co., Ltd.",
        "summary": "Mimaki Engineering Co., Ltd. develops, manufactures, and sells computer devices and software in Japan and internationally. It offers inkjet printers, including roll to roll, print and cut, flat bed, hybrid, textile, and option printers; cutting plotters, such as roll to roll, flat bed, and apparel cutter plotters; laminators; desktop modeling plotters; and 3D printers. The company also provides software products comprising RIP software; software for color management; software products for cutting that consist of FineCut9, FineCut8, Simple POP, Simple Cut, and Simple Studio; and ArtiosCAD designer solution used in designing packages. Its products are used in smartphone case, glass, acrylic, sticker, magnet, stationery, novelty, apparel and textile, bottle, window film, and other items. The company was founded in 1975 and is headquartered in Tomi, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tomi",
        "zipcode": "389-0512",
        "website": "http://www.mimaki.com",
        "full_time_employees": null
    },
    "6776.TW": {
        "short_name": "WEBLINK INTERNATIONAL INC",
        "long_name": "Weblink International Inc.",
        "summary": "Weblink International, Inc. owns and operates stores that sell software and information technology products in Taiwan. Its stores offer commercial and home information electronics, application software products, digital entertainment products, system integration, lifestyle products, SMBs solution services etc. It also sells products online. The company was founded in 1997 and is based in Taipei, Taiwan. Weblink International, Inc. is a subsidiary of Acer Incorporated.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "100",
        "website": "http://www.weblink.com.tw",
        "full_time_employees": 282
    },
    "7513.T": {
        "short_name": "KOJIMA CO LTD",
        "long_name": "Kojima Co.,Ltd.",
        "summary": "Kojima Co., Ltd. sells and repairs/ constructs household and electric appliances. The company was formerly known as Kojima Denki K.K. and changed its name to Kojima Co., Ltd. in January 1993. The company was founded in 1963 and is headquartered in Utsunomiya, Japan. Kojima Co., Ltd. is a subsidiary of Bic Camera Inc.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Utsunomiya",
        "zipcode": "320-8528",
        "website": "http://www.kojima.net",
        "full_time_employees": 2634
    },
    "7537.T": {
        "short_name": "MARUBUN CORP",
        "long_name": "Marubun Corporation",
        "summary": "Marubun Corporation distributes electronics products in Japan and internationally. The company offers semiconductors and electronic devices, including memory and special use ICs, solar panels, micro-processors, connectors, ASICs, and displays, as well as standard logic, analog, software, discrete, and other devices. It also provides industrial manufacturing equipment comprising industrial robots, IC test handlers, embedded computers, plasma nano-processing equipment, and nanoimprint equipment; industrial inspection equipment comprising IC lead inspection systems, X-ray inspection systems, and reflow simulation equipment; and network and optical communication products that include network time servers, frequency standard products, and components for optical communication. In addition, the company offers lasers and optoelectronics, such as laser oscillators, laser diodes, laser processing systems, optical components, laser measurement equipment, lamps and optics, and laser sensors; measurement and sensor products, including acoustic and vibration measurement, and radio frequency measurement products, as well as partial discharge monitoring products for generators and motors; and aerospace and defense products, which include space equipment, geophysical equipment, microwave components, and simulator equipment. Marubun Corporation has a strategic collaboration with Ossia Inc. to bring Cota real wireless power technology to the Japanese market. Marubun Corporation was founded in 1844 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8577",
        "website": "http://www.marubun.co.jp",
        "full_time_employees": null
    },
    "7565.T": {
        "short_name": "MANSEI  CORP",
        "long_name": "Mansei Corporation",
        "summary": "Mansei Corporation provides electric powered machines in Japan. The company engages in the provision of support services for the development and maintenance of electronic devices and multimedia systems; and sale of video and information machines. It also offers semiconductor products, including high-density memory, one-chip microcomputers, gate arrays, ASICs, etc.; and software for system design and development. In addition, the company provides computers for FA, flexible production systems, related control units, CAD/CAM systems NC, robots for industrial use, etc.; and various total systems, as well as operates a training school. Further, it offers industrial components and equipment, which include drive control units, such as AC servos and inverters; controllers comprising sequencers; power distribution units consisting of circuit breakers and transformers; and rotary machines, including motors and industrial fans. Additionally, the company provides industrial automation machinery; various transport machines, such as elevators and escalators for buildings, condominiums, and public facilities; and equipment for shops, as well as housing related products. The company was founded in 1947 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "553-0003",
        "website": "http://www.mansei.co.jp",
        "full_time_employees": null
    },
    "7619.T": {
        "short_name": "TANAKA CO LTD",
        "long_name": "Tanaka Co.,Ltd.",
        "summary": "Tanaka Co.,Ltd. engages in the wholesale of electrical materials and appliances in Japan. It offers fluorescent and incandescent light fixtures, HID fixtures, explosion-proof fixtures, ventilation and duct fans, and LED fixtures; and high and low voltage power cables, communication cables, insulation cables, synthetic rubber wires, steel conduits, vinyl chloride pipes, synthetic resin flexible conduits, and various accessories. The company also provides high voltage power receiving equipment, power distribution boards, control equipment, wiring equipment, electric circuit equipment, communication equipment, disaster prevention equipment, and sound equipment. In addition, it offers home appliances, housing equipment, OA equipment, and solar power generation equipment; and concrete columns, steel pipe poles, wire materials, measuring equipment, power tools, security equipment, etc. The company was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "140-8543",
        "website": "http://www.tanakashoji.co.jp",
        "full_time_employees": null
    },
    "7C3.F": {
        "short_name": "COGOBUY GROUP DL-,0000001",
        "long_name": "Cogobuy Group",
        "summary": "Cogobuy Group operates as an e-commerce company serving the electronics manufacturing industry in the People's Republic of China and Hong Kong. It sells integrated circuits and other electronic components comprising microcontrollers/processors, sensors and converters, signal and interface products, amplifiers, filters, optoelectronic devices, resistors, inductors, discrete devices, connectors, switches, relays, circuit protection devices, development tools and systems, multimedia ICs, and dedicated and motor control ICs, as well as FPGA/CPLD, DSP, memory, wireless and RF, power management, capacitance, timer, and clock products. The company offers its products through its e-commerce platform, cogobuy.com, which includes a direct sales platform, as well as through an online marketplace, and a team of technical consultants and professional sales representatives. It also provides media communication and collaboration platforms and solutions; supply chain financing services; and develops e-commerce software technology. In addition, the company develops and sells electronic communication products; operates the INGDAN.com platform; and holds Internet content provider license. It serves electronics manufacturers, including small and medium enterprise, and blue-chip customers. The company was founded in 2000 and is headquartered in Shenzhen, the People's Republic of China. Cogobuy Group is a subsidiary of Envision Global Investments Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.cogobuy.com",
        "full_time_employees": 454
    },
    "8020.T": {
        "short_name": "KANEMATSU CORP",
        "long_name": "Kanematsu Corporation",
        "summary": "Kanematsu Corporation trades in commercial products worldwide. The company's Electronics & Devices segment offers electronic parts and components, semiconductor and LCD manufacturing equipment, materials and indirect materials, and development and proposal services; and deals with mobile communication terminals, mobile internet systems, information and telecommunication equipment, and security equipment and services. Its Foods & Grain segment provides cooked foods, processed fruits and agricultural products, beverage ingredients, animal and fishery products, wheat, rice, soybeans, feedstuff, and pet foods. The company's Steel, Materials & Plant segment trades in general steel products, crude oil, petroleum products, LPG, functional chemicals and food products, pharmaceuticals and pharmaceutical intermediates, and other products; undertakes plant and infrastructure development projects; and sells machine tools and industrial machinery, as well as operates in environmental and emissions rights business. Its Motor Vehicles & Aerospace segment primarily trades in aircrafts, helicopters, satellite and aerospace-related products, automobiles, motorcycles, industrial vehicles and related parts, construction machinery, etc. The company also develops software; and provides computers and computer peripherals, security cameras, mobile contents delivery and solutions, control modules for lithium ion batteries, home-construction materials, feeds and fertilizers, millet, grain, processed and health foods, oil well-related parts, defense products, general-purpose machinery, hay and roughage products, merchandise, and aircraft rotable components. In addition, it offers ground inspection and improvement, technical, cold storage, medical information, insurance agency, logistics, freight forwarding, and seed development and contract farming services. Kanematsu Corporation was founded in 1889 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8005",
        "website": "http://www.kanematsu.co.jp",
        "full_time_employees": 7182
    },
    "8023.T": {
        "short_name": "DAIKO DENSHI TSUSHIN CO",
        "long_name": "Daiko Denshi Tsushin, Ltd.",
        "summary": "Daiko Denshi Tsushin, Ltd. provides information technology solutions in Japan. It offers rBOM, a production management system for the manufacturing industry; PROCURESUITE, an indirect materials procurement support system; EdiGate/POST, a cloud-type WEB-EDI service; RetailFocus, an inventory management system for specialty stores; IOT/IOW; AppGuard, a security solution; i-Compass, a cloud-based information distribution solution; and D's Mobile, a mobile leased line service solution, as well as fishing cooperative economic systems. The company was founded in 1953 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "162-8565",
        "website": "http://www.daikodenshi.jp",
        "full_time_employees": null
    },
    "8045.HK": {
        "short_name": "NANDASOFT",
        "long_name": "Jiangsu NandaSoft Technology Company Limited",
        "summary": "Jiangsu NandaSoft Technology Company Limited, together with its subsidiaries, provides system integration services primarily in the People's Republic of China. It operates through four segments: Computer Hardware and Software Products; System Integration Service; Property Investment; and Online Education. The company also engages in the sale of computer hardware and software outsourcing products; trading of information technology related products and equipment; provision of information technology training services; and developing, manufacturing, and marketing of network security software, internet application software, education software, and business application software. In addition, it offers services related to building installation and information system integration; invests in properties; and researches and develops medicine and pharmaceutical equipment. Further, it provides properties management services, communication intelligence control systems, and online education services. The company was formerly known as Jiangsu NandaSoft Company Limited and changed its name to Jiangsu NandaSoft Technology Company Limited in September 2008. Jiangsu NandaSoft Technology Company Limited was incorporated in 1998 and is based in Nanjing, China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210036",
        "website": "http://www.nandasoft.com",
        "full_time_employees": 280
    },
    "8067.TWO": {
        "short_name": "GISH INTERNATIONAL CO",
        "long_name": "Gish International Co., Ltd",
        "summary": "Gish International Co., Ltd operates as a distribution company in Japan, Singapore, China, Canada, the United States, Australia, and Chile. It offers a range of products, including fragrances and beauty products. The company was founded in 1989 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.gish-int.com",
        "full_time_employees": null
    },
    "8068.TWO": {
        "short_name": "CHANDER ELECTRONICS CORP",
        "long_name": "Chander Electronics Corp.",
        "summary": "Chander Electronics Corp. engages in the distribution and maintenance of electronic components, integrated circuits, and design and test equipment. The company is also involved in the maintenance of computers and related spare parts; and analysis, planning, designing, development, import and export, distribution, and maintenance of computer and software systems. It also provides cloud services. The company was incorporated in 1997 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.chander.com.tw",
        "full_time_employees": null
    },
    "8070.TW": {
        "short_name": "CHANG WAH ELECTROMATERIALS INC",
        "long_name": "Chang Wah Electromaterials Inc.",
        "summary": "Chang Wah Electromaterials Inc. operates as an agency for packaging materials and equipment in Taiwan. The company offers various IC packaging materials; IC packaging devices, such as auto molding, trim and form, and package sawing equipment, as well as fluid dispensing systems; and TFT-LCD products. It also provides LED mold technology with liquid compound/compression mold and LED lead frames for ejection molding; EMC LED lead frames for transfer molding; and solar power systems. The company was founded in 1989 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "811",
        "website": "http://www.cwei.com.tw",
        "full_time_employees": null
    },
    "8093.T": {
        "short_name": "KYOKUTO BOEKI KAISHA",
        "long_name": "Kyokuto Boeki Kaisha, Ltd.",
        "summary": "Kyokuto Boeki Kaisha, Ltd., a technology-oriented trading firm, trades in basic industry products, electronic and control systems, and industrial materials in Japan and internationally. It offers electric instrumentation control systems and permanent-magnetic couplings to steel, non-ferrous metal, chemical, automotive, electronics, and electrical power industries; and equipment and technical services for the exploration, drilling, finishing, and production of natural resources, such as oil, natural gas, and geothermal energy, as well as develops carbon dioxide capture and storage, and methane hydrate. The company also provides mechanical parts, such as screws, springs, and spiral springs; aerospace equipment, laser equipment, and 3D scanning systems, and simulation systems and software packages with engineering and other services; and power operational amplifiers, linear ICs, electrostatic accelerators, thermal conductivity meters/dilatometers, seismometers, strain gauges, and telecommunication products, as well as various other advanced-technology products. In addition, it offers paints, plastics, metals, and related equipment primarily for automotive industry, as well as exports materials to China, Southeast Asia, and other countries; high-performance/intensity steel belts and belt equipment; advanced materials and fabrication technologies to conserve valuable resources; and food processing machinery for manufacturing ham and sausage, as well as deodorant roll towels to support food safety and environment. The company was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0004",
        "website": "http://www.kbk.co.jp",
        "full_time_employees": null
    },
    "8106.HK": {
        "short_name": "SHENGHUA LANDE",
        "long_name": "Shenghua Lande Scitech Limited",
        "summary": "Shenghua Lande Scitech Limited, an investment holding company, engages in the trading of hardware and computer software in the People's Republic of China. It also provides telecommunication solutions; smart city solutions; and e-commerce supply chain services. The company was formerly known as Zheda Lande Scitech Limited and changed its name to Shenghua Lande Scitech Limited in June 2017. The company was founded in 1996 and is based in Huzhou, the People's Republic of China. Shenghua Lande Scitech Limited is a subsidiary of Zhejiang Shenghua Holdings Group Company Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Huzhou",
        "zipcode": null,
        "website": "http://www.landpage.com.cn",
        "full_time_employees": 152
    },
    "8137.T": {
        "short_name": "SUN-WA TECHNOS CORP",
        "long_name": "Sun-Wa Technos Corporation",
        "summary": "Sun-Wa Technos Corporation engages in the distribution of electrical machinery, electronics, and general machinery in Japan, rest of Asia, Europe, the United States, and internationally. The company offers AC servo, linear, and various other motors; clean room robots and vacuum chamber robots for semiconductor manufacturing devices; inverters, power substations, other facility works, etc.; and factory automation (FA) equipment and systems, such as machine controllers and vision systems, power conditioners and supply devices, and electrical engineering works. It also sells power supplies, connectors, semiconductors, sensors, miniature fans, liquid crystal displays, touch panels, industrial PCs, CPU boards, memory modules, etc.; assembled boards; and optical components, including light emitting diodes, electronics components, office automation (OA) related equipment, FA systems, and telecommunications and information equipment, as well as electric components and traffic control systems for railroad trains. In addition, the company offers general machinery products, such as industrial robots, clean room robots, semiconductor and liquid crystal related manufacturing equipment, conveying devices and facilities for logistics, substrate mounting devices, various inspection devices, environmental related equipment and devices, air conditioners and kitchen facilities, wind- and hydro-power equipment, and nursing care and medical equipment, as well as maintenance services. Its products are used in various fields, such as Internet of Things, food, and pharmaceutical industries. The company was formerly known as Yamada Kogyo Corporation and changed its name to Sun-Wa Technos Corporation in April 1993. Sun-Wa Technos Corporation was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0031",
        "website": "http://www.sunwa.co.jp",
        "full_time_employees": null
    },
    "8140.T": {
        "short_name": "RYOSAN CO LTD",
        "long_name": "Ryosan Company, Limited",
        "summary": "Ryosan Company, Limited, an electronics trading company, engages in the sale of semiconductors, and electronic components and equipment in Japan and internationally. It sells semiconductor products, including microcontrollers, analog and power devices, compound devices, system LSIs, DRAM, and other products; and electronic components, such as display devices, power supplies, and electromechanical components comprising LCDs, power supplies/batteries, passive components, sensors, electronic circuit boards, and others. The company also offers electronic equipment products comprising servers, industrial computers, and PCs; embedded systems; and sputtering devices, as well as laser machining, etching, CVD, deposition, vacuum drying, and various second-hand equipment to customers manufacturing semiconductors, electronic components, and lithium-ion batteries. In addition, it provides consigned processing services to customers in selling various target materials, EMIs for smartphone and tablet devices, thermal solutions, and water-resistant products; and various solutions. Ryosan Company, Limited was incorporated in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0031",
        "website": "http://www.ryosan.co.jp",
        "full_time_employees": null
    },
    "8141.T": {
        "short_name": "SHINKO SHOJI CO",
        "long_name": "Shinko Shoji Co., Ltd.",
        "summary": "Shinko Shoji Co., Ltd. deals in electric motors and transformers in Japan and internationally. It operates through Electronic Components Business, Assembly Business, and Other Business segments. The company offers electronic components, including integrated circuits, semiconductor chips, circuit components, LCD products, and other electronic parts, as well as assembly products. It also develops embedded software products; and undertakes ASIC/FPGA design and development projects on a contract basis, as well as offers AIplay, an aerial image manipulation device. In addition, the company provides EMS and device solutions; embedded and Internet of things solutions; and parts and systems for the amusement industry. The company was founded in 1953 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-8540",
        "website": "http://www.shinko-sj.co.jp",
        "full_time_employees": null
    },
    "8154.T": {
        "short_name": "KAGA ELECTRONICS CO",
        "long_name": "Kaga Electronics Co.,Ltd.",
        "summary": "Kaga Electronics Co., Ltd. sells electronics parts, semiconductors, PCs, and peripherals in Japan, North America, Europe, and Asia. It offers semiconductors, generic electronic parts, LEDs, sensors, and liquid crystal panels; amusement machines and software; and PCs and PC peripherals to electronics mass retailers, schools, and educational institutions, as well as electronics design manufacturing services. The company also provides communication, information processing and industrial equipment, application boards, embedded software of microcomputers, application integrated circuits, safety and earth leakage breakers/DC switches/in-vehicle electric products, and cell packs. In addition, it produces commercials, movies, and animations, as well as various original content using computer graphics technology; offers PC reuse and recycling services; retails and wholesales golf supplies; and produces, develops, distributes, and sells game software. Further, the company constructs and maintains local area network systems and energy systems for corporations and government agencies; develops and manufactures IoT devices, such as security sensors and AI cameras for home and town security; sells home electric appliances, sports goods, and other activities; photograph and imaging products, original brand, and other products; IT-related products for schools and other educational institutions; develops medical devices for diagnosis and treatment; and repairs electronics equipment. The company was founded in 1968 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-8629",
        "website": "http://www.taxan.co.jp",
        "full_time_employees": null
    },
    "9824.T": {
        "short_name": "SENSHU ELECTRIC CO",
        "long_name": "Senshu Electric Co.,Ltd.",
        "summary": "Senshu Electric Co., Ltd. operates as an electric trading company in Japan and internationally. It develops, sells, and consults information processing systems and communication systems. The company also manufactures and sells electronic control equipment and devices; and installs and sells air conditioning equipment, household electrical appliances, and office equipment. In addition, it is involved in the operation and management of power generation business; and sale and purchase of electricity. Further, the company engages in the real estate leasing business. Additionally, it offers equipment, communication, firefighting, heat resistant, network, thermocouple/compensated lead, instrumentation, and magnet wires. The company also provides power, control, signal, and various eco cables, as well as lightning rod, bare copper, and insulated wires; overseas standard cable, electric wire for robot, and electric wire for movement; and peripheral equipment, LAN, optical communications, and wire processing and network construction, as well as system solutions. The company was founded in 1922 and is headquartered in Suita, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Suita",
        "zipcode": "564-0044",
        "website": "http://www.senden.co.jp",
        "full_time_employees": 712
    },
    "9880.T": {
        "short_name": "INNOTECH CORP (JAPAN)",
        "long_name": "Innotech Corporation",
        "summary": "Innotech Corporation, together with its subsidiaries, imports and sells electronic design automation software, electric components, and semiconductor products. The company also develops and sells testers and CPU boards. Its products include industrial boards/systems, rugged boards/systems, EDA and OrCAD software, servers/storage solutions, noise analysis solutions, model based development solutions, media analysis and BI solutions, and testers/probe cards. Innotech Corporation was incorporated in 1976 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "222-8580",
        "website": "http://www.innotech.co.jp",
        "full_time_employees": 1428
    },
    "9S2.F": {
        "short_name": "MIDWICH GROUP PLC  LS-,01",
        "long_name": "Midwich Group plc",
        "summary": "Midwich Group plc, together with its subsidiaries, engages in the distribution of audio visual (AV) solutions to the trade customers in the United Kingdom, Ireland, Europe, the Middle East, Africa, Asia Pacific, and North America. Its products support various AV categories, such as displays, projectors, audio, video, and digital signage, as well as lighting and unified communications. The company also distributes professional broadcast equipment; and provides logistics services. It serves professional AV integrators and IT resellers in corporate, education, retail, residential, and hospitality sectors. The company was formerly known as Jade 320 Limited and changed its name to Midwich Group Plc in April 2016. Midwich Group plc was founded in 1976 and is based in Diss, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Diss",
        "zipcode": "IP22 4YT",
        "website": "http://www.midwichgroupplc.com",
        "full_time_employees": 1000
    },
    "9V2.F": {
        "short_name": "KAGA EL. CO. LTD",
        "long_name": "Kaga Electronics Co.,Ltd.",
        "summary": "Kaga Electronics Co., Ltd. sells electronics parts, semiconductors, PCs, and peripherals in Japan, North America, Europe, and Asia. It offers semiconductors, generic electronic parts, LEDs, sensors, and liquid crystal panels; amusement machines and software; and PCs and PC peripherals to electronics mass retailers, schools, and educational institutions, as well as electronics design manufacturing services. The company also provides communication, information processing and industrial equipment, application boards, embedded software of microcomputers, application integrated circuits, safety and earth leakage breakers/DC switches/in-vehicle electric products, and cell packs. In addition, it produces commercials, movies, and animations, as well as various original content using computer graphics technology; offers PC reuse and recycling services; retails and wholesales golf supplies; and produces, develops, distributes, and sells game software. Further, the company constructs and maintains local area network systems and energy systems for corporations and government agencies; develops and manufactures IoT devices, such as security sensors and AI cameras for home and town security; sells home electric appliances, sports goods, and other activities; photograph and imaging products, original brand, and other products; IT-related products for schools and other educational institutions; develops medical devices for diagnosis and treatment; and repairs electronics equipment. The company was founded in 1968 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-8629",
        "website": "http://www.taxan.co.jp",
        "full_time_employees": null
    },
    "9VD.F": {
        "short_name": "EMERGENCE GLOBAL ENTERPR.",
        "long_name": "Emergence Global Enterprises Inc.",
        "summary": "Emergence Global Enterprises Inc. does not have significant operations. Previously, it was engaged in the sale of computer systems and related components primarily to defense contractors and federal government end-users in the United States. The company was formerly known as Velocity Data Inc. and changed its name to Emergence Global Enterprises Inc. in February 2020. Emergence Global Enterprises Inc. was founded in 1989 and is based in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6H 3X8",
        "website": null,
        "full_time_employees": null
    },
    "ACCL.TA": {
        "short_name": "ACCEL SOLUTIONS GR",
        "long_name": "Accel Solutions Group Ltd",
        "summary": "Accel Solutions Group Ltd engages in real estate development business in Ethiopia, Israel, and New York, the United States. The company also promotes and enhances technological projects in the areas of life sciences and cleantech; and engages in sorting and marketing of edible chicken eggs. It provides its products through retail chains and distributors. The company was founded in 1971 and is headquartered in Ramat Gan, Israel. Accel Solutions Group Ltd is a subsidiary of Ultra Equity Investments Ltd.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ramat Gan",
        "zipcode": "52520",
        "website": "http://www.accel.co.il",
        "full_time_employees": 25
    },
    "AEY": {
        "short_name": "ADDvantage Technologies Group, ",
        "long_name": "ADDvantage Technologies Group, Inc.",
        "summary": "ADDvantage Technologies Group, Inc., through its subsidiaries, distributes and services electronics and hardware for the telecommunications industry in the United States, Canada, Central America, Asia, Europe, Mexico, South America, and internationally. The company operates through two segments, Wireless Infrastructure Services and Telecommunications. The Wireless Infrastructure Services segment provides turn-key wireless infrastructure services for U.S. wireless carriers, communication tower companies, national integrators, and original equipment manufacturers. This segment also offers installation, upgradation, and maintenance of technology on cell sites; and the construction of new small cells for 5G. The Telecommunications segment provides central office equipment that include optical transport, switching, and data center equipment for communication networks; customer premise equipment, such as integrated access devices, channel banks, Internet protocol private branch exchange phones, and routers; and decommissioning services for surplus and obsolete telecom equipment. The company was formerly known as ADDvantage Media Group, Inc. and changed its name to ADDvantage Technologies Group, Inc. in December 1999. ADDvantage Technologies Group, Inc. was incorporated in 1989 and is headquartered in Carrollton, Texas.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Carrollton",
        "zipcode": "75007",
        "website": "http://www.addvantagetechnologies.com",
        "full_time_employees": 123
    },
    "AJA-R.BK": {
        "short_name": "AJ ADVANCE TECHNOLOGY PUBLIC CO",
        "long_name": "AJ Advance Technology Public Company Limited",
        "summary": "AJ Advance Technology Public Company Limited, together with its subsidiaries, engages in the wholesale and retail of electric appliances under the AJ brand in Thailand. It retails and wholesales audio and visual products, home appliances, mobile phones, and accessories. The company also provides top-up services for prepaid phone and service prepaid kiosks. In addition, it is also involved in the distribution of sport shoes; retail of top-up machines; logistic and export business, including TV drama programs and other entertainment media businesses; and provision of e-money services and accept payment through electronic methods. The company was formerly known as Crown Tech Advance Public Company Limited and changed its sport shoes name to AJ Advance Technology Public Company Limited in June 2017. AJ Advance Technology Public Company Limited was founded in 2001 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10150",
        "website": "http://www.ajthai.com",
        "full_time_employees": null
    },
    "AJA.BK": {
        "short_name": "AJ ADVANCE TECHNOLOGY PUBLIC CO",
        "long_name": "AJ Advance Technology Public Company Limited",
        "summary": "AJ Advance Technology Public Company Limited, together with its subsidiaries, engages in the wholesale and retail of electric appliances under the AJ brand in Thailand. It retails and wholesales audio and visual products, home appliances, mobile phones, and accessories. The company also provides top-up services for prepaid phone and service prepaid kiosks. In addition, it is also involved in the distribution of sport shoes; retail of top-up machines; logistic and export business, including TV drama programs and other entertainment media businesses; and provision of e-money services and accept payment through electronic methods. The company was formerly known as Crown Tech Advance Public Company Limited and changed its sport shoes name to AJ Advance Technology Public Company Limited in June 2017. AJ Advance Technology Public Company Limited was founded in 2001 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10150",
        "website": "http://www.ajthai.com",
        "full_time_employees": null
    },
    "ALINN.PA": {
        "short_name": "INNELEC MULTIMEDIA",
        "long_name": "Innelec Multimédia SA",
        "summary": "Innelec MultimÃ©dia SA distributes various multimedia products in Europe, Africa, Oceania, and internationally. It offers console and PC games; games consoles; gaming accessories; mobility accessories, such as chargers, power bank, Bluetooth speakers, selfie sticks, travel adapters, USB micro cables, lightning cable, and waterproof cases; spin-off products; urban mobility and connected products; storage and audio accessories; and utility and professional software. Innelec MultimÃ©dia SA primarily sells its products to the retailers. The company was founded in 1983 and is based in Pantin, France.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Pantin",
        "zipcode": "93692",
        "website": "http://corporate.innelec.com",
        "full_time_employees": 96
    },
    "ALLGO.PA": {
        "short_name": "LARGO",
        "long_name": "Largo SA",
        "summary": "Largo SA refurbishes smartphones, tablets, and laptops in France. The company was founded in 2016 and is headquartered in Sainte-Luce-Sur-Loire, France.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Sainte-Luce-sur-Loire",
        "zipcode": "44980",
        "website": "http://www.largo-france.fr",
        "full_time_employees": 38
    },
    "AMO.AX": {
        "short_name": "AMBERTECH FPO",
        "long_name": "Ambertech Limited",
        "summary": "Ambertech Limited, together with its subsidiaries, provides various technologies for the professional and consumer audio/visual markets in Australia and New Zealand. It operates through Professional, Lifestyle Entertainment, and New Zealand segments. The company distributes high technology equipment to professional broadcast, film, recording, and sound reinforcement industries; home theatre products to dealers; projection and display products for business and domestic applications; and custom installation components for home theatre, and commercial installations to dealers and consumers. Its home entertainment products include home cinema and theatre systems, Hi-Fi, and personal audio solutions; speakers, sound bars, and headphones; remote controls and antennas; and connectors, cables, and accessories. The company's professional performance equipment comprise live sound and video production solutions, music equipment, recording equipment and microphones, and video editing and post production systems. It also offers content creation, acquisition, deliver, processing, and asset management for broadcast and media in the areas of production systems, data management, video delivery, infrastructure hardware, cloud and IP video, post, remote operations, and workflow management. In addition, the company offers acoustic panels, amplifiers, audio preamps and matrix controllers, cameras, cases, guitars, hearing augmentation products, microphones, networking products, projectors, receivers, screens, sound level meters, speakers, speech transfer and tour guide systems, vocal and instrument processors, racks, studio and stage products, and audio video content players and recorders; and commercial and residential installation services. It operates through a network of dealers. The company was founded in 1987 and is based in Warriewood, Australia.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Warriewood",
        "zipcode": "2102",
        "website": "http://www.ambertech.com.au",
        "full_time_employees": 125
    },
    "ARENA.IS": {
        "short_name": "ARENA BILGISAYAR",
        "long_name": "Arena Bilgisayar Sanayi ve Ticaret A.S.",
        "summary": "Arena Bilgisayar Sanayi ve Ticaret A.S. engages in the distribution of technology products in Turkey. It offers desktops, notebooks, printers, supplies, monitors, projections, memory cards, USB flash drives, SSDs, external and internal disc, DVD RWs, motherboards, graphic cards, workstations, thin client computers, wireless networks and ADSL, PC memory products, and accessories. The company also offers Bulutum.com, an end-to-end cloud services platform with pre-sales and post-sales technical support, training, and payment facilities that helps business partners to create business opportunities at software and managed services; Pencere.com, a communication and interaction portal; Paynet that provides payment, collection, and financial solutions to B2B, B2B2C, and B2C companies in various sectors, such as construction materials, marine materials, paint, health equipment, musical instruments, machinery, spare automotive parts, and others; and financial solutions. In addition, it provides Tencer-e.com, a communication and interaction portal that manages technical services and current account operations; and automation and IOT services. Further, the company is involved in the wholesale trading of mobile phones and other mobile devices; and online electronics retail and marketplace businesses. Arena Bilgisayar Sanayi ve Ticaret A.S. was founded in 1991 and is headquartered in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34077",
        "website": "http://www.arena.com.tr",
        "full_time_employees": 265
    },
    "ARH.JO": {
        "short_name": "ARB Holdings Limited",
        "long_name": "ARB Holdings Limited",
        "summary": "ARB Holdings Limited, an investment and property holding company, engages in the trading and distribution of electrical, lighting, and related products. It operates through Electrical, Lighting, and Corporate divisions. The company provides power and instrumentation cables, overhead line hardware and conductors, and general low-voltage products to large and heavy industry, government and parastatals, construction, mining, electrical contractor, domestic/do-it-yourself (DIY), and export markets. It also imports and distributes energy saving, LED, and fluorescent lamps; light fittings; commercial and project lighting products; and a range of electrical accessories, as well as fans and lighting components to retail chains, independent DIY chains, hardware stores, specialized lighting shops, and electrical wholesalers. In addition, the company offers IT hardware and software, and support services, as well as holds and rents a portfolio of 16 properties. ARB Holdings Limited was founded in 1980 and is based in Durban, South Africa.",
        "currency": "ZAc",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Durban",
        "zipcode": "4133",
        "website": "http://www.arbhold.co.za",
        "full_time_employees": null
    },
    "ARMDA.IS": {
        "short_name": "ARMADA BILGISAYAR",
        "long_name": "Armada Bilgisayar Sistemleri Sanayi ve Ticaret A.S.",
        "summary": "Armada Bilgisayar Sistemleri Sanayi ve Ticaret A.S. operates as a distributor in the information technology sector in Turkey. It offers IT products and solutions to end users through business partners. The company was founded in 1989 and is based in Istanbul, Turkey. Armada Bilgisayar Sistemleri Sanayi ve Ticaret A.S. is a subsidiary of Aptec Holdings Limited.",
        "currency": "TRY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34030",
        "website": "http://www.armada.com.tr",
        "full_time_employees": 165
    },
    "ARW.DE": {
        "short_name": "ARROW EL. INC.  DL 1",
        "long_name": "Arrow Electronics, Inc.",
        "summary": "Arrow Electronics, Inc. provides products, services, and solutions to industrial and commercial users of electronic components and enterprise computing solutions in Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates in two segments, Global Components and Global Enterprise Computing Solutions. The Global Components segment markets and distributes semiconductor products and related services; passive, electro-mechanical, and interconnect products consisting primarily of capacitors, resistors, potentiometers, power supplies, relays, switches, and connectors; and computing and memory products, as well as other products and services. The Global Enterprise Computing Solutions segment offers computing solutions, including data-center, cloud, security, and analytics solutions, as well as access to various services, including engineering and integration support, warehousing and logistics, marketing resources, and authorized hardware and software training. The company serves original equipment manufacturers, value-added resellers, as well as manages service providers, contract manufacturers, and other commercial customers. Arrow Electronics, Inc. was founded in 1935 and is based in Centennial, Colorado.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "CO",
        "city": "Centennial",
        "zipcode": "80112",
        "website": "http://www.arrow.com",
        "full_time_employees": 19600
    },
    "ARW.F": {
        "short_name": "ARROW EL. INC.  DL 1",
        "long_name": "Arrow Electronics, Inc.",
        "summary": "Arrow Electronics, Inc. provides products, services, and solutions to industrial and commercial users of electronic components and enterprise computing solutions in Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates in two segments, Global Components and Global Enterprise Computing Solutions. The Global Components segment markets and distributes semiconductor products and related services; passive, electro-mechanical, and interconnect products consisting primarily of capacitors, resistors, potentiometers, power supplies, relays, switches, and connectors; and computing and memory products, as well as other products and services. The Global Enterprise Computing Solutions segment offers computing solutions, including data-center, cloud, security, and analytics solutions, as well as access to various services, including engineering and integration support, warehousing and logistics, marketing resources, and authorized hardware and software training. The company serves original equipment manufacturers, value-added resellers, as well as manages service providers, contract manufacturers, and other commercial customers. Arrow Electronics, Inc. was founded in 1935 and is based in Centennial, Colorado.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CO",
        "city": "Centennial",
        "zipcode": "80112",
        "website": "http://www.arrow.com",
        "full_time_employees": 19600
    },
    "ARW": {
        "short_name": "Arrow Electronics, Inc.",
        "long_name": "Arrow Electronics, Inc.",
        "summary": "Arrow Electronics, Inc. provides products, services, and solutions to industrial and commercial users of electronic components and enterprise computing solutions in Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates in two segments, Global Components and Global Enterprise Computing Solutions. The Global Components segment markets and distributes semiconductor products and related services; passive, electro-mechanical, and interconnect products consisting primarily of capacitors, resistors, potentiometers, power supplies, relays, switches, and connectors; and computing and memory products, as well as other products and services. The Global Enterprise Computing Solutions segment offers computing solutions, including data-center, cloud, security, and analytics solutions, as well as access to various services, including engineering and integration support, warehousing and logistics, marketing resources, and authorized hardware and software training. The company serves original equipment manufacturers, value-added resellers, as well as manages service providers, contract manufacturers, and other commercial customers. Arrow Electronics, Inc. was founded in 1935 and is based in Centennial, Colorado.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Centennial",
        "zipcode": "80112",
        "website": "http://www.arrow.com",
        "full_time_employees": 19600
    },
    "AVT": {
        "short_name": "Avnet, Inc.",
        "long_name": "Avnet, Inc.",
        "summary": "Avnet, Inc., a technology solutions company, markets, sells, and distributes electronic components. The company operates through two segments, Electronic Components and Farnell. The Electronic Components segment markets, sells, and distributes semiconductors; interconnect, passive, and electromechanical devices; and other integrated components from electronic component manufacturers. It also offers design chain support that provides engineers with technical design solutions; engineering and technical resources to support product design, bill of materials development, and technical education and training; and supply chain solutions that provide support and logistical services to original equipment manufacturers, electronic manufacturing service providers, and electronic component manufacturers. In addition, this segment provides integrated solutions, such as technical design, integration, and assembly of embedded products, and systems and solutions primarily for industrial applications, as well as for intelligent embedded and innovative display solutions comprising touch and passive displays. Further, it develops and manufactures standard board and industrial subsystems, and application-specific devices that enable it to produce systems tailored to specific customer requirements. This segment serves various markets, including automotive, medical, defense, aerospace, telecommunications, industrial, and digital editing. The Farnell segment distributes kits, tools, and electronic and industrial automation components, as well as test and measurement products to engineers and entrepreneurs. It has operations in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Avnet, Inc. was founded in 1921 and is headquartered in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85034",
        "website": "http://www.avnet.com",
        "full_time_employees": 14600
    },
    "AWZ.SI": {
        "short_name": "Multi-Chem",
        "long_name": "Multi-Chem Limited",
        "summary": "Multi-Chem Limited, an investment holding company, distributes information technology products in Singapore, the People's Republic of China, Australia, and internationally. It operates in two segments, PCB Business and IT Business. The company provides distributes hardware and software relating to internet and network products, as well as related installation, technical, and maintenance services. In addition, it offers PCB manufacturing services, such as precision drilling services to PCB fabricators. Further, the company distributes a range of specialty chemicals for surface treatment, electroless copper plating, tin/tin lead stripping, and micro-etching; and supplies PCB-related materials and equipment, including plating systems, pulse rectifiers for copper plating, copper and tin anodes for electroplating, entry and back-up materials for drilling, non-woven brushes, dry film and liquid photoresist products, CCL and prepreg products, tacky rollers, tack cloth/wipes, and cleaning machines to remove foreign particles on PCBs. Additionally, it rents machines, as well as offers software consultancy and implementation services; and IT training courses. Multi-Chem Limited was incorporated in 1985 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "609966",
        "website": "http://www.multichem.com.sg",
        "full_time_employees": 537
    },
    "B26.SI": {
        "short_name": "Ban Leong",
        "long_name": "Ban Leong Technologies Limited",
        "summary": "Ban Leong Technologies Limited, together with its subsidiaries, engages in the wholesale and distribution of computer peripherals, accessories, and other multimedia products in Singapore and internationally. It operates through three segments: Multimedia, Data storage, and IT accessories. The Multimedia segment offers audio and visual products, such as ear phones, speakers, cameras, and commercial and consumer displays. The Data Storage segment provides storage of data, such as cloud drives, HDD enclosures, and Blu-ray and portable DVD-RW. The IT Accessories segment offers PC-related accessories, including computer systems, components, peripherals, and printers, as well as mobile products, such as wearables, accessories, and powerpacks. It also provides smart home and robotics solutions. The company distributes its products through e-commerce; retailers and chain stores; and directly to commercial resellers and system integrators. Ban Leong Technologies Limited was incorporated in 1993 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408825",
        "website": "http://www.banleong.com",
        "full_time_employees": 218
    },
    "BDF.SI": {
        "short_name": "Excelpoint",
        "long_name": "Excelpoint Technology Ltd.",
        "summary": "Excelpoint Technology Ltd., an investment holding company, provides electronic components, and engineering design, and supply chain management services. The company is involved in the trading of electronic components; and provision of marketing and technical support services. It offers wireless connectivity and DSP audio enhancement implementation solutions that are used in portable wireless speakers, wireless music headphones, mini combos, sound bar and wireless subwoofers, and audio transmitter dongles; wearable devices and accessories for iPhone and iPad; solutions of Bluetooth enabled massage chairs and lost-and-found tags; and entry-level and mid-tier platforms for wearables and smart accessories applications. The company also provides automotive solutions, including the development of reference car infotainment systems and core boards, which support GPS for navigation, video playback, Bluetooth headset and handfree, Bluetooth music streaming, rearview camera, etc.; connectivity solutions, such as BLE, Bluetooth, BLE/Bluetooth combo, embedded Wi-Fi, and sub-Ghz modules for smart homes; headset solutions; Qualcomm, a smart audio platform; and electric power quality analyzer systems. In addition, it offers Internet of Things solutions for smart buildings, smart agriculture and smart infrastructure. It serves original equipment manufacturers, original design manufacturers, and electronics manufacturing service providers in Hong Kong, the People's Republic of China, Southeast Asia, India, and internationally. The company was founded in 1987 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "486057",
        "website": "http://www.excelpoint.com",
        "full_time_employees": 650
    },
    "BDR.SI": {
        "short_name": "Willas-Array",
        "long_name": "Willas-Array Electronics (Holdings) Limited",
        "summary": "Willas-Array Electronics (Holdings) Limited, an investment holding company, distributes electronic components for industrial, audio and video, telecommunication, home appliances, lighting, electronic manufacturing, and automotive segments. The company distributes automotive, infotainment, internet of things, motor control, SMPS, smart LED products, etc. It also provides technical solutions, including wireless module, automotive, motor control, smart meter, white goods, power/LED lighting, and audio solutions. In addition, the company engages in the property holding activities; and provision of transportation, and management and consultancy services. The company operates in the Northern China Region, Southern China Region, and Taiwan. Willas-Array Electronics (Holdings) Limited was founded in 1981 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.willas-array.com",
        "full_time_employees": 361
    },
    "BE.MI": {
        "short_name": "BEGHELLI",
        "long_name": "Beghelli S.p.A.",
        "summary": "Beghelli S.p.A. manufactures and sells various energy saving lighting products, electronic systems for domestic and industrial safety, and components for the photovoltaic power production in Italy and other European countries. It offers emergency luminaires, exit signs, LED modules with inverters, inverters, ceiling suspended systems, downlights, indoor and outdoor louvres, industrial and street lightings, projectors, floodlights, row systems, reglettes, and portable lights, as well as anti black-out and LED lamps; and building automation emergency, recessed and ceiling, and wall and ceiling products. The company also provides drinking water treatment, portable lights, batteries, and S.O.S. products. In addition, it offers helpline, after-sale, and case study services. The company was founded in 1982 and is based in Monteveglio, Italy.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "BO",
        "city": "Monteveglio",
        "zipcode": "40053",
        "website": "http://www.beghelli.com",
        "full_time_employees": 1160
    },
    "BLUE.JK": {
        "short_name": "Berkah Prima Perkasa Tbk.",
        "long_name": "PT Berkah Prima Perkasa Tbk",
        "summary": "PT Berkah Prima Perkasa Tbk engages in trading and printing businesses in Indonesia. PT Berkah Prima Perkasa Tbk was founded in 2014 and is based in North Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Utara",
        "zipcode": null,
        "website": "http://www.blueprint-indonesia.com",
        "full_time_employees": 57
    },
    "BRMG.TA": {
        "short_name": "BRIMAG DIGITAL AGE",
        "long_name": "Brimag Digital Age Ltd.",
        "summary": "Brimag Digital Age Ltd. imports, markets, and distributes home appliances and commercial air conditioning systems in Israel. It operates through Commercial Systems Sector and Household Products Sector segments. The company markets household refrigerators, freezers, washing machines, dryers, dishwashers, queues, stoves, etc.; home electronics products, including smart TVs, VR glasses, video cameras, and audio systems; and small electrical appliances, such as vacuum cleaners, coffee makers, microwave ovens, food processors and mixers, wireless telephones, and telephones, toasters, ovens, irons, electric kettles, toiletries, and other products. It also provides warranty, maintenance, and repair services. The company sells its products under the under company-owned brands comprising CHROMEX, GRAETZ LENCO, DRAGON, and HOME. Brimag Digital Age Ltd. was incorporated in 1993 and is based in Azor, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Azor",
        "zipcode": "58001",
        "website": "http://www.brimag.co.il",
        "full_time_employees": 344
    },
    "C04.SI": {
        "short_name": "Casa",
        "long_name": "Casa Holdings Limited",
        "summary": "Casa Holdings Limited, an investment holding company, distributes home and cooking appliances, kitchen and bathroom fixtures, and accessories in Southeast Asia, South Asia, North Africa, the Middle East, and internationally. It operates through two segments, Trading and Property Development. The company offers hobs, cooker hoods, ovens, microwave ovens, washers, dryers, dishwashers, washing machines, tumble dryers, and fridges under the EF and ELBA brand names; washing machine under the Beko brand; wine coolers under the CHATEAU brand; kitchen sinks, faucets, mirror cabinets, showers, and bathroom accessories under the Rubine brand; bath tubs and shower trays under the BLB brand; and water heaters under the Ferroli brand. It also develops and constructs residential and commercial properties. Casa Holdings Limited was founded in 1976 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "628884",
        "website": "http://www.casaholdings.com.sg",
        "full_time_employees": null
    },
    "CNXN": {
        "short_name": "PC Connection, Inc.",
        "long_name": "PC Connection, Inc.",
        "summary": "PC Connection, Inc., together with its subsidiaries, provides a range of information technology (IT) solutions. The company operates through three segments: Business Solutions, Enterprise Solutions, and Public Sector Solutions. It offers IT products, including computer systems, data center solutions, software and peripheral equipment, networking communications, and other products and accessories, as well as provides services, such as design, configuration, and implementation of IT solutions. The company markets its products and services through its websites comprising connection.com, connection.com/enterprise, connection.com/publicsector, and macconnection.com. It serves small to medium-sized businesses (SMBs) that include small office/home office customers; government and educational institutions; and medium-to-large corporate accounts through outbound telemarketing and field sales, and marketing programs targeted to specific customer populations, as well as through digital, web, and print media advertising. The company was founded in 1982 and is headquartered in Merrimack, New Hampshire.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NH",
        "city": "Merrimack",
        "zipcode": "03054-4631",
        "website": "http://www.connection.com",
        "full_time_employees": 2598
    },
    "COM7-R.BK": {
        "short_name": "COM7 PUBLIC COMPANY LIMITED",
        "long_name": "Com7 Public Company Limited",
        "summary": "Com7 Public Company Limited, together with its subsidiaries, sells IT products, mobiles, and accessories in Thailand. The company also develops computer software; provides repair and other services, as well as training services; and offers ICT infrastructure solutions. In addition, it engages in distribution activities. The company offers products through its retail outlets. Com7 Public Company Limited is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10260",
        "website": "http://www.comseven.com",
        "full_time_employees": null
    },
    "COMAN-R.BK": {
        "short_name": "COMANCHE INTERNATIONAL PUBLIC C",
        "long_name": "Comanche International Public Company Limited",
        "summary": "Comanche International Public Company Limited, together with its subsidiaries, provides information technology solutions for hotels and serviced apartments. It offers hospitality industry management systems with integrated modules, such as front office, point of sale, call accounting, back office with accounts payable, accounts receivable, general ledger, and inventory control. The company also sells computers and computer software, as well as provides maintenance services and other services relating to computer software. It operates in Thailand, Myanmar, Vietnam, Laos, Australia, Cambodia, Hong Kong, Macau, China, Japan, Indonesia, the Philippines, Maldives, Malaysia, Taiwan, India, Sri Lanka, and Singapore. The company was incorporated in 2003 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10310",
        "website": "http://www.comancheinternational.com",
        "full_time_employees": null
    },
    "COMAN.BK": {
        "short_name": "COMANCHE INTERNATIONAL PUBLIC C",
        "long_name": "Comanche International Public Company Limited",
        "summary": "Comanche International Public Company Limited, together with its subsidiaries, provides information technology solutions for hotels and serviced apartments. It offers hospitality industry management systems with integrated modules, such as front office, point of sale, call accounting, back office with accounts payable, accounts receivable, general ledger, and inventory control. The company also sells computers and computer software, as well as provides maintenance services and other services relating to computer software. It operates in Thailand, Myanmar, Vietnam, Laos, Australia, Cambodia, Hong Kong, Macau, China, Japan, Indonesia, the Philippines, Maldives, Malaysia, Taiwan, India, Sri Lanka, and Singapore. The company was incorporated in 2003 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10310",
        "website": "http://www.comancheinternational.com",
        "full_time_employees": null
    },
    "COMPINFO.NS": {
        "short_name": "COMPUAGE INFOCOM L",
        "long_name": "Compuage Infocom Limited",
        "summary": "Compuage Infocom Limited, an information technology (IT) and mobility distribution company, trades in computer parts and peripherals, and software and telecom products in India and internationally. The company also provides products support services for IT products. Compuage Infocom Limited was founded in 1987 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400063",
        "website": "http://www.compuageindia.com",
        "full_time_employees": 735
    },
    "CPW-R.BK": {
        "short_name": "COPPERWIRED PUBLIC COMPANY LIMI",
        "long_name": "Copperwired Public Company Limited",
        "summary": "Copperwired Public Company Limited retails, distributes, and repairs computers, mobile phones, and accessories in Thailand. The company offers audio equipment, health and fitness devices, smart electrical appliances for homes and offices, smartphones and tablets, smartwatches, and various accessories. It offers its products through various stores under the dotlife, iStudio, U-Store, and iServe names, as well as e-commerce channels, comprising of www.istudio.store and www.dotlife.store. The company was incorporated in 2019 and is based in Bangkok, Thailand. Copperwired Public Company Limited operates as a subsidiary of Vnet Capital Co., Ltd.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.copperwired.co.th",
        "full_time_employees": null
    },
    "CPW.BK": {
        "short_name": "COPPERWIRED PUBLIC COMPANY LIMI",
        "long_name": "Copperwired Public Company Limited",
        "summary": "Copperwired Public Company Limited retails, distributes, and repairs computers, mobile phones, and accessories in Thailand. The company offers audio equipment, health and fitness devices, smart electrical appliances for homes and offices, smartphones and tablets, smartwatches, and various accessories. It offers its products through various stores under the dotlife, iStudio, U-Store, and iServe names, as well as e-commerce channels, comprising of www.istudio.store and www.dotlife.store. The company was incorporated in 2019 and is based in Bangkok, Thailand. Copperwired Public Company Limited operates as a subsidiary of Vnet Capital Co., Ltd.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.copperwired.co.th",
        "full_time_employees": null
    },
    "CREATIVE.NS": {
        "short_name": "Creative Peripherals and",
        "long_name": "Creative Peripherals and Distribution Limited",
        "summary": "Creative Peripherals and Distribution Limited distributes information technology (IT)/gaming, imaging, lifestyle, and security products in India and internationally. It offers printers, storage devices and cartridges, as well as PC components, such as monitors, hard disks, CD writers, and CD ROMS; cameras, tripods, and other imaging products and accessories; and TVs, headphones, other lifestyle products, and IT accessories. The company offers its products through sub distributors, channel partners, e-commerce/online channels, large format retails, and system integrators. Creative Peripherals and Distribution Limited was founded in 1992 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400067",
        "website": "http://www.ecreativeindia.com",
        "full_time_employees": 150
    },
    "CSS.BK": {
        "short_name": "COMMUNICATION AND SYSTEM SOLUTI",
        "long_name": "Communication & System Solution Public Company Limited",
        "summary": "Communication & System Solution Public Company Limited, together with its subsidiaries, distributes and installs production equipment for electricity, water, air conditioning, and telecommunication systems in Thailand. The company operates through two segments, Distribution Electrical Equipment and Installation Service. The Distribution Electrical Equipment segment supplies electrical cables and other electrical systems equipment, and passive fire protection materials and equipment. The Installation Service segment designs and installs telecommunication and fire protection systems. It also distributes and installs tubes. The company was founded in 1994 and is headquartered in Nonthaburi, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Nonthaburi",
        "zipcode": "11120",
        "website": "http://www.cssthai.com",
        "full_time_employees": null
    },
    "D0D.F": {
        "short_name": "DICKER DATA LTD",
        "long_name": "Dicker Data Limited",
        "summary": "Dicker Data Limited engages in the wholesale distribution of computer hardware, software, and related products in Australia and New Zealand. It sells its products to approximately 6,000 resellers. The company was formerly known as Rodin Corporation Pty Limited. Dicker Data Limited was incorporated in 1978 and is headquartered in Kurnell, Australia.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Kurnell",
        "zipcode": "2231",
        "website": "http://www.dickerdata.com.au",
        "full_time_employees": 525
    },
    "DDR.AX": {
        "short_name": "DICKERDATA FPO",
        "long_name": "Dicker Data Limited",
        "summary": "Dicker Data Limited engages in the wholesale distribution of computer hardware, software, and related products in Australia and New Zealand. It sells its products to approximately 6,000 resellers. The company was formerly known as Rodin Corporation Pty Limited. Dicker Data Limited was incorporated in 1978 and is headquartered in Kurnell, Australia.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Kurnell",
        "zipcode": "2231",
        "website": "http://www.dickerdata.com.au",
        "full_time_employees": 525
    },
    "DESPC.IS": {
        "short_name": "DESPEC BILGISAYAR",
        "long_name": "Despec Bilgisayar Pazarlama ve Ticaret Anonim Sirketi",
        "summary": "Despec Bilgisayar Pazarlama ve Ticaret Anonim Sirketi distributes ICT consumables in Turkey and internationally. It offers toners, ink cartridges, and tape backup and paper products; and IT accessories and mobile products. The company was founded in 1998 and is headquartered in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34485",
        "website": "http://www.despec.com.tr",
        "full_time_employees": 27
    },
    "DIST.ST": {
        "short_name": "DistIT AB",
        "long_name": "DistIT AB (publ)",
        "summary": "DistIT AB (publ) sells accessories for IT, mobility, home electronics, network, and data communications in the Nordic and Baltic countries. The company supplies audio and video equipment, and IT products and consumer electronics, as well as provides added value services. It sells its products through a network of home electronics chains, discount stores, specialty retailers, grocery stores, telecoms, e-commerce, consultants, and office warehouse channels for business customers and consumers. The company was formerly known as Deltaco AB. DistIT AB (publ) was founded in 1991 and is based in Ã\u0084lvsjÃ¶, Sweden.",
        "currency": "SEK",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "Ã\u0084lvsjÃ¶",
        "zipcode": "125 45",
        "website": "http://www.distit.se",
        "full_time_employees": 259
    },
    "EACO": {
        "short_name": "EACO CORP",
        "long_name": "EACO Corporation",
        "summary": "EACO Corporation, through its wholly owned subsidiary, Bisco Industries, Inc., distributes and sells electronic components and fasteners primarily in the United States and Canada. It offers electronic components, including spacers and standoffs, card guides and ejectors, component holders and fuses, circuit board connectors, and cable components, as well as various fasteners and hardware products. The company also provides customized services and solutions for various production needs comprising special packaging, bin stocking, kitting and assembly, bar coding, electronic requisitioning, integrated supply programs, and others. It supplies parts used in the manufacture of products to a range of industries, including aerospace, circuit board, communication, computer, fabrication, instrumentation, industrial equipment, and marine. The company sells its products primarily to the original equipment manufacturers through its sales representatives and distribution centers. EACO Corporation was founded in 1973 and is headquartered in Anaheim, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Anaheim",
        "zipcode": "92807",
        "website": "http://www.eacocorp.com",
        "full_time_employees": 525
    },
    "ELIMP.OL": {
        "short_name": "ELEKTROIMPORTOREN",
        "long_name": "Elektroimportøren AS",
        "summary": "ElektroimportÃ¸ren AS, together with its subsidiaries, sells electro materials and related products to private and professional customers. It offers lighting products, cables, and heating and ventilation products. The company sells products through department stores and e-commerce. As of December 31, 2020, it operated 23 department stores. The company was founded in 1994 and is based in Oslo, Norway.",
        "currency": "NOK",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Norway",
        "state": null,
        "city": "Oslo",
        "zipcode": "1081",
        "website": "http://www.elektroimportoren.no",
        "full_time_employees": 461
    },
    "ELOAF": {
        "short_name": "EMERGENCE GLOBAL ENTERPRISES IN",
        "long_name": "Emergence Global Enterprises Inc.",
        "summary": "Emergence Global Enterprises Inc develops and distributes natural health foods, supplements, and sports nutrition specialty supplements in North America. The company was formerly known as Velocity Data Inc. and changed its name to Emergence Global Enterprises Inc. in February 2020. Emergence Global Enterprises Inc. was incorporated in 2011 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6H 3X8",
        "website": "http://emergenceglobalinc.website",
        "full_time_employees": null
    },
    "EMRG.CN": {
        "short_name": "EmergenceGlobal",
        "long_name": "Emergence Global Enterprises Inc.",
        "summary": "Emergence Global Enterprises Inc develops and distributes natural health foods, supplements, and sports nutrition specialty supplements in North America. The company was formerly known as Velocity Data Inc. and changed its name to Emergence Global Enterprises Inc. in February 2020. Emergence Global Enterprises Inc. was incorporated in 2011 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6H 3X8",
        "website": "http://emergenceglobalinc.website",
        "full_time_employees": null
    },
    "EP4A.F": {
        "short_name": "ESPRINET S.P.A.  EO -,15",
        "long_name": "Esprinet S.p.A.",
        "summary": "Esprinet S.p.A., together with its subsidiaries, engages in the wholesale distribution of information technology (IT) and consumer electronics primarily in Italy, Spain, Portugal, and rest of Europe. The company distributes business to business IT products, such as hardware, software, and value-added services; consumer electronics; traditional IT products, including desktop PCs, notebooks, printers, copiers, servers, standard software, etc.; consumables comprising cartridges, tapes, toners, and magnetic supports; tablets, mobile devices, and accessories; networking products consisting of modems, routers, and switches; and digital and entertainment products, such as TVS, photo cameras, video cameras, videogames, and MP3/MP4 readers. It also engages in the design, production, and distribution of mobile devices accessories. The company markets its smartphones accessories under the Celly brand name and IT accessories and outdoor technology under the Nilox brand. It serves IT resellers, including value-added resellers, system integrators/corporate resellers, dealers, independent and/or affiliated stores, general and/or specialist retailers, and sub-distributors. Esprinet S.p.A. is headquartered in Vimercate, Italy.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "MI",
        "city": "Vimercate",
        "zipcode": "20871",
        "website": "http://www.esprinet.com",
        "full_time_employees": 1600
    },
    "FEV.DE": {
        "short_name": "FORTEC ELEKTRO. O.N.",
        "long_name": "FORTEC Elektronik AG",
        "summary": "FORTEC Elektronik AG provides industrial power supplies and display technologies in Germany and internationally. It operates in two segments, Data Visualisation Systems and Power Supplies. The Data Visualisation Systems segment offers standard kits and support services to product solutions developed in house and industrial monitors. The Power Supplies segment provides power supplies and DC/DC convertors. Fortec Elektronik AG was founded in 1984 and is based in Germering, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "state": null,
        "city": "Germering",
        "zipcode": "82110",
        "website": "http://www.fortecag.de",
        "full_time_employees": 210
    },
    "FEV.F": {
        "short_name": "FORTEC ELEKTRO. O.N.",
        "long_name": "FORTEC Elektronik AG",
        "summary": "FORTEC Elektronik AG provides industrial power supplies and display technologies in Germany and internationally. It operates in two segments, Data Visualisation Systems and Power Supplies. The Data Visualisation Systems segment offers standard kits and support services to product solutions developed in house and industrial monitors. The Power Supplies segment provides power supplies and DC/DC convertors. Fortec Elektronik AG was founded in 1984 and is based in Germering, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "state": null,
        "city": "Germering",
        "zipcode": "82110",
        "website": "http://www.fortecag.de",
        "full_time_employees": 210
    },
    "GLVA.JK": {
        "short_name": "Galva Technologies Tbk.",
        "long_name": "PT Galva Technologies Tbk",
        "summary": "PT Galva Technologies Tbk supplies electronic products in Indonesia. The company operates through Business Solutions, IT Distribution, and Printing Solutions segments. It primarily sells computers, printers, displays, and audio-video equipment. The company also sells broadcasting products, audio visual and media products, PA and communication products, professional audio and lighting products, digital signage products, security systems, projectors, and accessories. In addition, it offers system integration, design, installation, integration, maintenance, and engineering support services; and a range of hardware and business process solutions, including scanning, archiving, document management, and managed print services, as well as distributes software. The company was founded in 1991 and is based in Jakarta Pusat, Indonesia. PT Galva Technologies Tbk is a subsidiary of PT Elsiscom Prima Karya.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10120",
        "website": "http://www.gtc.co.id",
        "full_time_employees": 279
    },
    "GSPT": {
        "short_name": "GOLDEN STAR ENTERPRISES LTD",
        "long_name": "Golden Star Enterprises Ltd.",
        "summary": "Golden Star Enterprises Ltd. provides alternative renewable fuels. It offers Terralene, an alternative fuel formulation that reduces greenhouse gases and other environmentally damaging emissions in existing gasoline combustion engines. The company offers its products for government, industry, and consumers. The company was formerly known as Terralene Fuels Corporation and changed its name to Golden Star Enterprises Ltd. in July 2013. Golden Star Enterprises Ltd. was founded in 1993 and is based in Patchogue, New York.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Patchogue",
        "zipcode": "11772",
        "website": null,
        "full_time_employees": 2
    },
    "HCL-INSYS.NS": {
        "short_name": "HCL INFOSYSTEMS",
        "long_name": "HCL Infosystems Limited",
        "summary": "HCL Infosystems Limited sells computer hardware and mobile handsets to enterprises and consumers primarily in India. It operates through Hardware Products & Solution, Learning, and distribution segments. The Hardware Products and Solutions segment sells IT products and solutions to enterprise and government customers. The Learning segment offers training services; and sells educational digital content and related hardware offerings for private schools, colleges, and other education institutes, as well as vocational training. The Distribution segment distributes consumer products, including telecommunication products, digital lifestyle products, and consumer electronic and home appliances; and enterprise products, such as IT products, enterprise software, and office automation products. The company was founded in 1976 and is headquartered in Noida, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://www.hclinfosystems.com",
        "full_time_employees": 719
    },
    "IT.BK": {
        "short_name": "IT CITY PUBLIC COMPANY LIMITED",
        "long_name": "IT City Public Company Limited",
        "summary": "IT City Public Company Limited engages in the retail of computers, tablets, peripherals, smartphones, and other related IT products under the IT CITY name. The company also offers Internet of Thing and gaming devices; IP, car, and action cameras; robots; 3G/4G air cards; mouse, keyboards, and computer software; ink and toner cartridges, printing paper, UPS, power banks, and power extension outlets; loudspeakers, headphones, optical drives, hard disks, computer components, network equipment, and cables; carry bags and smart phone accessories; digital LED TV's and home audio video devices; office equipment, photo copiers, sticker cutting machines, label printers, barcode scanners, projectors, etc.; small home appliances, such as air purifiers, small kitchen utensils, etc.; desktops, notebooks, and LCD and LED monitors; wearable devices; and printers, including ink jet, dot matrix, laser, and multi-function printers. In addition, it operates repair and maintenance service centers; supplies genuine parts; and provides technicians. As of December 31, 2020, it operated 350 branches. IT City Public Company Limited is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10400",
        "website": "http://www.itcityonline.com",
        "full_time_employees": null
    },
    "JACO": {
        "short_name": "JACO ELECTRONICS INC",
        "long_name": "Jaco Electronics Inc.",
        "summary": "Jaco Electronics Inc. distributes displays and embedded systems. It offers high bright displays, touch screen displays, single board computers, TFT displays, LED micro displays, LCD controllers, and LED drivers. The company supplies its products to medical, military, kiosk, digital signage, aerospace, gaming, financial, e-voting, hand held devices, and transportation/automotive industries. Jaco Electronics Inc. was founded in 1961 and is headquartered in Hauppauge, New York.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Hauppauge",
        "zipcode": "11788",
        "website": "http://www.jacoelectronics.com",
        "full_time_employees": 194
    },
    "JUMPNET.NS": {
        "short_name": "Jump Networks Limited",
        "long_name": "Jump Networks Limited",
        "summary": "Jump Networks Limited provides information technology and advertisement services. The company offers JumpTalk, a Voice over Internet Protocol (VoIP) service that enables users to make high-quality audio and video calls; JUMP, a device that provides multitude of digital services; Edmission, a digital education platform that offers education for learners and educators; and GAIA Agritech, a technology used by farmer to produce organic milk and eggs. It is also involved in the resale of IT products. The company was formerly known as Iris Mediaworks Limited and changed its name to Jump Networks Limited in May 2019. Jump Networks Limited was incorporated in 1992 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400053",
        "website": "http://www.jump.tech",
        "full_time_employees": 3
    },
    "KLGG": {
        "short_name": "KLEGG ELECTRONICS INC",
        "long_name": "Klegg Electronics, Inc.",
        "summary": "Klegg Electronics, Inc. manufactures and distributes consumer electronics in the United States. Its product portfolio includes home audio comprising home theater and in-wall\\ceiling speakers; flat panel television consisting of plasma televisions, LCD televisions, and media center PC television; and home and mobile electronics, such as AVR-7100 7.1 receiver, EnteraStream Klegg media server, and mini MP3 player. The company also offers accessories, including remote controls, speaker stands/mounts, and cables and RCA connectors. It has a strategic alliance with Utek Corp. to enhance its new product pipeline with the acquisition of proprietary intellectual capital from universities and laboratory research centers Klegg Electronics, Inc. was incorporated in 2003 and is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89120",
        "website": null,
        "full_time_employees": null
    },
    "LMAS.JK": {
        "short_name": "Limas Indonesia Makmur Tbk",
        "long_name": "PT Limas Indonesia Makmur Tbk",
        "summary": "PT Limas Indonesia Makmur Tbk provides stock information and news services, and value added telephone services primarily in Indonesia. It is also involved in the trading of hardware and software; and provision of supporting facility and information technology consultancy services. The company was formerly known as PT Limas Centric Indonesia Tbk and changed its name to PT Limas Indonesia Makmur Tbk in August 2014. PT Limas Indonesia Makmur Tbk was founded in 1996 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://www.limas.com",
        "full_time_employees": 22
    },
    "MIDW.L": {
        "short_name": "MIDWICH GROUP PLC ORD GBP0.01",
        "long_name": "Midwich Group plc",
        "summary": "Midwich Group plc, together with its subsidiaries, engages in the distribution of audio visual (AV) solutions to the trade customers in the United Kingdom, Ireland, Europe, the Middle East, Africa, Asia Pacific, and North America. Its products support various AV categories, such as displays, projectors, audio, video, and digital signage, as well as lighting and unified communications. The company also distributes professional broadcast equipment; and provides logistics services. It serves professional AV integrators and IT resellers in corporate, education, retail, residential, and hospitality sectors. The company was formerly known as Jade 320 Limited and changed its name to Midwich Group Plc in April 2016. Midwich Group plc was founded in 1976 and is based in Diss, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Diss",
        "zipcode": "IP22 4YT",
        "website": "http://www.midwichgroupplc.com",
        "full_time_employees": 1000
    },
    "MQR1.F": {
        "short_name": "MULTI-CHEM LTD",
        "long_name": "Multi-Chem Limited",
        "summary": "Multi-Chem Limited, an investment holding company, distributes information technology products in Singapore, the People's Republic of China, Australia, and internationally. It operates in two segments, PCB Business and IT Business. The company provides distributes hardware and software relating to internet and network products, as well as related installation, technical, and maintenance services. In addition, it offers PCB manufacturing services, such as precision drilling services to PCB fabricators. Further, the company distributes a range of specialty chemicals for surface treatment, electroless copper plating, tin/tin lead stripping, and micro-etching; and supplies PCB-related materials and equipment, including plating systems, pulse rectifiers for copper plating, copper and tin anodes for electroplating, entry and back-up materials for drilling, non-woven brushes, dry film and liquid photoresist products, CCL and prepreg products, tacky rollers, tack cloth/wipes, and cleaning machines to remove foreign particles on PCBs. Additionally, it rents machines, as well as offers software consultancy and implementation services; and IT training courses. Multi-Chem Limited was incorporated in 1985 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "609966",
        "website": "http://www.multichem.com.sg",
        "full_time_employees": 537
    },
    "MSC.BK": {
        "short_name": "METRO SYSTEMS CORPORATION PUBLI",
        "long_name": "Metro Systems Corporation Public Company Limited",
        "summary": "Metro Systems Corporation Public Company Limited, together with its subsidiaries, engages in trading computers and equipment, software, supplies, and office equipment, as well as provision of related services in Thailand. The company provides server, storage, and network for IT infrastructure; backup, modernized application, and IBM I solutions for infrastructure; contractual, supplies, and outsourcing printing and services solutions for digital printing; and compute, network, storage, HCI, private, hybrid, public cloud, middleware and other, database, API, and backup and DR, as well as operating systems for digital infrastructure. It also offers businesses transformation, architecture design, application development, and infrastructure and managed service for digital transformation services; workforce and unified collaboration, mobility workforce, business process automation, and IT process management for digital collaboration; and SOLIDWORKS 3D CAD, simulation, electrical design, SOLIDWORKS product data management, and technical communication for designed and engineering solutions. In addition, it offers data integration tool, data platform, BI and data visualization, advance analytics and AI/ML, and data scientist platform. Further, it offers end point, network, server and data, cloud, and mobility security; and training and services. It also offers hardware products and office supplies. Metro Systems Corporation Public Company Limited was founded in 1985 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10250",
        "website": "http://www.metrosystems.co.th",
        "full_time_employees": null
    },
    "MTDL.JK": {
        "short_name": "Metrodata Electronics Tbk.",
        "long_name": "PT Metrodata Electronics Tbk",
        "summary": "P.T. Metrodata Electronics Tbk, together with its subsidiaries, engages in the information communication and technology (ICT) business in Indonesia and internationally. The company's Distribution division sells hardware and software, and basic peripherals, such as data storage devices, terminals, memory, and peripherals. Its Solution division provides maintenance services; sells hardware, system management software, middleware, serverware, and system level software; and rents hardware and software products. The company's Consultation division provides professional services for consultation, implementation, and training; and sells software products. The company also offers business transformation solutions; assembly services in the computer field or wireless communication equipment area; and system integration services, as well as distributes information technology products and personal computer products. P.T. Metrodata Electronics Tbk was founded in 1983 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "11470",
        "website": "http://www.metrodata.co.id",
        "full_time_employees": 3168
    },
    "NAR.L": {
        "short_name": "NORTHAMBER PLC ORD 1P",
        "long_name": "Northamber plc",
        "summary": "Northamber plc, together with its subsidiaries, distributes computers, peripheral equipment, and related services to resellers in the United Kingdom. The company sells computer accessories, mice and keyboards, monitors, PCs, tablets, and VDI terminals; hard disks, SSDs, and memory products; and accessories, AV accessories, large format products, digital signage products, and projectors. It also provides camera, color inkjet, color laser, labelling and barcoding, mono laser, scanner, and other print and imaging products, as well as printer consumables, scanning software, and scanner services; and add on cards, cases and PSU's, cooling and fans, gaming peripherals, graphics cards, mother boards, multimedia and other products, and USB products. In addition, the company offers cables and cable accessories; backup and UPS accessories and services; cabinets, KVMS, servers, and enterprise software, as well as vendor and other services; and camera, networking, physical security, and other security products. Further, it provides cloud, design and publishing, desktop, licensing, security, server, and speech software; and audio and conference phone, and autoID products. The company also exports its products to the Republic of Ireland, the Channel Islands, Isle of Man, and members of the European Union. Northamber plc was incorporated in 1980 and is headquartered in Chessington, the United Kingdom. Northamber plc operates as a subsidiary of Estate Of Mr David M Phillips.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Chessington",
        "zipcode": "KT9 1HS",
        "website": "http://www.northamber.com",
        "full_time_employees": null
    },
    "NHD.SI": {
        "short_name": "$ Jubilee",
        "long_name": "Jubilee Industries Holdings Ltd.",
        "summary": "Jubilee Industries Holdings Ltd., an investment holding company, manufactures and deals in precision plastic and metal molds. The company operates through two segments, Mechanical Business Unit and Electronics Business Unit. The Mechanical Business Unit segment offers plastic injection molds for consumer electronics, household appliances, medical supplies, automotive, and computer peripherals; and precision plastic injection mold design and fabrication services. This segment provides single-shot, double-shot, vertical, insert, and gas-assisted molding services; and value-added services for plastic decorative purposes, such as laser etching, ultrasonic welding, heat staking, printing, polishing, and sub-assembly services. It also builds engineering tools for customers in the medical and automotive industry. The Electronics Business Unit segment distributes memory devices, radio frequency modules, power management integrated circuits, microcontrollers, transistors, MOSFETs, capacitors, inductors, resistors, crystal oscillators, and connectors, as well as provides industrial power solutions, and design-in and integration services. This segment serves original design manufacturers, original equipment manufacturers, and electronics manufacturers. It has operations in Singapore, the United States, Malaysia, the People's Republic of China, India, Thailand, Vietnam, Indonesia, and other countries. The company was formerly known as JLJ Holdings Limited and changed its name to Jubilee Industries Holdings Ltd. in April 2012. The company was founded in 1993 and is headquartered in Singapore. Jubilee Industries Holdings Ltd. is a subsidiary of Accrelist Ltd.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408564",
        "website": "http://www.jihldgs.com",
        "full_time_employees": 1798
    },
    "OMPS": {
        "short_name": "OMPHALOS CORPORATION",
        "long_name": "Omphalos, Corp.",
        "summary": "Omphalos, Corp. manufactures and supplies a range of equipment and parts for printed circuit board manufacturers in Taiwan and China. It offers reflow soldering ovens and automated optical inspection machines. The company is based in Taoyuan City, Taiwan.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "338",
        "website": null,
        "full_time_employees": null
    },
    "OPTIEMUS.NS": {
        "short_name": "OPTIEMUS INFRACOM",
        "long_name": "Optiemus Infracom Limited",
        "summary": "Optiemus Infracom Limited trades in mobile handsets and mobile accessories in India and internationally. The company provides Blackberry, Zen, and Kult mobile devices; OptiSafe, a technology-based personal security and safety devices; and smartphone accessories under the Molife brand names, as well as engages in booking of hotel rooms through online portal. It also rents immovable property. The company was formerly known as Akanksha Cellular Limited and changed its name to Optiemus Infracom Limited in June 2011. Optiemus Infracom Limited was incorporated in 1993 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://www.optiemus.com",
        "full_time_employees": 80
    },
    "OTK.F": {
        "short_name": "OTSUKA CORP.",
        "long_name": "Otsuka Corporation",
        "summary": "Otsuka Corporation provides system integration, support, and other services in Japan. The company operates through two segments, System Integration Business, and Service and Support Business. The System Integration Business segment offers system services ranging from consulting, system design and development, transport and installation work, and network construction. It also provides management systems and collaborative software to cover a range of specialized fields, including CAD and web technologies; and software, hardware, intranet, and security products for the construction and expansion of computer networks. In addition, this segment sells computers, copiers, and communications equipment and software; and develops consigned software. The Service and Support Business segment offers supplies, hardware and software maintenance, telephone support, and outsourcing services; emergency computer rescue services for corporate and individual clients; and network support and services for the planning, design, construction, and operation of corporate information systems, as well as out-sources system engineers. It also provides educational support services. The company was incorporated in 1961 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-8573",
        "website": "http://www.otsuka-shokai.co.jp",
        "full_time_employees": 9119
    },
    "PCC.F": {
        "short_name": "PC CONNECTION INC  DL-,01",
        "long_name": "PC Connection, Inc.",
        "summary": "PC Connection, Inc., together with its subsidiaries, provides a range of information technology (IT) solutions. The company operates through three segments: Business Solutions, Enterprise Solutions, and Public Sector Solutions. It offers IT products, including computer systems, data center solutions, software and peripheral equipment, networking communications, and other products and accessories, as well as provides services, such as design, configuration, and implementation of IT solutions. The company markets its products and services through its websites comprising connection.com, connection.com/enterprise, connection.com/publicsector, and macconnection.com. It serves small to medium-sized businesses (SMBs) that include small office/home office customers; government and educational institutions; and medium-to-large corporate accounts through outbound telemarketing and field sales, and marketing programs targeted to specific customer populations, as well as through digital, web, and print media advertising. The company was founded in 1982 and is headquartered in Merrimack, New Hampshire.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NH",
        "city": "Merrimack",
        "zipcode": "03054-4631",
        "website": "http://www.connection.com",
        "full_time_employees": 2598
    },
    "PGNT": {
        "short_name": "PARAGON TECHNOLOGIES INC",
        "long_name": "Paragon Technologies, Inc.",
        "summary": "Paragon Technologies, Inc., through its subsidiaries, engages in the material handling, distribution, real estate, and investments business activities in North America, Latin America, Europe, and Asia. It provides various productivity enhancing material handling solutions, including complete systems, subsystem technologies, products, software, and services for automated material handling and order processing applications. The company also distributes IT hardware products comprising notebook and desktop computers, TVs, projectors, gaming products, accessories, servers, workstations, storage and networking products, printers, audio visual products, and power protection systems; and offers managed services, printing outsourcing, electronic documents management, electronic invoicing, and internet of things services. In addition, it holds luxury residential condominiums in Las Vegas, Nevada, as well as provides ancillary real estate services; and invests in businesses and securities under the investment management policy. The company was formerly known as SI Handling Systems, Inc. and changed its name to Paragon Technologies, Inc. in April 2000. Paragon Technologies, Inc. was founded in 1958 and is based in Easton, Pennsylvania.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Easton",
        "zipcode": "18042",
        "website": "http://www.pgntgroup.com",
        "full_time_employees": null
    },
    "PRT.MI": {
        "short_name": "ESPRINET",
        "long_name": "Esprinet S.p.A.",
        "summary": "Esprinet S.p.A., together with its subsidiaries, engages in the wholesale distribution of information technology (IT) and consumer electronics primarily in Italy, Spain, Portugal, and rest of Europe. The company distributes business to business IT products, such as hardware, software, and value-added services; consumer electronics; traditional IT products, including desktop PCs, notebooks, printers, copiers, servers, standard software, etc.; consumables comprising cartridges, tapes, toners, and magnetic supports; tablets, mobile devices, and accessories; networking products consisting of modems, routers, and switches; and digital and entertainment products, such as TVS, photo cameras, video cameras, videogames, and MP3/MP4 readers. It also engages in the design, production, and distribution of mobile devices accessories. The company markets its smartphones accessories under the Celly brand name and IT accessories and outdoor technology under the Nilox brand. It serves IT resellers, including value-added resellers, system integrators/corporate resellers, dealers, independent and/or affiliated stores, general and/or specialist retailers, and sub-distributors. Esprinet S.p.A. is headquartered in Vimercate, Italy.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Vimercate",
        "zipcode": "20871",
        "website": "http://www.esprinet.com",
        "full_time_employees": 1600
    },
    "PSYS": {
        "short_name": "PARADIGM SYS SOLUTIONS INC",
        "long_name": "Paradigm System Solutions Inc.",
        "summary": "Paradigm System Solutions Inc. is based in Burnsville, Minnesota.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MN",
        "city": "Burnsville",
        "zipcode": "55337",
        "website": null,
        "full_time_employees": null
    },
    "PYA.F": {
        "short_name": "WAYSIDE TECHNOL.GRP DL-01",
        "long_name": "Wayside Technology Group, Inc.",
        "summary": "Wayside Technology Group, Inc. operates as a value-added information technology (IT) distribution and solutions company in the United States, Canada, Europe, the United Kingdom, and internationally. It operates in two segments, Distribution and Solutions. The company distributes technical software and hardware to corporate and value added resellers, consultants, and systems integrators under the names Climb Channel Solutions and Sigma Software Distribution; and software, hardware, and services under the names TechXtend and Grey Matter. It also resells computer software and hardware developed by others, as well as provides technical services to end user customers. In addition, the company offers a line of products from various software vendors; and tools for virtualization/cloud computing, security, networking, storage and infrastructure management, application lifecycle management, and other technically sophisticated domains, as well as computer hardware. Wayside Technology Group, Inc. markets its products through its own web sites, local and on-line seminars, events, webinars, and social media, as well as direct email and printed materials. It provides IT distribution and solutions for companies in the security, data management, cloud, connectivity, storage and HCI, virtualization, and software and ALM industries. The company was formerly known as Programmer's Paradise, Inc. and changed its name to Wayside Technology Group, Inc. in August 2006. Wayside Technology Group, Inc. was incorporated in 1982 and is headquartered in Eatontown, New Jersey.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NJ",
        "city": "Eatontown",
        "zipcode": "07724",
        "website": "http://www.waysidetechnology.com",
        "full_time_employees": 270
    },
    "RHDGF": {
        "short_name": "RETAIL HOLDINGS NV",
        "long_name": "Retail Holdings N.V.",
        "summary": "Retail Holdings N.V., together with its subsidiaries, engages in the distribution of sewing machines and household appliances in India. It also manufactures sewing products. The company offers its products through wholesale dealers and distributors, an e-commerce platform, and retail locations. The company was formerly known as Singer N.V. and changed its name to Retail Holdings N.V. in September 2004. Retail Holdings N.V. was founded in 1851 and is headquartered in Willemstad, CuraÃ§ao.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Netherlands Antilles",
        "state": null,
        "city": "Willemstad",
        "zipcode": null,
        "website": "http://www.retailholdings.com",
        "full_time_employees": 381
    },
    "RLCO.TA": {
        "short_name": "RALCO AGENCIES",
        "long_name": "Ralco Agencies Ltd",
        "summary": "Ralco Agencies Ltd imports, distributes, and sells electrical and electronic appliances in Israel. The company offers refrigerators, LCD TVs, washing machines, microwave ovens, built-in ovens, tumble dryers, dishwashers, stoves, and vacuum cleaners. It markets its products through stores, as well as through online stores. The company was founded in 1983 and is based in Azor, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Azor",
        "zipcode": "58001",
        "website": "http://www.ralco.co.il",
        "full_time_employees": 47
    },
    "S69.SI": {
        "short_name": "Serial System",
        "long_name": "Serial System Ltd",
        "summary": "Serial System Ltd, an investment holding company, distributes electronic and electrical components, and consumer products. It operates in three segments: Electronic Components Distribution, Consumer Products Distribution, and Other Businesses. The company offers consumer products, including household appliances and lifestyle goods, such as printer accessories, camera accessories, processors, motherboards, and hard-disk drives. It is also involved in the trading and rental of investment properties; assembly and distribution of medical devices and ethylene oxide sterilization; trading and distribution of IT and photographic products; and distribution and marketing of information technology, computer peripherals, parts, software, and related products. In addition, the company offers hospitality and healthcare, laundry, and project financing services. Further, it manufactures, processes, trades, and exports durian puree and durian related products; provides management, marketing, and administrative services; markets, promotes, sells, exports, and distributes semiconductor components; and offers managed print services, as well as distributes copiers and printers. Additionally, the company is involved in communications and power line construction activities. It serves various industries, such as consumer electronics, telecommunication, household appliances, industrial, electronics manufacturing services, security and surveillance, automotive, and medical. The company operates in Singapore, Malaysia, Thailand, the Philippines, Indonesia, Vietnam, India, Hong Kong, China, South Korea, and Taiwan. The company was founded in 1988 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408554",
        "website": "http://www.serialsystem.com",
        "full_time_employees": 700
    },
    "SC3.F": {
        "short_name": "SCANSOURCE INC.",
        "long_name": "ScanSource, Inc.",
        "summary": "ScanSource, Inc. distributes technology products and solutions in the United States, Canada, and internationally. It operates in two segments, Worldwide Barcode, Networking & Security; and Worldwide Communications & Services. The Worldwide Barcode, Networking & Security segment offers a portfolio of solutions primarily for enterprise mobile computing, data capture, barcode printing, point of sale (POS), payments, networking, electronic physical security, cyber security, and other technologies. This segment offers data capture and POS solutions to automate the collection, processing, and communication of information for commercial and industrial applications, including retail sales, distribution, shipping, inventory control, materials handling, warehouse management, and health care applications. It also provides electronic physical security products, such as identification, access control, video surveillance, intrusion-related, and wireless and networking infrastructure products. The Worldwide Communications & Services segment offers a portfolio of solutions primarily for communications technologies and services comprising voice, video conferencing, wireless, data networking, cable, unified communications and collaboration, cloud, and technology services, as well as IP networks and other solutions for various vertical markets comprising education, healthcare, and government. The company also provides contact center, and infrastructure services. ScanSource, Inc. was founded in 1992 and is headquartered in Greenville, South Carolina.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "SC",
        "city": "Greenville",
        "zipcode": "29615",
        "website": "http://www.scansource.com",
        "full_time_employees": 2200
    },
    "SCSC": {
        "short_name": "ScanSource, Inc.",
        "long_name": "ScanSource, Inc.",
        "summary": "ScanSource, Inc. distributes technology products and solutions in the United States, Canada, and internationally. It operates in two segments, Worldwide Barcode, Networking & Security; and Worldwide Communications & Services. The Worldwide Barcode, Networking & Security segment offers a portfolio of solutions primarily for enterprise mobile computing, data capture, barcode printing, point of sale (POS), payments, networking, electronic physical security, cyber security, and other technologies. This segment offers data capture and POS solutions to automate the collection, processing, and communication of information for commercial and industrial applications, including retail sales, distribution, shipping, inventory control, materials handling, warehouse management, and health care applications. It also provides electronic physical security products, such as identification, access control, video surveillance, intrusion-related, and wireless and networking infrastructure products. The Worldwide Communications & Services segment offers a portfolio of solutions primarily for communications technologies and services comprising voice, video conferencing, wireless, data networking, cable, unified communications and collaboration, cloud, and technology services, as well as IP networks and other solutions for various vertical markets comprising education, healthcare, and government. The company also provides contact center, and infrastructure services. ScanSource, Inc. was founded in 1992 and is headquartered in Greenville, South Carolina.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "SC",
        "city": "Greenville",
        "zipcode": "29615",
        "website": "http://www.scansource.com",
        "full_time_employees": 2200
    },
    "SEDN": {
        "short_name": "SED INTERNATIONAL HOLDINGS INC",
        "long_name": "SED International Holdings, Inc.",
        "summary": "SED International Holdings, Inc., together with its subsidiaries, distributes information technology (IT) products and solutions, computer systems, and mobility devices in the United States, Latin America, and the Caribbean. The company primarily offers complete notebook and desktop systems, peripherals and accessories, and components, as well as software and related services. It also provides fulfillment services to e-commerce customers and other resellers; IT product procurement services; and system integration and configuration services. The company sells its products through a sales force and Website to reseller customers in retail, e-commerce, value added resellers, system builders, original equipment manufacturers, and various other reseller channels. SED International Holdings, Inc. was founded in 1980 and is based in Lawrenceville, Georgia. On February 24, 2018, an involuntary petition for liquidation under Chapter 7 was filed against SED International Holdings, Inc. in the U.S. Bankruptcy Court for the Northern District of Georgia. On September 13, 2016, the involuntary petition was approved by the Court and the Chapter 7 petition was converted to Chapter 11 reorganization. The plan was later approved as Chapter 11 liquidation on June 20, 2018.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Lawrenceville",
        "zipcode": "30043",
        "website": null,
        "full_time_employees": 327
    },
    "SIMAT-R.BK": {
        "short_name": "SIMAT TECHNOLOGIES PUBLIC COMPA",
        "long_name": "Simat Technologies Public Company Limited",
        "summary": "Simat Technologies Public Company Limited distributes computer hardware, software, and network accessories in Thailand and Malaysia. The company also offers computer information technology system development services. It sells various hardware products, such as corded and cordless barcode scanners, micro kiosks, mobile printers, barcode and label printers, card printers, face recognition products, mobile computers, wireless and networking products, RFID barcode readers and printers, and RFID antennas. The company also provides various software products comprising ManageSales, a sales force automation system; ManageWare, a warehouse management system solution; MobileNET; and Sky Frog. In addition, it manufactures self-adhesive label stickers, such as ribbonless, ESD, high temperature, healthcare, and barcode and serialize labels. Further, the company offers project management, implementation and training, helpdesk support, software customization and maintenance, custom software development, and technical services. Simat Technologies Public Company Limited was founded in 1995 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10520",
        "website": "http://www.simat.co.th",
        "full_time_employees": null
    },
    "SIMAT.BK": {
        "short_name": "SIMAT TECHNOLOGIES PUBLIC COMPA",
        "long_name": "Simat Technologies Public Company Limited",
        "summary": "Simat Technologies Public Company Limited distributes computer hardware, software, and network accessories in Thailand and Malaysia. The company also offers computer information technology system development services. It sells various hardware products, such as corded and cordless barcode scanners, micro kiosks, mobile printers, barcode and label printers, card printers, face recognition products, mobile computers, wireless and networking products, RFID barcode readers and printers, and RFID antennas. The company also provides various software products comprising ManageSales, a sales force automation system; ManageWare, a warehouse management system solution; MobileNET; and Sky Frog. In addition, it manufactures self-adhesive label stickers, such as ribbonless, ESD, high temperature, healthcare, and barcode and serialize labels. Further, the company offers project management, implementation and training, helpdesk support, software customization and maintenance, custom software development, and technical services. Simat Technologies Public Company Limited was founded in 1995 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10520",
        "website": "http://www.simat.co.th",
        "full_time_employees": null
    },
    "SIS.BK": {
        "short_name": "SIS DISTRIBUTION (THAILAND)",
        "long_name": "SiS Distribution (Thailand) Public Company Limited",
        "summary": "SiS Distribution (Thailand) Public Company Limited, together with its subsidiaries, distributes computer components, smartphones, and office automation equipment in Thailand. The company operates through four segments: Commercial Products, Consumer Products, Value Added Products, and Phones. It offers servers, home and business PCs, storage and networking devices, printers/scanners, and monitors; and private cloud, enterprise storage and backup, and security services. The company is also involved in the service and rental of computers and accessories. SiS Distribution (Thailand) Public Company Limited was founded in 1998 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10400",
        "website": "http://www.sisthai.com",
        "full_time_employees": null
    },
    "SLIS.JK": {
        "short_name": "Gaya Abadi Sempurna Tbk.",
        "long_name": "PT Gaya Abadi Sempurna Tbk",
        "summary": "PT Gaya Abadi Sempurna Tbk develops and trades in electric vehicles and electronic products in Indonesia. It offers electric bicycles and motors, and MTB electric bicycles; and fans and LED light products. The company was founded in 1996 and is headquartered in Tangerang, Indonesia. PT Gaya Abadi Sempurna Tbk is a subsidiary of PT Selis Investama Indonesia.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": null,
        "website": "http://www.gaya-slis.com",
        "full_time_employees": 166
    },
    "SLXIT.CO": {
        "short_name": "Seluxit A/S",
        "long_name": "Seluxit A/S",
        "summary": "Seluxit A/S provides Internet of Things solutions. It offers hardware and software, including embedded systems; Seluxit IoT platform; Wappsto, an App marketplace; and Wappsto apps that digitize products to provide Smart Home, Smart Meters, and Smart Machines solutions. The company was founded in 2006 and is based in Aalborg, Denmark.",
        "currency": "DKK",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "CPH",
        "market": "dk_market",
        "country": "Denmark",
        "state": null,
        "city": "Aalborg",
        "zipcode": "9200",
        "website": "http://www.seluxit.com",
        "full_time_employees": 19
    },
    "SPRS": {
        "short_name": "SURGE COMPONENTS INC",
        "long_name": "Surge Components, Inc.",
        "summary": "Surge Components, Inc., together with its subsidiaries, supplies electronic products and components. It offers capacitors, which are electrical energy storage devices; and discrete components, such as semiconductor rectifiers, transistors, diodes, and circuit protection devices. The company also provides audible components, including audible transducers, buzzers, speakers, microphones, resonators, alarms, chimes, filters, and discriminators, as well as fuses, printed circuit boards, and switches. Its products are used in the electronic circuitry of various products, including automobiles, telecomm, audio, cellular telephones, computers, consumer electronics, garage door openers, household appliances, power supplies, communications, utility meters, and security equipment. The company sells its products to original equipment manufacturers and distributors through independent sales representatives or organizations in the United States, Canada, China, other Asian countries, South America, and Europe. Surge Components, Inc. was incorporated in 1981 and is headquartered in Deer Park, New York.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Deer Park",
        "zipcode": "11729",
        "website": "http://www.surgecomponents.com",
        "full_time_employees": 38
    },
    "SPVI.BK": {
        "short_name": "S P V I PUBLIC COMPANY LIMITED",
        "long_name": "S P V I Public Company Limited",
        "summary": "S P V I Public Company Limited engages in the distribution of computers, mobile phones, and related accessories and services in Thailand. It also resells Apple products, including computers, iOS devices, and various other accessories. In addition, the company distributes products compatible with Apple, such as hard drives for video storage, portable hard drives, and printed and graphic products; and products associated with iOS devices comprising speakers, headphones, protective cases, and screen protectors. As of December 31, 2020, it operated 57 branches. The company was founded in 1989 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10310",
        "website": "http://www.spvi.co.th",
        "full_time_employees": null
    },
    "SRSK": {
        "short_name": "STAR STRUCK",
        "long_name": "Star Struck, Ltd.",
        "summary": "Star Struck, Ltd. distributes tools, supplies, and equipment to the jewelry industry. The company offers gold testers, precision jewelry gauges, microscopes, magnifiers and loupes, diamond and gold scales and weights, plating systems and supplies, engraving systems, ultrasonic cleaners, steam cleaners and ionic jewelry cleaning systems, jewelry findings, anti-tarnish liners, cotton filled boxes, bench tools, rolling mills, watch repair parts, watch battery replacement tools, and other jewelry supplies, as well as jewelry repair envelopes, forms, layaway, and appraisal products. It also provides adhesives, batteries, customized merchandise bags, diamond accessories, diamond meters and filters, displays, glass display domes, engravers, gift accessories, miscellaneous jewelry retail items, money detectors counterfeit and money counters, pliers, polish and protect products, retail pricing products, ring sizing products, jeweler's screwdrivers, soldering aids, tweezers, watch parts and tools, watch tools, watch straps, and welding products. The company also offers products through its online store and online catalog. Star Struck, Ltd. was formerly known as SBM Industries, Inc. and changed its name to Star Struck, Ltd. in May 1993. The company was founded in 1981 and is headquartered in Bethel, Connecticut.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Bethel",
        "zipcode": "06801",
        "website": "http://www.starstruckllc.com",
        "full_time_employees": 55
    },
    "SVOA-R.BK": {
        "short_name": "SVOA PUBLIC COMPANY LIMITED",
        "long_name": "SVOA Public Company Limited",
        "summary": "SVOA Public Company Limited provides information technology (IT) products and services in Thailand. The company operates through IT Distribution, Systems Integration, and IT Project segments. It distributes IT products, such as computer equipment, peripherals, and software; assembles and distributes computers under SVOA Computer brand name through partners and authorized dealers; and provides repair and maintenance services for IT products through 11 SVOA service centers, and approximately 108 authorized SVOA service providers. The company also offers IT consulting services, system implementation, networking products, computer security system equipment, and end-to-end IT solutions for financial and banking institutions, telecommunication companies, manufacturing and insurance industries, savings cooperatives, hospitals, government agencies, state enterprises, and private organizations, as well as data processing center, information technology management, and maintenance services. In addition, it provides computer system infrastructure services, including ATM outsource co-location, dedicated server, Web and email hosting, and disaster recovery support; computer products and IT equipment; installation and after-sales services; and digital applications for financial institution and government sector. Further, the company is involved in the sale of computer spare parts and other related equipment. The company was founded in 1982 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10120",
        "website": "http://www.svoa.co.th",
        "full_time_employees": null
    },
    "SVOA.BK": {
        "short_name": "SVOA PUBLIC COMPANY LIMITED",
        "long_name": "SVOA Public Company Limited",
        "summary": "SVOA Public Company Limited provides information technology (IT) products and services in Thailand. The company operates through IT Distribution, Systems Integration, and IT Project segments. It distributes IT products, such as computer equipment, peripherals, and software; assembles and distributes computers under SVOA Computer brand name through partners and authorized dealers; and provides repair and maintenance services for IT products through 11 SVOA service centers, and approximately 108 authorized SVOA service providers. The company also offers IT consulting services, system implementation, networking products, computer security system equipment, and end-to-end IT solutions for financial and banking institutions, telecommunication companies, manufacturing and insurance industries, savings cooperatives, hospitals, government agencies, state enterprises, and private organizations, as well as data processing center, information technology management, and maintenance services. In addition, it provides computer system infrastructure services, including ATM outsource co-location, dedicated server, Web and email hosting, and disaster recovery support; computer products and IT equipment; installation and after-sales services; and digital applications for financial institution and government sector. Further, the company is involved in the sale of computer spare parts and other related equipment. The company was founded in 1982 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10120",
        "website": "http://www.svoa.co.th",
        "full_time_employees": null
    },
    "SYNEX-R.BK": {
        "short_name": "SYNNEX (THAILAND) PUBLIC COMPAN",
        "long_name": "Synnex (Thailand) Public Company Limited",
        "summary": "Synnex (Thailand) Public Company Limited distributes computers, computer peripherals, software, IT systems, computer consumables, and communication devices in Thailand and Indochina markets. It distributes mobile phones and tablets; personal computers; and PC components comprising motherboard/mainboard, hard disk drives (HDD), solid-state drives (SDD), central processing unit, dynamic random access memory, video graphics array, power supply units, and computer cases. The company also offers PC monitor, mouse, keyboards, speakers, headsets, mobile phone accessories, web/video cameras, optical disk drives, projectors, uninterruptible power supply, inkjet and laser printers, all-in-one/multi-function printers, dot matrix and plotter printers, pocket photo printers, scanners, sewing machines, ink cartridges, toners, printer ribbons, USB flash drives, and external HDD/external SDD. In addition, it provides commercial notebooks, digital signages, closed circuit televisions, barcode and labelling equipment, servers, network attached storage products, switches, routers, LAN cards, wireless LANs, network cabling systems, network management software and hardware, network security or firewall, and network accessories; and cloud services. Further, the company offers smart watches, wristband and smart eyewear, virtual reality glasses and headsets, drones, underwater scooters, smart light bulbs, internet protocol cameras, industrial network products, and education robots; IoT products; and general and technical services and maintenance for network devices, servers, and various applications software. It serves computer retailers and wholesalers, software solution providers, computer manufacturers, department stores, superstores, and stationary shops. The company was formerly known as Compex (Thailand) Company Limited and changed its name to Synnex (Thailand) Public Company Limited in 2002. Synnex (Thailand) Public Company Limited was founded in 1988 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10230",
        "website": "http://www.synnex.co.th",
        "full_time_employees": null
    },
    "SYNEX.BK": {
        "short_name": "SYNNEX (THAILAND) PUBLIC COMPAN",
        "long_name": "Synnex (Thailand) Public Company Limited",
        "summary": "Synnex (Thailand) Public Company Limited distributes computers, computer peripherals, software, IT systems, computer consumables, and communication devices in Thailand and Indochina markets. It distributes mobile phones and tablets; personal computers; and PC components comprising motherboard/mainboard, hard disk drives (HDD), solid-state drives (SDD), central processing unit, dynamic random access memory, video graphics array, power supply units, and computer cases. The company also offers PC monitor, mouse, keyboards, speakers, headsets, mobile phone accessories, web/video cameras, optical disk drives, projectors, uninterruptible power supply, inkjet and laser printers, all-in-one/multi-function printers, dot matrix and plotter printers, pocket photo printers, scanners, sewing machines, ink cartridges, toners, printer ribbons, USB flash drives, and external HDD/external SDD. In addition, it provides commercial notebooks, digital signages, closed circuit televisions, barcode and labelling equipment, servers, network attached storage products, switches, routers, LAN cards, wireless LANs, network cabling systems, network management software and hardware, network security or firewall, and network accessories; and cloud services. Further, the company offers smart watches, wristband and smart eyewear, virtual reality glasses and headsets, drones, underwater scooters, smart light bulbs, internet protocol cameras, industrial network products, and education robots; IoT products; and general and technical services and maintenance for network devices, servers, and various applications software. It serves computer retailers and wholesalers, software solution providers, computer manufacturers, department stores, superstores, and stationary shops. The company was formerly known as Compex (Thailand) Company Limited and changed its name to Synnex (Thailand) Public Company Limited in 2002. Synnex (Thailand) Public Company Limited was founded in 1988 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10230",
        "website": "http://www.synnex.co.th",
        "full_time_employees": null
    },
    "TAIT": {
        "short_name": "Taitron Components Incorporated",
        "long_name": "Taitron Components Incorporated",
        "summary": "Taitron Components Incorporated engages in the supply of original designed and manufactured (ODM) electronic components, and distribution of brand name electronic components. It distributes discrete semiconductors, commodity integrated circuits, optoelectronic devices, and passive components. The company also provides value-added engineering and turn-key solutions focusing on providing contract electronic manufacturers (CEMs) and original equipment manufacturers (OEMs) with ODM products for their turn-key projects. It serves other electronic distributors, CEMs, and OEMs in the United States, South Korea, China, Taiwan, and internationally. The company has strategic alliances with Teamforce Co. Ltd.; Grand Shine Management Limited; and Zowie Technology Corporation. Taitron Components Incorporated was incorporated in 1989 and is headquartered in Valencia, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Valencia",
        "zipcode": "91355",
        "website": "http://www.taitroncomponents.com",
        "full_time_employees": 16
    },
    "TDJ.F": {
        "short_name": "TANAKA CO. LTD",
        "long_name": "Tanaka Co.,Ltd.",
        "summary": "Tanaka Co.,Ltd. engages in the wholesale of electrical materials and appliances in Japan. It offers fluorescent and incandescent light fixtures, HID fixtures, explosion-proof fixtures, ventilation and duct fans, and LED fixtures; and high and low voltage power cables, communication cables, insulation cables, synthetic rubber wires, steel conduits, vinyl chloride pipes, synthetic resin flexible conduits, and various accessories. The company also provides high voltage power receiving equipment, power distribution boards, control equipment, wiring equipment, electric circuit equipment, communication equipment, disaster prevention equipment, and sound equipment. In addition, it offers home appliances, housing equipment, OA equipment, and solar power generation equipment; and concrete columns, steel pipe poles, wire materials, measuring equipment, power tools, security equipment, etc. The company was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "140-8543",
        "website": "http://www.tanakashoji.co.jp",
        "full_time_employees": null
    },
    "TLSY.TA": {
        "short_name": "TELSYS LTD",
        "long_name": "Telsys Ltd.",
        "summary": "Telsys Ltd. imports, markets, and distributes electronic components in Israel. The company offers semiconductors, subsystems, passives, connectors, microwaves, telecom/datacom products, and others. It also provides specialized services. The company was founded in 1963 and is based in Petah Tikva, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": "4951404",
        "website": "http://www.telsys.co.il",
        "full_time_employees": 72
    },
    "TTA.AX": {
        "short_name": "TTA HOLDIN FPO",
        "long_name": "TTA Holdings Limited",
        "summary": "TTA Holdings Limited, through its subsidiary, TEAC Australia Pty Limited, distributes TEAC branded audio and visual consumer electronic products to retailers in Australia. Its audio products include sound systems, portable audios, Bluetooth speakers, sound bars, digital radios, and clock radios; and visual products comprise LED flat panel televisions, televisions with built in DVD players, UHD smart and non-smart televisions, set top boxes, and DVD players. The company is based in Thomastown, Australia. TTA Holdings Limited is a subsidiary of TT International Limited.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Keilor Park",
        "zipcode": "3042",
        "website": "http://www.teac.com.au",
        "full_time_employees": 16
    },
    "U7MA.F": {
        "short_name": "CNNC INTL LTD  HD -,01",
        "long_name": "CNNC International Limited",
        "summary": "CNNC International Limited, an investment holding company, explores for and trades in mineral properties in Mongolia and the People's Republic of China. It operates through Trading of Mineral Property, Exploration and Selling of Mineral Properties, and Supply Chain segments. The company holds interests in uranium projects located in Mongolia. It also sells electronics and other products, including liquid crystal displays, flash drives, memory cards, metal raw materials, etc.; and offers supply chain services. The company was formerly known as United Metals Holdings Limited and changed its name to CNNC International Limited in August 2008. The company was incorporated in 2002 and is headquartered in Hong Kong, Hong Kong. CNNC International Limited is a subsidiary of CNNC Overseas Uranium Holding Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.cnncintl.com",
        "full_time_employees": 23
    },
    "UDC.DE": {
        "short_name": "UNIDEVICE AG  INH O.N.",
        "long_name": "UniDevice AG",
        "summary": "UniDevice AG, together with its subsidiary, PPA International AG, engages in the wholesale of mobile phones worldwide. The company was founded in 2014 and is based in SchÃ¶nefeld, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "state": null,
        "city": "Schonefeld",
        "zipcode": "12529",
        "website": "http://www.unidevice.de",
        "full_time_employees": 18
    },
    "UDC.F": {
        "short_name": "UNIDEVICE AG  INH O.N.",
        "long_name": "UniDevice AG",
        "summary": "UniDevice AG, together with its subsidiary, PPA International AG, engages in the wholesale of mobile phones worldwide. The company was founded in 2014 and is based in SchÃ¶nefeld, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "state": null,
        "city": "Schonefeld",
        "zipcode": "12529",
        "website": "http://www.unidevice.de",
        "full_time_employees": 18
    },
    "VCOM-R.BK": {
        "short_name": "VINTCOM TECHNOLOGY PUBLIC COMPA",
        "long_name": "Vintcom Technology Public Company Limited",
        "summary": "Vintcom Technology Public Company Limited, together with its subsidiaries, trades in computers and equipment in Thailand, Myanmar, Cambodia, and internationally. It operates through Sale of Goods and Rendering of Services segments. The company also provides software and related services for computers. In addition, it offers various information technology solutions and services, such as servers, storage units, engineered systems or converged infrastructure solutions, cybers security, networking devices, database systems, operating systems, virtualization systems, middleware, software development tools, and database management software for data integration, big data management, cloud data management, and data quality and security. Further, the company provides installation, consultation, and computer system maintenance services; professional services; computer and network security monitoring, and outsourced management services to protect the digital infrastructures of enterprises; and installed-based renewal and project management services. The company was founded in 1992 and is headquartered in Bangkok, Thailand. Vintcom Technology Public Company Limited is a subsidiary of Vnet Capital Co., Ltd.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.vintcom.co.th",
        "full_time_employees": null
    },
    "VCOM.BK": {
        "short_name": "VINTCOM TECHNOLOGY PUBLIC COMPA",
        "long_name": "Vintcom Technology Public Company Limited",
        "summary": "Vintcom Technology Public Company Limited, together with its subsidiaries, trades in computers and equipment in Thailand, Myanmar, Cambodia, and internationally. It operates through Sale of Goods and Rendering of Services segments. The company also provides software and related services for computers. In addition, it offers various information technology solutions and services, such as servers, storage units, engineered systems or converged infrastructure solutions, cybers security, networking devices, database systems, operating systems, virtualization systems, middleware, software development tools, and database management software for data integration, big data management, cloud data management, and data quality and security. Further, the company provides installation, consultation, and computer system maintenance services; professional services; computer and network security monitoring, and outsourced management services to protect the digital infrastructures of enterprises; and installed-based renewal and project management services. The company was founded in 1992 and is headquartered in Bangkok, Thailand. Vintcom Technology Public Company Limited is a subsidiary of Vnet Capital Co., Ltd.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10110",
        "website": "http://www.vintcom.co.th",
        "full_time_employees": null
    },
    "VNI.F": {
        "short_name": "AVNET INC.  DL 1",
        "long_name": "Avnet, Inc.",
        "summary": "Avnet, Inc., a technology solutions company, markets, sells, and distributes electronic components. The company operates through two segments, Electronic Components and Farnell. The Electronic Components segment markets, sells, and distributes semiconductors; interconnect, passive, and electromechanical devices; and other integrated components from electronic component manufacturers. It also offers design chain support that provides engineers with technical design solutions; engineering and technical resources to support product design, bill of materials development, and technical education and training; and supply chain solutions that provide support and logistical services to original equipment manufacturers, electronic manufacturing service providers, and electronic component manufacturers. In addition, this segment provides integrated solutions, such as technical design, integration, and assembly of embedded products, and systems and solutions primarily for industrial applications, as well as for intelligent embedded and innovative display solutions comprising touch and passive displays. Further, it develops and manufactures standard board and industrial subsystems, and application-specific devices that enable it to produce systems tailored to specific customer requirements. This segment serves various markets, including automotive, medical, defense, aerospace, telecommunications, industrial, and digital editing. The Farnell segment distributes kits, tools, and electronic and industrial automation components, as well as test and measurement products to engineers and entrepreneurs. It has operations in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Avnet, Inc. was founded in 1921 and is headquartered in Phoenix, Arizona.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85034",
        "website": "http://www.avnet.com",
        "full_time_employees": 14600
    },
    "WSTG": {
        "short_name": "Wayside Technology Group, Inc.",
        "long_name": "Wayside Technology Group, Inc.",
        "summary": "Wayside Technology Group, Inc. operates as a value-added information technology (IT) distribution and solutions company in the United States, Canada, Europe, the United Kingdom, and internationally. It operates in two segments, Distribution and Solutions. The company distributes technical software and hardware to corporate and value added resellers, consultants, and systems integrators under the names Climb Channel Solutions and Sigma Software Distribution; and software, hardware, and services under the names TechXtend and Grey Matter. It also resells computer software and hardware developed by others, as well as provides technical services to end user customers. In addition, the company offers a line of products from various software vendors; and tools for virtualization/cloud computing, security, networking, storage and infrastructure management, application lifecycle management, and other technically sophisticated domains, as well as computer hardware. Wayside Technology Group, Inc. markets its products through its own web sites, local and on-line seminars, events, webinars, and social media, as well as direct email and printed materials. It provides IT distribution and solutions for companies in the security, data management, cloud, connectivity, storage and HCI, virtualization, and software and ALM industries. The company was formerly known as Programmer's Paradise, Inc. and changed its name to Wayside Technology Group, Inc. in August 2006. Wayside Technology Group, Inc. was incorporated in 1982 and is headquartered in Eatontown, New Jersey.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Eatontown",
        "zipcode": "07724",
        "website": "http://www.waysidetechnology.com",
        "full_time_employees": 270
    },
    "Y3D.SI": {
        "short_name": "MDR Limited",
        "long_name": "mDR Limited",
        "summary": "mDR Limited, an investment holding company, engages in the distribution and retail of telecommunication products and services in Singapore and Malaysia. It operates through After-Market Services (AMS); Distribution Management Solutions (DMS); Digital Inkjet Printing for Out-Of-Home Advertising Solutions (DPAS); and Investment segments. The company also offers after-market services, such as equipment repair, technical and customer support services for mobile equipment and consumer electronic products; digital inkjet printing services for point-of-sale and out-of-home advertising solutions; and loans to third party. In addition, it distributes and retails mobile related services, including prepaid cards, as well as skin care products; and invests in marketable securities. The company operates telecommunications retail stores that provide M1 and SingTel products and services, such as mobile, fixed, and wireless broadband under the HandphoneShop and 3 Mobile names in Singapore; and HandPhoneShop.com, an e-commerce portal that provide mobile devices, gadgets, and accessories. It operates 9 Singtel stores, 8 M1 stores, and 3 Samsung concept stores. The company was founded in 2000 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408594",
        "website": "http://www.m-dr.com",
        "full_time_employees": null
    },
    "YYN.SI": {
        "short_name": "$ PlatoCapital",
        "long_name": "Plato Capital Limited",
        "summary": "Plato Capital Limited, an investment holding company, provides e-commerce systems and services, and system integration related services in Malaysia. The company operates through IT Operations and Investment Activities segments. It also distributes and markets computer hardware and software; manages investments in quoted and unquoted equity shares; and provides money lending services. In addition, the company offers credit facilities; and management, aviation, and investment fund services, as well as develops and operates hotel. The company was incorporated in 1999 and is based in Kuala Lumpur, Malaysia.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50490",
        "website": "http://www.platocapital.com",
        "full_time_employees": null
    },
    "ZNCM": {
        "short_name": "ZUNICOM INC",
        "long_name": "Zunicom, Inc.",
        "summary": "Zunicom, Inc., through its wholly-owned subsidiary, AlphaNet Hospitality Systems, Inc., operates as a reseller of point-of-sale software and hardware to restaurants in southern Connecticut, Westchester county, New York, and New York city. The company sells and installs Restaurant Manager, a point-of-sale restaurant software solution for small and mid-size restaurants, including family, fine dining, and table service restaurants; quick service restaurants; and pizza delivery and take-out establishments, as well as bars and clubs. It also provides support services for the system; sells accessories and supplies to customers using the system; and installs software upgrades. Zunicom, Inc. was founded in 1968 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75209",
        "website": null,
        "full_time_employees": 11
    },
    "ZVR.F": {
        "short_name": "SOLAR AS B  DK 100",
        "long_name": "Solar A/S",
        "summary": "Solar A/S operates as a sourcing and services company in electrical, heating and plumbing, ventilation, and climate and energy solutions in the Danish, Swedish, Norwegian, and Dutch markets. The company offers lighting fixtures and luminaries, and various installation materials; switches and sockets, and other products in relation to intelligent building systems; and cables. It also provides communication and security products and solutions, such as video surveillance equipment and accessories, burglar alarms, fire alarms, and access control systems for large installations and urban networks, as well as customized solutions for home switches, UPS, and antenna equipment for telephony. In addition, the company offers valves; solar panels and electricity, wood, pellet boilers, etc.; products for bathrooms and kitchens, as well as pipes of steel, copper, and plastic for various purposes; products for mounting and supporting the pipes; and drainage systems, cable protection systems, floor drains, cold-water pumps, and hoses and insulation products. Further, it provides logistics, professional support, and training services. The company was founded in 1919 and is headquartered in Vejen, Denmark.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Denmark",
        "state": null,
        "city": "Vejen",
        "zipcode": "6600",
        "website": "http://www.solar.eu",
        "full_time_employees": 2864
    }
}