{
    "0Q18.L": {
        "short_name": "CATERPILLAR INC CATERPILLAR ORD",
        "long_name": "Caterpillar Inc.",
        "summary": "Caterpillar Inc. manufactures and sells construction and mining equipment, diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives worldwide. Its Construction Industries segment offers asphalt pavers, compactors, cold planers, motorgraders, pipelayers, road reclaimers, telehandlers, and utility vehicles; backhoe, compact track, multi-terrain, skid steer, and track-type loaders; forestry and wheel excavators; and site prep and track-type tractors. The company's Resource Industries segment provides electric rope and hydraulic shovels, draglines, rotary drills, hard rock vehicles, track-type tractors, mining trucks, longwall miners, wheel loaders, off-highway and articulated trucks, wheel tractor scrapers, wheel dozers, landfill and soil compactors, machinery components, autonomous ready vehicles and solutions, and select work tools. Its Energy & Transportation segment offers reciprocating engine powered generator sets; reciprocating engines and integrated systems for the power generation, marine, oil, and gas industries; turbines, centrifugal gas compressors, and related services; remanufactured reciprocating engines and components; and diesel-electric locomotives and components, and other rail-related products. The company's Financial Products segment provides operating and finance leases, installment sale contracts, working capital loans, and wholesale financing; and insurance and risk management, as well as other equipment-related loans. Its All Other Operating segment offers filters and fluids, undercarriage, ground engaging tools, fluid transfer products, precision seals, and rubber sealing and connecting components; parts distribution; integrated logistics solutions; portfolio management; brand management and marketing strategy; and digital investments services. The company was formerly known as Caterpillar Tractor Co. The company was founded in 1925 and is headquartered in Deerfield, Illinois.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Farm & Construction Machinery",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United States",
        "state": "IL",
        "city": "Deerfield",
        "zipcode": "60015",
        "website": "http://www.caterpillar.com",
        "market_cap": "Large Cap"
    }
}