{
  "002170.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Footwear & Accessories",
    "long_name": "Samyang Tongsang Co., Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SamyangTongsang",
    "state": null,
    "summary": "Samyang Tongsang Co., Ltd produces and sells leather products in South Korea. The company offers leather for handbags, footwear products, car seats, and baseball gloves; and baseball gloves and American footballs. It is also involved in real estate leasing activities. The company was founded in 1957 and is headquartered in Seoul, South Korea.",
    "website": "http://www.samyangts.com",
    "zipcode": null
  },
  "002291.SZ": {
    "city": "Foshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Footwear & Accessories",
    "long_name": "Saturday Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SATURDAY COLTD",
    "state": null,
    "summary": "Saturday Co., Ltd. designs, develops, manufactures, and markets footwear products primarily in Mainland China. It offers its products under the ST&SAT, FBL, SAFIYA, MOOFFY, RIZZO, IIXVIIX, and GAVAKLAS brand names. The company was formerly known as Foshan Saturday Shoes Co., Ltd. and changed its name to Saturday Co., Ltd. in March 2016. Saturday Co., Ltd. is based in Foshan, China.",
    "website": "http://www.st-sat.com",
    "zipcode": null
  },
  "002395.SZ": {
    "city": "Wuxi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Footwear & Accessories",
    "long_name": "Wuxi Double Elephant Micro Fibre Material Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "WUXI DOUBLE ELEPHA",
    "state": null,
    "summary": "Wuxi Double Elephant Micro Fibre Material Co.,Ltd manufactures and sells artificial and synthetic leather products in the People's Republic of China. The company offers micro fiber leather products, including microfiber shoe, furniture, automotive trim, case and bag, cleaning, and ball leather products; and micro fiber suede, as well as microfiber package leather for ornaments. It also provides PU synthetic leather products, such as PU shoe, furniture, automotive upholstery, case and bag, vanity, ball, garment, and glove leather products, as well as PU wiping leather for wine boxes. In addition, the company offers PVC artificial leather products comprising PVC shoe, case and bag, vanity, furniture, garment, ball, automotive trim, glove, and mahjong table upper leather products, as well as semi-PU embossed leather and PVC flocking products. Further, it provides plastic films. The company also exports its products in Asia, Europe, Americas, Africa, and Oceania. Wuxi Double Elephant Micro Fibre Material Co.,Ltd is based in Wuxi, the People's Republic of China. Wuxi Double Elephant Micro Fibre Material Co.,Ltd is a subsidiary of Jiangsu Shuangxiang Group.",
    "website": "http://www.sxcxgf.com",
    "zipcode": null
  },
  "0210.HK": {
    "city": "Shanghai",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "Daphne International Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "DAPHNE INT'L",
    "state": null,
    "summary": "Daphne International Holdings Limited, an investment holding company, manufactures, distributes, and retails footwear and accessories in Mainland China, Hong Kong, and Taiwan. The company offers its products under own brands, the Daphne and Shoebox, as well as brands under exclusive distributorships. As of December 31, 2019, it operated 425 points-of-sale (POS), including 360 POS under its core brands business and 65 POS under its other brands business. It is also involved in the e-commerce and property holding businesses. The company was formerly known as Prime Success International Group Limited and changed its name to Daphne International Holdings Limited in June 2008. Daphne International Holdings Limited was founded in 1987 and is headquartered in Shanghai, China.",
    "website": "http://www.daphneholdings.com",
    "zipcode": null
  },
  "025620.KS": {
    "city": "Incheon",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Footwear & Accessories",
    "long_name": "Jayjun Cosmetic Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Jayjun Cosmetic",
    "state": null,
    "summary": "Jayjun Cosmetic Co., Ltd. manufactures and sells various cosmetic products in South Korea. The company offers facial care products, including mask pack, eigel patch, skincare, cleansing, and suncare products; makeup; collagen jelly and other relates products; skin cells, moisture moisturizing, whitening brightening, and sensitive calm moisture care products; nutritional elasticity and anti-aging nutritional care products; and trouble and UV protection care products. It serves its products in China, the Southeast Asia, the Americas, and Europe. The company was formerly known as Jayjun Co., Ltd. and changed its name to Jayjun Cosmetic Co., Ltd. Jayjun Cosmetic Co., Ltd. was founded in 1972 and is headquartered in Incheon, South Korea.",
    "website": "http://www.jayjun.co.kr",
    "zipcode": null
  },
  "035150.KS": {
    "city": "Siheung-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Footwear & Accessories",
    "long_name": "BAIKSAN Co,. Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Baiksan",
    "state": null,
    "summary": "BAIKSAN Co,. Ltd engages in the production, manufacture, and sale of artificial and synthetic leather in South Korea. Its products are used in shoes, clothing, bags, balls, sports products, cases for electronics, furniture, interior materials of automobiles, and other goods. The company was formerly known as Baiksan Hwasugn Co., Ltd. and changed its name to BAIKSAN Co,. Ltd in April 1998. The company was founded in 1984 and is headquartered in Siheung-si, South Korea.",
    "website": "http://www.baiksan.co.kr",
    "zipcode": null
  },
  "0551.HK": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "Yue Yuen Industrial (Holdings) Limited",
    "market": "hk_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "YUE YUEN IND",
    "state": null,
    "summary": "Yue Yuen Industrial (Holdings) Limited, an investment holding company, engages in manufacturing, marketing, and retailing athletic footwear, athletic leisure footwear, and casual and outdoor footwear in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. It operates as an original design manufacturer/original equipment manufacturer for various international brand names, such as adidas, Asics, Converse, New Balance, Nike, Puma, Reebok, Salomon, and Timberland, as well as retails and distributes sportswear and apparel products. The company engages in the manufacture and sale of leather products, apparels, and sports sandals, as well as soles, components, and others. As of December 31, 2020, it had 5,240 directly operated stores and 3,835 stores operated by sub-distributors in the Greater China region. The company was founded in 1969 and is headquartered in Kwun Tong, Hong Kong.",
    "website": "http://www.yueyuen.com",
    "zipcode": null
  },
  "0676.HK": {
    "city": "Kowloon",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "Pegasus International Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PEGASUS INT'L",
    "state": null,
    "summary": "Pegasus International Holdings Limited, an investment holding company, manufactures, trades in, and sells footwear in the North America, Asia, Europe, and internationally. It operates through Manufacture and Sales of Footwear Products; and Lease of Properties segments. The company offers fashion and outdoor casual, skateboard, aqua sport, athletic, and golf shoes, as well as hiking and snow-board boots, sports sandals, and slippers for man, woman, and child. It also engages in the manufacture and trading of footwear materials; and leasing of investment properties. The company was founded in 1956 and is headquartered in Kowloon, Hong Kong. Pegasus International Holdings Limited is a subsidiary of Pegasus Footgear Management Limited.",
    "website": "http://www.pegasusinternationalholdings.com",
    "zipcode": null
  },
  "0738.HK": {
    "city": "Quarry Bay",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "Le Saunda Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LE SAUNDA",
    "state": null,
    "summary": "Le Saunda Holdings Limited, an investment holding company, manufactures and sells footwear and accessories in Mainland China, Hong Kong, and Macau. It designs, develops, manufactures, and retails ladies' and men's footwear, handbags, and fashionable accessories under the le saunda, le saunda MEN, LINEA ROSA, PITTI DONNA, and CNE brand names. The company also sells its products through online. As of February 29, 2020, it operated 441 stores. In addition, the company is involved in the property holding business; provision of management services; holding and licensing of trade-marks and names; and wholesale and trading of shoes. Le Saunda Holdings Limited was founded in 1977 and is headquartered in Quarry Bay, Hong Kong.",
    "website": "http://www.lesaunda.com.hk",
    "zipcode": null
  },
  "081660.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Footwear & Accessories",
    "long_name": "FILA Holdings Corporation",
    "market": "kr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Fila Holdings",
    "state": null,
    "summary": "FILA Holdings Corporation, together with its subsidiaries, engages in the sale of textile products, clothing, footwear, leather products, watches, cosmetics, golf equipment, and other products in South Korea, the United States, and internationally. It is also involved in the retail and wholesale of apparel and footwear under the FILA brand. In addition, the company manufactures and sells golf products, including golf balls, golf clubs, and golf gears under the Titleist brand; and licenses FILA branded products. It operates approximately 529 stores. The company was formerly known as FILA Korea Ltd. and changed its name to FILA Holdings Corporation in January 2020. FILA Holdings Corporation was founded in 1991 and is headquartered in Seoul, South Korea.",
    "website": "http://www.filaholdings.com",
    "zipcode": null
  },
  "101140.KS": {
    "city": "Pyeongtaek-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Footwear & Accessories",
    "long_name": "INBIOGEN CO.,Ltd",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "INBIOGEN",
    "state": null,
    "summary": "INBIOGEN CO.Ltd manufactures and sells footwear for children, youth, and adults in South Korea and internationally. The company markets its products under the ARTIS, SPECS, WANGJA, NEOSPEC, and CHAMPION brands. The company was formerly known as BTONE CO.,Ltd. INBIOGEN CO.Ltd was founded in 1949 and is based in Pyeongtaek, South Korea.",
    "website": "http://www.inbiogen.co.kr",
    "zipcode": "17908"
  },
  "1023.HK": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "Sitoy Group Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SITOY GROUP",
    "state": null,
    "summary": "Sitoy Group Holdings Limited, an investment holding company, designs, researches, develops, manufactures, sells, wholesale, and retails handbags, small leather goods, travel goods, and footwear under the TUSCAN'S, Fashion & Joy, Kenneth Cole, and Cole Haan brands. It operates in three segments: Retail, Manufacturing, and Property Investment. The company offers travel luggage and business accessories. It also provides advertising and marketing services; and invests in office spaces. In addition, the company provides treasury management services; acts as a trade agency; and operates shops, boutiques, and department stores. Further, it is involved in online sale of leather goods, clothing and accessories, and goods for daily use; retail and wholesale of shoes, clothes, belts, stationaries, glasses, bags, and other fashion products. The company offers its products in Mainland China, Hong Kong, Macau, Taiwan, North America, Europe, other Asian countries, and internationally. Sitoy Group Holdings Limited was founded in 1968 and is headquartered in Kwun Tong, Hong Kong.",
    "website": "http://www.sitoy.com",
    "zipcode": null
  },
  "1027.HK": {
    "city": "Jinjiang",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "China Jicheng Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CHINA JICHENG",
    "state": null,
    "summary": "China Jicheng Holdings Limited manufactures and sells POE umbrellas, nylon umbrellas, and umbrella parts in the People's Republic of China. It offers umbrella parts, such as plastic cloth and shafts. China Jicheng Holdings Limited also exports its products to Japan, Hong Kong, South Korea, Taiwan, Spain, and Cambodia. The company was formerly known as Jicheng Umbrella Holdings Limited and changed its name to China Jicheng Holdings Limited in June 2015. China Jicheng Holdings Limited was incorporated in 2014 and is headquartered in Jinjiang, the People's Republic of China.",
    "website": "http://www.china-jicheng.cn",
    "zipcode": null
  },
  "1028.HK": {
    "city": "Hong Kong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "C.banner International Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "C.BANNER",
    "state": null,
    "summary": "C.banner International Holdings Limited, an investment holding company, manufactures, sells, and retails women's formal and casual footwear primarily in the People's Republic of China, the United Kingdom, and the United States. The company operates through three segments: Retail and Wholesale of Shoes, Contract Manufacturing of Shoes, and Retail of Toys. It also acts as the OEM or ODM manufacturer for shoes companies in export markets, as well as retailer of toys. The company offers its products under the self-developed brands, including C.banner, EBLAN, Sundance, MIO, Badgley Mischka, and Natursun, as well as under the licensed brands, such as United Nude and Steve Madden. The company distributes its self-developed and licensed brands products primarily through department stores and independent retail stores. The company was formerly known as Hongguo International Holdings Limited and changed its name to C.banner International Holdings Limited in February 2012. C.banner International Holdings Limited was founded in 1995 and is based in Hong Kong, Hong Kong.",
    "website": "http://www.cbanner.com.cn",
    "zipcode": null
  },
  "1058.HK": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "Guangdong Tannery Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GUANGDONG TANN",
    "state": null,
    "summary": "Guangdong Tannery Limited, an investment holding company, processes and sells semi-finished and finished leather in Mainland China. The company is also involved in leasing plant and machinery; processing cowhides; and trading leather. It serves leather product manufacturers primarily branded shoes manufacturers. The company was founded in 1995 and is based in Central, Hong Kong. Guangdong Tannery Limited is a subsidiary of GDH Limited.",
    "website": "http://www.gdtann.com.hk",
    "zipcode": null
  },
  "1100.HK": {
    "city": "Kowloon Bay",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "Mainland Headwear Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MAINLAND HOLD",
    "state": null,
    "summary": "Mainland Headwear Holdings Limited, an investment holding company, designs, manufactures, trades in, and distributes casual headwear products in the United States, Europe, the People's Republic of China, Hong Kong, and internationally. The company operates through Manufacturing Business and Trading Business segments. Its casual headwear products include baseball caps, bucket hats, winter caps, gatsby hats, headbands, and sun visors. The company also offers headwear products for sports and racing, lifestyle and fashion, fishing/hunting and golf, and corporate events; character and entertainment, and O.D.M. headwear products; and knitted and winter hats. In addition, it is involved in the trading of apparels and accessories; provision of digitizing services; property holding; and trading of machineries, fabric, and accessory materials, as well as e-commerce business. The company was founded in 1986 and is headquartered in Kowloon Bay, Hong Kong.",
    "website": "http://www.mainland.com.hk",
    "zipcode": null
  },
  "1121.HK": {
    "city": "Quanzhou",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "Baofeng Modern International Holdings Company Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BAOFENGMODERN",
    "state": null,
    "summary": "Baofeng Modern International Holdings Company Limited, an investment holding company, manufactures, sells, and trades in footwear products in the People's Republic of China, the United States, South America, Europe, South East Asia, and internationally. The company operates through Boree Branded Products, Graphene-based Products, and Original Equipment Manufacturer segments. It offers slippers, sandals, and casual footwear under the Boree brand name. The company also manufactures and sells graphene-based ethylene-vinyl acetate foam material, deodorizing and sterilizing chips for air purifiers and air conditioners, and pressure-sensitive sensors. In addition, it produces slippers for branding and resale by others; trades in slippers; and provides management services. Baofeng Modern International Holdings Company Limited was founded in 1999 and is headquartered in Quanzhou, the People's Republic of China.",
    "website": "http://www.baofengmodern.com",
    "zipcode": "362300"
  },
  "1170.HK": {
    "city": "Tsim Sha Tsui",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "Kingmaker Footwear Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "KINGMAKER",
    "state": null,
    "summary": "Kingmaker Footwear Holdings Limited, an investment holding company, manufactures and sells footwear products in the United States, Europe, Asia, and internationally. The company's products include athletic footwear; lifestyle shoes, such as casual shoes, ath-leisure shoes, etc.; rugged footwear, including moutain climbing shoes, waterproof shoes, steel-toed shoes, hand-stitched shoes, boots, etc.; and children's shoes, such as boy's shoes, girl's shoes, infant shoes, etc. It also engages in the business of property holding and the provision of administrative services. Kingmaker Footwear Holdings Limited was founded in 1980 and is headquartered in Tsim Sha Tsui, Hong Kong.",
    "website": "http://www.kingmaker-footwear.com",
    "zipcode": null
  },
  "1316.TW": {
    "city": "Tainan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Footwear & Accessories",
    "long_name": "Sun Yad Construction Co.,Ltd",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SUN YAD CONSTRUCTION CO LTD",
    "state": null,
    "summary": "Sun Yad Construction Co., Ltd manufactures and sells PU synthetic leather materials in Mainland China, Vietnam, and Southeast Asia. The company offers its products used in manufacturing shoes for men and women. It also trades in, imports, and exports synthetic leather-related materials and optoelectronic materials; and develops, sells, and leases residential buildings. The company was founded in 1988 and is based in Tainan, Taiwan.",
    "website": "http://www.sunyad.com.tw",
    "zipcode": null
  },
  "1386.HK": {
    "city": "Kowloon Bay",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "Vestate Group Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "VESTATE GROUP",
    "state": null,
    "summary": "Vestate Group Holdings Limited, an investment holding company, engages in the production and retail of footwear products in Hong Kong, the People's Republic of China, and Taiwan. The company sells products under the ARTEMIS, COUBER.G, FORLERIA, A+A2, TRU-NARI, MY WALKER, and WALACI brands through its self-managed retail shops and e-commerce platforms. It also provides financial services, including money lending and other financial services to institutional and retail clients; and renders franchises and management services to convenience stores. In addition, the company is involved in the e-commerce and e-payment business; holding of trademarks; trading and investment; corporate secretary; information technology; and sales and marketing activities. The company was formerly known as Walker Group Holdings Limited and changed its name to Vestate Group Holdings Limited in February 2017. Vestate Group Holdings Limited was incorporated in 2006 and is headquartered in Kowloon Bay, Hong Kong.",
    "website": "http://www.vestategroup.com",
    "zipcode": null
  },
  "1731.HK": {
    "city": "Kwai Chung",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "Prosperous Industrial (Holdings) Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PROSPEROUS IND",
    "state": null,
    "summary": "Prosperous Industrial (Holdings) Limited, an investment holding company, designs, develops, manufactures, and sells recreational bags and packs. Its products include luggage bags, sport bags, laptop cases, and cosmetic bags. The company also trades in and retails sport bags, handbags, and luggage bags; and provides supply chain management services for sports and lifestyle brands. It has operations in the United States, Mainland China, Belgium, Japan, the Netherlands, Hong Kong, and internationally. The company was founded in 1970 and is headquartered in Kwai Chung, Hong Kong. Prosperous Industrial (Holdings) Limited is a subsidiary of Prosperous Holdings (Overseas) Limited.",
    "website": "http://www.pihl.hk",
    "zipcode": null
  },
  "1836.HK": {
    "city": "Kowloon",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "Stella International Holdings Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "STELLA HOLDINGS",
    "state": null,
    "summary": "Stella International Holdings Limited designs, develops, manufactures, sells, and retails footwear products and leather goods for men and women. It operates in two segments, Manufacturing, and Footwear Retailing and Wholesaling segments. The company is involved in holding of intellectual property rights; and the provision of secretary and accounting services. It also engages in the sale of handbags. The company operates its stores under the Stella Luna and What For brands name. It operates in North America, the People's Republic of China, Europe, Asia, and internationally. The company was founded in 1982 and is based in Kowloon, Hong Kong.",
    "website": "http://www.stella.com.hk",
    "zipcode": null
  },
  "1842.HK": {
    "city": "Tai Po",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "Grown Up Group Investment Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GROWN UP GROUP",
    "state": null,
    "summary": "Grown Up Group Investment Holdings Limited, together with its subsidiaries, develops, designs, manufactures, trades in, and sells bags and luggage products. It operates through Private Label Products and Branded Label Products segments. The company also provides product development and supply chain services for bags and luggage products. It sells its products under the Ellehammer brand name primarily for kids, teen, sports, leisure, business, travel, and technical segments, as well as under the licensed brands. The company also serves private label customers, distributors, wholesalers, and retailers in Europe, North America, the Peoples Republic of China, the Middle East, and internationally. The company was founded in 1989 and is headquartered in Tai Po, Hong Kong. Grown Up Group Investment Holdings Limited is a subsidiary of GP Group investment Holding Limited.",
    "website": "http://www.grown-up.com",
    "zipcode": null
  },
  "1910.HK": {
    "city": "Luxembourg",
    "country": "Luxembourg",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "Samsonite International S.A.",
    "market": "hk_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SAMSONITE",
    "state": null,
    "summary": "Samsonite International S.A. engages in the design, manufacture, sourcing, and distribution of travel luggage bags worldwide. It offers luggage, business, computer, outdoor, casual, and women's bags; and travel accessories and slim protective cases for personal electronic devices primarily under the Samsonite, Tumi, American Tourister, Speck, High Sierra, Gregory, Lipault, Kamiliant, Hartmann, and eBags brands, as well as other owned and licensed brand names. The company sells its products through various wholesale distribution channels, as well as through company operated retail stores and e-commerce in North America, Asia, Europe, and Latin America. Samsonite International S.A. was founded in 1910 and is headquartered in Luxembourg, Luxembourg.",
    "website": "http://www.samsonite.com",
    "zipcode": "1931"
  },
  "1SO.F": {
    "city": "Luxembourg",
    "country": "Luxembourg",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "Samsonite International S.A.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SAMSONITE INTL SA",
    "state": null,
    "summary": "Samsonite International S.A. engages in the design, manufacture, sourcing, and distribution of travel luggage bags worldwide. It offers luggage, business, computer, outdoor, casual, and women's bags; and travel accessories and slim protective cases for personal electronic devices primarily under the Samsonite, Tumi, American Tourister, Speck, High Sierra, Gregory, Lipault, Kamiliant, Hartmann, and eBags brands, as well as other owned and licensed brand names. The company sells its products through various wholesale distribution channels, as well as through company operated retail stores and e-commerce in North America, Asia, Europe, and Latin America. Samsonite International S.A. was founded in 1910 and is headquartered in Luxembourg, Luxembourg.",
    "website": "http://www.samsonite.com",
    "zipcode": "1931"
  },
  "241590.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Footwear & Accessories",
    "long_name": "Hwaseung Enterprise Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "H.S.ENTERPRISE",
    "state": null,
    "summary": "Hwaseung Enterprise Co., Ltd. manufactures and sells shoes for sporting goods. It also purchases and sells natural rubber, synthetic rubber, recycled rubber, and EVA; and pepper and chemical materials, as well as supplies water to shoe manufacturing companies. The company sells its natural rubber to shoes, tires, and adhesive tapes production factories. It exports its products to Korea, Indonesia, and China. The company was founded in 2015 and is based in Seoul, South Korea. Hwaseung Enterprise Co., Ltd. is a subsidiary of Hwaseung Industries Co., Ltd.",
    "website": "http://www.hsenterprise.co.kr",
    "zipcode": null
  },
  "2683.HK": {
    "city": "Sha Tin",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "Wah Sun Handbags International Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "WAHSUN HANDBAGS",
    "state": null,
    "summary": "Wah Sun Handbags International Holdings Limited, an investment holding company, manufactures and trades in non-leather hand-bag products in the United States, Spain, and internationally. Its hand-bag products are made of PU, PVC, and various textile materials. The company was founded in 1989 and is headquartered in Shatin, Hong Kong. Wah Sun Handbags International Holdings Limited is a subsidiary of Wah Sun International Holdings Limited.",
    "website": "http://www.wahsun.com.hk",
    "zipcode": null
  },
  "300218.SZ": {
    "city": "Hefei",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Footwear & Accessories",
    "long_name": "Anhui Anli Material Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ANHUI ANLI MATERIA",
    "state": null,
    "summary": "Anhui Anli Material Technology Co., Ltd. engages in the research and development, production, and sale of polyurethane synthetic leather and polyurethane resins in China. The company's products are used in men's and women's, sports leisure, children's, safety, work, and fashion shoes, as well as sofa furniture, chairs, massage chairs, household and engineering decorations, handbags, suitcases, credentials, stationery, packaging and electronic packaging, ball and sport goods, belts, ticket folders, automotive interiors, etc. It also exports its products to 70 countries and regions internationally. The company was formerly known as Anhui ANLI Artificial Leather Co., Ltd. and changed its name to Anhui Anli Material Technology Co., Ltd. in May 2015. Anhui Anli Material Technology Co., Ltd. was founded in 1994 and is based in Hefei, China.",
    "website": "http://www.chinapuleather.com",
    "zipcode": "230093"
  },
  "300321.SZ": {
    "city": "Changyi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Footwear & Accessories",
    "long_name": "Shandong Tongda Island New Materials Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SHANDONG TONGDA IS",
    "state": null,
    "summary": "Shandong Tongda Island New Materials Co.,Ltd. researches and develops, manufactures, and sells microfiber leather products in the People's Republic of China. The company offers sport shoe, labor shoe, and furnishings material, as well as auto, speed tail, airplane seat, and inner decoration. It also provides bags and case, belt, shoe lining, and microfiber for gloves. The company was founded in 2002 and is based in Changyi, the People's Republic of China.",
    "website": "http://www.td300321.com",
    "zipcode": "261300"
  },
  "300577.SZ": {
    "city": "Chuzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Footwear & Accessories",
    "long_name": "Anhui Korrun Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ANHUI KORRUN CO LT",
    "state": null,
    "summary": "Anhui Korrun Co., Ltd. manufactures and sells various travel luggage products worldwide. Its products include backpacks, briefcases, and sleeves; templates of smartphones and PADs; luggage; and outdoor and sports products. The company offers its products under the 90FUN and GUILDFORD brands. Anhui Korrun Co., Ltd. was founded in 2005 and is based in Chuzhou, China.",
    "website": "http://www.korrun.com",
    "zipcode": "239000"
  },
  "300591.SZ": {
    "city": "Guangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Footwear & Accessories",
    "long_name": "Guangdong Wanlima Industry Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GUANGDONG WANLIMAA",
    "state": null,
    "summary": "Guangdong Wanlima Industry Co., Ltd. designs, manufactures, and retails leather products in the People's Republic of China. It offers men and women shoes, handbags, suitcases wallets, belts, gloves, and other products in the People's Republic of China. The company markets its products under the WANLIMA, Saint Jack, OILILY, and COOME brands. It also operates flagship stores, store shops, counters, and other terminal stores. Guangdong Wanlima Industry Co., Ltd. was founded in 1993 and is based in Guangzhou, the People's Republic of China.",
    "website": "http://www.wanlima.com.cn",
    "zipcode": "510288"
  },
  "300901.SZ": {
    "city": "Wenzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Footwear & Accessories",
    "long_name": "Zhejiang Zoenn Design Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ZHEJIANG ZOENN DES",
    "state": null,
    "summary": "Zhejiang Zoenn Design Co., Ltd., a footwear design company, designs, develops, and sells shoes in China. It offers men's, women's and children's shoes and other footwear design services; and luggage, clothing, household supplies, fashion accessories, and other fashion design products and services. The company was founded in 2011 and is headquartered in Wenzhou, China.",
    "website": "http://www.zoenn.com",
    "zipcode": "325000"
  },
  "3059.T": {
    "city": "Kobe",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Footwear & Accessories",
    "long_name": "Hiraki Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "HIRAKI CO.LTD",
    "state": null,
    "summary": "Hiraki Co.,Ltd. engages in the shoes and footwear planning and development, mail-order, store, and wholesale clothing businesses in Japan. The company provides various shoes, including sneakers, casual and business shoes, boots, pumps, sandals, beach home sandals, rain shoes and boots, school shoes, and work shoes for women and men; kids and junior's shoes; and baby shoes. It also offers a range of wear products comprising tops, bottoms, room wear, inners, leg wear, sportswear/swimsuits, school wear, bra and shorts sets, underwear, sanitary shorts, and bodysuit girdles for women, kids and juniors, and men. In addition, the company provides interior goods, beddings, covers, rugs, carpets, curtains, cushions, slippers, and others; and fashion accessories, bath and toilet products, cleaning/laundry supplies, towels, kitchen utensils, storage supplies, stationery and household goods, bags, beauty and hygiene products, and others, as well as umbrellas, parasols, and raincoats. The company was founded in 1978 and is headquartered in Kobe, Japan.",
    "website": "http://www.hiraki.co.jp",
    "zipcode": "651-2494"
  },
  "3550.T": {
    "city": "Kobe",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Footwear & Accessories",
    "long_name": "STUDIO ATAO Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "STUDIO ATAO CO LTD",
    "state": null,
    "summary": "STUDIO ATAO Co., Ltd. engages in the planning and sale of bags and wallets in Japan. It also administers and manages stores; produces and operates Internet shops; and plans and produces paper media, including illustrations, as well as engages in character planning, planning, and production of promotional goods, such as novelties. The company was founded in 2005 and is headquartered in Kobe, Japan.",
    "website": "http://www.atao.co.jp",
    "zipcode": "651-0087"
  },
  "3U2.F": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "Dr. Martens plc",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "DR. MARTENS PLC  LS -,01",
    "state": null,
    "summary": "Dr. Martens Limited engages in the manufacture and sale of footwear in the United Kingdom and internationally. Its product segments include originals, fusion, kids and casual, and a complementary range of accessories. The company offers its products under Dr. Martens brand name. It operates Europe, the Middle East, Africa, the Americas, and the Asia-Pacific. Dr. Martens Limited was founded in 1960 and is based in London, the United Kingdom.",
    "website": "http://www.drmartensplc.com",
    "zipcode": "NW1 7BY"
  },
  "4LZ.F": {
    "city": "Bologna",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "Piquadro S.p.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PIQUADRO S.P.A.",
    "state": "BO",
    "summary": "Piquadro S.p.A. designs, manufactures, and sells bags and accessories in Italy. The company was founded in 1987 and is based in Bologna, Italy.",
    "website": "http://www.piquadro.com",
    "zipcode": "40041"
  },
  "603001.SS": {
    "city": "Yongjia",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Footwear & Accessories",
    "long_name": "Zhejiang Aokang Shoes Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ZHEJIANG AOKANG SHOES CO LTD",
    "state": null,
    "summary": "Zhejiang Aokang Shoes Co., Ltd. manufactures, sells, and retails shoes, clothes, leather goods, bags, and other products in China. The company offers its products under the Aokang, Kanglong, Beautiful beauty, and Red Firebird brands. The company was founded in 1988 and is based in Yongjia, China.",
    "website": "http://www.aokang.com",
    "zipcode": "325101"
  },
  "603116.SS": {
    "city": "Wenzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Footwear & Accessories",
    "long_name": "Zhejiang Red Dragonfly Footwear Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ZHEJIANG RED DRAGONFLY FOOTWARE",
    "state": null,
    "summary": "Zhejiang Red Dragonfly Footwear Co., Ltd. manufactures and sells shoes for men, women, and children in China. It also offers accessories and shoe care products. The company sells its products under the Red Dragonfly brand name. It also offers its products online. Zhejiang Red Dragonfly Footwear Co., Ltd. was founded in 1995 and is headquartered in Wenzhou, China.",
    "website": "http://www.cnhqt.com",
    "zipcode": null
  },
  "603477.SS": {
    "city": "Leshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Footwear & Accessories",
    "long_name": "Leshan Giantstar Farming & Husbandry Corporation Limited",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LESHAN GIANTSTAR FARMING&HUSBAN",
    "state": null,
    "summary": "Leshan Giantstar Farming & Husbandry Corporation Limited engages in the research, production, and sale of leather and leather products in China. The company offers car seat, upholstery bag, furniture, and decorative leather products. It also operates online store for its products. The company was formerly known as Sichuan Zhenjing Corporation Limited and changed its name to Leshan Giantstar Farming & Husbandry Corporation in August 2020. Leshan Giantstar Farming & Husbandry Corporation was founded in 1993 and is based in Leshan, China.",
    "website": "http://www.zhenjinggufen.com",
    "zipcode": "614800"
  },
  "603555.SS": {
    "city": "Xiamen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Footwear & Accessories",
    "long_name": "Guirenniao Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GUIRENNIAO CO LTD",
    "state": null,
    "summary": "Guirenniao Co., Ltd. researches and develops, designs, produces, and sells sports shoes and apparel under the Guirenniao, AND1, and PRINCE brands in China and internationally. The company provides sports clothing, equipment, and accessories, as well as hats. It also sells its products online, as well as engages in the online store agency operation. The company was founded in 2004 and is based in Xiamen, China.",
    "website": null,
    "zipcode": "361000"
  },
  "603608.SS": {
    "city": "Guangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Footwear & Accessories",
    "long_name": "Topscore Fashion Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "TOPSCORE FASHION CO LTD",
    "state": null,
    "summary": "Topscore Fashion Co., Ltd. provides footwear products primarily in China. It offers leather, fur, and feather footwear products under the KISSCAT, Kiss Kitty, ZSAZSAZSU, Tigrisso, and Patricia brands. The company markets its products through physical channels, marketing outlets, and e-commerce channels. It operates approximately 2,000 marketing outlets. The company was formerly known as TopScore Fashion Shoes Co., Ltd. Topscore Fashion Co., Ltd. was founded in 2004 and is based in Guangzhou, China.",
    "website": "http://www.topscore.com.cn",
    "zipcode": "511475"
  },
  "603958.SS": {
    "city": "Kunshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Footwear & Accessories",
    "long_name": "Harson Trading (China) Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "HARSON TRADING (CHINA) CO LTD",
    "state": null,
    "summary": "Harson Trading (China) Co., Ltd. manufactures and sells shoes for women primarily in China. The company is based in Kunshan, China.",
    "website": "http://www.harson.com.cn",
    "zipcode": null
  },
  "7422.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Footwear & Accessories",
    "long_name": "Toho Lamac Co., Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "TOHO LAMAC CO",
    "state": null,
    "summary": "Toho Lamac Co., Ltd. engages in the trading of shoes. The company offers sneakers, synthetic-leather shoes, and sports shoes for men, women, and children. It markets its products under the SHOEZOO, hocco, SONIA PARENTI, &Rouge, Fit Partner, B.C.COMPANY, NICE CLAUP, mc marie claire, apricot, keds, LEON, and ROYAL ALBERT HALL brand names. The company was formerly known as Toho Rubber Industries Co., Ltd. and changed its name to Toho Lamac Co., Ltd. in January 1988. Toho Lamac Co., Ltd. was founded in 1958 and is headquartered in Tokyo, Japan.",
    "website": "http://www.toho-lamac.co.jp",
    "zipcode": null
  },
  "7829.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Footwear & Accessories",
    "long_name": "Samantha Thavasa Japan Limited",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SAMANTHA THAVASA JAPAN LIMITED",
    "state": null,
    "summary": "Samantha Thavasa Japan Limited primarily engages in the planning, manufacture, and sale of handbags and jewelry. The company offers wallets, card cases, jewelry, makeup bags, golf wear, gifts, and small accessories, as well as sweets. It sells its products under the brand names of Samantha Thavasa, Samantha Thavasa Deluxe, Samantha Vega, Samantha Kingz, Samantha Thavasa Petit Choice, Samantha Tiara, Samantha Tiara Bridal, Samantha Silva by Samantha Tiara, Samantha Silva Bridal, Samantha Thavasa under25, No.7 Samantha Thavasa, Samantha Thavasa Anniversary, and Sweets Samantha Thavasa. The company sells its products through its stores in Japan, South Korea, China, Singapore, Taiwan, and the United States. Samantha Thavasa Japan Limited was founded in 1994 and is headquartered in Tokyo, Japan.",
    "website": "http://www.samantha.co.jp",
    "zipcode": "108-0073"
  },
  "7932.T": {
    "city": "Tokyo",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Footwear & Accessories",
    "long_name": "Nippi,Incorporated",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NIPPI INC",
    "state": null,
    "summary": "Nippi,Incorporated, together with its subsidiaries, manufactures and sells collagen casings, gelatin and collagen peptides, cosmetics and functional foods, functional polymers, and life science products in Japan and internationally. The company offers collagen casings for use in various fields, including foods, medicines and pharmaceuticals, and cosmetics; gelatin, which is used in food products, pharmaceutical products, photo films, etc.; and leather products for the automotive industry. It also develops cosmetics and functional foods with collagen; offers Nippi Linker, a vinyl chloride resin, which is primarily used for electric wires and masking films; and provides Nippi V Foam, a foam made of vinyl chloride for welder processing that is used in cars, quilt products, and novelty goods. In addition, the company engages in real estate leasing activities; and provides life science products that include laminin, lab equipment and supplies, and reagents, as well as contract services and bovine spongiform encephalopathy test kits. The company was formerly known as The Japan Leather Mfg. Co., Ltd. and changed its name to Nippi,Incorporated in February 1974. Nippi,Incorporated was founded in 1907 and is headquartered in Tokyo, Japan.",
    "website": "http://www.nippi-inc.co.jp",
    "zipcode": "120-8601"
  },
  "7936.T": {
    "city": "Kobe",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Footwear & Accessories",
    "long_name": "ASICS Corporation",
    "market": "jp_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ASICS CORP",
    "state": null,
    "summary": "ASICS Corporation manufactures and sells sports goods in Japan, the Americas, Europe, Oceania, Southeast and South Asia, and internationally. It offers sports shoes, apparel, and equipment. The company sells its products under the ASICS, ASICSTIGER, and Onitsuka Tiger brands through 989 retail stores, as well as through online. ASICS Corporation was founded in 1949 and is headquartered in Kobe, Japan.",
    "website": "http://corp.asics.com/jp",
    "zipcode": "650-8555"
  },
  "7938.T": {
    "city": "Urayasu",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Footwear & Accessories",
    "long_name": "Regal Corporation",
    "market": "jp_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "REGAL CORPORATION",
    "state": null,
    "summary": "Regal Corporation manufactures, retails, wholesales, and repairs various types of shoes for men and women. It also sells its products online. The company was formerly known as Nippon Shoe Co., Ltd. and changed its name to Regal Corporation in October 1990. Regal Corporation was founded in 1902 and is headquartered in Urayasu, Japan.",
    "website": "http://www.regal.co.jp",
    "zipcode": "279-8553"
  },
  "8115.T": {
    "city": "Kyoto",
    "country": "Japan",
    "currency": "JPY",
    "exchange": "JPX",
    "industry": "Footwear & Accessories",
    "long_name": "MOONBAT Co.,Ltd.",
    "market": "jp_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MOONBAT CO LTD",
    "state": null,
    "summary": "Moonbat Co.,Ltd. engages in the planning, manufacture, import, purchase, and sale of umbrellas, clothing, fur, leather, jewelry, and hats in Japan. The company was founded in 1885 and is headquartered in Kyoto, Japan.",
    "website": "http://www.moonbat.co.jp",
    "zipcode": "600-8491"
  },
  "8187.HK": {
    "city": "Central",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "Jimu Group Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "JIMU GROUP",
    "state": null,
    "summary": "Jimu Group Limited, an investment holding company, designs, develops, sources, markets, and sells footwear and apparel to wholesalers and retailers in Hong Kong, the People's Republic of China, Australia, the United Kingdom, New Zealand, Belgium, the United Arab Emirates, the United States, Chile, and internationally. It operates through Footwear and Apparel Businesses, and Loan Facilitation and Credit Assessment Services segments. The company offers formal and casual footwear for men, women, and children, as well as provides logistics management services. In addition, it provides pre-loan and post-loan facilitation services, which assist the qualified borrowers to obtain financing from various financial institutions or investors who have registered with online information intermediary service platforms. The company's pre-loan and post-loan facilitation services comprise business consulting, credit assessment services, and repayment management services. The company was formerly known as Ever Smart International Holdings Limited and changed its name to Jimu Group Limited in February 2018. The company was founded in 2009 and is headquartered in Central, Hong Kong. Jimu Group Limited is a subsidiary of Jimu Group Holdings Limited.",
    "website": "http://www.jimugroup.hk",
    "zipcode": null
  },
  "8285.HK": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Footwear & Accessories",
    "long_name": "Sling Group Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SLING GROUP",
    "state": null,
    "summary": "Sling Group Holdings Limited, an investment holding company, designs, sources, procures, promotes, and sells women's handbags, small leather goods, luggage products, and travel goods in the People's Republic of China. The company provides handle bags, clutch bags, wallets, coin cases, card holders, and suitcases under the ELLE, and Jessie & Jane brands. It also wholesales and retails clothes and accessories. The company offers its products to end customers through 1 self-operated store and 27 offline retail points; and third party retailers, as well as through online platforms. It also exports its products. The company was founded in 1999 and is headquartered in Kwun Tong, Hong Kong. Sling Group Holdings Limited is a subsidiary of Yen Sheng Investment Limited.",
    "website": "http://www.sling-inc.com.hk",
    "zipcode": null
  },
  "8404.TW": {
    "city": "Grand Cayman",
    "country": "Cayman Islands",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Footwear & Accessories",
    "long_name": "Paiho Shih Holdings Corporation",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PAIHO SHIH HOLDING CORPORATION",
    "state": null,
    "summary": "Paiho Shih Holdings Corporation, through its subsidiaries, manufactures and sells touch fastener, webbing, elastic, jacquard engineered mesh, and related peripheral materials in China and internationally. Its touch fastener products are used in shoes, garments, raincoats, caps, sporting goods, belts, and other applications; webbing products that include woven strips and shoelaces are used in accessories for decoration of shoe uppers, eyelets and laces, leathers, rear straps for sport bags, caps, and other applications; elastic products are used in pant straps, jacket lower hems, cuffs, shoe upper clothes, and other applications; and jacquard engineered mesh products are used in shoes, garments, sporting goods, child carts, baby goods, household textiles, and other applications. The company also engages in the commercial property management; selling and leasing of real estate properties; planning and consultation activities; and designing and decoration activities. In addition, it offers consumer electronic accessories; and masks and non-woven products. The company was founded in 2001 and is headquartered in Grand Cayman, the Cayman Islands. Paiho Shih Holdings Corporation is a subsidiary of Paiho Int'l Limited.",
    "website": "http://www.paiho.cn",
    "zipcode": "KYI-1208"
  },
  "8SY.F": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "Sitoy Group Holdings Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SITOY GROUP HLDGS  HD-,10",
    "state": null,
    "summary": "Sitoy Group Holdings Limited, an investment holding company, designs, researches, develops, manufactures, sells, wholesale, and retails handbags, small leather goods, travel goods, and footwear under the TUSCAN'S, Fashion & Joy, Kenneth Cole, and Cole Haan brands. It operates in three segments: Retail, Manufacturing, and Property Investment. The company offers travel luggage and business accessories. It also provides advertising and marketing services; and invests in office spaces. In addition, the company provides treasury management services; acts as a trade agency; and operates shops, boutiques, and department stores. Further, it is involved in online sale of leather goods, clothing and accessories, and goods for daily use; retail and wholesale of shoes, clothes, belts, stationaries, glasses, bags, and other fashion products. The company offers its products in Mainland China, Hong Kong, Macau, Taiwan, North America, Europe, other Asian countries, and internationally. Sitoy Group Holdings Limited was founded in 1968 and is headquartered in Kwun Tong, Hong Kong.",
    "website": "http://www.sitoy.com",
    "zipcode": null
  },
  "9802.TW": {
    "city": "Grand Cayman",
    "country": "Cayman Islands",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Footwear & Accessories",
    "long_name": "Fulgent Sun International (Holding) Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "FULGENT SUN INTERNATIONAL CO LT",
    "state": null,
    "summary": "Fulgent Sun International (Holding) Co., Ltd., together with its subsidiaries, engages in the production and sale of sports and leisure outdoor footwear in Taiwan. Its products are used in mountain climbing, snow walking, medical correction, jogging, hiking, and other casual activities. The company is also involved in distribution agent, and import and export trade; processing and sale of clothing products; lease of land businesses. It exports its products in Asia, Europe, Africa, Australia, and the Americas. Fulgent Sun International (Holding) Co., Ltd. was founded in 1995 and is headquartered in Grand Cayman, Cayman Islands.",
    "website": "http://www.fulgentsun.com",
    "zipcode": "KY1-1104"
  },
  "9904.TW": {
    "city": "Taichung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Footwear & Accessories",
    "long_name": "Pou Chen Corporation",
    "market": "tw_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "POU CHEN",
    "state": null,
    "summary": "Pou Chen Corporation manufactures and sells athletic, casual, and outdoor shoes in Taiwan and internationally. It operates as an original equipment manufacturer for international brands, as well as original design manufacturer for athletic footwear, leisure shoes, and sports sandals; and manufacturer for footwear accessories, apparels, and others. The company also engages in the retailing of sporting goods and brand licensing business. In addition, it is involved in the real estate development activities; and tourist hotel business. Pou Chen Corporation was founded in 1969 and is headquartered in Taichung, Taiwan.",
    "website": "http://www.pouchen.com",
    "zipcode": "40764"
  },
  "9910.TW": {
    "city": "Douliou",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Footwear & Accessories",
    "long_name": "Feng Tay Enterprises Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "FENG TAY ENTERPRISE CO LTD",
    "state": null,
    "summary": "Feng Tay Enterprises Co., Ltd. produces and sells athletic shoes worldwide. The company was founded in 1971 and is headquartered in Douliu, Taiwan.",
    "website": "http://www.fengtay.com",
    "zipcode": "64064"
  },
  "9950.TWO": {
    "city": "Tainan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Footwear & Accessories",
    "long_name": "Eminent Luggage Corporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "EMINENT LUGGAGE CORPORATION",
    "state": null,
    "summary": "Eminent Luggage Corporation designs, manufactures, and sells luggage products worldwide. The company provides a range of ABS, PP, PC, nylon, and polyester cases; bags and leisure products; and hard shell and beauty cases, soft luggage, trolleys, suitcase sets, business suitcases, and laptop backpacks. It offers its products under the Eminent, Case-Star, Mine, and Probeetle brands. Eminent Luggage Corporation was founded in 1979 and is headquartered in Tainan City, Taiwan.",
    "website": "http://www.eminent.com",
    "zipcode": "711"
  },
  "ADDDF": {
    "city": "Herzogenaurach",
    "country": "Germany",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "adidas AG",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ADIDAS AG",
    "state": null,
    "summary": "adidas AG, together with its subsidiaries, designs, develops, distributes, and markets athletic and sports lifestyle products worldwide. The company operates through ten segments: Europe, North America Adidas, North America Reebok, Asia-Pacific, Russia/CIS, Latin America, Emerging Markets, Adidas Golf, Runtastic, and Other Centrally Managed Businesses. It offers footwear; apparel; accessories and gear, such as bags, balls, and fitness equipment; and golf products under the adidas and Reebok brands. The company is also involved in the operation of Runtastic, a digital health and fitness space; and Y-3 label business activities. It sells its products through approximately 2,500 own-retail stores; mono-branded franchise stores; and wholesale distribution, as well as its e-commerce channel. The company was formerly known as adidas-Salomon AG and changed its name to adidas AG in June 2006. adidas AG was founded in 1920 and is headquartered in Herzogenaurach, Germany.",
    "website": "http://www.adidas-group.com",
    "zipcode": "91074"
  },
  "ADDYY": {
    "city": "Herzogenaurach",
    "country": "Germany",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "adidas AG",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ADIDAS AG",
    "state": null,
    "summary": "adidas AG, together with its subsidiaries, designs, develops, distributes, and markets athletic and sports lifestyle products worldwide. The company operates through ten segments: Europe, North America Adidas, North America Reebok, Asia-Pacific, Russia/CIS, Latin America, Emerging Markets, Adidas Golf, Runtastic, and Other Centrally Managed Businesses. It offers footwear; apparel; accessories and gear, such as bags, balls, and fitness equipment; and golf products under the adidas and Reebok brands. The company is also involved in the operation of Runtastic, a digital health and fitness space; and Y-3 label business activities. It sells its products through approximately 2,500 own-retail stores; mono-branded franchise stores; and wholesale distribution, as well as its e-commerce channel. The company was formerly known as adidas-Salomon AG and changed its name to adidas AG in June 2006. adidas AG was founded in 1920 and is headquartered in Herzogenaurach, Germany.",
    "website": "http://www.adidas-group.com",
    "zipcode": "91074"
  },
  "ADS.DE": {
    "city": "Herzogenaurach",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Footwear & Accessories",
    "long_name": "adidas AG",
    "market": "de_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ADIDAS AG NA O.N.",
    "state": null,
    "summary": "adidas AG, together with its subsidiaries, designs, develops, distributes, and markets athletic and sports lifestyle products worldwide. The company operates through ten segments: Europe, North America Adidas, North America Reebok, Asia-Pacific, Russia/CIS, Latin America, Emerging Markets, Adidas Golf, Runtastic, and Other Centrally Managed Businesses. It offers footwear; apparel; accessories and gear, such as bags, balls, and fitness equipment; and golf products under the adidas and Reebok brands. The company is also involved in the operation of Runtastic, a digital health and fitness space; and Y-3 label business activities. It sells its products through approximately 2,500 own-retail stores; mono-branded franchise stores; and wholesale distribution, as well as its e-commerce channel. The company was formerly known as adidas-Salomon AG and changed its name to adidas AG in June 2006. adidas AG was founded in 1920 and is headquartered in Herzogenaurach, Germany.",
    "website": "http://www.adidas-group.com",
    "zipcode": "91074"
  },
  "ADS.F": {
    "city": "Herzogenaurach",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "adidas AG",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ADIDAS AG NA O.N.",
    "state": null,
    "summary": "adidas AG, together with its subsidiaries, designs, develops, distributes, and markets athletic and sports lifestyle products worldwide. The company operates through ten segments: Europe, North America Adidas, North America Reebok, Asia-Pacific, Russia/CIS, Latin America, Emerging Markets, Adidas Golf, Runtastic, and Other Centrally Managed Businesses. It offers footwear; apparel; accessories and gear, such as bags, balls, and fitness equipment; and golf products under the adidas and Reebok brands. The company is also involved in the operation of Runtastic, a digital health and fitness space; and Y-3 label business activities. It sells its products through approximately 2,500 own-retail stores; mono-branded franchise stores; and wholesale distribution, as well as its e-commerce channel. The company was formerly known as adidas-Salomon AG and changed its name to adidas AG in June 2006. adidas AG was founded in 1920 and is headquartered in Herzogenaurach, Germany.",
    "website": "http://www.adidas-group.com",
    "zipcode": "91074"
  },
  "ADS.MI": {
    "city": "Herzogenaurach",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Footwear & Accessories",
    "long_name": "adidas AG",
    "market": "it_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ADIDAS",
    "state": null,
    "summary": "adidas AG, together with its subsidiaries, designs, develops, distributes, and markets athletic and sports lifestyle products worldwide. The company operates through ten segments: Europe, North America Adidas, North America Reebok, Asia-Pacific, Russia/CIS, Latin America, Emerging Markets, Adidas Golf, Runtastic, and Other Centrally Managed Businesses. It offers footwear; apparel; accessories and gear, such as bags, balls, and fitness equipment; and golf products under the adidas and Reebok brands. The company is also involved in the operation of Runtastic, a digital health and fitness space; and Y-3 label business activities. It sells its products through approximately 2,500 own-retail stores; mono-branded franchise stores; and wholesale distribution, as well as its e-commerce channel. The company was formerly known as adidas-Salomon AG and changed its name to adidas AG in June 2006. adidas AG was founded in 1920 and is headquartered in Herzogenaurach, Germany.",
    "website": "http://www.adidas-group.com",
    "zipcode": "91074"
  },
  "ADS.VI": {
    "city": "Herzogenaurach",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Footwear & Accessories",
    "long_name": "adidas AG",
    "market": "at_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ADIDAS AG",
    "state": null,
    "summary": "adidas AG, together with its subsidiaries, designs, develops, distributes, and markets athletic and sports lifestyle products worldwide. The company operates through ten segments: Europe, North America Adidas, North America Reebok, Asia-Pacific, Russia/CIS, Latin America, Emerging Markets, Adidas Golf, Runtastic, and Other Centrally Managed Businesses. It offers footwear; apparel; accessories and gear, such as bags, balls, and fitness equipment; and golf products under the adidas and Reebok brands. The company is also involved in the operation of Runtastic, a digital health and fitness space; and Y-3 label business activities. It sells its products through approximately 2,500 own-retail stores; mono-branded franchise stores; and wholesale distribution, as well as its e-commerce channel. The company was formerly known as adidas-Salomon AG and changed its name to adidas AG in June 2006. adidas AG was founded in 1920 and is headquartered in Herzogenaurach, Germany.",
    "website": "http://www.adidas-group.com",
    "zipcode": "91074"
  },
  "ADS1.F": {
    "city": "Herzogenaurach",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "adidas AG",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ADIDAS AG ADR 1/2/O.N.",
    "state": null,
    "summary": "adidas AG, together with its subsidiaries, designs, develops, distributes, and markets athletic and sports lifestyle products worldwide. The company operates through ten segments: Europe, North America Adidas, North America Reebok, Asia-Pacific, Russia/CIS, Latin America, Emerging Markets, Adidas Golf, Runtastic, and Other Centrally Managed Businesses. It offers footwear; apparel; accessories and gear, such as bags, balls, and fitness equipment; and golf products under the adidas and Reebok brands. The company is also involved in the operation of Runtastic, a digital health and fitness space; and Y-3 label business activities. It sells its products through approximately 2,500 own-retail stores; mono-branded franchise stores; and wholesale distribution, as well as its e-commerce channel. The company was formerly known as adidas-Salomon AG and changed its name to adidas AG in June 2006. adidas AG was founded in 1920 and is headquartered in Herzogenaurach, Germany.",
    "website": "http://www.adidas-group.com",
    "zipcode": "91074"
  },
  "ADS1.SG": {
    "city": "Herzogenaurach",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Footwear & Accessories",
    "long_name": "adidas AG",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "adidas AG Nam.-Akt.(ADRs) 1/2/o",
    "state": null,
    "summary": "adidas AG, together with its subsidiaries, designs, develops, distributes, and markets athletic and sports lifestyle products worldwide. The company operates through ten segments: Europe, North America Adidas, North America Reebok, Asia-Pacific, Russia/CIS, Latin America, Emerging Markets, Adidas Golf, Runtastic, and Other Centrally Managed Businesses. It offers footwear; apparel; accessories and gear, such as bags, balls, and fitness equipment; and golf products under the adidas and Reebok brands. The company is also involved in the operation of Runtastic, a digital health and fitness space; and Y-3 label business activities. It sells its products through approximately 2,500 own-retail stores; mono-branded franchise stores; and wholesale distribution, as well as its e-commerce channel. The company was formerly known as adidas-Salomon AG and changed its name to adidas AG in June 2006. adidas AG was founded in 1920 and is headquartered in Herzogenaurach, Germany.",
    "website": "http://www.adidas-group.com",
    "zipcode": "91074"
  },
  "ALPA3.SA": {
    "city": "So Paulo",
    "country": "Brazil",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Footwear & Accessories",
    "long_name": "Alpargatas S.A.",
    "market": "br_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ALPARGATAS  ON      N1",
    "state": "SP",
    "summary": "Alpargatas S.A. engages in the manufacture and sale of footwear, clothing, and accessories. It offers sandals under the Havaianas and Dup brands; clothes under the Osklen brand; and footwear, clothing, and accessories under the Mizuno brand. The company was formerly known as So Paulo Alpargatas S.A. and changed its name to Alpargatas S.A. in 2010. Alpargatas S.A. was founded in 1907 and is headquartered in Sao Paulo, Brazil.",
    "website": "http://www.alpargatas.com.br",
    "zipcode": "04794-000"
  },
  "ALPA4.SA": {
    "city": "So Paulo",
    "country": "Brazil",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Footwear & Accessories",
    "long_name": "Alpargatas S.A.",
    "market": "br_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ALPARGATAS  PN      N1",
    "state": "SP",
    "summary": "Alpargatas S.A. engages in the manufacture and sale of footwear, clothing, and accessories. It offers sandals under the Havaianas and Dup brands; clothes under the Osklen brand; and footwear, clothing, and accessories under the Mizuno brand. The company was formerly known as So Paulo Alpargatas S.A. and changed its name to Alpargatas S.A. in 2010. Alpargatas S.A. was founded in 1907 and is headquartered in Sao Paulo, Brazil.",
    "website": "http://www.alpargatas.com.br",
    "zipcode": "04794-000"
  },
  "ALTAN.PA": {
    "city": "Paris",
    "country": "France",
    "currency": "EUR",
    "exchange": "PAR",
    "industry": "Footwear & Accessories",
    "long_name": "Le Tanneur & Cie Socit anonyme",
    "market": "fr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LE TANNEUR",
    "state": null,
    "summary": "Le Tanneur & Cie Socit anonyme, together with its subsidiaries, creates, manufactures, distributes, and franchises leather goods under the Le Tanneur and Soco brands in France and internationally. The company offers bags, handbags, cross body bags, shoulder and shopping bags, pouches and belt bags, backpacks, travel bags, small leather goods, briefcases, wallets, card holders, toiletry bags, checkbook and paper holders, jewelry and watch cases, bracelets and belts, keyrings, leather gloves, cleaning products, and other accessories for men and women. It also provides leather goods for luxury houses. As of December 31, 2019, the company operated 43 outlets, as well as an e-commerce site. Le Tanneur & Cie Socit anonyme was founded in 1898 and is headquartered in Paris, France.",
    "website": "http://www.letanneur.com",
    "zipcode": "75008"
  },
  "AREB": {
    "city": "Nashville",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "American Rebel Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "AMERICAN REBEL HOLDINGS INC",
    "state": "KS",
    "summary": "American Rebel Holdings, Inc. develops various products in the self-defense and patriotic product areas. It focuses on designing, manufacturing, and marketing concealed carry backpacks under the American Rebel brand name. The company sells its products directly to consumers and through Internet. American Rebel Holdings, Inc. was founded in 2014 and is based in Nashville, Kansas.",
    "website": "http://www.americanrebel.com",
    "zipcode": "37204"
  },
  "ARZZ3.SA": {
    "city": "Cariacica",
    "country": "Brazil",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Footwear & Accessories",
    "long_name": "Arezzo Indstria e Comrcio S.A.",
    "market": "br_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "AREZZO CO   ON      NM",
    "state": "ES",
    "summary": "Arezzo Indstria e Comrcio S.A., together with its subsidiaries, engages in the manufacture, development, molding, and sale of women's footwear, handbags, clothing, and accessories. The company offers its products under the Arezzo, Schutz, Anacapri, Alexandre Birman, and Fiever brands. As of December 31, 2019, it had 630 franchise-operated stores, and 45 company-operated stores in Brazil. The company also sells its products through Web commerce channel. Arezzo Indstria e Comrcio S.A. was founded in 1972 and is headquartered in Belo Horizonte, Brazil.",
    "website": "http://www.arezzo.com.br",
    "zipcode": null
  },
  "ASCCF": {
    "city": "Kobe",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "ASICS Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ASICS CORP",
    "state": null,
    "summary": "ASICS Corporation manufactures and sells sports goods in Japan, the Americas, Europe, Oceania, Southeast and South Asia, and internationally. It offers sports shoes, apparel, and equipment. The company sells its products under the ASICS, ASICSTIGER, and Onitsuka Tiger brands through 989 retail stores, as well as through online. ASICS Corporation was founded in 1949 and is headquartered in Kobe, Japan.",
    "website": "http://corp.asics.com/jp",
    "zipcode": "650-8555"
  },
  "ASCCY": {
    "city": "Kobe",
    "country": "Japan",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "ASICS Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ASICS CORP",
    "state": null,
    "summary": "ASICS Corporation manufactures and sells sports goods in Japan, the Americas, Europe, Oceania, Southeast and South Asia, and internationally. It offers sports shoes, apparel, and equipment. The company sells its products under the ASICS, ASICSTIGER, and Onitsuka Tiger brands through 989 retail stores, as well as through online. ASICS Corporation was founded in 1949 and is headquartered in Kobe, Japan.",
    "website": "http://corp.asics.com/jp",
    "zipcode": "650-8555"
  },
  "ASI.F": {
    "city": "Kobe",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "ASICS Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ASICS CORP.(UNSP.ADR)/1",
    "state": null,
    "summary": "ASICS Corporation manufactures and sells sports goods in Japan, the Americas, Europe, Oceania, Southeast and South Asia, and internationally. It offers sports shoes, apparel, and equipment. The company sells its products under the ASICS, ASICSTIGER, and Onitsuka Tiger brands through 989 retail stores, as well as through online. ASICS Corporation was founded in 1949 and is headquartered in Kobe, Japan.",
    "website": "http://corp.asics.com/jp",
    "zipcode": "650-8555"
  },
  "ASI1.F": {
    "city": "Kobe",
    "country": "Japan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "ASICS Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ASICS CORP.",
    "state": null,
    "summary": "ASICS Corporation manufactures and sells sports goods in Japan, the Americas, Europe, Oceania, Southeast and South Asia, and internationally. It offers sports shoes, apparel, and equipment. The company sells its products under the ASICS, ASICSTIGER, and Onitsuka Tiger brands through 989 retail stores, as well as through online. ASICS Corporation was founded in 1949 and is headquartered in Kobe, Japan.",
    "website": "http://corp.asics.com/jp",
    "zipcode": "650-8555"
  },
  "ATYM": {
    "city": "Kowloon",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "Asia Time Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ASIA TIME CORP",
    "state": null,
    "summary": "Asia Time Corporation, together with its subsidiaries, distributes watch movements components used in the manufacture and assembly of watches. It also designs watches for manufacturers and exporters of watches, as well as manufactures and distributes watches primarily to Internet marketers. In addition, the company provides a range of value-added services, including automated inventory management services; and integration, design, development, management, and extended and post-sale support services. It serves wholesalers, and medium-to-large sized watch manufacturers that produce watches for consumer sale primarily in Hong Kong and China. The company was founded in 2001 and is based in Kowloon, Hong Kong.",
    "website": null,
    "zipcode": null
  },
  "AURI": {
    "city": "Laguna Beach",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "Auri, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "AURI INC",
    "state": "CA",
    "summary": "Auri, Inc. offers design, development, manufacture, and sale of men's and women's footwear. The company distributes its footwear under the Auri brand name through wholesale distribution channels comprising department stores, specialty stores, and independent retailers, as well as Internet retailers, including its own Internet Website in the United States. The company was formerly known as Auri Design Group, LLC and changed its name to Auri, Inc. in February 2011. The company was founded in 2007 and is based in Laguna Beach, California.",
    "website": null,
    "zipcode": "92651"
  },
  "BANARBEADS.NS": {
    "city": "Varanasi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Footwear & Accessories",
    "long_name": "Banaras Beads Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BANARAS BEADS LTD",
    "state": null,
    "summary": "Banaras Beads Limited manufactures and exports glass beads, necklaces, imitation jewelry, and other related products in India, the United States, South Africa, the United Kingdom, Ireland, Germany, Europe, the Middle East, and Africa. The company also offers beads made from clay, brass, aluminum, copper, resin, ceramics, horn, bone, semiprecious stones, agate, lac, hand painted beads, spray painted beads, etc.; and trades in leather and cotton wax cords, and miscellaneous handicraft products. It serves wholesalers and retailers, companies dealing in craft business, craft stores/large retail chain stores, and online business companies. Banaras Beads Limited was founded in 1940 and is headquartered in Varanasi, India.",
    "website": "http://www.banarasbead.com",
    "zipcode": "221106"
  },
  "BATA.JK": {
    "city": "Jakarta Selatan",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Footwear & Accessories",
    "long_name": "PT Sepatu Bata Tbk.",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Sepatu Bata Tbk.",
    "state": null,
    "summary": "PT Sepatu Bata Tbk. manufactures and sells footwear products in Indonesia. The company offers leather footwear, canvas built-up footwear, casual and sports shoes, injection molded sandals/slippers, and industrial safety footwear. It is also involved in the import, export, and distribution of footwear. PT Sepatu Bata Tbk. serves retail dealers and wholesalers. The company was founded in 1931 and is headquartered in Jakarta, Indonesia. PT Sepatu Bata Tbk. is a subsidiary of Bafin (Nederland) B.V.",
    "website": "http://www.bata.co.id",
    "zipcode": "12430"
  },
  "BATAINDIA.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Footwear & Accessories",
    "long_name": "Bata India Limited",
    "market": "in_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BATA INDIA",
    "state": null,
    "summary": "Bata India Limited manufactures and trades in footwear and accessories through its retail and wholesale network in India. The company offers footwear in the categories of women, men, and kids; and accessories, such as belts, clutches, handbags, masks, and shoe care products. It sells its products primarily under the Bata, Disney, Footin, Hush Puppies, Marie Claire, Naturalizer, North Star, Power, Scholl, CAT, Weinbrenner, and Bubblegummers brands. The company operates through approximately 1,558 retail stores, including franchisee stores. It also exports its products. The company was formerly known as Bata Shoe Company Private Limited and changed its name to Bata India Limited in 1973. The company was incorporated in 1931 and is based in Gurugram, India. Bata India Limited is a subsidiary of Bata (BN) B.V.",
    "website": "http://www.bata.in",
    "zipcode": "122002"
  },
  "BAYRK.IS": {
    "city": "Istanbul",
    "country": "Turkey",
    "currency": "TRY",
    "exchange": "IST",
    "industry": "Footwear & Accessories",
    "long_name": "Bayrak EBT Taban Sanayi ve Ticaret Anonim Sirketi",
    "market": "tr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BAYRAK TABAN SANAYI",
    "state": null,
    "summary": "Bayrak Ebt Taban Sanayi Ve Ticaret Anonim Sirketi engages in manufacturing PVC and thermo shoe soles for various brands. The company is based in Istanbul, Turkey.",
    "website": "http://bayrakebt.com.tr",
    "zipcode": "34528"
  },
  "BIL.NS": {
    "city": "Gurugram",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Footwear & Accessories",
    "long_name": "Bhartiya International Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BHARATIYA INTL LTD",
    "state": null,
    "summary": "Bhartiya International Limited manufactures and sells leather and textile products in India. It offers leather outerwear, bags and accessories, belts, wallets, and other small leather goods, as well as leather finishing services. The company also engages in the development of real estate and industrial parks. In addition, it exports its products. Bhartiya International Limited was founded in 1987 and is based in Gurugram, India.",
    "website": "http://www.bhartiya.com",
    "zipcode": "122002"
  },
  "BIMA.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Footwear & Accessories",
    "long_name": "PT Primarindo Asia Infrastructure Tbk.",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Primarindo Asia Infrastructure ",
    "state": null,
    "summary": "PT Primarindo Asia Infrastructure Tbk. engages in the production, marketing, and export of sports/casual shoes under the Tomkins brand name in Indonesia and internationally. The company sells its products through consignment sales cooperation with various department stores; and direct sales through its own showrooms. The company was formerly known as PT Bintang Kharisma Tbk and changed its name to PT Primarindo Asia Infrastructure Tbk. in 1997. The company was founded in 1988 and is headquartered in Jakarta, Indonesia. PT Primarindo Asia Infrastructure Tbk. is a subsidiary of PT. Golden Lestari.",
    "website": "http://www.primarindo.co.id",
    "zipcode": "10230"
  },
  "BRP.F": {
    "city": "Saint Louis",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "Caleres, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CALERES INC.  DL-,01",
    "state": "MO",
    "summary": "Caleres, Inc. engages in the retail and wholesale of footwear in the United States, China, Canada, China, and Guam. It operates through Famous Footwear and Brand Portfolio segments. The company offers licensed, branded, and private-label athletic, casual, and dress footwear products to women, men, and children. Its retail shoe stores provide brand name athletic, casual, and dress shoes, including Nike, Skechers, adidas, Vans, Converse, Crocs, Puma, Birkenstock, Asics, New Balance, Under Armour, Bearpaw, Timberland, and Sperry, as well as company-owned and licensed brands, such as Dr. Scholl's Shoes, Blowfish Malibu, LifeStride, Naturalizer, Circus by Sam Edelman, Franco Sarto, and Ryka. The company also operates naturalizer.com, naturalizer.ca, vionicshoes.com, samedelman.com, allenedmonds.com, drschollsshoes.com, lifestride.com, francosarto.com, ryka.com, bzees.com, and zodiacshoes.com, as well as Vince.com, blowfishshoes.com, and veronicabeard.com websites. In addition, it designs, sources, and markets footwear to retail stores, such as national chains, online retailers, department stores, mass merchandisers, independent retailers, and catalogs. Further, the company wholesales men's apparel, leather goods, and accessories under the Allen Edmonds brand; Italian footwear Franco Sarto brand; women's shoe collection under the Vince brand; athletic footwear for women under the Ryk brand; and women's footwear under the Bzees brand, as well as Via Spiga brand. It operates approximately 1,086 retail stores. The company was formerly known as Brown Shoe Company, Inc. and changed its name to Caleres, Inc. in May 2015. Caleres, Inc. was founded in 1878 and is headquartered in St. Louis, Missouri.",
    "website": "http://www.caleres.com",
    "zipcode": "63105"
  },
  "BSHI": {
    "city": "Latham",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "Boss Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BOSS HLDGS INC",
    "state": "NY",
    "summary": "Boss Holdings, Inc., together with its subsidiaries, imports, markets, and distributes pet supplies and cell phone accessories worldwide. The company also provides custom imprinting of inflatable and other products for advertising specialties industry. It offers its products through direct online marketing to professional groomers, boarders, and veterinarians, as well as through wholesale distribution, retailers, convenience stores, and travel centers. Boss Holdings, Inc. was founded in 1893 and is based in Kewanee, Illinois.",
    "website": "http://bossgloves.com",
    "zipcode": "12110"
  },
  "C7N.F": {
    "city": "Broomfield",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "Crocs, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CROCS INC. DL-,001",
    "state": "CO",
    "summary": "Crocs, Inc., together with its subsidiaries, designs, develops, manufactures, markets, and distributes casual lifestyle footwear and accessories for men, women, and children. It offers various footwear products, including sandals, wedges, flips, slides clogs, charms, and shoes under the Crocs brand name. The company sells its products in approximately 80 countries through wholesalers, retail stores, e-commerce sites, and third-party marketplaces. As of December 31, 2020, it had 186 outlet stores, 100 retail stores, 65 store-in-stores, and 13 company-operated e-commerce sites. The company serves in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. Crocs, Inc. was founded in 1999 and is headquartered in Broomfield, Colorado.",
    "website": "http://www.crocs.com",
    "zipcode": "80020"
  },
  "CAL": {
    "city": "Saint Louis",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Footwear & Accessories",
    "long_name": "Caleres, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Caleres, Inc.",
    "state": "MO",
    "summary": "Caleres, Inc. engages in the retail and wholesale of footwear in the United States, China, Canada, China, and Guam. It operates through Famous Footwear and Brand Portfolio segments. The company offers licensed, branded, and private-label athletic, casual, and dress footwear products to women, men, and children. Its retail shoe stores provide brand name athletic, casual, and dress shoes, including Nike, Skechers, adidas, Vans, Converse, Crocs, Puma, Birkenstock, Asics, New Balance, Under Armour, Bearpaw, Timberland, and Sperry, as well as company-owned and licensed brands, such as Dr. Scholl's Shoes, Blowfish Malibu, LifeStride, Naturalizer, Circus by Sam Edelman, Franco Sarto, and Ryka. The company also operates naturalizer.com, naturalizer.ca, vionicshoes.com, samedelman.com, allenedmonds.com, drschollsshoes.com, lifestride.com, francosarto.com, ryka.com, bzees.com, and zodiacshoes.com, as well as Vince.com, blowfishshoes.com, and veronicabeard.com websites. In addition, it designs, sources, and markets footwear to retail stores, such as national chains, online retailers, department stores, mass merchandisers, independent retailers, and catalogs. Further, the company wholesales men's apparel, leather goods, and accessories under the Allen Edmonds brand; Italian footwear Franco Sarto brand; women's shoe collection under the Vince brand; athletic footwear for women under the Ryk brand; and women's footwear under the Bzees brand, as well as Via Spiga brand. It operates approximately 1,086 retail stores. The company was formerly known as Brown Shoe Company, Inc. and changed its name to Caleres, Inc. in May 2015. Caleres, Inc. was founded in 1878 and is headquartered in St. Louis, Missouri.",
    "website": "http://www.caleres.com",
    "zipcode": "63105"
  },
  "CHSH": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "China Shoe Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CHINA SHOE HOLDINGS INC",
    "state": null,
    "summary": "China Shoe Holdings, Inc., through its subsidiaries, engages in the development, manufacture, and sale of proprietary additives; and marketing and trading of biodegradable food containers and packaging products in North America, Asia, Europe, and internationally. It offers plates, bowls, trays, lunch boxes, and mini containers used in the foodservice disposable packaging market, including quick-service restaurants, food and facilities management companies, governments, universities/colleges, and retail operations. The company markets and sells its product line to foodservice distributors through its in-house direct sales force. China Shoe Holdings, Inc. is based in Kwun Tong, Hong Kong.",
    "website": null,
    "zipcode": null
  },
  "CHSR.PA": {
    "city": "Paris",
    "country": "France",
    "currency": "EUR",
    "exchange": "PAR",
    "industry": "Footwear & Accessories",
    "long_name": "Chausseria",
    "market": "fr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CHAUSSERIA",
    "state": null,
    "summary": "Chausseria designs, manufactures, and markets women's shoes. The company markets its products under the Chausseria and Janie Philip brands through a network of 15 outlets in France. Chausseria is headquartered in Paris, France.",
    "website": "http://www.lachausseria.com",
    "zipcode": "75016"
  },
  "CPL-R.BK": {
    "city": "Samut Prakan",
    "country": "Thailand",
    "currency": "THB",
    "exchange": "SET",
    "industry": "Footwear & Accessories",
    "long_name": "CPL Group Public Company Limited",
    "market": "th_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CPL GROUP PUBLIC COMPANY LIMITE",
    "state": null,
    "summary": "CPL Group Public Company Limited manufactures and distributes leather products in Thailand. It offers footwear leather products, which include full grain and suede split leather products comprising nubuck, oil and wax, pigment, sued, and water proof leather for shoe factories; and aniline and finished splits leather. The company also provides tanning services; and manufactures and distributes personal protective equipment. In addition, it exports its products to China, Vietnam, Indonesia, India, etc. CPL Group Public Company Limited was founded in 1945 and is headquartered in Samutprakarn, Thailand.",
    "website": "http://www.cpl.co.th",
    "zipcode": "10280"
  },
  "CPL.BK": {
    "city": "Samut Prakan",
    "country": "Thailand",
    "currency": "THB",
    "exchange": "SET",
    "industry": "Footwear & Accessories",
    "long_name": "CPL Group Public Company Limited",
    "market": "th_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CPL GROUP PUBLIC COMPANY LIMITE",
    "state": null,
    "summary": "CPL Group Public Company Limited manufactures and distributes leather products in Thailand. It offers footwear leather products, which include full grain and suede split leather products comprising nubuck, oil and wax, pigment, sued, and water proof leather for shoe factories; and aniline and finished splits leather. The company also provides tanning services; and manufactures and distributes personal protective equipment. In addition, it exports its products to China, Vietnam, Indonesia, India, etc. CPL Group Public Company Limited was founded in 1945 and is headquartered in Samutprakarn, Thailand.",
    "website": "http://www.cpl.co.th",
    "zipcode": "10280"
  },
  "CROX": {
    "city": "Broomfield",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Footwear & Accessories",
    "long_name": "Crocs, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Crocs, Inc.",
    "state": "CO",
    "summary": "Crocs, Inc., together with its subsidiaries, designs, develops, manufactures, markets, and distributes casual lifestyle footwear and accessories for men, women, and children. It offers various footwear products, including sandals, wedges, flips, slides clogs, charms, and shoes under the Crocs brand name. The company sells its products in approximately 80 countries through wholesalers, retail stores, e-commerce sites, and third-party marketplaces. As of December 31, 2020, it had 186 outlet stores, 100 retail stores, 65 store-in-stores, and 13 company-operated e-commerce sites. The company serves in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. Crocs, Inc. was founded in 1999 and is headquartered in Broomfield, Colorado.",
    "website": "http://www.crocs.com",
    "zipcode": "80020"
  },
  "DECK": {
    "city": "Goleta",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Footwear & Accessories",
    "long_name": "Deckers Outdoor Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Deckers Outdoor Corporation",
    "state": "CA",
    "summary": "Deckers Outdoor Corporation, together with its subsidiaries, designs, markets, and distributes footwear, apparel, and accessories for casual lifestyle use and high performance activities. It offers premium footwear, apparel, and accessories under the UGG brand name; sport sandals, shoes, and boots under the Teva brand name; and relaxed casual shoes and sandals under the Sanuk brand name. The company also provides footwear and apparel for ultra-runners and athletes under the Hoka brand name; and fashion casual footwear using sheepskin and other plush materials under the Koolaburra brand. It sells its products through department stores, domestic independent action sports and outdoor specialty footwear retailers, and larger national retail chains, as well as online retailers. The company also sells its products directly to consumers through its retail stores and e-commerce Websites, as well as distributes its products through distributors and retailers in the United States, Europe, the Asia-Pacific, Canada, Latin America, and internationally. As of March 31, 2020, it had 145 retail stores, including 76 concept stores and 69 outlet stores worldwide. The company was founded in 1973 and is headquartered in Goleta, California.",
    "website": "http://www.deckers.com",
    "zipcode": "93117"
  },
  "DERIM.IS": {
    "city": "Istanbul",
    "country": "Turkey",
    "currency": "TRY",
    "exchange": "IST",
    "industry": "Footwear & Accessories",
    "long_name": "Derimod Konfeksiyon Ayakkabi Deri Sanayi ve Ticaret A.S.",
    "market": "tr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "DERIMOD",
    "state": null,
    "summary": "Derimod Konfeksiyon Ayakkabi Deri Sanayi ve Ticaret A.S. provides leather and fashionable products for men and women in Turkey and internationally. Its products include leather jackets and coats, bags, cross body bags, loafers, backpacks, waist bags, shoulder bags, briefcases, clutch and portfolio products, purses/wallets, wristlets, gloves, slippers, casual and classic shoes, shoe care products and accessories, belts, boots, sports shoes and sneakers, heels, and flat and heeled sandals. The company also operates stores. Derimod Konfeksiyon Ayakkabi Deri Sanayi ve Ticaret A.S. was founded in 1974 and is based in Istanbul, Turkey.",
    "website": "http://www.derimod.com.tr",
    "zipcode": null
  },
  "DESA.IS": {
    "city": "Istanbul",
    "country": "Turkey",
    "currency": "TRY",
    "exchange": "IST",
    "industry": "Footwear & Accessories",
    "long_name": "Desa Deri Sanayi ve Ticaret A.S.",
    "market": "tr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "DESA DERI",
    "state": null,
    "summary": "Desa Deri Sanayi ve Ticaret A.S. manufactures, imports, and export, and sells leather and leather products primarily in Turkey. The company offers ready-to-wear, bags, shoes, and various leather craft products for men and women. It markets and sells its products through 132 retail stores, including 63 Desa, 39 Desa Samsonite, 3 Desa franchise, 2 Albania franchise, 17 Samsonite JV, 3 Tumi, and 5 virtual stores; 2 Desa franchise store in Albania; and 109 overseas stores. The company was founded in 1972 and is headquartered in Istanbul, Turkey. Desa Deri Sanayi ve Ticaret A.S. is a subsidiary of elet Holding A.S.",
    "website": "http://www.desa.com.tr",
    "zipcode": "34295"
  },
  "DLTA.PA": {
    "city": "Apt",
    "country": "France",
    "currency": "EUR",
    "exchange": "PAR",
    "industry": "Footwear & Accessories",
    "long_name": "Delta Plus Group",
    "market": "fr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "DELTA PLUS GROUP",
    "state": null,
    "summary": "Delta Plus Group designs, manufactures, and distributes a range of personal protective equipment worldwide. It provides head protection products, including eyewear, skull, hearing, and respiratory protection products; and hand protection products, such as high tech, synthetic, leather, and knitted gloves. The company also offers body protection products comprising work wear, technical wear, outdoor wear, and disposable wear products; and foot protection products consisting of shoes, boots, and accessories. In addition, it provides fall protection products, including body support products, fall arrester systems, anchorage-work positioning products, connecting systems, and suspension and rescue products. The company was founded in 1977 and is headquartered in Apt, France.",
    "website": "http://www.deltaplusgroup.com",
    "zipcode": "84405"
  },
  "DO2.F": {
    "city": "Goleta",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "Deckers Outdoor Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "DECKERS OUTDOOR  DL-,01",
    "state": "CA",
    "summary": "Deckers Outdoor Corporation, together with its subsidiaries, designs, markets, and distributes footwear, apparel, and accessories for casual lifestyle use and high performance activities. It offers premium footwear, apparel, and accessories under the UGG brand name; sport sandals, shoes, and boots under the Teva brand name; and relaxed casual shoes and sandals under the Sanuk brand name. The company also provides footwear and apparel for ultra-runners and athletes under the Hoka brand name; and fashion casual footwear using sheepskin and other plush materials under the Koolaburra brand. It sells its products through department stores, domestic independent action sports and outdoor specialty footwear retailers, and larger national retail chains, as well as online retailers. The company also sells its products directly to consumers through its retail stores and e-commerce Websites, as well as distributes its products through distributors and retailers in the United States, Europe, the Asia-Pacific, Canada, Latin America, and internationally. As of March 31, 2020, it had 145 retail stores, including 76 concept stores and 69 outlet stores worldwide. The company was founded in 1973 and is headquartered in Goleta, California.",
    "website": "http://www.deckers.com",
    "zipcode": "93117"
  },
  "DOCMF": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "Dr. Martens plc",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "DR. MARTENS PLC",
    "state": null,
    "summary": "Dr. Martens Limited engages in the manufacture and sale of footwear in the United Kingdom and internationally. Its product segments include originals, fusion, kids and casual, and a complementary range of accessories. The company offers its products under Dr. Martens brand name. It operates Europe, the Middle East, Africa, the Americas, and the Asia-Pacific. Dr. Martens Limited was founded in 1960 and is based in London, the United Kingdom.",
    "website": "http://www.drmartensplc.com",
    "zipcode": "NW1 7BY"
  },
  "DOCS.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Footwear & Accessories",
    "long_name": "Dr. Martens plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Consumer Cyclical",
    "short_name": "DR. MARTENS PLC ORD GBP0.01",
    "state": null,
    "summary": "Dr. Martens Limited engages in the manufacture and sale of footwear in the United Kingdom and internationally. Its product segments include originals, fusion, kids and casual, and a complementary range of accessories. The company offers its products under Dr. Martens brand name. It operates Europe, the Middle East, Africa, the Americas, and the Asia-Pacific. Dr. Martens Limited was founded in 1960 and is based in London, the United Kingdom.",
    "website": "http://www.drmartensplc.com",
    "zipcode": "NW1 7BY"
  },
  "DPNEF": {
    "city": "Shanghai",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "Daphne International Holdings Limited",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "DAPHNE INTERNATIONAL HOLDINGS L",
    "state": null,
    "summary": "Daphne International Holdings Limited, an investment holding company, manufactures, distributes, and retails footwear and accessories in Mainland China, Hong Kong, and Taiwan. The company offers its products under own brands, the Daphne and Shoebox, as well as brands under exclusive distributorships. As of December 31, 2019, it operated 425 points-of-sale (POS), including 360 POS under its core brands business and 65 POS under its other brands business. It is also involved in the e-commerce and property holding businesses. The company was formerly known as Prime Success International Group Limited and changed its name to Daphne International Holdings Limited in June 2008. Daphne International Holdings Limited was founded in 1987 and is headquartered in Shanghai, China.",
    "website": "http://www.daphneholdings.com",
    "zipcode": null
  },
  "ELI.F": {
    "city": "Roanoke",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "Vera Bradley, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "VERA BRADLEY INC.  DL-,01",
    "state": "IN",
    "summary": "Vera Bradley, Inc., together with its subsidiaries, designs, manufactures, and sells women's handbags, luggage and travel items, fashion and home accessories, and gifts. It operates through three segments: Vera Bradley Direct, Vera Bradley Indirect, and Pura Vida. The company offers bag products, such as totes, crossbodies, satchels, clutches, backpacks, baby bags, and lunch bags; accessories, including wallets, wristlets, eyeglass cases, scarves, and various technology accessories; bracelets, rings, and necklaces under Pura Vida brand name; and travel products consisting of rolling luggage, cosmetics, and travel and packing accessories, as well as travel bags comprising duffel and weekend bags. It also provides home products that include throw blankets, beach towels, and comforters, as well as items, such as mugs and tumblers; apparel/footwear comprising sleepwear, footwear, cotton face masks, outerwear, socks, and scarves; and stationery and merchandising products, as well as freight, licensing, and gift card breakage services. The company sells its Vera Bradley branded products through its full-line and factory outlet stores in the United States; and verabradley.com, an online outlet site, as well as its annual outlet sale in Fort Wayne, Indiana. As of March 10, 2021, it operated 75 full-line and 69 factory outlet stores. The company sells its Pura Vida branded products through wholesale retailers, as well as through Pura Vida websites, including www.puravidabracelets.com, www.puravidabracelets.eu, and www.puravidabracelets.ca. It also sells its Vera Bradley branded products to approximately 2,000 specialty retail locations, department stores, national accounts, third party e-commerce sites, and third-party inventory liquidators, as well as through licensing agreements. Vera Bradley, Inc. was incorporated in 1982 and is headquartered in Roanoke, Indiana.",
    "website": "http://www.verabradley.com",
    "zipcode": "46783"
  },
  "FL": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Footwear & Accessories",
    "long_name": "Foot Locker, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Foot Locker, Inc.",
    "state": "NY",
    "summary": "Foot Locker, Inc., through its subsidiaries, operates as an athletic footwear and apparel retailer. The company engages in the retail of athletic footwear, apparel, accessories, equipment, and team licensed merchandise under the Foot Locker, Lady Foot Locker, Kids Foot Locker, Champs Sports, Eastbay, Footaction, Runners Point, and Sidestep brand names. As of January 30, 2021, it operated through 2,998 retail stores in 27 countries across the United States, Canada, Europe, Australia, New Zealand, and Asia; and 127 franchised Foot Locker stores located in the Middle East, as well as through various e-commerce sites and mobile apps. The company was founded in 1879 and is headquartered in New York, New York.",
    "website": "http://www.footlocker-inc.com",
    "zipcode": "10001"
  },
  "FOOT.VI": {
    "city": "New York",
    "country": "United States",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Footwear & Accessories",
    "long_name": "Foot Locker, Inc.",
    "market": "at_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "FOOT LOCKER INC",
    "state": "NY",
    "summary": "Foot Locker, Inc., through its subsidiaries, operates as an athletic footwear and apparel retailer. The company engages in the retail of athletic footwear, apparel, accessories, equipment, and team licensed merchandise under the Foot Locker, Lady Foot Locker, Kids Foot Locker, Champs Sports, Eastbay, Footaction, Runners Point, and Sidestep brand names. As of January 30, 2021, it operated through 2,998 retail stores in 27 countries across the United States, Canada, Europe, Australia, New Zealand, and Asia; and 127 franchised Foot Locker stores located in the Middle East, as well as through various e-commerce sites and mobile apps. The company was founded in 1879 and is headquartered in New York, New York.",
    "website": "http://www.footlocker-inc.com",
    "zipcode": "10001"
  },
  "FORD": {
    "city": "Hauppauge",
    "country": "United States",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Footwear & Accessories",
    "long_name": "Forward Industries, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Forward Industries, Inc.",
    "state": "NY",
    "summary": "Forward Industries, Inc., together with its subsidiaries, designs, markets, and distributes carry and protective solutions primarily for hand held electronic devices. It provides carrying cases and other accessories for medical monitoring and diagnostic kits; and other portable electronic and non-electronic products, such as sporting and recreational products, bar code scanners, smartphones, GPS location devices, tablets, firearms, and other products. The company sells its products to original equipment manufacturers in the Asia-Pacific, the Americas, Europe, the Middle East, and Africa. Forward Industries, Inc. was incorporated in 1961 and is headquartered in Hauppauge, New York.",
    "website": "http://www.forwardindustries.com",
    "zipcode": "11788"
  },
  "GEO.MI": {
    "city": "Montebelluna",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Footwear & Accessories",
    "long_name": "Geox S.p.A.",
    "market": "it_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GEOX",
    "state": "TV",
    "summary": "Geox S.p.A. creates, produces, promotes, and distributes footwear and apparel to retailers and end consumers in Italy, rest of Europe, North America, and internationally. It operates in two segments, Footwear and Apparel. The company offers shoes and jackets, as well as accessories for men, women, and children under the Geox brand name through multi-brand selling points, mono-brand shops, and Geox Shops. As of December 31, 2020, it operated 867 Geox Shops, including 457 franchised stores and 410 directly operated stores. The company was founded in 1995 and is headquartered in Montebelluna, Italy. Geox S.p.A. is a subsidiary of LIR S.r.l.",
    "website": "http://www.geox.biz",
    "zipcode": "31044"
  },
  "GHH.F": {
    "city": "Montebelluna",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "Geox S.p.A.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GEOX S.P.A.  EO-,10",
    "state": "TV",
    "summary": "Geox S.p.A. creates, produces, promotes, and distributes footwear and apparel to retailers and end consumers in Italy, rest of Europe, North America, and internationally. It operates in two segments, Footwear and Apparel. The company offers shoes and jackets, as well as accessories for men, women, and children under the Geox brand name through multi-brand selling points, mono-brand shops, and Geox Shops. As of December 31, 2020, it operated 867 Geox Shops, including 457 franchised stores and 410 directly operated stores. The company was founded in 1995 and is headquartered in Montebelluna, Italy. Geox S.p.A. is a subsidiary of LIR S.r.l.",
    "website": "http://www.geox.biz",
    "zipcode": "31044"
  },
  "GRIM.BA": {
    "city": "Buenos Aires",
    "country": "Argentina",
    "currency": "ARS",
    "exchange": "BUE",
    "industry": "Footwear & Accessories",
    "long_name": "Grimoldi S.A.",
    "market": "ar_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GRIMOLDI",
    "state": null,
    "summary": "Grimoldi S.A. manufactures and sells footwear, accessories, and dress items for men, women, and children. The company offers flip flops, tacos, clogs, ballerinas and loafers, Texans, borcegos, boots, shoes, sneakers, etc. It also provides accessories, including wallets, handbags, backpacks, warm hats, gloves, hats, outdoor backpacks, and luggage; and dresses, such as t-shirts, divers, polar, vests, jackets, pants, hose, bermuda shorts and muscular, and shirts. The company offers its products under the Hush Puppies, The North Face, Caterpillar, Grimoldi, Timberland, apie, CAT, ALDO, Merrell, Van's, and various other brands through its website and telephone. Grimoldi S.A. was founded in 1895 and is based in Buenos Aires, Argentina.",
    "website": "http://www.grimoldi.com.ar",
    "zipcode": null
  },
  "GRND3.SA": {
    "city": "Sobral",
    "country": "Brazil",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Footwear & Accessories",
    "long_name": "Grendene S.A.",
    "market": "br_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GRENDENE    ON      NM",
    "state": "CE",
    "summary": "Grendene S.A. develops, manufactures, distributes, and sells footwear for women, men, and children primarily in Brazil. The company sells its products under the Melissa, Rider, Grendha, Ipanema, Ilhabela, Zaxy, Cartago, Pega Forte, Grendene Kids, and Zizou brands. It also licenses the use of names and brands of Brazilian and international celebrities, and children's-market characters in the children's media. In addition, the company operates one Melissa showroom in Milan; a network of approximately 336 Clube Melissa franchised stores in Brazil; and four concept stores, including three Galeria Melissa stores in So Paulo, New York, and London, as well as a Casa Ipanema store in Rio de Janeiro. It sells its products through commercial representatives and distributors. The company also exports its products. Grendene S.A. was founded in 1971 and is headquartered in Sobral, Brazil.",
    "website": "http://www.grendene.com.br",
    "zipcode": "62040-125"
  },
  "GVSI": {
    "city": "Merritt Island",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "Good Vibrations Shoes Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GOOD VIBRATIONS SHOES INC",
    "state": "FL",
    "summary": "Good Vibrations Shoes Inc. does not have signification operations. It intends to offers business consulting services or to merge in substantial businesses. Previously, the company, through its subsidiary, Long Beard Brewing Company, operated craft or micro brewery in Long Island, New York. The company is based in Merritt Island, Florida.",
    "website": "http://www.goodvibrationshoes.com",
    "zipcode": "32952"
  },
  "GXSBF": {
    "city": "Montebelluna",
    "country": "Italy",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "Geox S.p.A.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "GEOX S.P.A.",
    "state": "TV",
    "summary": "Geox S.p.A. creates, produces, promotes, and distributes footwear and apparel to retailers and end consumers in Italy, rest of Europe, North America, and internationally. It operates in two segments, Footwear and Apparel. The company offers shoes and jackets, as well as accessories for men, women, and children under the Geox brand name through multi-brand selling points, mono-brand shops, and Geox Shops. As of December 31, 2020, it operated 867 Geox Shops, including 457 franchised stores and 410 directly operated stores. The company was founded in 1995 and is headquartered in Montebelluna, Italy. Geox S.p.A. is a subsidiary of LIR S.r.l.",
    "website": "http://www.geox.biz",
    "zipcode": "31044"
  },
  "KHADIM.NS": {
    "city": "Kolkata",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Footwear & Accessories",
    "long_name": "Khadim India Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "KHADIM INDIA LTD",
    "state": null,
    "summary": "Khadim India Limited manufactures, wholesales, and retails footwear primarily under the Khadim's brand. It also provides footwear and leather accessories for men, women, and children under the British Walkers, Lazard, Turk, Adrianna, Bonito, Pro, Softouch, Sharon, and Cleo brands. As of March 31, 2019, the company operated 799 Khadim's branded retail stores, as well as a network of 544 distributors selling to multi brand outlets in 23 states and 1 Union territory in India. It also exports its products. The company was formerly known as Khadim Chain Stores Limited and changed its name to Khadim India Limited in August 2005. Khadim India Limited was founded in 1981 and is based in Kolkata, India.",
    "website": "http://www.khadims.com",
    "zipcode": "700071"
  },
  "KMSWF": {
    "city": "Tsim Sha Tsui",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "Kingmaker Footwear Holdings Limited",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "KINGMAKER FOOTWEAR HLDGS",
    "state": null,
    "summary": "Kingmaker Footwear Holdings Limited, an investment holding company, manufactures and sells footwear products in the United States, Europe, Asia, and internationally. The company's products include athletic footwear; lifestyle shoes, such as casual shoes, ath-leisure shoes, etc.; rugged footwear, including moutain climbing shoes, waterproof shoes, steel-toed shoes, hand-stitched shoes, boots, etc.; and children's shoes, such as boy's shoes, girl's shoes, infant shoes, etc. It also engages in the business of property holding and the provision of administrative services. Kingmaker Footwear Holdings Limited was founded in 1980 and is headquartered in Tsim Sha Tsui, Hong Kong.",
    "website": "http://www.kingmaker-footwear.com",
    "zipcode": null
  },
  "LIBERTSHOE.NS": {
    "city": "Karnal",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Footwear & Accessories",
    "long_name": "Liberty Shoes Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LIBERTY SHOES",
    "state": null,
    "summary": "Liberty Shoes Limited manufactures and trades in footwear, accessories, and lifestyle products in India and internationally. The company offers footwear products, such as casual, formal, sports, fashion, women, kids, and men footwear under the AHA, Coolers, Footfun, Force 10, Fortune, Gliders, Healers, Leap7X, Perfect, and Senorita brands. It operates through 100 distributors and 425 exclusive showrooms, as well as online. Liberty Shoes Limited was founded in 1954 and is headquartered in Karnal, India.",
    "website": "http://www.libertyshoes.com",
    "zipcode": "132001"
  },
  "MCRAA": {
    "city": "Mount Gilead",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "McRae Industries, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MCRAE INDUSTRIES INC",
    "state": "NC",
    "summary": "McRae Industries, Inc. manufactures and sells military combat boots for the United States Army. The company also imports and sells western and work boots. It offers its products for men, women, and children under the Dan Post, Laredo Western Boots, Dingo, John Deere, Johnny Poppers, McRae Industrial, and McRae Footwear brand names. McRae Industries, Inc. was founded in 1959 and is headquartered in Mount Gilead, North Carolina.",
    "website": "http://www.mcraeindustries.com",
    "zipcode": "27306"
  },
  "MCRAB": {
    "city": "Mount Gilead",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "McRae Industries, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MCRAE INDUSTRIES INC",
    "state": "NC",
    "summary": "McRae Industries, Inc. manufactures and sells military combat boots for the United States Army. The company also imports and sells western and work boots. It offers its products for men, women, and children under the Dan Post, Laredo Western Boots, Dingo, John Deere, Johnny Poppers, McRae Industrial, and McRae Footwear brand names. McRae Industries, Inc. was founded in 1959 and is headquartered in Mount Gilead, North Carolina.",
    "website": "http://www.mcraeindustries.com",
    "zipcode": "27306"
  },
  "MIRZAINT.NS": {
    "city": "Kanpur",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Footwear & Accessories",
    "long_name": "Mirza International Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MIRZA INTERNATIONA",
    "state": null,
    "summary": "Mirza International Limited manufactures and markets leather footwear and finished leather products in India and internationally. It operates through three segments: Tannery Division, Shoe Division, and Garments/Accessories Division. The company offers men's and women's footwear; and formal, semi-formal, and casual footwear. It also provides men's casual and semi-formal wear, including shirts, T-shirts, trousers, denims, sweaters, and jackets, as well as accessories, such as belts, socks, hankies, and wallets; and women's clothing. The company sells its products under the REDTAPE, REDTAPE Athleisure, Bond Street, Oaktrak, YEZDI, and MODE brands through multi-brand outlets, chain stores, exclusive brand outlets, and e-commerce platforms, as well as online stores. Mirza International Limited also exports its products. The company was formerly known as Mirza Tanners Limited. Mirza International Limited was founded in 1979 and is headquartered in Kanpur, India.",
    "website": "http://www.mirza.co.in",
    "zipcode": "208001"
  },
  "MUL.L": {
    "city": "Bath",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Footwear & Accessories",
    "long_name": "Mulberry Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Consumer Cyclical",
    "short_name": "MULBERRY GROUP PLC ORD 5P",
    "state": null,
    "summary": "Mulberry Group plc, through its subsidiaries, develops, manufactures, and sells fashion accessories, clothing, and footwear in the United Kingdom, rest of Europe, Asia, North America, and internationally. The company offers shoulder, satchel, tote, clutch, backpack, and mini and micro bags; and dresses, tops and knitwear, skirts and pants, and jackets and coats for women. It also provides briefcases, messenger bags, and backpack; wallets, and purses and pouches; sunglasses, scarves, gloves and hats, belts, cufflinks, keyrings, shoes; jewellery, organisers, and care products; gifts; and luggage, holdalls, bag, and other travel accessories for men and women. The company sells its products through its retail shops, concessions, and wholesale distribution channels under the Mulberry brand. It also sells its products online. Mulberry Group plc was founded in 1971 and is based in Bath, the United Kingdom. Mulberry Group plc is a subsidiary of Challice Limited.",
    "website": "http://www.mulberry.com",
    "zipcode": "BA3 4EH"
  },
  "NIKE34.SA": {
    "city": "Beaverton",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Footwear & Accessories",
    "long_name": "NIKE, Inc.",
    "market": "br_market",
    "market_cap": "Mega Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NIKE        DRN",
    "state": "OR",
    "summary": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells athletic footwear, apparel, equipment, and accessories worldwide. The company offers NIKE brand products in six categories, including running, NIKE basketball, the Jordan brand, football, training, and sportswear. It also markets products designed for kids, as well as for other athletic and recreational uses, such as American football, baseball, cricket, golf, lacrosse, skateboarding, tennis, volleyball, walking, wrestling, and other outdoor activities; and apparel with licensed college and professional team and league logos, as well as sells sports apparel. In addition, the company sells a line of performance equipment and accessories comprising bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities; and various plastic products to other manufacturers. Further, it provides athletic and casual footwear, apparel, and accessories under the Jumpman trademark; casual sneakers, apparel, and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks; and action sports and youth lifestyle apparel and accessories under the Hurley trademark. Additionally, the company licenses agreements that permit unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was formerly known as Blue Ribbon Sports, Inc. and changed its name to NIKE, Inc. in 1971. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.",
    "website": "http://www.nike.com",
    "zipcode": "97005"
  },
  "NKE": {
    "city": "Beaverton",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Footwear & Accessories",
    "long_name": "NIKE, Inc.",
    "market": "us_market",
    "market_cap": "Mega Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Nike, Inc.",
    "state": "OR",
    "summary": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells athletic footwear, apparel, equipment, and accessories worldwide. The company offers NIKE brand products in six categories, including running, NIKE basketball, the Jordan brand, football, training, and sportswear. It also markets products designed for kids, as well as for other athletic and recreational uses, such as American football, baseball, cricket, golf, lacrosse, skateboarding, tennis, volleyball, walking, wrestling, and other outdoor activities; and apparel with licensed college and professional team and league logos, as well as sells sports apparel. In addition, the company sells a line of performance equipment and accessories comprising bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities; and various plastic products to other manufacturers. Further, it provides athletic and casual footwear, apparel, and accessories under the Jumpman trademark; casual sneakers, apparel, and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks; and action sports and youth lifestyle apparel and accessories under the Hurley trademark. Additionally, the company licenses agreements that permit unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was formerly known as Blue Ribbon Sports, Inc. and changed its name to NIKE, Inc. in 1971. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.",
    "website": "http://www.nike.com",
    "zipcode": "97005"
  },
  "NKE.BA": {
    "city": "Beaverton",
    "country": "United States",
    "currency": "ARS",
    "exchange": "BUE",
    "industry": "Footwear & Accessories",
    "long_name": "NIKE, Inc.",
    "market": "ar_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NIKE INC",
    "state": "OR",
    "summary": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells athletic footwear, apparel, equipment, and accessories worldwide. The company offers NIKE brand products in six categories, including running, NIKE basketball, the Jordan brand, football, training, and sportswear. It also markets products designed for kids, as well as for other athletic and recreational uses, such as American football, baseball, cricket, golf, lacrosse, skateboarding, tennis, volleyball, walking, wrestling, and other outdoor activities; and apparel with licensed college and professional team and league logos, as well as sells sports apparel. In addition, the company sells a line of performance equipment and accessories comprising bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities; and various plastic products to other manufacturers. Further, it provides athletic and casual footwear, apparel, and accessories under the Jumpman trademark; casual sneakers, apparel, and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks; and action sports and youth lifestyle apparel and accessories under the Hurley trademark. Additionally, the company licenses agreements that permit unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was formerly known as Blue Ribbon Sports, Inc. and changed its name to NIKE, Inc. in 1971. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.",
    "website": "http://www.nike.com",
    "zipcode": "97005"
  },
  "NKE.DE": {
    "city": "Beaverton",
    "country": "United States",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Footwear & Accessories",
    "long_name": "NIKE, Inc.",
    "market": "de_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NIKE INC. B",
    "state": "OR",
    "summary": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells athletic footwear, apparel, equipment, and accessories worldwide. The company offers NIKE brand products in six categories, including running, NIKE basketball, the Jordan brand, football, training, and sportswear. It also markets products designed for kids, as well as for other athletic and recreational uses, such as American football, baseball, cricket, golf, lacrosse, skateboarding, tennis, volleyball, walking, wrestling, and other outdoor activities; and apparel with licensed college and professional team and league logos, as well as sells sports apparel. In addition, the company sells a line of performance equipment and accessories comprising bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities; and various plastic products to other manufacturers. Further, it provides athletic and casual footwear, apparel, and accessories under the Jumpman trademark; casual sneakers, apparel, and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks; and action sports and youth lifestyle apparel and accessories under the Hurley trademark. Additionally, the company licenses agreements that permit unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was formerly known as Blue Ribbon Sports, Inc. and changed its name to NIKE, Inc. in 1971. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.",
    "website": "http://www.nike.com",
    "zipcode": "97005"
  },
  "NKE.F": {
    "city": "Beaverton",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "NIKE, Inc.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NIKE INC. B",
    "state": "OR",
    "summary": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells athletic footwear, apparel, equipment, and accessories worldwide. The company offers NIKE brand products in six categories, including running, NIKE basketball, the Jordan brand, football, training, and sportswear. It also markets products designed for kids, as well as for other athletic and recreational uses, such as American football, baseball, cricket, golf, lacrosse, skateboarding, tennis, volleyball, walking, wrestling, and other outdoor activities; and apparel with licensed college and professional team and league logos, as well as sells sports apparel. In addition, the company sells a line of performance equipment and accessories comprising bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities; and various plastic products to other manufacturers. Further, it provides athletic and casual footwear, apparel, and accessories under the Jumpman trademark; casual sneakers, apparel, and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks; and action sports and youth lifestyle apparel and accessories under the Hurley trademark. Additionally, the company licenses agreements that permit unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was formerly known as Blue Ribbon Sports, Inc. and changed its name to NIKE, Inc. in 1971. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.",
    "website": "http://www.nike.com",
    "zipcode": "97005"
  },
  "NKE.MX": {
    "city": "Beaverton",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Footwear & Accessories",
    "long_name": "NIKE, Inc.",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NIKE INC",
    "state": "OR",
    "summary": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells athletic footwear, apparel, equipment, and accessories worldwide. The company offers NIKE brand products in six categories, including running, NIKE basketball, the Jordan brand, football, training, and sportswear. It also markets products designed for kids, as well as for other athletic and recreational uses, such as American football, baseball, cricket, golf, lacrosse, skateboarding, tennis, volleyball, walking, wrestling, and other outdoor activities; and apparel with licensed college and professional team and league logos, as well as sells sports apparel. In addition, the company sells a line of performance equipment and accessories comprising bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities; and various plastic products to other manufacturers. Further, it provides athletic and casual footwear, apparel, and accessories under the Jumpman trademark; casual sneakers, apparel, and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks; and action sports and youth lifestyle apparel and accessories under the Hurley trademark. Additionally, the company licenses agreements that permit unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was formerly known as Blue Ribbon Sports, Inc. and changed its name to NIKE, Inc. in 1971. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.",
    "website": "http://www.nike.com",
    "zipcode": "97005"
  },
  "NKE.SN": {
    "city": "Beaverton",
    "country": "United States",
    "currency": "USD",
    "exchange": "SGO",
    "industry": "Footwear & Accessories",
    "long_name": "NIKE, Inc.",
    "market": "cl_market",
    "market_cap": "Mega Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NIKE INC",
    "state": "OR",
    "summary": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells athletic footwear, apparel, equipment, and accessories worldwide. The company offers NIKE brand products in six categories, including running, NIKE basketball, the Jordan brand, football, training, and sportswear. It also markets products designed for kids, as well as for other athletic and recreational uses, such as American football, baseball, cricket, golf, lacrosse, skateboarding, tennis, volleyball, walking, wrestling, and other outdoor activities; and apparel with licensed college and professional team and league logos, as well as sells sports apparel. In addition, the company sells a line of performance equipment and accessories comprising bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities; and various plastic products to other manufacturers. Further, it provides athletic and casual footwear, apparel, and accessories under the Jumpman trademark; casual sneakers, apparel, and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks; and action sports and youth lifestyle apparel and accessories under the Hurley trademark. Additionally, the company licenses agreements that permit unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was formerly known as Blue Ribbon Sports, Inc. and changed its name to NIKE, Inc. in 1971. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.",
    "website": "http://www.nike.com",
    "zipcode": "97005"
  },
  "NKE.VI": {
    "city": "Beaverton",
    "country": "United States",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Footwear & Accessories",
    "long_name": "NIKE, Inc.",
    "market": "at_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NIKE INC -CL B",
    "state": "OR",
    "summary": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells athletic footwear, apparel, equipment, and accessories worldwide. The company offers NIKE brand products in six categories, including running, NIKE basketball, the Jordan brand, football, training, and sportswear. It also markets products designed for kids, as well as for other athletic and recreational uses, such as American football, baseball, cricket, golf, lacrosse, skateboarding, tennis, volleyball, walking, wrestling, and other outdoor activities; and apparel with licensed college and professional team and league logos, as well as sells sports apparel. In addition, the company sells a line of performance equipment and accessories comprising bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities; and various plastic products to other manufacturers. Further, it provides athletic and casual footwear, apparel, and accessories under the Jumpman trademark; casual sneakers, apparel, and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks; and action sports and youth lifestyle apparel and accessories under the Hurley trademark. Additionally, the company licenses agreements that permit unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was formerly known as Blue Ribbon Sports, Inc. and changed its name to NIKE, Inc. in 1971. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.",
    "website": "http://www.nike.com",
    "zipcode": "97005"
  },
  "ORUP.ME": {
    "city": "Novosibirsk",
    "country": "Russia",
    "currency": "RUB",
    "exchange": "MCX",
    "industry": "Footwear & Accessories",
    "long_name": "Public Joint-Stock Company OR",
    "market": "ru_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "OR PUB JOINT STK C",
    "state": null,
    "summary": "Public Joint-Stock Company OR engages in the manufacture, wholesale, retail, and franchising of footwear, accessories, and related products in Russia. It offers men's and women's footwear products; summer, beach, sport, hiking, and garden-style shoes; and sneakers, and spring-autumn and winter boots, as well as winter and seasonal jackets, windcheaters, and raincoats. As of December 31, 2019, the company operates 908 retail stores, which provides its products under the Westfalika, Peshekhod, Emilia Estra, Rossita, Lisette, S-TEP, All.Go, and Snow Guard brand names. It also provides a range of financial services, such as payment through installments, cash loans, cash payments, etc. In addition, the company operates online stores, such as westfalika.ru, emilia-estra.ru, westfalika-home.ru, lisette.me, and rossita.com. It also engages in the research and development activities in natural sciences and engineering. Public Joint-Stock Company OR was founded in 2003 and is headquartered in Novosibirsk, Russia.",
    "website": "http://obuvrus.ru",
    "zipcode": "630110"
  },
  "P5C.F": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "Pou Sheng International (Holdings) Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "POU SHENG INTL HLD.HD-,25",
    "state": null,
    "summary": "Pou Sheng International (Holdings) Limited, an investment holding company, engages in retailing sportswear in the People's Republic of China. It is involved in the distribution and retail of sportswear and footwear products; and lease of commercial spaces to retailers and distributors for concessionaire sales. The company also distributes licensed products; and manufactures sportswear. In addition, it is involved in the property leasing and management activities; organization of sports events; and provision of sports services. As of December 31, 2020, it had 5,240 directly operated stores and 3,835 sub-distributor stores. The company was founded in 1992 and is based in Kwun Tong, Hong Kong. Pou Sheng International (Holdings) Limited is a subsidiary of Major Focus Management Limited.",
    "website": "http://www.pousheng.com",
    "zipcode": null
  },
  "PAF.BK": {
    "city": "Si Racha",
    "country": "Thailand",
    "currency": "THB",
    "exchange": "SET",
    "industry": "Footwear & Accessories",
    "long_name": "Pan Asia Footwear Public Company Limited",
    "market": "th_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PAN ASIA FOOTWEAR PUBLIC COMPAN",
    "state": null,
    "summary": "Pan Asia Footwear Public Company Limited engages in the manufacture and distribution of footwear and bags in Thailand. It is also involved in the manufacture of soles and parts for footwear; manufacture and distribution of plastic parts and injection; manufacture, repair, and maintenance of molds; dyeing of fabrics; and manufacture of polypropylene cutting board and eyelets, as well as organic farming business activities. The company was incorporated in 1994 and is based in Si Racha, Thailand.",
    "website": "http://www.paf-group.com",
    "zipcode": "20230"
  },
  "PMMAF": {
    "city": "Herzogenaurach",
    "country": "Germany",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "PUMA SE",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PUMA SE",
    "state": null,
    "summary": "PUMA SE, together with its subsidiaries, designs, develops, sells, and markets footwear, apparel, and accessories in Europe, the Middle East, Africa, the Americas and, the Asia Pacific. The company offers performance and sport-inspired lifestyle products in categories, such as football, cricket, handball, rugby, volleyball, running, training and fitness, golf, and motorsports. It also issues licenses to independent partners to design, develop, manufacture, and sell watches, glasses, safety shoes, and gaming accessories such as the Playseat. The company sells its products through PUMA retail stores and factory outlets, as well as through online stores. It offers its products primarily under the PUMA and Cobra Golf brand names. The company was founded in 1924 and is headquartered in Herzogenaurach, Germany.",
    "website": "http://www.puma.com",
    "zipcode": "91074"
  },
  "PQ.MI": {
    "city": "Bologna",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Footwear & Accessories",
    "long_name": "Piquadro S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PIQUADRO",
    "state": "BO",
    "summary": "Piquadro S.p.A. designs, manufactures, and sells bags and accessories in Italy. The company was founded in 1987 and is based in Bologna, Italy.",
    "website": "http://www.piquadro.com",
    "zipcode": "40041"
  },
  "PRAB.PR": {
    "city": "Slavicn",
    "country": "Czech Republic",
    "currency": "CZK",
    "exchange": "PRA",
    "industry": "Footwear & Accessories",
    "long_name": "Prabos plus a.s.",
    "market": "cz_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PRABOS PLUS",
    "state": null,
    "summary": "Prabos plus a.s. manufactures and sells footwear in the Czech Republic, Latvia, Afghanistan, the Slovak Republic, and Poland. It offers safety, free time, fire and rescue, and uniform footwear. The company was founded in 1860 and is based in Slavicn, the Czech Republic.",
    "website": "http://prabos.cz",
    "zipcode": "763 21"
  },
  "PSX.F": {
    "city": "Shanghai",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "Daphne International Holdings Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "DAPHNE INTL HLDGS HD -,10",
    "state": null,
    "summary": "Daphne International Holdings Limited, an investment holding company, manufactures, distributes, and retails footwear and accessories in Mainland China, Hong Kong, and Taiwan. The company offers its products under own brands, the Daphne and Shoebox, as well as brands under exclusive distributorships. As of December 31, 2019, it operated 425 points-of-sale (POS), including 360 POS under its core brands business and 65 POS under its other brands business. It is also involved in the e-commerce and property holding businesses. The company was formerly known as Prime Success International Group Limited and changed its name to Daphne International Holdings Limited in June 2008. Daphne International Holdings Limited was founded in 1987 and is headquartered in Shanghai, China.",
    "website": "http://www.daphneholdings.com",
    "zipcode": null
  },
  "PTD.L": {
    "city": "Yeovil",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Footwear & Accessories",
    "long_name": "Pittards plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Consumer Cyclical",
    "short_name": "PITTARDS PLC ORD 50P",
    "state": null,
    "summary": "Pittards plc designs, produces, procures, and sells leather products in the United Kingdom, Europe, North America, the Far East, and internationally. The company operates in UK and Ethiopia divisions. It is also involved in the production and retail of leather goods and garments, bags, shoes, and gloves; and provision of consultancy and other related services to the leather industry. In addition, the company exports its products to approximately 44 countries and four continents. It serves manufacturers and distributors of shoes, gloves, luxury leather goods, interiors, and sports equipment. Pittards plc was founded in 1826 and is headquartered in Yeovil, the United Kingdom.",
    "website": "http://www.pittards.com",
    "zipcode": "BA21 5BA"
  },
  "PUM.DE": {
    "city": "Herzogenaurach",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Footwear & Accessories",
    "long_name": "PUMA SE",
    "market": "de_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PUMA SE",
    "state": null,
    "summary": "PUMA SE, together with its subsidiaries, designs, develops, sells, and markets footwear, apparel, and accessories in Europe, the Middle East, Africa, the Americas and, the Asia Pacific. The company offers performance and sport-inspired lifestyle products in categories, such as football, cricket, handball, rugby, volleyball, running, training and fitness, golf, and motorsports. It also issues licenses to independent partners to design, develop, manufacture, and sell watches, glasses, safety shoes, and gaming accessories such as the Playseat. The company sells its products through PUMA retail stores and factory outlets, as well as through online stores. It offers its products primarily under the PUMA and Cobra Golf brand names. The company was founded in 1924 and is headquartered in Herzogenaurach, Germany.",
    "website": "http://www.puma.com",
    "zipcode": "91074"
  },
  "PUM.F": {
    "city": "Herzogenaurach",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "PUMA SE",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PUMA SE",
    "state": null,
    "summary": "PUMA SE, together with its subsidiaries, designs, develops, sells, and markets footwear, apparel, and accessories in Europe, the Middle East, Africa, the Americas and, the Asia Pacific. The company offers performance and sport-inspired lifestyle products in categories, such as football, cricket, handball, rugby, volleyball, running, training and fitness, golf, and motorsports. It also issues licenses to independent partners to design, develop, manufacture, and sell watches, glasses, safety shoes, and gaming accessories such as the Playseat. The company sells its products through PUMA retail stores and factory outlets, as well as through online stores. It offers its products primarily under the PUMA and Cobra Golf brand names. The company was founded in 1924 and is headquartered in Herzogenaurach, Germany.",
    "website": "http://www.puma.com",
    "zipcode": "91074"
  },
  "PUM.VI": {
    "city": "Herzogenaurach",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Footwear & Accessories",
    "long_name": "PUMA SE",
    "market": "at_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PUMA SE",
    "state": null,
    "summary": "PUMA SE, together with its subsidiaries, designs, develops, sells, and markets footwear, apparel, and accessories in Europe, the Middle East, Africa, the Americas and, the Asia Pacific. The company offers performance and sport-inspired lifestyle products in categories, such as football, cricket, handball, rugby, volleyball, running, training and fitness, golf, and motorsports. It also issues licenses to independent partners to design, develop, manufacture, and sell watches, glasses, safety shoes, and gaming accessories such as the Playseat. The company sells its products through PUMA retail stores and factory outlets, as well as through online stores. It offers its products primarily under the PUMA and Cobra Golf brand names. The company was founded in 1924 and is headquartered in Herzogenaurach, Germany.",
    "website": "http://www.puma.com",
    "zipcode": "91074"
  },
  "PUMA.F": {
    "city": "Herzogenaurach",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "PUMA SE",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PUMA SE  UNSP.ADR 1/10",
    "state": null,
    "summary": "PUMA SE, together with its subsidiaries, designs, develops, sells, and markets footwear, apparel, and accessories in Europe, the Middle East, Africa, the Americas and, the Asia Pacific. The company offers performance and sport-inspired lifestyle products in categories, such as football, cricket, handball, rugby, volleyball, running, training and fitness, golf, and motorsports. It also issues licenses to independent partners to design, develop, manufacture, and sell watches, glasses, safety shoes, and gaming accessories such as the Playseat. The company sells its products through PUMA retail stores and factory outlets, as well as through online stores. It offers its products primarily under the PUMA and Cobra Golf brand names. The company was founded in 1924 and is headquartered in Herzogenaurach, Germany.",
    "website": "http://www.puma.com",
    "zipcode": "91074"
  },
  "PUMSY": {
    "city": "Herzogenaurach",
    "country": "Germany",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "PUMA SE",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PUMA SE",
    "state": null,
    "summary": "PUMA SE, together with its subsidiaries, designs, develops, sells, and markets footwear, apparel, and accessories in Europe, the Middle East, Africa, the Americas and, the Asia Pacific. The company offers performance and sport-inspired lifestyle products in categories, such as football, cricket, handball, rugby, volleyball, running, training and fitness, golf, and motorsports. It also issues licenses to independent partners to design, develop, manufacture, and sell watches, glasses, safety shoes, and gaming accessories such as the Playseat. The company sells its products through PUMA retail stores and factory outlets, as well as through online stores. It offers its products primarily under the PUMA and Cobra Golf brand names. The company was founded in 1924 and is headquartered in Herzogenaurach, Germany.",
    "website": "http://www.puma.com",
    "zipcode": "91074"
  },
  "PXFG": {
    "city": "Carlsbad",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "Phoenix Footwear Group, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PHOENIX FOOTWEAR GROUP INC",
    "state": "CA",
    "summary": "Phoenix Footwear Group, Inc. designs, develops, markets, and sells women's footwear primarily in the United States. The company offers its products under the Trotters and SoftWalk brand names. It distributes its products through department stores, specialty and independent retail stores, mail order catalogues, and Internet retailers, as well as directly to consumers through SoftWalkshoes.com and trotters.com Websites. Phoenix Footwear Group, Inc. was founded in 1882 and is headquartered in Carlsbad, California.",
    "website": "http://www.phoenixfootwear.com",
    "zipcode": "92008"
  },
  "QING": {
    "city": "Qingdao",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "Qingdao Footwear, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "QINGDAO FOOTWEAR INC",
    "state": null,
    "summary": "Qingdao Footwear, Inc. designs and retails branded footwear in Northern China. The company designs and sells men's and women's leather shoe lines under the Hongguan brand name. It operates stores in greater Qingdao. The company also markets its products through a distribution network of authorized independent distributors, as well as through third party retailers. Qingdao Footwear, Inc. was founded in 2003 and is headquartered in Qingdao, the People's Republic of China.",
    "website": null,
    "zipcode": null
  },
  "RBNW": {
    "city": "North Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "Renewable Energy and Power, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "RENEWABLE ENERGY & POWER INC",
    "state": "NV",
    "summary": "Renewable Energy and Power, Inc. engages in the business of new and retrofit applications for light emitting diode (LED) lighting and solar electrical generation. The company produces and markets LED light fixtures and components for the residential and commercial markets. It also focuses on developing Solar Hybrid, for use in solar energy conversion to electricity. The company sells its products to various business groups, including outdoor advertising industry, parking lot lights, and lighting of sales and inventory areas for car dealers. In addition, it extracts, manufactures, and sells CBD cannabinoids, flavonoids, and terpenes. The company was founded in 2012 and is based in North Las Vegas, Nevada.",
    "website": "http://www.reappower.com",
    "zipcode": "89032"
  },
  "RCK.F": {
    "city": "Nelsonville",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "Rocky Brands, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ROCKY BRANDS INC.",
    "state": "OH",
    "summary": "Rocky Brands, Inc. designs, manufactures, and markets footwear and apparel under the Rocky, Georgia Boot, Durango, Lehigh, and licensed Michelin brand names in the United States, Canada, and internationally. It operates through three segments: Wholesale, Retail, and Military. The Wholesale segment offers products in approximately 10,000 retail locations through a range of distribution channels comprising sporting goods stores, outdoor retailers, independent shoe retailers, hardware stores, catalogs, mass merchants, uniform stores, farm store chains, specialty safety stores, and specialty and online retailers. The Retail segment sells its products directly to consumers through its e-commerce websites, including rockyboots.com, georgiaboot.com, durangoboot.com, lehighoutfitters.com, lehighsafetyshoes.com, slipgrips.com, and 4eursole.com; Rocky outlet store in Nelsonville, Ohio; and retail stores. The Military segment focuses on building footwear contracts with the U.S. military. It serves industrial and construction workers, as well as workers in the hospitality industry, such as restaurants or hotels; farmers and ranchers; consumers enamored with western influenced fashion; commercial military personnel; hunting, fishing, camping, and hiking enthusiasts; law enforcement, security personnel, and postal employees; and for the U.S. military personnel. Rocky Brands, Inc. was founded in 1932 and is headquartered in Nelsonville, Ohio.",
    "website": "http://www.rockybrands.com",
    "zipcode": "45764"
  },
  "RCKY": {
    "city": "Nelsonville",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Footwear & Accessories",
    "long_name": "Rocky Brands, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Rocky Brands, Inc.",
    "state": "OH",
    "summary": "Rocky Brands, Inc. designs, manufactures, and markets footwear and apparel under the Rocky, Georgia Boot, Durango, Lehigh, and licensed Michelin brand names in the United States, Canada, and internationally. It operates through three segments: Wholesale, Retail, and Military. The Wholesale segment offers products in approximately 10,000 retail locations through a range of distribution channels comprising sporting goods stores, outdoor retailers, independent shoe retailers, hardware stores, catalogs, mass merchants, uniform stores, farm store chains, specialty safety stores, and specialty and online retailers. The Retail segment sells its products directly to consumers through its e-commerce websites, including rockyboots.com, georgiaboot.com, durangoboot.com, lehighoutfitters.com, lehighsafetyshoes.com, slipgrips.com, and 4eursole.com; Rocky outlet store in Nelsonville, Ohio; and retail stores. The Military segment focuses on building footwear contracts with the U.S. military. It serves industrial and construction workers, as well as workers in the hospitality industry, such as restaurants or hotels; farmers and ranchers; consumers enamored with western influenced fashion; commercial military personnel; hunting, fishing, camping, and hiking enthusiasts; law enforcement, security personnel, and postal employees; and for the U.S. military personnel. Rocky Brands, Inc. was founded in 1932 and is headquartered in Nelsonville, Ohio.",
    "website": "http://www.rockybrands.com",
    "zipcode": "45764"
  },
  "RELAXO.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Footwear & Accessories",
    "long_name": "Relaxo Footwears Limited",
    "market": "in_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "RELAXO FOOTWEARS",
    "state": null,
    "summary": "Relaxo Footwears Limited manufactures and sells footwear for men, women, and children worldwide. It offers footwear, which includes slippers, canvas shoes, rubber flip flops, EVA injected flip flops, PVC DIP shoes, sport shoes, sandals, and PVC DIP casuals. The company operates a portfolio of brands, such as Relaxo, Bahamas, Flite, Sparx, and Schoolmate. It sells its products through distributors and retail stores; and e-commerce platforms. The company also exports its products. Relaxo Footwears Limited was founded in 1976 and is based in New Delhi, India.",
    "website": "http://www.relaxofootwear.com",
    "zipcode": "110085"
  },
  "RSP.BK": {
    "city": "Bangkok",
    "country": "Thailand",
    "currency": "THB",
    "exchange": "SET",
    "industry": "Footwear & Accessories",
    "long_name": "Rich Sport Public Company Limited",
    "market": "th_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "RICH SPORT PUBLIC COMPANY LIMIT",
    "state": null,
    "summary": "Rich Sport Public Company Limited manufactures and sells sneakers and apparel products in Thailand and internationally. Its products include sneakers for men, women, and kids; and tees, pants, shorts, leggings, and jackets for men and women, as well as accessories, such as bags, caps, hats, socks, and laces. The company offers its products primarily under the All Star, Cons, and Jack Purcell names. Rich Sport Public Company Limited was founded in 1908 and is based in Bangkok, Thailand.",
    "website": "http://www.converse.co.th",
    "zipcode": "10110"
  },
  "SAFARI.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Footwear & Accessories",
    "long_name": "Safari Industries (India) Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Safari Ind (India) Ltd",
    "state": null,
    "summary": "Safari Industries (India) Limited manufactures and markets luggage and luggage related accessories in India. Its products include hard, soft, lightweight, and TSA luggage bags; casual, laptop, and concept backpacks; rucksucks; and overnighters. It sells its products under the Safari, Magnum, Genius, and Genie brands through stores, as well as through online. Safari Industries (India) Limited was incorporated in 1980 and is based in Mumbai, India.",
    "website": "http://www.safaribags.com",
    "zipcode": "400059"
  },
  "SAML": {
    "city": "Hackensack",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "Samsara Luggage, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SAMSARA LUGGUAGE INC",
    "state": "NJ",
    "summary": "Samsara Luggage, Inc. designs, develops, manufactures, and sells smart luggage products for travelers worldwide. It primarily offers aluminum suitcases. The company sells its products directly to customers through its Website, as well as through other online sites. Samsara Luggage, Inc. is based in Hackensack, New Jersey.",
    "website": "http://www.samsaraluggage.com",
    "zipcode": "07601"
  },
  "SHOE.L": {
    "city": "Leicester",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Footwear & Accessories",
    "long_name": "Shoe Zone plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Consumer Cyclical",
    "short_name": "SHOE ZONE PLC ORD 1P",
    "state": null,
    "summary": "Shoe Zone plc operates as a footwear retailer in the United Kingdom and the Republic of Ireland. The company offers shoes for men, women, boys, and girls. It operates 500 stores and shoezone.com, a Website. The company was incorporated in 2014 and is headquartered in Leicester, the United Kingdom.",
    "website": "http://www.shoezone.com",
    "zipcode": "LE1 2LH"
  },
  "SHOO": {
    "city": "Long Island City",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Footwear & Accessories",
    "long_name": "Steven Madden, Ltd.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Steven Madden, Ltd.",
    "state": "NY",
    "summary": "Steven Madden, Ltd. designs, sources, markets, and sells fashion-forward branded and private label footwear for women, men, and children in the United States and internationally. Its Wholesale Footwear segment provides footwear under the Steve Madden Women's, Madden Girl, Steve Madden Men's, Madden, Steven, Steve Madden Kids, Betsey Johnson, Report, Mad Love, Blondo, GREATS, and Anne Klein brands, as well as private label footwear. The company's Wholesale Accessories segment offers Steve Madden, Steven by Steve Madden, Madden Girl, Betsey Johnson, Big Buddha, Anne Klein, Luv Betsey, BB Dakota, BB Dakota x Steve Madden, and Cupcakes & Cashmere brands; private label fashion handbags and accessories to department stores, mass merchants, value priced retailers, online retailers, and specialty stores; and cold weather accessories, fashion scarves, wraps, and other trend accessories primarily under the Steve Madden, BB Dakota, Cejon, Betsey Johnson, and Big Buddha brand names, as well as private labels to department stores and specialty stores. Its Retail segment operates Steve Madden, Steven, Superga, and International retail stores, as well as Steve Madden, Superga, Betsey Johnson, Blondo, Dolce Vita, GREATS, and BB Dakota e-commerce websites. The company's Licensing segment licenses its Steve Madden, Steven by Steve Madden, Madden Girl, Betsey Johnson, Dolce Vita, and FREEBIRD by Steven trademarks. Its First Cost segment operates as a buying agent for footwear products under private labels for mass-market merchandisers, shoe chains, and other mid-tier retailers. As of December 31, 2020, it owned and operated 218 retail stores, including 143 Steve Madden full-price stores, 66 Steve Madden outlet stores, 1 Steven store, and 1 Superga store, as well as 7 e-commerce websites. Steven Madden, Ltd. was founded in 1990 and is headquartered in Long Island City, New York.",
    "website": "http://www.stevemadden.com",
    "zipcode": "11104"
  },
  "SJM.F": {
    "city": "Long Island City",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "Steven Madden, Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "STEVEN MADDEN  DL-,0001",
    "state": "NY",
    "summary": "Steven Madden, Ltd. designs, sources, markets, and sells fashion-forward branded and private label footwear for women, men, and children in the United States and internationally. Its Wholesale Footwear segment provides footwear under the Steve Madden Women's, Madden Girl, Steve Madden Men's, Madden, Steven, Steve Madden Kids, Betsey Johnson, Report, Mad Love, Blondo, GREATS, and Anne Klein brands, as well as private label footwear. The company's Wholesale Accessories segment offers Steve Madden, Steven by Steve Madden, Madden Girl, Betsey Johnson, Big Buddha, Anne Klein, Luv Betsey, BB Dakota, BB Dakota x Steve Madden, and Cupcakes & Cashmere brands; private label fashion handbags and accessories to department stores, mass merchants, value priced retailers, online retailers, and specialty stores; and cold weather accessories, fashion scarves, wraps, and other trend accessories primarily under the Steve Madden, BB Dakota, Cejon, Betsey Johnson, and Big Buddha brand names, as well as private labels to department stores and specialty stores. Its Retail segment operates Steve Madden, Steven, Superga, and International retail stores, as well as Steve Madden, Superga, Betsey Johnson, Blondo, Dolce Vita, GREATS, and BB Dakota e-commerce websites. The company's Licensing segment licenses its Steve Madden, Steven by Steve Madden, Madden Girl, Betsey Johnson, Dolce Vita, and FREEBIRD by Steven trademarks. Its First Cost segment operates as a buying agent for footwear products under private labels for mass-market merchandisers, shoe chains, and other mid-tier retailers. As of December 31, 2020, it owned and operated 218 retail stores, including 143 Steve Madden full-price stores, 66 Steve Madden outlet stores, 1 Steven store, and 1 Superga store, as well as 7 e-commerce websites. Steven Madden, Ltd. was founded in 1990 and is headquartered in Long Island City, New York.",
    "website": "http://www.stevemadden.com",
    "zipcode": "11104"
  },
  "SKAA.F": {
    "city": "Manhattan Beach",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "Skechers U.S.A., Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SKECHERS U.S.A A  DL-,001",
    "state": "CA",
    "summary": "Skechers U.S.A., Inc. designs, develops, markets, and distributes footwear for men, women, and children; and performance footwear for men and women under the Skechers brand worldwide. It operates through three segments: Domestic Wholesale, International Wholesale, and Direct-to-Consumer. The company offers casual, casual athletic, sport athletic, trail, sandals, boots, and retro fashion footwear for men and women under the Skechers USA, Skechers Sport, Skechers Active, Modern Comfort, Skechers Street, Mark Nason, and BOBS brands; sneakers, casuals, boots, and sandals for boys and girls under the Skechers Mega-Craft, S-Lights, SKECH-AIR, Foamies, Twinkle Toes, Z-Strap, Skechers Stretch Fit, and Skechers Street brands; technical footwear under the Skechers GOrun, Skechers GOwalk, Skechers GOtrain, Skechers GOtrail, and Skechers GO Golf brands; sneakers, casuals, boots, and sandals for boys and girls; men's and women's slip-resistant and safety-toe casuals, boots, hikers, and athletic shoes; and lifestyle apparel for men, women, and kids. As of December 31, 2020, it operated approximately 3,891 company- and third party-owned Skechers stores. The company sells its products through department and specialty stores, athletic and independent retailers, boutiques, and online retailers; and through its e-commerce sites, concept stores, and factory and warehouse outlet stores. Skechers U.S.A., Inc. was incorporated in 1992 and is headquartered in Manhattan Beach, California.",
    "website": "http://www.skechers.com",
    "zipcode": "90266"
  },
  "SKX": {
    "city": "Manhattan Beach",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Footwear & Accessories",
    "long_name": "Skechers U.S.A., Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Skechers U.S.A., Inc.",
    "state": "CA",
    "summary": "Skechers U.S.A., Inc. designs, develops, markets, and distributes footwear for men, women, and children; and performance footwear for men and women under the Skechers brand worldwide. It operates through three segments: Domestic Wholesale, International Wholesale, and Direct-to-Consumer. The company offers casual, casual athletic, sport athletic, trail, sandals, boots, and retro fashion footwear for men and women under the Skechers USA, Skechers Sport, Skechers Active, Modern Comfort, Skechers Street, Mark Nason, and BOBS brands; sneakers, casuals, boots, and sandals for boys and girls under the Skechers Mega-Craft, S-Lights, SKECH-AIR, Foamies, Twinkle Toes, Z-Strap, Skechers Stretch Fit, and Skechers Street brands; technical footwear under the Skechers GOrun, Skechers GOwalk, Skechers GOtrain, Skechers GOtrail, and Skechers GO Golf brands; sneakers, casuals, boots, and sandals for boys and girls; men's and women's slip-resistant and safety-toe casuals, boots, hikers, and athletic shoes; and lifestyle apparel for men, women, and kids. As of December 31, 2020, it operated approximately 3,891 company- and third party-owned Skechers stores. The company sells its products through department and specialty stores, athletic and independent retailers, boutiques, and online retailers; and through its e-commerce sites, concept stores, and factory and warehouse outlet stores. Skechers U.S.A., Inc. was incorporated in 1992 and is headquartered in Manhattan Beach, California.",
    "website": "http://www.skechers.com",
    "zipcode": "90266"
  },
  "SMSEY": {
    "city": "Luxembourg",
    "country": "Luxembourg",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "Samsonite International S.A.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SAMSONITE INTL SA",
    "state": null,
    "summary": "Samsonite International S.A. engages in the design, manufacture, sourcing, and distribution of travel luggage bags worldwide. It offers luggage, business, computer, outdoor, casual, and women's bags; and travel accessories and slim protective cases for personal electronic devices primarily under the Samsonite, Tumi, American Tourister, Speck, High Sierra, Gregory, Lipault, Kamiliant, Hartmann, and eBags brands, as well as other owned and licensed brand names. The company sells its products through various wholesale distribution channels, as well as through company operated retail stores and e-commerce in North America, Asia, Europe, and Latin America. Samsonite International S.A. was founded in 1910 and is headquartered in Luxembourg, Luxembourg.",
    "website": "http://www.samsonite.com",
    "zipcode": "1931"
  },
  "SMSOF": {
    "city": "Luxembourg",
    "country": "Luxembourg",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "Samsonite International S.A.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SAMSONITE INTL SA",
    "state": null,
    "summary": "Samsonite International S.A. engages in the design, manufacture, sourcing, and distribution of travel luggage bags worldwide. It offers luggage, business, computer, outdoor, casual, and women's bags; and travel accessories and slim protective cases for personal electronic devices primarily under the Samsonite, Tumi, American Tourister, Speck, High Sierra, Gregory, Lipault, Kamiliant, Hartmann, and eBags brands, as well as other owned and licensed brand names. The company sells its products through various wholesale distribution channels, as well as through company operated retail stores and e-commerce in North America, Asia, Europe, and Latin America. Samsonite International S.A. was founded in 1910 and is headquartered in Luxembourg, Luxembourg.",
    "website": "http://www.samsonite.com",
    "zipcode": "1931"
  },
  "SREEL.NS": {
    "city": "Kolkata",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Footwear & Accessories",
    "long_name": "Sreeleathers Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SREELEATHERS LTD",
    "state": null,
    "summary": "Sreeleathers Limited engages in the wholesale and retail of footwear, and leather goods and accessories in India. It offers formal, canvas, and casual, as well as school shoes; chappals; sandals; and accessories, such as belts, wallets, bags, socks, and jewelry and watch boxes for men, women, and kids, as well as disposable PPE kits and masks. Sreeleathers Limited sells its products through its online shopping website. The company was formerly known as CAT Financial Services Ltd and changed its name to Sreeleathers Limited in October 2010. Sreeleathers Limited was incorporated in 1991 and is based in Kolkata, India.",
    "website": "http://www.sreeleathers.com",
    "zipcode": "700016"
  },
  "SUPERHOUSE.NS": {
    "city": "Kanpur",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Footwear & Accessories",
    "long_name": "Superhouse Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SUPERHOUSE LTD",
    "state": null,
    "summary": "Superhouse Limited manufactures and sells leather garments, readymade garments, and riding products in India and internationally. It operates through Leather and Leather Products, and Textile Garments segments. The company offers finished leather products; men's, women's, children's, safety, and welted footwear. It also provides leather accessories, such as ladies hand bags, leather bags, business cases, portfolios, trolley bags, belts, wallets, caps, etc.; leather garments, including ladies' short jackets, men's jackets, motorcycle jackets, 3/4 jackets and vests, trousers, skirts, and camisoles, as well as jackets/trousers with embroidery/crochet detailing; and breeches, riding boots, and riding products. In addition, the company offers woven and knitted garments, including ladies tops, tunics, evening dresses, trousers, and jackets; and safety garments comprising coveralls, bib-trousers, trousers, aprons, dust coats, chef coats, doctor coats, vests, jackets, army uniforms, and fleece jackets, as well as socks and fall protection products. It sells its products primarily under the Allen Cooper and Double Duty brands. The company was formerly known as Superhouse Leathers Limited and changed its name to Superhouse Limited in November 2006. Superhouse Limited was incorporated in 1980 and is based in Kanpur, India.",
    "website": "http://www.superhouse.in",
    "zipcode": null
  },
  "TDPAY": {
    "city": "Sant'Elpidio a Mare",
    "country": "Italy",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "TOD'S S.p.A.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "TOD'S SPA",
    "state": "AP",
    "summary": "TOD'S S.p.A., together with its subsidiaries, creates, produces, and distributes shoes, leather goods and accessories, and apparel in Italy, Europe, the Americas, Greater China, and internationally. The company distributes its products through directly operated single-brand stores (DOS), e-commerce website, franchised stores, and independent multi-brand stores under the TOD'S, HOGAN, FAY, and ROGER VIVIER brands. As of December 31, 2020, it operated through a distribution network of 300 DOS and 103 franchised stores. The company was founded in 1970 and is headquartered in Sant'Elpidio a Mare, Italy. TOD'S S.p.A. is a subsidiary of DI.VI. FINANZIARIA DI DIEGO DELLA VALLE & C. S.r.l.",
    "website": "http://www.todsgroup.com",
    "zipcode": "63811"
  },
  "TOB.F": {
    "city": "Sant'Elpidio a Mare",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "TOD'S S.p.A.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "TOD'S SPA  EO 2",
    "state": "AP",
    "summary": "TOD'S S.p.A., together with its subsidiaries, creates, produces, and distributes shoes, leather goods and accessories, and apparel in Italy, Europe, the Americas, Greater China, and internationally. The company distributes its products through directly operated single-brand stores (DOS), e-commerce website, franchised stores, and independent multi-brand stores under the TOD'S, HOGAN, FAY, and ROGER VIVIER brands. As of December 31, 2020, it operated through a distribution network of 300 DOS and 103 franchised stores. The company was founded in 1970 and is headquartered in Sant'Elpidio a Mare, Italy. TOD'S S.p.A. is a subsidiary of DI.VI. FINANZIARIA DI DIEGO DELLA VALLE & C. S.r.l.",
    "website": "http://www.todsgroup.com",
    "zipcode": "63811"
  },
  "TOD.MI": {
    "city": "Sant'Elpidio a Mare",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Footwear & Accessories",
    "long_name": "TOD'S S.p.A.",
    "market": "it_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "TOD'S",
    "state": "AP",
    "summary": "TOD'S S.p.A., together with its subsidiaries, creates, produces, and distributes shoes, leather goods and accessories, and apparel in Italy, Europe, the Americas, Greater China, and internationally. The company distributes its products through directly operated single-brand stores (DOS), e-commerce website, franchised stores, and independent multi-brand stores under the TOD'S, HOGAN, FAY, and ROGER VIVIER brands. As of December 31, 2020, it operated through a distribution network of 300 DOS and 103 franchised stores. The company was founded in 1970 and is headquartered in Sant'Elpidio a Mare, Italy. TOD'S S.p.A. is a subsidiary of DI.VI. FINANZIARIA DI DIEGO DELLA VALLE & C. S.r.l.",
    "website": "http://www.todsgroup.com",
    "zipcode": "63811"
  },
  "VIPIND.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Footwear & Accessories",
    "long_name": "VIP Industries Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "VIP INDUSTRIES",
    "state": null,
    "summary": "VIP Industries Limited manufactures and sells luggage bags and accessories in India. It offers hard and soft luggage, including ladies handbags, printed polycarbonate luggage products, soft uprights, vanity cases, hard suitcases, briefcases, trolleys, rucksacks, backpacks, duffel-bags, laptop bags, school bags, everyday travel accessories, and short haul products. The company provides its products primarily under the VIP, Caprese, Carlton, Skybags, Alfa, and Aristocrat brands. It exports its products to 31 international locations, including the United Arab Emirates, the United States, Qatar, Kuwait, and Sweden. VIP Industries Limited was incorporated in 1968 and is headquartered in Mumbai, India.",
    "website": "http://www.vipindustries.co.in",
    "zipcode": "400025"
  },
  "VRA": {
    "city": "Roanoke",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Footwear & Accessories",
    "long_name": "Vera Bradley, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Vera Bradley, Inc.",
    "state": "IN",
    "summary": "Vera Bradley, Inc., together with its subsidiaries, designs, manufactures, and sells women's handbags, luggage and travel items, fashion and home accessories, and gifts. It operates through three segments: Vera Bradley Direct, Vera Bradley Indirect, and Pura Vida. The company offers bag products, such as totes, crossbodies, satchels, clutches, backpacks, baby bags, and lunch bags; accessories, including wallets, wristlets, eyeglass cases, scarves, and various technology accessories; bracelets, rings, and necklaces under Pura Vida brand name; and travel products consisting of rolling luggage, cosmetics, and travel and packing accessories, as well as travel bags comprising duffel and weekend bags. It also provides home products that include throw blankets, beach towels, and comforters, as well as items, such as mugs and tumblers; apparel/footwear comprising sleepwear, footwear, cotton face masks, outerwear, socks, and scarves; and stationery and merchandising products, as well as freight, licensing, and gift card breakage services. The company sells its Vera Bradley branded products through its full-line and factory outlet stores in the United States; and verabradley.com, an online outlet site, as well as its annual outlet sale in Fort Wayne, Indiana. As of March 10, 2021, it operated 75 full-line and 69 factory outlet stores. The company sells its Pura Vida branded products through wholesale retailers, as well as through Pura Vida websites, including www.puravidabracelets.com, www.puravidabracelets.eu, and www.puravidabracelets.ca. It also sells its Vera Bradley branded products to approximately 2,000 specialty retail locations, department stores, national accounts, third party e-commerce sites, and third-party inventory liquidators, as well as through licensing agreements. Vera Bradley, Inc. was incorporated in 1982 and is headquartered in Roanoke, Indiana.",
    "website": "http://www.verabradley.com",
    "zipcode": "46783"
  },
  "VULC3.SA": {
    "city": "Jundia",
    "country": "Brazil",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Footwear & Accessories",
    "long_name": "Vulcabras Azaleia S.A.",
    "market": "br_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "VULCABRAS   ON      NM",
    "state": "SP",
    "summary": "Vulcabras Azaleia S.A. operates as a footwear company in Brazil. The company provides sports footwear, women's shoes, and sports apparel products, as well as sandals and safety boots. It markets its products under the Azaleia, Dijean, Opanka, Olympikus, Olk, and Vulcabras brand names. The company sells its products through sales representatives and distributors, as well as directly to customers. It has operations in Peru, Brazil, Argentina, Chile, Uruguay, Colombia, and internationally. The company was formerly known as Vulcabras S.A. and changed its name to Vulcabras Azaleia S.A. in November 2010. Vulcabras Azaleia S.A. was founded in 1952 and is headquartered in Jundia, Brazil.",
    "website": "http://vulcabrasazaleiari.com.br",
    "zipcode": "13219-001"
  },
  "WEYS": {
    "city": "Milwaukee",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Footwear & Accessories",
    "long_name": "Weyco Group, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Weyco Group, Inc.",
    "state": "WI",
    "summary": "Weyco Group, Inc., together with its subsidiaries, designs and distributes footwear for men, women, and children. It operates through two segments, North American Wholesale Operations and North American Retail Operations. The company offers mid-priced leather dress shoes and casual footwear of man-made materials or leather; and outdoor boots, shoes, and sandals under the Florsheim, Nunn Bush, Stacy Adams, BOGS, and Rafters brand names. It is also involved in the wholesale of its products to approximately 10,000 footwear, department, and specialty stores, as well as e-commerce retailers. As of December 31, 2020, the company had five brick and mortar retail stores in the United States. In addition, it has licensing agreements with third parties, who sell its branded apparel, accessories, and specialty footwear. Weyco Group, Inc. serves in the United States, Canada, Europe, Australia, Asia, and South Africa. The company was formerly known as Weyenberg Shoe Manufacturing Company and changed its name to Weyco Group, Inc. in April 1990. Weyco Group, Inc. was incorporated in 1906 and is based in Milwaukee, Wisconsin.",
    "website": "http://www.weycogroup.com",
    "zipcode": "53201"
  },
  "WOO.F": {
    "city": "New York",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "Foot Locker, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "FOOT LOCKER  DL-,01",
    "state": "NY",
    "summary": "Foot Locker, Inc., through its subsidiaries, operates as an athletic footwear and apparel retailer. The company engages in the retail of athletic footwear, apparel, accessories, equipment, and team licensed merchandise under the Foot Locker, Lady Foot Locker, Kids Foot Locker, Champs Sports, Eastbay, Footaction, Runners Point, and Sidestep brand names. As of January 30, 2021, it operated through 2,998 retail stores in 27 countries across the United States, Canada, Europe, Australia, New Zealand, and Asia; and 127 franchised Foot Locker stores located in the Middle East, as well as through various e-commerce sites and mobile apps. The company was founded in 1879 and is headquartered in New York, New York.",
    "website": "http://www.footlocker-inc.com",
    "zipcode": "10001"
  },
  "WW4.F": {
    "city": "Rockford",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "Wolverine World Wide, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "WOLVERINE WORLD WIDE  DL1",
    "state": "MI",
    "summary": "Wolverine World Wide, Inc. designs, manufactures, sources, markets, licenses, and distributes footwear, apparel, and accessories in the United States, Europe, the Middle East, Africa, the Asia Pacific, Canada and Latin America. The company operates through two segments, Wolverine Michigan Group and Wolverine Boston Group. It offers casual footwear and apparel; performance outdoor and athletic footwear and apparel; kids' footwear; industrial work boots and apparel; and uniform shoes and boots. The company sources, markets, and licenses a range of footwear styles, such as shoes, boots, and sandals under the Bates, Cat, Chaco, Harley-Davidson, Hush Puppies, Hytest, Keds, Merrell, Saucony, Sperry, Wolverine, and Stride Rite brands. It also markets Merrell and Wolverine branded apparel and accessories, as well as licenses its brands for use on non-footwear products, including the Hush Puppies apparel, eyewear, watches, socks, handbags, and plush toys; Wolverine branded eyewear and gloves; and Keds, Saucony, and Sperry branded apparel. In addition, the company markets pigskin leather under the Wolverine Warrior Leather, Weather Tight, and All Season Weather Leathers trademarks for use in the footwear industry. Further, it operates brick and mortar retail stores, and e-commerce sites. The company sells its products to department stores, national chains, catalog and specialty retailers, independent retailers, uniform outlets, and mass merchant and government customers through retail stores, as well as through third-party licensees and distributors. As of January 2, 2021, it operated 97 retail stores, as well as 37 consumer direct e-commerce sites. Wolverine World Wide, Inc. was founded in 1883 and is based in Rockford, Michigan.",
    "website": "http://www.wolverineworldwide.com",
    "zipcode": "49351"
  },
  "WWW": {
    "city": "Rockford",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Footwear & Accessories",
    "long_name": "Wolverine World Wide, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Wolverine World Wide, Inc.",
    "state": "MI",
    "summary": "Wolverine World Wide, Inc. designs, manufactures, sources, markets, licenses, and distributes footwear, apparel, and accessories in the United States, Europe, the Middle East, Africa, the Asia Pacific, Canada and Latin America. The company operates through two segments, Wolverine Michigan Group and Wolverine Boston Group. It offers casual footwear and apparel; performance outdoor and athletic footwear and apparel; kids' footwear; industrial work boots and apparel; and uniform shoes and boots. The company sources, markets, and licenses a range of footwear styles, such as shoes, boots, and sandals under the Bates, Cat, Chaco, Harley-Davidson, Hush Puppies, Hytest, Keds, Merrell, Saucony, Sperry, Wolverine, and Stride Rite brands. It also markets Merrell and Wolverine branded apparel and accessories, as well as licenses its brands for use on non-footwear products, including the Hush Puppies apparel, eyewear, watches, socks, handbags, and plush toys; Wolverine branded eyewear and gloves; and Keds, Saucony, and Sperry branded apparel. In addition, the company markets pigskin leather under the Wolverine Warrior Leather, Weather Tight, and All Season Weather Leathers trademarks for use in the footwear industry. Further, it operates brick and mortar retail stores, and e-commerce sites. The company sells its products to department stores, national chains, catalog and specialty retailers, independent retailers, uniform outlets, and mass merchant and government customers through retail stores, as well as through third-party licensees and distributors. As of January 2, 2021, it operated 97 retail stores, as well as 37 consumer direct e-commerce sites. Wolverine World Wide, Inc. was founded in 1883 and is based in Rockford, Michigan.",
    "website": "http://www.wolverineworldwide.com",
    "zipcode": "49351"
  },
  "XSVT": {
    "city": "North Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "Xsovt Brands, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "XSOVT BRANDS INC",
    "state": "NV",
    "summary": "Xsovt Brands, Inc. operates as a footwear designer in the United States. The company engages in the design, comfort, and construction of shoes and slippers for men, women, and children. It sells its products under the Xsovt brand. The company is based in North Las Vegas, Nevada.",
    "website": "http://www.xsovt.com",
    "zipcode": "89084"
  },
  "YUE1.F": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Footwear & Accessories",
    "long_name": "Yue Yuen Industrial (Holdings) Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "YUE YUEN IND.HLDGS HD-,25",
    "state": null,
    "summary": "Yue Yuen Industrial (Holdings) Limited, an investment holding company, engages in manufacturing, marketing, and retailing athletic footwear, athletic leisure footwear, and casual and outdoor footwear in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. It operates as an original design manufacturer/original equipment manufacturer for various international brand names, such as adidas, Asics, Converse, New Balance, Nike, Puma, Reebok, Salomon, and Timberland, as well as retails and distributes sportswear and apparel products. The company engages in the manufacture and sale of leather products, apparels, and sports sandals, as well as soles, components, and others. As of December 31, 2020, it had 5,240 directly operated stores and 3,835 stores operated by sub-distributors in the Greater China region. The company was founded in 1969 and is headquartered in Kwun Tong, Hong Kong.",
    "website": "http://www.yueyuen.com",
    "zipcode": null
  },
  "YUEIF": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "Yue Yuen Industrial (Holdings) Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "YUE YUEN INDUSTRIAL HLDGS",
    "state": null,
    "summary": "Yue Yuen Industrial (Holdings) Limited, an investment holding company, engages in manufacturing, marketing, and retailing athletic footwear, athletic leisure footwear, and casual and outdoor footwear in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. It operates as an original design manufacturer/original equipment manufacturer for various international brand names, such as adidas, Asics, Converse, New Balance, Nike, Puma, Reebok, Salomon, and Timberland, as well as retails and distributes sportswear and apparel products. The company engages in the manufacture and sale of leather products, apparels, and sports sandals, as well as soles, components, and others. As of December 31, 2020, it had 5,240 directly operated stores and 3,835 stores operated by sub-distributors in the Greater China region. The company was founded in 1969 and is headquartered in Kwun Tong, Hong Kong.",
    "website": "http://www.yueyuen.com",
    "zipcode": null
  },
  "YUEIY": {
    "city": "Kwun Tong",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Footwear & Accessories",
    "long_name": "Yue Yuen Industrial (Holdings) Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "YUE YUEN INDUSTRIAL HLDGS",
    "state": null,
    "summary": "Yue Yuen Industrial (Holdings) Limited, an investment holding company, engages in manufacturing, marketing, and retailing athletic footwear, athletic leisure footwear, and casual and outdoor footwear in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. It operates as an original design manufacturer/original equipment manufacturer for various international brand names, such as adidas, Asics, Converse, New Balance, Nike, Puma, Reebok, Salomon, and Timberland, as well as retails and distributes sportswear and apparel products. The company engages in the manufacture and sale of leather products, apparels, and sports sandals, as well as soles, components, and others. As of December 31, 2020, it had 5,240 directly operated stores and 3,835 stores operated by sub-distributors in the Greater China region. The company was founded in 1969 and is headquartered in Kwun Tong, Hong Kong.",
    "website": "http://www.yueyuen.com",
    "zipcode": null
  }
}
