{
    "AKRIT.AT": {
        "short_name": "AKRITAS S.A. (CR)",
        "long_name": "Akritas S.A.",
        "summary": "Akritas S.A. produces and sells artificial timber products in Greece and internationally. The company provides triple-layered chipboards under the AKRIPAN name, as well as waterproof chipboards under the HYDROPAN name; melamine sheets under the AKRITAS name; and doors, worktops-kitchen tops, and surfaces under the POLYTHETA name. It also offers EVROPANEL, a wood board material used for various constructions, such as shop fitting interior design and trade fair furnishings, interior doors, tables, shelves, home and offices interior design, and partition walls constructions, as well as for sound isolation and thermal applications; and pine and spruce woodworking panels. The company sells its products through distribution centers. Akritas S.A. was founded in 1977 and is headquartered in Alexandroupoli, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Building Materials",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Alexandroupoli"
    },
    "CRHN.MX": {
        "short_name": "CRH",
        "long_name": "CRH plc",
        "summary": "CRH plc, through its subsidiaries, manufactures and distributes building materials. It operates through three segments: Europe Materials, Americas Materials, and Building Products. The company manufactures and supplies cement, lime, aggregates, readymixed and precast concrete, and asphalt products; and construction accessories, building envelopes, architectural products, and network access products, as well as provides asphalt paving services. It also offers concrete floor elements, pavers and blocks, pipes, and landscape walling products; mortars, coated macadam products, roof tiles, sand-lime bricks and building elements, structural concrete products, utility and infrastructural concrete products, specialty masonry products, hardscape and patio products, utility boxes and trench systems, custom fabricated architectural glass products, pre-stressed planks, and structural elements; and bagged stone, and mulch and stone products. In addition, the company provides building and civil engineering contracting, and contract surfacing services; sells and distributes cement; and supplies access chambers and ducting products, as well as operates logistics and owned railway infrastructure. It serves governments, contractors, homebuilders, homeowners, and sub-contractors. The company operates primarily in the Republic of Ireland, the United Kingdom, the rest of Europe, the United States, and internationally. CRH plc was founded in 1936 and is headquartered in Dublin, Ireland.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "General Building Materials",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Ireland",
        "city": "Dublin"
    },
    "GEBNN.MX": {
        "short_name": "GEBERIT AG",
        "long_name": "Geberit AG",
        "summary": "Geberit AG develops, produces, and distributes sanitary products and systems for the residential and commercial construction industry worldwide. The company offers installation and flushing systems, such as installation systems, and cisterns and mechanisms, as well as various flushing systems for toilets; and piping systems, including building drainage systems and supply systems. It also provides offers bathroom systems product comprising bathroom ceramics and furniture, showers and bathtubs, and taps and controls. The company sells its products under the Geberit brand name. It sells its products to wholesalers, plumbers, and sanitary engineers. Geberit AG was founded in 1874 and is headquartered in Rapperswil-Jona, Switzerland.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "General Building Materials",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Switzerland",
        "city": "Rapperswil-Jona"
    },
    "IKTIN.AT": {
        "short_name": "IKTINOS HELLAS S.A. (CR)",
        "long_name": "Iktinos Hellas S.A. Greek Marble Industry Technical and Touristic Company",
        "summary": "Iktinos Hellas S.A. Greek Marble Industry Technical and Touristic Company quarries, cuts, and processes marbles in Greece, the Euro Area, and internationally. The company operates through Marble, Wind Energy, and Real Estate segments. It imports and trades in marbles, granites, and rare decorative stones; and operates as a dealer for artificial rocks and fine mosaics made of natural rocks. The company also offers natural stones, including natural Greek marbles, natural imported marbles, granites, and onyx; synthetic materials, such as quarellas; and other decorative materials comprising travertino, sandstone, psammite, limestone, slate, graphite, glass stone, and gemstone. In addition, it engages in the aeolian energy and real estate businesses. Iktinos Hellas S.A. Greek Marble Industry Technical and Touristic Company was founded in 1974 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Building Materials",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "MATHIO.AT": {
        "short_name": "MATHIOS REFRACTORY S.A.",
        "long_name": "Mathios Refractories S.A.",
        "summary": "Mathios Refractories S.A. engages in the production and sale of refractory materials and building products in Greece and internationally. The company offers stones, bricks, and pavers; building materials, including glass blocks, firebricks, mortars and additives, and flooring and thermal insulation products; heating solutions, such as eco fireplaces, eco stoves, heat backs, and bioethanole fireplaces; and landscaping products comprising mat grass, mat green, vermiculite, forest whisper, and garden steps. It also offers research and development, engineering, procurement, installation, and other support services. The company provides its products under the brand names of IDEAL, MAT, MAT PLUS, MAT CAST, MAT MICRON and MAT NANO, MAT SF, and MAT RAM. It serves cement, steel, ceramic, aluminum, glass power plant, refinery, wood, food, lime, and fertilizer industries. The company was founded in 1890 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Building Materials",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "SGON.MX": {
        "short_name": "COMPAGNIE DE ST-GOBAIN",
        "long_name": "Compagnie de Saint-Gobain S.A.",
        "summary": "Compagnie de Saint-Gobain designs, manufactures, and distributes materials and solutions for wellbeing worldwide. It operates in five segments: High Performance Solutions; Northern Europe; Southern Europe Â\u0096 Middle East Â\u0096 Africa; Americas; and Asia-Pacific. The company offers glass for building, industrial mortars, exterior products, and pipes; insulation, plasterboards, and interior glass products; and coated glass and high performance materials. It also distributes heavy building materials; plumbing, heating, and sanitary ware products; timbers and panels; interior solutions; roofing products; civil engineering products; ceramic tiles; and site equipment and tools. The company was founded in 1665 and is headquartered in Courbevoie, France.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "General Building Materials",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "France",
        "city": "Courbevoie"
    }
}