{
    "002336.SZ": {
        "short_name": "RENRENLE COMMERCIA",
        "long_name": "Renrenle Commercial Group Co.,Ltd.",
        "summary": "Renrenle Commercial Group Co.,Ltd. operates hypermarkets, boutique supermarkets, boutiques, department stores, and online shopping supermarkets in China. It operates 128 stores in Guangdong, Shaanxi, Sichuan, Tianjin, Chongqing, Guangxi, Fujian, Hunan, Jiangxi, and other provinces. The company was founded in 1996 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "0039.HK": {
        "short_name": "CH BEIDAHUANG",
        "long_name": "China Beidahuang Industry Group Holdings Limited",
        "summary": "China Beidahuang Industry Group Holdings Limited, an investment holding company, engages in the wine and liquor, food products trading, construction and development, rental, financial leasing, and mineral products businesses. Its Wine and Liquor segment is involved in the sale and distribution of wine and liquor. The company's Trading of Food Products segment engages in wholesaling and retailing staple food, cooking oil, alcohol and beverage, frozen and fresh food, and commodity hog products. Its Construction and Development segment undertakes the construction and land development activities. The company's Rental segment leases logistic facilities in Hong Kong and office facilities in the People's Republic of China. Its Financial Leasing segment provides financial leasing services. The company's Mineral Products segment engages in the flotation selection of non-ferrous metal mines; and sale of mineral products. It is also involved in the sale of primary agricultural products. The company was formerly known as Sino Distillery Group Limited and changed its name to China Beidahuang Industry Group Holdings Limited in May 2015. China Beidahuang Industry Group Holdings Limited is headquartered in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "0OC.F": {
        "short_name": "OCADO GROUP PLC  LS -,02",
        "long_name": "Ocado Group plc",
        "summary": "Ocado Group plc operates as an online grocery retailer in the United Kingdom and internationally. The company operates through three segments: Ocado Retail, UK Solutions & Logistics, and International Solutions. It also sells general merchandise products on its Ocado.com; provides online retail solutions; and offers customer fulfillment centre and logistics services. The company was founded in 2000 and is headquartered in Hatfield, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Hatfield"
    },
    "0OC1.F": {
        "short_name": "OCADO GROUP  SP.ADR 1/2",
        "long_name": "Ocado Group plc",
        "summary": "Ocado Group plc operates as an online grocery retailer in the United Kingdom and internationally. The company operates through three segments: Ocado Retail, UK Solutions & Logistics, and International Solutions. It also sells general merchandise products on its Ocado.com; provides online retail solutions; and offers customer fulfillment centre and logistics services. The company was founded in 2000 and is headquartered in Hatfield, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Hatfield"
    },
    "1210.HK": {
        "short_name": "CHRISTINE",
        "long_name": "Christine International Holdings Limited",
        "summary": "Christine International Holdings Limited, an investment holding company, operates a chain of bakeries in the People's Republic of China. The company produces and sells bakery products, including breads and cakes, moon cakes, pastries, and other products. It operates a multi-channel retail network that comprises neighbor stores, subway stores, flagship stores, and European style fresh-bake stores. The company was founded in 1993 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "1FA.F": {
        "short_name": "SPROUTS FMRS MKT  DL-,001",
        "long_name": "Sprouts Farmers Market, Inc.",
        "summary": "Sprouts Farmers Market, Inc. offers fresh, natural, and organic food products in the United States. It operates through Healthy Grocery Stores segment. The company offers perishable product categories, including fresh produce, meat, seafood, deli, bakery, floral and dairy, and dairy alternatives; and non-perishable product categories, such as grocery, vitamins and supplements, bulk items, frozen foods, beer and wine, and natural health and body care. As of January 03, 2021, it operated 362 stores in 23 states. Sprouts Farmers Market, Inc. was founded in 2002 and is headquartered in Phoenix, Arizona.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Phoenix"
    },
    "2735.T": {
        "short_name": "WATTS CO LTD",
        "long_name": "Watts Co., Ltd.",
        "summary": "Watts Co., Ltd., together with its subsidiaries, engages in the wholesale and retail trade of daily necessities and miscellaneous goods in Japan, China, Malaysia, Peru, and internationally. It engages in the wholesale of imported interior products; import and export, and processing business of household goods; and general merchandise retail business. The company operates its stores under the 100-Yen shop brand. It also operates a grocery store under the Buona vita brand; miscellaneous goods under the AMANO brand; and uniform shop under the KOMONOYA and KOMONOKAEN brands. Watts Co., Ltd. was founded in 1995 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "2742.T": {
        "short_name": "HALOWS CO LTD",
        "long_name": "Halows Co.,Ltd.",
        "summary": "Halows Co.,Ltd. operates a network of supermarket stores in Hiroshima, Okayama, Kagawa, Ehime, Tokushima, and Hyogo Prefectures of Japan. The company was formerly known as Fuchu Supermarket Co., Ltd. and changed its name to Halows Co.,Ltd. in March 1988. Halows Co.,Ltd. was incorporated in 1958 and is headquartered in Tsukubo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tsukubo"
    },
    "2747.T": {
        "short_name": "HOKUYU LUCKY CO.LTD.",
        "long_name": "Hokuyu Lucky Co.,Ltd.",
        "summary": "Hokuyu Lucky Co.,Ltd. operates a supermarket primarily in Japan. Its supermarket offers food, clothing, and daily goods. The company was founded in 1982 and is headquartered in Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sapporo"
    },
    "27S.DE": {
        "short_name": "ALBERTSONS COS INC.DL-001",
        "long_name": "Albertsons Companies, Inc.",
        "summary": "Albertsons Companies, Inc., through its subsidiaries, engages in the operation of food and drug stores in the United States. The company's food and drug retail stores offer grocery products, general merchandise, health and beauty care products, pharmacy, fuel, and other items and services. As of February 27, 2021, it operated 2,277 stores under various banners, including Albertsons, Safeway, Vons, Pavilions, Randalls, Tom Thumb, Carrs, Jewel-Osco, Acme, Shaw's, Star Market, United Supermarkets, Market Street, Haggen, Kings Food Markets, and Balducci's Food Lovers Market; and 1,727 pharmacies, 1,313 in-store branded coffee shops, 400 adjacent fuel centers, 22 distribution centers, and 20 manufacturing facilities, as well as various digital platforms. The company was founded in 1860 and is headquartered in Boise, Idaho. Albertsons Companies, Inc. is a subsidiary of Albertsons Investor Holdings LLC.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Boise"
    },
    "2912.TW": {
        "short_name": "PRESIDENT CHAIN STORE CORP",
        "long_name": "President Chain Store Corporation",
        "summary": "President Chain Store Corporation invests in and manages convenience stores, restaurants, drugstores, department stores, supermarkets, and online shopping stores in Taiwan and internationally. It operates through Convenience Stores, Retail Business Group, Logistics Business Group, and Other segments. The company is involved in the investment activities; publishing of magazines and books; sale of cosmetics and daily items; art and cultural exhibition activities; enterprise information management and consultancy business; network technology development business; and sports and entertainment business. It also offers life and property insurance; collection agency; electronic ticketing; gas station; elevator installation, repair, and maintenance; room and low-temperature food logistics and warehousing; and information software services, as well as manufactures food products. In addition, the company engages in the trucking, and bread and pastry retail businesses; wholesale of merchandise; sale of health care products and pharmaceuticals; sale and rental of cleaning instruments; trading of food and commodities; logistics and warehousing business; and sale of ice cream, as well as operates coffee chain stores and hypermarkets. As of December 31, 2019, it operated 9,900 stores under the 7-ELEVEN name. President Chain Store Corporation was founded in 1978 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2GCB.F": {
        "short_name": "GRUPO COM.CHEDRAUI B CL.I",
        "long_name": "Grupo Comercial Chedraui, S.A.B. de C.V.",
        "summary": "Grupo Comercial Chedraui, S.A.B. de C.V. operates selfÂ\u0096service stores. The company operates through three segments: Retail in Mexico, Retail in the United States, and Real Estate. Its stores sell electronic goods, perishables, cloths, groceries, and general merchandise. The company also leases commercial space to third parties; and operates and maintains shopping centers. It operates 306 stores, including 198 tiendas chedraui, 60 super chedraui, 15 super che, and 33 supercito stores; and 7 distribution centers in Mexico, as well as 125 self-service stores, such as 64 El Super and 61 Fiesta stores in the United States. The company was founded in 1920 and is headquartered in Mexico City, Mexico.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Mexico",
        "city": "Mexico City"
    },
    "2M2.F": {
        "short_name": "MCCOLLS RE.GR.(WI) LS-001",
        "long_name": "McColl's Retail Group plc",
        "summary": "McColl's Retail Group plc operates as a neighbourhood retailer in the United Kingdom. The company operates convenience and newsagent stores that offer food and groceries, fruits and vegetables, ready meals, prepared food-to-go, tobacco, general merchandise, news and magazines, and services, as well as provides post office and ATM services. As of November 29, 2020, it operated 1,265 neighborhood stores, including 1,093 McColl's branded convenience stores and 172 Martin's branded newsagents stores. The company was founded in 1901 and is headquartered in Brentwood, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Brentwood"
    },
    "2OF.F": {
        "short_name": "COLES GROUP LTD",
        "long_name": "Coles Group Limited",
        "summary": "Coles Group Limited operates as a retailer in Australia. The company operates through Supermarkets, Liquor, and Express segments. It provides fresh food, groceries, and general merchandise through 824 supermarkets, including coles online and coles financial services. The company operates coles.com.au, which offers a choice of home delivery; and provides insurance, credit cards, and personal loans to Australian families. It is also involved in the retailing of liquor through its 910 stores under the Liquorland, First Choice, First Choice Liquor, and Vintage Cellars brand names, including online liquor delivery services through Coles Online and Liquor Direct. In addition, the company operates 713 fuel and convenience stores; and offers lifestyle services, as well as operates as the participating partner in the flybuys loyalty program. The company was formerly known as Coles Myer Ltd. and changed its name to Coles Group Limited in November 2006. Coles Group Limited was founded in 1914 and is based in Hawthorn East, Australia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Hawthorn East"
    },
    "3038.T": {
        "short_name": "KOBE BUSSAN CO LTD",
        "long_name": "Kobe Bussan Co., Ltd.",
        "summary": "Kobe Bussan Co., Ltd. operates, manages, and franchises retail stores in Japan. It also operates buffet franchise restaurants and fast food restaurants. In addition, the company operates renewable energy power plants. Kobe Bussan Co., Ltd. was founded in 1985 and is headquartered in Kako, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kako"
    },
    "3686.HK": {
        "short_name": "CLIFFORDML",
        "long_name": "Clifford Modern Living Holdings Limited",
        "summary": "Clifford Modern Living Holdings Limited, an investment holding company, provides retail services in the People's Republic of China. The company operates through six segments: Property Management Services, Renovation and Fitting-Out Services, Retail Services, Off-Campus Training Services, Information Technology Services, and Ancillary Living Services. It operates 18 retail outlets, which include two supermarkets, one wet market, and 15 convenience stores. The company also offers general property management and resident support services to residential communities and commercial properties; renovation and fitting-out services to residents, tenants or owners, and third-party sub-contractors; and off-campus training services, including tutoring courses and language learning classes. In addition, it provides information technology and related engineering services; security systems, and hardware and software integration services, as well as telecommunication sales outlet services; and catering consultancy, property agency, employment placement, and laundry services. The company offers its services to residents under the Clifford brand. Clifford Modern Living Holdings Limited was founded in 1998 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "4161.SR": {
        "short_name": "BinDawood Holding Co.",
        "long_name": "Bin Dawood Holding Company",
        "summary": "Bin Dawood Holding Company engages in retail trading of foodstuff and household items. The company is also involved in the wholesale of bakery and related products to commercial supermarkets. It operates 74 hypermarkets and supermarkets under the BinDawood and Danube brands in the Kingdom of Saudi Arabia. The company was founded in 1984 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Jeddah"
    },
    "41G1.F": {
        "short_name": "GREGGS PLC  LS-,02",
        "long_name": "Greggs plc",
        "summary": "Greggs plc operates as a bakery food-on-the-go retailer in the United Kingdom. It offers a range of fresh and frozen bakery products, sandwiches, and drinks. The company sells its products through its shops in travel, leisure, and work-centered catchments; and franchised shops operated by partners in travel and other convenience locations. It is also involved in the property holding, non-trading, and trustee businesses. As of December 28, 2019, the company operated 2,050 shops, which included 302 franchised shops. Greggs plc was founded in 1939 and is based in Newcastle upon Tyne, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Newcastle upon Tyne"
    },
    "59G.F": {
        "short_name": "KOBE BUSSAN CO. LTD",
        "long_name": "Kobe Bussan Co., Ltd.",
        "summary": "Kobe Bussan Co., Ltd. operates, manages, and franchises retail stores in Japan. It also operates buffet franchise restaurants and fast food restaurants. In addition, the company operates renewable energy power plants. Kobe Bussan Co., Ltd. was founded in 1985 and is headquartered in Kako, Japan.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Kako"
    },
    "5FV.F": {
        "short_name": "YAOKO CO. LTD",
        "long_name": "Yaoko Co.,Ltd.",
        "summary": "Yaoko Co.,Ltd. operates supermarkets in Japan. The company offers fresh, processed, and delicatessen food products; and housing related products. It also engages in the import and wholesale of food and beverages. As of March 2020, the company operated 178 stores. Yaoko Co.,Ltd. was founded in 1890 and is headquartered in Kawagoe, Japan.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Kawagoe"
    },
    "5Y2.F": {
        "short_name": "DINO POLSKA S.A.  ZY -,10",
        "long_name": "Dino Polska S.A.",
        "summary": "Dino Polska S.A., together with its subsidiaries, operates a chain of mid-sized grocery supermarkets under the Dino name in Poland. The company offers range of food products, including meat, poultry and cold cuts, fruit and vegetables, bakery, and dairy products, as well as other food, chemical, and cosmetic products; grocery products, such as children's food, breakfast products, ready to eat meals, beverages, candies, snacks, frozen goods, processed goods, oils, grain and bulk products, condiments, and alcohol and cigarettes; and non-grocery products, which include flowers, cleaning agents, sanitary articles, pet food and small household appliance products. It is also involved in producing, processing, and preserving of meat products; investments in properties, shares, and bonds; renting and operating of own or leased real estate; private purchase and sale of real estate; and manufacturing and processing of refined petroleum products and retail sale of automotive fuels, as well as provision of warehousing and storage, and financial services. As of March 31, 2021, the company operated 1,532 stores. Dino Polska S.A. was founded in 2007 and is based in Krotoszyn, Poland.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "city": "Krotoszyn"
    },
    "600361.SS": {
        "short_name": "BEIJING HUALIAN HYPERMARKET CO.",
        "long_name": "Beijing Hualian Hypermarket Co., Ltd.",
        "summary": "Beijing Hualian Hypermarket Co., Ltd. sells food and non-food items through department stores in China. The company's stores offer knitted products, daily sundries, fruits and vegetables, grains and oil foods, non-staple foods, and other products. It also leases commercial facilities and operating sites. The company was founded in 1996 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "601116.SS": {
        "short_name": "SANJIANG SHOPPING CLUB CO LTD",
        "long_name": "Sanjiang Shopping Club Co., Ltd.",
        "summary": "Sanjiang Shopping Club Co., Ltd. operates a chain of supermarkets in Zhejiang province, the People's Republic of China. It also provides online shopping services. The company was founded in 1995 and is based in Ningbo, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Ningbo"
    },
    "603777.SS": {
        "short_name": "SHANGHAI LIYIFEN CO LTD",
        "long_name": "Shanghai Laiyifen Co.,Ltd",
        "summary": "Shanghai Laiyifen Co.,Ltd operates a chain of snack food stores in China. Its stores offer snack food nuts, meat products, soy products, seafood products, dried fruits, vegetables, chocolate confectioneries, cakes, and puffed products; grains and oil products; and fresh food products, as well as water bars, daily gifts, and other goods. As of November 8, 2019, the company has approximately 2,800 stores. It also provides its products through its online store. The company was founded in 1999 and is based in Shanghai, China. Shanghai Laiyifen Co.,Ltd is a subsidiary of Shanghai Aiwu Business Management Co., Ltd.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "603866.SS": {
        "short_name": "TOLY BREAD CO LTD",
        "long_name": "Toly Bread Co.,Ltd.",
        "summary": "Toly Bread Co., Ltd. engages in producing, processing, and marketing bakery products in China. It offers bread, cakes, and moon cakes. The company was formerly known as Shenyang Toly Bread Co., Ltd. and changed its name to Toly Bread Co., Ltd. in March 2017. Toly Bread Co., Ltd. was founded in 1997 and is based in Shenyang, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shenyang"
    },
    "603886.SS": {
        "short_name": "GANSO CO LTD",
        "long_name": "Ganso Co., Ltd.",
        "summary": "Ganso Co., Ltd. engages in the research and development, production, and sale of baked foods in China. It offers special, fresh milk, mousse, ice cream, chocolate, new year, rabbit lantern festival, nut, moon, date, sesame, tabletop, pineapple, egg yolk, mung bean, walnut, and egg cakes; dumplings; dried pork; pastries; and fruit gift boxes. The company offers its products directly through a chain of stores and online e-commerce channels. Ganso Co., Ltd. was founded in 2002 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "7515.T": {
        "short_name": "MARUYOSHI CENTER INC",
        "long_name": "Maruyoshi Center Inc.",
        "summary": "Maruyoshi Center Inc. operates supermarkets and restaurants in Japan. It operates 36 supermarkets and 1 restaurant. The company was formerly known as Y.K. Tokiwa Food Center and changed its name to Maruyoshi Center Inc. in 1970. Maruyoshi Center Inc. was founded in 1958 and is headquartered in Takamatsu, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Takamatsu"
    },
    "7596.T": {
        "short_name": "UORIKI CO LTD",
        "long_name": "Uoriki Co., Ltd.",
        "summary": "Uoriki Co., Ltd. engages in the retail, food and drink, and wholesale businesses in Japan and internationally. The company is involved in the retail of fresh fish and sushi products; and wholesale of fish and other products to supermarkets, restaurants, etc. It also operates restaurants. The company was founded in 1945 and is headquartered in Tachikawa, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tachikawa"
    },
    "7643.T": {
        "short_name": "DAIICHI CO LTD",
        "long_name": "Daiichi Co.,Ltd.",
        "summary": "Daiichi Co.,Ltd. operates supermarkets in Japan. The company operates 10 stores in Obihiro; 8 stores in Asahikawa; and 5 stores in Sapporo. It also rents real estate properties. The company was formerly known as first Super Co., Ltd. and changed its name to Daiichi Co.,Ltd. in November 1991. Daiichi Co.,Ltd. was founded in 1958 and is headquartered in Obihiro, Japan. Daiichi Co.,Ltd. operates as a subsidiary of Seven & i Holdings Co., Ltd.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Obihiro"
    },
    "76K.SG": {
        "short_name": "WEIS MARKETS INC. Registered Sh",
        "long_name": "Weis Markets, Inc.",
        "summary": "Weis Markets, Inc. engages in the retail sale of food in Pennsylvania and surrounding states. The company's retail food stores sell groceries, dairy products, frozen foods, meats, seafood, fresh produce, floral, pharmacy services, deli products, prepared foods, bakery products, beer and wine, and fuel; and general merchandise items, such as health and beauty care, and household products. It operates stores primarily under the Weis Markets trade name, as well as trademarks for its product lines and promotions, such as Weis, Weis 2 Go, Weis Great Meals Start Here, Weis Gas-n-Go, and Weis Nutri-Facts. As of December 31, 2020, the company owned and operated 197 retail food stores including 4 stores in Delaware, 49 stores in Maryland, 6 stores in New Jersey, 9 stores in New York, 117 stores in Pennsylvania, 9 stores in Virginia, and 2 stores in West Virginia. Weis Markets, Inc. was founded in 1912 and is based in Sunbury, Pennsylvania.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "city": "Sunbury"
    },
    "8079.HK": {
        "short_name": "EASY REPAY FIN",
        "long_name": "Easy Repay Finance & Investment Limited",
        "summary": "Easy Repay Finance & Investment Limited engages in the retail and wholesale of grocery products in Hong Kong. The company sells grocery products, such as frozen food through retail and online channels. It is also involved in money lending; property investment; and financial instruments and quoted shares investment businesses. In addition, the company offers beauty and clinical services; operates restaurants; and trades in cash coupons. The company was formerly known as Unlimited Creativity Holdings Limited and changed its name to Easy Repay Finance & Investment Limited in April 2015. Easy Repay Finance & Investment Limited is headquartered in Cheung Sha Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Cheung Sha Wan"
    },
    "8182.T": {
        "short_name": "INAGEYA CO LTD",
        "long_name": "Inageya Co., Ltd.",
        "summary": "Inageya Co., Ltd. engages in retail business in Japan. Its supermarket business offers fresh and general food products, household and clothing items, etc. The company also sells pharmaceutical and cosmetic products through drugstores. It operates 136 stores. Inageya Co., Ltd. was founded in 1900 and is headquartered in Tachikawa, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tachikawa"
    },
    "8279.T": {
        "short_name": "YAOKO CO LTD",
        "long_name": "Yaoko Co.,Ltd.",
        "summary": "Yaoko Co.,Ltd. operates supermarkets in Japan. The company offers fresh, processed, and delicatessen food products; and housing related products. It also engages in the import and wholesale of food and beverages. As of March 2020, the company operated 178 stores. Yaoko Co.,Ltd. was founded in 1890 and is headquartered in Kawagoe, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kawagoe"
    },
    "8287.T": {
        "short_name": "MAXVALU NISHINIHON",
        "long_name": "Maxvalu Nishinihon Co., Ltd.",
        "summary": "Maxvalu Nishinihon Co., Ltd. engages in the retail sale of grocery products and daily necessities products in Japan and China. The company was formerly known as Well Mart Co., Ltd. and changed its name to Maxvalu Nishinihon Co., Ltd. in May 2000. The company was founded in 1982 and is headquartered in Hiroshima, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Hiroshima"
    },
    "8SF.F": {
        "short_name": "SLIGRO FOOD GROUP EO -,06",
        "long_name": "Sligro Food Group N.V.",
        "summary": "Sligro Food Group N.V. engages in the foodservice businesses in the Netherlands and Belgium. The company offers a range of food and food-related non-food products; and services in the food and beverages wholesale market. It operates a network of 51 cash-and-carry and 9 delivery service sites to serve hospitality industry, leisure facilities, caterers, large-volume users, company restaurants, petrol stations, small and medium-sized enterprises, small retail businesses, and the institutional markets under the Sligro, De Kweker, and Van Hoeckel brand names in the Netherlands. It also serves institutional, corporate catering, and hotel chain segments under the JAVA Foodservice name through one delivery service site; and hospitality industry, culinary professionals, wholesale customers, and small and medium-sized enterprises under the Silgro-ISPC name through a network of two cash-and-carry and delivery service sites, as well as operates one delivery service with pick-up option under the Sligro-ISPC name in Belgium. In addition, the company is involved in the production of convenience and fresh fish products; sourcing of meat, game and poultry, fruits and vegetables, and bread and pastries; advertising, design, delivery, fitting out, and maintenance of professional kitchen layouts, equipment, and cooling and freezing technologies; and provision of online gift concepts and Christmas gifts, and traditional Christmas hampers. It also offers its products through online platform. Sligro Food Group N.V. was founded in 1935 and is headquartered in Veghel, the Netherlands.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Netherlands",
        "city": "Veghel"
    },
    "9823.T": {
        "short_name": "MAMMY MART CORP",
        "long_name": "Mammy Mart Corporation",
        "summary": "Mammy Mart Corporation operates a chain of fresh food based supermarkets in Japan. As of November 2019, it operated approximately 76 stores. The company was formerly known as Iwasaki Shoji Co., Ltd. and changed to Mammy Mart Corporation in April, 1988. Mammy Mart Corporation was founded in 1950 and is headquartered in Saitama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Saitama"
    },
    "9846.T": {
        "short_name": "TENMAYA STORE CO",
        "long_name": "Tenmaya Store Co., Ltd.",
        "summary": "Tenmaya Store Co., Ltd. operates a chain of retail stores in Japan. The company's stores offer groceries, miscellaneous goods, and clothing products. As of June 1, 2020, it operated through 48 stores. The company was founded in 1969 and is headquartered in Okayama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Okayama"
    },
    "9890.T": {
        "short_name": "MAKIYA CO LTD",
        "long_name": "Makiya Co., Ltd.",
        "summary": "Makiya Co., Ltd. engages in the wholesale and retail business of household goods in Japan. The company operates discount stores under the Espot name that offers outdoor, living room, alcoholic beverage, and fresh food products; cash and carry supermarkets; and community-based daily supermarkets under the POTATO name. It also operates hard off stores, which provide personal computers and AV equipment, as well as off house stores that offer furniture and household goods; and general merchandise shops, which provide interior and miscellaneous goods for adults. Makiya Co., Ltd. was incorporated in 1972 and is headquartered in Fuji, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Fuji"
    },
    "9919.T": {
        "short_name": "KANSAI SUPERMARKET",
        "long_name": "Kansai Super Market Ltd.",
        "summary": "Kansai Super Market Ltd. operates supermarket stores in Japan. It offers fruits and vegetables; alcoholic beverages; and seafood, meat, confectionery, and frozen food products, as well as miscellaneous goods. The company also engages in the production of cooked rice; cultivation and sale of vegetables; and beef cattle fattening activities. It operates 65 supermarket stores and 1 shopping department store. The company was founded in 1959 and is headquartered in Itami, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Itami"
    },
    "9974.T": {
        "short_name": "BELC CO LTD",
        "long_name": "Belc CO., LTD.",
        "summary": "Belc CO., LTD. manages a chain of food supermarkets. The company offers vegetables and fruits; sweets and desserts; meat and processed meat products; seafood products, eggs and dairy products; and processed and frozen food products, as well as beverages and liquor. It also provides clothing and housing products; agricultural, water, and livestock products; and chemical fertilizers, antibiotics, and synthetic additives under the TOPVALU brand name. The company was founded in 1959 and is headquartered in Tsurugashima, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tsurugashima"
    },
    "9977.T": {
        "short_name": "AOKI SUPER CO LTD",
        "long_name": "Aoki Super Co., LTD.",
        "summary": "Aoki Super Co., LTD. primarily operates a chain of supermarket in Japan. The company's supermarkets offer fresh and general food products, and daily goods, as well as gardening-related products. It also manages shopping center. The company was founded in 1972 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Nagoya"
    },
    "9993.T": {
        "short_name": "YAMAZAWA CO LTD",
        "long_name": "Yamazawa Co., Ltd.",
        "summary": "Yamazawa Co., Ltd. engages in the retail business in Japan. The company primarily operates food supermarkets. It also operates drug stores; and manufacture and supplies milk, tofu, natto, noodles, rice, and sugar beet products. As of February 2019, the company operated 65 stores comprising 43 stores in Yamagata prefecture and 22 stores in Miyagi prefecture. Yamazawa Co., Ltd. was founded in 1977 and is headquartered in Yamagata, Japan.",
        "currency": "JPY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yamagata"
    },
    "ACI": {
        "short_name": "Albertsons Companies, Inc.",
        "long_name": "Albertsons Companies, Inc.",
        "summary": "Albertsons Companies, Inc., through its subsidiaries, engages in the operation of food and drug stores in the United States. The company's food and drug retail stores offer grocery products, general merchandise, health and beauty care products, pharmacy, fuel, and other items and services. As of February 27, 2021, it operated 2,277 stores under various banners, including Albertsons, Safeway, Vons, Pavilions, Randalls, Tom Thumb, Carrs, Jewel-Osco, Acme, Shaw's, Star Market, United Supermarkets, Market Street, Haggen, Kings Food Markets, and Balducci's Food Lovers Market; and 1,727 pharmacies, 1,313 in-store branded coffee shops, 400 adjacent fuel centers, 22 distribution centers, and 20 manufacturing facilities, as well as various digital platforms. The company was founded in 1860 and is headquartered in Boise, Idaho. Albertsons Companies, Inc. is a subsidiary of Albertsons Investor Holdings LLC.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Boise"
    },
    "AD.AS": {
        "short_name": "AHOLD DEL",
        "long_name": "Koninklijke Ahold Delhaize N.V.",
        "summary": "Koninklijke Ahold Delhaize N.V. operates retail food stores and e-commerce primarily in the United States and Europe. The company's store formats include supermarkets, convenience stores, compact hypermarkets, cash and carry, drugstores, hypermarkets, and liquor stores. As of January 3, 2021, it operated 7,137 stores primarily under local brands serving approximately 54 million customers, as well as online. The company was formerly known as Koninklijke Ahold N.V. and changed its name to Koninklijke Ahold Delhaize N.V. in July 2016. Koninklijke Ahold Delhaize N.V. was founded in 1887 and is headquartered in Zaandam, the Netherlands.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "AMS",
        "market": "nl_market",
        "country": "Netherlands",
        "city": "Zaandam"
    },
    "AD.MI": {
        "short_name": "AHOLD DEL",
        "long_name": "Koninklijke Ahold Delhaize N.V.",
        "summary": "Koninklijke Ahold Delhaize N.V. operates retail food stores and e-commerce primarily in the United States and Europe. The company's store formats include supermarkets, convenience stores, compact hypermarkets, cash and carry, drugstores, hypermarkets, and liquor stores. As of January 3, 2021, it operated 7,137 stores primarily under local brands serving approximately 54 million customers, as well as online. The company was formerly known as Koninklijke Ahold N.V. and changed its name to Koninklijke Ahold Delhaize N.V. in July 2016. Koninklijke Ahold Delhaize N.V. was founded in 1887 and is headquartered in Zaandam, the Netherlands.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Netherlands",
        "city": "Zaandam"
    },
    "AD.VI": {
        "short_name": "AHOLD DELHAIZE NV",
        "long_name": "Koninklijke Ahold Delhaize N.V.",
        "summary": "Koninklijke Ahold Delhaize N.V. operates retail food stores and e-commerce primarily in the United States and Europe. The company's store formats include supermarkets, convenience stores, compact hypermarkets, cash and carry, drugstores, hypermarkets, and liquor stores. As of January 3, 2021, it operated 7,137 stores primarily under local brands serving approximately 54 million customers, as well as online. The company was formerly known as Koninklijke Ahold N.V. and changed its name to Koninklijke Ahold Delhaize N.V. in July 2016. Koninklijke Ahold Delhaize N.V. was founded in 1887 and is headquartered in Zaandam, the Netherlands.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Netherlands",
        "city": "Zaandam"
    },
    "ADN.MX": {
        "short_name": "KONINKLIJKE AHOLD DELHAIZE NV",
        "long_name": "Koninklijke Ahold Delhaize N.V.",
        "summary": "Koninklijke Ahold Delhaize N.V. operates retail food stores and e-commerce primarily in the United States and Europe. The company's store formats include supermarkets, convenience stores, compact hypermarkets, cash and carry, drugstores, hypermarkets, and liquor stores. As of January 3, 2021, it operated 7,137 stores primarily under local brands serving approximately 54 million customers, as well as online. The company was formerly known as Koninklijke Ahold N.V. and changed its name to Koninklijke Ahold Delhaize N.V. in July 2016. Koninklijke Ahold Delhaize N.V. was founded in 1887 and is headquartered in Zaandam, the Netherlands.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Grocery Stores",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Netherlands",
        "city": "Zaandam"
    },
    "ADRNY": {
        "short_name": "KONINKLIJKE AHOLD DELHAIZE NV",
        "long_name": "Koninklijke Ahold Delhaize N.V.",
        "summary": "Koninklijke Ahold Delhaize N.V. operates retail food stores and e-commerce primarily in the United States and Europe. The company's store formats include supermarkets, convenience stores, compact hypermarkets, cash and carry, drugstores, hypermarkets, and liquor stores. As of January 3, 2021, it operated 7,137 stores primarily under local brands serving approximately 54 million customers, as well as online. The company was formerly known as Koninklijke Ahold N.V. and changed its name to Koninklijke Ahold Delhaize N.V. in July 2016. Koninklijke Ahold Delhaize N.V. was founded in 1887 and is headquartered in Zaandam, the Netherlands.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Netherlands",
        "city": "Zaandam"
    },
    "AHOD.F": {
        "short_name": "AHOLD DELHAI.ADR16 EO-,25",
        "long_name": "Koninklijke Ahold Delhaize N.V.",
        "summary": "Koninklijke Ahold Delhaize N.V. operates retail food stores and e-commerce primarily in the United States and Europe. The company's store formats include supermarkets, convenience stores, compact hypermarkets, cash and carry, drugstores, hypermarkets, and liquor stores. As of January 3, 2021, it operated 7,137 stores primarily under local brands serving approximately 54 million customers, as well as online. The company was formerly known as Koninklijke Ahold N.V. and changed its name to Koninklijke Ahold Delhaize N.V. in July 2016. Koninklijke Ahold Delhaize N.V. was founded in 1887 and is headquartered in Zaandam, the Netherlands.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Netherlands",
        "city": "Zaandam"
    },
    "AHODF": {
        "short_name": "KONINKLIJKE AHOLD DELHAIZE NV",
        "long_name": "Koninklijke Ahold Delhaize N.V.",
        "summary": "Koninklijke Ahold Delhaize N.V. operates retail food stores and e-commerce primarily in the United States and Europe. The company's store formats include supermarkets, convenience stores, compact hypermarkets, cash and carry, drugstores, hypermarkets, and liquor stores. As of January 3, 2021, it operated 7,137 stores primarily under local brands serving approximately 54 million customers, as well as online. The company was formerly known as Koninklijke Ahold N.V. and changed its name to Koninklijke Ahold Delhaize N.V. in July 2016. Koninklijke Ahold Delhaize N.V. was founded in 1887 and is headquartered in Zaandam, the Netherlands.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Netherlands",
        "city": "Zaandam"
    },
    "AHOG.F": {
        "short_name": "AHOLD DELHAIZE,KON.EO-,01",
        "long_name": "Koninklijke Ahold Delhaize N.V.",
        "summary": "Koninklijke Ahold Delhaize N.V. operates retail food stores and e-commerce primarily in the United States and Europe. The company's store formats include supermarkets, convenience stores, compact hypermarkets, cash and carry, drugstores, hypermarkets, and liquor stores. As of January 3, 2021, it operated 7,137 stores primarily under local brands serving approximately 54 million customers, as well as online. The company was formerly known as Koninklijke Ahold N.V. and changed its name to Koninklijke Ahold Delhaize N.V. in July 2016. Koninklijke Ahold Delhaize N.V. was founded in 1887 and is headquartered in Zaandam, the Netherlands.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Netherlands",
        "city": "Zaandam"
    },
    "AMRT.JK": {
        "short_name": "Sumber Alfaria Trijaya Tbk.",
        "long_name": "PT Sumber Alfaria Trijaya Tbk",
        "summary": "PT Sumber Alfaria Trijaya Tbk engages in the retail distribution of consumer products in Indonesia. The company's stores offer food and non-food products. It also provides transportation and freight forwarding services; and operates a pharmacy, as well as engages in the retail distribution of cosmetics. PT Sumber Alfaria Trijaya Tbk sells its products through 17,538 stores under the Alfamart, Alfamidi, Lawson, and Dan+Dan names, as well as through the internet. The company was founded in 1989 and is headquartered in Tangerang, Indonesia. PT Sumber Alfaria Trijaya Tbk is a subsidiary of PT Sigmantara Alfindo.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "ANCSQ": {
        "short_name": "AMERICAN CONSUMERS INC",
        "long_name": "American Consumers, Inc.",
        "summary": "American Consumers, Inc. operates self-service retail supermarkets in northwest Georgia, northeast Alabama, and southeast Tennessee, the United States. The company provides groceries, including meats, fresh produce, dairy products, frozen foods, bakery products, tobacco products, and other non-food items. It also offers milk products, canned and frozen vegetables, and jellies under the controlled-labels, such as Foodland, Food Club, Ultimate Choice, Freshland, Price Saver, Top Crest, Top Care, Select, and Valu Time. The company operates its supermarkets under the Shop-Rite brand name. As of May 30, 2009, it operated eight supermarkets located in Ringgold, LaFayette, Chatsworth, Chickamauga, and Tunnel Hill, Georgia; Stevenson, Alabama; and Dayton and Jasper, Tennessee. The company was incorporated in 1968 and is based in Rossville, Georgia.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Rossville"
    },
    "ANCTF": {
        "short_name": "ALIMENTATION COUCHE-TARD",
        "long_name": "Alimentation Couche-Tard Inc.",
        "summary": "Alimentation Couche-Tard Inc. operates and licenses convenience stores. Its convenience stores sell tobacco products, grocery items, candies and snacks, beer, wine, beverages, and fresh food offerings; road transportation fuels; and stationary energy and aviation fuels. The company operates its convenience stores chain under various banners, including Circle K, Corner Stone, Couche-Tard, Holiday, Ingo, and Mac's. It is also involved in the sale of lottery tickets, calling cards, gift cards, postage stamps, and bus tickets; issuance of money orders; and provision of automatic teller machines and car wash services. As of April 26, 2020, it operated and licensed 12,124 convenience stores, which include 9,691 company-operated stores in North America, Ireland, Scandinavia, Poland, the Baltics, and Russia, as well as 2,350 stores, which are operated under the Circle K banner in Cambodia, Egypt, Guam, Guatemala, Jamaica, Honduras, Hong Kong, Indonesia, Macau, Mexico, Mongalia, New Zealand, Saudi Arabia, the United Arab Emirates, and Vietnam. The company was formerly known as Actidev Inc. and changed its name to Alimentation Couche-Tard Inc. in December 1994. Alimentation Couche-Tard Inc. was founded in 1980 and is headquartered in Laval, Canada.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Laval"
    },
    "ANCUF": {
        "short_name": "ALIMENTATION COUCHE-TARD",
        "long_name": "Alimentation Couche-Tard Inc.",
        "summary": "Alimentation Couche-Tard Inc. operates and licenses convenience stores. Its convenience stores sell tobacco products, grocery items, candies and snacks, beer, wine, beverages, and fresh food offerings; road transportation fuels; and stationary energy and aviation fuels. The company operates its convenience stores chain under various banners, including Circle K, Corner Stone, Couche-Tard, Holiday, Ingo, and Mac's. It is also involved in the sale of lottery tickets, calling cards, gift cards, postage stamps, and bus tickets; issuance of money orders; and provision of automatic teller machines and car wash services. As of April 26, 2020, it operated and licensed 12,124 convenience stores, which include 9,691 company-operated stores in North America, Ireland, Scandinavia, Poland, the Baltics, and Russia, as well as 2,350 stores, which are operated under the Circle K banner in Cambodia, Egypt, Guam, Guatemala, Jamaica, Honduras, Hong Kong, Indonesia, Macau, Mexico, Mongalia, New Zealand, Saudi Arabia, the United Arab Emirates, and Vietnam. The company was formerly known as Actidev Inc. and changed its name to Alimentation Couche-Tard Inc. in December 1994. Alimentation Couche-Tard Inc. was founded in 1980 and is headquartered in Laval, Canada.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Laval"
    },
    "ARKO": {
        "short_name": "ARKO Corp.",
        "long_name": "Arko Corp.",
        "summary": "Arko Corp. operates convenience stores in the United States. It operates through three segments: Retail, Wholesale, and GPM Petroleum. The Retail segment engages in the sale of fuel and merchandise to retail consumers. The Wholesale segment supplies fuel to third-party dealers and consignment agents. The GPM Petroleum segment supplies fuel to sub-wholesalers and bulk purchasers. The company operates approximately 2,950 locations comprising approximately 1,350 company-operated stores and approximately 1,600 dealer sites. Arko Corp. is based in Richmond, Virginia.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Richmond"
    },
    "ARKO.TA": {
        "short_name": "ARKO CORP",
        "long_name": "Arko Corp.",
        "summary": "Arko Corp. operates convenience stores in the United States. It operates through three segments: Retail, Wholesale, and GPM Petroleum. The Retail segment engages in the sale of fuel and merchandise to retail consumers. The Wholesale segment supplies fuel to third-party dealers and consignment agents. The GPM Petroleum segment supplies fuel to sub-wholesalers and bulk purchasers. The company operates approximately 2,950 locations comprising approximately 1,350 company-operated stores and approximately 1,600 dealer sites. Arko Corp. is based in Richmond, Virginia.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TLV",
        "market": "il_market",
        "country": "United States",
        "city": "Richmond"
    },
    "ATD-A.TO": {
        "short_name": "ALIMENTATION COUCHE-TARD INC CL",
        "long_name": "Alimentation Couche-Tard Inc.",
        "summary": "Alimentation Couche-Tard Inc. operates and licenses convenience stores. Its convenience stores sell tobacco products, grocery items, candies and snacks, beer, wine, beverages, and fresh food offerings; road transportation fuels; and stationary energy and aviation fuels. The company operates its convenience stores chain under various banners, including Circle K, Corner Stone, Couche-Tard, Holiday, Ingo, and Mac's. It is also involved in the sale of lottery tickets, calling cards, gift cards, postage stamps, and bus tickets; issuance of money orders; and provision of automatic teller machines and car wash services. As of April 26, 2020, it operated and licensed 12,124 convenience stores, which include 9,691 company-operated stores in North America, Ireland, Scandinavia, Poland, the Baltics, and Russia, as well as 2,350 stores, which are operated under the Circle K banner in Cambodia, Egypt, Guam, Guatemala, Jamaica, Honduras, Hong Kong, Indonesia, Macau, Mexico, Mongalia, New Zealand, Saudi Arabia, the United Arab Emirates, and Vietnam. The company was formerly known as Actidev Inc. and changed its name to Alimentation Couche-Tard Inc. in December 1994. Alimentation Couche-Tard Inc. was founded in 1980 and is headquartered in Laval, Canada.",
        "currency": "CAD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Laval"
    },
    "ATD-B.TO": {
        "short_name": "ALIMENTATION COUCHE-TARD INC CL",
        "long_name": "Alimentation Couche-Tard Inc.",
        "summary": "Alimentation Couche-Tard Inc. operates and licenses convenience stores. Its convenience stores sell tobacco products, grocery items, candies and snacks, beer, wine, beverages, and fresh food offerings; road transportation fuels; and stationary energy and aviation fuels. The company operates its convenience stores chain under various banners, including Circle K, Corner Stone, Couche-Tard, Holiday, Ingo, and Mac's. It is also involved in the sale of lottery tickets, calling cards, gift cards, postage stamps, and bus tickets; issuance of money orders; and provision of automatic teller machines and car wash services. As of April 26, 2020, it operated and licensed 12,124 convenience stores, which include 9,691 company-operated stores in North America, Ireland, Scandinavia, Poland, the Baltics, and Russia, as well as 2,350 stores, which are operated under the Circle K banner in Cambodia, Egypt, Guam, Guatemala, Jamaica, Honduras, Hong Kong, Indonesia, Macau, Mexico, Mongalia, New Zealand, Saudi Arabia, the United Arab Emirates, and Vietnam. The company was formerly known as Actidev Inc. and changed its name to Alimentation Couche-Tard Inc. in December 1994. Alimentation Couche-Tard Inc. was founded in 1980 and is headquartered in Laval, Canada.",
        "currency": "CAD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Laval"
    },
    "BIMAS.IS": {
        "short_name": "BIM MAGAZALAR",
        "long_name": "BIM Birlesik Magazalar A.S.",
        "summary": "BIM Birlesik Magazalar A.S., together with its subsidiaries, operates retail stores in Turkey, Morocco, and Egypt. Its stores sell approximately 750 items, including meat, breakfast and dairy, legumes and bakery, and personal care products, as well as beverages, snacks and sweets, fruits and vegetables, frozen foods, and cleaning supplies. As of March 05, 2020, the company operated 8,348 stores. BIM Birlesik Magazalar A.S. was founded in 1995 and is headquartered in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "city": "Istanbul"
    },
    "C15.F": {
        "short_name": "EMPIRE CO. LTD A",
        "long_name": "Empire Company Limited",
        "summary": "Empire Company Limited, together with its subsidiaries, engages in the food retail and real estate businesses in Canada. It operates in two segments, Food Retailing, and Investments and Other Operations. The company owns, affiliates, and franchises approximately 1,500 retail stores under various retail banners; and approximately 350 retail fuel locations. It also owns an interest in the Crombie Real Estate Investment Trust, an open-ended real estate investment trust to own, operate, and develop a portfolio of grocery and drug store anchored shopping centers, freestanding stores, and mixed use developments; and various equity accounted interests in Genstar partnerships that develop residential real estate properties in Ontario, Western Canada, as well as in the United States. The company was founded in 1907 and is headquartered in Stellarton, Canada.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Stellarton"
    },
    "CA.PA": {
        "short_name": "CARREFOUR",
        "long_name": "Carrefour SA",
        "summary": "Carrefour SA operates stores in various formats and channels in France, Spain, Italy, Belgium, Poland, Romania, Brazil, Argentina, and Taiwan. The company operates hypermarkets, convenience stores, supermarkets, cash and carry stores, and hypercash stores; e-commerce sites and m-commerce channels; and service stations. Its stores offer fresh produce; local products; consumer goods; and non-food products, including small household goods, textiles, and home appliances. The company is also involved in banking, insurance, property development, and franchise activities; the provision of travel agency services; and the rental of shopping malls. Carrefour SA was founded in 1959 and is based in Massy, France.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Massy"
    },
    "CAJ.DU": {
        "short_name": "CASINO, GUICH.INH. EO1,53",
        "long_name": "Casino, Guichard-Perrachon Société Anonyme",
        "summary": "Casino, Guichard-Perrachon SociÃ©tÃ© Anonyme operates as a food retailer in France and internationally. The company operates hypermarkets, supermarkets, convenience stores, discount stores, cash and carry stores, and e-commerce sites; as well as shopping centers. It also offers private label products; and operates as a non-food retailer. In addition, the company provides digital banking and insurance services; data, digital advertising, digital marketing, and data centers services. Further, it engages in development of solar plants. The company operates 11,172 stores. Casino, Guichard-Perrachon SociÃ©tÃ© Anonyme was founded in 1898 and is based in Saint-Etienne, France.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "DUS",
        "market": "dr_market",
        "country": "France",
        "city": "Saint-Ã\u0089tienne"
    },
    "CAJ.F": {
        "short_name": "CASINO, GUICH.INH. EO1,53",
        "long_name": "Casino, Guichard-Perrachon Société Anonyme",
        "summary": "Casino, Guichard-Perrachon SociÃ©tÃ© Anonyme operates as a food retailer in France and internationally. The company operates hypermarkets, supermarkets, convenience stores, discount stores, cash and carry stores, and e-commerce sites; as well as shopping centers. It also offers private label products; and operates as a non-food retailer. In addition, the company provides digital banking and insurance services; data, digital advertising, digital marketing, and data centers services. Further, it engages in development of solar plants. The company operates 11,172 stores. Casino, Guichard-Perrachon SociÃ©tÃ© Anonyme was founded in 1898 and is based in Saint-Etienne, France.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "city": "Saint-Ã\u0089tienne"
    },
    "CAN.MX": {
        "short_name": "CARREFOUR SA",
        "long_name": "Carrefour SA",
        "summary": "Carrefour SA operates stores in various formats and channels in France, Spain, Italy, Belgium, Poland, Romania, Brazil, Argentina, and Taiwan. The company operates hypermarkets, convenience stores, supermarkets, cash and carry stores, and hypercash stores; e-commerce sites and m-commerce channels; and service stations. Its stores offer fresh produce; local products; consumer goods; and non-food products, including small household goods, textiles, and home appliances. The company is also involved in banking, insurance, property development, and franchise activities; the provision of travel agency services; and the rental of shopping malls. Carrefour SA was founded in 1959 and is based in Massy, France.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Grocery Stores",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "France",
        "city": "Massy"
    },
    "CAR.DE": {
        "short_name": "CARREFOUR S.A. INH.EO 2,5",
        "long_name": "Carrefour SA",
        "summary": "Carrefour SA operates stores in various formats and channels in France, Spain, Italy, Belgium, Poland, Romania, Brazil, Argentina, and Taiwan. The company operates hypermarkets, convenience stores, supermarkets, cash and carry stores, and hypercash stores; e-commerce sites and m-commerce channels; and service stations. Its stores offer fresh produce; local products; consumer goods; and non-food products, including small household goods, textiles, and home appliances. The company is also involved in banking, insurance, property development, and franchise activities; the provision of travel agency services; and the rental of shopping malls. Carrefour SA was founded in 1959 and is based in Massy, France.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "GER",
        "market": "de_market",
        "country": "France",
        "city": "Massy"
    },
    "CAR.F": {
        "short_name": "CARREFOUR S.A. INH.EO 2,5",
        "long_name": "Carrefour SA",
        "summary": "Carrefour SA operates stores in various formats and channels in France, Spain, Italy, Belgium, Poland, Romania, Brazil, Argentina, and Taiwan. The company operates hypermarkets, convenience stores, supermarkets, cash and carry stores, and hypercash stores; e-commerce sites and m-commerce channels; and service stations. Its stores offer fresh produce; local products; consumer goods; and non-food products, including small household goods, textiles, and home appliances. The company is also involved in banking, insurance, property development, and franchise activities; the provision of travel agency services; and the rental of shopping malls. Carrefour SA was founded in 1959 and is based in Massy, France.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "city": "Massy"
    },
    "CAR1.F": {
        "short_name": "CARREFOUR SP.ADR 1/5/O.N.",
        "long_name": "Carrefour SA",
        "summary": "Carrefour SA operates stores in various formats and channels in France, Spain, Italy, Belgium, Poland, Romania, Brazil, Argentina, and Taiwan. The company operates hypermarkets, convenience stores, supermarkets, cash and carry stores, and hypercash stores; e-commerce sites and m-commerce channels; and service stations. Its stores offer fresh produce; local products; consumer goods; and non-food products, including small household goods, textiles, and home appliances. The company is also involved in banking, insurance, property development, and franchise activities; the provision of travel agency services; and the rental of shopping malls. Carrefour SA was founded in 1959 and is based in Massy, France.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "city": "Massy"
    },
    "CARR.VI": {
        "short_name": "CARREFOUR SA",
        "long_name": "Carrefour SA",
        "summary": "Carrefour SA operates stores in various formats and channels in France, Spain, Italy, Belgium, Poland, Romania, Brazil, Argentina, and Taiwan. The company operates hypermarkets, convenience stores, supermarkets, cash and carry stores, and hypercash stores; e-commerce sites and m-commerce channels; and service stations. Its stores offer fresh produce; local products; consumer goods; and non-food products, including small household goods, textiles, and home appliances. The company is also involved in banking, insurance, property development, and franchise activities; the provision of travel agency services; and the rental of shopping malls. Carrefour SA was founded in 1959 and is based in Massy, France.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "VIE",
        "market": "at_market",
        "country": "France",
        "city": "Massy"
    },
    "CASY": {
        "short_name": "Caseys General Stores, Inc.",
        "long_name": "Casey's General Stores, Inc.",
        "summary": "Casey's General Stores, Inc., together with its subsidiaries, operates convenience stores under the Casey's and Casey's General Store names. The company's stores offer a selection of food, including freshly prepared foods, such as pizza, donuts, and sandwiches; beverages, tobacco, and nicotine products; health and beauty aids; automotive products; and other nonfood items. Its stores also provide fuel for sale on a self-service basis. In addition, the company operates two stores under the Tobacco City name primarily selling tobacco and nicotine products; one liquor stores; and one grocery store. As of April 30, 2020, it operated 2,207 convenience stores in 16 states in the Midwest. Casey's General Stores, Inc. was founded in 1959 and is headquartered in Ankeny, Iowa.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Ankeny"
    },
    "CBOX.L": {
        "short_name": "CAKE BOX HOLDINGS PLC ORD GBP0.",
        "long_name": "Cake Box Holdings Plc",
        "summary": "Cake Box Holdings Plc, through its subsidiaries, engages in the retail of fresh cream cakes in the United Kingdom. As of February 8, 2021, the company operated 150 franchise stores. It also engages in property rental activities. Cake Box Holdings Plc was incorporated in 2013 and is headquartered in Enfield, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Enfield"
    },
    "CGUSY": {
        "short_name": "CASINO GUICHARD-PERRACHON",
        "long_name": "Casino, Guichard-Perrachon Société Anonyme",
        "summary": "Casino, Guichard-Perrachon SociÃ©tÃ© Anonyme operates as a food retailer in France and internationally. The company operates hypermarkets, supermarkets, convenience stores, discount stores, cash and carry stores, and e-commerce sites; as well as shopping centers. It also offers private label products; and operates as a non-food retailer. In addition, the company provides digital banking and insurance services; data, digital advertising, digital marketing, and data centers services. Further, it engages in development of solar plants. The company operates 11,172 stores. Casino, Guichard-Perrachon SociÃ©tÃ© Anonyme was founded in 1898 and is based in Saint-Etienne, France.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "France",
        "city": "Saint-Ã\u0089tienne"
    },
    "CHDRAUIB.MX": {
        "short_name": "GRUPO COMERCIAL CHEDRAUI SAB DE",
        "long_name": "Grupo Comercial Chedraui, S.A.B. de C.V.",
        "summary": "Grupo Comercial Chedraui, S.A.B. de C.V. operates selfÂ\u0096service stores. The company operates through three segments: Retail in Mexico, Retail in the United States, and Real Estate. Its stores sell electronic goods, perishables, cloths, groceries, and general merchandise. The company also leases commercial space to third parties; and operates and maintains shopping centers. It operates 306 stores, including 198 tiendas chedraui, 60 super chedraui, 15 super che, and 33 supercito stores; and 7 distribution centers in Mexico, as well as 125 self-service stores, such as 64 El Super and 61 Fiesta stores in the United States. The company was founded in 1920 and is headquartered in Mexico City, Mexico.",
        "currency": "MXN",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Mexico",
        "city": "Mexico City"
    },
    "CHP.JO": {
        "short_name": "Choppies Enterprises Ltd",
        "long_name": "Choppies Enterprises Limited",
        "summary": "Choppies Enterprises Limited operates as a fast moving consumer goods retailer. The company operates hyper stores, superstores, and value stores under the Choppies brand. Its stores offer bakery, deli, butchery, fruit and vegetables, clothing, and private label products, including fresh, frozen, canned, dry foods, snacks, ethnic specialties, health and beauty care, household, and laundry products, as well as financial services. The company operates in Botswana, Zimbabwe, Zambia, and Namibia. Choppies Enterprises Limited was founded in 1986 and is based in Gaborone, Botswana.",
        "currency": "ZAc",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JNB",
        "market": "za_market",
        "country": "Botswana",
        "city": "Gaborone"
    },
    "CJA.F": {
        "short_name": "ALIMENTATION COUCHE-T. B",
        "long_name": "Alimentation Couche-Tard Inc.",
        "summary": "Alimentation Couche-Tard Inc. operates and licenses convenience stores. Its convenience stores sell tobacco products, grocery items, candies and snacks, beer, wine, beverages, and fresh food offerings; road transportation fuels; and stationary energy and aviation fuels. The company operates its convenience stores chain under various banners, including Circle K, Corner Stone, Couche-Tard, Holiday, Ingo, and Mac's. It is also involved in the sale of lottery tickets, calling cards, gift cards, postage stamps, and bus tickets; issuance of money orders; and provision of automatic teller machines and car wash services. As of April 26, 2020, it operated and licensed 12,124 convenience stores, which include 9,691 company-operated stores in North America, Ireland, Scandinavia, Poland, the Baltics, and Russia, as well as 2,350 stores, which are operated under the Circle K banner in Cambodia, Egypt, Guam, Guatemala, Jamaica, Honduras, Hong Kong, Indonesia, Macau, Mexico, Mongalia, New Zealand, Saudi Arabia, the United Arab Emirates, and Vietnam. The company was formerly known as Actidev Inc. and changed its name to Alimentation Couche-Tard Inc. in December 1994. Alimentation Couche-Tard Inc. was founded in 1980 and is headquartered in Laval, Canada.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Laval"
    },
    "CJA0.F": {
        "short_name": "ALIMENTATION C.T. MUL.VTG",
        "long_name": "Alimentation Couche-Tard Inc.",
        "summary": "Alimentation Couche-Tard Inc. operates and licenses convenience stores. Its convenience stores sell tobacco products, grocery items, candies and snacks, beer, wine, beverages, and fresh food offerings; road transportation fuels; and stationary energy and aviation fuels. The company operates its convenience stores chain under various banners, including Circle K, Corner Stone, Couche-Tard, Holiday, Ingo, and Mac's. It is also involved in the sale of lottery tickets, calling cards, gift cards, postage stamps, and bus tickets; issuance of money orders; and provision of automatic teller machines and car wash services. As of April 26, 2020, it operated and licensed 12,124 convenience stores, which include 9,691 company-operated stores in North America, Ireland, Scandinavia, Poland, the Baltics, and Russia, as well as 2,350 stores, which are operated under the Circle K banner in Cambodia, Egypt, Guam, Guatemala, Jamaica, Honduras, Hong Kong, Indonesia, Macau, Mexico, Mongalia, New Zealand, Saudi Arabia, the United Arab Emirates, and Vietnam. The company was formerly known as Actidev Inc. and changed its name to Alimentation Couche-Tard Inc. in December 1994. Alimentation Couche-Tard Inc. was founded in 1980 and is headquartered in Laval, Canada.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Laval"
    },
    "CO.PA": {
        "short_name": "CASINO GUICHARD",
        "long_name": "Casino, Guichard-Perrachon Société Anonyme",
        "summary": "Casino, Guichard-Perrachon SociÃ©tÃ© Anonyme operates as a food retailer in France and internationally. The company operates hypermarkets, supermarkets, convenience stores, discount stores, cash and carry stores, and e-commerce sites; as well as shopping centers. It also offers private label products; and operates as a non-food retailer. In addition, the company provides digital banking and insurance services; data, digital advertising, digital marketing, and data centers services. Further, it engages in development of solar plants. The company operates 11,172 stores. Casino, Guichard-Perrachon SociÃ©tÃ© Anonyme was founded in 1898 and is based in Saint-Etienne, France.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Saint-Ã\u0089tienne"
    },
    "COL.AX": {
        "short_name": "COLESGROUP FPO",
        "long_name": "Coles Group Limited",
        "summary": "Coles Group Limited operates as a retailer in Australia. The company operates through Supermarkets, Liquor, and Express segments. It provides fresh food, groceries, and general merchandise through 824 supermarkets, including coles online and coles financial services. The company operates coles.com.au, which offers a choice of home delivery; and provides insurance, credit cards, and personal loans to Australian families. It is also involved in the retailing of liquor through its 910 stores under the Liquorland, First Choice, First Choice Liquor, and Vintage Cellars brand names, including online liquor delivery services through Coles Online and Liquor Direct. In addition, the company operates 713 fuel and convenience stores; and offers lifestyle services, as well as operates as the participating partner in the flybuys loyalty program. The company was formerly known as Coles Myer Ltd. and changed its name to Coles Group Limited in November 2006. Coles Group Limited was founded in 1914 and is based in Hawthorn East, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Hawthorn East"
    },
    "COLR.BR": {
        "short_name": "COLRUYT",
        "long_name": "Etn. Fr. Colruyt NV",
        "summary": "Etn. Fr. Colruyt NV, together with its subsidiaries, engages in the retail, wholesale, and food service activities in Belgium, France, and internationally. It operates through three segments: Retail, Wholesale and Foodservice, and Other Activities. The company operates 248 Colruyt stores, 145 OKay stores, 31 Bio-Planet stores, 45 Dreamland stores, 29 Dreambaby stores, and 3 Cru stores in Belgium and Luxembourg, as well as 85 Colruyt stores in France. It also operates ColliShop, a Webshop; and 209 Spar stores. In addition, the company provides fresh products, dry food, and frozen and non-food products; operates 70 ZEB stores, which sells multi-brand fashion products for ladies and men; operates MyUnderwear24, a Webshop that sells underwear and night clothing; and provides meat, wine, cheese, coffee, and bread. Further, it operates 42 DATS 24 filling stations, as well as Collect&Go, an online food market; generates and sells green power using onshore wind turbines, solar panels, and co-generation facilities; and offers print and document management services. It provides its products and services to wholesalers, commercial customers, and affiliated independent merchants, as well as hospitals, schools, care homes, the hospitality sector, etc. The company was founded in 1928 and is headquartered in Halle, Belgium.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "BRU",
        "market": "be_market",
        "country": "Belgium",
        "city": "Halle"
    },
    "COLR.VI": {
        "short_name": "COLRUYT",
        "long_name": "Etn. Fr. Colruyt NV",
        "summary": "Etn. Fr. Colruyt NV, together with its subsidiaries, engages in the retail, wholesale, and food service activities in Belgium, France, and internationally. It operates through three segments: Retail, Wholesale and Foodservice, and Other Activities. The company operates 248 Colruyt stores, 145 OKay stores, 31 Bio-Planet stores, 45 Dreamland stores, 29 Dreambaby stores, and 3 Cru stores in Belgium and Luxembourg, as well as 85 Colruyt stores in France. It also operates ColliShop, a Webshop; and 209 Spar stores. In addition, the company provides fresh products, dry food, and frozen and non-food products; operates 70 ZEB stores, which sells multi-brand fashion products for ladies and men; operates MyUnderwear24, a Webshop that sells underwear and night clothing; and provides meat, wine, cheese, coffee, and bread. Further, it operates 42 DATS 24 filling stations, as well as Collect&Go, an online food market; generates and sells green power using onshore wind turbines, solar panels, and co-generation facilities; and offers print and document management services. It provides its products and services to wholesalers, commercial customers, and affiliated independent merchants, as well as hospitals, schools, care homes, the hospitality sector, etc. The company was founded in 1928 and is headquartered in Halle, Belgium.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Belgium",
        "city": "Halle"
    },
    "CPALL-R.BK": {
        "short_name": "CP ALL PUBLIC COMPANY LIMITED",
        "long_name": "CP ALL Public Company Limited",
        "summary": "CP ALL Public Company Limited, together with its subsidiaries, operates and franchises convenience stores under the 7-Eleven name to other retailers primarily in Thailand. It operates through three segments: Convenience Stores, Cash and Carry, and Other. The company is involved in the manufacture and sale of convenience and frozen foods, and bakery products; sale and maintenance of retail equipment; information technology, as well as marketing and advertising activities; provision of research and development services; and cash and carry and e-commerce business, as well as operates as a life and accident insurance broker. It also distributes commercial cards and tickets, catalog merchandises, and equipment for retailing and software development; and offers bill payment collection, information technology, logistics, smart purse cards, investment, educational institution, human resources development, and training and business seminar services, as well as healthcare and medical specialist's consultation services. As of December 31, 2019, CP ALL Public Company Limited operated 11,712 stores. The company was formerly known as C.P. Seven Eleven Public Company Limited and changed its name to CP ALL Public Company Limited in 2007. CP ALL Public Company Limited was founded in 1988 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "CPALL.BK": {
        "short_name": "CP ALL PUBLIC COMPANY LIMITED",
        "long_name": "CP ALL Public Company Limited",
        "summary": "CP ALL Public Company Limited, together with its subsidiaries, operates and franchises convenience stores under the 7-Eleven name to other retailers primarily in Thailand. It operates through three segments: Convenience Stores, Cash and Carry, and Other. The company is involved in the manufacture and sale of convenience and frozen foods, and bakery products; sale and maintenance of retail equipment; information technology, as well as marketing and advertising activities; provision of research and development services; and cash and carry and e-commerce business, as well as operates as a life and accident insurance broker. It also distributes commercial cards and tickets, catalog merchandises, and equipment for retailing and software development; and offers bill payment collection, information technology, logistics, smart purse cards, investment, educational institution, human resources development, and training and business seminar services, as well as healthcare and medical specialist's consultation services. As of December 31, 2019, CP ALL Public Company Limited operated 11,712 stores. The company was formerly known as C.P. Seven Eleven Public Company Limited and changed its name to CP ALL Public Company Limited in 2007. CP ALL Public Company Limited was founded in 1988 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "CRERF": {
        "short_name": "CARREFOUR SA",
        "long_name": "Carrefour SA",
        "summary": "Carrefour SA operates stores in various formats and channels in France, Spain, Italy, Belgium, Poland, Romania, Brazil, Argentina, and Taiwan. The company operates hypermarkets, convenience stores, supermarkets, cash and carry stores, and hypercash stores; e-commerce sites and m-commerce channels; and service stations. Its stores offer fresh produce; local products; consumer goods; and non-food products, including small household goods, textiles, and home appliances. The company is also involved in banking, insurance, property development, and franchise activities; the provision of travel agency services; and the rental of shopping malls. Carrefour SA was founded in 1959 and is based in Massy, France.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "France",
        "city": "Massy"
    },
    "CRFSA.IS": {
        "short_name": "CARREFOURSA",
        "long_name": "CarrefourSA Carrefour Sabanci Ticaret Merkezi A.S.",
        "summary": "CarrefourSA Carrefour Sabanci Ticaret Merkezi A.S. engages in the retail business in Turkey. It also engages in the construction of non-residential buildings. As of December 31, 2019, it operated 30 hypermarkets and 604 supermarkets. The company was incorporated in 1991 and is headquartered in Istanbul, Turkey. CarrefourSA Carrefour Sabanci Ticaret Merkezi A.S. is a subsidiary of Haci Ã\u0096mer Sabanci Holding A.S.",
        "currency": "TRY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "city": "Istanbul"
    },
    "CRR.MI": {
        "short_name": "CARREFOUR",
        "long_name": "Carrefour SA",
        "summary": "Carrefour SA operates stores in various formats and channels in France, Spain, Italy, Belgium, Poland, Romania, Brazil, Argentina, and Taiwan. The company operates hypermarkets, convenience stores, supermarkets, cash and carry stores, and hypercash stores; e-commerce sites and m-commerce channels; and service stations. Its stores offer fresh produce; local products; consumer goods; and non-food products, including small household goods, textiles, and home appliances. The company is also involved in banking, insurance, property development, and franchise activities; the provision of travel agency services; and the rental of shopping malls. Carrefour SA was founded in 1959 and is based in Massy, France.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "MIL",
        "market": "it_market",
        "country": "France",
        "city": "Massy"
    },
    "CRRFY": {
        "short_name": "CARREFOUR SA",
        "long_name": "Carrefour SA",
        "summary": "Carrefour SA operates stores in various formats and channels in France, Spain, Italy, Belgium, Poland, Romania, Brazil, Argentina, and Taiwan. The company operates hypermarkets, convenience stores, supermarkets, cash and carry stores, and hypercash stores; e-commerce sites and m-commerce channels; and service stations. Its stores offer fresh produce; local products; consumer goods; and non-food products, including small household goods, textiles, and home appliances. The company is also involved in banking, insurance, property development, and franchise activities; the provision of travel agency services; and the rental of shopping malls. Carrefour SA was founded in 1959 and is based in Massy, France.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "France",
        "city": "Massy"
    },
    "CS2.F": {
        "short_name": "CASEY'S GENL STORES",
        "long_name": "Casey's General Stores, Inc.",
        "summary": "Casey's General Stores, Inc., together with its subsidiaries, operates convenience stores under the Casey's and Casey's General Store names. The company's stores offer a selection of food, including freshly prepared foods, such as pizza, donuts, and sandwiches; beverages, tobacco, and nicotine products; health and beauty aids; automotive products; and other nonfood items. Its stores also provide fuel for sale on a self-service basis. In addition, the company operates two stores under the Tobacco City name primarily selling tobacco and nicotine products; one liquor stores; and one grocery store. As of April 30, 2020, it operated 2,207 convenience stores in 16 states in the Midwest. Casey's General Stores, Inc. was founded in 1959 and is headquartered in Ankeny, Iowa.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Ankeny"
    },
    "CUYTF": {
        "short_name": "COLRUYT SA",
        "long_name": "Etn. Fr. Colruyt NV",
        "summary": "Etn. Fr. Colruyt NV, together with its subsidiaries, engages in the retail, wholesale, and food service activities in Belgium, France, and internationally. It operates through three segments: Retail, Wholesale and Foodservice, and Other Activities. The company operates 248 Colruyt stores, 145 OKay stores, 31 Bio-Planet stores, 45 Dreamland stores, 29 Dreambaby stores, and 3 Cru stores in Belgium and Luxembourg, as well as 85 Colruyt stores in France. It also operates ColliShop, a Webshop; and 209 Spar stores. In addition, the company provides fresh products, dry food, and frozen and non-food products; operates 70 ZEB stores, which sells multi-brand fashion products for ladies and men; operates MyUnderwear24, a Webshop that sells underwear and night clothing; and provides meat, wine, cheese, coffee, and bread. Further, it operates 42 DATS 24 filling stations, as well as Collect&Go, an online food market; generates and sells green power using onshore wind turbines, solar panels, and co-generation facilities; and offers print and document management services. It provides its products and services to wholesalers, commercial customers, and affiliated independent merchants, as well as hospitals, schools, care homes, the hospitality sector, etc. The company was founded in 1928 and is headquartered in Halle, Belgium.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Belgium",
        "city": "Halle"
    },
    "CUYTY": {
        "short_name": "COLRUYT SA",
        "long_name": "Etn. Fr. Colruyt NV",
        "summary": "Etn. Fr. Colruyt NV, together with its subsidiaries, engages in the retail, wholesale, and food service activities in Belgium, France, and internationally. It operates through three segments: Retail, Wholesale and Foodservice, and Other Activities. The company operates 248 Colruyt stores, 145 OKay stores, 31 Bio-Planet stores, 45 Dreamland stores, 29 Dreambaby stores, and 3 Cru stores in Belgium and Luxembourg, as well as 85 Colruyt stores in France. It also operates ColliShop, a Webshop; and 209 Spar stores. In addition, the company provides fresh products, dry food, and frozen and non-food products; operates 70 ZEB stores, which sells multi-brand fashion products for ladies and men; operates MyUnderwear24, a Webshop that sells underwear and night clothing; and provides meat, wine, cheese, coffee, and bread. Further, it operates 42 DATS 24 filling stations, as well as Collect&Go, an online food market; generates and sells green power using onshore wind turbines, solar panels, and co-generation facilities; and offers print and document management services. It provides its products and services to wholesalers, commercial customers, and affiliated independent merchants, as well as hospitals, schools, care homes, the hospitality sector, etc. The company was founded in 1928 and is headquartered in Halle, Belgium.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Belgium",
        "city": "Halle"
    },
    "D01.SI": {
        "short_name": "DairyFarm USD",
        "long_name": "Dairy Farm International Holdings Limited",
        "summary": "Dairy Farm International Holdings Limited operates as a retailer in Asia. It operates through five segments: Food, Health and Beauty, Home Furnishings, Restaurants, and Other Retailing. The company operates supermarkets and hypermarkets under the Wellcome, Yonghui, Cold Storage, Jasons, MarketPlace, Giant, Hero, Mercato, Oliver's, 3hreesixty, San Miu, and Lucky brands; and convenience stores under the 7-Eleven brand. It also operates health and beauty stores under the Mannings, Guardian, and GNC brands; and home furnishings stores under the IKEA brand, as well as restaurants under the Maxim's brand. In addition, the company operates department stores, and specialty and do-it-yourself stores. As of December 31, 2020, it operated 9,997 outlets in 12 countries and territories. The company was incorporated in 1886 and is based in Quarry Bay, Hong Kong. Dairy Farm International Holdings Limited is a subsidiary of Jardine Strategic Holdings Limited.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Hong Kong",
        "city": "Quarry Bay"
    },
    "DFA1.F": {
        "short_name": "DAIRY FARM INTL  DL-,056",
        "long_name": "Dairy Farm International Holdings Limited",
        "summary": "Dairy Farm International Holdings Limited operates as a retailer in Asia. It operates through five segments: Food, Health and Beauty, Home Furnishings, Restaurants, and Other Retailing. The company operates supermarkets and hypermarkets under the Wellcome, Yonghui, Cold Storage, Jasons, MarketPlace, Giant, Hero, Mercato, Oliver's, 3hreesixty, San Miu, and Lucky brands; and convenience stores under the 7-Eleven brand. It also operates health and beauty stores under the Mannings, Guardian, and GNC brands; and home furnishings stores under the IKEA brand, as well as restaurants under the Maxim's brand. In addition, the company operates department stores, and specialty and do-it-yourself stores. As of December 31, 2020, it operated 9,997 outlets in 12 countries and territories. The company was incorporated in 1886 and is based in Quarry Bay, Hong Kong. Dairy Farm International Holdings Limited is a subsidiary of Jardine Strategic Holdings Limited.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Quarry Bay"
    },
    "DFIHY": {
        "short_name": "DAIRY FARM INTERNATIONAL HLDGS",
        "long_name": "Dairy Farm International Holdings Limited",
        "summary": "Dairy Farm International Holdings Limited operates as a retailer in Asia. It operates through five segments: Food, Health and Beauty, Home Furnishings, Restaurants, and Other Retailing. The company operates supermarkets and hypermarkets under the Wellcome, Yonghui, Cold Storage, Jasons, MarketPlace, Giant, Hero, Mercato, Oliver's, 3hreesixty, San Miu, and Lucky brands; and convenience stores under the 7-Eleven brand. It also operates health and beauty stores under the Mannings, Guardian, and GNC brands; and home furnishings stores under the IKEA brand, as well as restaurants under the Maxim's brand. In addition, the company operates department stores, and specialty and do-it-yourself stores. As of December 31, 2020, it operated 9,997 outlets in 12 countries and territories. The company was incorporated in 1886 and is based in Quarry Bay, Hong Kong. Dairy Farm International Holdings Limited is a subsidiary of Jardine Strategic Holdings Limited.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Quarry Bay"
    },
    "DFILF": {
        "short_name": "DAIRY FARM INTERNATIONAL HLDGS",
        "long_name": "Dairy Farm International Holdings Limited",
        "summary": "Dairy Farm International Holdings Limited operates as a retailer in Asia. It operates through five segments: Food, Health and Beauty, Home Furnishings, Restaurants, and Other Retailing. The company operates supermarkets and hypermarkets under the Wellcome, Yonghui, Cold Storage, Jasons, MarketPlace, Giant, Hero, Mercato, Oliver's, 3hreesixty, San Miu, and Lucky brands; and convenience stores under the 7-Eleven brand. It also operates health and beauty stores under the Mannings, Guardian, and GNC brands; and home furnishings stores under the IKEA brand, as well as restaurants under the Maxim's brand. In addition, the company operates department stores, and specialty and do-it-yourself stores. As of December 31, 2020, it operated 9,997 outlets in 12 countries and territories. The company was incorporated in 1886 and is based in Quarry Bay, Hong Kong. Dairy Farm International Holdings Limited is a subsidiary of Jardine Strategic Holdings Limited.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Quarry Bay"
    },
    "DNOPY": {
        "short_name": "DINO POLSKA SA UNSPON ADS EACH ",
        "long_name": "Dino Polska S.A.",
        "summary": "Dino Polska S.A., together with its subsidiaries, operates a chain of mid-sized grocery supermarkets under the Dino name in Poland. The company offers range of food products, including meat, poultry and cold cuts, fruit and vegetables, bakery, and dairy products, as well as other food, chemical, and cosmetic products; grocery products, such as children's food, breakfast products, ready to eat meals, beverages, candies, snacks, frozen goods, processed goods, oils, grain and bulk products, condiments, and alcohol and cigarettes; and non-grocery products, which include flowers, cleaning agents, sanitary articles, pet food and small household appliance products. It is also involved in producing, processing, and preserving of meat products; investments in properties, shares, and bonds; renting and operating of own or leased real estate; private purchase and sale of real estate; and manufacturing and processing of refined petroleum products and retail sale of automotive fuels, as well as provision of warehousing and storage, and financial services. As of March 31, 2021, the company operated 1,532 stores. Dino Polska S.A. was founded in 2007 and is based in Krotoszyn, Poland.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Poland",
        "city": "Krotoszyn"
    },
    "E07.F": {
        "short_name": "EUROCASH S.A. CL.A  ZY 1",
        "long_name": "Eurocash S.A.",
        "summary": "Eurocash S.A. distributes fast moving consumer goods (FMCG) in Poland. The company operates through Wholesale, Retail, and Projects segments. Its FMCG products include food products, soft drinks, alcoholic beverages, tobacco products, and household chemicals and cosmetics. The company markets its products to traditional retail stores, including small supermarkets, grocery stores, and specialized grocery stores; and kiosks, retail outlets, and convenience stores at petrol stations, restaurants, hotels, cafeterias, and catering outlets. As of December 31, 2019, it operated a network of 180 Cash & Carry warehouses; 1,351 Delikatesy Centrum network supermarkets; 450 Inmedio press salons; 8,985 abc network grocery stores; and 5,133 franchise and partner stores of Eurocash distribution. Eurocash S.A. is headquartered in Komorniki, Poland.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "city": "Komorniki"
    },
    "EFC1.F": {
        "short_name": "COLRUYT",
        "long_name": "Etn. Fr. Colruyt NV",
        "summary": "Etn. Fr. Colruyt NV, together with its subsidiaries, engages in the retail, wholesale, and food service activities in Belgium, France, and internationally. It operates through three segments: Retail, Wholesale and Foodservice, and Other Activities. The company operates 248 Colruyt stores, 145 OKay stores, 31 Bio-Planet stores, 45 Dreamland stores, 29 Dreambaby stores, and 3 Cru stores in Belgium and Luxembourg, as well as 85 Colruyt stores in France. It also operates ColliShop, a Webshop; and 209 Spar stores. In addition, the company provides fresh products, dry food, and frozen and non-food products; operates 70 ZEB stores, which sells multi-brand fashion products for ladies and men; operates MyUnderwear24, a Webshop that sells underwear and night clothing; and provides meat, wine, cheese, coffee, and bread. Further, it operates 42 DATS 24 filling stations, as well as Collect&Go, an online food market; generates and sells green power using onshore wind turbines, solar panels, and co-generation facilities; and offers print and document management services. It provides its products and services to wholesalers, commercial customers, and affiliated independent merchants, as well as hospitals, schools, care homes, the hospitality sector, etc. The company was founded in 1928 and is headquartered in Halle, Belgium.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Belgium",
        "city": "Halle"
    },
    "EMLAF": {
        "short_name": "EMPIRE CO",
        "long_name": "Empire Company Limited",
        "summary": "Empire Company Limited, together with its subsidiaries, engages in the food retail and real estate businesses in Canada. It operates in two segments, Food Retailing, and Investments and Other Operations. The company owns, affiliates, and franchises approximately 1,500 retail stores under various retail banners; and approximately 350 retail fuel locations. It also owns an interest in the Crombie Real Estate Investment Trust, an open-ended real estate investment trust to own, operate, and develop a portfolio of grocery and drug store anchored shopping centers, freestanding stores, and mixed use developments; and various equity accounted interests in Genstar partnerships that develop residential real estate properties in Ontario, Western Canada, as well as in the United States. The company was founded in 1907 and is headquartered in Stellarton, Canada.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Stellarton"
    },
    "EUSHY": {
        "short_name": "EUROCASH SA",
        "long_name": "Eurocash S.A.",
        "summary": "Eurocash S.A. distributes fast moving consumer goods (FMCG) in Poland. The company operates through Wholesale, Retail, and Projects segments. Its FMCG products include food products, soft drinks, alcoholic beverages, tobacco products, and household chemicals and cosmetics. The company markets its products to traditional retail stores, including small supermarkets, grocery stores, and specialized grocery stores; and kiosks, retail outlets, and convenience stores at petrol stations, restaurants, hotels, cafeterias, and catering outlets. As of December 31, 2019, it operated a network of 180 Cash & Carry warehouses; 1,351 Delikatesy Centrum network supermarkets; 450 Inmedio press salons; 8,985 abc network grocery stores; and 5,133 franchise and partner stores of Eurocash distribution. Eurocash S.A. is headquartered in Komorniki, Poland.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Poland",
        "city": "Komorniki"
    },
    "FFPM": {
        "short_name": "FFP MARKETING INC",
        "long_name": "FFP Marketing Company, Inc.",
        "summary": "FFP Marketing Company, Inc., through its subsidiaries, operates convenience stores with gas station. It also retails motor fuel, merchandise, and ancillary products and services at convenience stores, and truck stop. The company operates motor fuel terminal and processing facility. The convenience stores sell groceries, tobacco product, take-out food and beverages, dairy products, and non-food merchandise, such as money order, telephone calling cards, lottery tickets, health and beauty aid, magazines, and motor fuel. The company sells motor fuel on a wholesale basis to independent, regional chain and end user, such as contractors, operators of vehicle fleet, and public utilities. The company was founded in 1997 and is based in Fort Worth, Texas.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Fort Worth"
    },
    "FIVE.ME": {
        "short_name": "X5 RETAIL GROUP NV",
        "long_name": "X5 Retail Group N.V.",
        "summary": "X5 Retail Group N.V. operates as a food retailer in Russia. As of December 31, 2020, the company had 17,707 company-operated stores, including 16,709 Pyaterochka proximity stores, 933 Perekrestok supermarkets, 56 Karusel hypermarkets, 4 Chizhik hard discounters, and 5 Perekrestok Vprok dark stores. It also engages in wholesale operations and online retail business, as well as providing franchise and other services. The company was founded in 1975 and is headquartered in Amsterdam, the Netherlands.",
        "currency": "RUB",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Netherlands",
        "city": "Amsterdam"
    },
    "FIVE.VI": {
        "short_name": "X5 RETAIL GROUP GDR",
        "long_name": "X5 Retail Group N.V.",
        "summary": "X5 Retail Group N.V. operates as a food retailer in Russia. As of December 31, 2020, the company had 17,707 company-operated stores, including 16,709 Pyaterochka proximity stores, 933 Perekrestok supermarkets, 56 Karusel hypermarkets, 4 Chizhik hard discounters, and 5 Perekrestok Vprok dark stores. It also engages in wholesale operations and online retail business, as well as providing franchise and other services. The company was founded in 1975 and is headquartered in Amsterdam, the Netherlands.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Netherlands",
        "city": "Amsterdam"
    },
    "FRSM.TA": {
        "short_name": "FRESHMARKET LTD",
        "long_name": "Freshmarket Ltd.",
        "summary": "Freshmarket Ltd. operates a chain of supermarkets in Israel. It operates 31 supermarket branches. The company was founded in 2002 and is based in Herzliya, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Herzliya"
    },
    "GO": {
        "short_name": "Grocery Outlet Holding Corp.",
        "long_name": "Grocery Outlet Holding Corp.",
        "summary": "Grocery Outlet Holding Corp. owns and operates a network of independently operated stores in the United States. The company's stores offer products in various categories, such as dairy and deli, produce, floral, and fresh meat and seafood products, as well as grocery, general merchandise, health and beauty care, frozen foods, and beer and wine. As of January 2, 2021, it had 380 stores in California, Washington, Oregon, Pennsylvania, Idaho, and Nevada. The company was founded in 1946 and is headquartered in Emeryville, California.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "EmeryVille"
    },
    "GRG.L": {
        "short_name": "GREGGS PLC ORD 2P",
        "long_name": "Greggs plc",
        "summary": "Greggs plc operates as a bakery food-on-the-go retailer in the United Kingdom. It offers a range of fresh and frozen bakery products, sandwiches, and drinks. The company sells its products through its shops in travel, leisure, and work-centered catchments; and franchised shops operated by partners in travel and other convenience locations. It is also involved in the property holding, non-trading, and trustee businesses. As of December 28, 2019, the company operated 2,050 shops, which included 302 franchised shops. Greggs plc was founded in 1939 and is based in Newcastle upon Tyne, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Newcastle upon Tyne"
    },
    "HAGA.IC": {
        "short_name": "Hagar hf.",
        "long_name": "Hagar hf",
        "summary": "Hagar hf. operates retail stores in Iceland. Its stores offer food, beauty products, leisure products, and seasonal products, as well as sells apparel and accessories for ladies, men, and children; sports and outdoor recreation equipment; and nursing products, health products, cosmetics, and sanitary products. The company also imports and distributes fruits and vegetables; processes meat; and provides customs processing, stock keeping and order fulfillment, product labeling, and other services. The company operates 40 grocery stores, 28 OlÃ­s service centers, 43 OB stations, two supply stores, three specialty stores, two pharmacies, two warehouses, and two production centers. Hagar hf. is headquartered in Kopavogur, Iceland.",
        "currency": "ISK",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "ICE",
        "market": "ic_market",
        "country": "Iceland",
        "city": "KÃ³pavogur"
    },
    "HCMC": {
        "short_name": "HEALTHIER CHOICES MANAGEMENT CO",
        "long_name": "Healthier Choices Management Corp.",
        "summary": "Healthier Choices Management Corp. provides e-liquids, vaporizers, and related products. The company operates through two segments, Natural and Organic Retail Stores, and Vapor Products. Its vaporizers are battery-powered products that enable users to inhale nicotine vapor. The company sells its e-liquid under the Vape Store brand name; and offers its products through nine retail vape stores in the Southeast region of the United States. In addition, it offers fresh produce; bulk foods and private label products; vitamins and supplements; packaged groceries; meat and seafood; deli; baked goods, dairy products and substitutes; dry, frozen, and canned groceries; health and beauty products; and natural household items through Ada's Natural Market, a natural and organic grocery store. Further, the company provides prepared foods, bread and baked goods, beverages, body care, dietary supplements, and household and general merchandise products, as well as Q-Cup technology for consumers who prefer to vape concentrates either medicinally or recreationally. It sells its product directly to consumers through the company owned retail vape stores. The company was formerly known as Vapor Corp. and changed its name to Healthier Choices Management Corp. in March 2017. Healthier Choices Management Corp. is headquartered in Hollywood, Florida.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Hollywood"
    },
    "HWIN": {
        "short_name": "HOMETOWN INTERNATIONAL INC",
        "long_name": "Hometown International, Inc.",
        "summary": "Hometown International, Inc., through its subsidiary, Your Hometown Deli Limited Liability Company, operates a delicatessen store under the Your Hometown Deli brand name in the United States. Its Your Hometown Deli store provides sandwiches; soups; salads, including made-to-order green salads, prepared pasta, potato, chicken, and various wet salads; deli meats/cheeses; hot/cold drinks; fresh breads/rolls; breakfast products, such as pastries, bagels, and toast; yogurt; and small retail items for cooking, baking, and home use, as well as coffee, tea, and other hot and cold beverages. Hometown International, Inc. was incorporated in 2014 and is based in Woodstown, New Jersey.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Woodstown"
    },
    "ICA.ST": {
        "short_name": "ICA Gruppen AB",
        "long_name": "ICA Gruppen AB (publ)",
        "summary": "ICA Gruppen AB (publ), together with its subsidiaries, engages in the grocery retail business primarily in Sweden and the Baltic countries. The company operates through five segments: ICA Sweden, Rimi Baltic, Apotek HjÃ¤rtat, ICA Real Estate, and ICA Bank. It offers various organic products, private label products, and non-food products; and conducts pharmacy operations. The company operates approximately 1,550 grocery stores in Sweden, Estonia, Latvia, and Lithuania; and 390 pharmacies in Sweden. It also acquires, develops, and manages property portfolio in the retail segment; and provides banking and insurance products and services to private and business customers. The company was formerly known as Hakon Invest AB and changed its name to ICA Gruppen AB (publ) in May 2013. The company was founded in 1917 and is headquartered in Solna, Sweden. ICA Gruppen AB (publ) is a subsidiary of ICA-handlarnas FÃ¶rbund.",
        "currency": "SEK",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Solna"
    },
    "IFE.F": {
        "short_name": "IFRESH INC.  DL-,01",
        "long_name": "iFresh Inc.",
        "summary": "iFresh Inc., through its subsidiaries, operates a network of grocery supermarket chains in the north-eastern United States. It operates through Wholesale and Retail segments. The company provides vegetables, seafood, meat, fruits, snacks, seasonings, and spices, such as peanut oil, cooking wine, vinegar, dark soy sauce, black bean sauce, pepper oil, and chilly oil; tea, condiments, canned goods, flour products, marine food products, candies groceries, traditional Chinese medicine, health products, and dried food; rice and rice products; assortment of noodles, frozen vegetables, frozen dumplings, frozen seafood products, and aquatic products; and cooking utensils. Its brand portfolio includes Family Elephant, Feiyan, Green Acre, Golden Smell, Redolent, and I FRESH. The company also distributes its products to wholesale stores, retail supermarkets, and restaurants. As of August 10, 2020, it operated nine retail supermarkets and two in-house wholesale businesses. The company offers its products through online sales channels and delivery network in suburban areas. iFresh Inc. was founded in 1995 and is headquartered in Long Island City, New York.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Long Island City"
    },
    "IFMK": {
        "short_name": "iFresh Inc.",
        "long_name": "iFresh Inc.",
        "summary": "iFresh Inc., through its subsidiaries, operates a network of grocery supermarket chains in the north-eastern United States. It operates through Wholesale and Retail segments. The company provides vegetables, seafood, meat, fruits, snacks, seasonings, and spices, such as peanut oil, cooking wine, vinegar, dark soy sauce, black bean sauce, pepper oil, and chilly oil; tea, condiments, canned goods, flour products, marine food products, candies groceries, traditional Chinese medicine, health products, and dried food; rice and rice products; assortment of noodles, frozen vegetables, frozen dumplings, frozen seafood products, and aquatic products; and cooking utensils. Its brand portfolio includes Family Elephant, Feiyan, Green Acre, Golden Smell, Redolent, and I FRESH. The company also distributes its products to wholesale stores, retail supermarkets, and restaurants. As of August 10, 2020, it operated nine retail supermarkets and two in-house wholesale businesses. The company offers its products through online sales channels and delivery network in suburban areas. iFresh Inc. was founded in 1995 and is headquartered in Long Island City, New York.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Long Island City"
    },
    "IGSC": {
        "short_name": "IGS CAPITAL GROUP LTD",
        "long_name": "IGS Capital Group Limited",
        "summary": "IGS Capital Group Limited, through its subsidiary, IGS Mart SDN BHD, operates a convenient store in Malaysia. It operates its store under the Like Mart name. The company was formerly known as Sancon Resources Recovery, Inc. and changed its name to IGS Capital Group Limited in June 2017. The company is based in Petaling Jaya, Malaysia. IGS Capital Group Limited is a subsidiary of Pontoon Boat Inc.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "city": "Petaling Jaya"
    },
    "IMKTA": {
        "short_name": "Ingles Markets, Incorporated",
        "long_name": "Ingles Markets, Incorporated",
        "summary": "Ingles Markets, Incorporated operates a chain of supermarkets in the southeast United States. Its supermarkets offer various food products, including grocery, meat and dairy products, produce, frozen foods, and other perishables; and non-food products, such as fuel centers, pharmacies, health and beauty care products, and general merchandise, as well as private label items. The company also provides home meal replacement items, delicatessens, bakeries, floral departments, and greeting cards, as well as organic, beverage, and health-related items. As of September 26, 2020, it operated 188 supermarkets under the Ingles name; and nine supermarkets under the Sav-Mor name in western North Carolina, western South Carolina, northern Georgia, eastern Tennessee, southwestern Virginia, and northeastern Alabama, as well as 109 pharmacies and 106 fuel stations. In addition, it is involved in fluid dairy operations and shopping center rental businesses. Ingles Markets, Incorporated was founded in 1963 and is headquartered in Asheville, North Carolina.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Asheville"
    },
    "IN3A.F": {
        "short_name": "INGLES MARKETS A  DL-,05",
        "long_name": "Ingles Markets, Incorporated",
        "summary": "Ingles Markets, Incorporated operates a chain of supermarkets in the southeast United States. Its supermarkets offer various food products, including grocery, meat and dairy products, produce, frozen foods, and other perishables; and non-food products, such as fuel centers, pharmacies, health and beauty care products, and general merchandise, as well as private label items. The company also provides home meal replacement items, delicatessens, bakeries, floral departments, and greeting cards, as well as organic, beverage, and health-related items. As of September 26, 2020, it operated 188 supermarkets under the Ingles name; and nine supermarkets under the Sav-Mor name in western North Carolina, western South Carolina, northern Georgia, eastern Tennessee, southwestern Virginia, and northeastern Alabama, as well as 109 pharmacies and 106 fuel stations. In addition, it is involved in fluid dairy operations and shopping center rental businesses. Ingles Markets, Incorporated was founded in 1963 and is headquartered in Asheville, North Carolina.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Asheville"
    },
    "JSAIY": {
        "short_name": "SAINSBURY(J)",
        "long_name": "J Sainsbury plc",
        "summary": "J Sainsbury plc, together with its subsidiaries, engages in the food, general merchandise and clothing retailing, and financial services activities in the United Kingdom. It operates through three segments: Retail Â\u0096 Food, Retail Â\u0096 General Merchandise and Clothing, and Financial Services. The company operates various store formats, including convenience stores and supermarkets. It is also involved in online grocery and general merchandise operations. As of March 7, 2020, the company operated 882 Argos stores and 281 collection points, as well as 16 Habitat stores. In addition, the company offers financial services, such as credit cards, and travel money and personal loans, as well as home, car, pet, and life insurance. J Sainsbury plc was founded in 1869 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "JSNSF": {
        "short_name": "SAINSBURY(J)",
        "long_name": "J Sainsbury plc",
        "summary": "J Sainsbury plc, together with its subsidiaries, engages in the food, general merchandise and clothing retailing, and financial services activities in the United Kingdom. It operates through three segments: Retail Â\u0096 Food, Retail Â\u0096 General Merchandise and Clothing, and Financial Services. The company operates various store formats, including convenience stores and supermarkets. It is also involved in online grocery and general merchandise operations. As of March 7, 2020, the company operated 882 Argos stores and 281 collection points, as well as 16 Habitat stores. In addition, the company offers financial services, such as credit cards, and travel money and personal loans, as well as home, car, pet, and life insurance. J Sainsbury plc was founded in 1869 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "K1RC34.SA": {
        "short_name": "KROGER CO   DRN",
        "long_name": "The Kroger Co.",
        "summary": "The Kroger Co. operates as a retailer in the United States. The company operates combination food and drug stores, multi-department stores, marketplace stores, and price impact warehouses. Its combination food and drug stores offer natural food and organic sections, pharmacies, general merchandise, pet centers, fresh seafood, and organic produce; and multi-department stores provide apparel, home fashion and furnishings, outdoor living, electronics, automotive products, and toys. The company's marketplace stores offer full-service grocery, pharmacy, health and beauty care departments, and perishable goods, as well as general merchandise, including apparel, home goods, and toys; and price impact warehouse stores provide grocery, and health and beauty care items, as well as meat, dairy, baked goods, and fresh produce items. It also manufactures and processes food products for sale in its supermarkets; and sells fuel through 1,596 fuel centers. As of January 30, 2021, the company operated 2,742 retail food stores under various banner names in 35 states and the District of Columbia as well as an online retail store. The Kroger Co. was founded in 1883 and is based in Cincinnati, Ohio.",
        "currency": "BRL",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Cincinnati"
    },
    "KEK.F": {
        "short_name": "KESKO B",
        "long_name": "Kesko Oyj",
        "summary": "Kesko Oyj provides trading sector services. The company operates through Grocery Trade, Building and Technical Trade, and Car Trade segments. The company's Grocery Trade segment is involved in the wholesale and B2B trade of groceries; and the retail sale of home and specialty goods in Finland. This segment operates approximately 1,236 K-food stores, including K-Citymarket, K-Supermarket, K-Market, and Neste K in Finland. Its Building and Technical Trade segment engages in the retail, wholesale, and B2B trade of building and home improvement, and electrical and HEPAC products, as well as trades in leisure goods. This segment operates approximately 562 stores through K-Rauta, K-Bygg, Byggmakker, K-Senukai, OMA, and Onninen names, as well as leisure goods trade chains through Intersport, Budget Sport, The Athlete's Foot, and KookenkÃ¤ names in Finland, Sweden, Norway, the Baltic countries, Poland, and Belarus; and online stores. The company's Car Trade segment imports and markets Volkswagen, Audi, Seat, Bentley, and Porsche passenger cars, as well as Volkswagen and MAN commercial vehicles in Finland; and SEAT cars in Estonia and Latvia. It is also involved in car retailing activities; and the provision of servicing and after-sales services at its 17 retail outlets in Finland. The company was founded in 1940 and is headquartered in Helsinki, Finland.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Finland",
        "city": "Helsinki"
    },
    "KESKOA.HE": {
        "short_name": "Kesko Corporation A",
        "long_name": "Kesko Oyj",
        "summary": "Kesko Oyj provides trading sector services. The company operates through Grocery Trade, Building and Technical Trade, and Car Trade segments. The company's Grocery Trade segment is involved in the wholesale and B2B trade of groceries; and the retail sale of home and specialty goods in Finland. This segment operates approximately 1,236 K-food stores, including K-Citymarket, K-Supermarket, K-Market, and Neste K in Finland. Its Building and Technical Trade segment engages in the retail, wholesale, and B2B trade of building and home improvement, and electrical and HEPAC products, as well as trades in leisure goods. This segment operates approximately 562 stores through K-Rauta, K-Bygg, Byggmakker, K-Senukai, OMA, and Onninen names, as well as leisure goods trade chains through Intersport, Budget Sport, The Athlete's Foot, and KookenkÃ¤ names in Finland, Sweden, Norway, the Baltic countries, Poland, and Belarus; and online stores. The company's Car Trade segment imports and markets Volkswagen, Audi, Seat, Bentley, and Porsche passenger cars, as well as Volkswagen and MAN commercial vehicles in Finland; and SEAT cars in Estonia and Latvia. It is also involved in car retailing activities; and the provision of servicing and after-sales services at its 17 retail outlets in Finland. The company was founded in 1940 and is headquartered in Helsinki, Finland.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Helsinki"
    },
    "KESKOB.HE": {
        "short_name": "Kesko Corporation B",
        "long_name": "Kesko Oyj",
        "summary": "Kesko Oyj provides trading sector services. The company operates through Grocery Trade, Building and Technical Trade, and Car Trade segments. The company's Grocery Trade segment is involved in the wholesale and B2B trade of groceries; and the retail sale of home and specialty goods in Finland. This segment operates approximately 1,236 K-food stores, including K-Citymarket, K-Supermarket, K-Market, and Neste K in Finland. Its Building and Technical Trade segment engages in the retail, wholesale, and B2B trade of building and home improvement, and electrical and HEPAC products, as well as trades in leisure goods. This segment operates approximately 562 stores through K-Rauta, K-Bygg, Byggmakker, K-Senukai, OMA, and Onninen names, as well as leisure goods trade chains through Intersport, Budget Sport, The Athlete's Foot, and KookenkÃ¤ names in Finland, Sweden, Norway, the Baltic countries, Poland, and Belarus; and online stores. The company's Car Trade segment imports and markets Volkswagen, Audi, Seat, Bentley, and Porsche passenger cars, as well as Volkswagen and MAN commercial vehicles in Finland; and SEAT cars in Estonia and Latvia. It is also involved in car retailing activities; and the provision of servicing and after-sales services at its 17 retail outlets in Finland. The company was founded in 1940 and is headquartered in Helsinki, Finland.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Helsinki"
    },
    "KK-R.BK": {
        "short_name": "K&K SUPERSTORE SOUTHERN PUBLIC ",
        "long_name": "K&K Superstore Southern Public Company Limited",
        "summary": "K&K Superstore Southern Public Company Limited engages in the distribution of consumer products in Thailand. Its utensils products comprise household cleaning products, including detergents, fabric softeners, compressed petals, etc.; products for daily use, which include toothpaste, toothbrush, mouthwash, etc.; skin and hair products, such as shampoo, shower cream, soap, etc.; beauty products comprising powder, cream, skin care, cologne, etc.; and products for children and adults, such as brushes for milk, baby diapers, adult diapers, etc. The company's consumer products include beverage products, which include cocoa powder, coffee, non-dairy cream, etc.; flavored milk products, such as milk powder, sweetened condensed milk, UHT milk, etc.; beverage products, including drinking water, soft drinks, health drinks, etc.; condiments and dry food products, such as condiments, vegetable oil, rice, etc.; and snack products comprising chewing gum, candy, etc. It operates 26 stores under the K&K Superstore brand name. The company was founded in 1993 and is based in Songkhla, Thailand.",
        "currency": "THB",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Songkhla"
    },
    "KK.BK": {
        "short_name": "K&K SUPERSTORE SOUTHERN PUBLIC ",
        "long_name": "K&K Superstore Southern Public Company Limited",
        "summary": "K&K Superstore Southern Public Company Limited engages in the distribution of consumer products in Thailand. Its utensils products comprise household cleaning products, including detergents, fabric softeners, compressed petals, etc.; products for daily use, which include toothpaste, toothbrush, mouthwash, etc.; skin and hair products, such as shampoo, shower cream, soap, etc.; beauty products comprising powder, cream, skin care, cologne, etc.; and products for children and adults, such as brushes for milk, baby diapers, adult diapers, etc. The company's consumer products include beverage products, which include cocoa powder, coffee, non-dairy cream, etc.; flavored milk products, such as milk powder, sweetened condensed milk, UHT milk, etc.; beverage products, including drinking water, soft drinks, health drinks, etc.; condiments and dry food products, such as condiments, vegetable oil, rice, etc.; and snack products comprising chewing gum, candy, etc. It operates 26 stores under the K&K Superstore brand name. The company was founded in 1993 and is based in Songkhla, Thailand.",
        "currency": "THB",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Songkhla"
    },
    "KKOYY": {
        "short_name": "KESKO OYJ",
        "long_name": "Kesko Oyj",
        "summary": "Kesko Oyj provides trading sector services. The company operates through Grocery Trade, Building and Technical Trade, and Car Trade segments. The company's Grocery Trade segment is involved in the wholesale and B2B trade of groceries; and the retail sale of home and specialty goods in Finland. This segment operates approximately 1,236 K-food stores, including K-Citymarket, K-Supermarket, K-Market, and Neste K in Finland. Its Building and Technical Trade segment engages in the retail, wholesale, and B2B trade of building and home improvement, and electrical and HEPAC products, as well as trades in leisure goods. This segment operates approximately 562 stores through K-Rauta, K-Bygg, Byggmakker, K-Senukai, OMA, and Onninen names, as well as leisure goods trade chains through Intersport, Budget Sport, The Athlete's Foot, and KookenkÃ¤ names in Finland, Sweden, Norway, the Baltic countries, Poland, and Belarus; and online stores. The company's Car Trade segment imports and markets Volkswagen, Audi, Seat, Bentley, and Porsche passenger cars, as well as Volkswagen and MAN commercial vehicles in Finland; and SEAT cars in Estonia and Latvia. It is also involved in car retailing activities; and the provision of servicing and after-sales services at its 17 retail outlets in Finland. The company was founded in 1940 and is headquartered in Helsinki, Finland.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Finland",
        "city": "Helsinki"
    },
    "KMOL.AT": {
        "short_name": "KARAMOLEGOS BAKERY INDUSTRY",
        "long_name": "Karamolengos Bakery Industry S.A.",
        "summary": "Karamolengos Bakery Industry S.A. manufactures and sells bakery products in Greece. It offers toast bread, sliced bread, buns, pies, wheat bread, and crumbs. The company was founded in 1950 and is based in Koropi, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Grocery Stores",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Koropi"
    },
    "KOG.DE": {
        "short_name": "KROGER CO.  DL 1",
        "long_name": "The Kroger Co.",
        "summary": "The Kroger Co. operates as a retailer in the United States. The company operates combination food and drug stores, multi-department stores, marketplace stores, and price impact warehouses. Its combination food and drug stores offer natural food and organic sections, pharmacies, general merchandise, pet centers, fresh seafood, and organic produce; and multi-department stores provide apparel, home fashion and furnishings, outdoor living, electronics, automotive products, and toys. The company's marketplace stores offer full-service grocery, pharmacy, health and beauty care departments, and perishable goods, as well as general merchandise, including apparel, home goods, and toys; and price impact warehouse stores provide grocery, and health and beauty care items, as well as meat, dairy, baked goods, and fresh produce items. It also manufactures and processes food products for sale in its supermarkets; and sells fuel through 1,596 fuel centers. As of January 30, 2021, the company operated 2,742 retail food stores under various banner names in 35 states and the District of Columbia as well as an online retail store. The Kroger Co. was founded in 1883 and is based in Cincinnati, Ohio.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Cincinnati"
    },
    "KOG.F": {
        "short_name": "KROGER CO.  DL 1",
        "long_name": "The Kroger Co.",
        "summary": "The Kroger Co. operates as a retailer in the United States. The company operates combination food and drug stores, multi-department stores, marketplace stores, and price impact warehouses. Its combination food and drug stores offer natural food and organic sections, pharmacies, general merchandise, pet centers, fresh seafood, and organic produce; and multi-department stores provide apparel, home fashion and furnishings, outdoor living, electronics, automotive products, and toys. The company's marketplace stores offer full-service grocery, pharmacy, health and beauty care departments, and perishable goods, as well as general merchandise, including apparel, home goods, and toys; and price impact warehouse stores provide grocery, and health and beauty care items, as well as meat, dairy, baked goods, and fresh produce items. It also manufactures and processes food products for sale in its supermarkets; and sells fuel through 1,596 fuel centers. As of January 30, 2021, the company operated 2,742 retail food stores under various banner names in 35 states and the District of Columbia as well as an online retail store. The Kroger Co. was founded in 1883 and is based in Cincinnati, Ohio.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Cincinnati"
    },
    "KR.MX": {
        "short_name": "KROGER CO",
        "long_name": "The Kroger Co.",
        "summary": "The Kroger Co. operates as a retailer in the United States. The company operates combination food and drug stores, multi-department stores, marketplace stores, and price impact warehouses. Its combination food and drug stores offer natural food and organic sections, pharmacies, general merchandise, pet centers, fresh seafood, and organic produce; and multi-department stores provide apparel, home fashion and furnishings, outdoor living, electronics, automotive products, and toys. The company's marketplace stores offer full-service grocery, pharmacy, health and beauty care departments, and perishable goods, as well as general merchandise, including apparel, home goods, and toys; and price impact warehouse stores provide grocery, and health and beauty care items, as well as meat, dairy, baked goods, and fresh produce items. It also manufactures and processes food products for sale in its supermarkets; and sells fuel through 1,596 fuel centers. As of January 30, 2021, the company operated 2,742 retail food stores under various banner names in 35 states and the District of Columbia as well as an online retail store. The Kroger Co. was founded in 1883 and is based in Cincinnati, Ohio.",
        "currency": "MXN",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Cincinnati"
    },
    "KR": {
        "short_name": "Kroger Company (The)",
        "long_name": "The Kroger Co.",
        "summary": "The Kroger Co. operates as a retailer in the United States. The company operates combination food and drug stores, multi-department stores, marketplace stores, and price impact warehouses. Its combination food and drug stores offer natural food and organic sections, pharmacies, general merchandise, pet centers, fresh seafood, and organic produce; and multi-department stores provide apparel, home fashion and furnishings, outdoor living, electronics, automotive products, and toys. The company's marketplace stores offer full-service grocery, pharmacy, health and beauty care departments, and perishable goods, as well as general merchandise, including apparel, home goods, and toys; and price impact warehouse stores provide grocery, and health and beauty care items, as well as meat, dairy, baked goods, and fresh produce items. It also manufactures and processes food products for sale in its supermarkets; and sells fuel through 1,596 fuel centers. As of January 30, 2021, the company operated 2,742 retail food stores under various banner names in 35 states and the District of Columbia as well as an online retail store. The Kroger Co. was founded in 1883 and is based in Cincinnati, Ohio.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Cincinnati"
    },
    "L-PB.TO": {
        "short_name": "LOBLAW COMPANIES LTD 2ND PREF S",
        "long_name": "Loblaw Companies Limited",
        "summary": "Loblaw Companies Limited, a food and pharmacy company, engages in the grocery, pharmacy, health and beauty, apparel, general merchandise, financial services, and wireless mobile products and services businesses in Canada. It operates in two segments, Retail and Financial Services. The Retail segment operates corporate and franchise-owned retail food, and associate-owned drug stores. This segment also includes in-store pharmacies, other health and beauty product stores, apparel stores, and other general merchandise stores. The Financial Services segment provides credit card and banking services, the PC Optimum program, insurance brokerage services, and telecommunication services. It also offers PC Healthapp, a health and wellness app that provides Canadians with access to healthcare resources and support. Loblaw Companies Limited provides its products and services under various brands. The company was founded in 1919 and is headquartered in Brampton, Canada. Loblaw Companies Limited is a subsidiary of George Weston Limited.",
        "currency": "CAD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Brampton"
    },
    "L.TO": {
        "short_name": "LOBLAW CO",
        "long_name": "Loblaw Companies Limited",
        "summary": "Loblaw Companies Limited, a food and pharmacy company, engages in the grocery, pharmacy, health and beauty, apparel, general merchandise, financial services, and wireless mobile products and services businesses in Canada. It operates in two segments, Retail and Financial Services. The Retail segment operates corporate and franchise-owned retail food, and associate-owned drug stores. This segment also includes in-store pharmacies, other health and beauty product stores, apparel stores, and other general merchandise stores. The Financial Services segment provides credit card and banking services, the PC Optimum program, insurance brokerage services, and telecommunication services. It also offers PC Healthapp, a health and wellness app that provides Canadians with access to healthcare resources and support. Loblaw Companies Limited provides its products and services under various brands. The company was founded in 1919 and is headquartered in Brampton, Canada. Loblaw Companies Limited is a subsidiary of George Weston Limited.",
        "currency": "CAD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Brampton"
    },
    "L8G.F": {
        "short_name": "LOBLAW COS LTD",
        "long_name": "Loblaw Companies Limited",
        "summary": "Loblaw Companies Limited, a food and pharmacy company, engages in the grocery, pharmacy, health and beauty, apparel, general merchandise, financial services, and wireless mobile products and services businesses in Canada. It operates in two segments, Retail and Financial Services. The Retail segment operates corporate and franchise-owned retail food, and associate-owned drug stores. This segment also includes in-store pharmacies, other health and beauty product stores, apparel stores, and other general merchandise stores. The Financial Services segment provides credit card and banking services, the PC Optimum program, insurance brokerage services, and telecommunication services. It also offers PC Healthapp, a health and wellness app that provides Canadians with access to healthcare resources and support. Loblaw Companies Limited provides its products and services under various brands. The company was founded in 1919 and is headquartered in Brampton, Canada. Loblaw Companies Limited is a subsidiary of George Weston Limited.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Brampton"
    },
    "LBLCF": {
        "short_name": "LOBLAWS COMPANIES LIMITED",
        "long_name": "Loblaw Companies Limited",
        "summary": "Loblaw Companies Limited, a food and pharmacy company, engages in the grocery, pharmacy, health and beauty, apparel, general merchandise, financial services, and wireless mobile products and services businesses in Canada. It operates in two segments, Retail and Financial Services. The Retail segment operates corporate and franchise-owned retail food, and associate-owned drug stores. This segment also includes in-store pharmacies, other health and beauty product stores, apparel stores, and other general merchandise stores. The Financial Services segment provides credit card and banking services, the PC Optimum program, insurance brokerage services, and telecommunication services. It also offers PC Healthapp, a health and wellness app that provides Canadians with access to healthcare resources and support. Loblaw Companies Limited provides its products and services under various brands. The company was founded in 1919 and is headquartered in Brampton, Canada. Loblaw Companies Limited is a subsidiary of George Weston Limited.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Brampton"
    },
    "LOCL.TO": {
        "short_name": "FRESHLOCAL SOLUTIONS INC",
        "long_name": "Freshlocal Solutions Inc.",
        "summary": "Freshlocal Solutions Inc. provides end-to-end grocery e-commerce solutions. The company operates Food-X Technologies, an end-to-end SaaS-based eGrocery Management Solution, which is designed to meet the needs of large and small grocery retailers. It also engages in the eGrocery business that delivers fresh, local, and organic produce and groceries. The company serves the urban markets in Alberta and British Columbia through its brick and mortar stores under the Blush Lane and Be Fresh name, as well as through FRESHLOCAL.ca, an online eGrocery platform. The company was founded in 1997 and is based in Burnaby, Canada.",
        "currency": "CAD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Burnaby"
    },
    "LVN.SG": {
        "short_name": "CP All PCL Reg. Shares (Foreign",
        "long_name": "CP ALL Public Company Limited",
        "summary": "CP ALL Public Company Limited, together with its subsidiaries, operates and franchises convenience stores under the 7-Eleven name to other retailers primarily in Thailand. It operates through three segments: Convenience Stores, Cash and Carry, and Other. The company is involved in the manufacture and sale of convenience and frozen foods, and bakery products; sale and maintenance of retail equipment; information technology, as well as marketing and advertising activities; provision of research and development services; and cash and carry and e-commerce business, as well as operates as a life and accident insurance broker. It also distributes commercial cards and tickets, catalog merchandises, and equipment for retailing and software development; and offers bill payment collection, information technology, logistics, smart purse cards, investment, educational institution, human resources development, and training and business seminar services, as well as healthcare and medical specialist's consultation services. As of December 31, 2019, CP ALL Public Company Limited operated 11,712 stores. The company was formerly known as C.P. Seven Eleven Public Company Limited and changed its name to CP ALL Public Company Limited in 2007. CP ALL Public Company Limited was founded in 1988 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "MCLS.L": {
        "short_name": "MCCOLL'S RETAIL GROUP PLC ORD G",
        "long_name": "McColl's Retail Group plc",
        "summary": "McColl's Retail Group plc operates as a neighbourhood retailer in the United Kingdom. The company operates convenience and newsagent stores that offer food and groceries, fruits and vegetables, ready meals, prepared food-to-go, tobacco, general merchandise, news and magazines, and services, as well as provides post office and ATM services. As of November 29, 2020, it operated 1,265 neighborhood stores, including 1,093 McColl's branded convenience stores and 172 Martin's branded newsagents stores. The company was founded in 1901 and is headquartered in Brentwood, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Brentwood"
    },
    "MGROS.IS": {
        "short_name": "MIGROS TICARET",
        "long_name": "Migros Ticaret A.S.",
        "summary": "Migros Ticaret A.S., together with its subsidiaries, engages in the retail sale of food and beverages, and consumer and durable goods. Its stores offer various products, including cosmetics, stationery, glass and kitchenware, electronic appliances, books, textiles, and other items, as well as groceries and other necessities. As of April 22, 2020, it had a total of 2233 stores with 2131 Migros and 59 Macrocenter in 81 provinces in Turkey and 43 Ramstore stores internationally covering an area 2.514.425 square meters. The company also operates Migros Sanal Market, an online food retailing site, as well as an online shopping website. In addition, it rents floor space in the shopping malls to other trading companies. Migros Ticaret A.S. was founded in 1954 and is headquartered in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "city": "Istanbul"
    },
    "MRU.TO": {
        "short_name": "METRO INC",
        "long_name": "Metro Inc.",
        "summary": "Metro Inc. operates as a retailer, franchisor, distributor, and manufacturer in the food and pharmaceutical sectors in Canada. It operates food stores, including supermarkets and discount stores that provide fresh and grocery products, baked goods, prepared foods, meats, general merchandise, non-perishable goods, dairy products, fruits and vegetables, frozen foods, bakery products, pastries, and deli products, as well as Mediterranean and Middle-Eastern products; and drug stores and pharmacies. As of January 27, 2021, the company operated a network of approximately 950 food stores under various banners, including Metro, Metro Plus, Super C, and Food Basics, as well as approximately 650 drugstores primarily under the Jean Coutu, Brunet, Metro Pharmacy, and Food Basics Pharmacy banners. It also manufactures generic drugs; and provides online grocery shopping services. The company serves restaurants, other chains, non-franchised drugstores, and various health centers, as well as consumers. Metro Inc. was founded in 1947 and is headquartered in MontrÃ©al, Canada.",
        "currency": "CAD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Montreal"
    },
    "MRW.L": {
        "short_name": "MORRISON (WM) SUPERMARKETS PLC ",
        "long_name": "Wm Morrison Supermarkets PLC",
        "summary": "Wm Morrison Supermarkets PLC operates retail supermarket stores under the Morrisons brand name in the United Kingdom. The company engages in the in-store and online grocery retailing activities. It also supplies eggs; manufactures and distributes fresh food, and morning goods and bread; prepares and supplies seafood; processes fresh meat; invests in, develops, and maintains properties; and offers insurance, leasing, technical testing and analysis, and property partnership services, as well as holds pharmaceutical license. The company operates through 492 supermarkets, 50 daily convenience stores, and 335 petrol filling stations. Wm Morrison Supermarkets PLC was founded in 1899 and is headquartered in Bradford, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Bradford"
    },
    "MRWSF": {
        "short_name": "MORRISON(WM.)SUPERMARKETS",
        "long_name": "Wm Morrison Supermarkets PLC",
        "summary": "Wm Morrison Supermarkets PLC operates retail supermarket stores under the Morrisons brand name in the United Kingdom. The company engages in the in-store and online grocery retailing activities. It also supplies eggs; manufactures and distributes fresh food, and morning goods and bread; prepares and supplies seafood; processes fresh meat; invests in, develops, and maintains properties; and offers insurance, leasing, technical testing and analysis, and property partnership services, as well as holds pharmaceutical license. The company operates through 492 supermarkets, 50 daily convenience stores, and 335 petrol filling stations. Wm Morrison Supermarkets PLC was founded in 1899 and is headquartered in Bradford, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Bradford"
    },
    "MRWSY": {
        "short_name": "MORRISON(WM.)SUPERMARKETS",
        "long_name": "Wm Morrison Supermarkets PLC",
        "summary": "Wm Morrison Supermarkets PLC operates retail supermarket stores under the Morrisons brand name in the United Kingdom. The company engages in the in-store and online grocery retailing activities. It also supplies eggs; manufactures and distributes fresh food, and morning goods and bread; prepares and supplies seafood; processes fresh meat; invests in, develops, and maintains properties; and offers insurance, leasing, technical testing and analysis, and property partnership services, as well as holds pharmaceutical license. The company operates through 492 supermarkets, 50 daily convenience stores, and 335 petrol filling stations. Wm Morrison Supermarkets PLC was founded in 1899 and is headquartered in Bradford, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Bradford"
    },
    "MTRAF": {
        "short_name": "METRO INC",
        "long_name": "Metro Inc.",
        "summary": "Metro Inc. operates as a retailer, franchisor, distributor, and manufacturer in the food and pharmaceutical sectors in Canada. It operates food stores, including supermarkets and discount stores that provide fresh and grocery products, baked goods, prepared foods, meats, general merchandise, non-perishable goods, dairy products, fruits and vegetables, frozen foods, bakery products, pastries, and deli products, as well as Mediterranean and Middle-Eastern products; and drug stores and pharmacies. As of January 27, 2021, the company operated a network of approximately 950 food stores under various banners, including Metro, Metro Plus, Super C, and Food Basics, as well as approximately 650 drugstores primarily under the Jean Coutu, Brunet, Metro Pharmacy, and Food Basics Pharmacy banners. It also manufactures generic drugs; and provides online grocery shopping services. The company serves restaurants, other chains, non-franchised drugstores, and various health centers, as well as consumers. Metro Inc. was founded in 1947 and is headquartered in MontrÃ©al, Canada.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Montreal"
    },
    "MTVX": {
        "short_name": "APT MOTO VOX GROUP INC",
        "long_name": "APT Moto Vox Group Inc",
        "summary": "APT Group, Inc. is a holding company, which through its subsidiaries manufactures and distributes recreational, utility, and power sports products. The company, through its subsidiaries, offers mini bikes, electric and dirt bikes, go-karts, scooters, portable generators, carburetors, and automotive engines. APT Group, Inc. was incorporated in 2012 and is based in Kansas City, Missouri.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Kansas City"
    },
    "MZP.F": {
        "short_name": "MORRISON SUPERMKTS LS-,10",
        "long_name": "Wm Morrison Supermarkets PLC",
        "summary": "Wm Morrison Supermarkets PLC operates retail supermarket stores under the Morrisons brand name in the United Kingdom. The company engages in the in-store and online grocery retailing activities. It also supplies eggs; manufactures and distributes fresh food, and morning goods and bread; prepares and supplies seafood; processes fresh meat; invests in, develops, and maintains properties; and offers insurance, leasing, technical testing and analysis, and property partnership services, as well as holds pharmaceutical license. The company operates through 492 supermarkets, 50 daily convenience stores, and 335 petrol filling stations. Wm Morrison Supermarkets PLC was founded in 1899 and is headquartered in Bradford, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Bradford"
    },
    "N2V.F": {
        "short_name": "NAT.GRO.BY VIT.COT.DL-001",
        "long_name": "Natural Grocers by Vitamin Cottage, Inc.",
        "summary": "Natural Grocers by Vitamin Cottage, Inc., together with its subsidiaries, retails natural and organic groceries, and dietary supplements in the United States. The company's stores offer natural and organic grocery products, such as organic produce; bulk food products; private label products comprising pasta, pasta sauce, ketchup, canned beans and vegetables, frozen vegetables, frozen fruits, bread, plant based butter, olive and coconut oil, coconut milk, honey, maple syrup, preserves, chocolate, coffee, bacon, beef jerky, canned seafood, popcorn, tortilla chips, taco shells, eggs, cheese, apple sauce, apple cider vinegar, spring water, paper products, cleaning products, and other products; dry, frozen, and canned groceries; meat and seafood products; dairy products, dairy substitutes, and eggs; prepared foods; bread and baked products; beverages; and beer, wine, and hard cider products. Its stores also provide private label dietary supplements; body care products consisting of cosmetics, skin care, hair care, fragrance, and personal care products containing natural and organic ingredients; pet care and food products; books and handouts; and household and general merchandise, including cleaning supplies, paper products, and dish and laundry soaps, as well as other common household products, such as diapers. The company operates its retail stores under the Natural Grocers by Vitamin Cottage trademark. As of December 03, 2020, it operated 160 stores in 20 states. The company also offers science-based nutrition education programs to help customers make informed health and nutrition choices. Natural Grocers by Vitamin Cottage, Inc. was founded in 1955 and is headquartered in Lakewood, Colorado.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Lakewood"
    },
    "NGVC": {
        "short_name": "Natural Grocers by Vitamin Cott",
        "long_name": "Natural Grocers by Vitamin Cottage, Inc.",
        "summary": "Natural Grocers by Vitamin Cottage, Inc., together with its subsidiaries, retails natural and organic groceries, and dietary supplements in the United States. The company's stores offer natural and organic grocery products, such as organic produce; bulk food products; private label products comprising pasta, pasta sauce, ketchup, canned beans and vegetables, frozen vegetables, frozen fruits, bread, plant based butter, olive and coconut oil, coconut milk, honey, maple syrup, preserves, chocolate, coffee, bacon, beef jerky, canned seafood, popcorn, tortilla chips, taco shells, eggs, cheese, apple sauce, apple cider vinegar, spring water, paper products, cleaning products, and other products; dry, frozen, and canned groceries; meat and seafood products; dairy products, dairy substitutes, and eggs; prepared foods; bread and baked products; beverages; and beer, wine, and hard cider products. Its stores also provide private label dietary supplements; body care products consisting of cosmetics, skin care, hair care, fragrance, and personal care products containing natural and organic ingredients; pet care and food products; books and handouts; and household and general merchandise, including cleaning supplies, paper products, and dish and laundry soaps, as well as other common household products, such as diapers. The company operates its retail stores under the Natural Grocers by Vitamin Cottage trademark. As of December 03, 2020, it operated 160 stores in 20 states. The company also offers science-based nutrition education programs to help customers make informed health and nutrition choices. Natural Grocers by Vitamin Cottage, Inc. was founded in 1955 and is headquartered in Lakewood, Colorado.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Lakewood"
    },
    "NWC.TO": {
        "short_name": "THE NORTH WEST COMPANY INC",
        "long_name": "The North West Company Inc.",
        "summary": "The North West Company Inc., through its subsidiaries, engages in the retail of food and everyday products and services to rural communities and urban neighborhood markets in Canada, Alaska, the South Pacific, and the Caribbean. The company's Canadian operations comprise 118 Northern stores, which offers food, financial services, and general merchandise; 5 NorthMart stores that provides fresh foods, apparel, and health products and services; 25 Quickstop convenience stores that provides ready-to-eat foods, and fuel and related services; 5 Giant Tiger junior discount stores, which offers family fashion, household products, and food; 2 Valu Lots discount center and direct-to-customer food distribution outlet; 2 Pharmacy and Convenience stores; 1 Solo Market store for rural market; and 1 North West Company motorsports dealership offering sales, service, parts and accessories for Ski-doo, Honda, Can-am and other premier brands. The Canadian operations also provides contract tele-pharmacist services to rural hospitals and health centers; water and air-based transportation services; and produce and fresh meats to independent grocery stores. Its International operations include 27 Alaska Commercial Company stores that provides food and general merchandise to remote and rural regions; 12 Cost-U-Less mid-size warehouse stores, which offers discount food and general merchandise; 5 Quickstop convenience stores; 8 Riteway food markets; and 1 Cash and Carry store. The North West Company Inc. was founded in 1668 and is headquartered in Winnipeg, Canada.",
        "currency": "CAD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Winnipeg"
    },
    "OCDDY": {
        "short_name": "OCADO GROUP PLC",
        "long_name": "Ocado Group plc",
        "summary": "Ocado Group plc operates as an online grocery retailer in the United Kingdom and internationally. The company operates through three segments: Ocado Retail, UK Solutions & Logistics, and International Solutions. It also sells general merchandise products on its Ocado.com; provides online retail solutions; and offers customer fulfillment centre and logistics services. The company was founded in 2000 and is headquartered in Hatfield, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Hatfield"
    },
    "OCDGF": {
        "short_name": "OCADO GROUP PLC",
        "long_name": "Ocado Group plc",
        "summary": "Ocado Group plc operates as an online grocery retailer in the United Kingdom and internationally. The company operates through three segments: Ocado Retail, UK Solutions & Logistics, and International Solutions. It also sells general merchandise products on its Ocado.com; provides online retail solutions; and offers customer fulfillment centre and logistics services. The company was founded in 2000 and is headquartered in Hatfield, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Hatfield"
    },
    "OCDO.L": {
        "short_name": "OCADO GROUP PLC ORD 2P",
        "long_name": "Ocado Group plc",
        "summary": "Ocado Group plc operates as an online grocery retailer in the United Kingdom and internationally. The company operates through three segments: Ocado Retail, UK Solutions & Logistics, and International Solutions. It also sells general merchandise products on its Ocado.com; provides online retail solutions; and offers customer fulfillment centre and logistics services. The company was founded in 2000 and is headquartered in Hatfield, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Hatfield"
    },
    "OCDON.MX": {
        "short_name": "OCADO GROUP PLC",
        "long_name": "Ocado Group plc",
        "summary": "Ocado Group plc operates as an online grocery retailer in the United Kingdom and internationally. The company operates through three segments: Ocado Retail, UK Solutions & Logistics, and International Solutions. It also sells general merchandise products on its Ocado.com; provides online retail solutions; and offers customer fulfillment centre and logistics services. The company was founded in 2000 and is headquartered in Hatfield, the United Kingdom.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Grocery Stores",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "city": "Hatfield"
    },
    "OG.V": {
        "short_name": "ORGANIC GARAGE LTD",
        "long_name": "Organic Garage Ltd.",
        "summary": "Organic Garage Ltd. owns and operates grocery stores that sell natural and organic products to consumers in Canada. The company offers produce, dairy, bakery, bulk, grocery, meat, frozen, and prepared foods; and health and beauty products, as well as vitamins and supplements. It operates five stores in the Greater Toronto Area. The company was founded in 2005 and is headquartered in Oakville, Canada.",
        "currency": "CAD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Oakville"
    },
    "OGGFF": {
        "short_name": "ORGANIC GARAGE LTD",
        "long_name": "Organic Garage Ltd.",
        "summary": "Organic Garage Ltd. owns and operates grocery stores that sell natural and organic products to consumers in Canada. The company offers produce, dairy, bakery, bulk, grocery, meat, frozen, and prepared foods; and health and beauty products, as well as vitamins and supplements. It operates four stores in the Greater Toronto Area. The company was founded in 2005 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "OKEY.ME": {
        "short_name": "O'KEY GROUP SA",
        "long_name": "O'Key Group S.A.",
        "summary": "O'Key Group S.A., together with its subsidiaries, operates a retail chain in Russia. It primarily operates hypermarkets and supermarkets under the O'KEY brand name; and discounter stores under Da! brand name. As of April 18, 2019, the company operated 162 stores, including 78 hypermarkets and 84 discounters in Russia. It is also involved in real estate business; and supply of food, non-food, and private-label products. The company was formerly known as Dorinda Holding S.A. and changed its name to O'KEY Group S.A. in June 2010. O'Key Group S.A. was founded in 2001 and is based in Luxembourg City, Luxembourg.",
        "currency": "RUB",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Luxembourg",
        "city": "Luxembourg City"
    },
    "OV8.SI": {
        "short_name": "Sheng Siong",
        "long_name": "Sheng Siong Group Ltd",
        "summary": "Sheng Siong Group Ltd, an investment holding company, operates supermarket retail stores in Singapore. The company's stores offer an assortment of live, fresh, and chilled produce, such as seafood, meat, and vegetables; and packaged, processed, frozen, and/or preserved food products, as well as general merchandise, including toiletries and essential household products. It is also involved in general trading, and wholesale import and export businesses. In addition, the company operates allforyou.sg, an online shopping platform for groceries. It operates 64 stores in Singapore; and two stores in Kunming, China under the Sheng Siong brand name. Sheng Siong Group Ltd. was founded in 1985 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "PJP.F": {
        "short_name": "X 5 RET. G.SP.GDR REGS1/4",
        "long_name": "X5 Retail Group N.V.",
        "summary": "X5 Retail Group N.V. operates as a food retailer in Russia. As of December 31, 2020, the company had 17,707 company-operated stores, including 16,709 Pyaterochka proximity stores, 933 Perekrestok supermarkets, 56 Karusel hypermarkets, 4 Chizhik hard discounters, and 5 Perekrestok Vprok dark stores. It also engages in wholesale operations and online retail business, as well as providing franchise and other services. The company was founded in 1975 and is headquartered in Amsterdam, the Netherlands.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Netherlands",
        "city": "Amsterdam"
    },
    "QKLS": {
        "short_name": "QKL STORES INC",
        "long_name": "QKL Stores Inc.",
        "summary": "QKL Stores Inc., together with its subsidiaries, operates supermarket chains in northeastern China and Inner Mongolia. Its supermarkets and hypermarkets sell grocery items, such as instant foods, canned foods, packaged rice and wheat powder, crackers and chips, rice and ground wheat, bottled water and beverages, and cigarettes, as well as non-food items, including cleaning products, cosmetics, and disposable razors. The company also sells fresh-food items comprising raw meat, cooked meats, seafood, noodles and pastas, milk, yogurt, eggs, and packaged dumplings, as well as bakery items comprising breads, buns, and other self-prepared foods. In addition, it offers other non-food items, such as clothing and shoes, books and stationery, bedding and home furnishings, office supplies, toys, sporting goods, and other items, as well as electronics and household use items, such as irons, electric shavers, hair dryers, and massage machines. Further, the company operates department stores that sell brand-name and luxury clothing and accessories, cosmetics, small electronics, jewelry, books, home furnishings, and bedding, as well as have a movie theater and a traditional beauty salon. As of December 31, 2015, the company operated 25 supermarkets, 16 hypermarkets, and 4 department stores. QKL Stores Inc. is headquartered in Daqing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Daqing"
    },
    "QSS.SG": {
        "short_name": "Sheng Siong Group Ltd Registere",
        "long_name": "Sheng Siong Group Ltd",
        "summary": "Sheng Siong Group Ltd, an investment holding company, operates supermarket retail stores in Singapore. The company's stores offer an assortment of live, fresh, and chilled produce, such as seafood, meat, and vegetables; and packaged, processed, frozen, and/or preserved food products, as well as general merchandise, including toiletries and essential household products. It is also involved in general trading, and wholesale import and export businesses. In addition, the company operates allforyou.sg, an online shopping platform for groceries. It operates 64 stores in Singapore; and two stores in Kunming, China under the Sheng Siong brand name. Sheng Siong Group Ltd. was founded in 1985 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "RAL.PA": {
        "short_name": "RALLYE",
        "long_name": "Rallye SA",
        "summary": "Rallye SA, together with its subsidiaries, engages in the food, non-food e-commerce, and sporting goods retailing business in France and internationally. The company operates in two segments, Food and General Retailing, and Holdings and Other Activities. It operates hypermarkets, supermarkets, and convenience stores. The company conducts its retailing activities in France primarily under the Casino, Monoprix, Franprix, and VindÃ©mia banners; food retail activities in Latin America mainly under the GPA food banners, and Ã\u0089xito, Disco, Devoto, and Libertad banners; and e-commerce comprising Cdiscount and the Cnova N.V. holding company businesses. It is also involved in financial investment, real estate asset management, property development projects, and energy efficiency activities; and operation of e-commerce sites and self-service restaurants. The company was founded in 1925 and is headquartered in Paris, France. Rallye SA is a subsidiary of Fonciere Euris SA.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Paris"
    },
    "RANC.JK": {
        "short_name": "Supra Boga Lestari Tbk.",
        "long_name": "PT Supra Boga Lestari Tbk",
        "summary": "PT Supra Boga Lestari Tbk operates supermarkets in Indonesia. Its supermarkets offer meat, poultry, seafood, fruits, and vegetables, as well as other specialty products. The company operates its supermarket under the Ranch Market and Farmers Market names. It operates 48 stores consisting of 16 Ranch Markets, 29 Farmers Markets, 1 The Gourmet by Ranch Market, and 2 Day2Day by Farmers Market located in various cities in Jakarta, Jabodetabek, Surabaya, Malang, Balikpapan, Samarinda, Pekanbaru, Ambon, Dumai, and Palembang. The company was founded in 1997 and is based in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "West Jakarta"
    },
    "RAY.F": {
        "short_name": "RALLYE SA INH.  EO 3",
        "long_name": "Rallye SA",
        "summary": "Rallye SA, together with its subsidiaries, engages in the food, non-food e-commerce, and sporting goods retailing business in France and internationally. The company operates in two segments, Food and General Retailing, and Holdings and Other Activities. It operates hypermarkets, supermarkets, and convenience stores. The company conducts its retailing activities in France primarily under the Casino, Monoprix, Franprix, and VindÃ©mia banners; food retail activities in Latin America mainly under the GPA food banners, and Ã\u0089xito, Disco, Devoto, and Libertad banners; and e-commerce comprising Cdiscount and the Cnova N.V. holding company businesses. It is also involved in financial investment, real estate asset management, property development projects, and energy efficiency activities; and operation of e-commerce sites and self-service restaurants. The company was founded in 1925 and is headquartered in Paris, France. Rallye SA is a subsidiary of Fonciere Euris SA.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "city": "Paris"
    },
    "RMLI.TA": {
        "short_name": "RAMI LEVI CHAIN",
        "long_name": "Rami Levi Chain Stores Hashikma Marketing 2006 Ltd",
        "summary": "Rami Levi Chain Stores Hashikma Marketing 2006 Ltd operates a chain of retail stores with a format of discount network in Israel. Its stores offer breads and pastries, fruits and vegetables, milk, eggs, salads fish meats, pulses and cereals, snacks and sweets, drinks, and disposables, as well as organic and health, frozen, canning, cooking and baking, home and animal maintenance, skin and babies care, clothing, and electrical and electronic products. The company was founded in 1976 and is based in Jerusalem, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Jerusalem"
    },
    "S6M.F": {
        "short_name": "SEVEN + I HLDGS CO. LTD",
        "long_name": "Seven & i Holdings Co., Ltd.",
        "summary": "Seven & i Holdings Co., Ltd. engages in retail, food, financial, and IT businesses in Japan, North America, and internationally. It operates through seven segments: Domestic Convenience Store operations, Overseas Convenience Store Operations, Superstore Operations, Department Store Operations, Financial Services, Specialty Stores Operations, and Others. The company's Domestic Convenience Store Operations segment operates convenience stores comprising directly managed corporate stores and franchised stores. Its Overseas Convenience Store Operations segment engages in convenience store operation and gasoline retail businesses. The company's Superstore Operations segment operates retail business that provide daily life necessities, such as food and other daily necessities. Its Department Store Operations operates department stores that provide various merchandise products. The company's Financial Services segment offers banking, leasing, and credit card services. Its Specialty Store Operations segment operates specialty retail stores. The company's others segment engages in real estate and other businesses. It operates approximately 22,500 stores in Japan and 71,800 stores internationally. The company was incorporated in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "S6MA.F": {
        "short_name": "SEVEN+I HLDGS UNSP.ADR1/2",
        "long_name": "Seven & i Holdings Co., Ltd.",
        "summary": "Seven & i Holdings Co., Ltd. engages in retail, food, financial, and IT businesses in Japan, North America, and internationally. It operates through seven segments: Domestic Convenience Store operations, Overseas Convenience Store Operations, Superstore Operations, Department Store Operations, Financial Services, Specialty Stores Operations, and Others. The company's Domestic Convenience Store Operations segment operates convenience stores comprising directly managed corporate stores and franchised stores. Its Overseas Convenience Store Operations segment engages in convenience store operation and gasoline retail businesses. The company's Superstore Operations segment operates retail business that provide daily life necessities, such as food and other daily necessities. Its Department Store Operations operates department stores that provide various merchandise products. The company's Financial Services segment offers banking, leasing, and credit card services. Its Specialty Store Operations segment operates specialty retail stores. The company's others segment engages in real estate and other businesses. It operates approximately 22,500 stores in Japan and 71,800 stores internationally. The company was incorporated in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "SAE.TA": {
        "short_name": "SHUFERSAL LTD",
        "long_name": "Shufersal Ltd.",
        "summary": "Shufersal Ltd. operates a chain of supermarkets under the Shufersal brand name in Israel. It operates through three segments: Retail, Real Estate, and Credit Card Customer Club Management. The company's stores provides vegetables, fruits, grains, legumes, dairy products, and other products; and general grocery and food products, toiletries and home care, pharma and cosmetic products, baked goods, beverages, frozen and chilled products, and meat and fish products. It also operates an online shopping website that offers home and garden furniture, electrical and kitchen appliances, textile and home design products, travel and leisure products, and food products. In addition, the company provides credit cards and customer club services. Further, it is also involved in the real estate business; and logistic activities. The company was founded in 1958 and is based in Rishon LeZion, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Rishon LeZion"
    },
    "SBRY.L": {
        "short_name": "SAINSBURY (J) PLC ORD 28 4/7P",
        "long_name": "J Sainsbury plc",
        "summary": "J Sainsbury plc, together with its subsidiaries, engages in the food, general merchandise and clothing retailing, and financial services activities in the United Kingdom. It operates through three segments: Retail Â\u0096 Food, Retail Â\u0096 General Merchandise and Clothing, and Financial Services. The company operates various store formats, including convenience stores and supermarkets. It is also involved in online grocery and general merchandise operations. As of March 7, 2020, the company operated 882 Argos stores and 281 collection points, as well as 16 Habitat stores. In addition, the company offers financial services, such as credit cards, and travel money and personal loans, as well as home, car, pet, and life insurance. J Sainsbury plc was founded in 1869 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "SBRYN.MX": {
        "short_name": "SAINSBURY(J)",
        "long_name": "J Sainsbury plc",
        "summary": "J Sainsbury plc, together with its subsidiaries, engages in the food, general merchandise and clothing retailing, and financial services activities in the United Kingdom. It operates through three segments: Retail Â\u0096 Food, Retail Â\u0096 General Merchandise and Clothing, and Financial Services. The company operates various store formats, including convenience stores and supermarkets. It is also involved in online grocery and general merchandise operations. As of March 7, 2020, the company operated 882 Argos stores and 281 collection points, as well as 16 Habitat stores. In addition, the company offers financial services, such as credit cards, and travel money and personal loans, as well as home, car, pet, and life insurance. J Sainsbury plc was founded in 1869 and is headquartered in London, the United Kingdom.",
        "currency": "MXN",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "SFM": {
        "short_name": "Sprouts Farmers Market, Inc.",
        "long_name": "Sprouts Farmers Market, Inc.",
        "summary": "Sprouts Farmers Market, Inc. offers fresh, natural, and organic food products in the United States. It operates through Healthy Grocery Stores segment. The company offers perishable product categories, including fresh produce, meat, seafood, deli, bakery, floral and dairy, and dairy alternatives; and non-perishable product categories, such as grocery, vitamins and supplements, bulk items, frozen foods, beer and wine, and natural health and body care. As of January 03, 2021, it operated 362 stores in 23 states. Sprouts Farmers Market, Inc. was founded in 2002 and is headquartered in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Phoenix"
    },
    "SLIGR.AS": {
        "short_name": "SLIGRO FOOD GROUP",
        "long_name": "Sligro Food Group N.V.",
        "summary": "Sligro Food Group N.V. engages in the foodservice businesses in the Netherlands and Belgium. The company offers a range of food and food-related non-food products; and services in the food and beverages wholesale market. It operates a network of 51 cash-and-carry and 9 delivery service sites to serve hospitality industry, leisure facilities, caterers, large-volume users, company restaurants, petrol stations, small and medium-sized enterprises, small retail businesses, and the institutional markets under the Sligro, De Kweker, and Van Hoeckel brand names in the Netherlands. It also serves institutional, corporate catering, and hotel chain segments under the JAVA Foodservice name through one delivery service site; and hospitality industry, culinary professionals, wholesale customers, and small and medium-sized enterprises under the Silgro-ISPC name through a network of two cash-and-carry and delivery service sites, as well as operates one delivery service with pick-up option under the Sligro-ISPC name in Belgium. In addition, the company is involved in the production of convenience and fresh fish products; sourcing of meat, game and poultry, fruits and vegetables, and bread and pastries; advertising, design, delivery, fitting out, and maintenance of professional kitchen layouts, equipment, and cooling and freezing technologies; and provision of online gift concepts and Christmas gifts, and traditional Christmas hampers. It also offers its products through online platform. Sligro Food Group N.V. was founded in 1935 and is headquartered in Veghel, the Netherlands.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "AMS",
        "market": "nl_market",
        "country": "Netherlands",
        "city": "Veghel"
    },
    "SMMR": {
        "short_name": "SYMMETRY TECHNOLOGIES INC",
        "long_name": "Symmetry Technologies Inc.",
        "summary": "Symmetry Technologies Inc. develops data center, infrastructure, and network solutions. It provides managed information technology (IT) services, including maintenance plans that include planned service for network, reducing possibilities for unplanned outages; and networking services comprising professional implementation services for network projects. The company is based in Coral Gables, Florida.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Coral Gables"
    },
    "SUY1.F": {
        "short_name": "SAINSBURY-J.- LS-28571428",
        "long_name": "J Sainsbury plc",
        "summary": "J Sainsbury plc, together with its subsidiaries, engages in the food, general merchandise and clothing retailing, and financial services activities in the United Kingdom. It operates through three segments: Retail Â\u0096 Food, Retail Â\u0096 General Merchandise and Clothing, and Financial Services. The company operates various store formats, including convenience stores and supermarkets. It is also involved in online grocery and general merchandise operations. As of March 7, 2020, the company operated 882 Argos stores and 281 collection points, as well as 16 Habitat stores. In addition, the company offers financial services, such as credit cards, and travel money and personal loans, as well as home, car, pet, and life insurance. J Sainsbury plc was founded in 1869 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "SVNDF": {
        "short_name": "SEVEN & I HOLDINGS CO LTD",
        "long_name": "Seven & i Holdings Co., Ltd.",
        "summary": "Seven & i Holdings Co., Ltd. engages in retail, food, financial, and IT businesses in Japan, North America, and internationally. It operates through seven segments: Domestic Convenience Store operations, Overseas Convenience Store Operations, Superstore Operations, Department Store Operations, Financial Services, Specialty Stores Operations, and Others. The company's Domestic Convenience Store Operations segment operates convenience stores comprising directly managed corporate stores and franchised stores. Its Overseas Convenience Store Operations segment engages in convenience store operation and gasoline retail businesses. The company's Superstore Operations segment operates retail business that provide daily life necessities, such as food and other daily necessities. Its Department Store Operations operates department stores that provide various merchandise products. The company's Financial Services segment offers banking, leasing, and credit card services. Its Specialty Store Operations segment operates specialty retail stores. The company's others segment engages in real estate and other businesses. It operates approximately 22,500 stores in Japan and 71,800 stores internationally. The company was incorporated in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "SVNDY": {
        "short_name": "SEVEN & I HOLDINGS CO LTD",
        "long_name": "Seven & i Holdings Co., Ltd.",
        "summary": "Seven & i Holdings Co., Ltd. engages in retail, food, financial, and IT businesses in Japan, North America, and internationally. It operates through seven segments: Domestic Convenience Store operations, Overseas Convenience Store Operations, Superstore Operations, Department Store Operations, Financial Services, Specialty Stores Operations, and Others. The company's Domestic Convenience Store Operations segment operates convenience stores comprising directly managed corporate stores and franchised stores. Its Overseas Convenience Store Operations segment engages in convenience store operation and gasoline retail businesses. The company's Superstore Operations segment operates retail business that provide daily life necessities, such as food and other daily necessities. Its Department Store Operations operates department stores that provide various merchandise products. The company's Financial Services segment offers banking, leasing, and credit card services. Its Specialty Store Operations segment operates specialty retail stores. The company's others segment engages in real estate and other businesses. It operates approximately 22,500 stores in Japan and 71,800 stores internationally. The company was incorporated in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "TCO0.F": {
        "short_name": "TESCO PLC  LS-,0633333",
        "long_name": "Tesco PLC",
        "summary": "Tesco PLC, together with its subsidiaries, operates as a grocery retailer. The company operates through convenience and hypermarket store formats, as well as engages in the wholesale business. It also provides retail banking and insurance services. The company operates in the United Kingdom, the Republic of Ireland, the Czech Republic, Hungary, Poland, Slovakia, Malaysia, and Thailand. The company serves its customers through stores, as well as online. Tesco PLC was founded in 1919 and is headquartered in Welwyn Garden City, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Welwyn Garden City"
    },
    "TCO2.F": {
        "short_name": "TESCO PLC ADR/1 LS-,05",
        "long_name": "Tesco PLC",
        "summary": "Tesco PLC, together with its subsidiaries, operates as a grocery retailer. The company operates through convenience and hypermarket store formats, as well as engages in the wholesale business. It also provides retail banking and insurance services. The company operates in the United Kingdom, the Republic of Ireland, the Czech Republic, Hungary, Poland, Slovakia, Malaysia, and Thailand. The company serves its customers through stores, as well as online. Tesco PLC was founded in 1919 and is headquartered in Welwyn Garden City, the United Kingdom.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Welwyn Garden City"
    },
    "TNP-R.BK": {
        "short_name": "THANAPIRIYA PUBLIC COMPANY LIMI",
        "long_name": "Thanapiriya Public Company Limited",
        "summary": "Thanapiriya Public Company Limited, together with its subsidiaries, operates wholesale and retail superstores in Thailand. It owns 32 superstores and 2 distribution centers. Thanapiriya Public Company Limited founded in 1965 and is headquartered in Mueang Chiang Rai, Thailand.",
        "currency": "THB",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Mueang Chiang Rai"
    },
    "TNP.BK": {
        "short_name": "THANAPIRIYA PUBLIC COMPANY LIMI",
        "long_name": "Thanapiriya Public Company Limited",
        "summary": "Thanapiriya Public Company Limited, together with its subsidiaries, operates wholesale and retail superstores in Thailand. It owns 32 superstores and 2 distribution centers. Thanapiriya Public Company Limited founded in 1965 and is headquartered in Mueang Chiang Rai, Thailand.",
        "currency": "THB",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Mueang Chiang Rai"
    },
    "TSCDF": {
        "short_name": "TESCO",
        "long_name": "Tesco PLC",
        "summary": "Tesco PLC, together with its subsidiaries, operates as a grocery retailer. The company operates through convenience and hypermarket store formats, as well as engages in the wholesale business. It also provides retail banking and insurance services. The company operates in the United Kingdom, the Republic of Ireland, the Czech Republic, Hungary, Poland, Slovakia, Malaysia, and Thailand. The company serves its customers through stores, as well as online. Tesco PLC was founded in 1919 and is headquartered in Welwyn Garden City, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Welwyn Garden City"
    },
    "TSCDY": {
        "short_name": "TESCO SPON ADR ECH REP 3 ORD (P",
        "long_name": "Tesco PLC",
        "summary": "Tesco PLC, together with its subsidiaries, operates as a grocery retailer. The company operates through convenience and hypermarket store formats, as well as engages in the wholesale business. It also provides retail banking and insurance services. The company operates in the United Kingdom, the Republic of Ireland, the Czech Republic, Hungary, Poland, Slovakia, Malaysia, and Thailand. The company serves its customers through stores, as well as online. Tesco PLC was founded in 1919 and is headquartered in Welwyn Garden City, the United Kingdom.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Welwyn Garden City"
    },
    "TSCO.L": {
        "short_name": "TESCO PLC ORD 6 1/3P",
        "long_name": "Tesco PLC",
        "summary": "Tesco PLC, together with its subsidiaries, operates as a grocery retailer. The company operates through convenience and hypermarket store formats, as well as engages in the wholesale business. It also provides retail banking and insurance services. The company operates in the United Kingdom, the Republic of Ireland, the Czech Republic, Hungary, Poland, Slovakia, Malaysia, and Thailand. The company serves its customers through stores, as well as online. Tesco PLC was founded in 1919 and is headquartered in Welwyn Garden City, the United Kingdom.",
        "currency": "GBp",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Welwyn Garden City"
    },
    "TSCON.MX": {
        "short_name": "TESCO",
        "long_name": "Tesco PLC",
        "summary": "Tesco PLC, together with its subsidiaries, operates as a grocery retailer. The company operates through convenience and hypermarket store formats, as well as engages in the wholesale business. It also provides retail banking and insurance services. The company operates in the United Kingdom, the Republic of Ireland, the Czech Republic, Hungary, Poland, Slovakia, Malaysia, and Thailand. The company serves its customers through stores, as well as online. Tesco PLC was founded in 1919 and is headquartered in Welwyn Garden City, the United Kingdom.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Grocery Stores",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "city": "Welwyn Garden City"
    },
    "VILN.SW": {
        "short_name": "VILLARS N",
        "long_name": "Villars Holding S.A.",
        "summary": "Villars Holding S.A. engages in the retail, catering, and real estate businesses in Switzerland. The company operates coffee bars and restaurants under the Pause-CafÃ© and Xpresso-CafÃ© brands. It also operates Le Sous-Sol, a cafÃ©, bar, and restaurant; and Le Centre, a bar and restaurant. In addition, the company operates bakeries under the Suard name; and gas stations with convenience shops and kiosks under the Restoshop name. Further, it is involved in the management of commercial buildings, apartments, and parking spaces, as well as motorway refueling complexes. The company was founded in 1970 and is headquartered in Givisiez, Switzerland.",
        "currency": "CHF",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Givisiez"
    },
    "VLGEA": {
        "short_name": "Village Super Market, Inc.",
        "long_name": "Village Super Market, Inc.",
        "summary": "Village Super Market, Inc. operates a chain of supermarkets in the United States. Its stores feature specialty departments, such as an on-site bakery, an expanded delicatessen, various natural and organic foods, ethnic and international foods, prepared foods, and pharmacies. The company operates a chain of 30 ShopRite supermarkets, 5 Fairway Markets, and 3 Gourmet Garage specialty markets located in New Jersey, New York, Pennsylvania, and Maryland. Village Super Market, Inc. was founded in 1937 and is based in Springfield, New Jersey.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Springfield"
    },
    "VSU.F": {
        "short_name": "VILLAGE SUPER MARKET, INC",
        "long_name": "Village Super Market, Inc.",
        "summary": "Village Super Market, Inc. operates a chain of supermarkets in the United States. Its stores feature specialty departments, such as an on-site bakery, an expanded delicatessen, various natural and organic foods, ethnic and international foods, prepared foods, and pharmacies. The company operates a chain of 30 ShopRite supermarkets, 5 Fairway Markets, and 3 Gourmet Garage specialty markets located in New Jersey, New York, Pennsylvania, and Maryland. Village Super Market, Inc. was founded in 1937 and is based in Springfield, New Jersey.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Springfield"
    },
    "WMK": {
        "short_name": "Weis Markets, Inc.",
        "long_name": "Weis Markets, Inc.",
        "summary": "Weis Markets, Inc. engages in the retail sale of food in Pennsylvania and surrounding states. The company's retail food stores sell groceries, dairy products, frozen foods, meats, seafood, fresh produce, floral, pharmacy services, deli products, prepared foods, bakery products, beer and wine, and fuel; and general merchandise items, such as health and beauty care, and household products. It operates stores primarily under the Weis Markets trade name, as well as trademarks for its product lines and promotions, such as Weis, Weis 2 Go, Weis Great Meals Start Here, Weis Gas-n-Go, and Weis Nutri-Facts. As of December 31, 2020, the company owned and operated 197 retail food stores including 4 stores in Delaware, 49 stores in Maryland, 6 stores in New Jersey, 9 stores in New York, 117 stores in Pennsylvania, 9 stores in Virginia, and 2 stores in West Virginia. Weis Markets, Inc. was founded in 1912 and is based in Sunbury, Pennsylvania.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Sunbury"
    },
    "WN-PA.TO": {
        "short_name": "GEORGE WESTON LIMITED PR SERIES",
        "long_name": "George Weston Limited",
        "summary": "George Weston Limited provides food and drug retailing, and financial services in Canada and internationally. The company operates through three segments: Loblaw Companies Limited (Loblaw), Choice Properties Real Estate Investment Trust (Choice Properties), and Weston Foods. The Loblaw segment provides grocery, pharmacy, health and beauty, apparel, general merchandise, and financial services. It operates retail drug stores under the Shoppers Drug Mart. This segment also provides credit card services, insurance brokerage services, guaranteed investment certificates, and wireless mobile products and services; and operates merchandisers, warehouse clubs, e-commerce retailers and businesses, mail order prescription drug distributors, limited assortment stores, discount stores, convenience stores, and specialty stores. The Choice Properties segment owns, develops, and manages commercial, retail, industrial, office, and residential properties consisting of 731 properties. The Weston Foods segment produces fresh, frozen, and specialty bakery products, such as bread, rolls, cupcakes, donuts, cookies, cakes, pies, cones and wafers, artisan baked goods, and other products through national and regional supermarkets, wholesale and club stores, dollar stores, convenience store chains, food service distributors, and outlets, as well as other food retailing customers. This segment also supplies control brand products to retailers and distributors; ice cream cones and sandwich wafers to manufacturers in the frozen novelty category; and Girl Scout cookies. It provides products under the Wonder, Gadoua, Weston, Rubschlager, ACE Bakery, Casa Mendosa, Country Harvest, All but Gluten, and D'Italiano brands. The company was founded in 1882 and is headquartered in Toronto, Canada. George Weston Limited is a subsidiary of Wittington Investments, Limited.",
        "currency": "CAD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "WN-PC.TO": {
        "short_name": "GEORGE WESTON LIMITED PREF SER ",
        "long_name": "George Weston Limited",
        "summary": "George Weston Limited provides food and drug retailing, and financial services in Canada and internationally. The company operates through three segments: Loblaw Companies Limited (Loblaw), Choice Properties Real Estate Investment Trust (Choice Properties), and Weston Foods. The Loblaw segment provides grocery, pharmacy, health and beauty, apparel, general merchandise, and financial services. It operates retail drug stores under the Shoppers Drug Mart. This segment also provides credit card services, insurance brokerage services, guaranteed investment certificates, and wireless mobile products and services; and operates merchandisers, warehouse clubs, e-commerce retailers and businesses, mail order prescription drug distributors, limited assortment stores, discount stores, convenience stores, and specialty stores. The Choice Properties segment owns, develops, and manages commercial, retail, industrial, office, and residential properties consisting of 731 properties. The Weston Foods segment produces fresh, frozen, and specialty bakery products, such as bread, rolls, cupcakes, donuts, cookies, cakes, pies, cones and wafers, artisan baked goods, and other products through national and regional supermarkets, wholesale and club stores, dollar stores, convenience store chains, food service distributors, and outlets, as well as other food retailing customers. This segment also supplies control brand products to retailers and distributors; ice cream cones and sandwich wafers to manufacturers in the frozen novelty category; and Girl Scout cookies. It provides products under the Wonder, Gadoua, Weston, Rubschlager, ACE Bakery, Casa Mendosa, Country Harvest, All but Gluten, and D'Italiano brands. The company was founded in 1882 and is headquartered in Toronto, Canada. George Weston Limited is a subsidiary of Wittington Investments, Limited.",
        "currency": "CAD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "WN-PD.TO": {
        "short_name": "GEORGE WESTON LIMITED PREF SER ",
        "long_name": "George Weston Limited",
        "summary": "George Weston Limited provides food and drug retailing, and financial services in Canada and internationally. The company operates through three segments: Loblaw Companies Limited (Loblaw), Choice Properties Real Estate Investment Trust (Choice Properties), and Weston Foods. The Loblaw segment provides grocery, pharmacy, health and beauty, apparel, general merchandise, and financial services. It operates retail drug stores under the Shoppers Drug Mart. This segment also provides credit card services, insurance brokerage services, guaranteed investment certificates, and wireless mobile products and services; and operates merchandisers, warehouse clubs, e-commerce retailers and businesses, mail order prescription drug distributors, limited assortment stores, discount stores, convenience stores, and specialty stores. The Choice Properties segment owns, develops, and manages commercial, retail, industrial, office, and residential properties consisting of 731 properties. The Weston Foods segment produces fresh, frozen, and specialty bakery products, such as bread, rolls, cupcakes, donuts, cookies, cakes, pies, cones and wafers, artisan baked goods, and other products through national and regional supermarkets, wholesale and club stores, dollar stores, convenience store chains, food service distributors, and outlets, as well as other food retailing customers. This segment also supplies control brand products to retailers and distributors; ice cream cones and sandwich wafers to manufacturers in the frozen novelty category; and Girl Scout cookies. It provides products under the Wonder, Gadoua, Weston, Rubschlager, ACE Bakery, Casa Mendosa, Country Harvest, All but Gluten, and D'Italiano brands. The company was founded in 1882 and is headquartered in Toronto, Canada. George Weston Limited is a subsidiary of Wittington Investments, Limited.",
        "currency": "CAD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "WN-PE.TO": {
        "short_name": "GEORGE WESTON LIMITED PREF SER ",
        "long_name": "George Weston Limited",
        "summary": "George Weston Limited provides food and drug retailing, and financial services in Canada and internationally. The company operates through three segments: Loblaw Companies Limited (Loblaw), Choice Properties Real Estate Investment Trust (Choice Properties), and Weston Foods. The Loblaw segment provides grocery, pharmacy, health and beauty, apparel, general merchandise, and financial services. It operates retail drug stores under the Shoppers Drug Mart. This segment also provides credit card services, insurance brokerage services, guaranteed investment certificates, and wireless mobile products and services; and operates merchandisers, warehouse clubs, e-commerce retailers and businesses, mail order prescription drug distributors, limited assortment stores, discount stores, convenience stores, and specialty stores. The Choice Properties segment owns, develops, and manages commercial, retail, industrial, office, and residential properties consisting of 731 properties. The Weston Foods segment produces fresh, frozen, and specialty bakery products, such as bread, rolls, cupcakes, donuts, cookies, cakes, pies, cones and wafers, artisan baked goods, and other products through national and regional supermarkets, wholesale and club stores, dollar stores, convenience store chains, food service distributors, and outlets, as well as other food retailing customers. This segment also supplies control brand products to retailers and distributors; ice cream cones and sandwich wafers to manufacturers in the frozen novelty category; and Girl Scout cookies. It provides products under the Wonder, Gadoua, Weston, Rubschlager, ACE Bakery, Casa Mendosa, Country Harvest, All but Gluten, and D'Italiano brands. The company was founded in 1882 and is headquartered in Toronto, Canada. George Weston Limited is a subsidiary of Wittington Investments, Limited.",
        "currency": "CAD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "WN.TO": {
        "short_name": "WESTON GEORGE",
        "long_name": "George Weston Limited",
        "summary": "George Weston Limited provides food and drug retailing, and financial services in Canada and internationally. The company operates through three segments: Loblaw Companies Limited (Loblaw), Choice Properties Real Estate Investment Trust (Choice Properties), and Weston Foods. The Loblaw segment provides grocery, pharmacy, health and beauty, apparel, general merchandise, and financial services. It operates retail drug stores under the Shoppers Drug Mart. This segment also provides credit card services, insurance brokerage services, guaranteed investment certificates, and wireless mobile products and services; and operates merchandisers, warehouse clubs, e-commerce retailers and businesses, mail order prescription drug distributors, limited assortment stores, discount stores, convenience stores, and specialty stores. The Choice Properties segment owns, develops, and manages commercial, retail, industrial, office, and residential properties consisting of 731 properties. The Weston Foods segment produces fresh, frozen, and specialty bakery products, such as bread, rolls, cupcakes, donuts, cookies, cakes, pies, cones and wafers, artisan baked goods, and other products through national and regional supermarkets, wholesale and club stores, dollar stores, convenience store chains, food service distributors, and outlets, as well as other food retailing customers. This segment also supplies control brand products to retailers and distributors; ice cream cones and sandwich wafers to manufacturers in the frozen novelty category; and Girl Scout cookies. It provides products under the Wonder, Gadoua, Weston, Rubschlager, ACE Bakery, Casa Mendosa, Country Harvest, All but Gluten, and D'Italiano brands. The company was founded in 1882 and is headquartered in Toronto, Canada. George Weston Limited is a subsidiary of Wittington Investments, Limited.",
        "currency": "CAD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "WNGRF": {
        "short_name": "GEORGE WESTON LTD",
        "long_name": "George Weston Limited",
        "summary": "George Weston Limited provides food and drug retailing, and financial services in Canada and internationally. The company operates through three segments: Loblaw Companies Limited (Loblaw), Choice Properties Real Estate Investment Trust (Choice Properties), and Weston Foods. The Loblaw segment provides grocery, pharmacy, health and beauty, apparel, general merchandise, and financial services. It operates retail drug stores under the Shoppers Drug Mart. This segment also provides credit card services, insurance brokerage services, guaranteed investment certificates, and wireless mobile products and services; and operates merchandisers, warehouse clubs, e-commerce retailers and businesses, mail order prescription drug distributors, limited assortment stores, discount stores, convenience stores, and specialty stores. The Choice Properties segment owns, develops, and manages commercial, retail, industrial, office, and residential properties consisting of 731 properties. The Weston Foods segment produces fresh, frozen, and specialty bakery products, such as bread, rolls, cupcakes, donuts, cookies, cakes, pies, cones and wafers, artisan baked goods, and other products through national and regional supermarkets, wholesale and club stores, dollar stores, convenience store chains, food service distributors, and outlets, as well as other food retailing customers. This segment also supplies control brand products to retailers and distributors; ice cream cones and sandwich wafers to manufacturers in the frozen novelty category; and Girl Scout cookies. It provides products under the Wonder, Gadoua, Weston, Rubschlager, ACE Bakery, Casa Mendosa, Country Harvest, All but Gluten, and D'Italiano brands. The company was founded in 1882 and is headquartered in Toronto, Canada. George Weston Limited is a subsidiary of Wittington Investments, Limited.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "WOLWF": {
        "short_name": "WOOLWORTHS GROUP LIMITED",
        "long_name": "Woolworths Group Limited",
        "summary": "Woolworths Group Limited operates retail stores. It operates through Australian Food, New Zealand Food, Endeavour Drinks, BIG W, and Hotels segments. The Australian Food segment procures and resells food and related products, and provides services to customers in Australia. It operates 1,052 Woolworths supermarkets and Metro Food stores. The New Zealand Food segment is involved in the procurement and resale of food and drinks to customers in New Zealand. This segment operates 182 countdown supermarkets, as well as engages in the wholesale operations. The Endeavour Drinks segment procures and resells drinks to customers in Australia. It operates 1,610 stores under Dan Murphy's and BWSbrands, as well as Cellarmasters and Langtons online platforms. The BIG W segment procures and resells discount general merchandise products to customers in Australia. This segment operates 179 BIG W stores. The Hotels segment offers leisure and hospitality services, including food and drinks, accommodation, entertainment, and gaming in Australia. It operates 334 hotels, including bars, dining, gaming, accommodation, and venue hire operations. The company was formerly known as Woolworths Limited and changed its name to Woolworths Group Limited in December 2017. Woolworths Group Limited was incorporated in 1924 and is based in Bella Vista, Australia.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Bella Vista"
    },
    "WOW.AX": {
        "short_name": "WOOLWORTHS FPO",
        "long_name": "Woolworths Group Limited",
        "summary": "Woolworths Group Limited operates retail stores. It operates through Australian Food, New Zealand Food, Endeavour Drinks, BIG W, and Hotels segments. The Australian Food segment procures and resells food and related products, and provides services to customers in Australia. It operates 1,052 Woolworths supermarkets and Metro Food stores. The New Zealand Food segment is involved in the procurement and resale of food and drinks to customers in New Zealand. This segment operates 182 countdown supermarkets, as well as engages in the wholesale operations. The Endeavour Drinks segment procures and resells drinks to customers in Australia. It operates 1,610 stores under Dan Murphy's and BWSbrands, as well as Cellarmasters and Langtons online platforms. The BIG W segment procures and resells discount general merchandise products to customers in Australia. This segment operates 179 BIG W stores. The Hotels segment offers leisure and hospitality services, including food and drinks, accommodation, entertainment, and gaming in Australia. It operates 334 hotels, including bars, dining, gaming, accommodation, and venue hire operations. The company was formerly known as Woolworths Limited and changed its name to Woolworths Group Limited in December 2017. Woolworths Group Limited was incorporated in 1924 and is based in Bella Vista, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Bella Vista"
    },
    "WWR.F": {
        "short_name": "WOOLWORTHS GROUP LTD.",
        "long_name": "Woolworths Group Limited",
        "summary": "Woolworths Group Limited operates retail stores. It operates through Australian Food, New Zealand Food, Endeavour Drinks, BIG W, and Hotels segments. The Australian Food segment procures and resells food and related products, and provides services to customers in Australia. It operates 1,052 Woolworths supermarkets and Metro Food stores. The New Zealand Food segment is involved in the procurement and resale of food and drinks to customers in New Zealand. This segment operates 182 countdown supermarkets, as well as engages in the wholesale operations. The Endeavour Drinks segment procures and resells drinks to customers in Australia. It operates 1,610 stores under Dan Murphy's and BWSbrands, as well as Cellarmasters and Langtons online platforms. The BIG W segment procures and resells discount general merchandise products to customers in Australia. This segment operates 179 BIG W stores. The Hotels segment offers leisure and hospitality services, including food and drinks, accommodation, entertainment, and gaming in Australia. It operates 334 hotels, including bars, dining, gaming, accommodation, and venue hire operations. The company was formerly known as Woolworths Limited and changed its name to Woolworths Group Limited in December 2017. Woolworths Group Limited was incorporated in 1924 and is based in Bella Vista, Australia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Bella Vista"
    },
    "WX5.F": {
        "short_name": "WESTON -GEORGE-",
        "long_name": "George Weston Limited",
        "summary": "George Weston Limited provides food and drug retailing, and financial services in Canada and internationally. The company operates through three segments: Loblaw Companies Limited (Loblaw), Choice Properties Real Estate Investment Trust (Choice Properties), and Weston Foods. The Loblaw segment provides grocery, pharmacy, health and beauty, apparel, general merchandise, and financial services. It operates retail drug stores under the Shoppers Drug Mart. This segment also provides credit card services, insurance brokerage services, guaranteed investment certificates, and wireless mobile products and services; and operates merchandisers, warehouse clubs, e-commerce retailers and businesses, mail order prescription drug distributors, limited assortment stores, discount stores, convenience stores, and specialty stores. The Choice Properties segment owns, develops, and manages commercial, retail, industrial, office, and residential properties consisting of 731 properties. The Weston Foods segment produces fresh, frozen, and specialty bakery products, such as bread, rolls, cupcakes, donuts, cookies, cakes, pies, cones and wafers, artisan baked goods, and other products through national and regional supermarkets, wholesale and club stores, dollar stores, convenience store chains, food service distributors, and outlets, as well as other food retailing customers. This segment also supplies control brand products to retailers and distributors; ice cream cones and sandwich wafers to manufacturers in the frozen novelty category; and Girl Scout cookies. It provides products under the Wonder, Gadoua, Weston, Rubschlager, ACE Bakery, Casa Mendosa, Country Harvest, All but Gluten, and D'Italiano brands. The company was founded in 1882 and is headquartered in Toronto, Canada. George Weston Limited is a subsidiary of Wittington Investments, Limited.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "YHNF.TA": {
        "short_name": "M YOCHANANOF & SON",
        "long_name": "M.Yochananof and Sons (1988) Ltd",
        "summary": "M.Yochananof and Sons (1988) Ltd operates a chain of Yohananof supermarkets in Israel. It has 26 branches. The company was founded in 1992 and is based in Rehovot, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Rehovot"
    }
}