{
    "ATEK.AT": {
        "short_name": "ATTICA PUBLICATIONS S.A. (CR)",
        "long_name": "Attica Publications S.A.",
        "summary": "Attica Publications S.A. publishes magazines in Greece and internationally. It also operates radio stations. Attica Publications S.A. was founded in 1994 and is based in Marousi, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Publishing - Newspapers",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Marousi"
    },
    "LIVAN.AT": {
        "short_name": "LIVANI PUBLISHING ORG. S.A.",
        "long_name": "Livanis Publications SA",
        "summary": "Livanis Publications SA operates as a publishing company in Lebanon. The company publishes books, educational CD-ROMs, magazines, and commercial software applications, as well as provides feasibility studies and Internet services. It offers educational books, as well as books in the areas of literature, political economy, children, sciences, psychology, and various other issues. Livanis Publications SA was founded in 1972 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Publishing - Newspapers",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "RELN.MX": {
        "short_name": "RELX PLC",
        "long_name": "RELX PLC",
        "summary": "RELX PLC provides information-based analytics and decision tools for professional and business customers in North America, Europe, and internationally. It operates through four segments: Scientific, Technical & Medical; Risk; Legal; and Exhibitions. The Scientific, Technical & Medical segment provides information and analytics that help institutions and professionals to progress in science and advance healthcare. The Risk segment offers information-based analytics and decision tools that combine public and industry specific content with technology and algorithms to assist clients in evaluating and predicting risk. The Legal segment provides legal, regulatory, and business information and analytics that help customers in decision-making, as well as enhance the productivity. The Exhibitions segment is involved in the events business. The company was formerly known as Reed Elsevier PLC and changed its name to RELX PLC in July 2015. The company was incorporated in 1903 and is headquartered in London, the United Kingdom.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Publishing - Newspapers",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "city": "London"
    }
}