{
    "000632.SZ": {
        "short_name": "FUJIAN SANMU GROUP",
        "long_name": "Fujian Sanmu Group Co., Ltd.",
        "summary": "Fujian Sanmu Group Co., Ltd. engages in the import and export trade business in China. It is also involved in the real estate development; and commercial tourism asset operation. The company is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Fuzhou"
    },
    "000736.SZ": {
        "short_name": "CCCG REAL ESTATE C",
        "long_name": "CCCG Real Estate Corporation Limited",
        "summary": "CCCG Real Estate Corporation Limited engages in the development, operation, and sale of real estate properties in China. It operates through Real Estate Development and Sales, and Property and Leasing segments. It develops various residential and commercial real estate projects, as well as offers property leasing services. The company was formerly known as China Real Estate Corporation Limited and changed its name to CCCG Real Estate Corporation Limited in October 2017. The company was founded in 1993 and is based in Chongqing, China. CCCG Real Estate Corporation Limited is a subsidiary of CCCC Real Estate Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Chongqing"
    },
    "0010.HK": {
        "short_name": "HANG LUNG GROUP",
        "long_name": "Hang Lung Group Limited",
        "summary": "Hang Lung Group Limited, an investment holding company, operates as a property developer in Hong Kong and Mainland China. The company operates through four segments: Property Leasing in Mainland China, Property Leasing in Hong Kong, property sales in mainland China, and Property Sales in Hong Kong. It develops properties for sale and lease, such as large-scale mall, commercial, office, and residential developments. The company also invests in various properties, including shopping mall, office, residential, serviced apartments, and carparks. Its investment properties portfolio includes Grand Gateway 66, a mall/commercial, office, and residential complex, as well as Plaza 66, a commercial and office complex in Shanghai; Parc 66 in Jinan; Center 66 in Wuxi; Riverside 66 in Tianjin; Olympia 66 in Dalian; Palace 66 and Forum 66 in Shenyang; Spring City 66 in Kunming; Westlake 66; and Heartland 66 in Wuhan. In addition, the company offers car park and property management, securities trading, financial, project management, and property agency services; as well as operates and manages apartment. Hang Lung Group Limited was founded in 1960 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "002314.SZ": {
        "short_name": "SHENZHEN NEW NANSH",
        "long_name": "Shenzhen New Nanshan Holding (Group) Co., Ltd.",
        "summary": "Shenzhen New Nanshan Holding (Group) Co., Ltd. manufactures, sells, and operates prefabricated buildings in China. The company's products include Tetris Space buildings, Flat-Pack modular products, Easy House, Yahgee Domus, containers, and PREKIT eco-friendly products, as well as accessories, such as portal frame structures, foldable sheds, mini sheds and removable fences, construction sites, events, scene spots, and others. It sells its products to approximately 100 countries and areas. The company was formerly known as Yahgee Modular House Co., Ltd. and changed its name to Shenzhen New Nanshan Holding (Group) Co., Ltd. in November 2015. The company was founded in 2001 and is headquartered in Shenzhen, China. Shenzhen New Nanshan Holding (Group) Co., Ltd. is a subsidiary of China Nanshan Development (Group) Incorporation.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "0050.HK": {
        "short_name": "HK FERRY (HOLD)",
        "long_name": "Hong Kong Ferry (Holdings) Company Limited",
        "summary": "Hong Kong Ferry (Holdings) Company Limited, an investment holding company, primarily engages in the property development and investment business in Hong Kong. It operates through four segments: Property Development; Property Investment; Ferry, Shipyard and Related Operations; and Securities Investment. The company develops and sells residential units, commercial arcades, and car parking spaces, as well as leases real estate properties; and offers property management services. It also provides dangerous goods vehicular ferry, cruise vessels, and ship repairing and maintenance services. In addition, it invests in debt and equity securities; provides property finance; and engages in the floating restaurant business. The company was formerly known as The Hongkong and Yaumati Ferry Company Limited and changed its name to Hong Kong Ferry (Holdings) Company Limited in 1989. Hong Kong Ferry (Holdings) Company Limited was founded in 1923 and is based in Tsing Yi, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsing Yi"
    },
    "0095.HK": {
        "short_name": "LVGEM CHINA",
        "long_name": "LVGEM (China) Real Estate Investment Company Limited",
        "summary": "LVGEM (China) Real Estate Investment Company Limited, an investment holding company, engages in property development and investment business in the People's Republic of China. The company operates through Real Estate Development and Sales, Commercial Property Investment and Operations, and Comprehensive Services segments. It develops and sells properties; invests in, operates, and leases commercial properties, office premises, and car parks; operates hotels; and offers property management, consultancy, and other services to customers and tenants of its residential and commercial properties. The company was founded in 1995 and is based in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "0120.HK": {
        "short_name": "COSMOPOL INT'L",
        "long_name": "Cosmopolitan International Holdings Limited",
        "summary": "Cosmopolitan International Holdings Limited, an investment holding company, develops and invests in real estate properties in Hong Kong and Mainland China. It operates through two segments, Property Development and Investment, and Financial Assets Investments. The company develops and sells properties; leases properties; and trades in financial assets, as well as invests in other financial assets. Cosmopolitan International Holdings Limited also provides financing and development consultancy services. The company was founded in 1991 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "0242.HK": {
        "short_name": "SHUN TAK HOLD",
        "long_name": "Shun Tak Holdings Limited",
        "summary": "Shun Tak Holdings Limited, an investment holding company, engages in property, transportation, hospitality, and investment businesses in Hong Kong, Macau, Mainland China, and internationally. It develops and sells property; markets and leases retail, office, and residential properties; offers property management services for residential and commercial properties; and provides property cleaning, laundry, maintenance and repair, project works, hygiene care, pest control, waste management, legal advice, and financial management services. The company also offers passenger sea and land travel services across destinations within the Pearl River Delta connecting cities, such as Hong Kong, Shenzhen, Macau, Zhuhai, and Shekou under the TurboJET brand name. In addition, it operates hotels and golf clubs, entertainment attractions, and travel consultancies, as well as offers travel and MICE facilities; invests in gaming concessionaires; and operates toy stores under the ToysÂ\u0093RÂ\u0094Us name. Additionally, the company provides financing; hospitality management and auxiliary; and travel agency services. The company was founded in 1972 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0258.HK": {
        "short_name": "TOMSON GROUP",
        "long_name": "Tomson Group Limited",
        "summary": "Tomson Group Limited, an investment holding company, engages in property development and investment, hospitality and leisure, securities trading, PVC, and media and entertainment investment businesses in Hong Kong, Macau, and Mainland China. It develops commercial, residential, and industrial properties, as well as offers property management services. The company also operates Tomson Shanghai Pudong golf club located in Huamu District of Pudong, Shanghai; and holds a 50% interest in a hotel situated in Lujiazui of Pudong. In addition, it manufactures and trades in PVC pipes and fittings; and provides nominee and secretarial, and administrative services. Further, the company engages in the investment and production of live entertainment shows; film distribution business; and trademark holding activities. Tomson Group Limited is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0480.HK": {
        "short_name": "HKR INT'L",
        "long_name": "HKR International Limited",
        "summary": "HKR International Limited, an investment holding company, invests in, develops, and manages real estate properties in Hong Kong, Macau, Mainland China, Japan, and South East Asia. It operates in five segments: Property Development, Property Investment, Services Provided, Hotel Operations, and Healthcare. The company primarily develops and manages residential, commercial, and industrial properties, as well as leisure projects. It also owns, operates, and manages hotels; and a healthcare service network, including chronic disease management and integrated medical centers, Chinese medicine centers, dental clinics, medical diagnostic centers, and medical network services. In addition, the company offers transportation services in Discovery Bay, including ferry, land transport, and tunnel operations; operates clubs; and invests in securities. Further, HKR International Limited provides cancer treatment and diagnostic imaging, commercial leasing agency, property agency, bus and garage, dental health and care, and project management services; corporate consultancy services to healthcare operating units; and financial services to first hand purchasers of properties in Discovery Bay, as well as trades in medical and dental equipment and supplies. Additionally, the company engages in the operation of a shipyard and road tunnel; and diabetes and endocrine disorders clinics, as well as acts as an estate manager and principal lessee of communication network in Discovery Bay. HKR International Limited was founded in 1977 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0535.HK": {
        "short_name": "GEMDALE PPT",
        "long_name": "Gemdale Properties and Investment Corporation Limited",
        "summary": "Gemdale Properties and Investment Corporation Limited, an investment holding company, engages in the property investment, development, and management activities in Mainland China. The company operates through Property Development, Property Investment and Management, and Micro-Finance segments. It develops and sells residential and commercial properties; and invests in and manages business parks and commercial properties, as well as provides financial services to property buyers and small businesses. The company was formerly known as Frasers Property (China) Limited and changed its name to Gemdale Properties and Investment Corporation Limited in March 2013. Gemdale Properties and Investment Corporation Limited was incorporated in 1990 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0910.HK": {
        "short_name": "CHINA SANDI",
        "long_name": "China Sandi Holdings Limited",
        "summary": "China Sandi Holdings Limited, an investment holding company, engages in the investment and development of properties in the People's Republic of China. The company operates in Property Development, Property Investment, and Hotel Operation segments. It is also involved in the leasing of investment properties and providing property management services. In addition, the company provides hotel accommodation and catering services. Further, it engages in the securities trading. It owns and leases shopping malls, hotels, office units, commercial units, kindergartens, and car parking facilities. The Company was formerly known as China Grand Forestry Green Resources Group Limited and changed its name to China Sandi Holdings Limited in October 2012. China Sandi Holdings Limited is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0AP.F": {
        "short_name": "APPENINN VAG.H.NY.M.UF100",
        "long_name": "Appeninn Vagyonkezelo Holding Nyilvanosan Mukodo Reszvenytarsasag",
        "summary": "Appeninn Vagyonkezelo Holding Nyilvanosan Mukodo Reszvenytarsasag engages in the real estate business in Hungary. The company provides office rental services. It is also involved in letting of logistics, and industrial and commercial properties, as well as related operating services. The company was founded in 2009 and is based in Budapest, Hungary.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hungary",
        "city": "Budapest"
    },
    "1125.HK": {
        "short_name": "LAI FUNG HOLD",
        "long_name": "Lai Fung Holdings Limited",
        "summary": "Lai Fung Holdings Limited, an investment holding company, engages in the property development and investment businesses in Mainland China. It operates through four segments: The Property Development, The Property Investment, The Hotel and Serviced Apartment Operation, and The Theme Park Operation. The company invests in and develops hotels and serviced apartments, as well as residential, office, and commercial properties; and invests in, develops, and operates cultural, leisure, and entertainment and related facilities. It is also involved in the property and building management business. In addition, the company operates theme parks. The company was incorporated in 1997 and is headquartered in Central, Hong Kong. Lai Fung Holdings Limited is a subsidiary of Lai Sun Development Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "1153.HK": {
        "short_name": "JIAYUAN SER",
        "long_name": "Jiayuan Services Holdings Limited",
        "summary": "Jiayuan Services Holdings Limited operates as a property management service provider in Zhejiang province, the Peoples Republic of China. Its services primarily include property management services to property developers, property owners, and residents, primarily comprising cleaning, security, gardening and landscaping, and repair and maintenance services; value-added services to non-property owners, primarily comprising sales management services, preliminary planning and design consultancy services, pre-delivery cleaning and inspection services, car park sales assistance services, and other customized services; and community value-added services to property owners and residents, primarily comprising home-living services, common area value-added services, and car park leasing assistance services, as well as sells groceries to property owners. The company was founded in 2004 and is headquartered in Jiaxing, the Peoples Republic of China. Jiayuan Services Holdings Limited(SEHK:1153) operates independently of Jiayuan International Group Limited as of December 9, 2020.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Jiaxing"
    },
    "1168.HK": {
        "short_name": "SINOLINK HOLD",
        "long_name": "Sinolink Worldwide Holdings Limited",
        "summary": "Sinolink Worldwide Holdings Limited, an investment holding company, invests in, develops, manages, and sells real estate properties in the People's Republic of China. It operates in four segments: Property Development, Property Management, Property Investment, and Financing Services. The company develops and sells residential properties; and invests in commercial properties and securities. It also provides property, facilities, and project management services; finance leasing and loan financing, business factoring, and insurance services; and consultancy services in relation to information, multimedia, and communication technologies. In addition, the company engages in hotel operations. Sinolink Worldwide Holdings Limited was founded in 1992 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "1195.HK": {
        "short_name": "KINGWELL GROUP",
        "long_name": "Kingwell Group Limited",
        "summary": "Kingwell Group Limited, an investment holding company, engages in the property development, property leasing, and property management services business in Mainland China. The company is involved in the development of villas, apartments, and commercial buildings; property leasing of self-owned properties; sale of carpark spaces; and provision of property management services and construction services. It also owns and operates a mining project with an aggregate mining area of approximately 309.3 square kilometers located in Zeyskiy region, Russia. The company was formerly known as Sinotronics Holdings Limited and changed its name to Kingwell Group Limited in 2010. Kingwell Group Limited was founded in 1996 and is headquartered in Tsim Sha Tsui East, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "1222.HK": {
        "short_name": "WANG ON GROUP",
        "long_name": "Wang On Group Limited",
        "summary": "Wang On Group Limited, an investment holding company, primarily engages in the property development and investment activities in Hong Kong, Mainland China, Macau, and internationally. It operates through five segments: Property Development, Property Investment, Fresh Markets, Pharmaceutical, and Treasury Management. The company invests in industrial and commercial premises, and residential units for rental or for sale; and invests in debt and other securities. It is also involved in the management and sub-licensing of fresh markets; butchery business, which includes management and sale of properties in agricultural produce exchange markets; and production and sale of Chinese and Western pharmaceutical, health food, and personal care products under the Wai Yuen Tong and Madame Pearl's brand names. In addition, the company provides financial services, such as mortgages and personal loans; management services; and sells fresh pork. The company was founded in 1987 and is headquartered in Kowloon Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon Bay"
    },
    "1240.HK": {
        "short_name": "CNQC INT'L",
        "long_name": "CNQC International Holdings Limited",
        "summary": "CNQC International Holdings Limited, an investment holding company, operates as a property developer and contractor in Singapore. It operates through four segments: Foundation and construction Â\u0097 Hong Kong and Macau; Property development Â\u0097 Hong Kong; Construction Â\u0097 Singapore and Southeast Asia; and Property development - Singapore and Southeast Asia. The company primarily engages in the development and sale of executive condominiums and condominiums in the Outside Central Region of Singapore; and the provision of construction services as main contractor for governmental authorities and private property developers. It also undertakes foundation works; and provides ancillary services with specialization in piling works, as well as superstructure construction services in Hong Kong and Macau. In addition, the company undertakes construction projects in Malaysia, Indonesia, Vietnam, Myanmar, and Cambodia. Further, it is involved in the rental of machinery and construction equipment; general wholesale trade business; provision of information technology services; and provision of general contracting, and building and civil engineering services. The company is based in Kowloon Bay, Hong Kong. CNQC International Holdings Limited is a subsidiary of Guotsing Holding Group Co. Ltd.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon Bay"
    },
    "1383.HK": {
        "short_name": "SUNCITY GROUP",
        "long_name": "Suncity Group Holdings Limited",
        "summary": "Suncity Group Holdings Limited, an investment holding company, engages in property development, leasing, and management business in the People's Republic of China, Macau, Hong Kong, Japan, Cambodia, Vietnam, the Philippines, and Turkey. It operates through Property Development; Property Leasing; Hotel and Integrated Resort General Consultancy Services; Travel Related Products and Services; and Others segments. The company develops and sells office premises, and residential and retail properties. It also provides management and consultancy services to hotels and integrated resorts; and transportation and travel agency services, as well as travel related products. The company was formerly known as Sun Century Group Limited and changed its name to Suncity Group Holdings Limited in May 2017. The company is based in Shenzhen, the People's Republic of China. Suncity Group Holdings Limited is a subsidiary of Fame Select Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "1427.HK": {
        "short_name": "CH TIANBAO GP",
        "long_name": "China Tianbao Group Development Company Limited",
        "summary": "China Tianbao Group Development Company Limited operates as a property developer and construction company in the People's Republic of China. The company operates through two segments, Property Development and Construction Contracting. The Construction Contracting segment provides construction contracting services primarily as a general contractor for building construction projects; and infrastructure construction projects, such as urban roads, bridges, facilities for water supply and treatment, urban pipelines, city squares, and street lighting. It also undertakes industrial and commercial construction projects comprising steel structure, landscaping for gardens, industrial construction, and preservation of antiquities and historical buildings. This segment serves property developers and local government entities. The Property Development segment develops and sells residential properties, as well as leases and operates investment property. The company was founded in 1998 and is headquartered in Zhuozhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Zhuozhou"
    },
    "1438.TW": {
        "short_name": "SANDI PROPERTIES CO LTD",
        "long_name": "SanDi Properties Co.,Ltd.",
        "summary": "SanDi Properties Co.,Ltd. engages in the construction of commercial and industrial buildings. It also engages in residential rental and sale, real estate trading, and distribution of other department stores businesses. The company was formerly known as Yu Foong International Corporation. SanDi Properties Co.,Ltd. was founded in 1949 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "1777.HK": {
        "short_name": "FANTASIA",
        "long_name": "Fantasia Holdings Group Co., Limited",
        "summary": "Fantasia Holdings Group Co., Limited, an investment holding company, invests in, develops, sells, and leases commercial and residential properties primarily in the People's Republic of China. It operates through six segments: Property Development, Property Investment, Property Agency Services, Property Operation Services, Hotel Operation, and Others. The company engages in the development of urban complexes, upscale boutique residences, and mid-to-high end residence projects; the provision of hotel accommodation, property management, value-added, engineering, and travel agency services; and manufacture and sale of fuel pumps. It also provides community services through online platform; and wealth management, finance lease, petty loans, P2P, funds and factoring, consumer finance, insurance, payment services, etc. for enterprises and individuals, as well as operates and manages various city complexes, shopping centers, etc. In addition, the company operates golfs, high-end city clubs, private clubs, theme parks, art museums, etc.; and develops various home-based care service stations, daytime care centers, and senior citizen apartments, which provide home care, health care, rehabilitation therapy, nutrition catering, and spiritual solace, as well as education services. The company was founded in 1996 and is headquartered in Shenzhen, the People's Republic of China. Fantasia Holdings Group Co., Limited is a subsidiary of Fantasy Pearl International Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "1878.T": {
        "short_name": "DAITO TRUST CONSTRUCTION CO",
        "long_name": "Daito Trust Construction Co.,Ltd.",
        "summary": "Daito Trust Construction Co.,Ltd. designs and constructs apartments, condominiums, rental office buildings, factories, and warehouses in Japan. It operates through three segments: Construction, Real Estate, and Other. The company also constructs mid- to high-rise rental condominiums in metropolitan area; produces and constructs steel frames and sells exterior products; manages rental buildings and provides customer services; and offers rental building brokerage and tenant recruitment services. In addition, it offers agency guarantee and rental building real estate agency services; constructs LP gas plants and supplies LP gas to rental buildings; supplies and sells energy, such as electric power to rental buildings; and operates elderly day care centers and nurseries. Further, the company provides home care, in-home support planning, home visit nursing care, support for people with disabilities, housekeeper referrals, and nursing care personnel introduction services; operates hotels in Malaysia; and handles financing, such as construction funds. Additionally, it sells insurance to rental housing owners and tenants; offers payment services for credit card settlements and other payment methods; provides consulting services for trust businesses centered on real estate management trusts, as well as asset succession and asset management; and offers document shipping and shredding, printing, and clerical work services. The company was founded in 1974 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1H2.SI": {
        "short_name": "$ Olive Tree",
        "long_name": "Olive Tree Estates Limited",
        "summary": "Olive Tree Estates Limited, a real estate company, engages in the property development activities in Singapore. It operates through three segments: Investment, property development, and property rental. The company develops and invests in two light industrial properties in Singapore under the Tagore 8 and One Commonwealth names. It also engages in the property management activities. Olive Tree Estates Limited is based in Singapore. Olive Tree Estates Limited is a subsidiary of Chiu Teng Enterprises Pte Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "1PT1.SG": {
        "short_name": "Central Pattana PCL Reg. Shares",
        "long_name": "Central Pattana Public Company Limited",
        "summary": "Central Pattana Public Company Limited develops and manages real estate properties primarily in Thailand. The company develops and rents shopping centers; office buildings; hotel; residential building; and food court, as well as invests in property leasehold funds and trust, and offers property management services. As of December 31, 2019, its property portfolio comprised 34 shopping centers, 7 office buildings, 2 hotels, and 1 rental housing project and accommodation project. The company was founded in 1980 and is headquartered in Bangkok, Thailand. Central Pattana Public Company Limited operates as a subsidiary of Chirathivat Group.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "2330.HK": {
        "short_name": "CHINA UPTOWN",
        "long_name": "China Uptown Group Company Limited",
        "summary": "China Uptown Group Company Limited, an investment holding company, invests in and develops real estate properties in the People's Republic of China. The company develops residential and commercial properties. It also trades in raw cane sugar; and provides management services. China Uptown Group Company Limited is headquartered in Tsimshatsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "2520.TW": {
        "short_name": "KINDOM DEVELOPMENT CO LTD",
        "long_name": "Kindom Development Co., Ltd.",
        "summary": "Kindom Development Co., Ltd. engages in the real estate development business. The company develops residential properties; leases and sells commercial buildings; undertakes construction projects, such as corporate headquarters, civil workshops, medical buildings and residential buildings, as well as civil projects, including land preparation and rezoning, roads and bridges; and operates department stores and supermarkets. It also engages in the installation and engineering of electrical and fire safety equipment; and investment and operation of shopping malls, as well as non-store retailing business. In addition, the company offers business management and consulting; corporate marketing planning; conference; exhibition; parking lot operation and management services. Further, it is involved in the general investment activities. Kindom Development Co., Ltd. was founded in 1979 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2545.TW": {
        "short_name": "HUANG HSIANG CONSTRUCTION",
        "long_name": "Huang Hsiang Construction Corporation",
        "summary": "Huang Hsiang Construction Corporation builds, sells, and rents public housing and commercial building in Taiwan. The company's product portfolio includes home, shops, offices, shopping malls, and parking spaces. It also imports/exports and sells building materials. The company was formerly known as Huang Ming Construction Corporation, LCC and changed its name to Huang Hsiang Construction Corporation in April 1996. Huang Hsiang Construction Corporation was founded in 1991 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2547.TW": {
        "short_name": "RADIUM LIFE TECH CO",
        "long_name": "Radium Life Technology Co., Ltd.",
        "summary": "Radium Life Technology Co., Ltd. develops real estate projects in Taiwan. It develops and operates T9 BOT project, which consists of a bus terminal, four residential buildings, two office towers, a shopping center, a hotel, and a movie theatre; MEHAS project covering an area of 22,000 square meters; BOND 18 project; and E.A.T project. The company also engages in retail, luxury hotel, bus terminal management, property management, biotech and skin care, sewage treatment, renewable energy, property leasing, and elderly care businesses. Radium Life Technology Co., Ltd. was founded in 1980 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei City"
    },
    "2599.HK": {
        "short_name": "SHINSUN HOLD GP",
        "long_name": "Shinsun Holdings (Group) Co., Ltd.",
        "summary": "Shinsun Holdings (Group) Co., Ltd., an investment holding company, engages in property development and leasing; and the provision of property management services. The company focusing on the development of residential properties. It is also involved in cultural tourism; hotel operations; and wholesale and retail business. Shinsun Holdings (Group) Co., Ltd. was incorporated in 2019 and is Headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "2987.T": {
        "short_name": "TASUKI CORP",
        "long_name": "TASUKI Corporation",
        "summary": "TASUKI Corporation develops apartments and condominiums, urban hotels, resort hotels, and licensed nurseries in Japan. It also develops and operates Taski DayPay, a prepaid prepayment service; and Tuski Funds, an online complete small-scale real estate investment service. The company was founded in 2013 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2EN.F": {
        "short_name": "ENTRA ASA  NK 1",
        "long_name": "Entra ASA",
        "summary": "Entra ASA owns, develops, leases, and manages office properties in Norway. As of September 30, 2020, it had a property portfolio of 75 properties with a total area of approximately 1.1 million square meters. The company was founded in 2000 and is headquartered in Oslo, Norway.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Norway",
        "city": "Oslo"
    },
    "300.F": {
        "short_name": "KENEDIX INC.",
        "long_name": "Kenedix, Inc.",
        "summary": "Kenedix, Inc. provides diversified real estate asset investment and management services in Japan. The company's portfolio of assets under management include office buildings, residential properties, hotels, and healthcare, retail, and logistics facilities, as well as other properties. It also provides due diligence, acquisition, financing, leasing, engineering, disposition, and various other services. In addition, the company manages private funds of client investors-pension funds, institutional investors, other investors, and J-REITs. The company was formerly known as Kennedy-Wilson Japan Co., Ltd. and changed its name to Kenedix, Inc. in May 2005. Kenedix, Inc. was founded in 1995 and is headquartered in Tokyo, Japan. As of January 8, 2021, Kenedix, Inc. operates as a subsidiary of SMFL Mirai Partners Co., Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3010.T": {
        "short_name": "KACHIKAIHATSU CO L",
        "long_name": "KachikaiHatsu Co., Ltd.",
        "summary": "KachikaiHatsu Co., Ltd. operates a chain of hotels in Japan. The company also develops, buys, sells, leases, invests in, and manages real estate properties. KachikaiHatsu Co., Ltd. was founded in 1912 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3244.T": {
        "short_name": "SAMTY CO.LTD.",
        "long_name": "Samty Co., Ltd.",
        "summary": "Samty Co., Ltd. engages in the real estate business in Japan. It plans, designs, develops, and manages condominiums; and leases and manages properties, such as apartments, office buildings, commercial facilities, hotels, and others. The company is also involved in the development and sale of land; and property holding, tenant recruitment, and property management businesses, as well as provision of construction and construction renovation services. In addition, it operates hotels; and offers asset management services. The company was formerly known as Samty Development Co., Ltd. and changed its name to Samty Co., Ltd. in June 2005. Samty Co., Ltd. was founded in 1982 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "3248.T": {
        "short_name": "EARLY AGE CO LTD",
        "long_name": "Early Age Co., Ltd.",
        "summary": "Early Age Co., Ltd. engages in the real estate business in Japan. The company develops, leases, and sells condominiums. It is also involved in the real estate brokerage, consulting, and management operation businesses; and management of parking lot. The company was incorporated in 1986 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3264.T": {
        "short_name": "ASCOT CORP",
        "long_name": "Ascot Corp.",
        "summary": "Ascot Corp. develops and sells real estate properties in Japan. Its property portfolio includes condominiums, detached and terrace houses, office buildings, hotels, and commercial and nursing facilities. The company also rents apartments, condominiums, and offices. In addition, it provides real estate consulting and other services. Ascot Corp. was founded in 1999 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3280.T": {
        "short_name": "STRUST CO LIMITED",
        "long_name": "STrust Co.,Ltd.",
        "summary": "STrust Co.,Ltd. engages in the real estate business in Japan. The company primarily sells condominiums. It is also involved in real estate agency and leasing businesses, as well as the management of condominiums. The company was founded in 1999 and is headquartered in Shimonoseki, Japan. STrust Co.,Ltd. is a subsidiary of Saibu Gas Co., Ltd.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Shimonoseki"
    },
    "3289.T": {
        "short_name": "TOKYU FUDOSAN HOLDINGS CORPORAT",
        "long_name": "Tokyu Fudosan Holdings Corporation",
        "summary": "Tokyu Fudosan Holdings Corporation, together with its subsidiaries, engages in the real estate business in Japan and internationally. The company operates through seven segments: Urban Development, Residential, Property Management, Real-Estate Agents, Wellness, Tokyu Hands, and Innovation Business segments. The Urban Development segment develops, leases, and operates office buildings, renewable energy power facilities, logistics facilities, and other properties; and sells properties for investors. The Residential segment develops and sells condominiums and detached housings. The Property Management segment manages, operates, and renovates condominiums, buildings, commercial facilities, public facilities, and public housings; and constructs common areas of condominiums. The Real-Estate Agents segment provides real estate brokerage and property sales services. The Wellness segment develops and sells membership resort hotels and country houses; and owns and manages resort facilities, urban style hotels, senior housings, and membership sports clubs. The Tokyu Hands segment is involved in the retail sale of materials and products for living and D-I-Y. The Innovation Business segment develops, sells, and leases condominiums and other properties, as well as constructs residential homes and others. Tokyu Fudosan Holdings Corporation was founded in 2013 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3469.T": {
        "short_name": "DUALTAP CO LTD",
        "long_name": "Dualtap Co., Ltd.",
        "summary": "Dualtap Co., Ltd. plans, develops, and sells real estate properties in Japan and internationally. It also manages real estate properties; securitizes real estate; and operates as an insurance agency. In addition, it operates Hotel Promote located in Hakodate Shofu. The company was founded in 2006 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4090.SR": {
        "short_name": "Taiba Investments Co.",
        "long_name": "Taiba Investments Co.",
        "summary": "Taiba Investments Co. invests in and develops real estate properties in Saudi Arabia. The company manages hotels, resorts, and public and private properties, as well as provides real estate support services. It also owns and manages residential, commercial, medical, educational, sports, and entertainment centers. In addition, the company invests in building construction activities; and sells and rents buildings. Further, it is involved in tourism, industrial, and agricultural activities. The company was formerly known as Taiba Holding Co. and changed its name to Taiba Investments Co. in May 2019. Taiba Investments Co. was founded in 1988 and is headquartered in Medina, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Medina"
    },
    "4321.T": {
        "short_name": "KENEDIX INC",
        "long_name": "Kenedix, Inc.",
        "summary": "Kenedix, Inc. provides diversified real estate asset investment and management services in Japan. The company's portfolio of assets under management include office buildings, residential properties, hotels, and healthcare, retail, and logistics facilities, as well as other properties. It also provides due diligence, acquisition, financing, leasing, engineering, disposition, and various other services. In addition, the company manages private funds of client investors-pension funds, institutional investors, other investors, and J-REITs. The company was formerly known as Kennedy-Wilson Japan Co., Ltd. and changed its name to Kenedix, Inc. in May 2005. Kenedix, Inc. was founded in 1995 and is headquartered in Tokyo, Japan. As of January 8, 2021, Kenedix, Inc. operates as a subsidiary of SMFL Mirai Partners Co., Ltd.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4D7.F": {
        "short_name": "DAITO TR. CONSTR.",
        "long_name": "Daito Trust Construction Co.,Ltd.",
        "summary": "Daito Trust Construction Co.,Ltd. designs and constructs apartments, condominiums, rental office buildings, factories, and warehouses in Japan. It operates through three segments: Construction, Real Estate, and Other. The company also constructs mid- to high-rise rental condominiums in metropolitan area; produces and constructs steel frames and sells exterior products; manages rental buildings and provides customer services; and offers rental building brokerage and tenant recruitment services. In addition, it offers agency guarantee and rental building real estate agency services; constructs LP gas plants and supplies LP gas to rental buildings; supplies and sells energy, such as electric power to rental buildings; and operates elderly day care centers and nurseries. Further, the company provides home care, in-home support planning, home visit nursing care, support for people with disabilities, housekeeper referrals, and nursing care personnel introduction services; operates hotels in Malaysia; and handles financing, such as construction funds. Additionally, it sells insurance to rental housing owners and tenants; offers payment services for credit card settlements and other payment methods; provides consulting services for trust businesses centered on real estate management trusts, as well as asset succession and asset management; and offers document shipping and shredding, printing, and clerical work services. The company was founded in 1974 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5531.TW": {
        "short_name": "SHINING BUILDING BUSINESS CO LT",
        "long_name": "Shining Building Business Co.,Ltd.",
        "summary": "Shining Building Business Co., Ltd. engages in the subcontract construction, leasing, and sale of commercial buildings and residential buildings in Taiwan. It also offers hotel management services. The company was founded in 1980 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "5RF.SI": {
        "short_name": "$ Mercurius",
        "long_name": "Mercurius Capital Investment Limited",
        "summary": "Mercurius Capital Investment Limited, an investment holding company, engages in the development and investment of properties in Malaysia. It is involved in the real estate-related investments; property-related activities; holding of investments in residential, hospitality, commercial, industrial, and mix development properties; and trading of properties. The company is based in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "600077.SS": {
        "short_name": "SUNDY LAND INVESTMENT CO LTD",
        "long_name": "Sundy Land Investment Co., Ltd.",
        "summary": "Sundy Land Investment Co., Ltd. operates as a real estate development company in China. The company's product line comprises various property types, including apartments, high-end villas, and rough and fine houses. Sundy Land Investment Co., Ltd. was founded in 1984 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "600515.SS": {
        "short_name": "HAINAN HNA INFRASTRUCTURE INVES",
        "long_name": "HNA Infrastructure Investment Group Co., LTD",
        "summary": "HNA Infrastructure Investment Group Co., LTD engages in the development and management of infrastructure, real estate, and urban complex projects. The company develops, constructs, and manages urban complexes and tourism scenic areas. It is also involved in the investment, engineering, construction, operation, and management of airports; construction of offshore projects; operation and management of hotel; and duty-free business. In addition, the company provides EPC general contracting and management; and professional consulting services. HNA Infrastructure Investment Group Co., LTD is based in Haikou, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Haikou"
    },
    "600622.SS": {
        "short_name": "EVERBRIGHT JIABAO CO LTD",
        "long_name": "Everbright JiabaoCo.,Ltd.",
        "summary": "Everbright JiabaoCo.,Ltd. primarily develops real estate properties in China. The company also manages real estate properties, such as commercial, complex, office, residential, and industrial real estate properties. In addition, it provides electric light sources and nuclear power materials for rare metal forgings. Everbright JiabaoCo.,Ltd. is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "62W.F": {
        "short_name": "SVENSKA NYTTOBOSTAEDER AB",
        "long_name": "Svenska Nyttobostäder AB (publ)",
        "summary": "Svenska NyttobostÃ¤der AB (publ) owns and manages residential properties in Sweden. The company's tenants include private individuals, companies, and authorities. Its management portfolio consists of 5,752 homes. The company is headquartered in Stockholm, Sweden. Svenska NyttobostÃ¤der AB (publ) is a subsidiary of ALM Equity AB.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "6666.HK": {
        "short_name": "EVERG SERVICES",
        "long_name": "Evergrande Property Services Group Limited",
        "summary": "Evergrande Property Services Group Limited provides property management services in the People's Republic of China. The company manages a portfolio of properties, including mid- to high-end residential properties, offices buildings, commercial properties, theme and industrial parks, healthcare complexes, themed towns, schools, and others. It offers property management services, including butler, security, cleaning and greening, and repair and maintenance services to property owners, residents, and property developers, as well as tenants in non-residential properties. The company also provides value-added services, such as preliminary property management services comprising construction site management; sales office management services comprising management of property developers' sales offices and show flats; property consulting services; pre-delivery services consisting; properties repair and maintenance services; and property transaction assistance services to non-property owners. In addition, it offers community value-added services primarily to property owners and residents that include community operations services, such as community space management services; other services, including group purchase facilitations, electric vehicle charging stations, and potable water stations; community asset management services comprising parking space rental services; second-hand property transaction assistance services; recreation center operations services; and community living services, such as housekeeping, home furnishing, and repair and maintenance. The company was founded in 1997 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "74S.F": {
        "short_name": "MORGUARD CORP.",
        "long_name": "Morguard Corporation",
        "summary": "Morguard Corporation, a real estate investment and management corporation, acquires, owns, and develops real estate properties in Canada and the United States. As of February 20, 2020, the company owned a portfolio of 207 multi-suite residential, retail, office, industrial, and hotel properties that comprised 17,637 residential suites, approximately 17.2 million square feet of commercial leasable space, and 5,903 hotel rooms. It also offers real estate management services, including acquisitions, development, dispositions, leasing, performance measurement, and asset and property management; real estate advisory services; and investment products across equity, fixed-income, and balanced portfolios to institutional clients and private investors. The company is headquartered in Mississauga, Canada. Morguard Corporation is a subsidiary of Paros Enterprises Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Mississauga"
    },
    "8801.T": {
        "short_name": "MITSUI FUDOSAN",
        "long_name": "Mitsui Fudosan Co., Ltd.",
        "summary": "Mitsui Fudosan Co., Ltd. operates as a real estate company in Japan. It operates through four segments: Leasing, Property Sales, Management, and Other. The Leasing segment leases office buildings and commercial facilities, and other properties. The Property Sales segment is involved in the sale of condominiums and detached housing to individuals; and rental housing and office buildings and other to investors.  The Management segment engages in the property management and brokerage and asset management businesses. The Other segment engages in the housing construction and renovation business; and housing related material sales business. The company also offers car park leasing services; and operates hotels, golf courses, and resort facilities. In addition, it engages in the renewal work for offices and retail facilities; and electricity transmission and distribution and heat supply businesses, as well as operates as a retailer of flowers and ornamental plants, seeds, and other gardening products. The company was founded in 1941 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8803.T": {
        "short_name": "HEIWA REAL ESTATE CO",
        "long_name": "Heiwa Real Estate Co., Ltd.",
        "summary": "Heiwa Real Estate Co., Ltd. operates as a real estate company in Japan. The company develops, leases, administrates, and manages stock exchange buildings, office buildings, commercial facilities, and residential buildings; develops and sells residential buildings; and provides real estate agency services. It is also involved in the building facility maintenance and management, repair work contracting, civil engineering and construction contracting, property management, investment management, real estate brokerage, and insurance agency businesses. In addition, the company engages in the operation of halls and conference rooms, and parking lots; and management of restaurants. Heiwa Real Estate Co., Ltd. was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8923.T": {
        "short_name": "TOSEI CORPORATION",
        "long_name": "Tosei Corporation",
        "summary": "Tosei Corporation operates in the revitalization, development, rental, fund and consulting, and property management businesses in Japan. The company acquires properties whose asset value has declined and improves value-up activities; develops office buildings, commercial facilities, condominiums, detached houses, and hotels; and leases office buildings, condominiums, stores, car parks, and other properties. It is also involved in the provision of asset management services for real estate funds, as well as consultancy and intermediary services for corporates; acquisition and disposition of properties; and investment management, investment advisory and agency, and financial instrument businesses. In addition, the company offers property management services, including building management, security, renovation, and tenant leasing services; and building interior and exterior repair and maintenance, cleaning, security, etc. Further, it is involved in the logistics consulting business; consultancy services; real estate brokerage activities; hotel planning, operation, and management businesses; and construction of custom homes. The company was formerly known as Tosei Fudosan Co., Ltd. and changed its name to Tosei Corporation in October 2006. Tosei Corporation was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8927.T": {
        "short_name": "MEIHO ENTERPRISE CO LTD",
        "long_name": "Meiho Enterprise Co., Ltd.",
        "summary": "Meiho Enterprise Co., Ltd. engages in the real estate business in Japan. It is involved in the sale, rental, lease, and intermediation of real estate properties, including apartments, condominiums, and townhouses. The company was founded in 1968 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8931.T": {
        "short_name": "WADAKOHSAN CORP",
        "long_name": "Wadakohsan Corporation",
        "summary": "Wadakohsan Corporation develops and sells condominiums, detached houses, and residential land in Japan. It also rents, leases, and manages condominiums, stores, and parking lots. The company was founded in 1899 and is headquartered in Kobe, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kobe"
    },
    "8995.T": {
        "short_name": "MAKOTO CONSTRUCTION CO.LTD",
        "long_name": "Makoto Construction Co,Ltd",
        "summary": "Makoto Construction Co,Ltd, a construction company, designs, constructs, and sells in-houses in Japan. It constructs condominiums and custom homes; and provides remodeling services. The company was founded in 1977 and is headquartered in Sakai, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sakai"
    },
    "9639.T": {
        "short_name": "SANKYO FRONTIER CO",
        "long_name": "Sankyo Frontier Co.,Ltd.",
        "summary": "Sankyo Frontier Co.,Ltd. produces, sells, and rents modular buildings, self-storage, and multistory parking devices in Japan and internationally. Its products are used in various applications, such as construction site offices, temporary emergency housing, shops, offices, schools, medical facilities, etc. The company was founded in 1969 and is headquartered in Kashiwa, Japan. Sankyo Frontier Co.,Ltd. is a subsidiary of Wako Kosan Y.K.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kashiwa"
    },
    "ACRI.ST": {
        "short_name": "Acrinova AB",
        "long_name": "Acrinova AB (publ)",
        "summary": "Acrinova AB (publ) owns, develops, and manages real estate properties in southern Sweden. It offers condominiums, offices, preschools, schools, senior housing, student apartments, and tenants/housings properties. The company was founded in 2014 and is headquartered in MalmÃ¶, Sweden.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "MalmÃ¶"
    },
    "ALM-PREF.ST": {
        "short_name": "ALM Equity AB Pref",
        "long_name": "ALM Equity AB (publ)",
        "summary": "ALM Equity AB (publ) operates as a real estate development company in Sweden. The company operates through five business areas: Project Development Housing, Construction Management, Real Estate Management, Financing, and Digital Services. The Project Development Housing business area engages in acquiring, structuring, financing, conceptualizing, and developing housing projects under the ALM Bostad and SmÃ¥a brands. The Construction Management business area plans, manages, and controls construction projects under the 2A Entreprenad brand. The Real Estate Management business area is involved in the ownership, management, and rental of homes and other premises for companies, authorities, and individuals under the Svenska NyttobostÃ¤der brand. The Financing business area offers financing solutions for developers, managers, and investors in housing and real estate projects under the Nordisk Fastighetskredit brand. The Digital Services business area develops software and services to establish digital communities and sharing economics under the Your Block brand. ALM Equity AB (publ) was founded in 2006 and is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "ALRPR.TA": {
        "short_name": "ALROV PROPERTIES",
        "long_name": "Alrov Properties and Lodgings Ltd.",
        "summary": "Alrov Properties and Lodgings Ltd., a real estate company, invests in, develops, and operates real estate projects in Israel, the United Kingdom, France, Switzerland, and the Netherlands. Its projects include investment properties and residential projects, as well as develops, owns, and operates 5 star luxury hotels. The company was founded in 1978 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "AOF.SI": {
        "short_name": "$ Amplefield Ltd",
        "long_name": "Amplefield Limited",
        "summary": "Amplefield Limited, an investment holding company, engages in the property development and investment, construction, and facility provision activities in Malaysia, Vietnam, and the Philippines. It also provides administrative, management, and trading; and engineering, procurement, and construction management services. The company was incorporated in 1989 and is based in Kuala Lumpur, Malaysia. Amplefield Limited is a subsidiary of Olander Limited.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "city": "Kuala Lumpur"
    },
    "APZ.AX": {
        "short_name": "ASPEN STAPLED",
        "long_name": "Aspen Group",
        "summary": "Formed in 2001, Aspen Group is an ASX listed property group strategically focused on providing Â\u0093value for moneyÂ\u0094 accommodation. The accommodation sector is considered to have positive long term structural characteristics, with an enduring customer need and effective capital utilisation. Aspen has been a leading owner and manager of holiday and accommodation parks since 2004. Aspen currently owns 9 holiday and accommodation parks across Australia. An active acquisition programme is underway to expand the portfolio within the Â\u0093value for moneyÂ\u0094 accommodation sector.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Bondi Junction"
    },
    "ATH.VI": {
        "short_name": "ATHOS IMMOBILIEN AG",
        "long_name": "Athos Immobilien AG",
        "summary": "Athos Immobilien AG invests in, develops, and manages residential real estate properties in Upper Austria and Vienna. The company was founded in 1989 and is based in Linz, Austria.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Austria",
        "city": "Linz"
    },
    "AWS.SI": {
        "short_name": "GYP Properties",
        "long_name": "GYP Properties Limited",
        "summary": "GYP Properties Limited, an investment holding company, invests in, develops, manages, and rents real estate properties in Singapore and New Zealand. It operates through Property and Others segments. The company has a property portfolio of 303,051 square meters of land comprising commercial, retail, and residential assets. Its principal projects include Remarkables Residences, Bellfield Estate, and Pakuranga Precinct. The company also invests in equity shares. The company was formerly known as Global Yellow Pages Limited and changed its name to GYP Properties Limited in October 2018. GYP Properties Limited was founded in 1967 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "AXI.AX": {
        "short_name": "AXIOM FPO",
        "long_name": "Axiom Properties Limited",
        "summary": "Axiom Properties Limited, together with its subsidiaries, engages in property investment, development, and rental activities in Australia. The company's property portfolio comprises mixed-use residential, retail, cinema, hotel, and car parking and office developments, as well as a 600-lot residential subdivision development. It is also involved in fund management activities. The company was incorporated in 1983 and is based in Adelaide, Australia.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Adelaide"
    },
    "BALD-B.ST": {
        "short_name": "Fastighets AB Balder ser. B",
        "long_name": "Fastighets AB Balder (publ)",
        "summary": "Fastighets AB Balder (publ) develops, owns, and manages residential and commercial properties, and hotels in Sweden, Denmark, Finland, Norway, the United Kingdom, and Germany. The company's property portfolio comprises commercial properties, such as office, restaurant, retail, storage, and warehouse properties; residential properties; other properties, including hotel, educational, healthcare, industrial, and mixed-use properties; and parking spaces. As of December 31, 2019, it owned 1,298 investment properties with a lettable area of 4,304,000 square meters. The company was founded in 2005 and is headquartered in Gothenburg, Sweden.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Gothenburg"
    },
    "BC-R.BK": {
        "short_name": "BOUTIQUE CORPORATION PUBLIC COM",
        "long_name": "Boutique Corporation Public Company Limited",
        "summary": "Boutique Corporation Public Company Limited designs, develops, manages, and sells real estate solutions in the hospitality, retail, and commercial sectors to institutional investors in Thailand. It is involved in real estate development, such as serviced residences, hotel operations, and community mall, as well as sale of real estate projects and real estate investment management activities. The company is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "BC.BK": {
        "short_name": "BOUTIQUE CORPORATION PUBLIC COM",
        "long_name": "Boutique Corporation Public Company Limited",
        "summary": "Boutique Corporation Public Company Limited designs, develops, manages, and sells real estate solutions in the hospitality, retail, and commercial sectors to institutional investors in Thailand. It is involved in real estate development, such as serviced residences, hotel operations, and community mall, as well as sale of real estate projects and real estate investment management activities. The company is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "BESQ.ST": {
        "short_name": "Besqab AB",
        "long_name": "Besqab AB (publ)",
        "summary": "Besqab AB (publ) engages in the housing project construction activities in Sweden. It offers property development, construction management, and land acquisition services. The company was founded in 1989 and is headquartered in Danderyd, Sweden.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Danderyd"
    },
    "BIPP.JK": {
        "short_name": "Bhuwanatala Indah Permai Tbk.",
        "long_name": "PT Bhuwanatala Indah Permai Tbk",
        "summary": "PT Bhuwanatala Indah Permai Tbk, through its subsidiaries, engages in the development and management of commercial properties in Indonesia. The company develops and manages properties, including hotels, apartments, offices, shops, and housing properties. It is also involved in the equity participation business. The company was formerly known as PT Bandung Indah Plaza and changed its name to PT Bhuwanatala Indah Permai Tbk in 1990. PT Bhuwanatala Indah Permai Tbk was founded in 1981 and is headquartered in Jakarta, Indonesia. PT Bhuwanatala Indah Permai Tbk is a subsidiary of Safire Capital Pte. Ltd.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "BLAND-R.BK": {
        "short_name": "BANGKOK LAND PUBLIC COMPANY LIM",
        "long_name": "Bangkok Land Public Company Limited",
        "summary": "Bangkok Land Public Company Limited, together with its subsidiaries, engages in the real estate development, exhibition and convention, food and beverage, and hotel investment businesses in Thailand. It also provides financing services; project and infrastructure management services; building management and maintenance services; and real estate investment trust management services, as well as rents properties. In addition, the company is involved in the retail business, as well as in the issuance of bonds. Bangkok Land Public Company Limited is based in Nonthaburi, Thailand.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Nonthaburi"
    },
    "BLAND.BK": {
        "short_name": "BANGKOK LAND PUBLIC COMPANY LIM",
        "long_name": "Bangkok Land Public Company Limited",
        "summary": "Bangkok Land Public Company Limited, together with its subsidiaries, engages in the real estate development, exhibition and convention, food and beverage, and hotel investment businesses in Thailand. It also provides financing services; project and infrastructure management services; building management and maintenance services; and real estate investment trust management services, as well as rents properties. In addition, the company is involved in the retail business, as well as in the issuance of bonds. Bangkok Land Public Company Limited is based in Nonthaburi, Thailand.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Nonthaburi"
    },
    "BOOT.L": {
        "short_name": "BOOT (HENRY) PLC ORD 10P",
        "long_name": "Henry Boot PLC",
        "summary": "Henry Boot PLC engages in the property investment and development activities in the United Kingdom. It operates through three segments: Property Investment and Development, Land Promotion, and Construction. The company develops commercial properties and family homes. It is also involved in acquiring, promoting, developing, and trading in land. In addition, the company engages in the construction and civil engineering activities; hires and sells construction equipment; and operates and maintains A69 trunk road between Carlisle and Newcastle upon Tyne. As of December 31, 2019, it had land interests in 14,898 acres. Henry Boot PLC was founded in 1886 and is headquartered in Sheffield, the United Kingdom.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Sheffield"
    },
    "BRER": {
        "short_name": "BRESLER & REINER INC",
        "long_name": "Bresler & Reiner, Inc.",
        "summary": "Bresler & Reiner, Inc. acquires, develops, and owns commercial, residential, and hospitality real estate in the United States. The company was incorporated in 1970 and is based in Rockville, Maryland. It has operations in the Philadelphia, Pennsylvania; Wilmington, Delaware; Delaware and Maryland Eastern Shore; Baltimore, Maryland; Washington, D.C.; Houston, Texas; and the Tampa and Orlando, Florida.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Rockville"
    },
    "BRES.QA": {
        "short_name": "Barwa Real Estate QPSC",
        "long_name": "Barwa Real Estate Company Q.P.S.C.",
        "summary": "Barwa Real Estate Company is a real estate investment firm specializing in real estate projects which include residential facilities, a motor city, warehouses, and complementary commercial and retail spaces. The firm engages in investment, development, and management of properties with a focus on Qatar and Saudi Arabia. It also invests in stocks of real estate firms. The firm invests in the real estate markets across the globe. Its portfolio includes residential and commercial property and hotels. Barwa Real Estate Company was founded on January 19, 2006 and is based in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "city": "Doha"
    },
    "BRRE": {
        "short_name": "BLUE RIDGE REAL ESTATE CO",
        "long_name": "Blue Ridge Real Estate Company",
        "summary": "Blue Ridge Real Estate Company owns investment properties in Eastern Pennsylvania. It operates through three segments: Resort Operations, Real Estate Management/Rental Operations, and Land Resource Management. The Resort Operations segment operates amenities surrounding Big Boulder Lake Â\u0096 Boulder View Tavern and Boulder Lake Club; the Jack Frost National Golf Course; and the Stretch fishing club. The Real Estate Management/Rental Operations segment owns investment properties that are leased to others located in Eastern Pennsylvania. It is involved in the provision of services to the trusts that operate resort residential communities; and rental of communication towers and signboards. The Land Resource Management segment engages in the purchase and sale of land; timbering operations; real estate development activities; and leasing of land and land improvements. As of October 31, 2019, it owned 9,689 acres of land in the Pocono Mountains of Pennsylvania. The company was founded in 1820 and is headquartered in Blakeslee, Pennsylvania.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Blakeslee"
    },
    "BTF.SI": {
        "short_name": "Debao Property^",
        "long_name": "Debao Property Development Ltd.",
        "summary": "Debao Property Development Ltd., an investment holding company, operates as an integrated property developer in the People's Republic of China. The company operates through four segments: Property Development, Construction Contract, Property Investment, and Property Management. It develops residential and commercial properties. The company also provides property investment and management services. In addition, it is involved in the construction activities. The company was founded in 2000 and is based in Foshan, the People's Republic of China.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "city": "Foshan"
    },
    "BTLN": {
        "short_name": "BRIGHTLANE CORP",
        "long_name": "Brightlane Corp.",
        "summary": "Brightlane Corp. focuses on acquiring, renovating, managing, and leasing low priced single-family homes primarily in the United States. Brightlane Corp. is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "CATE.ST": {
        "short_name": "Catena AB",
        "long_name": "Catena AB (publ)",
        "summary": "Catena AB (publ) operates as a logistics property company in Sweden. It owns, develops, manages, and sells logistics properties. The company serves logistics companies. As of December 31, 2019, its property portfolio comprised 109 logistics properties located primarily in southern and central Sweden with a total lettable area of approximately 1,842,700 square meters. It operates in the regions of Gothenburg, Helsingborg, JÃ¶nkÃ¶ping, MalmÃ¶, and Stockholm. The company was founded in 1967 and is headquartered in Helsingborg, Sweden.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Helsingborg"
    },
    "CBOT.PA": {
        "short_name": "CBO TERRITORIA",
        "long_name": "CBo Territoria Société Anonyme",
        "summary": "CBo Territoria SociÃ©tÃ© Anonyme develops, promotes, manages, and sells real estate properties in France. Its residential properties include serviced plots, villas, townhouses, and apartments; and commercial real estate properties comprise offices, businesses, warehouses, parcels, divisible lots, and business districts. The company also owns approximately 3,000 hectares of land in the island of RÃ©union. CBo Territoria SociÃ©tÃ© Anonyme is based in Sainte-Marie, France.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Sainte-Marie"
    },
    "CBYI": {
        "short_name": "CAL-BAY INTERNATIONAL",
        "long_name": "Cal Bay International, Inc.",
        "summary": "Cal Bay International, Inc. engages in the acquisition, development, management, sale, and rental of commercial or residential properties in the United States. It also provides consulting services to individuals and/or businesses. The company was formerly known as Cal-Bay Controls, Inc. and changed its name to Cal Bay International, Inc. in March 2001. Cal Bay International, Inc. was founded in 1998 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "CCPR3.SA": {
        "short_name": "CYRE COM-CCPON      NM",
        "long_name": "Cyrela Commercial Properties S.A.",
        "summary": "CCP is one of Brazil's leading companies in the leasing, acquisition, sale, development and management of commercial real estate. It focuses on triple-A office buildings and shopping malls, with investments in the states of SÃ£o Paulo, Rio de Janeiro, Minas Gerais, GoiÃ¡s and Bahia. CCP currently has 246,760 thousand sqm of leasable area in operation. With over 17 years of experience in the sector, the Company is the result of the spin-off of Cyrela Brazil Realty's commercial property activities in 2007 and has consistently presented solid results, both in terms of growth and profitability. Its experience ensures low vacancy rates and high profitability. The Company is listed n the Novo Mercado Special Corporate Governance Segment of B3 (Brasil, Bolsa, BalcÃ£o), trading under the ticker CCPR3, and is committed to its stakeholders in following the best Corporate Governance practices.",
        "currency": "BRL",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "CHCI": {
        "short_name": "Comstock Holding Companies, Inc",
        "long_name": "Comstock Holding Companies, Inc.",
        "summary": "Comstock Holding Companies, Inc. operates as a real estate assets management and services company. The company operates through two segments, Asset Management and Real Estate Services. It offers commercial real estate and asset management services for rental apartments, office buildings, hotels, commercial garages, leased lands, retail properties, mixed-use developments, and transit-oriented developments. The company also provides real estate services in the areas of strategic corporate planning, capital markets, financial consulting, commercial mortgage brokerage, title, and environmental and design-based services. In addition, it offers environmental services, including consulting, environmental studies, remediation, and industrial hygiene services, as well as site specific solutions. Further, the company provides construction management and supervision services. It offers its services primarily in the Washington, D.C. Metro Silver Line in Fairfax and Loudoun Counties, as well as in the states of Maryland and Virginia; and the Mid-Atlantic region. The company was formerly known as Comstock Homebuilding Companies, Inc. and changed its name to Comstock Holding Companies, Inc. in June 2012. Comstock Holding Companies, Inc. was founded in 1985 and is headquartered in Reston, Virginia.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Reston"
    },
    "CIC.L": {
        "short_name": "CONYGAR INVESTMENT COMPANY PLC ",
        "long_name": "The Conygar Investment Company PLC",
        "summary": "The Conygar Investment Company PLC (Â\u0093ConygarÂ\u0094) is an AIM quoted property investment and development group dealing primarily in UK property. The group aims to invest in property assets where we can add significant value using our property management, development and transaction structuring skills.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "CMC-R.BK": {
        "short_name": "CHAOPRAYAMAHANAKORN PUBLIC COMP",
        "long_name": "Chaoprayamahanakorn Public Company Limited",
        "summary": "Chaoprayamahanakorn Public Company Limited engages in the real estate development activities in Thailand. The company develops lands, single detached houses, townhouses, and condominium units. It also offers construction services; leases space in office building; and engages in the furniture and wall manufacturing business. Chaoprayamahanakorn Public Company Limited was founded in 1994 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "CMC.BK": {
        "short_name": "CHAOPRAYAMAHANAKORN PUBLIC COMP",
        "long_name": "Chaoprayamahanakorn Public Company Limited",
        "summary": "Chaoprayamahanakorn Public Company Limited engages in the real estate development activities in Thailand. The company develops lands, single detached houses, townhouses, and condominium units. It also offers construction services; leases space in office building; and engages in the furniture and wall manufacturing business. Chaoprayamahanakorn Public Company Limited was founded in 1994 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "CPN-R.BK": {
        "short_name": "CENTRAL PATTANA PUBLIC COMPANY ",
        "long_name": "Central Pattana Public Company Limited",
        "summary": "Central Pattana Public Company Limited develops and manages real estate properties primarily in Thailand. The company develops and rents shopping centers; office buildings; hotel; residential building; and food court, as well as invests in property leasehold funds and trust, and offers property management services. As of December 31, 2019, its property portfolio comprised 34 shopping centers, 7 office buildings, 2 hotels, and 1 rental housing project and accommodation project. The company was founded in 1980 and is headquartered in Bangkok, Thailand. Central Pattana Public Company Limited operates as a subsidiary of Chirathivat Group.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "CPN.BK": {
        "short_name": "CENTRAL PATTANA PUBLIC COMPANY ",
        "long_name": "Central Pattana Public Company Limited",
        "summary": "Central Pattana Public Company Limited develops and manages real estate properties primarily in Thailand. The company develops and rents shopping centers; office buildings; hotel; residential building; and food court, as well as invests in property leasehold funds and trust, and offers property management services. As of December 31, 2019, its property portfolio comprised 34 shopping centers, 7 office buildings, 2 hotels, and 1 rental housing project and accommodation project. The company was founded in 1980 and is headquartered in Bangkok, Thailand. Central Pattana Public Company Limited operates as a subsidiary of Chirathivat Group.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "CPRI.JK": {
        "short_name": "Capri Nusa Satu Properti Tbk.",
        "long_name": "PT Capri Nusa Satu Properti Tbk",
        "summary": "PT Capri Nusa Satu Properti Tbk engages in the property and real estate development business in Indonesia. It develops resorts; and meeting houses and office buildings. The company was founded in 2011 and is based in East Jakarta, Indonesia. PT Capri Nusa Satu Properti Tbk is a subsidiary of PT RDW Global Investasi.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Timur"
    },
    "CRZK.DE": {
        "short_name": "CR CAPITAL AG  INH O.N.",
        "long_name": "CR Capital Real Estate AG",
        "summary": "CR Capital Real Estate AG develops, invests, and sells real estate projects to owner-occupiers and institutional customers. It also offers various financial services. The company was founded in 2008 and is based in Berlin, Germany.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "city": "Berlin"
    },
    "CRZK.F": {
        "short_name": "CR CAPITAL AG  INH O.N.",
        "long_name": "CR Capital Real Estate AG",
        "summary": "CR Capital Real Estate AG develops, invests, and sells real estate projects to owner-occupiers and institutional customers. It also offers various financial services. The company was founded in 2008 and is based in Berlin, Germany.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "city": "Berlin"
    },
    "CRZK.SG": {
        "short_name": "CR Capital Real Estate AG Inhab",
        "long_name": "CR Capital Real Estate AG",
        "summary": "CR Capital Real Estate AG develops, invests, and sells real estate projects to owner-occupiers and institutional customers. It also offers various financial services. The company was founded in 2008 and is based in Berlin, Germany.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Germany",
        "city": "Berlin"
    },
    "CTY1S.HE": {
        "short_name": "Citycon Oyj",
        "long_name": "Citycon Oyj",
        "summary": "Citycon Oyj, a real estate investment company, owns, develops, and manages retail, office space, and housing properties in the Nordic region. The company owns 40 centers and 1 other retail property. Citycon Oyj was founded in 1988 and is headquartered in Espoo, Finland.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "DIFTY": {
        "short_name": "DAITO TRUST CONSTRUCTION CO",
        "long_name": "Daito Trust Construction Co.,Ltd.",
        "summary": "Daito Trust Construction Co.,Ltd. designs and constructs apartments, condominiums, rental office buildings, factories, and warehouses in Japan. It operates through three segments: Construction, Real Estate, and Other. The company also constructs mid- to high-rise rental condominiums in metropolitan area; produces and constructs steel frames and sells exterior products; manages rental buildings and provides customer services; and offers rental building brokerage and tenant recruitment services. In addition, it offers agency guarantee and rental building real estate agency services; constructs LP gas plants and supplies LP gas to rental buildings; supplies and sells energy, such as electric power to rental buildings; and operates elderly day care centers and nurseries. Further, the company provides home care, in-home support planning, home visit nursing care, support for people with disabilities, housekeeper referrals, and nursing care personnel introduction services; operates hotels in Malaysia; and handles financing, such as construction funds. Additionally, it sells insurance to rental housing owners and tenants; offers payment services for credit card settlements and other payment methods; provides consulting services for trust businesses centered on real estate management trusts, as well as asset succession and asset management; and offers document shipping and shredding, printing, and clerical work services. The company was founded in 1974 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "DIOS.ST": {
        "short_name": "Dis Fastigheter AB",
        "long_name": "Diös Fastigheter AB (publ)",
        "summary": "DiÃ¶s Fastigheter AB (publ) develops, owns, and rents commercial and residential properties in Sweden. It holds a portfolio of 333 properties and a lettable area of 1,483,000 sq.m with meeting places, shops, offices, and homes. The company was founded in 1921 and is headquartered in Ostersund, Sweden.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Ostersund"
    },
    "DITTF": {
        "short_name": "DAITO TRUST CONSTRUCTION CO",
        "long_name": "Daito Trust Construction Co.,Ltd.",
        "summary": "Daito Trust Construction Co.,Ltd. designs and constructs apartments, condominiums, rental office buildings, factories, and warehouses in Japan. It operates through three segments: Construction, Real Estate, and Other. The company also constructs mid- to high-rise rental condominiums in metropolitan area; produces and constructs steel frames and sells exterior products; manages rental buildings and provides customer services; and offers rental building brokerage and tenant recruitment services. In addition, it offers agency guarantee and rental building real estate agency services; constructs LP gas plants and supplies LP gas to rental buildings; supplies and sells energy, such as electric power to rental buildings; and operates elderly day care centers and nurseries. Further, the company provides home care, in-home support planning, home visit nursing care, support for people with disabilities, housekeeper referrals, and nursing care personnel introduction services; operates hotels in Malaysia; and handles financing, such as construction funds. Additionally, it sells insurance to rental housing owners and tenants; offers payment services for credit card settlements and other payment methods; provides consulting services for trust businesses centered on real estate management trusts, as well as asset succession and asset management; and offers document shipping and shredding, printing, and clerical work services. The company was founded in 1974 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "DKE.L": {
        "short_name": "DUKEMOUNT CAPITAL PLC ORD GBP0.",
        "long_name": "Dukemount Capital Plc",
        "summary": "Dukemount Capital Plc, formerly known as Black Eagle Capital PLC, is a real estate investment firm. Previously, it operated  as a venture capital firm specializing in seed investments. Dukemount Capital Plc is based in London, United Kingdom.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "DLF.NS": {
        "short_name": "DLF LIMITED",
        "long_name": "DLF Limited",
        "summary": "DLF Limited, together with its subsidiaries, engages in the business of colonization and real estate development in India. Its activities include identification and acquisition of land; and planning, execution, construction, and marketing of projects. The company develops and sells residential properties, such as plotted developments, houses, and villas and apartments; and commercial and retail properties. It also engages in the lease of developed office space, ITes, and retail properties. In addition, the company owns and operates The Lodhi hotel and the Hilton Garden Inn in New Delhi; and golf and country clubs. Further, it engages in the provision of maintenance services; generation and sale of power; and recreational activities. DLF Limited was founded in 1946 and is based in Gurugram, India. DLF Limited operates as a subsidiary of Rajdhani Investments & Agencies Private Limited.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "ECDP": {
        "short_name": "ECO DEPOT INC",
        "long_name": "Eco Depot Inc.",
        "summary": "Eco Depot Inc., a development stage company, focuses on the distribution of environmental friendly and green energy products, building and construction materials, and home products worldwide. The company is also involved in the development, manufacture, and distribution of LED lighting systems and related products for use in offices, supermarkets, schools, factories, municipal streets, healthcare organizations, retail stores, and gas stations. Its LED lighting products include indoor T-bar flat LED light products, high-bay lighting systems, road/highway LED light products, and area security LED light products. The company markets its LED products through a network of distributors and in-house sales representatives in North America. Eco Depot Inc. was founded in 2004 and is headquartered in Pensacola, Florida.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Pensacola"
    },
    "ENTOF": {
        "short_name": "ENTRA ASA",
        "long_name": "Entra ASA",
        "summary": "Entra ASA owns, develops, leases, and manages office properties in Norway. As of December 31, 2019, it had a property portfolio of 89 properties totalling approximately 1.3 million square meters. The company was founded in 2000 and is headquartered in Oslo, Norway.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Norway",
        "city": "Oslo"
    },
    "ENTRA.OL": {
        "short_name": "ENTRA ASA",
        "long_name": "Entra ASA",
        "summary": "Entra ASA owns, develops, leases, and manages office properties in Norway. As of September 30, 2020, it had a property portfolio of 75 properties with a total area of approximately 1.1 million square meters. The company was founded in 2000 and is headquartered in Oslo, Norway.",
        "currency": "NOK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Norway",
        "city": "Oslo"
    },
    "EZTC3.SA": {
        "short_name": "EZTEC       ON      NM",
        "long_name": "EZTEC Empreendimentos e Participações S.A.",
        "summary": "EZTEC Empreendimentos e ParticipaÃ§Ãµes S.A. operates in the property development and construction sector in Brazil. The company undertakes residential buildings and commercial office projects. EZTEC Empreendimentos e ParticipaÃ§Ãµes S.A. is based in SÃ£o Paulo, Brazil.",
        "currency": "BRL",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "F17.SI": {
        "short_name": "GuocoLand",
        "long_name": "GuocoLand Limited",
        "summary": "GuocoLand Limited, an investment holding company, invests, develops, and manages various properties. It operates through GuocoLand Singapore, GuocoLand China, GuocoLand Malaysia, GuocoLand Vietnam, and Others segments. The company develops residential, hospitality, commercial, retail, mixed-use, and integrated properties; rents properties; and operates and manages hotels. It also offers management, marketing, and maintenance services. The company was formerly known as First Capital Corporation Ltd. and changed its name to GuocoLand Limited in November 2002. GuocoLand Limited was incorporated in 1976 and is headquartered in Singapore. GuocoLand Limited is a subsidiary of GuocoLand Assets Pte. Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "FPAR-A.ST": {
        "short_name": "Fastpartner AB ser. A",
        "long_name": "FastPartner AB (publ)",
        "summary": "FastPartner AB (publ) develops, owns, and manages commercial properties in Sweden. The company was founded in 1987 and is headquartered in Stockholm, Sweden. FastPartner AB (publ) is a subsidiary of Compactor Fastigheter AB.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "FPAR-D.ST": {
        "short_name": "Fastpartner AB ser. D",
        "long_name": "FastPartner AB (publ)",
        "summary": "FastPartner AB (publ) develops, owns, and manages commercial properties in Sweden. The company was founded in 1987 and is headquartered in Stockholm, Sweden. FastPartner AB (publ) is a subsidiary of Compactor Fastigheter AB.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "FPAR-PREF.ST": {
        "short_name": "Fastpartner AB Pref",
        "long_name": "FastPartner AB (publ)",
        "summary": "FastPartner AB (publ) develops, owns, and manages commercial properties in Sweden. The company was founded in 1987 and is headquartered in Stockholm, Sweden. FastPartner AB (publ) is a subsidiary of Compactor Fastigheter AB.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "FS8.MU": {
        "short_name": "GUOCOLAND LTD.  SD 1",
        "long_name": "GuocoLand Limited",
        "summary": "GuocoLand Limited, an investment holding company, invests, develops, and manages various properties. It operates through GuocoLand Singapore, GuocoLand China, GuocoLand Malaysia, GuocoLand Vietnam, and Others segments. The company develops residential, hospitality, commercial, retail, mixed-use, and integrated properties; rents properties; and operates and manages hotels. It also offers management, marketing, and maintenance services. The company was formerly known as First Capital Corporation Ltd. and changed its name to GuocoLand Limited in November 2002. GuocoLand Limited was incorporated in 1976 and is headquartered in Singapore. GuocoLand Limited is a subsidiary of GuocoLand Assets Pte. Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "FT7.F": {
        "short_name": "FANTASIA H.G.C.REGS HD-10",
        "long_name": "Fantasia Holdings Group Co., Limited",
        "summary": "Fantasia Holdings Group Co., Limited, an investment holding company, invests in, develops, sells, and leases commercial and residential properties primarily in the People's Republic of China. It operates through six segments: Property Development, Property Investment, Property Agency Services, Property Operation Services, Hotel Operation, and Others. The company engages in the development of urban complexes, upscale boutique residences, and mid-to-high end residence projects; the provision of hotel accommodation, property management, value-added, engineering, and travel agency services; and manufacture and sale of fuel pumps. It also provides community services through online platform; and wealth management, finance lease, petty loans, P2P, funds and factoring, consumer finance, insurance, payment services, etc. for enterprises and individuals, as well as operates and manages various city complexes, shopping centers, etc. In addition, the company operates golfs, high-end city clubs, private clubs, theme parks, art museums, etc.; and develops various home-based care service stations, daytime care centers, and senior citizen apartments, which provide home care, health care, rehabilitation therapy, nutrition catering, and spiritual solace, as well as education services. The company was founded in 1996 and is headquartered in Shenzhen, the People's Republic of China. Fantasia Holdings Group Co., Limited is a subsidiary of Fantasy Pearl International Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "FTPM": {
        "short_name": "420 PPTY MGMT INC",
        "long_name": "420 Property Management, Inc.",
        "summary": "420 Property Management, Inc. engages in real estate development and property management activities in the cannabis and hemp industry. The company acquires strategically zoned, high traffic commercial corridors, and prime agricultural properties for the cannabis, hemp, and legal marijuana industries. It also manages and leases a portfolio of agricultural, retail, commercial, and industrial properties in California; and acquires, develops, manages construction, markets, and leases retail, commercial and agricultural revenue-producing properties for the cannabis, hemp, and legal marijuana industry use. In addition, the company provides machinery, tools, and infrastructure for cannabis, hemp, and marijuana industries. The company was formerly known as Digagogo Ventures Corp. and changed its name to 420 Property Management, Inc. in October 2015. 420 Property Management, Inc. is based in Carlsbad, California.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Carlsbad"
    },
    "GALIM.PA": {
        "short_name": "GALIMMO",
        "long_name": "Galimmo SCA",
        "summary": "Galimmo SCA operates as a real estate company in Europe. As of June 30, 2019, it manages a portfolio of 52 shopping malls. The company was formerly known as C&Co SCA and changed its name to Galimmo SCA in September 2016. Galimmo SCA was founded in 1902 and is based in Paris, France. Galimmo SCA is a subsidiary of Galimmo Real Estate.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Paris"
    },
    "GDVTZ": {
        "short_name": "GOULD INVESTORS L P",
        "long_name": "Gould Investors L.P.",
        "summary": "Gould Investors L.P. owns and operates a portfolio of real estate assets in the United States. Its real estate assets include office and professional buildings, apartment buildings, shopping centers, mixed-use properties, cooperative and condominium apartments, industrial facilities, and single tenant retail properties. The company has investments in publicly traded and private entities in related fields. It also provides various services that include locating and evaluating potential acquisitions, market area analyses and feasibility studies, renovation, leasing and/or repositioning of commercial and residential properties, property management, property and apartment sales, and formulating acquisition and disposition strategies. Gould Investors L.P. was incorporated in 1985 and is based in Great Neck, New York. The company has properties in Connecticut, District of Columbia, Florida, Iowa, Maryland, Massachusetts, New York, North Carolina, Pennsylvania, and Texas.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Great Neck"
    },
    "GFW1.F": {
        "short_name": "CHIN.SANDI HLDG.LTD.HD-01",
        "long_name": "China Sandi Holdings Limited",
        "summary": "China Sandi Holdings Limited, an investment holding company, engages in the investment and development of properties in the People's Republic of China. The company operates in Property Development, Property Investment, and Hotel Operation segments. It is also involved in the leasing of investment properties and providing property management services. In addition, the company provides hotel accommodation and catering services. Further, it engages in the securities trading. It owns and leases shopping malls, hotels, office units, commercial units, kindergartens, and car parking facilities. The Company was formerly known as China Grand Forestry Green Resources Group Limited and changed its name to China Sandi Holdings Limited in October 2012. China Sandi Holdings Limited is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "GICSAB.MX": {
        "short_name": "GRUPO GICSA SAB DE CV",
        "long_name": "Grupo Gicsa, S.A. de C.V.",
        "summary": "Grupo Gicsa, S.A. de C.V. develops real estate properties in Mexico. It also provides construction and renovation services to new and existing projects; services to rental properties; and real estate management, operation, and maintenance services. The company was founded in 1989 and is based in Mexico City, Mexico.",
        "currency": "MXN",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Mexico",
        "city": "Mexico City"
    },
    "GODREJPROP.NS": {
        "short_name": "GODREJ PROPERTIES",
        "long_name": "Godrej Properties Limited",
        "summary": "Godrej Properties Limited, together with its subsidiaries, primarily engages in the real estate construction, development, and other related activities in India. It develops residential, commercial, and township projects. Godrej Properties Limited was incorporated in 1985 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "GSHP3.SA": {
        "short_name": "GENERALSHOPPON      NM",
        "long_name": "General Shopping e Outlets do Brasil S.A.",
        "summary": "General Shopping e Outlets do Brasil S.A. owns and manages various kinds of shopping centers in Brazil. It leases commercial, advertising, and promotional space; manages shopping center parking lots; and plans and leases electrical and water supply equipment. The company also provides web server, multimedia communication, and voice over internet protocol services; leases security equipment and video cameras; and develops real estate properties and ventures. In addition, it engages in the development and management of retail and wholesale trade activities, as well as acquisition, creation, and management of companies in retail industry, master franchises, and franchising companies; and purchase, sale, and lease of equipment for generation, transfer, and distribution of energy, as well as provision of installation, maintenance, and consulting services. Further, the company purchases, sells, leases, develops, builds, and manages its own or third party real estate or jointly owned real estate properties; and leases water exploration, treatment, and distribution equipment, as well as provides installation, maintenance, and consultancy services. It manages 14 shopping centers. The company was formerly known as General Shopping Brasil S.A. The company was founded in 1989 and is headquartered in SÃ£o Paulo, Brazil. General Shopping e Outlets do Brasil S.A. is a subsidiary of Golf ParticipaÃ§Ãµes Ltda.",
        "currency": "BRL",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "GZT.TA": {
        "short_name": "GAZIT GLOBE",
        "long_name": "Gazit Globe Ltd",
        "summary": "Gazit Globe, Ltd, through its subsidiaries, owns, develops, and operates supermarket-anchored shopping centers and retail-based mixed-use properties in North America, Brazil, Israel, and Europe. It owns and operates 103 properties covering an area of approximately 2.5 million square meters. The company was incorporated in 1982 and is headquartered in Tel Aviv, Israel. Gazit Globe Ltd operates as a subsidiary of Norstar Holdings Inc.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "GZTGF": {
        "short_name": "GAZIT GLOBE",
        "long_name": "Gazit Globe Ltd",
        "summary": "Gazit Globe, Ltd, through its subsidiaries, owns, develops, and operates supermarket-anchored shopping centers and retail-based mixed-use properties in North America, Brazil, Israel, and Europe. It owns and operates 103 properties covering an area of approximately 2.5 million square meters. The company was incorporated in 1982 and is headquartered in Tel Aviv, Israel. Gazit Globe Ltd operates as a subsidiary of Norstar Holdings Inc.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "HALS.ME": {
        "short_name": "SG-DEVELOPMENT PJS",
        "long_name": "Public Joint Stock Company SG-Development",
        "summary": "Public Joint Stock Company HALS-Development engages in the development and rental of real estate properties in Russia. The company develops residential and commercial projects. Its projects portfolio includes residential complexes, business quarters, shopping centers, mixed-use complexes, and landmark urban facilities, including Children's Dreamhouse Mall, SkyLight Business Center, and Danilovsky Fort Business Center. The company is based in Moscow, Russia. Public Joint Stock Company HALS-Development is a subsidiary of VTB Bank public joint-stock company.",
        "currency": "RUB",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    },
    "HDIL.NS": {
        "short_name": "HOUSING DEVELOPMEN",
        "long_name": "Housing Development and Infrastructure Limited",
        "summary": "Housing Development and Infrastructure Limited engages in the real estate construction, development, and other related activities in India. Its residential projects include apartment complexes, towers, and townships; commercial projects comprise office spaces and multiplex cinemas; and retail projects consists of shopping malls. The company also develops slum rehabilitation projects. Housing Development and Infrastructure Limited was incorporated in 1996 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "HEMIPROP.NS": {
        "short_name": "Hemisphere Prop Ind Ltd",
        "long_name": "Hemisphere Properties India Limited",
        "summary": "Hemisphere Properties India Limited operates as a real estate company in India. It owns or leases various properties, as well as has access to 739.69 acres of land. The company was incorporated in 2005 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "HFVA.F": {
        "short_name": "HUFVUDSTADEN A  SK 5",
        "long_name": "Hufvudstaden AB (publ)",
        "summary": "Hufvudstaden AB (publ) engages in the ownership, development, and management of commercial properties in Stockholm and Gothenburg, Sweden. The company operates in two segments, Property Management and Parking Operations. It owns and manages offices, retail stores, and restaurant properties, as well as multi-storey car parks. The company operates its properties primarily under the NK, Bibliotekstan, Femman, Norrmalmstorg 1, Birger Jarlspassagen, Fredstan, and Nordstan brands. As of December 31, 2019, it owned approximately 29 properties with a rentable floor space of 384,200 square meters, including 278,800 square meters in Stockholm and 105,400 square meters in Gothenburg. The company was founded in 1915 and is based in Stockholm, Sweden.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "HGPI": {
        "short_name": "HORIZON GROUP PROPERTIES INC",
        "long_name": "Horizon Group Properties, Inc.",
        "summary": "Horizon Group Properties, Inc. is a publicly owned real estate investment trust. The firm engages in the ownership, operation, and development of shopping centers in the United States. It operates through a subsidiary, Horizon Group Properties LP. Horizon Group Properties was founded in 1998 and is based in Rosemont, Illinois with additional offices in Muskegon, Michigan and Chicago, Illinois. Horizon Group Properties Inc. (OTCPK: HGPI) operates independently of Prime Retail Inc. as of June 17, 1998.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Rosemont"
    },
    "HHC": {
        "short_name": "Howard Hughes Corporation (The)",
        "long_name": "The Howard Hughes Corporation",
        "summary": "The Howard Hughes Corporation owns, manages, and develops commercial, residential, and hospitality operating properties in the United States. It operates through four segments: Operating Assets, Master Planned Communities (MPCs), Seaport District, and Strategic Developments. The Operating Assets segment owns 14 retail, 32 office, nine multi-family, and three hospitality properties, as well as 13 other operating assets and investments primarily located and around The Woodlands, Texas; Columbia, Maryland; New York, New York; Las Vegas, Nevada; and Honolulu, HawaiÂ\u0091i. The MPCs segment develops and sells residential and commercial land. This segment sells residential land designated for detached and attached single family homes ranging from entry-level to luxury homes; and commercial land parcels designated for retail, office, hospitality, and high density residential projects, as well as services and other for-profit activities, and parcels designated for use by government, schools, and other not-for-profit entities. As of December 31, 2019, this segment had 9,943 remaining saleable acres of land. The Seaport District segment is involved in the landlord operations, managed businesses, and events and sponsorships. The Strategic Development segment comprises residential condominium and commercial property projects. This segment consist of 21 development or redevelopment projects. The company was founded in 2010 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Dallas"
    },
    "HHE.F": {
        "short_name": "HOWARD HUGHES CORP.DL-,01",
        "long_name": "The Howard Hughes Corporation",
        "summary": "The Howard Hughes Corporation owns, manages, and develops commercial, residential, and hospitality operating properties in the United States. It operates through four segments: Operating Assets, Master Planned Communities (MPCs), Seaport District, and Strategic Developments. The Operating Assets segment owns 14 retail, 32 office, nine multi-family, and three hospitality properties, as well as 13 other operating assets and investments primarily located and around The Woodlands, Texas; Columbia, Maryland; New York, New York; Las Vegas, Nevada; and Honolulu, HawaiÂ\u0091i. The MPCs segment develops and sells residential and commercial land. This segment sells residential land designated for detached and attached single family homes ranging from entry-level to luxury homes; and commercial land parcels designated for retail, office, hospitality, and high density residential projects, as well as services and other for-profit activities, and parcels designated for use by government, schools, and other not-for-profit entities. As of December 31, 2019, this segment had 9,943 remaining saleable acres of land. The Seaport District segment is involved in the landlord operations, managed businesses, and events and sponsorships. The Strategic Development segment comprises residential condominium and commercial property projects. This segment consist of 21 development or redevelopment projects. The company was founded in 2010 and is headquartered in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Dallas"
    },
    "HIAG.SW": {
        "short_name": "HIAG IMMOBILIEN N",
        "long_name": "HIAG Immobilien Holding AG",
        "summary": "HIAG Immobilien Holding AG, together with its subsidiaries, engages in the management and redevelopment of properties in Switzerland. The company operates through Yielding Portfolio, Redevelopment Portfolio, Cloud Services, and Others segments. Its property portfolio includes industrial and commercial, residential, retail, building land, distribution and logistics, office, and other properties. The company also offers metal recycling services; and technology to independent partners based on multi-cloud platform. In addition, it is involved in the management, asset management, and technical administrative management of the pension funds, as well as provides human resources services to third parties. The company was founded in 1876 and is headquartered in Basel, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Basel"
    },
    "HKR.F": {
        "short_name": "HKR INTL LTD  HD-,25",
        "long_name": "HKR International Limited",
        "summary": "HKR International Limited, an investment holding company, invests in, develops, and manages real estate properties in Hong Kong, Macau, Mainland China, Japan, and South East Asia. It operates in five segments: Property Development, Property Investment, Services Provided, Hotel Operations, and Healthcare. The company primarily develops and manages residential, commercial, and industrial properties, as well as leisure projects. It also owns, operates, and manages hotels; and a healthcare service network, including chronic disease management and integrated medical centers, Chinese medicine centers, dental clinics, medical diagnostic centers, and medical network services. In addition, the company offers transportation services in Discovery Bay, including ferry, land transport, and tunnel operations; operates clubs; and invests in securities. Further, HKR International Limited provides cancer treatment and diagnostic imaging, commercial leasing agency, property agency, bus and garage, dental health and care, and project management services; corporate consultancy services to healthcare operating units; and financial services to first hand purchasers of properties in Discovery Bay, as well as trades in medical and dental equipment and supplies. Additionally, the company engages in the operation of a shipyard and road tunnel; and diabetes and endocrine disorders clinics, as well as acts as an estate manager and principal lessee of communication network in Discovery Bay. HKR International Limited was founded in 1977 and is based in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "HLU.F": {
        "short_name": "HANG LUNG GR",
        "long_name": "Hang Lung Group Limited",
        "summary": "Hang Lung Group Limited, an investment holding company, operates as a property developer in Hong Kong and Mainland China. The company operates through four segments: Property Leasing in Mainland China, Property Leasing in Hong Kong, property sales in mainland China, and Property Sales in Hong Kong. It develops properties for sale and lease, such as large-scale mall, commercial, office, and residential developments. The company also invests in various properties, including shopping mall, office, residential, serviced apartments, and carparks. Its investment properties portfolio includes Grand Gateway 66, a mall/commercial, office, and residential complex, as well as Plaza 66, a commercial and office complex in Shanghai; Parc 66 in Jinan; Center 66 in Wuxi; Riverside 66 in Tianjin; Olympia 66 in Dalian; Palace 66 and Forum 66 in Shenyang; Spring City 66 in Kunming; Westlake 66; and Heartland 66 in Wuhan. In addition, the company offers car park and property management, securities trading, financial, project management, and property agency services; as well as operates and manages apartment. Hang Lung Group Limited was founded in 1960 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "HNLGF": {
        "short_name": "HANG LUNG GROUP",
        "long_name": "Hang Lung Group Limited",
        "summary": "Hang Lung Group Limited, an investment holding company, operates as a property developer in Hong Kong and Mainland China. The company operates through four segments: Property Leasing in Mainland China, Property Leasing in Hong Kong, property sales in mainland China, and Property Sales in Hong Kong. It develops properties for sale and lease, such as large-scale mall, commercial, office, and residential developments. The company also invests in various properties, including shopping mall, office, residential, serviced apartments, and carparks. Its investment properties portfolio includes Grand Gateway 66, a mall/commercial, office, and residential complex, as well as Plaza 66, a commercial and office complex in Shanghai; Parc 66 in Jinan; Center 66 in Wuxi; Riverside 66 in Tianjin; Olympia 66 in Dalian; Palace 66 and Forum 66 in Shenyang; Spring City 66 in Kunming; Westlake 66; and Heartland 66 in Wuhan. In addition, the company offers car park and property management, securities trading, financial, project management, and property agency services; as well as operates and manages apartment. Hang Lung Group Limited was founded in 1960 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "HNLGY": {
        "short_name": "HANG LUNG GROUP",
        "long_name": "Hang Lung Group Limited",
        "summary": "Hang Lung Group Limited, an investment holding company, operates as a property developer in Hong Kong and Mainland China. The company operates through four segments: Property Leasing in Mainland China, Property Leasing in Hong Kong, property sales in mainland China, and Property Sales in Hong Kong. It develops properties for sale and lease, such as large-scale mall, commercial, office, and residential developments. The company also invests in various properties, including shopping mall, office, residential, serviced apartments, and carparks. Its investment properties portfolio includes Grand Gateway 66, a mall/commercial, office, and residential complex, as well as Plaza 66, a commercial and office complex in Shanghai; Parc 66 in Jinan; Center 66 in Wuxi; Riverside 66 in Tianjin; Olympia 66 in Dalian; Palace 66 and Forum 66 in Shenyang; Spring City 66 in Kunming; Westlake 66; and Heartland 66 in Wuhan. In addition, the company offers car park and property management, securities trading, financial, project management, and property agency services; as well as operates and manages apartment. Hang Lung Group Limited was founded in 1960 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "HOOB": {
        "short_name": "HOLOBEAM INC",
        "long_name": "Holobeam, Inc.",
        "summary": "Holobeam, Inc. engages in the rental and development of real estate properties in New Jersey. As of September 30, 2006, it leased two buildings for retail use. The company was founded in 1967 and is headquartered in Ho-Ho-Kus, New Jersey.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Ho-Ho-Kus"
    },
    "HUFAF": {
        "short_name": "HUFVUDSTADEN AB",
        "long_name": "Hufvudstaden AB (publ)",
        "summary": "Hufvudstaden AB (publ) engages in the ownership, development, and management of commercial properties in Stockholm and Gothenburg, Sweden. The company operates in two segments, Property Management and Parking Operations. It owns and manages offices, retail stores, and restaurant properties, as well as multi-storey car parks. The company operates its properties primarily under the NK, Bibliotekstan, Femman, Norrmalmstorg 1, Birger Jarlspassagen, Fredstan, and Nordstan brands. As of December 31, 2019, it owned approximately 29 properties with a rentable floor space of 384,200 square meters, including 278,800 square meters in Stockholm and 105,400 square meters in Gothenburg. The company was founded in 1915 and is based in Stockholm, Sweden.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "HUFV-A.ST": {
        "short_name": "Hufvudstaden AB ser. A",
        "long_name": "Hufvudstaden AB (publ)",
        "summary": "Hufvudstaden AB (publ) engages in the ownership, development, and management of commercial properties in Stockholm and Gothenburg, Sweden. The company operates in two segments, Property Management and Parking Operations. It owns and manages offices, retail stores, and restaurant properties, as well as multi-storey car parks. The company operates its properties primarily under the NK, Bibliotekstan, Femman, Norrmalmstorg 1, Birger Jarlspassagen, Fredstan, and Nordstan brands. As of December 31, 2019, it owned approximately 29 properties with a rentable floor space of 384,200 square meters, including 278,800 square meters in Stockholm and 105,400 square meters in Gothenburg. The company was founded in 1915 and is based in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "HZJ.F": {
        "short_name": "HEIWA REAL ESTATE",
        "long_name": "Heiwa Real Estate Co., Ltd.",
        "summary": "Heiwa Real Estate Co., Ltd. operates as a real estate company in Japan. The company develops, leases, administrates, and manages stock exchange buildings, office buildings, commercial facilities, and residential buildings; develops and sells residential buildings; and provides real estate agency services. It is also involved in the building facility maintenance and management, repair work contracting, civil engineering and construction contracting, property management, investment management, real estate brokerage, and insurance agency businesses. In addition, the company engages in the operation of halls and conference rooms, and parking lots; and management of restaurants. Heiwa Real Estate Co., Ltd. was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "IDVV": {
        "short_name": "INTERNATIONAL ENDEAVORS CORP",
        "long_name": "International Endeavors Corp",
        "summary": "International Endeavors Corp creates, manufactures, and markets technology for the cannabis industry. It focuses on building patented technology that supports the rapid deployment of agricultural infrastructure and the equipment needed for the medical marijuana and legal cannabis industry. The company was founded in 2014 and is based in Temecula, California.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Temecula"
    },
    "IHLGM.IS": {
        "short_name": "IHLAS GAYRIMENKUL",
        "long_name": "Ihlas Gayrimenkul Proje Gelistirme ve Ticaret A.S.",
        "summary": "Ihlas Gayrimenkul Proje Gelistirme ve Ticaret A.S. engages in the mining, construction, marketing, and energy businesses. The company is based in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "city": "Istanbul"
    },
    "IIA.VI": {
        "short_name": "IMMOFINANZ AG",
        "long_name": "IMMOFINANZ AG",
        "summary": "IMMOFINANZ AG acquires, develops, owns, rents, and manages properties primarily in Austria, Germany, Poland, the Czech Republic, Slovakia, Romania, and Hungary. It develops office, retail, and other properties. The company manages offices under myhive brand; retail parks under STOP SHOP brand; and shopping centers under VIVO! brand. As of December 31, 2019, it had a property portfolio of approximately 213 properties. The company is headquartered in Vienna, Austria.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Austria",
        "city": "Vienna"
    },
    "IMO1.F": {
        "short_name": "IMMOFINANZ AG INH.",
        "long_name": "IMMOFINANZ AG",
        "summary": "IMMOFINANZ AG acquires, develops, owns, rents, and manages properties primarily in Austria, Germany, Poland, the Czech Republic, Slovakia, Romania, and Hungary. It develops office, retail, and other properties. The company manages offices under myhive brand; retail parks under STOP SHOP brand; and shopping centers under VIVO! brand. As of December 31, 2019, it had a property portfolio of approximately 213 properties. The company is headquartered in Vienna, Austria.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Austria",
        "city": "Vienna"
    },
    "ISRS.TA": {
        "short_name": "ISRAS INVESTMNT CO",
        "long_name": "Isras Investment Company Ltd",
        "summary": "Isras Investment Company Ltd operates in the real estate sector in Israel. The company operates through Income Producing Real Estate, Residential Real Estate and Real Estate for Sale, and Others segments. It engages in the planning, development, rental, and management of residential and construction projects, as well as infrastructure and construction activities. The company also operates other real estate projects. Isras Investment Company Ltd markets its products through direct and external marketing factors and brokers. It serves high-tech companies, trading and services industries, and individuals. The company was founded in 1950 and is based in Tel Aviv, Israel. Isras Investment Company Ltd is a subsidiary of Arad Investment & Industrial Development Ltd.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "JDAN.CO": {
        "short_name": "Jeudan A/S",
        "long_name": "Jeudan A/S",
        "summary": "Jeudan A/S provides property services in Denmark. The company invests in and operates office, residential, and retail properties. The company also provides a range of property-related consulting and building services, as well as car parking services. Jeudan A/S was founded in 1898 and is based in Copenhagen, Denmark.",
        "currency": "DKK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "CPH",
        "market": "dk_market",
        "country": "Denmark",
        "city": "Copenhagen"
    },
    "JHSF3.SA": {
        "short_name": "JHSF PART   ON      NM",
        "long_name": "JHSF Participações S.A.",
        "summary": "JHSF ParticipaÃ§Ãµes S.A., through its subsidiaries, engages in the development and administration of shopping centers, hotels, and airports. The company operates through Recurring Income, Real Estate Business and Airport, and Hotels and Restaurants segments. It develops large-scale mixed-use residential and commercial buildings; provides mall services, such as administration, parking, and supply of energy and telecommunications; operation and management of airfield; and operates retail stores, as well as hotels and restaurants. The company operates shopping centers under the JHSF, Fazenda Boa Vista, Cidade Jardim Mall, and Catarina Fashion Outlet names; 7 hotels and 27 restaurants and bars under the Fasano brand. The company was founded in 2006 and is headquartered in SÃ£o Paulo, Brazil.",
        "currency": "BRL",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "JOE": {
        "short_name": "St. Joe Company (The)",
        "long_name": "The St. Joe Company",
        "summary": "The St. Joe Company, together with its subsidiaries, operates as a real estate development, asset management, and operating company in Northwest Florida, the United States. It operates through four segments: Residential Real Estate, Hospitality, Commercial Leasing and Sales, and Forestry. The Residential Real Estate segment plans and develops residential communities of various sizes. It primarily sells developed homesites and parcels of entitled undeveloped land. The Hospitality segment owns and operates a private membership club, hotel operations, food and beverage operations, golf courses, beach clubs, retail outlets, gulf-front vacation rentals, management services, marinas, and other entertainment assets. The Commercial Leasing and Sales segment constructs and leases multi-family, retail, office, and commercial properties, as well as cell towers and other assets. It also plans, develops, entitles, manages, and sells commercial land holdings for retail, office, hotel, assisted-living, multi-family, and industrial uses. The Forestry segment grows and sells pulpwood, saw timber, and other forest products. As of December 31, 2019, it had approximately 175,000 acres in Northwest Florida. The St. Joe Company was founded in 1936 and is headquartered in Watersound, Florida.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Watersound"
    },
    "KLED.ST": {
        "short_name": "Kungsleden AB",
        "long_name": "Kungsleden AB (publ)",
        "summary": "Kungsleden are people that create places and experiences for people. By developing and managing attractive and sustainable places, we offer people better and more inspiring work experience. We are a long-term property owner focused on commercial properties in Sweden's growth regions. As of 30 September 2020, we owned 211 properties with total value of SEK 39,872 million.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "KLOV-A.ST": {
        "short_name": "Klvern AB Ser. A",
        "long_name": "Klövern AB (publ)",
        "summary": "KlÃ¶vern AB (publ) operates as a real estate company in Sweden. It has approximately 350 properties that have a total lettable area of approximately 2.5 million square meters. The company primarily focuses on renting offices, as well as offer premises for companies and organizations in healthcare, education, and retail; and warehousing and logistics. In addition, it works with projects of a housing development. The company is based in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "KLOV-B.ST": {
        "short_name": "Klvern AB Ser. B",
        "long_name": "Klövern AB (publ)",
        "summary": "KlÃ¶vern AB (publ) operates as a real estate company in Sweden. It has approximately 350 properties that have a total lettable area of approximately 2.5 million square meters. The company primarily focuses on renting offices, as well as offer premises for companies and organizations in healthcare, education, and retail; and warehousing and logistics. In addition, it works with projects of a housing development. The company is based in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "KLOV-PREF.ST": {
        "short_name": "Klvern AB pref",
        "long_name": "Klövern AB (publ)",
        "summary": "KlÃ¶vern AB (publ) operates as a real estate company in Sweden. It has approximately 350 properties that have a total lettable area of approximately 2.5 million square meters. The company primarily focuses on renting offices, as well as offer premises for companies and organizations in healthcare, education, and retail; and warehousing and logistics. In addition, it works with projects of a housing development. The company is based in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "LAACZ": {
        "short_name": "LAACO LTD",
        "long_name": "LAACO, Ltd.",
        "summary": "LAACO, Ltd. is a California limited acquires, develops, builds, and manages self-storage facilities in the southwestern United States. It offers storage spaces for rent, on a month-to-month basis for personal and business uses. The company also owns land, buildings, and marina facilities, which include the Los Angeles Athletic Club (LAAC), a membership club consisting of athletic facilities, food and beverage operations, and a 72-room hotel; and California Yacht Club, a membership club consisting of sports facilities, food and beverage operations, and a 350-slip marina. In addition, it has interests in three parking facilities located adjacent to the LAAC building. As of December 31, 2013, the company had direct and indirect equity interests in 48 self-storage facilities under Storage West trade name in Southern California, Arizona, Nevada, and Texas. LAACO, Ltd. was founded in 1986 and is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "LCOMF": {
        "short_name": "LIFESTYLE COMMUNITIES LIMITED",
        "long_name": "Lifestyle Communities Limited",
        "summary": "Lifestyle Communities Limited, together with its subsidiaries, develops, owns, and manages affordable independent living residential land lease communities for working, semi-retired, or retired people in Australia. The company was founded in 2003 and is based in South Melbourne, Australia.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "LH-R.BK": {
        "short_name": "LAND AND HOUSES PUBLIC COMPANY ",
        "long_name": "Land and Houses Public Company Limited",
        "summary": "Land and Houses Public Company Limited engages in the property development activities in Thailand and the United States. It operates in two segments, Real Estate Business, and Rental and Service Business. The Real Estate Business segment develops and sells single detached houses, townhouses, and residence condominium projects. The Rental and Service Business segment is involved in the rental of shopping malls, hotels, and apartments. The company also offers project administration and management, and investment advisory services. Land and Houses Public Company Limited was founded in 1973 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "LHOG.F": {
        "short_name": "LD + HOUSES PCL FGN  BA 1",
        "long_name": "Land and Houses Public Company Limited",
        "summary": "Land and Houses Public Company Limited engages in the property development activities in Thailand and the United States. It operates in two segments, Real Estate Business, and Rental and Service Business. The Real Estate Business segment develops and sells single detached houses, townhouses, and residence condominium projects. The Rental and Service Business segment is involved in the rental of shopping malls, hotels, and apartments. The company also offers project administration and management, and investment advisory services. Land and Houses Public Company Limited was founded in 1973 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "LJ3.SI": {
        "short_name": "OUE",
        "long_name": "OUE Limited",
        "summary": "OUE Limited, an investment holding company, develops, owns, and operates various real estate properties in Singapore, the People's Republic of China, the United States, Japan, and internationally. The company operates through Property Investments, Hospitality, Property Development, Healthcare, and Consumer segments. It develops and manages assets across the commercial, hospitality, retail, residential, and healthcare sectors. The company also engages in the rental of investment properties; development and sale of residential and other properties; operation of hotels; provision of hotel management services; management of real estate investment trusts; and operation of food and beverage outlets. In addition, it develops medical real estate, healthcare-related assets, and integrated mixed-use developments; provides healthcare services; and management of healthcare investments trusts. Further, the company is involved in the restaurant and investment trading operations; and operation and management of healthcare facilities, including 12 nursing homes. The company was formerly known as Overseas Union Enterprise Limited and changed its name to OUE Limited in August 2013. The company was incorporated in 1964 and is based in Singapore. OUE Limited is a subsidiary of OUE Realty Pte. Ltd.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "LLC.AX": {
        "short_name": "LEND LEASE STAPLED",
        "long_name": "Lendlease Group",
        "summary": "Lendlease Group provides property and infrastructure solutions in Australia, Asia, Europe, and the Americas. It operates through Development, Construction, and Investments segments. The Development segment develops communities, inner city mixed use developments, apartments, retirement, retail, commercial assets, and social and economic infrastructure. The Construction segment provides project management, design, and construction services primarily in the infrastructure, defense, mixed use, commercial, and residential sectors. The Investments segment owns and/or manages investments, including property and infrastructure co-investments, retirement livings, and the U.S. military housings. Lendlease Group was founded in 1958 and is headquartered in Barangaroo, Australia.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Barangaroo"
    },
    "LLESF": {
        "short_name": "LENDLEASE CORPORATION LIMITED",
        "long_name": "Lendlease Group",
        "summary": "Lendlease Group provides property and infrastructure solutions in Australia, Asia, Europe, and the Americas. It operates through Development, Construction, and Investments segments. The Development segment develops communities, inner city mixed use developments, apartments, retirement, retail, commercial assets, and social and economic infrastructure. The Construction segment provides project management, design, and construction services primarily in the infrastructure, defense, mixed use, commercial, and residential sectors. The Investments segment owns and/or manages investments, including property and infrastructure co-investments, retirement livings, and the U.S. military housings. Lendlease Group was founded in 1958 and is headquartered in Barangaroo, Australia.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Barangaroo"
    },
    "LLESY": {
        "short_name": "LENDLEASE CORPORATION LIMITED",
        "long_name": "Lendlease Group",
        "summary": "Lendlease Group provides property and infrastructure solutions in Australia, Asia, Europe, and the Americas. It operates through Development, Construction, and Investments segments. The Development segment develops communities, inner city mixed use developments, apartments, retirement, retail, commercial assets, and social and economic infrastructure. The Construction segment provides project management, design, and construction services primarily in the infrastructure, defense, mixed use, commercial, and residential sectors. The Investments segment owns and/or manages investments, including property and infrastructure co-investments, retirement livings, and the U.S. military housings. Lendlease Group was founded in 1958 and is headquartered in Barangaroo, Australia.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Barangaroo"
    },
    "LOGG3.SA": {
        "short_name": "LOG COM PROPON      NM",
        "long_name": "LOG Commercial Properties e Participações S.A.",
        "summary": "LOG Commercial Properties e ParticipaÃ§Ãµes S.A. engages in the development, construction, and rental of commercial properties in Brazil. The company offers logistics condominiums, shopping centers, and strip malls, as well as allots industrial plots. It also engages in the provision of engineering and construction services for residential and/or commercial properties and real estate consulting services. The company was formerly known as MRV LogÃ­stica E ParticipaÃ§Ãµes S.A. LOG Commercial Properties e ParticipaÃ§Ãµes S.A. was incorporated in 2008 and is headquartered in Belo Horizonte, Brazil.",
        "currency": "BRL",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "Belo Horizonte"
    },
    "MAG.ST": {
        "short_name": "Magnolia Bostad AB",
        "long_name": "Magnolia Bostad AB (publ)",
        "summary": "Magnolia Bostad AB (publ), through its subsidiaries, acquires and develops properties into rental and tenant-owned apartments, hotels, residential care homes, and community service properties. It also provides property management services. The company was founded in 2009 and is headquartered in Stockholm, Sweden. Magnolia Bostad AB (publ) is a subsidiary of F. HolmstrÃ¶m Fastigheter AB.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "MFU.F": {
        "short_name": "MITSUI FUDOSAN LTD",
        "long_name": "Mitsui Fudosan Co., Ltd.",
        "summary": "Mitsui Fudosan Co., Ltd. operates as a real estate company in Japan. It operates through four segments: Leasing, Property Sales, Management, and Other. The Leasing segment leases office buildings and commercial facilities, and other properties. The Property Sales segment is involved in the sale of condominiums and detached housing to individuals; and rental housing and office buildings and other to investors.  The Management segment engages in the property management and brokerage and asset management businesses. The Other segment engages in the housing construction and renovation business; and housing related material sales business. The company also offers car park leasing services; and operates hotels, golf courses, and resort facilities. In addition, it engages in the renewal work for offices and retail facilities; and electricity transmission and distribution and heat supply businesses, as well as operates as a retailer of flowers and ornamental plants, seeds, and other gardening products. The company was founded in 1941 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "MGOR.TA": {
        "short_name": "MEGA OR HOLDINGS L",
        "long_name": "Mega Or Holdings Ltd",
        "summary": "Mega Or Holdings Ltd develops, manages, and rents real estate properties in Israel. It primarily develops and manages logistic, commercial, and future centers. The company was formerly known as Zahi Nahmias Holdings Ltd. and changed its name to Mega Or Holdings Ltd in May 2006. Mega Or Holdings Ltd was founded in 2002 and is based in Modi'in, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Hevel Modi'in"
    },
    "MITEF": {
        "short_name": "MITSUBISHI ESTATE CO",
        "long_name": "Mitsubishi Estate Co., Ltd.",
        "summary": "Mitsubishi Estate Co., Ltd. engages in the real estate activities in Japan and internationally. The company is involved in the development, leasing, property management, and sale of office buildings; planning, development, and tenant leasing of retail facilities/outlets; investment, development, operational management, and asset management of logistics facilities; operation of 13 hotels under the Royal Park Hotels brand in Japan and the Marunouchi Hotel in the Marunouchi area; and operation of Takamatsu Airport, Miyako Shimojishima Airport Terminal, Mt. Fuji Shizuoka Airport, and seven airports in Hokkaido. It also engages in the development and rebuilding, redevelopment, purchasing and sale, brokerage, and management of condominiums; and rental of apartments. In addition, the company provides real estate investment trust, as well as private placement funds management services. Further, it offers architectural design and engineering services, including construction, civil engineering, and urban and regional development planning and consulting. Additionally, the company provides real estate problem-solving solutions, such as real estate brokerage, condominium and office building leasing management support, and real estate appraisal. Mitsubishi Estate Co., Ltd. was founded in 1890 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "MITEY": {
        "short_name": "MITSUBISHI ESTATE CO",
        "long_name": "Mitsubishi Estate Co., Ltd.",
        "summary": "Mitsubishi Estate Co., Ltd. engages in the real estate activities in Japan and internationally. The company is involved in the development, leasing, property management, and sale of office buildings; planning, development, and tenant leasing of retail facilities/outlets; investment, development, operational management, and asset management of logistics facilities; operation of 13 hotels under the Royal Park Hotels brand in Japan and the Marunouchi Hotel in the Marunouchi area; and operation of Takamatsu Airport, Miyako Shimojishima Airport Terminal, Mt. Fuji Shizuoka Airport, and seven airports in Hokkaido. It also engages in the development and rebuilding, redevelopment, purchasing and sale, brokerage, and management of condominiums; and rental of apartments. In addition, the company provides real estate investment trust, as well as private placement funds management services. Further, it offers architectural design and engineering services, including construction, civil engineering, and urban and regional development planning and consulting. Additionally, the company provides real estate problem-solving solutions, such as real estate brokerage, condominium and office building leasing management support, and real estate appraisal. Mitsubishi Estate Co., Ltd. was founded in 1890 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "MNPP": {
        "short_name": "MERCHANTS NATIONAL PROPERTIES I",
        "long_name": "Merchants' National Properties, Inc.",
        "summary": "Merchants' National Properties, Inc. owns, manages, develops, and leases various commercial real estate properties in the United States. Its asset portfolio includes shopping centers, office buildings, and other commercial real estate properties. The company also invests in various real estate ventures. It holds interests in 67 properties in 17 states across the continental United States. The company was incorporated in 1928 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "MOBN.SW": {
        "short_name": "MOBIMO N",
        "long_name": "Mobimo Holding AG",
        "summary": "Mobimo Holding AG operates as a real estate company in Switzerland. It operates through two segments, Real Estate and Development. The Real Estate segment is involved in the long-term holding, operation, and management of investment properties, including commercial, industrial, and residential properties; provision of tenant support services; and marketing of residential, commercial, and retail space. This segment also offers facility management and related services for third-party customers. As of December 31, 2019, it had 139 properties. The Development segment develops, constructs, and sells condominiums; and develops turn-key real estate investments for institutional and private investors, as well as provides development services, including area, site, and project developments. The company was founded in 1999 and is headquartered in Lucerne, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Lucerne"
    },
    "MOTOGENFIN.NS": {
        "short_name": "MOTOR & GEN FINANC",
        "long_name": "The Motor & General Finance Limited",
        "summary": "The Motor & General Finance Limited engages in leasing and developing real estate properties in India. The company was incorporated in 1930 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "MRC.TO": {
        "short_name": "MORGUARD CORP.",
        "long_name": "Morguard Corporation",
        "summary": "Morguard Corporation, a real estate investment and management corporation, acquires, owns, and develops real estate properties in Canada and the United States. As of February 20, 2020, the company owned a portfolio of 207 multi-suite residential, retail, office, industrial, and hotel properties that comprised 17,637 residential suites, approximately 17.2 million square feet of commercial leasable space, and 5,903 hotel rooms. It also offers real estate management services, including acquisitions, development, dispositions, leasing, performance measurement, and asset and property management; real estate advisory services; and investment products across equity, fixed-income, and balanced portfolios to institutional clients and private investors. The company is headquartered in Mississauga, Canada. Morguard Corporation is a subsidiary of Paros Enterprises Limited.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Mississauga"
    },
    "MTSFF": {
        "short_name": "MITSUI FUDOSAN",
        "long_name": "Mitsui Fudosan Co., Ltd.",
        "summary": "Mitsui Fudosan Co., Ltd. operates as a real estate company in Japan. It operates through four segments: Leasing, Property Sales, Management, and Other. The Leasing segment leases office buildings and commercial facilities, and other properties. The Property Sales segment is involved in the sale of condominiums and detached housing to individuals; and rental housing and office buildings and other to investors.  The Management segment engages in the property management and brokerage and asset management businesses. The Other segment engages in the housing construction and renovation business; and housing related material sales business. The company also offers car park leasing services; and operates hotels, golf courses, and resort facilities. In addition, it engages in the renewal work for offices and retail facilities; and electricity transmission and distribution and heat supply businesses, as well as operates as a retailer of flowers and ornamental plants, seeds, and other gardening products. The company was founded in 1941 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "MTSFY": {
        "short_name": "MITSUI FUDOSAN",
        "long_name": "Mitsui Fudosan Co., Ltd.",
        "summary": "Mitsui Fudosan Co., Ltd. operates as a real estate company in Japan. It operates through four segments: Leasing, Property Sales, Management, and Other. The Leasing segment leases office buildings and commercial facilities, and other properties. The Property Sales segment is involved in the sale of condominiums and detached housing to individuals; and rental housing and office buildings and other to investors.  The Management segment engages in the property management and brokerage and asset management businesses. The Other segment engages in the housing construction and renovation business; and housing related material sales business. The company also offers car park leasing services; and operates hotels, golf courses, and resort facilities. In addition, it engages in the renewal work for offices and retail facilities; and electricity transmission and distribution and heat supply businesses, as well as operates as a retailer of flowers and ornamental plants, seeds, and other gardening products. The company was founded in 1941 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "N3R.F": {
        "short_name": "NEPI ROCKCASTLE  EO -,01",
        "long_name": "NEPI Rockcastle plc",
        "summary": "The Group has an exceptional property portfolio with dominant position in Romania, Poland and Slovakia and strong presence in Croatia, Bulgaria, Hungary, Czech Republic, Serbia and Lithuania. NEPI Rockcastle's shares are listed on Johannesburg Stock Exchange Limited (JSE) and Euronext Amsterdam, and its bonds are listed on the Irish Stock Exchange. The Group is investment-grade rated by Standard & Poor's (BBB, stable outlook), Fitch (BBB, stable outlook) and Moody's (Baa3, stable outlook).",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Isle of Man",
        "city": "Douglas"
    },
    "NCH-R.BK": {
        "short_name": "N. C. HOUSING PUBLIC COMPANY LI",
        "long_name": "N.C. Housing Public Company Limited",
        "summary": "N.C. Housing Public Company Limited operates as a property development company in Thailand. It develops and sells land, single detached houses, duplexes, townhouses, condominiums, and others; provides contractor, construction, and project and property management services; rents space in club houses, etc.; and operates health rehabilitation and senior care centers, etc. The company was founded in 1963 and is based in Pathum Thani, Thailand. N.C. Housing Public Company Limited is a subsidiary of NCH 2555 Holding Company Limited.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Pathum Thani"
    },
    "NCH.BK": {
        "short_name": "N. C. HOUSING PUBLIC COMPANY LI",
        "long_name": "N.C. Housing Public Company Limited",
        "summary": "N.C. Housing Public Company Limited operates as a property development company in Thailand. It develops and sells land, single detached houses, duplexes, townhouses, condominiums, and others; provides contractor, construction, and project and property management services; rents space in club houses, etc.; and operates health rehabilitation and senior care centers, etc. The company was founded in 1963 and is based in Pathum Thani, Thailand. N.C. Housing Public Company Limited is a subsidiary of NCH 2555 Holding Company Limited.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Pathum Thani"
    },
    "NDVLY": {
        "short_name": "NEW WORLD DEVELOPMENT CO",
        "long_name": "New World Development Company Limited",
        "summary": "New World Development Company Limited, an investment holding company, engages in the property development and investment business in Hong Kong and internationally. Its property portfolio comprises residential, retail, office, and industrial properties. The company also provides commercial aircraft leasing services; operates expressways; and constructs residential and commercial projects, as well as provides protection and savings-related life and medical insurance products. In addition, it is involved in the duty free operation and general trading, civil engineering, loyalty program, marketing, promotion, fashion retailing and trading, and piling and ground investigation businesses; development and operation of sports park; operation of household goods shop and convenience store; sale of LED lighting products and systems; and trading of telecommunication system integration products. Further, the company manages Hong Kong Convention and Exhibition Centre; operates hotels, golf and tennis academies, and shopping malls; operates department stores; and provides information technology, healthcare, training course, ticketing, financial, project management, management, advertising and media related, business and investment consultancy, franchised and non-franchised bus, estate agency, wellness and rehabilitation, endoscopic, carpark management, supply chain management, and catering services, as well as property agency, management, and consultancy services. Additionally, the company undertakes faÃ§ade and foundation works; and offers elderly residential and nursing care services. As of June 30, 2020, the company had a total of 17 hotel properties with approximately 7,400 rooms in Hong Kong, Mainland China, and the Southeast Asia. New World Development Company Limited was founded in 1970 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "NEN": {
        "short_name": "New England Realty Associates L",
        "long_name": "New England Realty Associates Limited Partnership",
        "summary": "New England Realty Associates Limited Partnership engages in acquiring, developing, holding for investment, operating, and selling real estate properties in the United States. It owns and operates various residential apartment, condominium units, and commercial properties located in Massachusetts and New Hampshire. As of February 1, 2020, the company owned 2,892 residential apartment units in 25 residential and mixed-use complexes, and 19 condominium units in a residential condominium complex located primarily in the metropolitan Boston area of Massachusetts. It also owned a commercial shopping center in Framingham, Massachusetts; one commercial building in Newton and one in Brookline, Massachusetts; commercial space in mixed-use buildings in Boston, Brockton and Newton, and Massachusetts; and 40% to 50% ownership interest in 7 residential and mixed use complexes with a total of 688 residential units, one commercial unit, and a 50 car parking lot. NewReal, Inc. serves as the general partner of the company. New England Realty Associates Limited Partnership was founded in 1977 and is headquartered in Allston, Massachusetts.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "city": "Allston"
    },
    "NIHK": {
        "short_name": "VIDEO RIVER NETWORKS INC",
        "long_name": "Video River Networks, Inc.",
        "summary": "Video River Networks, Inc., a specialty real estate holding company, focuses on the acquisition, ownership, and management of specialized industrial properties. The company was formerly known as Nighthawk Systems, Inc. and changed its name to Video River Networks, Inc. in March 2011. Video River Networks, Inc. is based in Torrance, California.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Torrance"
    },
    "NQ9.F": {
        "short_name": "NEXITY  EO 5",
        "long_name": "Nexity SA",
        "summary": "Nexity SA operates as a real estate company in Europe and internationally. The company operates through Individual Clients Division, Commercial Clients Division, and Other Activities segments. It develops new homes and subdivisions; and new or refurbished office buildings, high-rises, business parks, logistics facilities, retail property, and hotels. The company also provides property management services comprising rental management, sales and lettings, and managing agent services; manages serviced residences for students and for seniors; distributes real estate products; offers real estate brokerage, financial advisory, and insurance advisory services; real estate services, including rental management and property management, consultancy, and rental of short-duration work spaces. In addition, it engages in the villes and projets, and pre-development urban regeneration project activities; administration, coordination, and development of real estate franchise networks for individual clients; investment activities, as well as startup in the incubation phase. Additionally, it serves as a partner for local authorities for the design and execution of urban projects or large-scale urban regeneration schemes. Nexity SA was founded in 1995 and is based in Paris, France.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "city": "Paris"
    },
    "NREN.SW": {
        "short_name": "Novavest Real Estate N",
        "long_name": "Novavest Real Estate AG",
        "summary": "Novavest Real Estate AG engages in the real estate activities in Switzerland. It develops, rents, and manages residential, mixed used, and office and commercial properties; courthouses, community buildings, schools, shopping centers, and hotels or leisure facilities; industrial plants; and conversion and renovation properties. The company is based in Zurich, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Zurich"
    },
    "NRP.AS": {
        "short_name": "NEPI ROCKCASTLE",
        "long_name": "NEPI Rockcastle plc",
        "summary": "The Group has an exceptional property portfolio with dominant position in Romania, Poland and Slovakia and strong presence in Croatia, Bulgaria, Hungary, Czech Republic, Serbia and Lithuania. NEPI Rockcastle's shares are listed on Johannesburg Stock Exchange Limited (JSE) and Euronext Amsterdam, and its bonds are listed on the Irish Stock Exchange. The Group is investment-grade rated by Standard & Poor's (BBB, stable outlook), Fitch (BBB, stable outlook) and Moody's (Baa3, stable outlook).",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "AMS",
        "market": "nl_market",
        "country": "Isle of Man",
        "city": "Douglas"
    },
    "NRP.JO": {
        "short_name": "NEPI Rockcastle Plc",
        "long_name": "NEPI Rockcastle plc",
        "summary": "The Group has an exceptional property portfolio with dominant position in Romania, Poland and Slovakia and strong presence in Croatia, Bulgaria, Hungary, Czech Republic, Serbia and Lithuania. NEPI Rockcastle's shares are listed on Johannesburg Stock Exchange Limited (JSE) and Euronext Amsterdam, and its bonds are listed on the Irish Stock Exchange. The Group is investment-grade rated by Standard & Poor's (BBB, stable outlook), Fitch (BBB, stable outlook) and Moody's (Baa3, stable outlook).",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JNB",
        "market": "za_market",
        "country": "Isle of Man",
        "city": "Douglas"
    },
    "NVAH.F": {
        "short_name": "LAND + HOUSE -NVDR-  BA 1",
        "long_name": "Land and Houses Public Company Limited",
        "summary": "Land and Houses Public Company Limited engages in the property development activities in Thailand and the United States. It operates in two segments, Real Estate Business, and Rental and Service Business. The Real Estate Business segment develops and sells single detached houses, townhouses, and residence condominium projects. The Rental and Service Business segment is involved in the rental of shopping malls, hotels, and apartments. The company also offers project administration and management, and investment advisory services. Land and Houses Public Company Limited was founded in 1973 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "NWWDF": {
        "short_name": "NEW WORLD DEVELOPMENT CO",
        "long_name": "New World Development Company Limited",
        "summary": "New World Development Company Limited, an investment holding company, engages in the property development and investment business in Hong Kong and internationally. Its property portfolio comprises residential, retail, office, and industrial properties. The company also provides commercial aircraft leasing services; operates expressways; and constructs residential and commercial projects, as well as provides protection and savings-related life and medical insurance products. In addition, it is involved in the duty free operation and general trading, civil engineering, loyalty program, marketing, promotion, fashion retailing and trading, and piling and ground investigation businesses; development and operation of sports park; operation of household goods shop and convenience store; sale of LED lighting products and systems; and trading of telecommunication system integration products. Further, the company manages Hong Kong Convention and Exhibition Centre; operates hotels, golf and tennis academies, and shopping malls; operates department stores; and provides information technology, healthcare, training course, ticketing, financial, project management, management, advertising and media related, business and investment consultancy, franchised and non-franchised bus, estate agency, wellness and rehabilitation, endoscopic, carpark management, supply chain management, and catering services, as well as property agency, management, and consultancy services. Additionally, the company undertakes faÃ§ade and foundation works; and offers elderly residential and nursing care services. As of June 30, 2020, the company had a total of 17 hotel properties with approximately 7,400 rooms in Hong Kong, Mainland China, and the Southeast Asia. New World Development Company Limited was founded in 1970 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "NXI.PA": {
        "short_name": "NEXITY",
        "long_name": "Nexity SA",
        "summary": "Nexity SA operates as a real estate company in Europe and internationally. The company operates through Individual Clients Division, Commercial Clients Division, and Other Activities segments. It develops new homes and subdivisions; and new or refurbished office buildings, high-rises, business parks, logistics facilities, retail property, and hotels. The company also provides property management services comprising rental management, sales and lettings, and managing agent services; manages serviced residences for students and for seniors; distributes real estate products; offers real estate brokerage, financial advisory, and insurance advisory services; real estate services, including rental management and property management, consultancy, and rental of short-duration work spaces. In addition, it engages in the villes and projets, and pre-development urban regeneration project activities; administration, coordination, and development of real estate franchise networks for individual clients; investment activities, as well as startup in the incubation phase. Additionally, it serves as a partner for local authorities for the design and execution of urban projects or large-scale urban regeneration schemes. Nexity SA was founded in 1995 and is based in Paris, France.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Paris"
    },
    "NYTTO-PREF.ST": {
        "short_name": null,
        "long_name": "Svenska Nyttobostäder AB (publ)",
        "summary": "Svenska NyttobostÃ¤der AB (publ) owns and manages residential properties in Sweden. The company's tenants include private individuals, companies, and authorities. Its management portfolio consists of 5,752 homes. The company is headquartered in Stockholm, Sweden. Svenska NyttobostÃ¤der AB (publ) is a subsidiary of ALM Equity AB.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "NYTTO.ST": {
        "short_name": null,
        "long_name": "Svenska Nyttobostäder AB (publ)",
        "summary": "Svenska NyttobostÃ¤der AB (publ) owns and manages residential properties in Sweden. The company's tenants include private individuals, companies, and authorities. Its management portfolio consists of 5,752 homes. The company is headquartered in Stockholm, Sweden. Svenska NyttobostÃ¤der AB (publ) is a subsidiary of ALM Equity AB.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "OIHC.F": {
        "short_name": "CSI PROPERT.SUBDIV.HD-008",
        "long_name": "CSI Properties Limited",
        "summary": "CSI Properties Limited, an investment holding company, engages in the property development and investment activities in Hong Kong, Singapore, the People's Republic of China, and Macau. The company operates through four segments: Commercial Property Holding, Residential Property Holding, Macau Property Holding, and Securities Investment. It invests and trades in commercial and residential properties. The company is also involved in securities trading and investment activities; issuing bonds; treasury management; and provision of management and property management services. CSI Properties Limited is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "OUE1.F": {
        "short_name": "OUE SD-.20",
        "long_name": "OUE Limited",
        "summary": "OUE Limited, an investment holding company, develops, owns, and operates various real estate properties in Singapore, the People's Republic of China, the United States, Japan, and internationally. The company operates through Property Investments, Hospitality, Property Development, Healthcare, and Consumer segments. It develops and manages assets across the commercial, hospitality, retail, residential, and healthcare sectors. The company also engages in the rental of investment properties; development and sale of residential and other properties; operation of hotels; provision of hotel management services; management of real estate investment trusts; and operation of food and beverage outlets. In addition, it develops medical real estate, healthcare-related assets, and integrated mixed-use developments; provides healthcare services; and management of healthcare investments trusts. Further, the company is involved in the restaurant and investment trading operations; and operation and management of healthcare facilities, including 12 nursing homes. The company was formerly known as Overseas Union Enterprise Limited and changed its name to OUE Limited in August 2013. The company was incorporated in 1964 and is based in Singapore. OUE Limited is a subsidiary of OUE Realty Pte. Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "PAMG.JK": {
        "short_name": "Bima Sakti Pertiwi Tbk.",
        "long_name": "PT Bima Sakti Pertiwi Tbk",
        "summary": "PT Bima Sakti Pertiwi Tbk operates as a property developer in Riau. The company was founded in 1980 and is based in Pekanbaru, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Pekanbaru"
    },
    "PCLI": {
        "short_name": "PROTOCALL TECHNOLOGIES INC",
        "long_name": "Protocall Technologies Inc.",
        "summary": "Protocall Technologies Inc. develops and commercializes an electronic sell-through platform that enables retailers to produce DVD movie, consumer software, and video game products in retail packaging at their stores and Website distribution centers. It offers TitleMatch DVD On-Demand, which offers retailers a virtual inventory of digital media products, which can be produced on-demand, thereby eliminating the cost of physical inventories. The company also uses its solutions to provide outsourced fulfillment services to Web retailers whereby digital media product orders are electronically routed to the company for on-demand production and shipment to the retailer's customer. Protocall Technologies Inc. was founded in 1992 and is based in Panama City Beach, Florida.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Panama City Beach"
    },
    "PIKK.ME": {
        "short_name": "PIK GROUP PJSC",
        "long_name": "PIK Group Public Joint Stock Company",
        "summary": "PIK Group Public Joint Stock Company develops, constructs, and sells residential real estate properties in Russia. It operates through six segments: Development, Commercial Construction, Maintenance, Industrial, Proptech, and Others. The company engages in the construction of houses and neighborhoods; production of building materials, including reinforced concrete house panels, window frames, and other construction elements; prefabricated panel buildings; and production and sale of IoT-devices. It also provides maintenance and technical support services for residential buildings and other properties; technical maintenance services for utility systems and rendering heating, water supply, water discharge, and electricity; and internet access services. The company provides apartment rental, repair of premises, and agency services for the sale of residential apartments, as well as construction services for third party. The company was founded in 1994 and is headquartered in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    },
    "PKG1T.TL": {
        "short_name": "Pro Kapital Grupp",
        "long_name": "AS Pro Kapital Grupp",
        "summary": "AS Pro Kapital Grupp, a real estate development company, develops, manages, purchases, and sells large-scale commercial and residential real estate properties in Estonia, Latvia, and Lithuania. The company develops and sells apartments in residential real estate properties; develops and leases retail and office premises, as well as develops shopping and entertainment centers in Tallinn; and provides maintenance and other services. It also operates a hotel in Germany. AS Pro Kapital Grupp was founded in 1994 and is based in Tallinn, Estonia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "city": "Tallinn"
    },
    "PLFF": {
        "short_name": "ORPHEUM PROPERTY INC",
        "long_name": "Orpheum Property, Inc.",
        "summary": "Orpheum Property, Inc. engages in the development and renovation of commercial property. It also leases space. The company was founded in 1994 and is based in New Orleans, Louisiana.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New Orleans"
    },
    "PRESTIGE.NS": {
        "short_name": "PRESTIGE ESTATES P",
        "long_name": "Prestige Estates Projects Limited",
        "summary": "Prestige Estates Projects Limited, together with its subsidiaries, engages in the development, construction, and leasing of real estate properties in India. The company develops a range of residential projects, including townships, apartments, luxury villas, mansions, row houses, town homes and golf developments; commercial projects comprising office spaces, built-to-suit campuses, special economic zones, and IT parks; and retail properties, such as malls. It also develops and owns hospitality properties, which include resorts, convention centers and serviced apartments, and hotels. In addition, Prestige Estates Projects Limited provides real estate services that comprise fit-out services, interior design and execution, facilities and property management, and project and construction management services. The company was founded in 1986 and is headquartered in Bengaluru, India. Prestige Estates Projects Limited is a subsidiary of Razack Family Trust.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "PROZONINTU.NS": {
        "short_name": "PROZONE INTU PROPE",
        "long_name": "Prozone Intu Properties Limited",
        "summary": "Prozone Intu Properties Limited designs, develops, owns, and operates shopping malls, and commercial and residential premises in India. The company operates through Leasing and Outright Sales segments. It develops regional shopping and entertainment centers; and mixed-use residential townships and commercial office blocks, as well as provides related management consultancy services. The company was formerly known as Prozone Capital Shopping Centres Limited and changed its name to Prozone Intu Properties Limited in July 2014. Prozone Intu Properties Limited was incorporated in 2007 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "PSPN.SW": {
        "short_name": "PSP N",
        "long_name": "PSP Swiss Property AG",
        "summary": "PSP Swiss Property AG, together with its subsidiaries, owns and operates real estate properties in Switzerland. It operates through Real Estate Investments and Property Management segments. The company owns, operates, and leases office, retail and commercial, and storage properties; and parking spaces. It owns 162 office and commercial properties; and 12 development sites and individual projects primarily in Zurich, Geneva, Basel, Bern, and Lausanne. PSP Swiss Property AG was founded in 1999 and is based in Zug, Switzerland.",
        "currency": "CHF",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Zug"
    },
    "PSPSF": {
        "short_name": "PSP SWISS PROPERTY AG",
        "long_name": "PSP Swiss Property AG",
        "summary": "PSP Swiss Property AG, together with its subsidiaries, owns and operates real estate properties in Switzerland. It operates through Real Estate Investments and Property Management segments. The company owns, operates, and leases office, retail and commercial, and storage properties; and parking spaces. It owns 162 office and commercial properties; and 12 development sites and individual projects primarily in Zurich, Geneva, Basel, Bern, and Lausanne. PSP Swiss Property AG was founded in 1999 and is based in Zug, Switzerland.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Switzerland",
        "city": "Zug"
    },
    "PTBL.TA": {
        "short_name": "PROPERTY & BLDG",
        "long_name": "Property and Building Corp. Ltd",
        "summary": "Property and Building Corp. Ltd., together with its subsidiaries, operates as a real estate company in Israel and internationally. The company operates through Income Producing Properties in Israel, Income Producing Properties in USA, and Residential Construction in Israel segments. It develops, plans, builds, leases, and manages high tech parks, commercial and industrial parks, office buildings, retail centers, logistics and industrial buildings, and storage and parking lots, as well as holds land reserves for construction; acquires, develops, leases, manages, and maintains income-producing properties; and develops, plans, constructs, markets, and sells residential projects and neighborhoods. The company is based in Tel Aviv, Israel. Property and Building Corp. Ltd. operates as a subsidiary of Discount Investment Corporation Ltd.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "QH-R.BK": {
        "short_name": "QUALITY HOUSES PUBLIC COMPANY L",
        "long_name": "Quality Houses Public Company Limited",
        "summary": "Quality Houses Public Company Limited, together with its subsidiaries, engages in the property development business in Thailand. It operates in four segments: Real Estate Business, Hotel Business, Rental Business, and Others. The company develops and sells land and houses, and condominium units; rents office buildings; and services residential buildings. It also engages in hotel operations; management of serviced apartments; lease of land; and management of public utilities of real estate business and land owners, as well as the manufacture and distribution of precast concrete. The company was incorporated in 1983 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "QH.BK": {
        "short_name": "QUALITY HOUSES PUBLIC COMPANY L",
        "long_name": "Quality Houses Public Company Limited",
        "summary": "Quality Houses Public Company Limited, together with its subsidiaries, engages in the property development business in Thailand. It operates in four segments: Real Estate Business, Hotel Business, Rental Business, and Others. The company develops and sells land and houses, and condominium units; rents office buildings; and services residential buildings. It also engages in hotel operations; management of serviced apartments; lease of land; and management of public utilities of real estate business and land owners, as well as the manufacture and distribution of precast concrete. The company was incorporated in 1983 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "RANI.TA": {
        "short_name": "RANI ZIM SHOPPING",
        "long_name": "Rani Zim Shopping Centers Ltd",
        "summary": "Rani Zim Shopping Centers Ltd, together with its subsidiaries, engages in the development, construction, and management of commercial projects in Israel. It operates, manages, and rents shopping centers. The company is based in Petah Tikva, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Petah Tikva"
    },
    "RHGN.F": {
        "short_name": "CN AGRI-PRODS EXCH.HK-,01",
        "long_name": "China Agri-Products Exchange Limited",
        "summary": "China Agri-Products Exchange Limited, an investment holding company, engages in the investment, development, construction, operation, and management of agricultural wholesale markets in the People's Republic of China. The company operates in two segments, Agricultural Produce Exchange Market Operation and Property Sales. It operates various agricultural markets, including the Wuhan Baisazhou agricultural and by-product exchange market located in Wuhan City, Hongshan District; the Yulin Hongjin agricultural and by-product exchange market in Guangxi Zhuang Autonomous Region; the Luoyang Hongjin agricultural and by-product exchange market located in Henan Province; the Xuzhou agricultural and by-product exchange market in the northern part of Jiangsu Province; Puyang Hongjin agricultural and by-product exchange market located in Henan Province; Kaifeng Hongjin agricultural and by-product exchange market located in Henan Province; Qinzhou Hongjin agricultural and by-product exchange market in the Guangxi Region; Huangshi Hongjin agricultural and by-product exchange market in Hubei Province; Huai'an Market in Jiangsu Province; Panjin Market in Liaoning Province; and Suizhou Market located in Suizhou city. The company also sells properties; offers financial services; and operates agricultural logistics center to provide distribution and logistics services in central China. China Agri-Products Exchange Limited is headquartered in Kowloon Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Kowloon Bay"
    },
    "RLP.V": {
        "short_name": "REALIA PROPERTIES INC",
        "long_name": "Realia Properties Inc.",
        "summary": "Realia Properties Inc. engages in the ownership of real property interests in the United States. It focuses on retail/ commercial properties and community centers. The company was formerly known as TitanStar Properties Inc. and changed its name to Realia Properties, Inc. in October 2019. Realia Properties Inc. was founded in 2008 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "SC-R.BK": {
        "short_name": "SC ASSET CORPORATION PUBLIC COM",
        "long_name": "SC Asset Corporation Public Company Limited",
        "summary": "SC Asset Corporation Public Company Limited, together with its subsidiaries, operates as a real estate development company in Thailand. The company operates through Real Estates sales; Rental and Rendering of Services; and Consulting and Management Service segments. It develops and sells single detached houses, townhomes, and condominiums, as well as home offices; and rents office and technical buildings. It also provides consulting and management services. The company was founded in 1989 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SPHXF": {
        "short_name": "SM PRIME HOLDINGS INC",
        "long_name": "SM Prime Holdings, Inc.",
        "summary": "SM Prime Holdings, Inc., together with its subsidiaries, develops, conducts, operates, and maintains shopping center spaces in the Philippines, China, and Southeast Asia. The company operates through four segments: Mall, Residential, Commercial, and Hotels and Convention Centers. It leases mall and food court; and sells cinema tickets, as well as offers amusement services, including bowling and ice skating. The company is also involved in the development and sale of residential properties, such as houses and leisure homes; development and leasing of office buildings, as well as the operation and management of office buildings and other land holdings; and development and management of various hotel and convention center properties. As of December 31, 2019, it had 8 hotels with 1,961 rooms located in Tagaytay City, Iloilo, Pampanga, Cebu City, Davao City, Hamilo Coast, Quezon City, and Pasay City, as well as 4 convention centers and 3 trade halls with 37,357 square meters of leasable space; and 74 malls in the Philippines and 7 malls in China. The company was founded in 1994 and is based in Pasay City, the Philippines.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "city": "Pasay City"
    },
    "SRRE": {
        "short_name": "SUNRISE REAL ESTATE GROUP INC",
        "long_name": "Sunrise Real Estate Group, Inc.",
        "summary": "Sunrise Real Estate Group, Inc., together with its subsidiaries, provides real estate development and property brokerage services in the People's Republic of China. It offers real estate marketing, property leasing, and property management services. The company also engages in marketing and sales agency operations, which include services, such as integrated marketing planning, advertising planning and execution, and sales planning and execution; and real estate investment activities. In addition, it is involved in entity investment and fund management activities; and financial and consultancy services. The company was formerly known as Sunrise Real Estate Development Group, Inc. and changed its name to Sunrise Real Estate Group, Inc. in May 2006. Sunrise Real Estate Group, Inc. was founded in 1996 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    },
    "STEF-B.ST": {
        "short_name": "Stendrren Fastigheter AB",
        "long_name": "Stendörren Fastigheter AB (publ)",
        "summary": "StendÃ¶rren Fastigheter AB (publ) operates as a real estate company. It owns, develops, and manages warehouses, logistics, industrial premises, and office spaces primarily located in Greater Stockholm and MÃ¤lardalen. The company was formerly known as Header Compression Sweden Holding AB and changed its name to StendÃ¶rren Fastigheter AB (publ) in November 2014. StendÃ¶rren Fastigheter AB (publ) was founded in 1995 and is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "STRS": {
        "short_name": "Stratus Properties Inc.",
        "long_name": "Stratus Properties Inc.",
        "summary": "Stratus Properties Inc., a real estate company, engages in the acquisition, entitlement, development, management, operation, and sale of commercial, and multi-and single-family residential real estate properties primarily in Austin, Texas. The company operates through two segments, Real Estate Operations and Leasing Operations. Its leasing operations cover lease of space at retail and mixed-use properties; and residences in multi-family apartment complexes. Stratus Properties Inc. was founded in 1992 and is headquartered in Austin, Texas.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Austin"
    },
    "T8F.F": {
        "short_name": "TOKYU FUDOSAN HOLDINGS",
        "long_name": "Tokyu Fudosan Holdings Corporation",
        "summary": "Tokyu Fudosan Holdings Corporation, together with its subsidiaries, engages in the real estate business in Japan and internationally. The company operates through seven segments: Urban Development, Residential, Property Management, Real-Estate Agents, Wellness, Tokyu Hands, and Innovation Business segments. The Urban Development segment develops, leases, and operates office buildings, renewable energy power facilities, logistics facilities, and other properties; and sells properties for investors. The Residential segment develops and sells condominiums and detached housings. The Property Management segment manages, operates, and renovates condominiums, buildings, commercial facilities, public facilities, and public housings; and constructs common areas of condominiums. The Real-Estate Agents segment provides real estate brokerage and property sales services. The Wellness segment develops and sells membership resort hotels and country houses; and owns and manages resort facilities, urban style hotels, senior housings, and membership sports clubs. The Tokyu Hands segment is involved in the retail sale of materials and products for living and D-I-Y. The Innovation Business segment develops, sells, and leases condominiums and other properties, as well as constructs residential homes and others. Tokyu Fudosan Holdings Corporation was founded in 2013 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "TARA.JK": {
        "short_name": "Agung Semesta Sejahtera Tbk.",
        "long_name": "PT Sitara Propertindo Tbk",
        "summary": "PT Sitara Propertindo Tbk primarily engages in the development of properties in Indonesia. The company constructs commercial and residential properties. PT Sitara Propertindo Tbk company was founded in 2006 and is headquartered in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "West Jakarta"
    },
    "TDGYO.IS": {
        "short_name": "TREND GMYO",
        "long_name": "Trend Gayrimenkul Yatirim Ortakligi A.S.",
        "summary": "Trend Gayrimenkul Yatirim Ortakligi A.S. engages in the real estate business in Turkey and internationally. The company develops and constructs various real estate projects, such as houses, hotels, and residence and university buildings. It also provides real estate consultancy services. The company was formerly known as Anda Gayrimenkul Gelistirme ve Insaat Sanayi Ticaret Limited Sirketi and changed its name to Trend Gayrimenkul Yatirim Ortakligi A.S. in November 2017. Trend Gayrimenkul Yatirim Ortakligi A.S. was founded in 2006 and is based in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "city": "Istanbul"
    },
    "TNY1.SG": {
        "short_name": "China Merchants Land Ltd. Regis",
        "long_name": "China Merchants Land Limited",
        "summary": "China Merchants Land Limited, an investment holding company, engages in the investment, development, management, lease, and sale of properties. The company operates through Properties and Asset Management segments. Its property portfolio includes residential properties; and residential and commercial complex properties, such as apartments, villas, offices, retail shops, etc. The company also offers asset management services for office premises and shopping malls. As of December 31, 2019, its portfolio of property development projects includes 33 projects in Foshan, Guangzhou, Chongqing, Nanjing, Jurong, and Xi'an; and a land bank of approximately 5,954,429 square metres. The company was formerly known as Tonic Industries Holdings Limited. China Merchants Land Limited was founded in 1997 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "TPD1T.TL": {
        "short_name": "Trigon Property Development",
        "long_name": "AS Trigon Property Development",
        "summary": "AS Trigon Property Development operates as a real estate development company. It owns a real estate development project comprising 21 hectare area located in the City of PÃ¤rnu, Estonia, as well as rents land. The company was formerly known as AS Viisnurk and changed its name to AS Trigon Property Development in September 2007. AS Trigon Property Development is based in Tallinn, Estonia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "city": "Tallinn"
    },
    "TPHS": {
        "short_name": "Trinity Place Holdings Inc.",
        "long_name": "Trinity Place Holdings Inc.",
        "summary": "Trinity Place Holdings Inc., a real estate holding, investment, and asset management company, engages in commercial real estate business in the United States. The company's principal asset is located at 77 Greenwich Street in Lower Manhattan. It also owns a property occupied by a retail tenant in Paramus, New Jersey. The company also controls various intellectual property assets focused on the consumer sector, including its online marketplace at FilenesBasement.com, its rights to the Stanley Blacker brand, as well as the intellectual property associated with the running of the Brides event and An Educated Consumer. Trinity Place Holdings Inc. was founded in 1959 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "TQ5.SI": {
        "short_name": "FRASERS PROPERTY LIMITED",
        "long_name": "Frasers Property Limited",
        "summary": "Frasers Property Limited, an investment holding company, owns, develops, and manages an integrated portfolio of properties. The company's asset portfolio includes business parks; and residential, retail, commercial, and industrial and logistics properties in Australia, Europe, China, and Southeast Asia. It owns and/or operates serviced apartments and hotels in approximately 70 cities across Asia, Australia, Europe, the Middle East, and Africa. The company also acts as a sponsor of two real estate investment trusts (REITs) listed on the SGX-ST that comprises Frasers Centrepoint Trust, and Frasers Logistics & Commercial Trust focused on retail, commercial, and industrial properties; and one stapled trust listed on the SGX-ST that include Frasers Hospitality Trust focused on hospitality properties; and two REITs listed on the Stock Exchange of Thailand, which include Frasers Property (Thailand) Public Company Limited, a sponsor of Frasers Property Thailand Industrial Freehold & Leasehold REIT that focuses on industrial and logistics properties in Thailand, as well as Golden Ventures Leasehold Real Estate Investment Trust, which focuses on commercial properties. The company was formerly known as Frasers Centrepoint Limited and changed its name to Frasers Property Limited in February 2018. Frasers Property Limited was incorporated in 1963 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "TR61.F": {
        "short_name": "TMM REAL EST.DEV.GDR S 1",
        "long_name": "TMM Real Estate Development Plc",
        "summary": "TMM Real Estate Development Plc, together with its subsidiaries, engages in the construction and development of residential and business properties primarily in Kyiv and Kharkiv regions in Ukraine. It operates through Investment Property, Property Development and Construction, and Utility Services segments. The Investment Property segment leases owned residential and commercial properties. The Property Development and Construction segment builds and sells residential and commercial properties; and offers construction services. The Utility Services segment provides utility services to tenants. It also produces concrete; metal ware; windows and other glass constructions; and ventilating and air-conditioning systems, as well as offers engineering and maintenance services. In addition, the company provides a range of services, such as design, assembling, certification, commissioning, and servicing of communication, television, and buildings automatics systems, as well as fire control and security systems; and designs and installs low voltage circuits, computers, and telephone and television networks. The company was founded in 1992 and is based in Kyiv, Ukraine. TMM Real Estate Development Plc is a subsidiary of TMM Holdings Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ukraine",
        "city": "Kyiv"
    },
    "TRIAN-B.ST": {
        "short_name": "Fastighets AB Trianon ser. B",
        "long_name": "Fastighets AB Trianon (publ)",
        "summary": "Fastighets AB Trianon (publ), a real estate company, acquires, develops, builds, owns, and manages residential and commercial properties in Sweden. As of December 31, 2018, the company's property portfolio consisted of 54 properties located in MalmÃ¶ city centre, Limhamn/Slottsstaden, LindÃ¤ngen/Hermodsdal, RosengÃ¥rd, and Oxie. It also has a lettable area of approximately 271,856 square meters. The company was founded in 1973 and is based in MalmÃ¶, Sweden.",
        "currency": "SEK",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "MalmÃ¶"
    },
    "TTUUF": {
        "short_name": "TOKYU FUDOSAN HOLDINGS CORPORAT",
        "long_name": "Tokyu Fudosan Holdings Corporation",
        "summary": "Tokyu Fudosan Holdings Corporation, together with its subsidiaries, engages in the real estate business in Japan and internationally. The company operates through seven segments: Urban Development, Residential, Property Management, Real-Estate Agents, Wellness, Tokyu Hands, and Innovation Business segments. The Urban Development segment develops, leases, and operates office buildings, renewable energy power facilities, logistics facilities, and other properties; and sells properties for investors. The Residential segment develops and sells condominiums and detached housings. The Property Management segment manages, operates, and renovates condominiums, buildings, commercial facilities, public facilities, and public housings; and constructs common areas of condominiums. The Real-Estate Agents segment provides real estate brokerage and property sales services. The Wellness segment develops and sells membership resort hotels and country houses; and owns and manages resort facilities, urban style hotels, senior housings, and membership sports clubs. The Tokyu Hands segment is involved in the retail sale of materials and products for living and D-I-Y. The Innovation Business segment develops, sells, and leases condominiums and other properties, as well as constructs residential homes and others. Tokyu Fudosan Holdings Corporation was founded in 2013 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "TY2B.F": {
        "short_name": "CITYCON OYJ",
        "long_name": "Citycon Oyj",
        "summary": "Citycon Oyj, a real estate investment company, owns, develops, and manages retail, office space, and housing properties in the Nordic region. The company owns 40 centers and 1 other retail property. Citycon Oyj was founded in 1988 and is headquartered in Espoo, Finland.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "UAI.L": {
        "short_name": "U AND I GROUP PLC ORD 50P",
        "long_name": "U and I Group PLC",
        "summary": "U and I Group PLC, an investment holding company, develops, invests in, and trades real estate properties in the United Kingdom. The company operates through two divisions, Investment, and Development and Trading. Its property portfolio includes mixed-use regeneration projects, office buildings, residential and retail units, shopping centers, and commercial spaces. The company was formerly known as Development Securities PLC and changed its name to U and I Group PLC in October 2015. U and I Group PLC was incorporated in 1980 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "UFC.V": {
        "short_name": "URBANFUND CORP.",
        "long_name": "Urbanfund Corp.",
        "summary": "Urbanfund Corp. owns, develops, and operates a real estate portfolio for residential and commercial properties in Canada. The company also focuses on identifying and investing in real estate and real estate related projects. Its assets are located in Toronto, Brampton, Belleville, Kitchener, and London, Ontario; Quebec City and Montreal, Quebec; and Dartmouth, Nova Scotia. Urbanfund Corp. was incorporated in 1997 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "UG4.SG": {
        "short_name": "AS Trigon Property DevelopmentR",
        "long_name": "AS Trigon Property Development",
        "summary": "AS Trigon Property Development operates as a real estate development company. It owns a real estate development project comprising 21 hectare area located in the City of PÃ¤rnu, Estonia, as well as rents land. The company was formerly known as AS Viisnurk and changed its name to AS Trigon Property Development in September 2007. AS Trigon Property Development is based in Tallinn, Estonia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Estonia",
        "city": "Tallinn"
    },
    "UILCF": {
        "short_name": "UNITED INDUSTRIAL CORPORATION (",
        "long_name": "United Industrial Corporation Limited",
        "summary": "United Industrial Corporation Limited, an investment holding company, develops properties for investment and trading purposes in Singapore and internationally. The company operates through five segments: Property Investment, Property Trading, Hotel Operations, Technology Operations, and Others. It develops commercial office, commercial retail, and residential properties. The company also offers property management, project management, and marketing services; invests in and operates hotels; invests in retail centers; trades in computers and related products; retails computer hardware and software; and provides information technology, systems integration, and networking infrastructure services. In addition, it invests in shares and provides marketing, management and other related services. United Industrial Corporation Limited was incorporated in 1963 and is based in Singapore.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "VESTA.MX": {
        "short_name": "CORPORACION INMOBILIARIA VESTA ",
        "long_name": "Corporación Inmobiliaria Vesta S.A.B. de C.V.",
        "summary": "CorporaciÃ³n Inmobiliaria Vesta S.A.B. de C.V., together with its subsidiaries, acquires, develops, operates, and leases industrial buildings and distribution facilities in Mexico. CorporaciÃ³n Inmobiliaria Vesta S.A.B. de C.V. was founded in 1998 and is headquartered in Mexico City, Mexico.",
        "currency": "MXN",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Mexico",
        "city": "Mexico City"
    },
    "VESTF": {
        "short_name": "CORPORACION INMOBILIARIA VESTA ",
        "long_name": "Corporación Inmobiliaria Vesta S.A.B. de C.V.",
        "summary": "CorporaciÃ³n Inmobiliaria Vesta S.A.B. de C.V., together with its subsidiaries, acquires, develops, operates, and leases industrial buildings and distribution facilities in Mexico. CorporaciÃ³n Inmobiliaria Vesta S.A.B. de C.V. was founded in 1998 and is headquartered in Mexico City, Mexico.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Mexico",
        "city": "Mexico City"
    },
    "VINO": {
        "short_name": "GAUCHO GROUP HOLDINGS INC",
        "long_name": "Gaucho Group Holdings, Inc.",
        "summary": "Gaucho Group Holdings, Inc., through its subsidiaries, invests in, develops, and operates real estate projects in Argentina. The company also owns and operates Algodon Mansion, a luxury boutique hotel in Buenos Aires; and Algodon Wine Estates, a winery and golf resort with tennis courts, dining, and hotel amenities in Mendoza, as well as subdivides property for residential development. In addition, it manufactures and sells high-end luxury fashion products and accessories through an e-commerce platform. The company was formerly known as Algodon Group, Inc. and changed its name to Gaucho Group Holdings, Inc. in March 2019. Gaucho Group Holdings, Inc. was founded in 1999 and is based in Miami Beach, Florida.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Miami Beach"
    },
    "VIPULLTD.NS": {
        "short_name": "VIPUL LTD",
        "long_name": "Vipul Limited",
        "summary": "Vipul Limited engages in real estate development and services business in India. Its project portfolio includes residential, commercial, and retail projects, as well as integrated townships and lifestyle gated communities. The company was incorporated in 1991 and is headquartered in Gurugram, India.",
        "currency": "INR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "VVX.HM": {
        "short_name": "PALATIUM REAL EST.AG ST",
        "long_name": "Palatium Real Estate AG",
        "summary": "Palatium Real Estate AG engages in the acquisition and sale of land and buildings in Germany. It is also involved in the construction and sale of buildings for commercial or residential purposes; acquisition, management, and sale of assets of various kinds, including equity interests; and purchase and sale of precious metals and antiques. The company was formerly known as Volkmann VermÃ¶gens Verwaltungs AktienGesellschaft and changed its name to Palatium Real Estate AG in March 2016. Palatium Real Estate AG was founded in 1999 and is based in Hochspeyer, Germany.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HAM",
        "market": "dr_market",
        "country": "Germany",
        "city": "Hochspeyer"
    },
    "VVX1.HM": {
        "short_name": "PALATIUM REAL EST.AG VZO",
        "long_name": "Palatium Real Estate AG",
        "summary": "Palatium Real Estate AG engages in the acquisition and sale of land and buildings in Germany. It is also involved in the construction and sale of buildings for commercial or residential purposes; acquisition, management, and sale of assets of various kinds, including equity interests; and purchase and sale of precious metals and antiques. The company was formerly known as Volkmann VermÃ¶gens Verwaltungs AktienGesellschaft and changed its name to Palatium Real Estate AG in March 2016. Palatium Real Estate AG was founded in 1999 and is based in Hochspeyer, Germany.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HAM",
        "market": "dr_market",
        "country": "Germany",
        "city": "Hochspeyer"
    },
    "W05.SI": {
        "short_name": "Wing Tai",
        "long_name": "Wing Tai Holdings Limited",
        "summary": "Wing Tai Holdings Limited, an investment holding company, engages in the property investment and development, lifestyle retail, and hospitality management businesses in Singapore, Malaysia, Australia, Japan, and the People's Republic of China. The company develops and sells residential and commercial properties; and invests in and manages serviced residences under the Lanson Place brand name, as well as manages a boutique hotel in Hong Kong. It is also involved in the retail of garments; the provision of IT consultancy, and consultancy and advisory services; and project management and property maintenance activities, as well as development of e-commerce applications. The company was founded in 1955 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "WSP.L": {
        "short_name": "WYNNSTAY PROPERTIES PLC ORD 25P",
        "long_name": "Wynnstay Properties Plc",
        "summary": "Wynnstay Properties Plc engages in the investment, development, and management of properties in the United Kingdom. The company owns and manages office, retail, warehouse, and industrial properties in Southern England. Wynnstay Properties Plc was incorporated in 1886 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "XUN.F": {
        "short_name": "SHUN TAK HLDGS",
        "long_name": "Shun Tak Holdings Limited",
        "summary": "Shun Tak Holdings Limited, an investment holding company, engages in property, transportation, hospitality, and investment businesses in Hong Kong, Macau, Mainland China, and internationally. It develops and sells property; markets and leases retail, office, and residential properties; offers property management services for residential and commercial properties; and provides property cleaning, laundry, maintenance and repair, project works, hygiene care, pest control, waste management, legal advice, and financial management services. The company also offers passenger sea and land travel services across destinations within the Pearl River Delta connecting cities, such as Hong Kong, Shenzhen, Macau, Zhuhai, and Shekou under the TurboJET brand name. In addition, it operates hotels and golf clubs, entertainment attractions, and travel consultancies, as well as offers travel and MICE facilities; invests in gaming concessionaires; and operates toy stores under the ToysÂ\u0093RÂ\u0094Us name. Additionally, the company provides financing; hospitality management and auxiliary; and travel agency services. The company was founded in 1972 and is based in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "YEG.V": {
        "short_name": "YORKTON EQUITY GROUP INC",
        "long_name": "Yorkton Equity Group Inc.",
        "summary": "Yorkton Equity Group Inc. operates as a real estate development company with an investment property located in Edmonton, Alberta. The company is based in Edmonton, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": null
    },
    "YRIV": {
        "short_name": "YANGTZE RIVER PORT & LOGISTICS ",
        "long_name": "Yangtze River Port and Logistics Limited",
        "summary": "Yangtze River Port and Logistics Limited, through its subsidiary, Wuhan Yangtze River Newport Logistics Co., Ltd., primarily engages in the real estate and infrastructural development business in the People's Republic of China. It operates Wuhan Yangtze River Newport Logistics Center, a port logistics center located in Wuhan Newport Yangluo Port, Hubei Province of China. The company was formerly known as Yangtze River Development Limited and changed its name to Yangtze River Port and Logistics Limited in February 2018. Yangtze River Port and Logistics Limited is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    }
}