{
    "ATRS.VI": {
        "short_name": "ATRIUM EUROP.REAL EST.LTD",
        "long_name": "Atrium European Real Estate Limited",
        "summary": "Atrium European Real Estate Limited, together with its subsidiaries, owns, manages, and operates commercial real estate properties in the retail sector primarily in Poland, the Czech Republic, Slovakia, and Russia. The company operates in two segments, Standing Investment and Development. Its property portfolio includes food, fashion, and entertainment shopping centers. As of December 31, 2020, the company had 26 properties with a gross lettable area of approximately 809,000 thousand square meters. It is also involved in redevelopment activities, as well as activities related to land plots. The company was formerly known as Meinl European Land Limited and changed its name to Atrium European Real Estate Limited in May 2008. The company was incorporated in 1997 and is based in St. Helier, Jersey. Atrium European Real Estate Limited is a subsidiary of Gazit-Globe Ltd.",
        "currency": "EUR",
        "sector": "Financial",
        "industry": "Real Estate Development",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Jersey",
        "state": null,
        "city": "St. Helier",
        "zipcode": "JE2 4UH",
        "website": "http://www.aere.com",
        "market_cap": "Small Cap"
    },
    "LAMDA.AT": {
        "short_name": "LAMDA DEVELOPMENT S.A.",
        "long_name": "LAMDA Development S.A.",
        "summary": "LAMDA Development S.A., together with its subsidiaries, engages in the investment, development, and management of various real estate projects in Greece, Serbia, Romania, and Montenegro. Its development portfolio includes three shopping and leisure centers, including the Mall Athens and Golden Hall in Athens, as well as Mediterranean Cosmos in Thessaloniki; office complex in Greece and Romania; and Flisvos Marina in Faliro, as well as office buildings and residential complexes. The company was founded in 1977 and is headquartered in Marousi, Greece.",
        "currency": "EUR",
        "sector": "Financial",
        "industry": "Real Estate Development",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Marousi",
        "zipcode": "151 23",
        "website": "http://www.lamdadev.com",
        "market_cap": "Small Cap"
    },
    "WEG1.DE": {
        "short_name": "WESTGRUND AG",
        "long_name": "Westgrund AG",
        "summary": "Westgrund AG (DB:WEG1) is a real estate investment holding. Through its subsidiaries it focuses on investments in residential properties with 50 to 1,000 units and offers estate agent as well as property management services. The firm also seeks to acquire housing companies, estate agents, project development firms as well as real estate asset managers. Its geographical focus is Germany. The firm was founded in 1990 and is based in Remscheid, Germany. As of June 23, 2015, Westgrund Aktiengesellschaft operates as a subsidiary of ADLER Real Estate Aktiengesellschaft.",
        "currency": "EUR",
        "sector": "Financial",
        "industry": "Real Estate Development",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "state": null,
        "city": "Berlin",
        "zipcode": "10785",
        "website": "http://www.westgrund.de",
        "market_cap": "Small Cap"
    }
}