{
  "0DI.F": {
    "city": "Elkhart",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "LCI Industries",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LCI INDS  DL-,01",
    "state": "IN",
    "summary": "LCI Industries, together with its subsidiaries, manufactures and supplies components for the manufacturers of recreational vehicles (RVs) and adjacent industries in the United States and internationally. It operates in two segments, Original Equipment Manufacturers (OEM) and Aftermarket. The OEM segment manufactures and distributes a range of engineered components, such as steel chassis and related components; axles and suspension solutions; slide-out mechanisms and solutions; thermoformed bath, kitchen, and other products; vinyl, aluminum, and frameless windows; manual, electric, and hydraulic stabilizer and leveling systems; entry, luggage, patio, and ramp doors; furniture and mattresses; electric and manual entry steps; awnings and awning accessories; towing products; truck accessories; electronic components; and other accessories. This segment serves OEMs of RVs and adjacent industries, including buses; trailers used to haul boats, livestock, equipment, and other cargo; trucks; boats; trains; manufactured homes; and modular housing, as well as travel trailers, fifth-wheel travel trailers, folding camping trailers, and truck campers. The Aftermarket segment supplies various components of RV and adjacent industries to retail dealers, wholesale distributors, and service centers. This segment also sells replacement glass and awnings to fulfill insurance claims, biminis, covers, buoys, and fenders to the marine industry. The company was formerly known as Drew Industries Incorporated and changed its name to LCI Industries in December 2016. LCI Industries was incorporated in 1984 and is based in Elkhart, Indiana.",
    "website": "http://www.lci1.com",
    "zipcode": "46514"
  },
  "1SG.F": {
    "city": "Vonore",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "MasterCraft Boat Holdings, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MASTERCRAFT BOAT HLDGS",
    "state": "TN",
    "summary": "MasterCraft Boat Holdings, Inc., through its subsidiaries, designs, manufactures, and markets recreational powerboats. It operates through three segments: MasterCraft, NauticStar, and Crest. The MasterCraft segment produces recreational performance sport boats and luxury day boats under the MasterCraft and Aviara brands, which are used for water skiing, wakeboarding, and wake surfing, as well as general recreational boating. The NauticStar segment offers boats that are primarily used for saltwater fishing and general recreational boating. The Crest segment produces pontoon boats for use in general recreational boating. The company also offers various accessories, including trailers and aftermarket parts. It sells its boats through a network of independent dealers in North America and internationally. The company was formerly known as MCBC Holdings, Inc. and changed its name to MasterCraft Boat Holdings, Inc. in November 2018. MasterCraft Boat Holdings, Inc. was founded in 1968 and is based in Vonore, Tennessee.",
    "website": "http://www.mastercraft.com",
    "zipcode": "37885"
  },
  "53H.F": {
    "city": "Eugene",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "Arcimoto, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ARCIMOTO INC.",
    "state": "OR",
    "summary": "Arcimoto, Inc. designs, develops, manufactures, sells, and rents three-wheeled electric vehicles in the United States. Its flagship product is the Fun Utility Vehicle (FUV) that delivers a thrilling ride experience comfort for two passengers with cargo, parking, and operation. The company's products also comprise Rapid Responder designed to perform emergency, security, and law enforcement services; Deliverator, an electric last-mile delivery solution to get goods where they need to go; Cameo, an FUV equipped with a rear-facing rear seat and a modified roof built for on-road filming; and Arcimoto Roadster, an unparalleled pure-electric on-road thrill machine. The company was formerly known as WTP Incorporated and changed its name to Arcimoto, Inc. in December 2011. Arcimoto, Inc. was incorporated in 2007 and is headquartered in Eugene, Oregon.",
    "website": "http://www.arcimoto.com",
    "zipcode": "97402"
  },
  "603129.SS": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Recreational Vehicles",
    "long_name": "Zhejiang Cfmoto Power Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ZHEJIANG CF MOTO POWER CO LTD",
    "state": null,
    "summary": "Zhejiang Cfmoto Power Co.,Ltd develops, manufactures, and markets motorcycles, all-terrain vehicles, side-by-side utility vehicles, power sports engines, parts, gears, and apparel and accessories worldwide. The company was founded in 1989 and is based in Hangzhou, China.",
    "website": "http://www.cfmoto.com",
    "zipcode": "311100"
  },
  "603766.SS": {
    "city": "Chongqing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Recreational Vehicles",
    "long_name": "Loncin Motor Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LONCIN MOTOR CO LTD",
    "state": null,
    "summary": "Loncin Motor Co., Ltd. engages in the manufacture and sale of generating sets, agricultural machinery equipment, light-duty power units, and two-wheeled motorcycles in Japan. It offers motorcycles, motorcycle engines, recreational vehicles, premium engines, farm machinery; and engine parts. The company also provides large displacement engines; gasoline generators, water pumps, and tillers, as well as repair and maintenance services. It also exports its products. The company was founded in 1993 and is based in Chongqing, China. Loncin Motor Co., Ltd. is a subsidiary of Loncin Holdings Co., Ltd.",
    "website": "http://www.loncinindustries.com",
    "zipcode": "400052"
  },
  "603787.SS": {
    "city": "Wuxi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Recreational Vehicles",
    "long_name": "Jiangsu Xinri E-Vehicle Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "JIANGSU XINRI E-VEHICLE CO LTD",
    "state": null,
    "summary": "Jiangsu Xinri E-Vehicle Co., Ltd. engages in the research and development, production, and distribution of electric vehicles, and spare parts and components in China. It offers electric bikes, electric scooters, electric motorcycles, electric tricycles, and electric cars, as well as electric motors, batteries, controllers, and battery chargers. The company also exports its products to approximately 70 countries and regions. Jiangsu Xinri E-Vehicle Co., Ltd. was founded in 1999 and is headquartered in Wuxi, China.",
    "website": "http://www.xinri.com",
    "zipcode": "214106"
  },
  "736.F": {
    "city": "Dueville",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "Askoll Eva SpA",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ASKOLL EVA S.P.A.",
    "state": "VI",
    "summary": "Askoll Eva SpA engages in the manufacture and sale of electric vehicles in Italy. It provides pedal-assisted bikes, electric scooters, and accessories. The company is based in Dueville, Italy. Askoll Eva SpA is a subsidiary of Askoll Holding S.r.l.",
    "website": "http://www.askollelectric.com",
    "zipcode": "36031"
  },
  "APT.F": {
    "city": "Northgate",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "Apollo Tourism & Leisure Ltd",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "APOLLO TOURISM + LEISURE",
    "state": "QLD",
    "summary": "Apollo Tourism & Leisure Ltd, a tourism leisure company, manufactures, imports, rents, sells, and distributes recreational vehicles in Australia, New Zealand, North America, Germany, the United Kingdom, and Ireland. The company offers motorhomes, campervans, and caravans under the Fleetwood RV, Winnebago, Coromal, Windsor, Adria, and Talvor brands. It also sells new and used motorhomes and caravans; and ex-rental motorhomes. In addition, the company is involved in online accessories sale and labor hire business. Apollo Tourism & Leisure Ltd offers its products through a network of dealers and retail shopfronts. The company was founded in 1985 and is based in Northgate, Australia. Apollo Tourism & Leisure Ltd is a subsidiary of Lurk Investment Trust.",
    "website": "http://www.apollotourism.com",
    "zipcode": "4013"
  },
  "ATL.AX": {
    "city": "Northgate",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Recreational Vehicles",
    "long_name": "Apollo Tourism & Leisure Ltd",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "APOLLO T&L FPO",
    "state": "QLD",
    "summary": "Apollo Tourism & Leisure Ltd, a tourism leisure company, manufactures, imports, rents, sells, and distributes recreational vehicles in Australia, New Zealand, North America, Germany, the United Kingdom, and Ireland. The company offers motorhomes, campervans, and caravans under the Fleetwood RV, Winnebago, Coromal, Windsor, Adria, and Talvor brands. It also sells new and used motorhomes and caravans; and ex-rental motorhomes. In addition, the company is involved in online accessories sale and labor hire business. Apollo Tourism & Leisure Ltd offers its products through a network of dealers and retail shopfronts. The company was founded in 1985 and is based in Northgate, Australia. Apollo Tourism & Leisure Ltd is a subsidiary of Lurk Investment Trust.",
    "website": "http://www.apollotourism.com",
    "zipcode": "4013"
  },
  "B15A.F": {
    "city": "Valcourt",
    "country": "Canada",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "BRP Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BRP INC. SUBORD.VOT. O.N.",
    "state": "QC",
    "summary": "BRP Inc., together with its subsidiaries, designs, develops, manufactures, distributes, and markets powersports vehicles and marine products worldwide. It operates in two segments, Powersports and Marine. The company offers all-terrain, side-by-side, and three-wheeled vehicles; seasonal products, such as snowmobiles and personal watercraft; and engines for jet boats, outboards, karts, motorcycles, and recreational aircraft. It also provides parts, accessories, and apparel, as well as other services. The company sells its products through a network of independent dealers and distributors, as well as to original equipment manufacturers. The company was formerly known as J.A. Bombardier (J.A.B.) Inc. and changed its name to BRP Inc. in April 2013. BRP Inc. was founded in 1937 and is headquartered in Valcourt, Canada.",
    "website": "http://www.brp.com",
    "zipcode": "J0E 2L0"
  },
  "BOAT.V": {
    "city": "Toronto",
    "country": "Canada",
    "currency": "CAD",
    "exchange": "VAN",
    "industry": "Recreational Vehicles",
    "long_name": "The Limestone Boat Company Limited",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "THE LIMESTONE BOAT COMPANY LIMI",
    "state": "ON",
    "summary": "The Limestone Boat Company Inc. designs, manufactures, and distributes yachts. The company was founded in 1985 and is based in Toronto, Canada.",
    "website": "http://www.limestoneboats.com",
    "zipcode": null
  },
  "C83.F": {
    "city": "Lincolnshire",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "Camping World Holdings, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CAMPING WORLD CL.A DL-,01",
    "state": "IL",
    "summary": "Camping World Holdings, Inc., through its subsidiaries, operates as a recreational vehicle (RV) and outdoor retailer. It operates through two segments, Good Sam Services and Plans; and RV and Outdoor Retail. The company provides a portfolio of services, protection plans, products, and resources in the RV industry. It also offers extended vehicle service contracts; roadside assistance plans; property and casualty insurance programs; travel assist travel protection plans; and RV and outdoor related consumer shows, as well as produces various monthly and annual RV focused consumer magazines; travel and planning directories; and operates the Coast to Coast Club. In addition, the company provides new and used RVs; vehicle financing; RV repair and maintenance services; range of RV parts, equipment, supplies, and accessories, which include towing and hitching products, satellite and GPS systems, electrical and lighting products, appliances and furniture, and other products; and collision repair services comprising fiberglass front and rear cap replacement, windshield replacement, interior remodel solutions, and paint and body work. Further, it offers equipment, gears, and supplies for camping, hunting, fishing, skiing, snowboarding, bicycling, skateboarding, marine and watersports, and other outdoor activities, as well as operates Good Sam Club, a membership organization that offers savings on a range of products and services and provides co-branded credit cards. As of March 08, 2021, the company operated a network of approximately 170 retail locations in 38 states of the United States. It serves customers through dealerships, and online and e-commerce platforms. The company was founded in 1966 and is headquartered in Lincolnshire, Illinois.",
    "website": "http://www.campingworld.com",
    "zipcode": "60069"
  },
  "CHIA.SG": {
    "city": "Troisdorf",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Recreational Vehicles",
    "long_name": "Afkem AG",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "AFKEM AG Inhaber-Aktien o.N.",
    "state": null,
    "summary": "Afkem AG develops, manufactures, and sells electrically powered vehicles. It offers cars, pick-ups, buses, trikes, and motorcycles. The company was founded in 1872 and is based in Troisdorf, Germany.",
    "website": "http://www.afkem.com",
    "zipcode": "53842"
  },
  "CMOT": {
    "city": "Birmingham",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Recreational Vehicles",
    "long_name": "Curtiss Motorcycles Company, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CURTISS MOTORCYCLES COMPANY INC",
    "state": "AL",
    "summary": "Curtiss Motorcycles Company, Inc. engages in the design, manufacture, assembly, and sale of handcrafted street motorcycles for high net worth customers in the United States. The company offers the X132 Hellcat Speedster, as well as preproduction models, such as the P51 Combat Fighter and the Wraith Tandem Lusso motorcycles. It also provides motorcycle related products, including various wearing apparel and other related accessories displaying the Confederate name through its Website. The company was formerly known as Confederate Motors, Inc. and changed its name to Curtiss Motorcycles Company, Inc. in January 2018. Curtiss Motorcycles Company, Inc. was founded in 1991 and is based in Birmingham, Alabama.",
    "website": "http://www.curtissmotorcycles.com",
    "zipcode": "35233"
  },
  "CUFA.F": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "China Dynamics (Holdings) Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CHINA DYNAM.(HLDGS)HD-,01",
    "state": null,
    "summary": "China Dynamics (Holdings) Limited, an investment holding company, engages in manufacturing of electric vehicles primarily in the People's Republic of China, Hong Kong, and Chile. It operates through Development of Electric Vehicles, Mining, and Metals and Minerals Trading segments. It manufactures and trades in electric buses, electric power system and control system, and other buses; markets and sells vehicle components; and owns Glauberite Mine in Guangxi. The company also engages in the manufacturing and trading of motor vehicles and battery; trading of metals and minerals; mining and sale of mineral resources; and development of new energy technology and products. In addition, it provides management and computer maintenance services; trades in computer hardware and software; and develops software, and energy saving and environmental protection products. The company was formerly known as Sinocop Resources (Holdings) Limited and changed its name to China Dynamics (Holdings) Limited in May 2014. China Dynamics (Holdings) Limited is headquartered in Wanchai, Hong Kong.",
    "website": "http://www.chinadynamics.hk",
    "zipcode": null
  },
  "CWH": {
    "city": "Lincolnshire",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Recreational Vehicles",
    "long_name": "Camping World Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Camping World Holdings, Inc.",
    "state": "IL",
    "summary": "Camping World Holdings, Inc., through its subsidiaries, operates as a recreational vehicle (RV) and outdoor retailer. It operates through two segments, Good Sam Services and Plans; and RV and Outdoor Retail. The company provides a portfolio of services, protection plans, products, and resources in the RV industry. It also offers extended vehicle service contracts; roadside assistance plans; property and casualty insurance programs; travel assist travel protection plans; and RV and outdoor related consumer shows, as well as produces various monthly and annual RV focused consumer magazines; travel and planning directories; and operates the Coast to Coast Club. In addition, the company provides new and used RVs; vehicle financing; RV repair and maintenance services; range of RV parts, equipment, supplies, and accessories, which include towing and hitching products, satellite and GPS systems, electrical and lighting products, appliances and furniture, and other products; and collision repair services comprising fiberglass front and rear cap replacement, windshield replacement, interior remodel solutions, and paint and body work. Further, it offers equipment, gears, and supplies for camping, hunting, fishing, skiing, snowboarding, bicycling, skateboarding, marine and watersports, and other outdoor activities, as well as operates Good Sam Club, a membership organization that offers savings on a range of products and services and provides co-branded credit cards. As of March 08, 2021, the company operated a network of approximately 170 retail locations in 38 states of the United States. It serves customers through dealerships, and online and e-commerce platforms. The company was founded in 1966 and is headquartered in Lincolnshire, Illinois.",
    "website": "http://www.campingworld.com",
    "zipcode": "60069"
  },
  "DOO.TO": {
    "city": "Valcourt",
    "country": "Canada",
    "currency": "CAD",
    "exchange": "TOR",
    "industry": "Recreational Vehicles",
    "long_name": "BRP Inc.",
    "market": "ca_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BRP INC",
    "state": "QC",
    "summary": "BRP Inc., together with its subsidiaries, designs, develops, manufactures, distributes, and markets powersports vehicles and marine products worldwide. It operates in two segments, Powersports and Marine. The company offers all-terrain, side-by-side, and three-wheeled vehicles; seasonal products, such as snowmobiles and personal watercraft; and engines for jet boats, outboards, karts, motorcycles, and recreational aircraft. It also provides parts, accessories, and apparel, as well as other services. The company sells its products through a network of independent dealers and distributors, as well as to original equipment manufacturers. The company was formerly known as J.A. Bombardier (J.A.B.) Inc. and changed its name to BRP Inc. in April 2013. BRP Inc. was founded in 1937 and is headquartered in Valcourt, Canada.",
    "website": "http://www.brp.com",
    "zipcode": "J0E 2L0"
  },
  "DOOO": {
    "city": "Valcourt",
    "country": "Canada",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Recreational Vehicles",
    "long_name": "BRP Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "BRP Inc.",
    "state": "QC",
    "summary": "BRP Inc., together with its subsidiaries, designs, develops, manufactures, distributes, and markets powersports vehicles and marine products worldwide. It operates in two segments, Powersports and Marine. The company offers all-terrain, side-by-side, and three-wheeled vehicles; seasonal products, such as snowmobiles and personal watercraft; and engines for jet boats, outboards, karts, motorcycles, and recreational aircraft. It also provides parts, accessories, and apparel, as well as other services. The company sells its products through a network of independent dealers and distributors, as well as to original equipment manufacturers. The company was formerly known as J.A. Bombardier (J.A.B.) Inc. and changed its name to BRP Inc. in April 2013. BRP Inc. was founded in 1937 and is headquartered in Valcourt, Canada.",
    "website": "http://www.brp.com",
    "zipcode": "J0E 2L0"
  },
  "EM8.F": {
    "city": "Modena",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "Energica Motor Company S.p.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ENERGICA MOTOR CO.S.P.A.",
    "state": "MO",
    "summary": "Energica Motor Company S.p.A. manufactures and sells racing-bred electric motorcycles in Italy and internationally. The company is headquartered in Modena, Italy. Energica Motor Company S.p.A. is a subsidiary of CRP Service SRL.",
    "website": "http://www.energicamotor.com",
    "zipcode": "41126"
  },
  "EMC.MI": {
    "city": "Modena",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Recreational Vehicles",
    "long_name": "Energica Motor Company S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ENERGICA MOTOR COMPANY",
    "state": "MO",
    "summary": "Energica Motor Company S.p.A. manufactures and sells racing-bred electric motorcycles in Italy and internationally. The company is headquartered in Modena, Italy. Energica Motor Company S.p.A. is a subsidiary of CRP Service SRL.",
    "website": "http://www.energicamotor.com",
    "zipcode": "41126"
  },
  "EVA.MI": {
    "city": "Dueville",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Recreational Vehicles",
    "long_name": "Askoll Eva SpA",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "ASKOLL EVA",
    "state": "VI",
    "summary": "Askoll Eva SpA engages in the manufacture and sale of electric vehicles in Italy. It provides pedal-assisted bikes, electric scooters, and accessories. The company is based in Dueville, Italy. Askoll Eva SpA is a subsidiary of Askoll Holding S.r.l.",
    "website": "http://www.askollelectric.com",
    "zipcode": "36031"
  },
  "EZGO": {
    "city": "Changzhou",
    "country": "China",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Recreational Vehicles",
    "long_name": "EZGO Technologies Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "EZGO Technologies Ltd.",
    "state": null,
    "summary": "EZGO Technologies Ltd., through its subsidiaries, engages in the design, manufacture, rental, and sale of e-bicycles and e-tricycles in the People's Republic of China. It is also involved the rental and sale of lithium batteries; and sale, franchising, and operation of smart charging piles for e-bicycles and other electronic devices. The company offers its e-bicycles and e-tricycles under the Dilang and Cenbird brand name; and smart charging piles under the Hengdian brand name. Further, it sells battery packs and cells. In addition, the company engages in the development, operation, and maintenance of software related to e-bicycle and battery rental services. The company was formerly known as EZGO IOT Tech & Services Co., Ltd. The company was incorporated in 2019 and is headquartered in Changzhou, China.",
    "website": "http://www.ezgotech.com.cn",
    "zipcode": "213614"
  },
  "FF0.F": {
    "city": "Braselton",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "Fox Factory Holding Corp.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "FOX FACTORY HLDG  DL-,001",
    "state": "GA",
    "summary": "Fox Factory Holding Corp. designs, engineers, manufactures, and markets ride dynamics products worldwide. The company offers mid-end and high-end front fork and rear suspension products for mountain bikes, road bikes, and e-bikes; and powered vehicle products for side-by-side vehicles, on-road vehicles with and without off-road capabilities, off-road vehicles and trucks, all-terrain vehicles, snowmobiles, and specialty vehicles and applications, such as military, motorcycles, and commercial trucks. It also provides mountain and road bike wheels, and other performance cycling components, including cranks, chain rings, pedals, bars, stems, and seat posts, as well as sells aftermarket products to retailers and distributors. The company offers powered vehicles under the FOX, BDS Suspension, Zone Offroad, JKS Manufacturing, RT Pro UTV, 4x4 Posi-Lok, Ridetech, Tuscany, and SCA brands; and mountain bikes and road bikes under the FOX, Race Face, Easton Cycling, and Marzocchi brands. Fox Factory Holding Corp. was incorporated in 2007 and is headquartered in Braselton, Georgia.",
    "website": "http://www.ridefox.com",
    "zipcode": "30517"
  },
  "FOXF": {
    "city": "Braselton",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Recreational Vehicles",
    "long_name": "Fox Factory Holding Corp.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Fox Factory Holding Corp.",
    "state": "GA",
    "summary": "Fox Factory Holding Corp. designs, engineers, manufactures, and markets ride dynamics products worldwide. The company offers mid-end and high-end front fork and rear suspension products for mountain bikes, road bikes, and e-bikes; and powered vehicle products for side-by-side vehicles, on-road vehicles with and without off-road capabilities, off-road vehicles and trucks, all-terrain vehicles, snowmobiles, and specialty vehicles and applications, such as military, motorcycles, and commercial trucks. It also provides mountain and road bike wheels, and other performance cycling components, including cranks, chain rings, pedals, bars, stems, and seat posts, as well as sells aftermarket products to retailers and distributors. The company offers powered vehicles under the FOX, BDS Suspension, Zone Offroad, JKS Manufacturing, RT Pro UTV, 4x4 Posi-Lok, Ridetech, Tuscany, and SCA brands; and mountain bikes and road bikes under the FOX, Race Face, Easton Cycling, and Marzocchi brands. Fox Factory Holding Corp. was incorporated in 2007 and is headquartered in Braselton, Georgia.",
    "website": "http://www.ridefox.com",
    "zipcode": "30517"
  },
  "FUV": {
    "city": "Eugene",
    "country": "United States",
    "currency": "USD",
    "exchange": "NGM",
    "industry": "Recreational Vehicles",
    "long_name": "Arcimoto, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Arcimoto, Inc.",
    "state": "OR",
    "summary": "Arcimoto, Inc. designs, develops, manufactures, sells, and rents three-wheeled electric vehicles in the United States. Its flagship product is the Fun Utility Vehicle (FUV) that delivers a thrilling ride experience comfort for two passengers with cargo, parking, and operation. The company's products also comprise Rapid Responder designed to perform emergency, security, and law enforcement services; Deliverator, an electric last-mile delivery solution to get goods where they need to go; Cameo, an FUV equipped with a rear-facing rear seat and a modified roof built for on-road filming; and Arcimoto Roadster, an unparalleled pure-electric on-road thrill machine. The company was formerly known as WTP Incorporated and changed its name to Arcimoto, Inc. in December 2011. Arcimoto, Inc. was incorporated in 2007 and is headquartered in Eugene, Oregon.",
    "website": "http://www.arcimoto.com",
    "zipcode": "97402"
  },
  "H1OG34.SA": {
    "city": "Milwaukee",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Recreational Vehicles",
    "long_name": "Harley-Davidson, Inc.",
    "market": "br_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "HARLEY,DAVIDDRN",
    "state": "WI",
    "summary": "Harley-Davidson, Inc. manufactures and sells custom, cruiser, and touring motorcycles. The company operates in two segments, Motorcycles and Related Products and Financial Services. The Motorcycles and Related Products segment designs, manufactures, and sells Harley-Davidson motorcycles, including cruiser, touring, standard, sportbike, and dual models, as well as motorcycle parts, accessories, general merchandise, and related services. This segment sells its products to retail customers through a network of independent dealers, as well as e-commerce channels in the United States, Canada, Latin America, Europe, the Middle East, Africa, and the Asia-Pacific. The Financial Services segment provides wholesale financing services, such as floorplan and open account financing of motorcycles, and parts and accessories; and retail financing services, including installment lending for the purchase of new and used Harley-Davidson motorcycles, as well as point-of-sale protection products comprising motorcycle insurance, extended service contracts, and motorcycle maintenance protection. This segment also licenses third-party financial institutions that issue credit cards bearing the Harley-Davidson brand. Harley-Davidson, Inc. was founded in 1903 and is based in Milwaukee, Wisconsin.",
    "website": "http://www.harley-davidson.com",
    "zipcode": "53208"
  },
  "H9Y.DE": {
    "city": "Greifswald",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Recreational Vehicles",
    "long_name": "HanseYachts AG",
    "market": "de_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "HANSEYACHTS O.N.",
    "state": null,
    "summary": "HanseYachts AG develops, produces, and sells sailing yachts and motorboats in Germany, Spain, France, the United States, the United Kingdom, and internationally. The company offers sailing yachts under the Hanse, Dehler, Moody, Privilege, and Varianta brands; and motor boats under the Sealine and Fjord brands. HanseYachts AG markets its products through franchised dealer network and its own distributorships. The company was founded in 1990 and is headquartered in Greifswald, Germany.",
    "website": "http://www.hanseyachtsag.com",
    "zipcode": "17493"
  },
  "H9Y.F": {
    "city": "Greifswald",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "HanseYachts AG",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "HANSEYACHTS O.N.",
    "state": null,
    "summary": "HanseYachts AG develops, produces, and sells sailing yachts and motorboats in Germany, Spain, France, the United States, the United Kingdom, and internationally. The company offers sailing yachts under the Hanse, Dehler, Moody, Privilege, and Varianta brands; and motor boats under the Sealine and Fjord brands. HanseYachts AG markets its products through franchised dealer network and its own distributorships. The company was founded in 1990 and is headquartered in Greifswald, Germany.",
    "website": "http://www.hanseyachtsag.com",
    "zipcode": "17493"
  },
  "HAR.DE": {
    "city": "Milwaukee",
    "country": "United States",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Recreational Vehicles",
    "long_name": "Harley-Davidson, Inc.",
    "market": "de_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "HARLEY-DAVID.INC. DL -,01",
    "state": "WI",
    "summary": "Harley-Davidson, Inc. manufactures and sells custom, cruiser, and touring motorcycles. The company operates in two segments, Motorcycles and Related Products and Financial Services. The Motorcycles and Related Products segment designs, manufactures, and sells Harley-Davidson motorcycles, including cruiser, touring, standard, sportbike, and dual models, as well as motorcycle parts, accessories, general merchandise, and related services. This segment sells its products to retail customers through a network of independent dealers, as well as e-commerce channels in the United States, Canada, Latin America, Europe, the Middle East, Africa, and the Asia-Pacific. The Financial Services segment provides wholesale financing services, such as floorplan and open account financing of motorcycles, and parts and accessories; and retail financing services, including installment lending for the purchase of new and used Harley-Davidson motorcycles, as well as point-of-sale protection products comprising motorcycle insurance, extended service contracts, and motorcycle maintenance protection. This segment also licenses third-party financial institutions that issue credit cards bearing the Harley-Davidson brand. Harley-Davidson, Inc. was founded in 1903 and is based in Milwaukee, Wisconsin.",
    "website": "http://www.harley-davidson.com",
    "zipcode": "53208"
  },
  "HAR.F": {
    "city": "Milwaukee",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "Harley-Davidson, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "HARLEY-DAVID.INC. DL -,01",
    "state": "WI",
    "summary": "Harley-Davidson, Inc. manufactures and sells custom, cruiser, and touring motorcycles. The company operates in two segments, Motorcycles and Related Products and Financial Services. The Motorcycles and Related Products segment designs, manufactures, and sells Harley-Davidson motorcycles, including cruiser, touring, standard, sportbike, and dual models, as well as motorcycle parts, accessories, general merchandise, and related services. This segment sells its products to retail customers through a network of independent dealers, as well as e-commerce channels in the United States, Canada, Latin America, Europe, the Middle East, Africa, and the Asia-Pacific. The Financial Services segment provides wholesale financing services, such as floorplan and open account financing of motorcycles, and parts and accessories; and retail financing services, including installment lending for the purchase of new and used Harley-Davidson motorcycles, as well as point-of-sale protection products comprising motorcycle insurance, extended service contracts, and motorcycle maintenance protection. This segment also licenses third-party financial institutions that issue credit cards bearing the Harley-Davidson brand. Harley-Davidson, Inc. was founded in 1903 and is based in Milwaukee, Wisconsin.",
    "website": "http://www.harley-davidson.com",
    "zipcode": "53208"
  },
  "HOG": {
    "city": "Milwaukee",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Recreational Vehicles",
    "long_name": "Harley-Davidson, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Harley-Davidson, Inc.",
    "state": "WI",
    "summary": "Harley-Davidson, Inc. manufactures and sells custom, cruiser, and touring motorcycles. The company operates in two segments, Motorcycles and Related Products and Financial Services. The Motorcycles and Related Products segment designs, manufactures, and sells Harley-Davidson motorcycles, including cruiser, touring, standard, sportbike, and dual models, as well as motorcycle parts, accessories, general merchandise, and related services. This segment sells its products to retail customers through a network of independent dealers, as well as e-commerce channels in the United States, Canada, Latin America, Europe, the Middle East, Africa, and the Asia-Pacific. The Financial Services segment provides wholesale financing services, such as floorplan and open account financing of motorcycles, and parts and accessories; and retail financing services, including installment lending for the purchase of new and used Harley-Davidson motorcycles, as well as point-of-sale protection products comprising motorcycle insurance, extended service contracts, and motorcycle maintenance protection. This segment also licenses third-party financial institutions that issue credit cards bearing the Harley-Davidson brand. Harley-Davidson, Inc. was founded in 1903 and is based in Milwaukee, Wisconsin.",
    "website": "http://www.harley-davidson.com",
    "zipcode": "53208"
  },
  "HOG.MX": {
    "city": "Milwaukee",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Recreational Vehicles",
    "long_name": "Harley-Davidson, Inc.",
    "market": "mx_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "HARLEY DAVIDSON",
    "state": "WI",
    "summary": "Harley-Davidson, Inc. manufactures and sells custom, cruiser, and touring motorcycles. The company operates in two segments, Motorcycles and Related Products and Financial Services. The Motorcycles and Related Products segment designs, manufactures, and sells Harley-Davidson motorcycles, including cruiser, touring, standard, sportbike, and dual models, as well as motorcycle parts, accessories, general merchandise, and related services. This segment sells its products to retail customers through a network of independent dealers, as well as e-commerce channels in the United States, Canada, Latin America, Europe, the Middle East, Africa, and the Asia-Pacific. The Financial Services segment provides wholesale financing services, such as floorplan and open account financing of motorcycles, and parts and accessories; and retail financing services, including installment lending for the purchase of new and used Harley-Davidson motorcycles, as well as point-of-sale protection products comprising motorcycle insurance, extended service contracts, and motorcycle maintenance protection. This segment also licenses third-party financial institutions that issue credit cards bearing the Harley-Davidson brand. Harley-Davidson, Inc. was founded in 1903 and is based in Milwaukee, Wisconsin.",
    "website": "http://www.harley-davidson.com",
    "zipcode": "53208"
  },
  "HOG.VI": {
    "city": "Milwaukee",
    "country": "United States",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Recreational Vehicles",
    "long_name": "Harley-Davidson, Inc.",
    "market": "at_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "HARLEY-DAVIDSON INC",
    "state": "WI",
    "summary": "Harley-Davidson, Inc. manufactures and sells custom, cruiser, and touring motorcycles. The company operates in two segments, Motorcycles and Related Products and Financial Services. The Motorcycles and Related Products segment designs, manufactures, and sells Harley-Davidson motorcycles, including cruiser, touring, standard, sportbike, and dual models, as well as motorcycle parts, accessories, general merchandise, and related services. This segment sells its products to retail customers through a network of independent dealers, as well as e-commerce channels in the United States, Canada, Latin America, Europe, the Middle East, Africa, and the Asia-Pacific. The Financial Services segment provides wholesale financing services, such as floorplan and open account financing of motorcycles, and parts and accessories; and retail financing services, including installment lending for the purchase of new and used Harley-Davidson motorcycles, as well as point-of-sale protection products comprising motorcycle insurance, extended service contracts, and motorcycle maintenance protection. This segment also licenses third-party financial institutions that issue credit cards bearing the Harley-Davidson brand. Harley-Davidson, Inc. was founded in 1903 and is based in Milwaukee, Wisconsin.",
    "website": "http://www.harley-davidson.com",
    "zipcode": "53208"
  },
  "KTA.DE": {
    "city": "Jandelsbrunn",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Recreational Vehicles",
    "long_name": "Knaus Tabbert AG",
    "market": "de_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "KNAUS AG  INH O.N.",
    "state": null,
    "summary": "Knaus Tabbert AG, together with its subsidiaries, manufactures and sells leisure vehicles in Europe. It operates through Premium and Luxury segments. The company offers motorhomes, caravans, and camper vans under the KNAUS, TABBERT, WEINSBERG, T@B, and MORELO brands. It also operates RENT AND TRAVEL digital portal for renting leisure vehicles through a network of partners operating approximately 180 rental stations. Knaus Tabbert AG was founded in 1912 and is headquartered in Jandelsbrunn, Germany.",
    "website": "http://www.knaustabbert.de",
    "zipcode": "94118"
  },
  "KTA.F": {
    "city": "Jandelsbrunn",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "Knaus Tabbert AG",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "KNAUS AG  INH O.N.",
    "state": null,
    "summary": "Knaus Tabbert AG, together with its subsidiaries, manufactures and sells leisure vehicles in Europe. It operates through Premium and Luxury segments. The company offers motorhomes, caravans, and camper vans under the KNAUS, TABBERT, WEINSBERG, T@B, and MORELO brands. It also operates RENT AND TRAVEL digital portal for renting leisure vehicles through a network of partners operating approximately 180 rental stations. Knaus Tabbert AG was founded in 1912 and is headquartered in Jandelsbrunn, Germany.",
    "website": "http://www.knaustabbert.de",
    "zipcode": "94118"
  },
  "LCII": {
    "city": "Elkhart",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Recreational Vehicles",
    "long_name": "LCI Industries",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LCI Industries",
    "state": "IN",
    "summary": "LCI Industries, together with its subsidiaries, manufactures and supplies components for the manufacturers of recreational vehicles (RVs) and adjacent industries in the United States and internationally. It operates in two segments, Original Equipment Manufacturers (OEM) and Aftermarket. The OEM segment manufactures and distributes a range of engineered components, such as steel chassis and related components; axles and suspension solutions; slide-out mechanisms and solutions; thermoformed bath, kitchen, and other products; vinyl, aluminum, and frameless windows; manual, electric, and hydraulic stabilizer and leveling systems; entry, luggage, patio, and ramp doors; furniture and mattresses; electric and manual entry steps; awnings and awning accessories; towing products; truck accessories; electronic components; and other accessories. This segment serves OEMs of RVs and adjacent industries, including buses; trailers used to haul boats, livestock, equipment, and other cargo; trucks; boats; trains; manufactured homes; and modular housing, as well as travel trailers, fifth-wheel travel trailers, folding camping trailers, and truck campers. The Aftermarket segment supplies various components of RV and adjacent industries to retail dealers, wholesale distributors, and service centers. This segment also sells replacement glass and awnings to fulfill insurance claims, biminis, covers, buoys, and fenders to the marine industry. The company was formerly known as Drew Industries Incorporated and changed its name to LCI Industries in December 2016. LCI Industries was incorporated in 1984 and is based in Elkhart, Indiana.",
    "website": "http://www.lci1.com",
    "zipcode": "46514"
  },
  "LGAH": {
    "city": "Colorado Springs",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Recreational Vehicles",
    "long_name": "LGA Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LGA HOLDINGS INC",
    "state": "CO",
    "summary": "LGA Holdings, Inc. operates as an outdoor lifestyle company. It invents, manufactures, imports, and distributes trailers, campers, cargo and bicycle carriers, silent towing products, shelters, and accessories. The company provides pick up bed, enclosed, and road trailers, as well as trailer accessories; and hitch mounted cargo racks, enclosed cargo carriers, mobility carriers, and cargo carrier accessories. It also offers bicycle hitch racks, bicycle storage stands, and ball and tongue mount racks; silent hitch pins; SilentACT, a locking anti-rattle hitch pin; shelters; and accessories. The company markets its products under the GearCage AerFoil, Silent Hitch Pin, Tentris Shelters, LittleGiant Trailers, Vme Racks, BikeWing Carriers, GearWagon Trailers, Spec OPS, GearBag, and GearSpace Carriers brand names. LGA Holdings, Inc. was founded in 1998 and is based in Colorado Springs, Colorado.",
    "website": "http://www.letsgoaero.com",
    "zipcode": "80917"
  },
  "M05.F": {
    "city": "Loudon",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "Malibu Boats, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MALIBU BOATS INC.A DL-,01",
    "state": "TN",
    "summary": "Malibu Boats, Inc. designs, manufactures, distributes, markets, and sells a range of recreational powerboats. It operates through three segments: Malibu, Cobalt, and Pursuit. The company offers performance sport boats, and sterndrive and outboard boats under the Malibu, Axis, Cobalt, and Pursuit brands. Its products are used for a range of recreational boating activities, including water sports, such as water skiing, wakeboarding, and wake surfing, as well as general recreational boating and fishing. It operates through a network of independent dealers in Europe, Asia, the Middle East, South America, South Africa, and Australia/New Zealand. The company was founded in 1982 and is based in Loudon, Tennessee.",
    "website": "http://www.malibuboats.com",
    "zipcode": "37774"
  },
  "MBUU": {
    "city": "Loudon",
    "country": "United States",
    "currency": "USD",
    "exchange": "NGM",
    "industry": "Recreational Vehicles",
    "long_name": "Malibu Boats, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Malibu Boats, Inc.",
    "state": "TN",
    "summary": "Malibu Boats, Inc. designs, manufactures, distributes, markets, and sells a range of recreational powerboats. It operates through three segments: Malibu, Cobalt, and Pursuit. The company offers performance sport boats, and sterndrive and outboard boats under the Malibu, Axis, Cobalt, and Pursuit brands. Its products are used for a range of recreational boating activities, including water sports, such as water skiing, wakeboarding, and wake surfing, as well as general recreational boating and fishing. It operates through a network of independent dealers in Europe, Asia, the Middle East, South America, South Africa, and Australia/New Zealand. The company was founded in 1982 and is based in Loudon, Tennessee.",
    "website": "http://www.malibuboats.com",
    "zipcode": "37774"
  },
  "MCFT": {
    "city": "Vonore",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Recreational Vehicles",
    "long_name": "MasterCraft Boat Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "MasterCraft Boat Holdings, Inc.",
    "state": "TN",
    "summary": "MasterCraft Boat Holdings, Inc., through its subsidiaries, designs, manufactures, and markets recreational powerboats. It operates through three segments: MasterCraft, NauticStar, and Crest. The MasterCraft segment produces recreational performance sport boats and luxury day boats under the MasterCraft and Aviara brands, which are used for water skiing, wakeboarding, and wake surfing, as well as general recreational boating. The NauticStar segment offers boats that are primarily used for saltwater fishing and general recreational boating. The Crest segment produces pontoon boats for use in general recreational boating. The company also offers various accessories, including trailers and aftermarket parts. It sells its boats through a network of independent dealers in North America and internationally. The company was formerly known as MCBC Holdings, Inc. and changed its name to MasterCraft Boat Holdings, Inc. in November 2018. MasterCraft Boat Holdings, Inc. was founded in 1968 and is based in Vonore, Tennessee.",
    "website": "http://www.mastercraft.com",
    "zipcode": "37885"
  },
  "MPX": {
    "city": "Atlanta",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Recreational Vehicles",
    "long_name": "Marine Products Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Marine Products Corporation",
    "state": "GA",
    "summary": "Marine Products Corporation designs, manufactures, and sells recreational fiberglass powerboats for the sportboat, sport fishing, and jet boat markets worldwide. It offers Chaparral sterndrive pleasure boats, including SSi Sport, Ski and Fish Boats, SSX Sport Boats, and the Surf Series; Chaparral outboard pleasure boats within the SSi and SSX, SunCoast, and OSX Sport Luxury models; Robalo outboard sport fishing boats; and Vortex jet boats under the Chaparral brand. The company also provides center and dual consoles, and Cayman Bay Boats under the Robalo brand name. As of February 26, 2021, it sells its products to a network of 147 domestic and 46 international independent authorized dealers. The company was founded in 1965 and is based in Atlanta, Georgia.",
    "website": "http://www.marineproductscorp.com",
    "zipcode": "30329"
  },
  "ONEW": {
    "city": "Buford",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Recreational Vehicles",
    "long_name": "OneWater Marine Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "OneWater Marine Inc.",
    "state": "GA",
    "summary": "OneWater Marine Inc. operates as a recreational boat retailer in the United States. It offers new and pre-owned recreational boats and yachts, as well as related marine products, such as parts and accessories. The company also provides boat repair and maintenance services; arranges boat financing and insurance; and other ancillary services, including indoor and outdoor storage, and marina, as well as rental of boats and personal watercraft. As of March 25, 2021, it operated 69 stores in 10 states, including Texas, Florida, Alabama, North Carolina, South Carolina, and Georgia. OneWater Marine Inc. was founded in 2014 and is headquartered in Buford, Georgia.",
    "website": "http://www.onewatermarine.com",
    "zipcode": "30518"
  },
  "P1I.F": {
    "city": "Pontedera",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "Piaggio & C. SpA",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PIAGGIO + C. NAM.",
    "state": "PI",
    "summary": "Piaggio & C. SpA, together with its subsidiaries, develops, manufactures, and distributes two-wheeler and commercial motor vehicles. It provides two-wheelers, including scooters, motorcycles, and mopeds, as well as related spare parts and accessories under the Aprilia, Derbi, Gilera, Moto Guzzi, Piaggio, Scarabeo, and Vespa brand names. The company also offers three-and four-wheeler light transport sector vehicles, as well as related spare parts and accessories for commercial and private use under the Ape and Porter brands; and smart robots for goods transportation. In addition, it sells engines to third parties; conducts two-wheeler sports championships; and provides technical services. Piaggio & C. SpA distributes its vehicles primarily through dealers and importers in Europe, the Middle East, Africa, the Americas, the Asia Pacific, and India. The company was founded in 1884 and is headquartered in Pontedera, Italy. Piaggio & C. SpA operates as a subsidiary of IMMSI S.p.A.",
    "website": "http://www.piaggiogroup.com",
    "zipcode": "56025"
  },
  "PATK": {
    "city": "Elkhart",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Recreational Vehicles",
    "long_name": "Patrick Industries, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Patrick Industries, Inc.",
    "state": "IN",
    "summary": "Patrick Industries, Inc. manufactures and distributes components, building products, and materials for the recreational vehicle, marine, manufactured housing, and industrial markets in the United States and Canada. Its Manufacturing segment manufactures and sells furniture, shelving, wall, countertop, and cabinet product; cabinet door, fiberglass bath fixture, and tile system; hardwood furniture, vinyl printing, solid surface, granite, and quartz countertop fabrication aluminum product; RV painting; decorative vinyl and paper laminated panel; fiberglass and plastic component; softwoods lumber; custom cabinet; polymer-based flooring product; marine hardware; air handling; and electrical system and component, including instrument and dash panel, and other product. This segment also provides wrapped vinyl, paper, and hardwood profile moulding; interior passage door; slide-out trim and fascia product; thermoformed shower surround; specialty bath and closet building product; treated, untreated, and laminated plywood; fiberglass and plastic helm systems and component; wiring and wire harnesses; aluminum and plastic fuel tank; boat cover, tower, top, and frame; CNC molds and composite part; and slotwall panel and component. The company's Distribution segment distributes pre-finished wall and ceiling panel, drywall and finishing product, electronic, audio system component, appliance, wiring product, electrical and plumbing product, cement siding product, raw and processed lumber, fiber reinforced polyester product, roofing, laminate and ceramic flooring product, shower door, furniture, fireplace and surround, interior and exterior lighting product, and other product. This segment also offers transportation and logistics service. The company was founded in 1959 and is headquartered in Elkhart, Indiana.",
    "website": "http://www.patrickind.com",
    "zipcode": "46515"
  },
  "PIA.MI": {
    "city": "Pontedera",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Recreational Vehicles",
    "long_name": "Piaggio & C. SpA",
    "market": "it_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PIAGGIO",
    "state": "PI",
    "summary": "Piaggio & C. SpA, together with its subsidiaries, develops, manufactures, and distributes two-wheeler and commercial motor vehicles. It provides two-wheelers, including scooters, motorcycles, and mopeds, as well as related spare parts and accessories under the Aprilia, Derbi, Gilera, Moto Guzzi, Piaggio, Scarabeo, and Vespa brand names. The company also offers three-and four-wheeler light transport sector vehicles, as well as related spare parts and accessories for commercial and private use under the Ape and Porter brands; and smart robots for goods transportation. In addition, it sells engines to third parties; conducts two-wheeler sports championships; and provides technical services. Piaggio & C. SpA distributes its vehicles primarily through dealers and importers in Europe, the Middle East, Africa, the Americas, the Asia Pacific, and India. The company was founded in 1884 and is headquartered in Pontedera, Italy. Piaggio & C. SpA operates as a subsidiary of IMMSI S.p.A.",
    "website": "http://www.piaggiogroup.com",
    "zipcode": "56025"
  },
  "PIAGF": {
    "city": "Pontedera",
    "country": "Italy",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Recreational Vehicles",
    "long_name": "Piaggio & C. SpA",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PIAGGIO",
    "state": "PI",
    "summary": "Piaggio & C. SpA, together with its subsidiaries, develops, manufactures, and distributes two-wheeler and commercial motor vehicles. It provides two-wheelers, including scooters, motorcycles, and mopeds, as well as related spare parts and accessories under the Aprilia, Derbi, Gilera, Moto Guzzi, Piaggio, Scarabeo, and Vespa brand names. The company also offers three-and four-wheeler light transport sector vehicles, as well as related spare parts and accessories for commercial and private use under the Ape and Porter brands; and smart robots for goods transportation. In addition, it sells engines to third parties; conducts two-wheeler sports championships; and provides technical services. Piaggio & C. SpA distributes its vehicles primarily through dealers and importers in Europe, the Middle East, Africa, the Americas, the Asia Pacific, and India. The company was founded in 1884 and is headquartered in Pontedera, Italy. Piaggio & C. SpA operates as a subsidiary of IMMSI S.p.A.",
    "website": "http://www.piaggiogroup.com",
    "zipcode": "56025"
  },
  "PII": {
    "city": "Medina",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Recreational Vehicles",
    "long_name": "Polaris Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Polaris Inc.",
    "state": "MN",
    "summary": "Polaris Inc. designs, engineers, manufactures, and markets power sports vehicles worldwide. It operates in five segments: ORV/Snowmobiles, Motorcycles, Global Adjacent Markets, Aftermarket, and Boats. The company offers off-road vehicles (ORVs), including all-terrain vehicles and side-by-side vehicles; snowmobiles and snow bikes conversion kit systems; motorcycles; and low emission, light duty hauling, passenger, and industrial vehicles. It also produces replacement parts and accessories comprising winches, bumper/brushguards, plows, racks, wheels and tires, pull-behinds, cab systems, lighting and audio systems, cargo box accessories, tracks, and oil for ORVs; snowmobile accessories, which comprise covers, traction products, electric starters, reverse kits, tracks, bags, windshields, oil, and lubricants; and motorcycle accessories, including e saddle bags, handlebars, backrests, exhausts, windshields, seats, oil, and various chrome accessories. In addition, the company offers gear and apparel, such as helmets, jackets, gloves, pants, hats, goggles, boots, bibs, and leathers; off-road Jeep and truck accessories; and pontoon and deck boats. The company provides its products through dealers and distributors, and online; and aftermarket parts and accessories through 95 brick-and-mortar retail centers, call centers, and e-commerce sites. The company was formerly known as Polaris Industries Inc. Polaris Inc. was founded in 1954 and is headquartered in Medina, Minnesota.",
    "website": "http://www.polaris.com",
    "zipcode": "55340"
  },
  "PII.MX": {
    "city": "Medina",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Recreational Vehicles",
    "long_name": "Polaris Inc.",
    "market": "mx_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "POLARIS INC",
    "state": "MN",
    "summary": "Polaris Inc. designs, engineers, manufactures, and markets power sports vehicles worldwide. It operates in five segments: ORV/Snowmobiles, Motorcycles, Global Adjacent Markets, Aftermarket, and Boats. The company offers off-road vehicles (ORVs), including all-terrain vehicles and side-by-side vehicles; snowmobiles and snow bikes conversion kit systems; motorcycles; and low emission, light duty hauling, passenger, and industrial vehicles. It also produces replacement parts and accessories comprising winches, bumper/brushguards, plows, racks, wheels and tires, pull-behinds, cab systems, lighting and audio systems, cargo box accessories, tracks, and oil for ORVs; snowmobile accessories, which comprise covers, traction products, electric starters, reverse kits, tracks, bags, windshields, oil, and lubricants; and motorcycle accessories, including e saddle bags, handlebars, backrests, exhausts, windshields, seats, oil, and various chrome accessories. In addition, the company offers gear and apparel, such as helmets, jackets, gloves, pants, hats, goggles, boots, bibs, and leathers; off-road Jeep and truck accessories; and pontoon and deck boats. The company provides its products through dealers and distributors, and online; and aftermarket parts and accessories through 95 brick-and-mortar retail centers, call centers, and e-commerce sites. The company was formerly known as Polaris Industries Inc. Polaris Inc. was founded in 1954 and is headquartered in Medina, Minnesota.",
    "website": "http://www.polaris.com",
    "zipcode": "55340"
  },
  "PK2.F": {
    "city": "Elkhart",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "Patrick Industries, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PATRICK IND. INC.",
    "state": "IN",
    "summary": "Patrick Industries, Inc. manufactures and distributes components, building products, and materials for the recreational vehicle, marine, manufactured housing, and industrial markets in the United States and Canada. Its Manufacturing segment manufactures and sells furniture, shelving, wall, countertop, and cabinet product; cabinet door, fiberglass bath fixture, and tile system; hardwood furniture, vinyl printing, solid surface, granite, and quartz countertop fabrication aluminum product; RV painting; decorative vinyl and paper laminated panel; fiberglass and plastic component; softwoods lumber; custom cabinet; polymer-based flooring product; marine hardware; air handling; and electrical system and component, including instrument and dash panel, and other product. This segment also provides wrapped vinyl, paper, and hardwood profile moulding; interior passage door; slide-out trim and fascia product; thermoformed shower surround; specialty bath and closet building product; treated, untreated, and laminated plywood; fiberglass and plastic helm systems and component; wiring and wire harnesses; aluminum and plastic fuel tank; boat cover, tower, top, and frame; CNC molds and composite part; and slotwall panel and component. The company's Distribution segment distributes pre-finished wall and ceiling panel, drywall and finishing product, electronic, audio system component, appliance, wiring product, electrical and plumbing product, cement siding product, raw and processed lumber, fiber reinforced polyester product, roofing, laminate and ceramic flooring product, shower door, furniture, fireplace and surround, interior and exterior lighting product, and other product. This segment also offers transportation and logistics service. The company was founded in 1959 and is headquartered in Elkhart, Indiana.",
    "website": "http://www.patrickind.com",
    "zipcode": "46515"
  },
  "PL6.F": {
    "city": "Medina",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "Polaris Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "POLARIS INC.  DL -,01",
    "state": "MN",
    "summary": "Polaris Inc. designs, engineers, manufactures, and markets power sports vehicles worldwide. It operates in five segments: ORV/Snowmobiles, Motorcycles, Global Adjacent Markets, Aftermarket, and Boats. The company offers off-road vehicles (ORVs), including all-terrain vehicles and side-by-side vehicles; snowmobiles and snow bikes conversion kit systems; motorcycles; and low emission, light duty hauling, passenger, and industrial vehicles. It also produces replacement parts and accessories comprising winches, bumper/brushguards, plows, racks, wheels and tires, pull-behinds, cab systems, lighting and audio systems, cargo box accessories, tracks, and oil for ORVs; snowmobile accessories, which comprise covers, traction products, electric starters, reverse kits, tracks, bags, windshields, oil, and lubricants; and motorcycle accessories, including e saddle bags, handlebars, backrests, exhausts, windshields, seats, oil, and various chrome accessories. In addition, the company offers gear and apparel, such as helmets, jackets, gloves, pants, hats, goggles, boots, bibs, and leathers; off-road Jeep and truck accessories; and pontoon and deck boats. The company provides its products through dealers and distributors, and online; and aftermarket parts and accessories through 95 brick-and-mortar retail centers, call centers, and e-commerce sites. The company was formerly known as Polaris Industries Inc. Polaris Inc. was founded in 1954 and is headquartered in Medina, Minnesota.",
    "website": "http://www.polaris.com",
    "zipcode": "55340"
  },
  "PMAG.F": {
    "city": "Wels",
    "country": "Austria",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "PIERER Mobility AG",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PIERER MOBILITY AG",
    "state": null,
    "summary": "PIERER Mobility AG, together with its subsidiaries, operates as a motorcycle producer in Europe, North America, and internationally. It operates through Motorcycles, E-Bikes, and Other segments. The company develops, produces, and distributes motorized vehicles for recreational purposes, including off-road and street motorcycles; mini-motorcycles; X-BOW; and brand accessories, such as spare parts, technical accessories, and clothing under the KTM, Husqvarna Motorcycles, and GASGAS brands. It also develops, produces, and sells chassis components for motorcycles and vehicles, including suspension components, frame construction and related welded-steel components, exhaust systems, and cooling systems under the WP brand. In addition, the company engages in manufacturing, developing, and trading e-bikes and bicycles under the Husqvarna E-Bicycles and R RAYMON brands, as well as motorcycles under the GASGAS brand. Further, it provides digital strategy, mobile and web applications, and business solutions. The company was formerly known as KTM Industries AG and changed its name to PIERER Mobility AG in October 2019. PIERER Mobility AG was founded in 1953 and is based in Wels, Austria. PIERER Mobility AG is a subsidiary of PTW Holding AG.",
    "website": "http://www.pierermobility.com",
    "zipcode": "4600"
  },
  "PMAG.SW": {
    "city": "Wels",
    "country": "Austria",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Recreational Vehicles",
    "long_name": "PIERER Mobility AG",
    "market": "ch_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "PIERER Mobility AG",
    "state": null,
    "summary": "PIERER Mobility AG, together with its subsidiaries, operates as a motorcycle producer in Europe, North America, and internationally. It operates through Motorcycles, E-Bikes, and Other segments. The company develops, produces, and distributes motorized vehicles for recreational purposes, including off-road and street motorcycles; mini-motorcycles; X-BOW; and brand accessories, such as spare parts, technical accessories, and clothing under the KTM, Husqvarna Motorcycles, and GASGAS brands. It also develops, produces, and sells chassis components for motorcycles and vehicles, including suspension components, frame construction and related welded-steel components, exhaust systems, and cooling systems under the WP brand. In addition, the company engages in manufacturing, developing, and trading e-bikes and bicycles under the Husqvarna E-Bicycles and R RAYMON brands, as well as motorcycles under the GASGAS brand. Further, it provides digital strategy, mobile and web applications, and business solutions. The company was formerly known as KTM Industries AG and changed its name to PIERER Mobility AG in October 2019. PIERER Mobility AG was founded in 1953 and is based in Wels, Austria. PIERER Mobility AG is a subsidiary of PTW Holding AG.",
    "website": "http://www.pierermobility.com",
    "zipcode": "4600"
  },
  "PMAG.VI": {
    "city": "Wels",
    "country": "Austria",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Recreational Vehicles",
    "long_name": "PIERER Mobility AG",
    "market": "at_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Goods",
    "short_name": "PIERER MOBILITY AG",
    "state": null,
    "summary": "PIERER Mobility AG, together with its subsidiaries, operates as a motorcycle producer in Europe, North America, and internationally. It operates through Motorcycles, E-Bikes, and Other segments. The company develops, produces, and distributes motorized vehicles for recreational purposes, including off-road and street motorcycles; mini-motorcycles; X-BOW; and brand accessories, such as spare parts, technical accessories, and clothing under the KTM, Husqvarna Motorcycles, and GASGAS brands. It also develops, produces, and sells chassis components for motorcycles and vehicles, including suspension components, frame construction and related welded-steel components, exhaust systems, and cooling systems under the WP brand. In addition, the company engages in manufacturing, developing, and trading e-bikes and bicycles under the Husqvarna E-Bicycles and R RAYMON brands, as well as motorcycles under the GASGAS brand. Further, it provides digital strategy, mobile and web applications, and business solutions. The company was formerly known as KTM Industries AG and changed its name to PIERER Mobility AG in October 2019. PIERER Mobility AG was founded in 1953 and is based in Wels, Austria. PIERER Mobility AG is a subsidiary of PTW Holding AG.",
    "website": "http://www.pierermobility.com",
    "zipcode": "4600"
  },
  "SLFFF": {
    "city": "Auckland",
    "country": "New Zealand",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Recreational Vehicles",
    "long_name": "Future Mobility Solutions Limited",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "FUTURE MOBILITY SOLUTIONS LTD",
    "state": null,
    "summary": "Future Mobility Solutions Limited, together with its subsidiaries, manufactures and supplies small boats in New Zealand, the United States, Malaysia, Australia, the Middle East, Europe, and internationally. The company offers amphibious, foldable and semi-rigid, and rigid inflatable boats. It serves government, commercial, and recreational customers. The company was formerly known as Sealegs Corporation Limited and changed its name to Future Mobility Solutions Limited in January 2017. Future Mobility Solutions Limited was incorporated in 1987 and is based in Auckland, New Zealand.",
    "website": "http://www.futuremobilitysolutions.net",
    "zipcode": "0632"
  },
  "TAIG.TO": {
    "city": "Lasalle",
    "country": "Canada",
    "currency": "CAD",
    "exchange": "TOR",
    "industry": "Recreational Vehicles",
    "long_name": "Taiga Motors Corporation",
    "market": "ca_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "TAIGA MOTORS CORPORATION",
    "state": "QC",
    "summary": "Taiga Motors Corporation manufactures and sells electric snowmobiles, watercrafts, and off-road vehicles. The company was incorporated in 2015 and is based in LaSalle, Canada.",
    "website": "http://www.taigamotors.ca",
    "zipcode": "H8N 2J8"
  },
  "TGO.F": {
    "city": "Paris",
    "country": "France",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "Trigano S.A.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "TRIGANO SA INH. EO 4,2567",
    "state": null,
    "summary": "Trigano S.A. designs, manufactures, markets, and sells leisure vehicles and trailers for individuals and professionals in Europe. The company operates through Leisure Vehicles and Leisure Equipment segments. It offers leisure vehicles, including caravans, motorhomes, and mobile homes; camping and garden equipment; tents; and baggage and utility trailers, as well as accessories for leisure vehicles. The company also rents motorhomes; and provides finance for leisure vehicles, as well as offers a range of rental stay services in mobile homes. It offers its products through dealer networks and distributors, as well as through its online sales site, Triganostore.com. The company was founded in 1935 and is based in Paris, France.",
    "website": "http://www.trigano.fr",
    "zipcode": "75165"
  },
  "THO": {
    "city": "Elkhart",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Recreational Vehicles",
    "long_name": "Thor Industries, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Thor Industries, Inc.",
    "state": "IN",
    "summary": "Thor Industries, Inc. designs, manufactures, and sells recreational vehicles (RVs), and related parts and accessories in the United States, Canada, and Europe. It offers travel trailers under the Airstream Classic, Globetrotter, International, Flying Cloud, Caravel, Bambi, and Basecamp trade names; Class B motorhomes under the Interstate and Atlas series, and Sequence and Tellaro trade names; and gasoline and diesel Class A and Class C motorhomes under the Four Winds, Freedom Elite, Majestic, Hurricane, Chateau, Windsport, Axis, Vegas, Tuscany, Palazzo, Aria, Quantum, Compass, Gemini, and A.C.E trade names. It also provides conventional travel trailers and fifth wheels under the Montana, Springdale, Hideout, Sprinter, Outback, Laredo, Bullet, Fuzion, Raptor, Passport, Cougar, Coleman, Kodiak, Aspen Trail, Aerolite, Voltage, Cruiser, Volante, Sunset Trail, Zinger, Landmark, Bighorn, Elkridge, Trail Runner, North Trail, Cyclone, Torque, Prowler, Milestone, Shadow Cruiser, Lithium, MPG, Radiance, Sundance, Stryker, Escape, Sportsmen, Connect, Venom, Gold, Durango, Sportster, Stratus, SportTrek, Sonic, Jay Flight, Jay Feather, Eagle, Pinnacle, Talon, Autumn Ridge, Telluride, Highlander, Mesa Ridge, and Open Range trade names; and luxury fifth wheels under the Redwood and DRV Mobile Suites trade names. It offers Class A and Class C motorhomes under the Alante, Precept, Greyhawk, Redhawk, Odyssey, Esteem, Emblem, Insignia, Aspire, Anthem, and Cornerstone trade names. It also provides motorcaravans, caravans, campervans, and urban vehicles under the Buccaneer, Buerstner, Carado, Compass, CrossCamp, Dethleffs, Elddis, Eriba, Etrusco, Hymer, Laika, LMC, Niesmann+Bischoff, Sunlight, and Xplore brands. It offers aluminum extrusion and specialized component products to RV and other manufacturers; and digital products and services for RVs. It provides its products through independent and non-franchise dealers. The company was founded in 1980 and is based in Elkhart, Indiana.",
    "website": "http://www.thorindustries.com",
    "zipcode": "46514-3305"
  },
  "TIV.F": {
    "city": "Elkhart",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "Thor Industries, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "THOR IND. INC.  DL-,10",
    "state": "IN",
    "summary": "Thor Industries, Inc. designs, manufactures, and sells recreational vehicles (RVs), and related parts and accessories in the United States, Canada, and Europe. It offers travel trailers under the Airstream Classic, Globetrotter, International, Flying Cloud, Caravel, Bambi, and Basecamp trade names; Class B motorhomes under the Interstate and Atlas series, and Sequence and Tellaro trade names; and gasoline and diesel Class A and Class C motorhomes under the Four Winds, Freedom Elite, Majestic, Hurricane, Chateau, Windsport, Axis, Vegas, Tuscany, Palazzo, Aria, Quantum, Compass, Gemini, and A.C.E trade names. It also provides conventional travel trailers and fifth wheels under the Montana, Springdale, Hideout, Sprinter, Outback, Laredo, Bullet, Fuzion, Raptor, Passport, Cougar, Coleman, Kodiak, Aspen Trail, Aerolite, Voltage, Cruiser, Volante, Sunset Trail, Zinger, Landmark, Bighorn, Elkridge, Trail Runner, North Trail, Cyclone, Torque, Prowler, Milestone, Shadow Cruiser, Lithium, MPG, Radiance, Sundance, Stryker, Escape, Sportsmen, Connect, Venom, Gold, Durango, Sportster, Stratus, SportTrek, Sonic, Jay Flight, Jay Feather, Eagle, Pinnacle, Talon, Autumn Ridge, Telluride, Highlander, Mesa Ridge, and Open Range trade names; and luxury fifth wheels under the Redwood and DRV Mobile Suites trade names. It offers Class A and Class C motorhomes under the Alante, Precept, Greyhawk, Redhawk, Odyssey, Esteem, Emblem, Insignia, Aspire, Anthem, and Cornerstone trade names. It also provides motorcaravans, caravans, campervans, and urban vehicles under the Buccaneer, Buerstner, Carado, Compass, CrossCamp, Dethleffs, Elddis, Eriba, Etrusco, Hymer, Laika, LMC, Niesmann+Bischoff, Sunlight, and Xplore brands. It offers aluminum extrusion and specialized component products to RV and other manufacturers; and digital products and services for RVs. It provides its products through independent and non-franchise dealers. The company was founded in 1980 and is based in Elkhart, Indiana.",
    "website": "http://www.thorindustries.com",
    "zipcode": "46514-3305"
  },
  "TRI.PA": {
    "city": "Paris",
    "country": "France",
    "currency": "EUR",
    "exchange": "PAR",
    "industry": "Recreational Vehicles",
    "long_name": "Trigano S.A.",
    "market": "fr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "TRIGANO",
    "state": null,
    "summary": "Trigano S.A. designs, manufactures, markets, and sells leisure vehicles and trailers for individuals and professionals in Europe. The company operates through Leisure Vehicles and Leisure Equipment segments. It offers leisure vehicles, including caravans, motorhomes, and mobile homes; camping and garden equipment; tents; and baggage and utility trailers, as well as accessories for leisure vehicles. The company also rents motorhomes; and provides finance for leisure vehicles, as well as offers a range of rental stay services in mobile homes. It offers its products through dealer networks and distributors, as well as through its online sales site, Triganostore.com. The company was founded in 1935 and is based in Paris, France.",
    "website": "http://www.trigano.fr",
    "zipcode": "75165"
  },
  "VMT.AX": {
    "city": "West Perth",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Recreational Vehicles",
    "long_name": "Vmoto Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "VMOTO FPO",
    "state": "WA",
    "summary": "Vmoto Limited, together with its subsidiaries, engages in the design, manufacture, marketing, and distribution of electric two-wheel vehicle worldwide. Its electric two-wheel vehicle includes electric mopeds and motorcycles. The company offers its products primarily under the Vmoto, Super Soco, and E-Max brand names. Vmoto Limited was incorporated in 2001 and is based in West Perth, Australia.",
    "website": "http://www.vmoto.com",
    "zipcode": "6005"
  },
  "WGO": {
    "city": "Forest City",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Recreational Vehicles",
    "long_name": "Winnebago Industries, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Winnebago Industries, Inc.",
    "state": "IA",
    "summary": "Winnebago Industries, Inc. manufactures and sells recreation vehicles and marine products primarily for use in leisure travel and outdoor recreation activities. The company operates in six segments: Grand Design Towables, Winnebago Towables, Winnebago Motorhomes, Newmar motorhomes, Chris-Craft Marine, and Winnebago Specialty Vehicles. It provides towable products that are non-motorized vehicles to be towed by automobiles, pickup trucks, SUVs, or vans for use as temporary living quarters for recreational travel, such as conventional travel trailers, fifth wheels, folding camper trailers, and truck campers under the Winnebago and Grand Design brand names. The company also offers motorhomes, which are self-propelled mobile dwellings used primarily as temporary living quarters during vacation and camping trips, or to support active and mobile lifestyles under the Winnebago and Newmar brand names. In addition, it offers other specialty commercial vehicles for law enforcement command centers, mobile medical clinics, and mobile office spaces; commercial vehicles as bare shells to third-party up fitters; and boats in the recreational powerboat industry under the Chris-Craft brand name. Further, the company is involved in the original equipment manufacturing of parts for other manufacturers and commercial vehicles. The company sells its products primarily through independent dealers in the United States, Canada, and internationally. Winnebago Industries, Inc. was founded in 1958 and is based in Forest City, Iowa.",
    "website": "http://www.winnebagoind.com",
    "zipcode": "50436"
  },
  "WI1.F": {
    "city": "Forest City",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Recreational Vehicles",
    "long_name": "Winnebago Industries, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Cyclical",
    "short_name": "WINNEBAGO IND.  DL-,50",
    "state": "IA",
    "summary": "Winnebago Industries, Inc. manufactures and sells recreation vehicles and marine products primarily for use in leisure travel and outdoor recreation activities. The company operates in six segments: Grand Design Towables, Winnebago Towables, Winnebago Motorhomes, Newmar motorhomes, Chris-Craft Marine, and Winnebago Specialty Vehicles. It provides towable products that are non-motorized vehicles to be towed by automobiles, pickup trucks, SUVs, or vans for use as temporary living quarters for recreational travel, such as conventional travel trailers, fifth wheels, folding camper trailers, and truck campers under the Winnebago and Grand Design brand names. The company also offers motorhomes, which are self-propelled mobile dwellings used primarily as temporary living quarters during vacation and camping trips, or to support active and mobile lifestyles under the Winnebago and Newmar brand names. In addition, it offers other specialty commercial vehicles for law enforcement command centers, mobile medical clinics, and mobile office spaces; commercial vehicles as bare shells to third-party up fitters; and boats in the recreational powerboat industry under the Chris-Craft brand name. Further, the company is involved in the original equipment manufacturing of parts for other manufacturers and commercial vehicles. The company sells its products primarily through independent dealers in the United States, Canada, and internationally. Winnebago Industries, Inc. was founded in 1958 and is based in Forest City, Iowa.",
    "website": "http://www.winnebagoind.com",
    "zipcode": "50436"
  }
}
