{
    "GABA": {
        "short_name": "GEORGIA BANCSHARES INC",
        "long_name": "Georgia Bancshares, Inc.",
        "summary": "Georgia Bancshares, Inc. operates as the holding company of The Bank of Georgia that provides commercial and retail banking services to individuals and small to medium-sized businesses in Georgia. The company's personal banking services include deposit products, such as checking and money market accounts, savings accounts, certificates of deposit, and individual retirement accounts; and personal, auto, mortgage, and home equity loans, as well as home equity lines of credit. Its business banking services comprise checking and commercial savings accounts; business loans, such as commercial real estate, construction, financing on owner occupied or investment real estate, refinance of existing debt secured by real estate, land acquisition and development, church, non-profit organization, working capital, fixed asset and equipment purchase, accounts receivable, expansion plan, operating lines of credit, letters of credit, and small business administration guaranteed loans; and cash management services. The company also offers various services, such as money transfers, online banking, Web bill pay, mobile banking, express e-statements, Visa check card, and overdraft services, as well as telebanking, credit cards, safe deposit boxes, night depository, wire, and cashier's checks services. It operates seven branches located in Fayette, Coweta, and Fulton counties in Georgia. The company was founded in 1999 and is headquartered in Peachtree City, Georgia.",
        "currency": "USD",
        "sector": "Financial",
        "industry": "Regional - Mid-Atlantic Banks",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Peachtree City",
        "zipcode": "30269",
        "website": "http://www.bankofgeorgia.com",
        "market_cap": "Small Cap"
    }
}