{
    "1BR1.F": {
        "short_name": "URW (STAPLED SHS)  EO-,05",
        "long_name": "Unibail-Rodamco-Westfield SE",
        "summary": "Unibail-Rodamco-Westfield is the premier global developer and operator of Flagship Destinations, with a portfolio valued at Â\u008058.3 Bn as at September 30, 2020, of which 86% in retail, 7% in offices, 5% in convention & exhibition venues and 2% in services. Currently, the Group owns and operates 89 shopping centres, including 55 Flagships in the most dynamic cities in Europe and the United States. Its centres welcome 1.2 billion visits per year. Present on two continents and in 12 countries, Unibail-Rodamco-Westfield provides a unique platform for retailers and brand events and offers an exceptional and constantly renewed experience for customers. With the support of its 3,400 professionals and an unparalleled track-record and know-how, Unibail-Rodamco-Westfield is ideally positioned to generate superior value and develop world-class projects. Unibail-Rodamco-Westfield distinguishes itself by its Better Places 2030 agenda, that sets its ambition to create better places that respect the highest environmental standards and contribute to better cities. Unibail-Rodamco-Westfield stapled shares are listed on Euronext Amsterdam and Euronext Paris (Euronext ticker: URW), with a secondary listing in Australia through Chess Depositary Interests. The Group benefits from an A- rating from Standard & Poor's and from a Baa1 rating from Moody's.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75772",
        "website": "http://www.urw.com",
        "market_cap": "Large Cap"
    },
    "1D3.F": {
        "short_name": "SERITAGE GWTH PR.A DL-,01",
        "long_name": "Seritage Growth Properties",
        "summary": "Seritage Growth Properties is a publicly-traded, self-administered and self-managed REIT with 166 wholly-owned properties and 29 unconsolidated properties totaling approximately 30.4 million square feet of space across 44 states and Puerto Rico. The Company was formed to unlock the underlying real estate value of a high-quality retail portfolio it acquired from Sears Holdings in July 2015. The Company's mission is to create and own revitalized shopping, dining, entertainment and mixed-use destinations that provide enriched experiences for consumers and local communities, and create long-term value for our shareholders.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10110",
        "website": "http://www.seritage.com",
        "market_cap": "Small Cap"
    },
    "2QR.F": {
        "short_name": "ORF CVA",
        "long_name": "Qrf Comm. VA",
        "summary": "Qrf Comm. VA is a publicly owned real estate investment trust. It invests in the real estate markets of Belgium. The firm specializes in retail properties. Qrf Comm. VA was founded in September 3, 2013 and is based in Belgium.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Belgium",
        "state": null,
        "city": "Antwerp",
        "zipcode": "2000",
        "website": "http://www.qrf.be",
        "market_cap": "Small Cap"
    },
    "3453.T": {
        "short_name": "KENEDIX RETAIL REIT CORP",
        "long_name": "Kenedix Retail REIT Corporation",
        "summary": "Kenedix Retail REIT Corporation became the first J-REIT (real estate investment trust) to focus primarily on neighborhood, community and other shopping centers that cater to the day-to-day needs of local area customers when it was listed on the Tokyo Stock Exchange in February 2015. Since our IPO, we have steadily accumulated our assets under management, building a stable portfolio of over 220 billion yen in five years.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.krr-reit.com",
        "market_cap": "Small Cap"
    },
    "3462.T": {
        "short_name": "NOMURA REAL ESTATE MASTER FUND ",
        "long_name": "Nomura Real Estate Master Fund, Inc.",
        "summary": "Nomura Real Estate Master Fund,Inc. is a real estate investment trust (REIT) company. It aims to achieve sustainable growth in asset and stable earnings from mid-term to long-term perspectives. The Fund mainly invests in commercial buildings and logistic facilities located in the Tokyo area, Kinki area and other regions. The Fund manager is Nomura Real Estate Asset Management Co., Ltd.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.nre-mf.co.jp",
        "market_cap": "Mid Cap"
    },
    "943.F": {
        "short_name": "FREY  EO 2,50",
        "long_name": "Frey SA",
        "summary": "Frey SA engages in developing, owning, and managing commercial real estate assets primarily located in France. The company primarily operates environmental retail parks. As of December 31, 2010, its assets included 62,000 square meters. The company was formerly known as Immobiliere Frey SA and changed its name to Frey SA in June 2009. Frey SA was founded in 1983 and is based in Reims, France.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75001",
        "website": "http://www.frey.fr",
        "market_cap": "Small Cap"
    },
    "ADC": {
        "short_name": "Agree Realty Corporation",
        "long_name": "Agree Realty Corporation",
        "summary": "Agree Realty Corporation is a publicly traded real estate investment trust primarily engaged in the acquisition and development of properties net leased to industry-leading retail tenants. As of September 30, 2020, the Company owned and operated a portfolio of 1,027 properties, located in 45 states and containing approximately 21.0 million square feet of gross leasable area. The Company's common stock is listed on the New York Stock Exchange under the symbol \"ADC\".",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MI",
        "city": "Bloomfield Hills",
        "zipcode": "48304",
        "website": "http://www.agreerealty.com",
        "market_cap": "Mid Cap"
    },
    "AGL.F": {
        "short_name": "AGREE RLTY CORP. DL-,0001",
        "long_name": "Agree Realty Corporation",
        "summary": "Agree Realty Corporation is a publicly traded real estate investment trust primarily engaged in the acquisition and development of properties net leased to industry-leading retail tenants. As of September 30, 2020, the Company owned and operated a portfolio of 1,027 properties, located in 45 states and containing approximately 21.0 million square feet of gross leasable area. The Company's common stock is listed on the New York Stock Exchange under the symbol \"ADC\".",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MI",
        "city": "Bloomfield Hills",
        "zipcode": "48304",
        "website": "http://www.agreerealty.com",
        "market_cap": "Mid Cap"
    },
    "AKMGY.IS": {
        "short_name": "AKMERKEZ GMYO",
        "long_name": "Akmerkez Gayrimenkul Yatirim Ortakligi A.S.",
        "summary": "Akmerkez Gayrimenkul Yatirim Ortakligi A.S. operates as a real estate investment association in Turkey. It engages in the investment, ownership, development, and rental of real estate properties, primarily shopping centers. The company was formerly known as Akmerkez Gayrimenkul Yatirimi A.S. and changed its name to Akmerkez Gayrimenkul Yatirim Ortakligi A.S. in February 2005. Akmerkez Gayrimenkul Yatirim Ortakligi A.S. is based in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "ISTANBUL",
        "zipcode": null,
        "website": "http://www.akmgyo.com",
        "market_cap": "Small Cap"
    },
    "AKR": {
        "short_name": "Acadia Realty Trust",
        "long_name": "Acadia Realty Trust",
        "summary": "Acadia Realty Trust is an equity real estate investment trust focused on delivering long-term, profitable growth via its dual Â\u0096 Core Portfolio and Fund Â\u0096 operating platforms and its disciplined, location-driven investment strategy. Acadia Realty Trust is accomplishing this goal by building a best-in-class core real estate portfolio with meaningful concentrations of assets in the nation's most dynamic corridors; making profitable opportunistic and value-add investments through its series of discretionary, institutional funds; and maintaining a strong balance sheet.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Rye",
        "zipcode": "10580",
        "website": "http://www.acadiarealty.com",
        "market_cap": "Small Cap"
    },
    "ALLY.BK": {
        "short_name": "ALLY LEASEHOLD REAL ESTATE INVE",
        "long_name": "Ally Leasehold Real Estate Investment Trust",
        "summary": "Bualuang K.E.Retail Leasehold Real Estate Investment Trust specializes in real estate investments.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10900",
        "website": null,
        "market_cap": "Small Cap"
    },
    "ALX": {
        "short_name": "Alexander's, Inc.",
        "long_name": "Alexander's, Inc.",
        "summary": "Alexander's, Inc. is a real estate investment trust which has seven properties in the greater New York City metropolitan area.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Paramus",
        "zipcode": "07652",
        "website": "http://www.alx-inc.com",
        "market_cap": "Small Cap"
    },
    "APF.JO": {
        "short_name": "Accelerate Prop Fund Ltd",
        "long_name": "Accelerate Property Fund Limited",
        "summary": "Accelerate Property Fund is a listed Real Estate Investment Trust (REIT) offering investors the opportunity to share in a portfolio of well-established high-quality properties across South Africa.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2055",
        "website": "http://acceleratepf.co.za",
        "market_cap": null
    },
    "AQR.AX": {
        "short_name": "APNCONREIT STAPLED",
        "long_name": "APN Convenience Retail REIT",
        "summary": "APN Convenience Retail REIT (ASX code: AQR) is a listed Australian real estate investment trust which owns high quality Australian service stations and convenience retail assets. The Fund's portfolio of 79 properties valued at approximately $445 million, is predominantly located on Australia's eastern seaboard and is leased to leading Australian and international convenience retail tenants. The portfolio provides a long lease expiry profile and contracted annual rent increases delivering the Fund a sustainable and strong level of income security. Convenience Retail has a target gearing range of 25 Â\u0096 40% as part of its conservative approach to capital management. APN Convenience Retail REIT is governed by an Independent Board of Directors and is managed by APN Property Group, a specialist real estate investment manager established in 1996.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://apngroup.com.au/fund/apn-convenience-retail-reit/",
        "market_cap": "Small Cap"
    },
    "ASC.BR": {
        "short_name": "ASCENCIO",
        "long_name": "Ascencio SCA",
        "summary": "Ascencio is based in Gosselies, Belgium.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "BRU",
        "market": "be_market",
        "country": "Belgium",
        "state": null,
        "city": "Gosselies",
        "zipcode": "6041",
        "website": "http://www.ascencio.be",
        "market_cap": "Small Cap"
    },
    "AU8U.SI": {
        "short_name": "CapLand China T",
        "long_name": "CapitaLand China Trust",
        "summary": "CapitaLand China Trust (CLCT), formerly known as CapitaLand Retail China Trust, is Singapore's largest China-focused real estate investment trust (REIT). Upon completion of the transformational acquisition of five business parks and balance 49% interest in Rock Square, CLCT's enlarged portfolio will comprise of 13 shopping malls and five business park properties. The geographically diversified portfolio has a total gross floor area (GFA) of approximately 1.8 million square metre (sq m), located across 11 leading Chinese cities. CLCT was listed on the Singapore Exchange Securities Trading Limited (SGX-ST) on 8 December 2006, and established with the objective of investing on a long-term basis in a diversified portfolio of income-producing real estate and real estate-related assets in mainland China, Hong Kong and Macau that are used primarily for retail, office and industrial purposes (including business parks, logistics facilities, data centres and integrated developments). CLCT's retail properties are strategically located in densely populated areas with good connectivity to public transport. The malls are positioned as one-stop family-oriented destinations housing a wide range of lifestyle offerings that cater to varied consumer preferences in shopping, dining and entertainment as well as essential services. CLCT's portfolio comprises a diverse mix of more than 2,000 leases, which include leading brands UNIQLO, Xiaomi, ZARA, Haidilao, Nike, Sephora, Starbucks Coffee and Swarovski. The malls are CapitaMall Xizhimen, CapitaMall Wangjing, CapitaMall Grand Canyon and CapitaMall Shuangjing in Beijing; Rock Square in Guangzhou; CapitaMall Xinnan in Chengdu; CapitaMall Qibao in Shanghai; CapitaMall Minzhongleyuan in Wuhan; CapitaMall Saihan and CapitaMall Nuohemule in Hohhot; CapitaMall Xuefu, CapitaMall Aidemengdun in Harbin and CapitaMall Yuhuating in Changsha. CLCT has a portfolio of five business parks situated in high-growth economic zones which house high quality and reputable domestic and multinational corporations operating in new economy sectors such as Electronics, Engineering, E-Commerce, Information and Communications Technology and Financial Services. The business parks exhibit excellent connectivity with close proximity to transportation hubs, and are easily accessible via various modes of transportation. The properties are Ascendas Xinsu Portfolio in Suzhou, Ascendas Innovation Towers and Ascendas Innovation Hub in Xi'an and Singapore-Hangzhou Science & Technology Park Phase I and Phase II in Hangzhou. CLCT is managed by CapitaLand China Trust Management Limited, a wholly owned subsidiary of Singapore-listed CapitaLand Limited, one of Asia's largest diversified real estate groups.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068912",
        "website": "http://www.clct.com.sg",
        "market_cap": "Small Cap"
    },
    "AVN.AX": {
        "short_name": "AVENTUS STAPLED",
        "long_name": "Aventus Group",
        "summary": "Aventus Group is Australia's largest fully-integrated owner, manager and developer of large format retail centres in Australia with a portfolio of 20 centres valued at $2.2 billion. Aventus Group portfolio spans 536,000m2 in gross leasable area and features a diverse tenant base of 593 quality tenancies, with national tenants representing 87 per cent of the total portfolio. Our team of more than 70 professionals offer expertise in investment management, asset management and corporate services, delivering operational excellence and value at every stage of the investment cycle. Our single-sector focus has allowed Aventus to achieve sustainable income growth since the Fund was listed in October 2015, with consistently high occupancy, positive leasing spreads and low incentives across the portfolio.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.aventusgroup.com.au",
        "market_cap": "Mid Cap"
    },
    "AXE.F": {
        "short_name": "ALEXANDER'S INC.  DL 1",
        "long_name": "Alexander's, Inc.",
        "summary": "Alexander's, Inc. is a real estate investment trust which has seven properties in the greater New York City metropolitan area.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NJ",
        "city": "Paramus",
        "zipcode": "07652",
        "website": "http://www.alx-inc.com",
        "market_cap": "Small Cap"
    },
    "AXE.SG": {
        "short_name": "ALEXANDER'S INC. Registered Sha",
        "long_name": "Alexander's, Inc.",
        "summary": "Alexander's, Inc. is a real estate investment trust which has seven properties in the greater New York City metropolitan area.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "state": "NJ",
        "city": "Paramus",
        "zipcode": "07652",
        "website": "http://www.alx-inc.com",
        "market_cap": "Small Cap"
    },
    "BFS-PD": {
        "short_name": "Saul Centers, Inc. Depositary S",
        "long_name": "Saul Centers, Inc.",
        "summary": "Saul Centers, Inc. is a self-managed, self-administered equity REIT headquartered in Bethesda, Maryland, which currently operates and manages a real estate portfolio of 60 properties which includes (a) 50 community and neighborhood shopping centers and seven mixed-use properties with approximately 9.8 million square feet of leasable area and (b) three land and development properties. Approximately 85% of the Saul Centers' property operating income is generated by properties in the metropolitan Washington, DC/Baltimore area.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Bethesda",
        "zipcode": "20814",
        "website": "http://www.saulcenters.com",
        "market_cap": "Small Cap"
    },
    "BFS-PE": {
        "short_name": "Saul Centers, Inc. Depositary s",
        "long_name": "Saul Centers, Inc.",
        "summary": "Saul Centers, Inc. is a self-managed, self-administered equity REIT headquartered in Bethesda, Maryland, which currently operates and manages a real estate portfolio of 60 properties which includes (a) 50 community and neighborhood shopping centers and seven mixed-use properties with approximately 9.8 million square feet of leasable area and (b) three land and development properties. Approximately 85% of the Saul Centers' property operating income is generated by properties in the metropolitan Washington, DC/Baltimore area.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Bethesda",
        "zipcode": "20814",
        "website": "http://www.saulcenters.com",
        "market_cap": null
    },
    "BFS": {
        "short_name": "Saul Centers, Inc.",
        "long_name": "Saul Centers, Inc.",
        "summary": "Saul Centers, Inc. is a self-managed, self-administered equity REIT headquartered in Bethesda, Maryland, which currently operates and manages a real estate portfolio of 60 properties which includes (a) 50 community and neighborhood shopping centers and seven mixed-use properties with approximately 9.8 million square feet of leasable area and (b) three land and development properties. Approximately 85% of the Saul Centers' property operating income is generated by properties in the metropolitan Washington, DC/Baltimore area.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Bethesda",
        "zipcode": "20814",
        "website": "http://www.saulcenters.com",
        "market_cap": "Small Cap"
    },
    "BMGU.SI": {
        "short_name": "BHG Retail Reit",
        "long_name": "BHG Retail REIT",
        "summary": "BHG Retail REIT is the first pure-play China Retail REIT sponsored by a leading China integrated retail group. The REIT was listed on the Main Board of the Singapore Exchange Securities Trading Limited on 11 December 2015. The principal investment strategy of BHG Retail REIT is to invest, directly or indirectly, in a diversified portfolio of income-producing real estate which is used primarily for retail purposes (whether either wholly or partially), as well as real estate-related assets in relation to the foregoing, with an initial focus on China. As at 30 June 2020, the REIT's portfolio comprises six retail properties, Beijing Wanliu (60%), Chengdu Konggang, Hefei Mengchenglu, Hefei Changjiangxilu, Xining Huayuan, Dalian Jinsanjiao located in Tier 1, Tier 2 and other cities of significant economic potential in China. The portfolio gross floor area of about 311,691 sqm, has a committed occupancy of 92.9% as at 30 June 2020.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "179101",
        "website": "http://www.bhgreit.com",
        "market_cap": "Small Cap"
    },
    "BPYU": {
        "short_name": "Brookfield Property REIT Inc.",
        "long_name": "Brookfield Property REIT Inc.",
        "summary": "Brookfield Property REIT Inc. (Â\u0093BPYUÂ\u0094) is a subsidiary of Brookfield Property Partners L.P., (NASDAQ: BPY; TSX: BPY.UN) (Â\u0093BPYÂ\u0094) one of the world's premier real estate companies, with approximately $88 billion in total assets. BPYU was created as a public security that is intended to offer economic equivalence to an investment in BPY in the form of a U.S. REIT stock.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10281",
        "website": "http://www.bpy.brookfield.com",
        "market_cap": "Small Cap"
    },
    "BPYUP": {
        "short_name": "Brookfield Property REIT Inc. -",
        "long_name": "Brookfield Property REIT Inc.",
        "summary": "Brookfield Property REIT Inc. (Â\u0093BPYUÂ\u0094) is a subsidiary of Brookfield Property Partners L.P., (NASDAQ: BPY; TSX: BPY.UN) (Â\u0093BPYÂ\u0094) one of the world's premier real estate companies, with approximately $88 billion in total assets. BPYU was created as a public security that is intended to offer economic equivalence to an investment in BPY in the form of a U.S. REIT stock.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10281",
        "website": "http://www.bpy.brookfield.com",
        "market_cap": null
    },
    "BRX": {
        "short_name": "Brixmor Property Group Inc.",
        "long_name": "Brixmor Property Group Inc.",
        "summary": "Brixmor (NYSE: BRX) is a real estate investment trust (REIT) that owns and operates a high-quality, national portfolio of open-air shopping centers. Its 395 retail centers comprise approximately 69 million square feet of prime retail space in established trade areas. The Company strives to own and operate shopping centers that reflect Brixmor's vision \"to be the center of the communities we serve\" and are home to a diverse mix of thriving national, regional and local retailers. Brixmor is a proud real estate partner to approximately 5,000 retailers including The TJX Companies, The Kroger Co., Publix Super Markets, Wal-Mart, Ross Stores and L.A. Fitness.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10017",
        "website": "http://www.brixmor.com",
        "market_cap": "Mid Cap"
    },
    "BXR.F": {
        "short_name": "BRIXMOR PPTY GROUP INC.",
        "long_name": "Brixmor Property Group Inc.",
        "summary": "Brixmor (NYSE: BRX) is a real estate investment trust (REIT) that owns and operates a high-quality, national portfolio of open-air shopping centers. Its 395 retail centers comprise approximately 69 million square feet of prime retail space in established trade areas. The Company strives to own and operate shopping centers that reflect Brixmor's vision \"to be the center of the communities we serve\" and are home to a diverse mix of thriving national, regional and local retailers. Brixmor is a proud real estate partner to approximately 5,000 retailers including The TJX Companies, The Kroger Co., Publix Super Markets, Wal-Mart, Ross Stores and L.A. Fitness.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10017",
        "website": "http://www.brixmor.com",
        "market_cap": "Mid Cap"
    },
    "C20.F": {
        "short_name": "CAPITAL+COUNT.PR.LS-,25",
        "long_name": "Capital & Counties Properties PLC",
        "summary": "Capital & Counties Properties PLC, a property company, engages in investment, development, and management of properties. Its principal properties include Covent Garden, a retail and dining destination in central London. The company was incorporated in 2010 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "WC2E 8BU",
        "website": "http://www.capitalandcounties.com",
        "market_cap": "Small Cap"
    },
    "C38U.SI": {
        "short_name": "CapLand IntCom T",
        "long_name": "CapitaLand Integrated Commercial Trust",
        "summary": "CapitaLand Integrated Commercial Trust (CICT) is the first and largest real estate investment trust (REIT) listed on Singapore Exchange Securities Trading Limited (SGX-ST) with a market capitalisation of S$14.0 billion as at 31 December 2020. It debuted on SGX-ST as CapitaLand Mall Trust in July 2002 and was renamed CICT in November 2020 following the merger with CapitaLand Commercial Trust. CICT owns and invests in quality income-producing assets primarily used for commercial (including retail and/or office) purpose, located predominantly in Singapore. As the largest proxy for Singapore commercial real estate, CICT's portfolio comprises 22 properties in Singapore and two in Frankfurt, Germany, with a total property value of S$22.3 billion as at 31 December 2020. CICT is managed by CapitaLand Integrated Commercial Trust Management Limited, which is a wholly owned subsidiary of Singapore-listed CapitaLand Limited, one of Asia's largest diversified real estate groups.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068912",
        "website": "http://www.cict.com.sg",
        "market_cap": "Large Cap"
    },
    "CAL.L": {
        "short_name": "CAPITAL & REGIONAL PLC ORD 10P",
        "long_name": "Capital & Regional Plc",
        "summary": "Capital & Regional is a UK focused retail property REIT specialising in shopping centres that dominate their catchment, serving the non-discretionary and value orientated needs of the local communities. It has a strong track record of delivering value enhancing retail and leisure asset management opportunities across a portfolio of in-town shopping centres. Capital & Regional is listed on the main market of the London Stock Exchange (LSE) and has a secondary listing on the Johannesburg Stock Exchange (JSE). Capital & Regional owns seven shopping centres in Blackburn, Hemel Hempstead, Ilford, Luton, Maidstone, Walthamstow and Wood Green. Capital & Regional manages these assets through its in-house expert property and asset management platform.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SW1P 4NP",
        "website": "http://www.capreg.com",
        "market_cap": null
    },
    "CAPC.L": {
        "short_name": "CAPITAL & COUNTIES PROPERTIES P",
        "long_name": "Capital & Counties Properties PLC",
        "summary": "Capital & Counties Properties PLC, a property company, engages in investment, development, and management of properties. Its principal properties include Covent Garden, a retail and dining destination in central London. The company was incorporated in 2010 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "WC2E 8BU",
        "website": "http://www.capitalandcounties.com",
        "market_cap": null
    },
    "CARE11.SA": {
        "short_name": "FII DEA CARECI  ER",
        "long_name": "Máxima Renda Corporativa Fundo de Investimento Imobiliário - FII",
        "summary": "Maxima Renda Corporativa Fundo Invest Imobiliario-Cotas Fund specializes in real estate investments.",
        "currency": "BRL",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": null,
        "city": "Rio de Janeiro",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "CARM.PA": {
        "short_name": "CARMILA",
        "long_name": "Carmila S.A.",
        "summary": "The third listed company of shopping centres in Continental Europe, Carmila was created by Carrefour and major institutional investors to transform and enhance the shopping centres adjoining Carrefour stores in France, Spain and Italy. As of 30 June 2020, its portfolio consisted of 215 shopping centres, leaders in their catchment area, valued at 6.2 billion euros. Putting proximity at the heart of all its actions, Carmila aims to simplify life and improve the daily lives of merchants and customers in the heart of all territories. Driven by a true commercial culture, its teams integrate all the expertise dedicated to the attractiveness of its assets: operations, center management, marketing, local digital marketing, new business and CSR. Carmila is listed in Compartment A on Euronext-Paris under the symbol CARM. It benefits from the regime of listed real estate investment companies (\"SIIC\"). On September 18, 2017, Carmila joined the FTSE EPRA/NAREIT Global Real Estate (EMEA Region) indices. On September 24, 2018, Carmila joined the Euronext CAC Small, CAC Mid Small and CAC All-tradable indices.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Boulogne-Billancourt",
        "zipcode": "92100",
        "website": "http://www.carmila.com/en/",
        "market_cap": "Mid Cap"
    },
    "CAZ.F": {
        "short_name": "CBL + ASS. PROP.  DL-,01",
        "long_name": "CBL & Associates Properties, Inc.",
        "summary": "Headquartered in Chattanooga, TN, CBL Properties owns and manages a national portfolio of market-dominant properties located in dynamic and growing communities. CBL's portfolio is comprised of 106 properties totaling 65.7 million square feet across 25 states, including 64 high quality enclosed, outlet and open-air retail centers and 8 properties managed for third parties. CBL seeks to continuously strengthen its company and portfolio through active management, aggressive leasing and profitable reinvestment in its properties. On November 1, 2020, CBL & Associates Properties, Inc., along with its affiliates, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the Southern District of Texas.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TN",
        "city": "Chattanooga",
        "zipcode": "37421",
        "website": "http://www.cblproperties.com",
        "market_cap": "Small Cap"
    },
    "CBLAQ": {
        "short_name": "CBL & ASSOCIATES PROPERTIES INC",
        "long_name": "CBL & Associates Properties, Inc.",
        "summary": "Headquartered in Chattanooga, TN, CBL Properties owns and manages a national portfolio of market-dominant properties located in dynamic and growing communities. CBL's portfolio is comprised of 106 properties totaling 65.7 million square feet across 25 states, including 64 high quality enclosed, outlet and open-air retail centers and 8 properties managed for third parties. CBL seeks to continuously strengthen its company and portfolio through active management, aggressive leasing and profitable reinvestment in its properties. On November 1, 2020, CBL & Associates Properties, Inc., along with its affiliates, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the Southern District of Texas.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TN",
        "city": "Chattanooga",
        "zipcode": "37421",
        "website": "http://www.cblproperties.com",
        "market_cap": "Small Cap"
    },
    "CBLDQ": {
        "short_name": "CBL & ASSOCIATES PROPERTIES INC",
        "long_name": "CBL & Associates Properties, Inc.",
        "summary": "Headquartered in Chattanooga, TN, CBL Properties owns and manages a national portfolio of market-dominant properties located in dynamic and growing communities. CBL's portfolio is comprised of 106 properties totaling 65.7 million square feet across 25 states, including 64 high quality enclosed, outlet and open-air retail centers and 8 properties managed for third parties. CBL seeks to continuously strengthen its company and portfolio through active management, aggressive leasing and profitable reinvestment in its properties. On November 1, 2020, CBL & Associates Properties, Inc., along with its affiliates, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the Southern District of Texas.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TN",
        "city": "Chattanooga",
        "zipcode": "37421",
        "website": "http://www.cblproperties.com",
        "market_cap": null
    },
    "CBLEQ": {
        "short_name": "CBL & ASSOCIATES PROPERTIES INC",
        "long_name": "CBL & Associates Properties, Inc.",
        "summary": "Headquartered in Chattanooga, TN, CBL Properties owns and manages a national portfolio of market-dominant properties located in dynamic and growing communities. CBL's portfolio is comprised of 106 properties totaling 65.7 million square feet across 25 states, including 64 high quality enclosed, outlet and open-air retail centers and 8 properties managed for third parties. CBL seeks to continuously strengthen its company and portfolio through active management, aggressive leasing and profitable reinvestment in its properties. On November 1, 2020, CBL & Associates Properties, Inc., along with its affiliates, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the Southern District of Texas.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TN",
        "city": "Chattanooga",
        "zipcode": "37421",
        "website": "http://www.cblproperties.com",
        "market_cap": null
    },
    "CCO.JO": {
        "short_name": "Capital&Counties Prop plc",
        "long_name": "Capital & Counties Properties PLC",
        "summary": "Capital & Counties Properties PLC, a property company, engages in investment, development, and management of properties. Its principal properties include Covent Garden, a retail and dining destination in central London. The company was incorporated in 2010 and is headquartered in London, the United Kingdom.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "WC2E 8BU",
        "website": "http://www.capitalandcounties.com",
        "market_cap": null
    },
    "CDH.F": {
        "short_name": "CEDAR REALTY TR. DL-06",
        "long_name": "Cedar Realty Trust, Inc.",
        "summary": "Cedar Realty Trust, Inc. is a fully-integrated real estate investment trust which focuses on the ownership, operation and redevelopment of grocery-anchored shopping centers in high-density urban markets from Washington, D.C. to Boston. The Company's portfolio (excluding properties treated as \"held for sale\") comprises 54 properties, with approximately 8.1 million square feet of gross leasable area.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "Port Washington",
        "zipcode": "11050",
        "website": "http://www.cedarrealtytrust.com",
        "market_cap": "Small Cap"
    },
    "CDP.AX": {
        "short_name": "CARINDALE UNIT",
        "long_name": "Carindale Property Trust",
        "summary": "Westfield Carindale is situated in an affluent quarter of Brisbane's south-eastern suburbs approximately 12 kilometres from the Brisbane CBD. The centre services a trade area population of approximately 690,000 with the nearby Gateway Motorway offering residents to the north and south of the centre convenient access. One of the city's leading retail and lifestyle destinations, Westfield Carindale is home to many of Australia's most well-known retailers including David Jones, Myer, Harris Scarfe, Big W, Target, Coles, Woolworths, ALDI and Apple, as well as a host of premium fashion brands. An Event Cinemas complex and a range of other retailers including approximately 400 specialty stores complete the retail offer while the adjoining Carindale Home & Leisure Centre offers bulky goods retail.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.carindalepropertytrust.com.au",
        "market_cap": "Small Cap"
    },
    "CDR-PB": {
        "short_name": "Cedar Realty Trust, Inc. 7.25% ",
        "long_name": "Cedar Realty Trust, Inc.",
        "summary": "Cedar Realty Trust, Inc. is a fully-integrated real estate investment trust which focuses on the ownership, operation and redevelopment of grocery-anchored shopping centers in high-density urban markets from Washington, D.C. to Boston. The Company's portfolio (excluding properties treated as \"held for sale\") comprises 54 properties, with approximately 8.1 million square feet of gross leasable area.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Port Washington",
        "zipcode": "11050",
        "website": "http://www.cedarrealtytrust.com",
        "market_cap": "Small Cap"
    },
    "CDR-PC": {
        "short_name": "Cedar Realty Trust, Inc. 6.50% ",
        "long_name": "Cedar Realty Trust, Inc.",
        "summary": "Cedar Realty Trust, Inc. is a fully-integrated real estate investment trust which focuses on the ownership, operation and redevelopment of grocery-anchored shopping centers in high-density urban markets from Washington, D.C. to Boston. The Company's portfolio (excluding properties treated as \"held for sale\") comprises 54 properties, with approximately 8.1 million square feet of gross leasable area.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Port Washington",
        "zipcode": "11050",
        "website": "http://www.cedarrealtytrust.com",
        "market_cap": "Small Cap"
    },
    "CDR": {
        "short_name": "Cedar Realty Trust, Inc.",
        "long_name": "Cedar Realty Trust, Inc.",
        "summary": "Cedar Realty Trust, Inc. is a fully-integrated real estate investment trust which focuses on the ownership, operation and redevelopment of grocery-anchored shopping centers in high-density urban markets from Washington, D.C. to Boston. The Company's portfolio (excluding properties treated as \"held for sale\") comprises 54 properties, with approximately 8.1 million square feet of gross leasable area.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Port Washington",
        "zipcode": "11050",
        "website": "http://www.cedarrealtytrust.com",
        "market_cap": "Small Cap"
    },
    "CHP-UN.TO": {
        "short_name": "CHOICE PROPERTIES REIT",
        "long_name": "Choice Properties Real Estate Investment Trust",
        "summary": "Choice Properties, Canada's preeminent diversified real estate investment trust, is the owner, manager and developer of a high-quality portfolio comprising 725 properties totaling 66.1 million square feet of gross leasable area. Choice Properties owns a portfolio comprised of retail properties predominantly leased to necessity-based tenants; industrial, office and residential assets concentrated in attractive markets; and offers an impressive and substantial development pipeline. Choice Properties' strategic alliance with its principal tenant, Loblaw Companies Limited, the country's leading retailer, is a key competitive advantage providing long-term growth opportunities.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M4T 2S5",
        "website": "http://www.choicereit.ca",
        "market_cap": "Mid Cap"
    },
    "CMPNF": {
        "short_name": "CHAMPION REAL ESTATE INVESTMENT",
        "long_name": "Champion Real Estate Investment Trust",
        "summary": "Champion Real Estate Investment Trust is a trust formed to own and invest in income- producing office and retail properties. The Trust focuses on Grade-A commercial properties in prime locations. It currently offers investors direct exposure to 2.93 million sq. ft. of prime office and retail properties by way of two landmark properties, Three Garden Road and Langham Place, one on each side of the Victoria Harbour.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.championreit.com",
        "market_cap": "Mid Cap"
    },
    "CNRAF": {
        "short_name": "VICINITY CENTRES",
        "long_name": "Vicinity Centres",
        "summary": "Vicinity Centres (Vicinity or the Group) is one of Australia's leading retail property groups. With a fully integrated asset management platform, and $24 billion in retail assets under management across 63 shopping centres, it is the second largest listed manager of Australian retail property. Vicinity has a Direct Portfolio with interests in 60 shopping centres (including the DFO Brisbane business) and manages 31 assets on behalf of Strategic Partners, 28 of which are co-owned by the Group. Vicinity is listed on the Australian Securities Exchange (ASX) under the code Â\u0091VCX' and has over 28,000 securityholders. Vicinity also has European medium term notes listed on the ASX under the code Â\u0091VCD'.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Chadstone",
        "zipcode": "3148",
        "website": "http://www.vicinity.com.au",
        "market_cap": "Mid Cap"
    },
    "CPAMF": {
        "short_name": "CAPITALAND INTEGRATED COM TRUST",
        "long_name": "CapitaLand Integrated Commercial Trust",
        "summary": "CapitaLand Integrated Commercial Trust (CICT) is the first and largest real estate investment trust (REIT) listed on Singapore Exchange Securities Trading Limited (SGX-ST) with a market capitalisation of S$14.0 billion as at 31 December 2020. It debuted on SGX-ST as CapitaLand Mall Trust in July 2002 and was renamed CICT in November 2020 following the merger with CapitaLand Commercial Trust. CICT owns and invests in quality income-producing assets primarily used for commercial (including retail and/or office) purpose, located predominantly in Singapore. As the largest proxy for Singapore commercial real estate, CICT's portfolio comprises 22 properties in Singapore and two in Frankfurt, Germany, with a total property value of S$22.3 billion as at 31 December 2020. CICT is managed by CapitaLand Integrated Commercial Trust Management Limited, which is a wholly owned subsidiary of Singapore-listed CapitaLand Limited, one of Asia's largest diversified real estate groups.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068912",
        "website": "http://www.cict.com.sg",
        "market_cap": "Large Cap"
    },
    "CPNREIT.BK": {
        "short_name": "CPN RETAIL GROWTH LEASEHOLD REI",
        "long_name": "CPN Retail Growth Leasehold REIT",
        "summary": "CPN Retail Growth Leasehold REIT (Â\u0093CPNREITÂ\u0094) is Thailand's largest retail-focused real estate investment trust listed on the Stock Exchange of Thailand (Â\u0093SETÂ\u0094). CPNREIT was established from the conversion of CPN Retail Growth Leasehold Property Fund (Â\u0093CPNRFÂ\u0094) which was set up and publicly traded on the SET since 2005. Upon conversion on 1 December 2017, CPNREIT acquired all CPNRF's quality portfolio, and invested in a new mix-used project consisting of CentralFestival Pattaya Beach shopping center and Hilton Pattaya. At present, CPNREIT invested in a well-diversified portfolio of 5 shopping centers and 1 hotel across Thailand's prime destinations.",
        "currency": "THB",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10900",
        "website": "http://www.cpnreit.com",
        "market_cap": "Small Cap"
    },
    "CQR.AX": {
        "short_name": "CHRETAILRT UNIT",
        "long_name": "Charter Hall Retail Real Estate Investment Trust",
        "summary": "Charter Hall Retail REIT is the leading owner and manager of property for convenience retailers. Charter Hall Retail REIT is managed by Charter Hall Group (ASX:CHC). With over 29 years' experience in property investment and funds management, we're one of Australia's leading fully integrated property groups. We use our property expertise to access, deploy, manage and invest equity across our core sectors Â\u0096 office, retail, industrial and social infrastructure. Operating with prudence, Charter Hall Group as Manager of CQR has carefully curated a $40 billion diverse portfolio of over 1100 high quality, long leased properties. Partnership and financial discipline are at the heart of our approach. Acting in the best interest of customers and communities, we combine insight and inventiveness to unlock hidden value. Taking a long term view, our $7.3 billion development pipeline delivers sustainable, technologically enabled projects for our customers.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.charterhall.com.au/investments/funds/charter-hall-retail-reit",
        "market_cap": "Small Cap"
    },
    "CRP.JO": {
        "short_name": "Capital & Regional Plc",
        "long_name": "Capital & Regional Plc",
        "summary": "Capital & Regional is a UK focused retail property REIT specialising in shopping centres that dominate their catchment, serving the non-discretionary and value orientated needs of the local communities. It has a strong track record of delivering value enhancing retail and leisure asset management opportunities across a portfolio of in-town shopping centres. Capital & Regional is listed on the main market of the London Stock Exchange (LSE) and has a secondary listing on the Johannesburg Stock Exchange (JSE). Capital & Regional owns seven shopping centres in Blackburn, Hemel Hempstead, Ilford, Luton, Maidstone, Walthamstow and Wood Green. Capital & Regional manages these assets through its in-house expert property and asset management platform.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SW1P 4NP",
        "website": "http://www.capreg.com",
        "market_cap": null
    },
    "CRPU.SI": {
        "short_name": "Sasseur Reit",
        "long_name": "Sasseur Real Estate Investment Trust",
        "summary": "Sasseur Real Estate Investment Trust invests in a portfolio of real estate and related assets. The company operates through four segments: Chongqing Outlets, Bishan Outlets, Hefei Outlets, and Kunming Outlets. Its property portfolio comprises four retail outlet malls covering a gross floor area of 377,737 square meters located in the People's Republic of China. The company is based in Singapore. Sasseur Real Estate Investment Trust is a subsidiary of Sasseur Cayman Holding II.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "038987",
        "website": "http://www.sasseurreit.com",
        "market_cap": "Small Cap"
    },
    "CWYUF": {
        "short_name": "SMARTCENTRES REAL ESTATE INVEST",
        "long_name": "SmartCentres Real Estate Investment Trust",
        "summary": "SmartCentres Real Estate Investment Trust is one of Canada's largest fully integrated REITs, with a best-in-class portfolio featuring 166 strategically located properties in communities across the country. SmartCentres has approximately $10.4 billion in assets and owns 33.8 million square feet of income producing value-oriented retail space with 97.4% occupancy, on 3,500 acres of owned land across Canada. SmartCentres continues to focus on enhancing the lives of Canadians by planning and developing complete, connected, mixed-use communities on its existing retail properties. A publicly announced $11.9 billion intensification program ($5.4 billion at SmartCentres' share) represents the REIT's current major development focus on which construction is expected to commence within the next five years. This intensification program consists of rental apartments, condos, seniors' residences and hotels, to be developed under the SmartLiving banner, and retail, office, and storage facilities, to be developed under the SmartCentres banner. SmartCentres' intensification program is expected to produce an additional 59.3 million square feet (27.9 million square feet at SmartCentres' share) of space, 27.1 million square feet (12.3 million square feet at SmartCentres' share) of which has or will commence construction within next five years. From shopping centres to city centres, SmartCentres is uniquely positioned to reshape the Canadian urban and urban-suburban landscape. Included in this intensification program is the Trust's share of SmartVMC which, when completed, is expected to include approximately 11.0 million square feet of mixed-use space in Vaughan, Ontario. Construction of the first five sold-out phases of Transit City Condominiums that represent 2,789 residential units continues to progress. Final closings of the first two phases of Transit City Condominiums began ahead of budget and ahead of schedule in August 2020 and as at September 30, 2020, 766 units (representing approximately 70% of all 1,110 units in the first and second phases) had closed with the balance of units expected to close before year end. In addition, the presold 631 units in the third phase along with 22 townhomes, all of which are sold out and currently under construction, are expected to close in 2021. The fourth and fifth sold-out phases representing 1,026 units are currently under construction and are expected to close in 2023.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Vaughan",
        "zipcode": "L4K 5Z5",
        "website": "http://www.smartcentres.com",
        "market_cap": "Mid Cap"
    },
    "D5IU.SI": {
        "short_name": "Lippo Malls Tr",
        "long_name": "Lippo Malls Indonesia Retail Trust",
        "summary": "LMIR Trust is a Singapore-based real estate investment trust established with the principal investment objective of owning and investing, on a long-term basis, in a diversified portfolio of income-producing real estate in Indonesia that are primarily used for retail and/or retail-related purposes. LMIR Trust's current asset portfolio comprises 21 retail malls (Â\u0093Retail MallsÂ\u0094) and seven retail spaces located within other retail malls (Â\u0093Retail SpacesÂ\u0094, and collectively with the Retail Malls, the Â\u0093PropertiesÂ\u0094). The Properties have a total net lettable area of 839,907 square metres and total valuation of Rp15,716.1 billion as at 31 July 2020, and are strategically located in major cities of Indonesia with large middle-income population. Tenants include leading names such as Matahari Department Store, Zara, M&S, H&M, Sogo, Giant, Hypermart, Carrefour, Ace Hardware, as well as international specialty tenants such as Victoria's Secret, Promod, McDonalds, Pizza Hut, Kentucky Fried Chicken, A&W, Fitness First and Starbucks.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068809",
        "website": "http://www.lmir-trust.com",
        "market_cap": "Small Cap"
    },
    "DDR2.F": {
        "short_name": "SITE CENTERS NEW",
        "long_name": "SITE Centers Corp.",
        "summary": "SITE Centers is an owner and manager of open-air shopping centers that provide a highly-compelling shopping experience and merchandise mix for retail partners and consumers. The Company is a self-administered and self-managed REIT operating as a fully integrated real estate company, and is publicly traded on the New York Stock Exchange under the ticker symbol SITC.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Beachwood",
        "zipcode": "44122",
        "website": "http://www.sitecenters.com",
        "market_cap": "Mid Cap"
    },
    "ECMPA.AS": {
        "short_name": "EUROCOMMERCIAL",
        "long_name": "Eurocommercial Properties N.V.",
        "summary": "At the outset Eurocommercial invested in a variety of countries, including France where the Company made its first investment in 1992 with the acquisition of Les Atlantes shopping centre in Tours. In 1994 Eurocommercial purchased Curno in Bergamo, marking its first acquisition in Italy. Eurocommercial moved into the Swedish market in 2001. It re-entered the Belgian market in 2018 with the purchase of the Woluwe shopping centre. The Company is now one of Europe's most experienced property investors with a portfolio of shopping centres of Â\u00804.1 billion.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "AMS",
        "market": "nl_market",
        "country": "Netherlands",
        "state": null,
        "city": "Amsterdam",
        "zipcode": "1017 BS",
        "website": "http://www.eurocommercialproperties.com",
        "market_cap": "Small Cap"
    },
    "EPR-PC": {
        "short_name": "EPR Properties 5.75% Series C C",
        "long_name": "EPR Properties",
        "summary": "EPR Properties is a leading experiential net lease real estate investment trust (REIT), specializing in select enduring experiential properties in the real estate industry. We focus on real estate venues which create value by facilitating out of home leisure and recreation experiences where consumers choose to spend their discretionary time and money. We have nearly $6.7 billion in total investments across 44 states. We adhere to rigorous underwriting and investing criteria centered on key industry, property and tenant level cash flow standards. We believe our focused approach provides a competitive advantage and the potential for stable and attractive returns.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MO",
        "city": "Kansas City",
        "zipcode": "64106",
        "website": "http://www.eprkc.com",
        "market_cap": null
    },
    "EPR-PE": {
        "short_name": "EPR Properties Series E Cumulat",
        "long_name": "EPR Properties",
        "summary": "EPR Properties is a leading experiential net lease real estate investment trust (REIT), specializing in select enduring experiential properties in the real estate industry. We focus on real estate venues which create value by facilitating out of home leisure and recreation experiences where consumers choose to spend their discretionary time and money. We have nearly $6.7 billion in total investments across 44 states. We adhere to rigorous underwriting and investing criteria centered on key industry, property and tenant level cash flow standards. We believe our focused approach provides a competitive advantage and the potential for stable and attractive returns.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MO",
        "city": "Kansas City",
        "zipcode": "64106",
        "website": "http://www.eprkc.com",
        "market_cap": null
    },
    "EPR-PG": {
        "short_name": "EPR Properties 5.750% Series G ",
        "long_name": "EPR Properties",
        "summary": "EPR Properties is a leading experiential net lease real estate investment trust (REIT), specializing in select enduring experiential properties in the real estate industry. We focus on real estate venues which create value by facilitating out of home leisure and recreation experiences where consumers choose to spend their discretionary time and money. We have nearly $6.7 billion in total investments across 44 states. We adhere to rigorous underwriting and investing criteria centered on key industry, property and tenant level cash flow standards. We believe our focused approach provides a competitive advantage and the potential for stable and attractive returns.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MO",
        "city": "Kansas City",
        "zipcode": "64106",
        "website": "http://www.eprkc.com",
        "market_cap": "Mid Cap"
    },
    "EPR": {
        "short_name": "EPR Properties",
        "long_name": "EPR Properties",
        "summary": "EPR Properties is a leading experiential net lease real estate investment trust (REIT), specializing in select enduring experiential properties in the real estate industry. We focus on real estate venues which create value by facilitating out of home leisure and recreation experiences where consumers choose to spend their discretionary time and money. We have nearly $6.7 billion in total investments across 44 states. We adhere to rigorous underwriting and investing criteria centered on key industry, property and tenant level cash flow standards. We believe our focused approach provides a competitive advantage and the potential for stable and attractive returns.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MO",
        "city": "Kansas City",
        "zipcode": "64106",
        "website": "http://www.eprkc.com",
        "market_cap": "Mid Cap"
    },
    "F1RI34.SA": {
        "short_name": "FEDERAL REALDRN",
        "long_name": "Federal Realty Investment Trust",
        "summary": "Federal Realty is a recognized leader in the ownership, operation and redevelopment of high-quality retail-based properties located primarily in major coastal markets from Washington, D.C. to Boston as well as San Francisco and Los Angeles. Founded in 1962, Federal Realty's mission is to deliver long-term, sustainable growth through investing in densely populated, affluent communities where retail demand exceeds supply. Its expertise includes creating urban, mixed-use neighborhoods like Santana Row in San Jose, California, Pike & Rose in North Bethesda, Maryland and Assembly Row in Somerville, Massachusetts. These unique and vibrant environments that combine shopping, dining, living and working provide a destination experience valued by their respective communities. Federal Realty's 104 properties include approximately 2,800 tenants, in 24 million square feet, and approximately 2,800 residential units. Federal Realty has increased its quarterly dividends to its shareholders for 53 consecutive years, the longest record in the REIT industry. Federal Realty is an S&P 500 index member and its shares are traded on the NYSE under the symbol FRT.",
        "currency": "BRL",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "MD",
        "city": "North Bethesda",
        "zipcode": "20852",
        "website": "http://www.federalrealty.com",
        "market_cap": "Mid Cap"
    },
    "FGC1.F": {
        "short_name": "KITE REALTY GRP SBI DL-01",
        "long_name": "Kite Realty Group Trust",
        "summary": "Kite Realty Group Trust is a full-service, vertically integrated real estate investment trust (REIT) that provides communities with convenient and beneficial shopping experiences. We connect consumers to retailers in desirable markets through our portfolio of neighborhood, community, and lifestyle centers. Using operational, development, and redevelopment expertise, we continuously optimize our portfolio to maximize value and return to our shareholders.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IN",
        "city": "Indianapolis",
        "zipcode": "46204",
        "website": "http://www.kiterealty.com",
        "market_cap": "Small Cap"
    },
    "FLRP11.SA": {
        "short_name": "FII FLORIPA CI",
        "long_name": "Fundo de Investimento Imobiliário - FII Floripa Shopping",
        "summary": "Floripa Shopping Fundo De Investiment Imobiliario specializes in real estate investments.",
        "currency": "BRL",
        "sector": "Financial",
        "industry": "REIT - Retail",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": "SP",
        "city": "Sao Paulo",
        "zipcode": "04538-133",
        "website": null,
        "market_cap": null
    },
    "FREY.PA": {
        "short_name": "FREY",
        "long_name": "Frey SA",
        "summary": "Frey SA engages in developing, owning, and managing commercial real estate assets primarily located in France. The company primarily operates environmental retail parks. As of December 31, 2010, its assets included 62,000 square meters. The company was formerly known as Immobiliere Frey SA and changed its name to Frey SA in June 2009. Frey SA was founded in 1983 and is based in Reims, France.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75001",
        "website": "http://www.frey.fr",
        "market_cap": "Small Cap"
    },
    "FRT-PC": {
        "short_name": "Federal Realty Investment Trust",
        "long_name": "Federal Realty Investment Trust",
        "summary": "Federal Realty is a recognized leader in the ownership, operation and redevelopment of high-quality retail-based properties located primarily in major coastal markets from Washington, D.C. to Boston as well as San Francisco and Los Angeles. Founded in 1962, Federal Realty's mission is to deliver long-term, sustainable growth through investing in densely populated, affluent communities where retail demand exceeds supply. Its expertise includes creating urban, mixed-use neighborhoods like Santana Row in San Jose, California, Pike & Rose in North Bethesda, Maryland and Assembly Row in Somerville, Massachusetts. These unique and vibrant environments that combine shopping, dining, living and working provide a destination experience valued by their respective communities. Federal Realty's 104 properties include approximately 2,800 tenants, in 24 million square feet, and approximately 2,800 residential units. Federal Realty has increased its quarterly dividends to its shareholders for 53 consecutive years, the longest record in the REIT industry. Federal Realty is an S&P 500 index member and its shares are traded on the NYSE under the symbol FRT.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "North Bethesda",
        "zipcode": "20852",
        "website": "http://www.federalrealty.com",
        "market_cap": "Large Cap"
    },
    "FRT": {
        "short_name": "Federal Realty Investment Trust",
        "long_name": "Federal Realty Investment Trust",
        "summary": "Federal Realty is a recognized leader in the ownership, operation and redevelopment of high-quality retail-based properties located primarily in major coastal markets from Washington, D.C. to Boston as well as San Francisco and Los Angeles. Founded in 1962, Federal Realty's mission is to deliver long-term, sustainable growth through investing in densely populated, affluent communities where retail demand exceeds supply. Its expertise includes creating urban, mixed-use neighborhoods like Santana Row in San Jose, California, Pike & Rose in North Bethesda, Maryland and Assembly Row in Somerville, Massachusetts. These unique and vibrant environments that combine shopping, dining, living and working provide a destination experience valued by their respective communities. Federal Realty's 104 properties include approximately 2,800 tenants, in 24 million square feet, and approximately 2,800 residential units. Federal Realty has increased its quarterly dividends to its shareholders for 53 consecutive years, the longest record in the REIT industry. Federal Realty is an S&P 500 index member and its shares are traded on the NYSE under the symbol FRT.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "North Bethesda",
        "zipcode": "20852",
        "website": "http://www.federalrealty.com",
        "market_cap": "Mid Cap"
    },
    "FRZCF": {
        "short_name": "FRASERS CENTREPOINT TRUST",
        "long_name": "Frasers Centrepoint Trust",
        "summary": "Frasers Centrepoint Trust (Â\u0093FCTÂ\u0094) is a leading developer-sponsored retail real estate investment trust (Â\u0093REITÂ\u0094) and one of the largest suburban retail mall owners in Singapore with total assets of approximately S$6.7 billion. FCT's current property portfolio comprises 11 retail malls9 and an office building located in the suburban regions of Singapore, near homes and within minutes to transportation amenities. The retail portfolio has over 2.3 million square feet of net lettable area with over 1,500 leases with a strong focus on providing for necessity spending, food & beverage and essential services. The portfolio comprises Causeway Point, Northpoint City North Wing (including Yishun 10 Retail Podium), Anchorpoint, YewTee Point, Changi City Point, Waterway Point (40%-interest), Tiong Bahru Plaza, White Sands, Hougang Mall, Century Square and Tampines 1) and an office property (Central Plaza). FCT's malls enjoy stable and recurring shopper footfall supported by commuter traffic and residential population in the catchment. FCT also holds a 31.15% stake in Hektar Real Estate Investment Trust, a retail-focused REIT in Malaysia listed on the Main Market of Bursa Malaysia Securities Berhad. FCT is index constituent of several benchmark indices including the FTSE EPRA/NAREIT Global Real Estate Index Series (Global Developed Index), FTSE ST Real Estate investment Trust Index, MSCI Singapore Small Cap Index and the SGX iEdge S-REIT Leaders Index. Listed on the Main Board of the Singapore Exchange Securities Trading Limited since 5 July 2006, FCT is managed by Frasers Centrepoint Asset Management Ltd., a real estate management company and a wholly-owned subsidiary of Frasers Property Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "119958",
        "website": "http://www.frasersproperty.com/reits/fct",
        "market_cap": "Mid Cap"
    },
    "FSHOP13.MX": {
        "short_name": "CIBANCO SA INSTIT DE BANCA MULT",
        "long_name": "Fibra Shop",
        "summary": "FibraShop (BMV: FSHOP 13), is a unique real estate investment option in Mexico, due to its specialization, its management team with vast experience in the commercial real estate sector, and its solid operating structure and corporate governance, which together ensure transparency, efficiency, and safe and profitable growth. FibraShop is an infrastructure and real estate trust vehicle that was formed principally to acquire, own, administer, and develop real estate properties in shopping centers in Mexico. Fibra Shop is administered by industry specialists with extensive experience, and it is advised externally by Fibra Shop Portafolios Inmobiliarios S.C. Our objective is to provide attractive returns to our investors who hold CBFIs by means of stable distributions and capital appreciation.",
        "currency": "MXN",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Mexico",
        "state": "DF",
        "city": "Mexico City",
        "zipcode": "05109",
        "website": "http://www.fibrashop.mx",
        "market_cap": "Small Cap"
    },
    "FVT.JO": {
        "short_name": "Fairvest Property Hldgs",
        "long_name": "Fairvest Property Holdings Limited",
        "summary": "Fairvest Property Holdings Limited is a property investment holding company and Real Estate Investment Trust (\"REIT\"), with a unique focus on retail assets weighted toward non-metropolitan and rural shopping centres, as well as convenience and community shopping centres servicing the lower-LSM market, in high-growth nodes close to commuter networks.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "8001",
        "website": "http://fairvest.co.za",
        "market_cap": null
    },
    "GRL.F": {
        "short_name": "GETTY RLTY CORP.  DL-,01",
        "long_name": "Getty Realty Corp.",
        "summary": "Getty Realty Corp. is the leading publicly traded real estate investment trust in the United States specializing in the ownership, leasing and financing of convenience store and gasoline station properties. As of September 30, 2020, the Company owned 896 properties and leased 58 properties from third-party landlords in 35 states across the United States and Washington, D.C.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "Jericho",
        "zipcode": "11753",
        "website": "http://www.gettyrealty.com",
        "market_cap": "Small Cap"
    },
    "GTY": {
        "short_name": "Getty Realty Corporation",
        "long_name": "Getty Realty Corp.",
        "summary": "Getty Realty Corp. is the leading publicly traded real estate investment trust in the United States specializing in the ownership, leasing and financing of convenience store and gasoline station properties. As of September 30, 2020, the Company owned 896 properties and leased 58 properties from third-party landlords in 35 states across the United States and Washington, D.C.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Jericho",
        "zipcode": "11753",
        "website": "http://www.gettyrealty.com",
        "market_cap": "Small Cap"
    },
    "H2M.F": {
        "short_name": "HMG COURTLD PROP.  DL 1",
        "long_name": "HMG/Courtland Properties, Inc.",
        "summary": "HMG/Courtland Properties, Inc. and subsidiaries, is a Delaware corporation organized in 1972. The Company's business is the ownership and management of income-producing commercial properties and it will consider other investments if they offer growth or profit potential.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33133",
        "website": "http://www.hmgcourtland.com",
        "market_cap": "Small Cap"
    },
    "H2V2.F": {
        "short_name": "HAMMERSON PLC  LS-,05",
        "long_name": "Hammerson plc",
        "summary": "At Hammerson, we create vibrant, continually evolving spaces, in and around major cities, where people and brands want to be. We seek to deliver value for all our stakeholders and to create a positive and sustainable impact for generations to come. We own and operate high-quality flagship destinations and have investments in premium outlets in selected European countries and have a City Quarters strategy to evolve our portfolio beyond retail.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "N1 9GE",
        "website": "http://www.hammerson.com",
        "market_cap": "Mid Cap"
    },
    "HDN.AX": {
        "short_name": "HOMECO DNR UNITS",
        "long_name": "HomeCo Daily Needs REIT",
        "summary": "HomeCo Daily Needs REIT is an Australian Real Estate Investment Trust listed on the ASX with a mandate to invest in convenience-based assets across the target sub-sectors of Neighbourhood Retail, Large Format Retail and Health & Services. HomeCo Daily Needs REIT aims to provide unitholders with consistent and growing distributions. HomeCo Daily Needs REIT(ASX:HDN) operates independently of Home Consortium Limited as of December 31, 2020.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2028",
        "website": "http://www.home-co.com.au",
        "market_cap": "Small Cap"
    },
    "HGBS11.SA": {
        "short_name": "FII HEDGEBS CI  ER",
        "long_name": "HEDGE Brasil Shopping Fundo de Investimento Imobiliário",
        "summary": "CSHG Brasil Shopping FII specializes in real estate investing.",
        "currency": "BRL",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": "SP",
        "city": "Sao Paulo",
        "zipcode": "1830",
        "website": "http://www.cshg.com.br/site/publico/imob/imob2.seam",
        "market_cap": "Small Cap"
    },
    "HMN.JO": {
        "short_name": "Hammerson plc",
        "long_name": "Hammerson plc",
        "summary": "At Hammerson, we create vibrant, continually evolving spaces, in and around major cities, where people and brands want to be. We seek to deliver value for all our stakeholders and to create a positive and sustainable impact for generations to come. We own and operate high-quality flagship destinations and have investments in premium outlets in selected European countries and have a City Quarters strategy to evolve our portfolio beyond retail.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "N1 9GE",
        "website": "http://www.hammerson.com",
        "market_cap": null
    },
    "HMSNF": {
        "short_name": "HAMMERSON",
        "long_name": "Hammerson plc",
        "summary": "At Hammerson, we create vibrant, continually evolving spaces, in and around major cities, where people and brands want to be. We seek to deliver value for all our stakeholders and to create a positive and sustainable impact for generations to come. We own and operate high-quality flagship destinations and have investments in premium outlets in selected European countries and have a City Quarters strategy to evolve our portfolio beyond retail.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "N1 9GE",
        "website": "http://www.hammerson.com",
        "market_cap": "Mid Cap"
    },
    "HMSO.IR": {
        "short_name": "HAMMERSON PLC",
        "long_name": "Hammerson plc",
        "summary": "At Hammerson, we create vibrant, continually evolving spaces, in and around major cities, where people and brands want to be. We seek to deliver value for all our stakeholders and to create a positive and sustainable impact for generations to come. We own and operate high-quality flagship destinations and have investments in premium outlets in selected European countries and have a City Quarters strategy to evolve our portfolio beyond retail.",
        "currency": "GBP",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ISE",
        "market": "ie_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "N1 9GE",
        "website": "http://www.hammerson.com",
        "market_cap": "Mid Cap"
    },
    "HMSO.L": {
        "short_name": "HAMMERSON PLC ORD 5P",
        "long_name": "Hammerson plc",
        "summary": "At Hammerson, we create vibrant, continually evolving spaces, in and around major cities, where people and brands want to be. We seek to deliver value for all our stakeholders and to create a positive and sustainable impact for generations to come. We own and operate high-quality flagship destinations and have investments in premium outlets in selected European countries and have a City Quarters strategy to evolve our portfolio beyond retail.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "N1 9GE",
        "website": "http://www.hammerson.com",
        "market_cap": null
    },
    "HYP.JO": {
        "short_name": "Hyprop Inv Ltd",
        "long_name": "Hyprop Investments Limited",
        "summary": "Hyprop is a retail-focused REIT listed on the JSE with interests in a R48.5 billion portfolio of shopping centres in South Africa, Eastern Europe and sub-Saharan Africa. The Company's focus is on creating environments and opportunities for people to connect and have authentic and meaningful experiences. It does so by owning and managing dominant retail centres in mixed-used precincts, in key economic nodes in South Africa and Eastern Europe.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Rosebank",
        "zipcode": "2196",
        "website": "http://www.hyprop.co.za",
        "market_cap": null
    },
    "IJX.F": {
        "short_name": "VASTNED BELGIUM S.A.",
        "long_name": "Vastned Belgium",
        "summary": "Vastned Retail Belgium is a public regulated real estate company (RREC), the shares of which are listed on Euronext Brussels (VASTB). Vastned Retail Belgium invests exclusively in Belgian commercial real estate, more specifically in prime retail properties located on the best shopping streets in the major cities of Antwerp, Brussels, Ghent and Bruges. Furthermore, the real estate portfolio consists of inner-city shops outside of the premium cities, high-end retail parks and retail warehouses.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Belgium",
        "state": null,
        "city": "Antwerp",
        "zipcode": "2600",
        "website": "http://www.vastned.be",
        "market_cap": "Small Cap"
    },
    "J69U.SI": {
        "short_name": "FRASERS CENTREPOINT TRUST",
        "long_name": "Frasers Centrepoint Trust",
        "summary": "Frasers Centrepoint Trust (Â\u0093FCTÂ\u0094) is a leading developer-sponsored retail real estate investment trust (Â\u0093REITÂ\u0094) and one of the largest suburban retail mall owners in Singapore with total assets of approximately S$6.7 billion. FCT's current property portfolio comprises 11 retail malls9 and an office building located in the suburban regions of Singapore, near homes and within minutes to transportation amenities. The retail portfolio has over 2.3 million square feet of net lettable area with over 1,500 leases with a strong focus on providing for necessity spending, food & beverage and essential services. The portfolio comprises Causeway Point, Northpoint City North Wing (including Yishun 10 Retail Podium), Anchorpoint, YewTee Point, Changi City Point, Waterway Point (40%-interest), Tiong Bahru Plaza, White Sands, Hougang Mall, Century Square and Tampines 1) and an office property (Central Plaza). FCT's malls enjoy stable and recurring shopper footfall supported by commuter traffic and residential population in the catchment. FCT also holds a 31.15% stake in Hektar Real Estate Investment Trust, a retail-focused REIT in Malaysia listed on the Main Market of Bursa Malaysia Securities Berhad. FCT is index constituent of several benchmark indices including the FTSE EPRA/NAREIT Global Real Estate Index Series (Global Developed Index), FTSE ST Real Estate investment Trust Index, MSCI Singapore Small Cap Index and the SGX iEdge S-REIT Leaders Index. Listed on the Main Board of the Singapore Exchange Securities Trading Limited since 5 July 2006, FCT is managed by Frasers Centrepoint Asset Management Ltd., a real estate management company and a wholly-owned subsidiary of Frasers Property Limited.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "119958",
        "website": "http://www.frasersproperty.com/reits/fct",
        "market_cap": "Mid Cap"
    },
    "JRDM11.SA": {
        "short_name": "FII SHOPJSULCI  ER",
        "long_name": "Fundo de Investimento Imobiliário - FII Shopping Jardim Sul",
        "summary": null,
        "currency": "BRL",
        "sector": "Financial",
        "industry": "REIT - Retail",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": null,
        "city": null,
        "zipcode": null,
        "website": "http://www.ourinvest.com.br/pt/fundos-imobiliarios/fii-bm-jardim-sul",
        "market_cap": "Small Cap"
    },
    "K1IM34.SA": {
        "short_name": "KIMCO REALTYDRN",
        "long_name": "Kimco Realty Corporation",
        "summary": "Kimco Realty Corp. (NYSE:KIM) is a real estate investment trust (REIT) headquartered in Jericho, N.Y. that is one of North America's largest publicly traded owners and operators of open-air, grocery-anchored shopping centers and mixed-use assets. As of September 30, 2020, the company owned interests in 400 U.S. shopping centers and mixed-use assets comprising 70 million square feet of gross leasable space primarily concentrated in the top major metropolitan markets. Publicly traded on the NYSE since 1991, and included in the S&P 500 Index, the company has specialized in shopping center acquisitions, development and management for more than 60 years.",
        "currency": "BRL",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "NY",
        "city": "Jericho",
        "zipcode": "11753",
        "website": "http://www.kimcorealty.com",
        "market_cap": "Mid Cap"
    },
    "KIC.F": {
        "short_name": "KIMCO REALTY  DL-,01",
        "long_name": "Kimco Realty Corporation",
        "summary": "Kimco Realty Corp. (NYSE:KIM) is a real estate investment trust (REIT) headquartered in Jericho, N.Y. that is one of North America's largest publicly traded owners and operators of open-air, grocery-anchored shopping centers and mixed-use assets. As of September 30, 2020, the company owned interests in 400 U.S. shopping centers and mixed-use assets comprising 70 million square feet of gross leasable space primarily concentrated in the top major metropolitan markets. Publicly traded on the NYSE since 1991, and included in the S&P 500 Index, the company has specialized in shopping center acquisitions, development and management for more than 60 years.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "Jericho",
        "zipcode": "11753",
        "website": "http://www.kimcorealty.com",
        "market_cap": "Mid Cap"
    },
    "KIM-PL": {
        "short_name": "Kimco Realty Corporation Class ",
        "long_name": "Kimco Realty Corporation",
        "summary": "Kimco Realty Corp. (NYSE:KIM) is a real estate investment trust (REIT) headquartered in Jericho, N.Y. that is one of North America's largest publicly traded owners and operators of open-air, grocery-anchored shopping centers and mixed-use assets. As of September 30, 2020, the company owned interests in 400 U.S. shopping centers and mixed-use assets comprising 70 million square feet of gross leasable space primarily concentrated in the top major metropolitan markets. Publicly traded on the NYSE since 1991, and included in the S&P 500 Index, the company has specialized in shopping center acquisitions, development and management for more than 60 years.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Jericho",
        "zipcode": "11753",
        "website": "http://www.kimcorealty.com",
        "market_cap": "Mid Cap"
    },
    "KIM-PM": {
        "short_name": "Kimco Realty Corporation Class ",
        "long_name": "Kimco Realty Corporation",
        "summary": "Kimco Realty Corp. (NYSE:KIM) is a real estate investment trust (REIT) headquartered in Jericho, N.Y. that is one of North America's largest publicly traded owners and operators of open-air, grocery-anchored shopping centers and mixed-use assets. As of September 30, 2020, the company owned interests in 400 U.S. shopping centers and mixed-use assets comprising 70 million square feet of gross leasable space primarily concentrated in the top major metropolitan markets. Publicly traded on the NYSE since 1991, and included in the S&P 500 Index, the company has specialized in shopping center acquisitions, development and management for more than 60 years.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Jericho",
        "zipcode": "11753",
        "website": "http://www.kimcorealty.com",
        "market_cap": "Mid Cap"
    },
    "KIM": {
        "short_name": "Kimco Realty Corporation",
        "long_name": "Kimco Realty Corporation",
        "summary": "Kimco Realty Corp. (NYSE:KIM) is a real estate investment trust (REIT) headquartered in Jericho, N.Y. that is one of North America's largest publicly traded owners and operators of open-air, grocery-anchored shopping centers and mixed-use assets. As of September 30, 2020, the company owned interests in 400 U.S. shopping centers and mixed-use assets comprising 70 million square feet of gross leasable space primarily concentrated in the top major metropolitan markets. Publicly traded on the NYSE since 1991, and included in the S&P 500 Index, the company has specialized in shopping center acquisitions, development and management for more than 60 years.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Jericho",
        "zipcode": "11753",
        "website": "http://www.kimcorealty.com",
        "market_cap": "Mid Cap"
    },
    "KLPEF": {
        "short_name": "KLEPIERRE",
        "long_name": "Klépierre SA",
        "summary": "KlÃ©pierre, the European leader in shopping malls, combines development, property and asset management skills. The company's portfolio is valued at Â\u008022.8 billion at June 30, 2020 and comprises large shopping centers in 12 countries in Continental Europe which together host 1.1 billion visits per year. KlÃ©pierre holds a controlling stake in Steen & StrÃ¸m (56.1%), Scandinavia's number one shopping center owner and manager. KlÃ©pierre is a French REIT (SIIC) listed on Euronext Paris and is included in the CAC Next 20, EPRA Euro Zone and GPR 250 indexes. It is also included in ethical indexes, such as DJSI World and Europe, FTSE4Good, STOXXÂ® Global ESG Leaders, Euronext Vigeo France 20 and World 120. These distinctions underscore the Group's commitment to a proactive sustainable development policy and its global leadership in the fight against climate change.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75009",
        "website": "http://www.klepierre.com",
        "market_cap": "Mid Cap"
    },
    "KPR.F": {
        "short_name": "KLEPIERRE S.A.INH.EO 1,40",
        "long_name": "Klépierre SA",
        "summary": "KlÃ©pierre, the European leader in shopping malls, combines development, property and asset management skills. The company's portfolio is valued at Â\u008022.8 billion at June 30, 2020 and comprises large shopping centers in 12 countries in Continental Europe which together host 1.1 billion visits per year. KlÃ©pierre holds a controlling stake in Steen & StrÃ¸m (56.1%), Scandinavia's number one shopping center owner and manager. KlÃ©pierre is a French REIT (SIIC) listed on Euronext Paris and is included in the CAC Next 20, EPRA Euro Zone and GPR 250 indexes. It is also included in ethical indexes, such as DJSI World and Europe, FTSE4Good, STOXXÂ® Global ESG Leaders, Euronext Vigeo France 20 and World 120. These distinctions underscore the Group's commitment to a proactive sustainable development policy and its global leadership in the fight against climate change.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75009",
        "website": "http://www.klepierre.com",
        "market_cap": "Mid Cap"
    },
    "KRG": {
        "short_name": "Kite Realty Group Trust",
        "long_name": "Kite Realty Group Trust",
        "summary": "Kite Realty Group Trust is a full-service, vertically integrated real estate investment trust (REIT) that provides communities with convenient and beneficial shopping experiences. We connect consumers to retailers in desirable markets through our portfolio of neighborhood, community, and lifestyle centers. Using operational, development, and redevelopment expertise, we continuously optimize our portfolio to maximize value and return to our shareholders.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IN",
        "city": "Indianapolis",
        "zipcode": "46204",
        "website": "http://www.kiterealty.com",
        "market_cap": "Small Cap"
    },
    "L2D.JO": {
        "short_name": "Liberty Two Degrees LTD",
        "long_name": "Liberty Two Degrees Limited",
        "summary": "Liberty Two Degrees was converted and relisted as a corporate REIT on the JSE main board on 1 November 2018 as Liberty Two Degrees Limited (L2D Limited) following the conversion from a CISIP. The new structure cancels the Liberty Group PUT option for no consideration and internalises the management company. The structure also introduces a conservative level of debt to the capital structure of L2D Limited, which will assist in reducing the weighted average cost of capital over time.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.liberty2degrees.co.za",
        "market_cap": null
    },
    "LI.PA": {
        "short_name": "KLEPIERRE",
        "long_name": "Klépierre SA",
        "summary": "KlÃ©pierre, the European leader in shopping malls, combines development, property and asset management skills. The company's portfolio is valued at Â\u008022.8 billion at June 30, 2020 and comprises large shopping centers in 12 countries in Continental Europe which together host 1.1 billion visits per year. KlÃ©pierre holds a controlling stake in Steen & StrÃ¸m (56.1%), Scandinavia's number one shopping center owner and manager. KlÃ©pierre is a French REIT (SIIC) listed on Euronext Paris and is included in the CAC Next 20, EPRA Euro Zone and GPR 250 indexes. It is also included in ethical indexes, such as DJSI World and Europe, FTSE4Good, STOXXÂ® Global ESG Leaders, Euronext Vigeo France 20 and World 120. These distinctions underscore the Group's commitment to a proactive sustainable development policy and its global leadership in the fight against climate change.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75009",
        "website": "http://www.klepierre.com",
        "market_cap": "Mid Cap"
    },
    "LKREF": {
        "short_name": "LINK REAL ESTATE INVESTMENT TRU",
        "long_name": "Link Real Estate Investment Trust",
        "summary": "Link Real Estate Investment Trust (Hong Kong stock code: 823), managed by Link Asset Management Limited, is a leading retail-focused REIT in the world and Asia's largest REIT in terms of market capitalisation. Listed in 2005 as the first REIT in Hong Kong, Link has been 100% held by public and institutional investors and is a Hang Seng Index constituent stock. From its home in Hong Kong, Link manages a diversified portfolio including retail facilities, car parks and offices spanning Hong Kong, Beijing, Guangzhou, Shanghai, Shenzhen, London and Sydney. Link seeks to extend its portfolio growth trajectory and grasp expansion opportunities in different markets in pursuit of our medium-term target Vision 2025.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.linkreit.com",
        "market_cap": "Large Cap"
    },
    "LPMDF": {
        "short_name": "LIPPO MALLS INDONESIA RETAIL TR",
        "long_name": "Lippo Malls Indonesia Retail Trust",
        "summary": "LMIR Trust is a Singapore-based real estate investment trust established with the principal investment objective of owning and investing, on a long-term basis, in a diversified portfolio of income-producing real estate in Indonesia that are primarily used for retail and/or retail-related purposes. LMIR Trust's current asset portfolio comprises 21 retail malls (Â\u0093Retail MallsÂ\u0094) and seven retail spaces located within other retail malls (Â\u0093Retail SpacesÂ\u0094, and collectively with the Retail Malls, the Â\u0093PropertiesÂ\u0094). The Properties have a total net lettable area of 839,907 square metres and total valuation of Rp15,716.1 billion as at 31 July 2020, and are strategically located in major cities of Indonesia with large middle-income population. Tenants include leading names such as Matahari Department Store, Zara, M&S, H&M, Sogo, Giant, Hypermart, Carrefour, Ace Hardware, as well as international specialty tenants such as Victoria's Secret, Promod, McDonalds, Pizza Hut, Kentucky Fried Chicken, A&W, Fitness First and Starbucks.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "068809",
        "website": "http://www.lmir-trust.com",
        "market_cap": "Small Cap"
    },
    "M6G.F": {
        "short_name": "MACERICH CO.,THE  DL-,01",
        "long_name": "The Macerich Company",
        "summary": "Macerich is a fully integrated, self-managed and self-administered real estate investment trust, which focuses on the acquisition, leasing, management, development and redevelopment of regional malls throughout the United States. Macerich currently owns 51 million square feet of real estate consisting primarily of interests in 47 regional shopping centers. Macerich specializes in successful retail properties in many of the country's most attractive, densely populated markets with significant presence in the West Coast, Arizona, Chicago and the Metro New York to Washington, DC corridor. A recognized leader in sustainability, Macerich has achieved the #1 GRESB ranking in the North American Retail Sector for five straight years (2015 Â\u0096 2019).",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90401",
        "website": "http://www.macerich.com",
        "market_cap": "Mid Cap"
    },
    "M8Y.F": {
        "short_name": "MERCIALYS  INH. EO 1",
        "long_name": "Mercialys",
        "summary": "Mercialys is one of France's leading real estate companies, focused exclusively on shopping centers and high-street retail assets. At June 30, 2020, Mercialys had a portfolio of 2,111 leases, representing a rental value of Euro 182.3 million on an annualized basis. At June 30, 2020, it owned properties with an estimated value of Euro 3.5 billion (including transfer taxes). Mercialys has had Â\u0093SIICÂ\u0094 real estate investment trust (REIT) tax status since November 1, 2005 and has been listed on Euronext Paris Compartment A (ticker: MERY) since its initial public offering on October 12, 2005. At June 30, 2020, there were 92,049,169 shares outstanding.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75082",
        "website": "http://www.mercialys.com",
        "market_cap": "Small Cap"
    },
    "MAC.MX": {
        "short_name": "MACERICH CO",
        "long_name": "The Macerich Company",
        "summary": "Macerich is a fully integrated, self-managed and self-administered real estate investment trust, which focuses on the acquisition, leasing, management, development and redevelopment of regional malls throughout the United States. Macerich currently owns 51 million square feet of real estate consisting primarily of interests in 47 regional shopping centers. Macerich specializes in successful retail properties in many of the country's most attractive, densely populated markets with significant presence in the West Coast, Arizona, Chicago and the Metro New York to Washington, DC corridor. A recognized leader in sustainability, Macerich has achieved the #1 GRESB ranking in the North American Retail Sector for five straight years (2015 Â\u0096 2019).",
        "currency": "MXN",
        "sector": "Financial",
        "industry": "REIT - Retail",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90401",
        "website": "http://www.macerich.com",
        "market_cap": null
    },
    "MAC": {
        "short_name": "Macerich Company (The)",
        "long_name": "The Macerich Company",
        "summary": "Macerich is a fully integrated, self-managed and self-administered real estate investment trust, which focuses on the acquisition, leasing, management, development and redevelopment of regional malls throughout the United States. Macerich currently owns 51 million square feet of real estate consisting primarily of interests in 47 regional shopping centers. Macerich specializes in successful retail properties in many of the country's most attractive, densely populated markets with significant presence in the West Coast, Arizona, Chicago and the Metro New York to Washington, DC corridor. A recognized leader in sustainability, Macerich has achieved the #1 GRESB ranking in the North American Retail Sector for five straight years (2015 Â\u0096 2019).",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90401",
        "website": "http://www.macerich.com",
        "market_cap": "Mid Cap"
    },
    "MALL11.SA": {
        "short_name": "FII MALLS BPCI  ER",
        "long_name": "Malls Brasil Fundo Investimento Imobiliario",
        "summary": null,
        "currency": "BRL",
        "sector": "Financial",
        "industry": "REIT - Retail",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": null,
        "city": null,
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "MAXR11.SA": {
        "short_name": "FII MAX RET CI  ER",
        "long_name": "Fundo De Investimentos Imobiliarios - Max Ret",
        "summary": null,
        "currency": "BRL",
        "sector": "Financial",
        "industry": "REIT - Retail",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": null,
        "city": null,
        "zipcode": null,
        "website": null,
        "market_cap": null
    },
    "MERY.PA": {
        "short_name": "MERCIALYS",
        "long_name": "Mercialys",
        "summary": "Mercialys is one of France's leading real estate companies, focused exclusively on shopping centers and high-street retail assets. At June 30, 2020, Mercialys had a portfolio of 2,111 leases, representing a rental value of Euro 182.3 million on an annualized basis. At June 30, 2020, it owned properties with an estimated value of Euro 3.5 billion (including transfer taxes). Mercialys has had Â\u0093SIICÂ\u0094 real estate investment trust (REIT) tax status since November 1, 2005 and has been listed on Euronext Paris Compartment A (ticker: MERY) since its initial public offering on October 12, 2005. At June 30, 2020, there were 92,049,169 shares outstanding.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75082",
        "website": "http://www.mercialys.com",
        "market_cap": "Small Cap"
    },
    "MPCMF": {
        "short_name": "MAPLETREE COMMERCIAL TRUST TREA",
        "long_name": "Mapletree Commercial Trust",
        "summary": "Mapletree Commercial Trust is a Singapore-focused real estate investment trust (Â\u0093REITÂ\u0094) that invests on a long-term basis, directly or indirectly, in a diversified portfolio of income-producing real estate used primarily for office and/or retail purposes, whether wholly or partially, in Singapore, as well as real estate related assets. MCT's portfolio comprises VivoCity, MBC, PSA Building, Mapletree Anson and MLHF. These five assets have a total NLA of 5.0 million square feet with a total value of S$8.7 billion.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "117438",
        "website": "http://www.mapletreecommercialtrust.com",
        "market_cap": "Mid Cap"
    },
    "N2IU.SI": {
        "short_name": "Mapletree Com Tr",
        "long_name": "Mapletree Commercial Trust",
        "summary": "Mapletree Commercial Trust is a Singapore-focused real estate investment trust (Â\u0093REITÂ\u0094) that invests on a long-term basis, directly or indirectly, in a diversified portfolio of income-producing real estate used primarily for office and/or retail purposes, whether wholly or partially, in Singapore, as well as real estate related assets. MCT's portfolio comprises VivoCity, MBC, PSA Building, Mapletree Anson and MLHF. These five assets have a total NLA of 5.0 million square feet with a total value of S$8.7 billion.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "117438",
        "website": "http://www.mapletreecommercialtrust.com",
        "market_cap": "Mid Cap"
    },
    "N4S.F": {
        "short_name": "EUROCOMM.PR. CERT.10EO-50",
        "long_name": "Eurocommercial Properties N.V.",
        "summary": "At the outset Eurocommercial invested in a variety of countries, including France where the Company made its first investment in 1992 with the acquisition of Les Atlantes shopping centre in Tours. In 1994 Eurocommercial purchased Curno in Bergamo, marking its first acquisition in Italy. Eurocommercial moved into the Swedish market in 2001. It re-entered the Belgian market in 2018 with the purchase of the Woluwe shopping centre. The Company is now one of Europe's most experienced property investors with a portfolio of shopping centres of Â\u00804.1 billion.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Netherlands",
        "state": null,
        "city": "Amsterdam",
        "zipcode": "1017 BS",
        "website": "http://www.eurocommercialproperties.com",
        "market_cap": "Large Cap"
    },
    "NNN-PF": {
        "short_name": "National Retail Properties Depo",
        "long_name": "National Retail Properties, Inc.",
        "summary": "National Retail Properties invests primarily in high-quality retail properties subject generally to long-term, net leases. As of September 30, 2020, the company owned 3,114 properties in 48 states with a gross leasable area of approximately 32.4 million square feet and with a weighted average remaining lease term of 10.7 years.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Orlando",
        "zipcode": "32801",
        "website": "http://www.nnnreit.com",
        "market_cap": "Mid Cap"
    },
    "NNN": {
        "short_name": "National Retail Properties",
        "long_name": "National Retail Properties, Inc.",
        "summary": "National Retail Properties invests primarily in high-quality retail properties subject generally to long-term, net leases. As of September 30, 2020, the company owned 3,114 properties in 48 states with a gross leasable area of approximately 32.4 million square feet and with a weighted average remaining lease term of 10.7 years.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Orlando",
        "zipcode": "32801",
        "website": "http://www.nnnreit.com",
        "market_cap": "Mid Cap"
    },
    "NRR.L": {
        "short_name": "NEWRIVER REIT PLC ORD 1P",
        "long_name": "NewRiver REIT plc",
        "summary": "NewRiver REIT plc (Â\u0091NewRiver') is a leading Real Estate Investment Trust specialising in buying, managing and developing essential retail and leisure assets throughout the UK. Our Â£1.1 billion portfolio covers 9 million sq ft and comprises 33 community shopping centres, 24 conveniently located retail parks and 700 community pubs. We hand-picked our assets to deliberately focus on occupiers providing essential goods and services, and avoid structurally challenged sub-sectors such as department stores, mid-market fashion and casual dining. This focus, combined with our affordable rents and desirable locations, delivers sustainable and growing returns for our shareholders, while our active approach to asset management and inbuilt 2.6 million sq ft development pipeline provide further opportunities to extract value from our portfolio. NewRiver has a Premium Listing on the Main Market of the London Stock Exchange (ticker: NRR).",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1S 2HX",
        "website": "http://www.nrr.co.uk",
        "market_cap": null
    },
    "NTST": {
        "short_name": "NetSTREIT Corp.",
        "long_name": "NETSTREIT Corp.",
        "summary": "NETSTREIT is an internally managed Real Estate Investment Trust (REIT) based in Dallas, Texas that specializes in acquiring single-tenant net lease retail properties nationwide. The growing portfolio consists of high-quality properties leased to e-commerce resistant tenants with healthy balance sheets. Led by a management team of seasoned commercial real estate executives, NETSTREIT's strategy is to create the highest quality net lease retail portfolio in the country with the goal of generating consistent cash flows and dividends for its investors.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75206",
        "website": "http://www.netstreit.com",
        "market_cap": "Small Cap"
    },
    "O.MX": {
        "short_name": "REALTY INCOME CORP",
        "long_name": "Realty Income Corporation",
        "summary": "Realty Income, The Monthly Dividend Company, is an S&P 500 company dedicated to providing stockholders with dependable monthly income. The company is structured as a REIT, and its monthly dividends are supported by the cash flow from over 6,500 real estate properties owned under long-term lease agreements with our commercial clients. To date, the company has declared 608 consecutive common stock monthly dividends throughout its 52-year operating history and increased the dividend 109 times since Realty Income's public listing in 1994 (NYSE: O). The company is a member of the S&P 500 Dividend Aristocrats index. Additional information about the company can be obtained from the corporate website at www.realtyincome.com.",
        "currency": "MXN",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92130",
        "website": "http://www.realtyincome.com",
        "market_cap": "Large Cap"
    },
    "O": {
        "short_name": "Realty Income Corporation",
        "long_name": "Realty Income Corporation",
        "summary": "Realty Income, The Monthly Dividend Company, is an S&P 500 company dedicated to providing stockholders with dependable monthly income. The company is structured as a REIT, and its monthly dividends are supported by the cash flow from over 6,500 real estate properties owned under long-term lease agreements with our commercial clients. To date, the company has declared 608 consecutive common stock monthly dividends throughout its 52-year operating history and increased the dividend 109 times since Realty Income's public listing in 1994 (NYSE: O). The company is a member of the S&P 500 Dividend Aristocrats index. Additional information about the company can be obtained from the corporate website at www.realtyincome.com.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92130",
        "website": "http://www.realtyincome.com",
        "market_cap": "Large Cap"
    },
    "OVW.F": {
        "short_name": "SHAFTESBURY PLC  LS-,25",
        "long_name": "Shaftesbury PLC",
        "summary": "Shaftesbury is a Real Estate Investment Trust which invests exclusively in the liveliest parts of London's West End. Focused on food, beverage, retail and leisure, our portfolio is clustered mainly in Carnaby, Seven Dials and Chinatown, but also includes substantial ownerships in East and West Covent Garden, Soho and Fitzrovia. Extending to 16 acres, the portfolio comprises 611 restaurants, cafÃ©s, pubs and shops, extending to 1.1 million sq. ft., 0.4 million sq. ft. of offices and 624 apartments. All our properties are close to the main West End Underground stations, and within ten minutes' walk of the two West End transport hubs for the Elizabeth Line, at Tottenham Court Road and Bond Street. In addition, we have a 50% interest in the Longmartin joint venture, which has a long leasehold interest, extending to 1.9 acres, in St Martin's Courtyard in Covent Garden.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1F 7FD",
        "website": "http://www.shaftesbury.co.uk",
        "market_cap": "Mid Cap"
    },
    "P40U.SI": {
        "short_name": "StarhillGbl Reit",
        "long_name": "Starhill Global Real Estate Investment Trust",
        "summary": "Starhill Global REIT is a Singapore-based real estate investment trust investing primarily in real estate used for retail and office purposes, both in Singapore and overseas. Since its listing on the Mainboard of the Singapore Exchange Securities Trading Limited (the Â\u0093SGX-STÂ\u0094) on 20 September 2005, Starhill Global REIT has grown its initial portfolio from interests in two landmark properties on Orchard Road in Singapore to 10 properties in Singapore, Australia, Malaysia, China and Japan, valued at about S$2.9 billion. These comprise interests in Wisma Atria and Ngee Ann City on Orchard Road in Singapore, Myer Centre Adelaide, David Jones Building and Plaza Arcade in Adelaide and Perth, Australia, The Starhill and Lot 10 in Kuala Lumpur, Malaysia, a retail property in Chengdu, China and two properties in Tokyo, Japan. Starhill Global REIT remains focused on sourcing attractive property assets in Singapore and overseas, while driving organic growth from its existing portfolio, through proactive leasing efforts and creative asset enhancements. Starhill Global REIT is managed by an external manager, YTL Starhill Global REIT Management Limited, of which all of its shares are indirectly held by YTL Corporation Berhad.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "238874",
        "website": "http://www.starhillglobalreit.com",
        "market_cap": "Small Cap"
    },
    "PAGYO.IS": {
        "short_name": "PANORA GMYO",
        "long_name": "Panora Gayrimenkul Yatirim Ortakligi A.S.",
        "summary": "Panora Gayrimenkul Yatirim Ortakligi A.S. is a real estate investment trust. It invests in the real estate markets of Turkey. Panora Gayrimenkul Yatirim Ortakligi A.S. is based in Turkey.",
        "currency": "TRY",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Ankara",
        "zipcode": null,
        "website": "http://www.panoragyo.com",
        "market_cap": "Small Cap"
    },
    "PEI-PB": {
        "short_name": "Pennsylvania Real Estate Invest",
        "long_name": "Pennsylvania Real Estate Investment Trust",
        "summary": "PREIT (NYSE:PEI) is a publicly traded real estate investment trust that owns and manages quality properties in compelling markets. PREIT's robust portfolio of carefully curated retail and lifestyle offerings mixed with destination dining and entertainment experiences are located primarily in the densely-populated eastern U.S. with concentrations in the mid-Atlantic's top MSAs. Since 2012, the Company has driven a transformation guided by an emphasis on portfolio quality and balance sheet strength driven by disciplined capital expenditures.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19103",
        "website": "http://www.preit.com",
        "market_cap": "Small Cap"
    },
    "PEI-PC": {
        "short_name": "Pennsylvania Real Estate Invest",
        "long_name": "Pennsylvania Real Estate Investment Trust",
        "summary": "PREIT (NYSE:PEI) is a publicly traded real estate investment trust that owns and manages quality properties in compelling markets. PREIT's robust portfolio of carefully curated retail and lifestyle offerings mixed with destination dining and entertainment experiences are located primarily in the densely-populated eastern U.S. with concentrations in the mid-Atlantic's top MSAs. Since 2012, the Company has driven a transformation guided by an emphasis on portfolio quality and balance sheet strength driven by disciplined capital expenditures.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19103",
        "website": "http://www.preit.com",
        "market_cap": "Small Cap"
    },
    "PEI-PD": {
        "short_name": "Pennsylvania Real Estate Invest",
        "long_name": "Pennsylvania Real Estate Investment Trust",
        "summary": "PREIT (NYSE:PEI) is a publicly traded real estate investment trust that owns and manages quality properties in compelling markets. PREIT's robust portfolio of carefully curated retail and lifestyle offerings mixed with destination dining and entertainment experiences are located primarily in the densely-populated eastern U.S. with concentrations in the mid-Atlantic's top MSAs. Since 2012, the Company has driven a transformation guided by an emphasis on portfolio quality and balance sheet strength driven by disciplined capital expenditures.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19103",
        "website": "http://www.preit.com",
        "market_cap": "Small Cap"
    },
    "PEI": {
        "short_name": "Pennsylvania Real Estate Invest",
        "long_name": "Pennsylvania Real Estate Investment Trust",
        "summary": "PREIT (NYSE:PEI) is a publicly traded real estate investment trust that owns and manages quality properties in compelling markets. PREIT's robust portfolio of carefully curated retail and lifestyle offerings mixed with destination dining and entertainment experiences are located primarily in the densely-populated eastern U.S. with concentrations in the mid-Atlantic's top MSAs. Since 2012, the Company has driven a transformation guided by an emphasis on portfolio quality and balance sheet strength driven by disciplined capital expenditures.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19103",
        "website": "http://www.preit.com",
        "market_cap": "Small Cap"
    },
    "PLZ-UN.TO": {
        "short_name": "PLAZA RETAIL REIT",
        "long_name": "Plaza Retail REIT",
        "summary": "Plaza is an open-ended real estate investment trust and is a leading retail property owner and developer, focused on Ontario, Quebec and Atlantic Canada. Plaza's portfolio at September 30, 2020 includes interests in 272 properties totaling approximately 8.6 million square feet across Canada and additional lands held for development. Plaza's portfolio largely consists of open-air centres and stand-alone small box retail outlets and is predominantly occupied by national tenants.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "NB",
        "city": "Fredericton",
        "zipcode": "E3A 9N6",
        "website": "http://www.plaza.ca",
        "market_cap": "Small Cap"
    },
    "PQDP11.SA": {
        "short_name": "FII D PEDRO CI  ER",
        "long_name": "Parque Dom Pedro Shopping Center Fund",
        "summary": null,
        "currency": "BRL",
        "sector": "Financial",
        "industry": "REIT - Retail",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": null,
        "city": null,
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "QRF.BR": {
        "short_name": "QRF",
        "long_name": "Qrf Comm. VA",
        "summary": "Qrf Comm. VA is a publicly owned real estate investment trust. It invests in the real estate markets of Belgium. The firm specializes in retail properties. Qrf Comm. VA was founded in September 3, 2013 and is based in Belgium.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "BRU",
        "market": "be_market",
        "country": "Belgium",
        "state": null,
        "city": "Antwerp",
        "zipcode": "2000",
        "website": "http://www.qrf.be",
        "market_cap": "Small Cap"
    },
    "R1EG34.SA": {
        "short_name": "REGENCY CENTDRN",
        "long_name": "Regency Centers Corporation",
        "summary": "Regency Centers is the preeminent national owner, operator, and developer of shopping centers located in affluent and densely populated trade areas. Our portfolio includes thriving properties merchandised with highly productive grocers, restaurants, service providers, and best-in-class retailers that connect to their neighborhoods, communities, and customers. Operating as a fully integrated real estate company, Regency Centers is a qualified real estate investment trust (REIT) that is self-administered, self-managed, and an S&P 500 Index member.",
        "currency": "BRL",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "FL",
        "city": "Jacksonville",
        "zipcode": "32202",
        "website": "http://www.regencycenters.com",
        "market_cap": "Large Cap"
    },
    "R1IN34.SA": {
        "short_name": "REALTY INCOMDRN ED",
        "long_name": "Realty Income Corporation",
        "summary": "Realty Income, The Monthly Dividend Company, is an S&P 500 company dedicated to providing stockholders with dependable monthly income. The company is structured as a REIT, and its monthly dividends are supported by the cash flow from over 6,500 real estate properties owned under long-term lease agreements with our commercial clients. To date, the company has declared 608 consecutive common stock monthly dividends throughout its 52-year operating history and increased the dividend 109 times since Realty Income's public listing in 1994 (NYSE: O). The company is a member of the S&P 500 Dividend Aristocrats index. Additional information about the company can be obtained from the corporate website at www.realtyincome.com.",
        "currency": "BRL",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92130",
        "website": "http://www.realtyincome.com",
        "market_cap": "Large Cap"
    },
    "R6N.F": {
        "short_name": "RETAIL ESTATES",
        "long_name": "Retail Estates N.V.",
        "summary": "The Belgian public real estate investment trust Retail Estates nv is a niche player specialised in making in out-of-town retail properties located on the periphery of residential areas or along main access roads to urban centres available to users. Real Estates NV acquires these real properties from third parties or builds and commercialises retail buildings for its own account. The buildings have useful areas ranging between 500mÂ² and 3,000mÂ². A typical retail building has an average area of 1,000 mÂ².",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Belgium",
        "state": null,
        "city": "Brussels",
        "zipcode": "1000",
        "website": "http://www.retailestates.com",
        "market_cap": "Small Cap"
    },
    "REG": {
        "short_name": "Regency Centers Corporation",
        "long_name": "Regency Centers Corporation",
        "summary": "Regency Centers is the preeminent national owner, operator, and developer of shopping centers located in affluent and densely populated trade areas. Our portfolio includes thriving properties merchandised with highly productive grocers, restaurants, service providers, and best-in-class retailers that connect to their neighborhoods, communities, and customers. Operating as a fully integrated real estate company, Regency Centers is a qualified real estate investment trust (REIT) that is self-administered, self-managed, and an S&P 500 Index member.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Jacksonville",
        "zipcode": "32202",
        "website": "http://www.regencycenters.com",
        "market_cap": "Large Cap"
    },
    "REI-UN.TO": {
        "short_name": "RIOCAN REAL EST UN",
        "long_name": "RioCan Real Estate Investment Trust",
        "summary": "RioCan is one of Canada's largest real estate investment trusts. RioCan owns, manages and develops retail-focused, increasingly mixed-use properties located in prime, high-density transit-oriented areas where Canadians want to shop, live and work. As at September 30, 2020, our portfolio is comprised of 221 properties with an aggregate net leasable area of approximately 38.4 million square feet (at RioCan's interest) including office, residential rental and 16 development properties.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M4P 1E4",
        "website": "http://www.riocan.com",
        "market_cap": "Mid Cap"
    },
    "RES.JO": {
        "short_name": "Resilient REIT Limited",
        "long_name": "Resilient REIT Limited",
        "summary": "Resilient is a Real Estate Investment Trust (REIT) which has been listed on the Johannesburg stock exchange since December 2002. It owns a portfolio of dominant regional malls and shopping centres tenanted predominantly by national retailers. Resilient continues to develop retail centres which are both quality and yield enhancing. Strict criteria are applied in evaluating target investments including the presence of at least three national anchor tenants and major national retail groups occupying in excess of 70% of the lettable area. In addition, Resilient owns a portfolio of listed and offshore property-related assets. Resilient is internally asset managed with property management being outsourced to independent property management companies.",
        "currency": "ZAc",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Rivonia",
        "zipcode": "2191",
        "website": "http://www.resilient.co.za",
        "market_cap": null
    },
    "RET.BR": {
        "short_name": "RETAIL ESTATES",
        "long_name": "Retail Estates N.V.",
        "summary": "The Belgian public real estate investment trust Retail Estates nv is a niche player specialised in making in out-of-town retail properties located on the periphery of residential areas or along main access roads to urban centres available to users. Real Estates NV acquires these real properties from third parties or builds and commercialises retail buildings for its own account. The buildings have useful areas ranging between 500mÂ² and 3,000mÂ². A typical retail building has an average area of 1,000 mÂ².",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "BRU",
        "market": "be_market",
        "country": "Belgium",
        "state": null,
        "city": "Brussels",
        "zipcode": "1000",
        "website": "http://www.retailestates.com",
        "market_cap": "Small Cap"
    },
    "RIOCF": {
        "short_name": "RIOCAN REAL ESTATE INVESTMENT T",
        "long_name": "RioCan Real Estate Investment Trust",
        "summary": "RioCan is one of Canada's largest real estate investment trusts. RioCan owns, manages and develops retail-focused, increasingly mixed-use properties located in prime, high-density transit-oriented areas where Canadians want to shop, live and work. As at September 30, 2020, our portfolio is comprised of 221 properties with an aggregate net leasable area of approximately 38.4 million square feet (at RioCan's interest) including office, residential rental and 16 development properties.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M4P 1E4",
        "website": "http://www.riocan.com",
        "market_cap": "Mid Cap"
    },
    "ROIC": {
        "short_name": "Retail Opportunity Investments ",
        "long_name": "Retail Opportunity Investments Corp.",
        "summary": "Retail Opportunity Investments Corp. (NASDAQ: ROIC), is a fully-integrated, self-managed real estate investment trust (REIT) that specializes in the acquisition, ownership and management of grocery-anchored shopping centers located in densely populated, metropolitan markets across the West Coast. As of September 30, 2020, ROIC owned 88 shopping centers encompassing approximately 10.1 million square feet. ROIC is the largest publicly-traded, grocery-anchored shopping center REIT focused exclusively on the West Coast. ROIC is a member of the S&P SmallCap 600 Index and has investment-grade corporate debt ratings from Moody's Investor Services, S&P Global Ratings, and Fitch Ratings, Inc.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92130",
        "website": "http://www.roireit.net",
        "market_cap": "Mid Cap"
    },
    "RPAI": {
        "short_name": "Retail Properties of America, I",
        "long_name": "Retail Properties of America, Inc.",
        "summary": "Retail Properties of America, Inc. is a REIT that owns and operates high quality, strategically located open-air shopping centers, including properties with a mixed-use component. As of September 30, 2020, the Company owned 102 retail operating properties in the United States representing 20.0 million square feet. The Company is publicly traded on the New York Stock Exchange under the ticker symbol RPAI.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Oak Brook",
        "zipcode": "60523",
        "website": "http://www.rpai.com",
        "market_cap": "Mid Cap"
    },
    "RPT": {
        "short_name": "RPT Realty",
        "long_name": "RPT Realty",
        "summary": "RPT Realty owns and operates a national portfolio of open-air shopping destinations principally located in top U.S. markets. The Company's shopping centers offer diverse, locally-curated consumer experiences that reflect the lifestyles of their surrounding communities and meet the modern expectations of the Company's retail partners. The Company is a fully integrated and self-administered REIT publicly traded on the New York Stock Exchange (the Â\u0093NYSEÂ\u0094). The common shares of the Company, par value $0.01 per share (the Â\u0093common sharesÂ\u0094) are listed and traded on the NYSE under the ticker symbol Â\u0093RPTÂ\u0094. As of June 30, 2020, our property portfolio consisted of 49 shopping centers (including five shopping centers owned through a joint venture) representing 11.9 million square feet of gross leasable area. As of June 30, 2020, the Company's pro-rata share of the aggregate portfolio was 93.6% leased.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10036",
        "website": "http://www.rptrealty.com",
        "market_cap": "Small Cap"
    },
    "RRC.F": {
        "short_name": "REGENCY CENT  DL-,01",
        "long_name": "Regency Centers Corporation",
        "summary": "Regency Centers is the preeminent national owner, operator, and developer of shopping centers located in affluent and densely populated trade areas. Our portfolio includes thriving properties merchandised with highly productive grocers, restaurants, service providers, and best-in-class retailers that connect to their neighborhoods, communities, and customers. Operating as a fully integrated real estate company, Regency Centers is a qualified real estate investment trust (REIT) that is self-administered, self-managed, and an S&P 500 Index member.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "FL",
        "city": "Jacksonville",
        "zipcode": "32202",
        "website": "http://www.regencycenters.com",
        "market_cap": "Large Cap"
    },
    "RVI": {
        "short_name": "Retail Value Inc.",
        "long_name": "Retail Value Inc.",
        "summary": "RVI is an independent publicly traded company trading under the ticker symbol Â\u0093RVIÂ\u0094 on the New York Stock Exchange. RVI holds assets in the continental U.S. and Puerto Rico and is managed by one or more subsidiaries of SITE Centers Corp. RVI focuses on realizing value in its business through operations and sales of its assets.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Beachwood",
        "zipcode": "44122",
        "website": "http://retailvalueinc.com",
        "market_cap": "Small Cap"
    },
    "RY6.DE": {
        "short_name": "REALTY INC. CORP.  DL 1",
        "long_name": "Realty Income Corporation",
        "summary": "Realty Income, The Monthly Dividend Company, is an S&P 500 company dedicated to providing stockholders with dependable monthly income. The company is structured as a REIT, and its monthly dividends are supported by the cash flow from over 6,500 real estate properties owned under long-term lease agreements with our commercial clients. To date, the company has declared 608 consecutive common stock monthly dividends throughout its 52-year operating history and increased the dividend 109 times since Realty Income's public listing in 1994 (NYSE: O). The company is a member of the S&P 500 Dividend Aristocrats index. Additional information about the company can be obtained from the corporate website at www.realtyincome.com.",
        "currency": "EUR",
        "sector": "Financial",
        "industry": "REIT - Retail",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92130",
        "website": "http://www.realtyincome.com",
        "market_cap": "Large Cap"
    },
    "RY6.F": {
        "short_name": "REALTY INC. CORP.  DL 1",
        "long_name": "Realty Income Corporation",
        "summary": "Realty Income, The Monthly Dividend Company, is an S&P 500 company dedicated to providing stockholders with dependable monthly income. The company is structured as a REIT, and its monthly dividends are supported by the cash flow from over 6,500 real estate properties owned under long-term lease agreements with our commercial clients. To date, the company has declared 608 consecutive common stock monthly dividends throughout its 52-year operating history and increased the dividend 109 times since Realty Income's public listing in 1994 (NYSE: O). The company is a member of the S&P 500 Dividend Aristocrats index. Additional information about the company can be obtained from the corporate website at www.realtyincome.com.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92130",
        "website": "http://www.realtyincome.com",
        "market_cap": "Large Cap"
    },
    "SA4.F": {
        "short_name": "SAUL CENTERS INC.  DL-,01",
        "long_name": "Saul Centers, Inc.",
        "summary": "Saul Centers, Inc. is a self-managed, self-administered equity REIT headquartered in Bethesda, Maryland, which currently operates and manages a real estate portfolio of 60 properties which includes (a) 50 community and neighborhood shopping centers and seven mixed-use properties with approximately 9.8 million square feet of leasable area and (b) three land and development properties. Approximately 85% of the Saul Centers' property operating income is generated by properties in the metropolitan Washington, DC/Baltimore area.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MD",
        "city": "Bethesda",
        "zipcode": "20814",
        "website": "http://www.saulcenters.com",
        "market_cap": "Small Cap"
    },
    "SCG.AX": {
        "short_name": "SCENTRE STAPLED",
        "long_name": "Scentre Group",
        "summary": "Scentre Group (ASX Code: SCG) is the owner and operator of Westfield in Australia and New Zealand with interests in 42 Westfield Living Centres, encompassing approximately 12,000 outlets.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.scentregroup.com",
        "market_cap": "Large Cap"
    },
    "SCP.AX": {
        "short_name": "SHOPCENAUS STAPLED",
        "long_name": "Shopping Centres Australasia Property Group",
        "summary": "SCA Property Group (SCP) includes two internally managed real estate investment trusts owning a portfolio of quality neighbourhood and sub-regional shopping centres located across Australia. The SCA Property Group invests in shopping centres predominantly anchored by non-discretionary retailers, with long term leases to tenants such as Woolworths Limited, Coles Group Limited and companies in the Wesfarmers Limited group. The SCA Property Group is a stapled entity comprising Shopping Centres Australasia Property Management Trust (ARSN 160 612 626) and Shopping Centres Australasia Property Retail Trust (ARSN 160 612 788).",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.scaproperty.com.au",
        "market_cap": "Mid Cap"
    },
    "SELER.PA": {
        "short_name": "SELECTIRENTE",
        "long_name": "Selectirente",
        "summary": "Selectirente is a public real estate fund managed by Sofidy. It invests in city center and suburb commercial properties, which should be located close to shopping malls. It primarily acquires properties in France. As of March 29, 2019, Selectirente operates as a subsidiary of Tikehau Capital.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Evry",
        "zipcode": "91026",
        "website": "http://www.selectirente.com",
        "market_cap": "Small Cap"
    },
    "SGR-UN.TO": {
        "short_name": "SLATE GROCERY REIT",
        "long_name": "Slate Grocery REIT",
        "summary": "Slate Grocery REIT is an owner and operator of U.S. grocery-anchored real estate. The REIT owns and operates approximately U.S. $1.3 billion of critical real estate infrastructure across major U.S. metro markets that communities rely upon for their everyday needs. The REIT's resilient grocery-anchored portfolio and strong credit tenants provide unitholders with durable cash flows and the potential for capital appreciation over the longer term.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 3T9",
        "website": "http://www.slategroceryreit.com",
        "market_cap": "Small Cap"
    },
    "SHB.L": {
        "short_name": "SHAFTESBURY PLC ORD 25P",
        "long_name": "Shaftesbury PLC",
        "summary": "Shaftesbury is a Real Estate Investment Trust which invests exclusively in the liveliest parts of London's West End. Focused on food, beverage, retail and leisure, our portfolio is clustered mainly in Carnaby, Seven Dials and Chinatown, but also includes substantial ownerships in East and West Covent Garden, Soho and Fitzrovia. Extending to 16 acres, the portfolio comprises 611 restaurants, cafÃ©s, pubs and shops, extending to 1.1 million sq. ft., 0.4 million sq. ft. of offices and 624 apartments. All our properties are close to the main West End Underground stations, and within ten minutes' walk of the two West End transport hubs for the Elizabeth Line, at Tottenham Court Road and Bond Street. In addition, we have a 50% interest in the Longmartin joint venture, which has a long leasehold interest, extending to 1.9 acres, in St Martin's Courtyard in Covent Garden.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1F 7FD",
        "website": "http://www.shaftesbury.co.uk",
        "market_cap": null
    },
    "SIMN34.SA": {
        "short_name": "SIMON PROP  DRN",
        "long_name": "Simon Property Group, Inc.",
        "summary": "Simon is a real estate investment trust engaged in the ownership of premier shopping, dining, entertainment and mixed-use destinations and an S&P 100 company (Simon Property Group, NYSE: SPG). Our properties across North America, Europe and Asia provide community gathering places for millions of people every day and generate billions in annual sales.",
        "currency": "BRL",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "IN",
        "city": "Indianapolis",
        "zipcode": "46204",
        "website": "http://www.simon.com",
        "market_cap": "Large Cap"
    },
    "SITC-PA": {
        "short_name": "SITE Centers Corp. 6.375%",
        "long_name": "SITE Centers Corp.",
        "summary": "SITE Centers is an owner and manager of open-air shopping centers that provide a highly-compelling shopping experience and merchandise mix for retail partners and consumers. The Company is a self-administered and self-managed REIT operating as a fully integrated real estate company, and is publicly traded on the New York Stock Exchange under the ticker symbol SITC.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Beachwood",
        "zipcode": "44122",
        "website": "http://www.sitecenters.com",
        "market_cap": "Mid Cap"
    },
    "SITC": {
        "short_name": "SITE Centers Corp.",
        "long_name": "SITE Centers Corp.",
        "summary": "SITE Centers is an owner and manager of open-air shopping centers that provide a highly-compelling shopping experience and merchandise mix for retail partners and consumers. The Company is a self-administered and self-managed REIT operating as a fully integrated real estate company, and is publicly traded on the New York Stock Exchange under the ticker symbol SITC.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Beachwood",
        "zipcode": "44122",
        "website": "http://www.sitecenters.com",
        "market_cap": "Mid Cap"
    },
    "SK6U.SI": {
        "short_name": "SPHREIT",
        "long_name": "SPH REIT",
        "summary": "SPH REIT is a Singapore-based real estate investment trust established principally to invest in a portfolio of income-producing real estate primarily for retail purposes in Asia-Pacific, as well as real estate-related assets. SPH REIT has a portfolio of five assets in Singapore and Australia. Its portfolio of properties in Singapore comprises a 99-year leasehold interest in Paragon, a 99-year leasehold interest in The Clementi Mall and a 99-year leasehold interest in The Rail Mall. These Singapore properties have an aggregate net lettable area of approximately 960,000 sq. ft. In Australia, SPH REIT owns a 50% freehold interest in Westfield Marion Shopping Centre, the largest regional shopping centre in Adelaide, South Australia. SPH REIT also owns an 85% interest in Figtree Grove Shopping Centre, a freehold sub-regional shopping centre in Wollongong, New South Wales, Australia. Both Australian properties have an aggregate gross lettable area of approximately 1.7 million sq. ft.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "318994",
        "website": "http://www.sphreit.com.sg",
        "market_cap": "Small Cap"
    },
    "SKT": {
        "short_name": "Tanger Factory Outlet Centers, ",
        "long_name": "Tanger Factory Outlet Centers, Inc.",
        "summary": "Tanger Factory Outlet Centers, Inc. (NYSE: SKT) is a leading operator of open-air upscale outlet shopping centers that owns, or has an ownership interest in, a portfolio of 38 centers. Tanger's operating properties are located in 20 states and in Canada, totaling approximately 14.1 million square feet, leased to over 2,700 stores operated by more than 500 different brand name companies. The Company has more than 39 years of experience in the outlet industry and is a publicly-traded REIT. Tanger is furnishing a Form 8-K with the Securities and Exchange Commission (\"SEC\") that includes a supplemental information package for the quarter ended September 30, 2020.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NC",
        "city": "Greensboro",
        "zipcode": "27408",
        "website": "http://www.tangeroutlets.com",
        "market_cap": "Small Cap"
    },
    "SPG-PJ": {
        "short_name": "Simon Property Group, Inc. Simo",
        "long_name": "Simon Property Group, Inc.",
        "summary": "Simon is a real estate investment trust engaged in the ownership of premier shopping, dining, entertainment and mixed-use destinations and an S&P 100 company (Simon Property Group, NYSE: SPG). Our properties across North America, Europe and Asia provide community gathering places for millions of people every day and generate billions in annual sales.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IN",
        "city": "Indianapolis",
        "zipcode": "46204",
        "website": "http://www.simon.com",
        "market_cap": "Large Cap"
    },
    "SPG.MX": {
        "short_name": "SIMON PROPERTY GROUP INC",
        "long_name": "Simon Property Group, Inc.",
        "summary": "Simon is a real estate investment trust engaged in the ownership of premier shopping, dining, entertainment and mixed-use destinations and an S&P 100 company (Simon Property Group, NYSE: SPG). Our properties across North America, Europe and Asia provide community gathering places for millions of people every day and generate billions in annual sales.",
        "currency": "MXN",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "IN",
        "city": "Indianapolis",
        "zipcode": "46204",
        "website": "http://www.simon.com",
        "market_cap": "Large Cap"
    },
    "SPG": {
        "short_name": "Simon Property Group, Inc.",
        "long_name": "Simon Property Group, Inc.",
        "summary": "Simon is a real estate investment trust engaged in the ownership of premier shopping, dining, entertainment and mixed-use destinations and an S&P 100 company (Simon Property Group, NYSE: SPG). Our properties across North America, Europe and Asia provide community gathering places for millions of people every day and generate billions in annual sales.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IN",
        "city": "Indianapolis",
        "zipcode": "46204",
        "website": "http://www.simon.com",
        "market_cap": "Large Cap"
    },
    "SPGR.VI": {
        "short_name": "SIMON PROPERTY GROUP INC",
        "long_name": "Simon Property Group, Inc.",
        "summary": "Simon is a real estate investment trust engaged in the ownership of premier shopping, dining, entertainment and mixed-use destinations and an S&P 100 company (Simon Property Group, NYSE: SPG). Our properties across North America, Europe and Asia provide community gathering places for millions of people every day and generate billions in annual sales.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "IN",
        "city": "Indianapolis",
        "zipcode": "46204",
        "website": "http://www.simon.com",
        "market_cap": "Large Cap"
    },
    "SQI.DE": {
        "short_name": "SIMON PROPERTY GRP PAIRED",
        "long_name": "Simon Property Group, Inc.",
        "summary": "Simon is a real estate investment trust engaged in the ownership of premier shopping, dining, entertainment and mixed-use destinations and an S&P 100 company (Simon Property Group, NYSE: SPG). Our properties across North America, Europe and Asia provide community gathering places for millions of people every day and generate billions in annual sales.",
        "currency": "EUR",
        "sector": "Financial",
        "industry": "REIT - Retail",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "IN",
        "city": "Indianapolis",
        "zipcode": "46204",
        "website": "http://www.simon.com",
        "market_cap": "Large Cap"
    },
    "SQI.F": {
        "short_name": "SIMON PROPERTY GRP PAIRED",
        "long_name": "Simon Property Group, Inc.",
        "summary": "Simon is a real estate investment trust engaged in the ownership of premier shopping, dining, entertainment and mixed-use destinations and an S&P 100 company (Simon Property Group, NYSE: SPG). Our properties across North America, Europe and Asia provide community gathering places for millions of people every day and generate billions in annual sales.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IN",
        "city": "Indianapolis",
        "zipcode": "46204",
        "website": "http://www.simon.com",
        "market_cap": "Large Cap"
    },
    "SRG-PA": {
        "short_name": "Seritage Growth Properties 7.00",
        "long_name": "Seritage Growth Properties",
        "summary": "Seritage Growth Properties is a publicly-traded, self-administered and self-managed REIT with 166 wholly-owned properties and 29 unconsolidated properties totaling approximately 30.4 million square feet of space across 44 states and Puerto Rico. The Company was formed to unlock the underlying real estate value of a high-quality retail portfolio it acquired from Sears Holdings in July 2015. The Company's mission is to create and own revitalized shopping, dining, entertainment and mixed-use destinations that provide enriched experiences for consumers and local communities, and create long-term value for our shareholders.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10110",
        "website": "http://www.seritage.com",
        "market_cap": "Mid Cap"
    },
    "SRG": {
        "short_name": "Seritage Growth Properties",
        "long_name": "Seritage Growth Properties",
        "summary": "Seritage Growth Properties is a publicly-traded, self-administered and self-managed REIT with 166 wholly-owned properties and 29 unconsolidated properties totaling approximately 30.4 million square feet of space across 44 states and Puerto Rico. The Company was formed to unlock the underlying real estate value of a high-quality retail portfolio it acquired from Sears Holdings in July 2015. The Company's mission is to create and own revitalized shopping, dining, entertainment and mixed-use destinations that provide enriched experiences for consumers and local communities, and create long-term value for our shareholders.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10110",
        "website": "http://www.seritage.com",
        "market_cap": "Small Cap"
    },
    "SRRTF": {
        "short_name": "SLATE GROCERY REIT",
        "long_name": "Slate Grocery REIT",
        "summary": "Slate Grocery REIT is an owner and operator of U.S. grocery-anchored real estate. The REIT owns and operates approximately U.S. $1.3 billion of critical real estate infrastructure across major U.S. metro markets that communities rely upon for their everyday needs. The REIT's resilient grocery-anchored portfolio and strong credit tenants provide unitholders with durable cash flows and the potential for capital appreciation over the longer term.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 3T9",
        "website": "http://www.slategroceryreit.com",
        "market_cap": "Small Cap"
    },
    "SRU-UN.TO": {
        "short_name": "SMARTCENTRES REIT",
        "long_name": "SmartCentres Real Estate Investment Trust",
        "summary": "SmartCentres Real Estate Investment Trust is one of Canada's largest fully integrated REITs, with a best-in-class portfolio featuring 166 strategically located properties in communities across the country. SmartCentres has approximately $10.4 billion in assets and owns 33.8 million square feet of income producing value-oriented retail space with 97.4% occupancy, on 3,500 acres of owned land across Canada. SmartCentres continues to focus on enhancing the lives of Canadians by planning and developing complete, connected, mixed-use communities on its existing retail properties. A publicly announced $11.9 billion intensification program ($5.4 billion at SmartCentres' share) represents the REIT's current major development focus on which construction is expected to commence within the next five years. This intensification program consists of rental apartments, condos, seniors' residences and hotels, to be developed under the SmartLiving banner, and retail, office, and storage facilities, to be developed under the SmartCentres banner. SmartCentres' intensification program is expected to produce an additional 59.3 million square feet (27.9 million square feet at SmartCentres' share) of space, 27.1 million square feet (12.3 million square feet at SmartCentres' share) of which has or will commence construction within next five years. From shopping centres to city centres, SmartCentres is uniquely positioned to reshape the Canadian urban and urban-suburban landscape. Included in this intensification program is the Trust's share of SmartVMC which, when completed, is expected to include approximately 11.0 million square feet of mixed-use space in Vaughan, Ontario. Construction of the first five sold-out phases of Transit City Condominiums that represent 2,789 residential units continues to progress. Final closings of the first two phases of Transit City Condominiums began ahead of budget and ahead of schedule in August 2020 and as at September 30, 2020, 766 units (representing approximately 70% of all 1,110 units in the first and second phases) had closed with the balance of units expected to close before year end. In addition, the presold 631 units in the third phase along with 22 townhomes, all of which are sold out and currently under construction, are expected to close in 2021. The fourth and fifth sold-out phases representing 1,026 units are currently under construction and are expected to close in 2023.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Vaughan",
        "zipcode": "L4K 5Z5",
        "website": "http://www.smartcentres.com",
        "market_cap": "Mid Cap"
    },
    "STGPF": {
        "short_name": "SCENTRE GROUP LIMITED",
        "long_name": "Scentre Group",
        "summary": "Scentre Group (ASX Code: SCG) is the owner and operator of Westfield in Australia and New Zealand with interests in 42 Westfield Living Centres, encompassing approximately 12,000 outlets.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.scentregroup.com",
        "market_cap": "Large Cap"
    },
    "T6O.F": {
        "short_name": "TANGER FACT.OUTLET DL-,01",
        "long_name": "Tanger Factory Outlet Centers, Inc.",
        "summary": "Tanger Factory Outlet Centers, Inc. (NYSE: SKT) is a leading operator of open-air upscale outlet shopping centers that owns, or has an ownership interest in, a portfolio of 38 centers. Tanger's operating properties are located in 20 states and in Canada, totaling approximately 14.1 million square feet, leased to over 2,700 stores operated by more than 500 different brand name companies. The Company has more than 39 years of experience in the outlet industry and is a publicly-traded REIT. Tanger is furnishing a Form 8-K with the Securities and Exchange Commission (\"SEC\") that includes a supplemental information package for the quarter ended September 30, 2020.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NC",
        "city": "Greensboro",
        "zipcode": "27408",
        "website": "http://www.tangeroutlets.com",
        "market_cap": "Small Cap"
    },
    "TRGYO.IS": {
        "short_name": "TORUNLAR GMYO",
        "long_name": "Torunlar Gayrimenkul Yatirim Ortakligi A.S.",
        "summary": "Torunlar Gayrimenkul Yatirim Ortakligi Anonim Sirketi (Â\u0093Torunlar REICÂ\u0094 or the Â\u0093CompanyÂ\u0094) and its subsidiary, TRN Otel Isletmeciligi ve Yatirimlari A.S. (Â\u0093TRNÂ\u0094) referred together as a Â\u0093GroupÂ\u0094. The Company was incorporated in 1996 with the trade name of Toray Insaat Sanayi ve Ticaret A.S. in Istanbul, Turkey. With a change in the Articles of Association published on Trade Registry Gazette on 25 January 2008, the Company has been registered with the trade name of Torunlar Gayrimenkul Yatirim Ortakligi A.S. on 21 January 2008. The Company's stocks have been traded at the Borsa Istanbul since 21 October 2010 and registered to Capital Markets Board (Â\u0093CMBÂ\u0094). The Company operates in Turkey. As of 30 September 2020, the total number of the Company's employees is 59 (31 December 2019: 66) and the main shareholder is the Torun Family.",
        "currency": "TRY",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34805",
        "website": "http://www.torunlargyo.com.tr",
        "market_cap": "Small Cap"
    },
    "TS0U.SI": {
        "short_name": "OUE Com Reit",
        "long_name": "OUE Commercial Real Estate Investment Trust",
        "summary": "OUE C-REIT is a real estate investment trust listed on the Main Board of Singapore Exchange Securities Trading Limited since 27 January 2014. OUE C-REIT completed the merger with OUE Hospitality Trust in September 2019 to become one of the largest diversified REITs with total assets of S$6.8 billion. With seven properties across the commercial and hospitality segments in Singapore and Shanghai, OUE C-REIT's property portfolio comprises approximately 2.2 million sq ft of prime office and retail space, and 1,640 upscale hotel rooms. OUE C-REIT invests in income-producing real estate used primarily for commercial purposes (including real estate used primarily for office and/or retail purposes) in financial and business hubs, and/or hospitality and/or hospitality-related purposes, as well as real estate-related assets. OUE C-REIT is managed by OUE Commercial REIT Management Pte. Ltd., which is a wholly-owned subsidiary of OUE Limited.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049321",
        "website": "http://www.ouect.com",
        "market_cap": "Small Cap"
    },
    "UBA": {
        "short_name": "Urstadt Biddle Properties Inc.",
        "long_name": "Urstadt Biddle Properties Inc.",
        "summary": "Urstadt Biddle Properties Inc. is a self-administered equity real estate investment trust which owns or has equity interests in 81 properties containing approximately 5.2 million square feet of space. Listed on the New York Stock Exchange since 1970, it provides investors with a means of participating in ownership of income-producing properties. It has paid 203 consecutive quarters of uninterrupted dividends to its shareholders since its inception.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Greenwich",
        "zipcode": "06830",
        "website": "http://www.ubproperties.com",
        "market_cap": "Small Cap"
    },
    "UBLB.F": {
        "short_name": "URW (STAPL.SHS CDI)EO-,05",
        "long_name": "Unibail-Rodamco-Westfield SE",
        "summary": "Unibail-Rodamco-Westfield is the premier global developer and operator of Flagship Destinations, with a portfolio valued at Â\u008058.3 Bn as at September 30, 2020, of which 86% in retail, 7% in offices, 5% in convention & exhibition venues and 2% in services. Currently, the Group owns and operates 89 shopping centres, including 55 Flagships in the most dynamic cities in Europe and the United States. Its centres welcome 1.2 billion visits per year. Present on two continents and in 12 countries, Unibail-Rodamco-Westfield provides a unique platform for retailers and brand events and offers an exceptional and constantly renewed experience for customers. With the support of its 3,400 professionals and an unparalleled track-record and know-how, Unibail-Rodamco-Westfield is ideally positioned to generate superior value and develop world-class projects. Unibail-Rodamco-Westfield distinguishes itself by its Better Places 2030 agenda, that sets its ambition to create better places that respect the highest environmental standards and contribute to better cities. Unibail-Rodamco-Westfield stapled shares are listed on Euronext Amsterdam and Euronext Paris (Euronext ticker: URW), with a secondary listing in Australia through Chess Depositary Interests. The Group benefits from an A- rating from Standard & Poor's and from a Baa1 rating from Moody's.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75772",
        "website": "http://www.urw.com",
        "market_cap": "Large Cap"
    },
    "UBP-PH": {
        "short_name": "Urstadt Biddle Properties Inc. ",
        "long_name": "Urstadt Biddle Properties Inc.",
        "summary": "Urstadt Biddle Properties Inc. is a self-administered equity real estate investment trust which owns or has equity interests in 81 properties containing approximately 5.2 million square feet of space. Listed on the New York Stock Exchange since 1970, it provides investors with a means of participating in ownership of income-producing properties. It has paid 203 consecutive quarters of uninterrupted dividends to its shareholders since its inception.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Greenwich",
        "zipcode": "06830",
        "website": "http://www.ubproperties.com",
        "market_cap": "Small Cap"
    },
    "UBP-PK": {
        "short_name": "Urstadt Biddle Properties Inc. ",
        "long_name": "Urstadt Biddle Properties Inc.",
        "summary": "Urstadt Biddle Properties Inc. is a self-administered equity real estate investment trust which owns or has equity interests in 81 properties containing approximately 5.2 million square feet of space. Listed on the New York Stock Exchange since 1970, it provides investors with a means of participating in ownership of income-producing properties. It has paid 203 consecutive quarters of uninterrupted dividends to its shareholders since its inception.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Greenwich",
        "zipcode": "06830",
        "website": "http://www.ubproperties.com",
        "market_cap": null
    },
    "UBP": {
        "short_name": "Urstadt Biddle Properties Inc.",
        "long_name": "Urstadt Biddle Properties Inc.",
        "summary": "Urstadt Biddle Properties Inc. is a self-administered equity real estate investment trust which owns or has equity interests in 81 properties containing approximately 5.2 million square feet of space. Listed on the New York Stock Exchange since 1970, it provides investors with a means of participating in ownership of income-producing properties. It has paid 203 consecutive quarters of uninterrupted dividends to its shareholders since its inception.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Greenwich",
        "zipcode": "06830",
        "website": "http://www.ubproperties.com",
        "market_cap": "Small Cap"
    },
    "UL.VI": {
        "short_name": "WFD UNIBAIL-RODAMCO N.V.",
        "long_name": "Unibail-Rodamco-Westfield SE",
        "summary": "Unibail-Rodamco-Westfield is the premier global developer and operator of Flagship Destinations, with a portfolio valued at Â\u008058.3 Bn as at September 30, 2020, of which 86% in retail, 7% in offices, 5% in convention & exhibition venues and 2% in services. Currently, the Group owns and operates 89 shopping centres, including 55 Flagships in the most dynamic cities in Europe and the United States. Its centres welcome 1.2 billion visits per year. Present on two continents and in 12 countries, Unibail-Rodamco-Westfield provides a unique platform for retailers and brand events and offers an exceptional and constantly renewed experience for customers. With the support of its 3,400 professionals and an unparalleled track-record and know-how, Unibail-Rodamco-Westfield is ideally positioned to generate superior value and develop world-class projects. Unibail-Rodamco-Westfield distinguishes itself by its Better Places 2030 agenda, that sets its ambition to create better places that respect the highest environmental standards and contribute to better cities. Unibail-Rodamco-Westfield stapled shares are listed on Euronext Amsterdam and Euronext Paris (Euronext ticker: URW), with a secondary listing in Australia through Chess Depositary Interests. The Group benefits from an A- rating from Standard & Poor's and from a Baa1 rating from Moody's.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "VIE",
        "market": "at_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75772",
        "website": "http://www.urw.com",
        "market_cap": "Mid Cap"
    },
    "UNBLF": {
        "short_name": "UNIBAIL-RODAMCO-WESTFIELD",
        "long_name": "Unibail-Rodamco-Westfield SE",
        "summary": "Unibail-Rodamco-Westfield is the premier global developer and operator of Flagship Destinations, with a portfolio valued at Â\u008058.3 Bn as at September 30, 2020, of which 86% in retail, 7% in offices, 5% in convention & exhibition venues and 2% in services. Currently, the Group owns and operates 89 shopping centres, including 55 Flagships in the most dynamic cities in Europe and the United States. Its centres welcome 1.2 billion visits per year. Present on two continents and in 12 countries, Unibail-Rodamco-Westfield provides a unique platform for retailers and brand events and offers an exceptional and constantly renewed experience for customers. With the support of its 3,400 professionals and an unparalleled track-record and know-how, Unibail-Rodamco-Westfield is ideally positioned to generate superior value and develop world-class projects. Unibail-Rodamco-Westfield distinguishes itself by its Better Places 2030 agenda, that sets its ambition to create better places that respect the highest environmental standards and contribute to better cities. Unibail-Rodamco-Westfield stapled shares are listed on Euronext Amsterdam and Euronext Paris (Euronext ticker: URW), with a secondary listing in Australia through Chess Depositary Interests. The Group benefits from an A- rating from Standard & Poor's and from a Baa1 rating from Moody's.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75772",
        "website": "http://www.urw.com",
        "market_cap": "Large Cap"
    },
    "URW.AS": {
        "short_name": "UNIBAIL-RODAMCO-WE",
        "long_name": "Unibail-Rodamco-Westfield SE",
        "summary": "Unibail-Rodamco-Westfield is the premier global developer and operator of Flagship Destinations, with a portfolio valued at Â\u008058.3 Bn as at September 30, 2020, of which 86% in retail, 7% in offices, 5% in convention & exhibition venues and 2% in services. Currently, the Group owns and operates 89 shopping centres, including 55 Flagships in the most dynamic cities in Europe and the United States. Its centres welcome 1.2 billion visits per year. Present on two continents and in 12 countries, Unibail-Rodamco-Westfield provides a unique platform for retailers and brand events and offers an exceptional and constantly renewed experience for customers. With the support of its 3,400 professionals and an unparalleled track-record and know-how, Unibail-Rodamco-Westfield is ideally positioned to generate superior value and develop world-class projects. Unibail-Rodamco-Westfield distinguishes itself by its Better Places 2030 agenda, that sets its ambition to create better places that respect the highest environmental standards and contribute to better cities. Unibail-Rodamco-Westfield stapled shares are listed on Euronext Amsterdam and Euronext Paris (Euronext ticker: URW), with a secondary listing in Australia through Chess Depositary Interests. The Group benefits from an A- rating from Standard & Poor's and from a Baa1 rating from Moody's.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "AMS",
        "market": "nl_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75772",
        "website": "http://www.urw.com",
        "market_cap": "Large Cap"
    },
    "URW.AX": {
        "short_name": "UNIBALWEST CDI 20:1",
        "long_name": "Unibail-Rodamco-Westfield SE",
        "summary": "Unibail-Rodamco-Westfield is the premier global developer and operator of Flagship Destinations, with a portfolio valued at Â\u008058.3 Bn as at September 30, 2020, of which 86% in retail, 7% in offices, 5% in convention & exhibition venues and 2% in services. Currently, the Group owns and operates 89 shopping centres, including 55 Flagships in the most dynamic cities in Europe and the United States. Its centres welcome 1.2 billion visits per year. Present on two continents and in 12 countries, Unibail-Rodamco-Westfield provides a unique platform for retailers and brand events and offers an exceptional and constantly renewed experience for customers. With the support of its 3,400 professionals and an unparalleled track-record and know-how, Unibail-Rodamco-Westfield is ideally positioned to generate superior value and develop world-class projects. Unibail-Rodamco-Westfield distinguishes itself by its Better Places 2030 agenda, that sets its ambition to create better places that respect the highest environmental standards and contribute to better cities. Unibail-Rodamco-Westfield stapled shares are listed on Euronext Amsterdam and Euronext Paris (Euronext ticker: URW), with a secondary listing in Australia through Chess Depositary Interests. The Group benefits from an A- rating from Standard & Poor's and from a Baa1 rating from Moody's.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75772",
        "website": "http://www.urw.com",
        "market_cap": "Large Cap"
    },
    "URW.MI": {
        "short_name": "WFD UNIBAIL-RODAMCO",
        "long_name": "Unibail-Rodamco-Westfield SE",
        "summary": "Unibail-Rodamco-Westfield is the premier global developer and operator of Flagship Destinations, with a portfolio valued at Â\u008058.3 Bn as at September 30, 2020, of which 86% in retail, 7% in offices, 5% in convention & exhibition venues and 2% in services. Currently, the Group owns and operates 89 shopping centres, including 55 Flagships in the most dynamic cities in Europe and the United States. Its centres welcome 1.2 billion visits per year. Present on two continents and in 12 countries, Unibail-Rodamco-Westfield provides a unique platform for retailers and brand events and offers an exceptional and constantly renewed experience for customers. With the support of its 3,400 professionals and an unparalleled track-record and know-how, Unibail-Rodamco-Westfield is ideally positioned to generate superior value and develop world-class projects. Unibail-Rodamco-Westfield distinguishes itself by its Better Places 2030 agenda, that sets its ambition to create better places that respect the highest environmental standards and contribute to better cities. Unibail-Rodamco-Westfield stapled shares are listed on Euronext Amsterdam and Euronext Paris (Euronext ticker: URW), with a secondary listing in Australia through Chess Depositary Interests. The Group benefits from an A- rating from Standard & Poor's and from a Baa1 rating from Moody's.",
        "currency": "EUR",
        "sector": "Financial",
        "industry": "REIT - Retail",
        "exchange": "MIL",
        "market": "it_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75772",
        "website": "http://www.urw.com",
        "market_cap": "Large Cap"
    },
    "VASTB.BR": {
        "short_name": "VASTNED BELGIUM",
        "long_name": "Vastned Retail Belgium SA",
        "summary": "Vastned Retail Belgium is a public regulated real estate company (RREC), the shares of which are listed on Euronext Brussels (VASTB). Vastned Retail Belgium invests exclusively in Belgian commercial real estate, more specifically in prime retail properties located on the best shopping streets in the major cities of Antwerp, Brussels, Ghent and Bruges. Furthermore, the real estate portfolio consists of inner-city shops outside of the premium cities, high-end retail parks and retail warehouses.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "BRU",
        "market": "be_market",
        "country": "Belgium",
        "state": null,
        "city": "Antwerp",
        "zipcode": "2600",
        "website": "http://www.vastned.be",
        "market_cap": "Small Cap"
    },
    "VASTN.AS": {
        "short_name": "VASTNED",
        "long_name": "Vastned Retail N.V.",
        "summary": "Vastned is a listed European retail property company (Euronext Amsterdam: VASTN) focusing on Â\u0091venues for premium shopping'. Vastned invests in selected cities in Europe with a clear focus on the best retail property in the most popular high streets in the bigger cities. Vastned's tenants are strong and leading international and national retail brands. The property portfolio had a size of approximately Â\u0080 1.5 billion as at 30 June 2020.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "AMS",
        "market": "nl_market",
        "country": "Netherlands",
        "state": null,
        "city": "Amsterdam",
        "zipcode": "1083 HJ",
        "website": "http://www.vastned.com",
        "market_cap": "Small Cap"
    },
    "VB2.F": {
        "short_name": "VASTNED RETAIL N.V.  EO 5",
        "long_name": "Vastned Retail N.V.",
        "summary": "Vastned is a listed European retail property company (Euronext Amsterdam: VASTN) focusing on Â\u0091venues for premium shopping'. Vastned invests in selected cities in Europe with a clear focus on the best retail property in the most popular high streets in the bigger cities. Vastned's tenants are strong and leading international and national retail brands. The property portfolio had a size of approximately Â\u0080 1.5 billion as at 30 June 2020.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Netherlands",
        "state": null,
        "city": "Amsterdam",
        "zipcode": "1083 HJ",
        "website": "http://www.vastned.com",
        "market_cap": "Small Cap"
    },
    "VCX.AX": {
        "short_name": "VICINITY STAPLED",
        "long_name": "Vicinity Centres",
        "summary": "Vicinity Centres (Vicinity or the Group) is one of Australia's leading retail property groups. With a fully integrated asset management platform, and $24 billion in retail assets under management across 63 shopping centres, it is the second largest listed manager of Australian retail property. Vicinity has a Direct Portfolio with interests in 60 shopping centres (including the DFO Brisbane business) and manages 31 assets on behalf of Strategic Partners, 28 of which are co-owned by the Group. Vicinity is listed on the Australian Securities Exchange (ASX) under the code Â\u0091VCX' and has over 28,000 securityholders. Vicinity also has European medium term notes listed on the ASX under the code Â\u0091VCD'.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Chadstone",
        "zipcode": "3148",
        "website": "http://www.vicinity.com.au",
        "market_cap": "Mid Cap"
    },
    "VISC11.SA": {
        "short_name": "FII VINCI SCCI  ER",
        "long_name": "Vinci Shopping Centers Fundo Investimento Imobiliario - Fii",
        "summary": null,
        "currency": "BRL",
        "sector": "Financial",
        "industry": "REIT - Retail",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": null,
        "city": null,
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "W02A.F": {
        "short_name": "WASHINGTON PR.GRP NEW",
        "long_name": "Washington Prime Group Inc.",
        "summary": "Washington Prime Group Inc. is a retail REIT and a recognized leader in the ownership, management, acquisition and development of retail properties. The Company combines a national real estate portfolio with its expertise across the entire shopping center sector to increase cash flow through rigorous management of assets and provide new opportunities to retailers looking for growth throughout the U.S. Washington Prime GroupÂ® is a registered trademark of the Company.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Columbus",
        "zipcode": "43215",
        "website": "http://www.washingtonprime.com",
        "market_cap": "Small Cap"
    },
    "WEHB.BR": {
        "short_name": "WERELDHAVE BELGIUM",
        "long_name": "Wereldhave Belgium Naamloze vennootschap",
        "summary": "Wereldhave Belgium focuses on shopping centres and retail parks that are dominant in their catchment area. The shares are listed on the Euronext Brussels stock exchange. On 31 March 2020, Wereldhave Belgium's market capitalisation amounts to Â\u0080 403 million.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "BRU",
        "market": "be_market",
        "country": "Belgium",
        "state": null,
        "city": "Vilvoorde",
        "zipcode": "1800",
        "website": "http://www.wereldhavebelgium.com",
        "market_cap": "Small Cap"
    },
    "WER.F": {
        "short_name": "WERELDHAVE  EO 1",
        "long_name": "Wereldhave N.V.",
        "summary": "At Wereldhave, we're reinventing shopping centers. Our centers are places where people go, not only to shop, but also to work, relax and spend time with friends and family. We now own and operate 30 center locations across the Netherlands, Belgium and France Â\u0096 combining leisure, entertainment, health & beauty and food & drink with more traditional retail. We choose centers close to cities Â\u0096 that are well connected to public transport and where we can offer free parking. Our centers are anchored around food retail Â\u0096 each has at least one hypermarket or two to three supermarkets. Our centers are places where people go, not only to shop, but also to meet and relax with friends and family. We take a deliberately long-term approach. Our aim is to deliver attractive returns for our investors, create positive value for local communities and other stakeholders and, over time, increase the value of our investments. As a business, consumers are at the heart of everything we do.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Netherlands",
        "state": null,
        "city": "Schiphol",
        "zipcode": "1118 BH",
        "website": "http://www.wereldhave.com",
        "market_cap": "Small Cap"
    },
    "WHA.AS": {
        "short_name": "WERELDHAVE",
        "long_name": "Wereldhave N.V.",
        "summary": "At Wereldhave, we're reinventing shopping centers. Our centers are places where people go, not only to shop, but also to work, relax and spend time with friends and family. We now own and operate 30 center locations across the Netherlands, Belgium and France Â\u0096 combining leisure, entertainment, health & beauty and food & drink with more traditional retail. We choose centers close to cities Â\u0096 that are well connected to public transport and where we can offer free parking. Our centers are anchored around food retail Â\u0096 each has at least one hypermarket or two to three supermarkets. Our centers are places where people go, not only to shop, but also to meet and relax with friends and family. We take a deliberately long-term approach. Our aim is to deliver attractive returns for our investors, create positive value for local communities and other stakeholders and, over time, increase the value of our investments. As a business, consumers are at the heart of everything we do.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "AMS",
        "market": "nl_market",
        "country": "Netherlands",
        "state": null,
        "city": "Schiphol",
        "zipcode": "1118 BH",
        "website": "http://www.wereldhave.com",
        "market_cap": "Small Cap"
    },
    "WHLR": {
        "short_name": "Wheeler Real Estate Investment ",
        "long_name": "Wheeler Real Estate Investment Trust, Inc.",
        "summary": "Headquartered in Virginia Beach, VA, Wheeler Real Estate Investment Trust, Inc. (NASDAQ: WHLR ) is a fully integrated, self-managed commercial real estate investment company focused on owning and operating income-producing retail properties with a primary focus on grocery-anchored centers.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Virginia Beach",
        "zipcode": "23452",
        "website": "http://www.whlr.us",
        "market_cap": "Small Cap"
    },
    "WHLRD": {
        "short_name": "Wheeler Real Estate Investment ",
        "long_name": "Wheeler Real Estate Investment Trust, Inc.",
        "summary": "Headquartered in Virginia Beach, VA, Wheeler Real Estate Investment Trust, Inc. (NASDAQ: WHLR ) is a fully integrated, self-managed commercial real estate investment company focused on owning and operating income-producing retail properties with a primary focus on grocery-anchored centers.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Virginia Beach",
        "zipcode": "23452",
        "website": "http://www.whlr.us",
        "market_cap": "Small Cap"
    },
    "WHLRP": {
        "short_name": "Wheeler Real Estate Investment ",
        "long_name": "Wheeler Real Estate Investment Trust, Inc.",
        "summary": "Headquartered in Virginia Beach, VA, Wheeler Real Estate Investment Trust, Inc. (NASDAQ: WHLR ) is a fully integrated, self-managed commercial real estate investment company focused on owning and operating income-producing retail properties with a primary focus on grocery-anchored centers.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Virginia Beach",
        "zipcode": "23452",
        "website": "http://www.whlr.us",
        "market_cap": "Small Cap"
    },
    "WP4.F": {
        "short_name": "WEING.RLTY INV.DL-,03 SBI",
        "long_name": "Weingarten Realty Investors",
        "summary": "Weingarten Realty Investors (NYSE: WRI) is a shopping center owner, manager and developer. At September 30, 2020, the Company owned or operated under long-term leases, either directly or through its interest in real estate joint ventures or partnerships, a total of 162 properties which are located in 15 states spanning the country from coast to coast. These properties represent approximately 31.0 million square feet of which our interests in these properties aggregated approximately 21.0 million square feet of leasable area.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77008",
        "website": "http://www.weingarten.com",
        "market_cap": "Mid Cap"
    },
    "WPG-PH": {
        "short_name": "Washington Prime Group Inc. 7.5",
        "long_name": "Washington Prime Group Inc.",
        "summary": "Washington Prime Group Inc. is a retail REIT and a recognized leader in the ownership, management, acquisition and development of retail properties. The Company combines a national real estate portfolio with its expertise across the entire shopping center sector to increase cash flow through rigorous management of assets and provide new opportunities to retailers looking for growth throughout the U.S. Washington Prime GroupÂ® is a registered trademark of the Company.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Columbus",
        "zipcode": "43215",
        "website": "http://www.washingtonprime.com",
        "market_cap": "Small Cap"
    },
    "WPG-PI": {
        "short_name": "Washington Prime Group Inc. 6.8",
        "long_name": "Washington Prime Group Inc.",
        "summary": "Washington Prime Group Inc. is a retail REIT and a recognized leader in the ownership, management, acquisition and development of retail properties. The Company combines a national real estate portfolio with its expertise across the entire shopping center sector to increase cash flow through rigorous management of assets and provide new opportunities to retailers looking for growth throughout the U.S. Washington Prime GroupÂ® is a registered trademark of the Company.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Columbus",
        "zipcode": "43215",
        "website": "http://www.washingtonprime.com",
        "market_cap": "Small Cap"
    },
    "WPG": {
        "short_name": "Washington Prime Group Inc.",
        "long_name": "Washington Prime Group Inc.",
        "summary": "Washington Prime Group Inc. is a retail REIT and a recognized leader in the ownership, management, acquisition and development of retail properties. The Company combines a national real estate portfolio with its expertise across the entire shopping center sector to increase cash flow through rigorous management of assets and provide new opportunities to retailers looking for growth throughout the U.S. Washington Prime GroupÂ® is a registered trademark of the Company.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Columbus",
        "zipcode": "43215",
        "website": "http://www.washingtonprime.com",
        "market_cap": "Small Cap"
    },
    "WPLZ11.SA": {
        "short_name": "FII W PLAZA CI",
        "long_name": "Fundo Investec IMB Shopping West Plaza Fund",
        "summary": null,
        "currency": "BRL",
        "sector": "Financial",
        "industry": "REIT - Retail",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "state": null,
        "city": null,
        "zipcode": null,
        "website": null,
        "market_cap": null
    },
    "WPU.F": {
        "short_name": "WERELDHAVE BELGIUM SCA",
        "long_name": "Wereldhave Belgium Naamloze vennootschap",
        "summary": "Wereldhave Belgium focuses on shopping centres and retail parks that are dominant in their catchment area. The shares are listed on the Euronext Brussels stock exchange. On 31 March 2020, Wereldhave Belgium's market capitalisation amounts to Â\u0080 403 million.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Belgium",
        "state": null,
        "city": "Vilvoorde",
        "zipcode": "1800",
        "website": "http://www.wereldhavebelgium.com",
        "market_cap": "Small Cap"
    },
    "WRI": {
        "short_name": "Weingarten Realty Investors",
        "long_name": "Weingarten Realty Investors",
        "summary": "Weingarten Realty Investors (NYSE: WRI) is a shopping center owner, manager and developer. At September 30, 2020, the Company owned or operated under long-term leases, either directly or through its interest in real estate joint ventures or partnerships, a total of 162 properties which are located in 15 states spanning the country from coast to coast. These properties represent approximately 31.0 million square feet of which our interests in these properties aggregated approximately 21.0 million square feet of leasable area.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77008",
        "website": "http://www.weingarten.com",
        "market_cap": "Mid Cap"
    },
    "WSR": {
        "short_name": "Whitestone REIT",
        "long_name": "Whitestone REIT",
        "summary": "Whitestone is a community-centered shopping center REIT that acquires, owns, manages, develops and redevelops high-quality open-air neighborhood centers primarily in the largest, fastest-growing and most affluent markets in the Sunbelt. Whitestone seeks to create communities that thrive through creating local connections between consumers in the surrounding communities and a well-crafted mix of national, regional and local tenants that provide daily necessities, needed services, entertainment and experiences. Whitestone is a monthly dividend paying stock and has consistently paid dividends for over 15 years. Whitestone's strong, balanced and managed capital structure provides stability and flexibility for growth and positions Whitestone to perform well through economic cycles.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77063",
        "website": "http://www.whitestonereit.com",
        "market_cap": "Small Cap"
    },
    "WVI.F": {
        "short_name": "URSTADT BIDDLE PROP.",
        "long_name": "Urstadt Biddle Properties Inc.",
        "summary": "Urstadt Biddle Properties Inc. is a self-administered equity real estate investment trust which owns or has equity interests in 81 properties containing approximately 5.2 million square feet of space. Listed on the New York Stock Exchange since 1970, it provides investors with a means of participating in ownership of income-producing properties. It has paid 203 consecutive quarters of uninterrupted dividends to its shareholders since its inception.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CT",
        "city": "Greenwich",
        "zipcode": "06830",
        "website": "http://www.ubproperties.com",
        "market_cap": "Small Cap"
    },
    "WX1.F": {
        "short_name": "ACADIA RLTY TRUST  DL-001",
        "long_name": "Acadia Realty Trust",
        "summary": "Acadia Realty Trust is an equity real estate investment trust focused on delivering long-term, profitable growth via its dual Â\u0096 Core Portfolio and Fund Â\u0096 operating platforms and its disciplined, location-driven investment strategy. Acadia Realty Trust is accomplishing this goal by building a best-in-class core real estate portfolio with meaningful concentrations of assets in the nation's most dynamic corridors; making profitable opportunistic and value-add investments through its series of discretionary, institutional funds; and maintaining a strong balance sheet.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "Rye",
        "zipcode": "10580",
        "website": "http://www.acadiarealty.com",
        "market_cap": "Small Cap"
    },
    "WXB.F": {
        "short_name": "URSTADT BIDDLE  DL-,01",
        "long_name": "Urstadt Biddle Properties Inc.",
        "summary": "Urstadt Biddle Properties Inc. is a self-administered equity real estate investment trust which owns or has equity interests in 81 properties containing approximately 5.2 million square feet of space. Listed on the New York Stock Exchange since 1970, it provides investors with a means of participating in ownership of income-producing properties. It has paid 203 consecutive quarters of uninterrupted dividends to its shareholders since its inception.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CT",
        "city": "Greenwich",
        "zipcode": "06830",
        "website": "http://www.ubproperties.com",
        "market_cap": "Small Cap"
    },
    "XC2R.F": {
        "short_name": "CAPITAL + REGIONAL LS-,01",
        "long_name": "Capital & Regional Plc",
        "summary": "Capital & Regional is a UK focused retail property REIT specialising in shopping centres that dominate their catchment, serving the non-discretionary and value orientated needs of the local communities. It has a strong track record of delivering value enhancing retail and leisure asset management opportunities across a portfolio of in-town shopping centres. Capital & Regional is listed on the main market of the London Stock Exchange (LSE) and has a secondary listing on the Johannesburg Stock Exchange (JSE). Capital & Regional owns seven shopping centres in Blackburn, Hemel Hempstead, Ilford, Luton, Maidstone, Walthamstow and Wood Green. Capital & Regional manages these assets through its in-house expert property and asset management platform.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SW1P 4NP",
        "website": "http://www.capreg.com",
        "market_cap": "Small Cap"
    },
    "YGGC.MC": {
        "short_name": "GENERAL DE GALER...AS COMERCIAL",
        "long_name": "General de Galerías Comerciales SOCIMI, S.A.",
        "summary": "General de GalerÃ­as Comerciales Socimi, S.A. promotes, constructs, and manages various commercial complexes in Andalusia and Catalonia. The company is based in Madrid, Spain.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "MCE",
        "market": "es_market",
        "country": "Spain",
        "state": null,
        "city": "Marbella",
        "zipcode": "29603",
        "website": "http://generaldegalerias.com/en",
        "market_cap": "Mid Cap"
    }
}