{
    "ANEK.AT": {
        "short_name": "ANEK LINES S.A.(CR)",
        "long_name": "Anonimi Naftiliaki Etaria Kritis S.A.",
        "summary": "Anonimi Naftiliaki Etareia Kritis S.A. operates in the passenger shipping sector. It also transports cargo. The company owns and charters vessels in routes of Adriatic Sea, Crete, Dodecanese, and Cyclades. It provides transportation services to approximately 1,044 thousand passengers. The company also produces and trades in plastic bottles and packaging products; and offers tourism and consulting services. Anonimi Naftiliaki Etareia Kritis S.A. was founded in 1967 and is based in Chania, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Chania"
    },
    "ANEP.AT": {
        "short_name": "ANEK LINES S.A.(PR, issue '90)",
        "long_name": "Anonimi Naftiliaki Etaria Kritis S.A.",
        "summary": "Anonimi Naftiliaki Etareia Kritis S.A. operates in the passenger shipping sector. It also transports cargo. The company owns and charters vessels in routes of Adriatic Sea, Crete, Dodecanese, and Cyclades. It provides transportation services to approximately 1,044 thousand passengers. The company also produces and trades in plastic bottles and packaging products; and offers tourism and consulting services. Anonimi Naftiliaki Etareia Kritis S.A. was founded in 1967 and is based in Chania, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Chania"
    },
    "ANEPO.AT": {
        "short_name": "ANEK LINES S.A.(PR, issue '96)",
        "long_name": "Anonimi Naftiliaki Etaria Kritis S.A.",
        "summary": "Anonimi Naftiliaki Etareia Kritis S.A. operates in the passenger shipping sector. It also transports cargo. The company owns and charters vessels in routes of Adriatic Sea, Crete, Dodecanese, and Cyclades. It provides transportation services to approximately 1,044 thousand passengers. The company also produces and trades in plastic bottles and packaging products; and offers tourism and consulting services. Anonimi Naftiliaki Etareia Kritis S.A. was founded in 1967 and is based in Chania, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Chania"
    },
    "ATTICA.AT": {
        "short_name": "ATTICA HOLDINGS SA",
        "long_name": "Attica Holdings S.A.",
        "summary": "Attica Holdings S.A., through its subsidiaries, provides passenger shipping and travel agency services in Greece and internationally. The company's vessels offer sea transportation services to passengers, private vehicles, and freight. It owns and operates thirty vessels, twenty Ro-Pax ferries, nine high-speed vessels and one Ro-Ro vessel under the brands Superfast Ferries, Blue Star Ferries, and Hellenic Seaways. The company was founded in 1918 and is headquartered in Kallithea, Greece. Attica Holdings S.A. is a subsidiary of MIG Shipping S.A.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Kallithea"
    },
    "GLNGN.MX": {
        "short_name": "GOLAR LNG LIMITED",
        "long_name": "Golar LNG Limited",
        "summary": "Golar LNG Limited provides infrastructure for the liquefaction, transportation, regasification, and downstream distribution of LNG. It operates through three segments: Vessel Operations, Floating Liquefaction Natural Gas Vessel (FLNG), and Power. The company engages in the acquisition, ownership, operation, and chartering of LNG carriers, FLNG, and floating storage regasification units (FSRUs); and the development of gas to power projects, as well as LNG distribution operations. As of April 16, 2020, it operated twelve LNG carriers, one FSRU, and two FLNGs. The company was founded in 1946 and is headquartered in Hamilton, Bermuda.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "INHC": {
        "short_name": "INNOLOG HLDGS CORP",
        "long_name": "Innolog Holdings Corporation",
        "summary": "Innolog Holdings Corporation, through its subsidiary, Innovative Logistics Techniques, Inc., provides supply chain logistics and information technology solutions to clients in the public and private sectors. The company offers its services and solutions to various clients comprising the Department of Defense, Department of Homeland Security, and civilian agencies in the federal government, as well as state and local municipalities and commercial organizations. Innolog Holdings Corporation is headquartered in Fairfax, Virginia with an additional office in Washington D.C.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Fairfax"
    },
    "OLTH.AT": {
        "short_name": "THESSALONIKI PORT AUTHORITY",
        "long_name": "Thessaloniki Port Authority Societe Anonyme",
        "summary": "Thessaloniki Port Authority Societe Anonyme engages in the management and exploitation of the port of Thessaloniki located in Greece. It operates through four segments: Container Terminal, Conventional Cargo, Passenger Traffic, and Utilization of Facilities. The company provides conventional cargo handling services, including loading and unloading services, and SILO services; and containerized cargo handling services. It also offers ships anchoring, mooring, berthing, and other services; and services to passengers on coastal and cruise ships and in transit. In addition, it offers spaces for commercial and other uses; and operates car parking stations. The company primarily serves industries, shipping agents, container transportation companies, and freight transport companies. Thessaloniki Port Authority Societe Anonyme was established in 1999 and is based in Thessaloniki, Greece.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Thessaloniki"
    },
    "PPA.AT": {
        "short_name": "PIREUS PORT AUTHORITY S.A (CR)",
        "long_name": "Piraeus Port Authority S.A.",
        "summary": "Piraeus Port Authority S.A. provides port services at the port of Piraeus, Greece. The company operates through Container Terminal, Handling Car, Coasting, Cruise, Ship Repairing, and Other segments. It offers anchoring services of vessels, cargo handling, loading, and unloading services, as well as goods storage and car transportation services. The company is also involved in maintenance of port facilities. In addition, it offers port services, including water, electricity, space management, merchandise management, and telephone connection to ships; and services to travelers, as well as rents space to third parties. The company was founded in 1930 and is based in Piraeus, Greece. Piraeus Port Authority S.A. is a subsidiary of COSCO SHIPPING (Hong Kong) Limited.",
        "currency": "EUR",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Piraeus"
    },
    "TGPN.MX": {
        "short_name": "TEEKAY LNG PARTNERS LP",
        "long_name": "Teekay LNG Partners L.P.",
        "summary": "Teekay LNG Partners L.P. provides marine transportation services focusing on liquefied natural gas (LNG) and liquefied petroleum gas (LPG) worldwide. It operates in LNG and LPG segments. The company transports liquid petroleum gases, including propane, butane, and ethane; petrochemical gases, such as ethylene, propylene, and butadiene; and ammonia. As of December 31, 2019, it had a fleet of 49 LNG carriers and 30 LPG/multi-gas carriers. Teekay GP L.L.C. serves as the general partner of the company. Teekay LNG Partners L.P. was founded in 2004 and is based in Hamilton, Bermuda.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Bermuda",
        "city": "Hamilton"
    },
    "TNKN.MX": {
        "short_name": "TEEKAY TANKERS LTD",
        "long_name": "Teekay Tankers Ltd.",
        "summary": "Teekay Tankers Ltd. provides marine transportation services to oil industries in Bermuda and internationally. It operates through two segments, Tanker and Ship-to-ship Transfer (STS). The company offers voyage and time charter services; and offshore STS transfer services of commodities primarily crude oil and refined oil products, as well as liquid gases and various other products. It also provides tanker commercial and technical management, LNG terminal management, consultancy, procurement, and equipment rental services; and lightering support services, including full service lightering and other lightering support services. As of December 31, 2019, the company owned and leased 55 double-hull oil tankers, 2 ship-to-ship support vessels, and 9 time chartered-in tankers. Its vessels are employed through a mix of short- or medium-term fixed-rate time charter contracts and spot tanker market trading. Teekay Tankers Ltd. was founded in 2007 and is based in Vancouver, Canada.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Shipping",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Canada",
        "city": "Vancouver"
    }
}