{
    "000591.SZ": {
        "short_name": "CECEP SOLAR ENERGY",
        "long_name": "CECEP Solar Energy Co.,Ltd.",
        "summary": "CECEP Solar Energy Co.,Ltd. engages in the research and development, construction, and operation of photovoltaic power plants. It engages in the technology research and development, manufacture, and sale of monocrystalline silicon products, and polycrystalline silicon battery and components. The company also generates and sells solar energy; invests in, constructs, operates, maintains, and manages solar energy generation projects; provides solar energy generation planning, technology research and development, design consultation, integration, installation, and operation maintenance services; and other related business, as well as manufactures generating system devices. In addition, it provides electricity solution to production; and living electricity facilities for families, villages, hospitals, border posts, islands, and others. The company was founded in 2009 and is based in Beijing, China. CECEP Solar Energy Co.,Ltd. is a subsidiary of China Energy Conservation and Environmental Protection Group.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "002218.SZ": {
        "short_name": "SZ TOPRAYSOLAR CO.",
        "long_name": "SHENZHEN TOPRAYSOLAR Co.,Ltd.",
        "summary": "SHENZHEN TOPRAYSOLAR Co.,Ltd. operates as an integrated solar manufacturer in China, Europe, North America, Africa, and internationally. The company offers solar glasses, solar cells, solar wafers, and solar ingots. It also provides on grid and off grid solar panels, such as mono and poly crystalline solar panels; and regular, flexible, folding, and solar blanket panels. In addition, the company offers solar consumer products comprising solar chargers that include electronic chargers, automotive products, charge regulators, and accessories; solar power kits; solar lightings; and solar home improvement products, as well as solar battery chips, solar power systems, solar energy absorbers, and water heater systems. Further, it provides EPC services, which comprise design, procurement, installation, and civic works, as well as operation and maintenance services for solar projects. It also develops and operates solar power plants with a capacity of 110MW in Dingbian, China. The company was founded in 1992 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "002506.SZ": {
        "short_name": "GCL SYSTEM INTEGRA",
        "long_name": "GCL System Integration Technology Co., Ltd.",
        "summary": "GCL System Integration Technology Co., Ltd. provides solar energy solutions in China and internationally. It offers solar modules, trackers, solar panels, electric cabinets, cables, monitor software systems, mounting systems, inverters, and EV chargers; and lithium batteries that enable customers to optimize the use of their residential solar energy system, as well as home energy management systems. The company also provides solar cube 20K/50K for small population areas with weak power supply; G-Home solar kit for home owners; financial services, such as leasing and capital fund services; and smart operation and management platform comprising cloud data and risk management. In addition, it operates 2.5 MW solar block to supply energy to solar power plants; and offers cells, system integration, engineering procumbent construction, stored energy, etc. The company was founded in 2003 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Suzhou"
    },
    "0438.HK": {
        "short_name": "IRICO NEWENERGY",
        "long_name": "IRICO Group New Energy Company Limited",
        "summary": "IRICO Group New Energy Company Limited, together with its subsidiaries, engages in the solar photovoltaic, modules and power station, and other businesses in the People's Republic of China and internationally. It researches, develops, produces, and sells solar photovoltaic glasses, solar cells, and components. The company also constructs and operates solar photovoltaic power stations. In addition, it is involved in the production and sale of inorganic nonmetallic materials and products. The company was formerly known as IRICO Group Electronics Company Limited and changed its name to IRICO Group New Energy Company Limited in January 2016. The company was founded in 2004 and is headquartered in Xianyang, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Xianyang"
    },
    "0712.HK": {
        "short_name": "COMTEC SOLAR",
        "long_name": "Comtec Solar Systems Group Limited",
        "summary": "Comtec Solar Systems Group Limited, an investment holding company, researches, produces, and sells mono-crystalline solar wafers and ingots in the People's Republic of China and Malaysia. The company operates through Upstream, and Downstream Solar and Power Storage segments. It offers solar grade products, such as pseudo square bricks, wafers, and polysilicon products. The company also invests in, develops, constructs, and operates solar photovoltaic power stations; and researches and develops, designs, integrates, and sells lithium battery management and battery systems to electric vehicle and lithium battery manufacturers, and power storage companies. In addition, it trades in solar related parts, equipment, and products; and generates solar power. The company was founded in 1999 and is headquartered in Shanghai, the People's Republic of China. Comtec Solar Systems Group Limited is a subsidiary of Fonty Holdings Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "0750.HK": {
        "short_name": "SFSY ENERGY",
        "long_name": "China Shuifa Singyes Energy Holdings Limited",
        "summary": "China Shuifa Singyes Energy Holdings Limited, an investment holding company, designs, fabricates, and installs conventional curtain walls and solar projects in Mainland China, Oceania, Macau, Malaysia, Hong Kong, and internationally. Its solar projects include building integrated photovoltaic systems, roof top solar systems, and ground mounted solar systems. The company also manufactures and sells renewable energy goods, including smart grid systems; solar thermal systems and products, such as air-source heat pumps, flat-pane solar thermal collectors, photovoltaic and photothermal composite modules, and absorbing coating products; smart LCD dimming films; smart LCD dimming glass products; and indium-tin oxide films. In addition, it engages in the development of new energy materials and marine biology technology; research and development of energy- saving products; research and development of electricity and new energy; provision of engineering design services; and research, construction, and operation of solar power station. The company was formerly known as China Singyes Solar Technologies Holdings Limited and changed its name to China Shuifa Singyes Energy Holdings Limited in April 2020. China Shuifa Singyes Energy Holdings Limited was founded in 1995 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0757.HK": {
        "short_name": "SOLARGIGA",
        "long_name": "Solargiga Energy Holdings Limited",
        "summary": "Solargiga Energy Holdings Limited, an investment holding company, engages in the manufacture, processing, and trading of polysilicon and monocrystalline silicon solar ingots and wafers in Mainland China. The company also manufactures and trades in monocrystalline silicon solar cells and photovoltaic modules; installs photovoltaic systems; and constructs and operates photovoltaic power plants. In addition, it manufactures and trades in electronic semiconductor materials. The company serves silicon solar wafer, cell or modules manufacturers or traders. It exports its products to Japan, South Asia, Europe, and internationally. The company was founded in 2001 and is headquartered in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0968.HK": {
        "short_name": "XINYI SOLAR",
        "long_name": "Xinyi Solar Holdings Limited",
        "summary": "Xinyi Solar Holdings Limited, an investment holding company, produces and sells solar glass products in the People's Republic of China, Malaysia, and internationally. It operates through three segments: Sales of Solar Glass; Solar Farm Business; and Engineering, Procurement and Construction Services. The company offers photovolatic power station, ultraclear patterned glasses, back glasses, and AR photovoltaic glasses, as well as double glass modules. It also develops and operates solar farms; and provides engineering, procurement, and construction services. In addition, the company engages in the provision of solar power systems; and trading of solar glass products. Xinyi Solar Holdings Limited was founded in 2008 and is headquartered in Wuhu, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Wuhu"
    },
    "1165.HK": {
        "short_name": "SFCE",
        "long_name": "Shunfeng International Clean Energy Limited",
        "summary": "Shunfeng International Clean Energy Limited, together with its subsidiaries, provides clean energy and low-carbon energy-saving integrated solutions in the Peoples' Republic of China and internationally. It operates through Solar Power Generation in the PRC and Manufacturing and Sales of Light-Emitting Diode (LED) Products segments. The company offers GaN-on-silicon substrate LED epitaxial wafers and chips, LED packages, and other LED products; and solar products and related installation services. It also engages in the solar power generation business. The company was formerly known as Shunfeng Photovoltaic International Limited and changed its name to Shunfeng International Clean Energy Limited in November 2014. Shunfeng International Clean Energy Limited is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "13X.F": {
        "short_name": "XINYI SOLAR HLDGS",
        "long_name": "Xinyi Solar Holdings Limited",
        "summary": "Xinyi Solar Holdings Limited, an investment holding company, produces and sells solar glass products in the People's Republic of China, Malaysia, and internationally. It operates through three segments: Sales of Solar Glass; Solar Farm Business; and Engineering, Procurement and Construction Services. The company offers photovolatic power station, ultraclear patterned glasses, back glasses, and AR photovoltaic glasses, as well as double glass modules. It also develops and operates solar farms; and provides engineering, procurement, and construction services. In addition, the company engages in the provision of solar power systems; and trading of solar glass products. Xinyi Solar Holdings Limited was founded in 2008 and is headquartered in Wuhu, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Wuhu"
    },
    "1421.HK": {
        "short_name": "KINGBO STRIKE",
        "long_name": "Kingbo Strike Limited",
        "summary": "Kingbo Strike Limited, an investment holding company, engages in the construction, operation, and sale of solar power station projects in the People's Republic of China. The company is involved in the supply and installation of solar photovoltaic parts and equipment. It also engages in the provision of electrical engineering services in Singapore; and finance business. Kingbo Strike Limited is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "1799.HK": {
        "short_name": "XINTE ENERGY",
        "long_name": "Xinte Energy Co., Ltd.",
        "summary": "Xinte Energy Co., Ltd., together with its subsidiaries, provides engineering and construction contracting services and systems for solar and wind power plants in the People's Republic of China and internationally. It also produces polysilicon products; and operates solar and wind power plants. In addition, the company produces and sells inverters, flexible direct current transmission converter valves, and static var generators. Further, it offers consulting, design, research, and development services; and sells electricity. The company was founded in 2008 and is headquartered in Urumqi, the People's Republic of China. Xinte Energy Co., Ltd. is a subsidiary of TBEA Co., Ltd.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Urumqi"
    },
    "1E4.SG": {
        "short_name": "E4U A.S. Inhaber-Aktien KC 100",
        "long_name": "E4U a.s.",
        "summary": "E4U a.s. invests in and operates plants that generate energy from renewable sources in the Czech Republic. It operates two solar parks, Dubnany and Ratiskovice power stations with a total installed capacity of 4.4 MWp in the area of southern Moravia. The company was founded in 2006 and is based in Dubnany, the Czech Republic. E4U a.s. is a subsidiary of E4U Finance s.r.o.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Czech Republic",
        "city": "Dubnany"
    },
    "2ED.F": {
        "short_name": "SOLAREDGE TECHN. DL-,0001",
        "long_name": "SolarEdge Technologies, Inc.",
        "summary": "SolarEdge Technologies, Inc., together with its subsidiaries, designs, develops, and sells direct current (DC) optimized inverter systems for solar photovoltaic (PV) installations worldwide. It offers inverters, power optimizers, communication devices, and smart energy management solutions used in residential, commercial, and small utility-scale solar installations; and a cloud-based monitoring platform that collects and processes information from the power optimizers and inverters, as well as monitors and manages the solar PV system. The company also provides residential, commercial, and large scale photovoltaics, energy storage and backup, electric vehicle charging, and home energy management solutions, as well as grid services; and e-Mobility, automation machines, lithium-ion cells and battery packs, and uninterrupted power supply solutions, as well as virtual power plants, which helps to manage the load on the grid and grid stability. In addition, it offers pre-sales support, ongoing trainings, and technical support and after installation services. The company sells its products to the providers of solar PV systems; and solar installers and distributors, electrical equipment wholesalers, and PV module manufacturers, as well as engineering, procurement, and construction firms. SolarEdge Technologies, Inc. was founded in 2006 and is headquartered in Herzliya, Israel.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Herzliya"
    },
    "300111.SZ": {
        "short_name": "ZHEJIANG SUNFLOWE",
        "long_name": "Zhejiang Sunflower Great Health Limited Liability Company",
        "summary": "Zhejiang Sunflower Great Health Limited Liability Company engages in the research, development, production, and sale of solar energy batteries and components worldwide. It offers polycrystalline silicon wafers; and photovoltaic cells and modules. The company was formerly known as Zhejiang Sunflower Light Energy Science & Technology Limited Liability Company and changed its name to Zhejiang Sunflower Great Health Limited Liability Company in March 2020. Zhejiang Sunflower Great Health Limited Liability Company was founded in 2005 and is headquartered in Shaoxing, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shaoxing"
    },
    "300125.SZ": {
        "short_name": "LINGDA GROUP CO LT",
        "long_name": "Lingda Group Co., Ltd.",
        "summary": "Lingda Group Co., Ltd. engages in the energy industry development, ecological environment improvement, and energy conservation activities in China. It provides new energy technology consulting, technology, technology transfer and engineering, design, equipment package, construction, and engineering services; energy conservation and other renewable energy technology research and development services; un-stated technology promotion and application services; and other technology promotion services. The company is also involved in the general contracting of practically applied projects; research, development, manufacture, assembly, and sale of mechanical, electric, and automation control equipment and spare parts; investment, operation, and management of various projects and related energy contracts; and natural science research and experimental development activities. In addition, it engages in solar photovoltaic system construction; vegetable cultivation; planting Chinese herbal medicine; other machinery and electronic products wholesale; business information consultation; investment management consulting; other engineering preparation; and other construction and installation activities. The company serves various industries, including cement, iron and steel, metallurgy, coking, etc. Lingda Group Co., Ltd. was founded in 2005 and is based in Dalian, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Dalian"
    },
    "300393.SZ": {
        "short_name": "JOLYWOOD (SUZHOU)",
        "long_name": "Jolywood (Suzhou) Sunwatt Co., Ltd.",
        "summary": "Jolywood (Suzhou) Sunwatt Co., Ltd. manufactures and sells integrated photovoltaic (PV) products worldwide. It offers solar module backsheets, P-type and N-type mono-crystalline silicon solar cells, and N-type bifacial solar cells; and invests in, installs, and operates distributed PV systems. The company was formerly known as Jolywood (Suzhou) Solar Material Technology Co., Ltd. and changed its name to Jolywood (Suzhou) Sunwatt Co., Ltd. in 2011. Jolywood (Suzhou) Sunwatt Co., Ltd. was founded in 2008 and is headquartered in Changzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Changzhou"
    },
    "3150.T": {
        "short_name": "GREMZ INC",
        "long_name": "gremz,Inc.",
        "summary": "gremz,Inc. engages in smart house, energy cost solution, and incubation businesses in Japan. The company sells various products for residential photovoltaic power generation systems; and electronic breakers, energy-saving equipment, storage batteries, and other products. It also provides various electrification services for consumers; and consulting services for reducing electricity costs for small and medium enterprises, as well as retails electric power to low and high voltage electricity customers. gremz,Inc. was founded in 2005 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3686.TW": {
        "short_name": "DANEN TECHNOLOGY CORPORTAION",
        "long_name": "Danen Technology Corporation",
        "summary": "Danen Technology Corporation manufactures and sells solar ingots and wafers for photovoltaic applications worldwide. The company provides multi-crystalline solar wafers, ingots, and bricks; and customized OEM services. It serves solar cell companies. The company was founded in 2007 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "3800.HK": {
        "short_name": "GCL-POLY ENERGY",
        "long_name": "GCL-Poly Energy Holdings Limited",
        "summary": "GCL-Poly Energy Holdings Limited operates as a solar photovoltaic company in the People's Republic of China and internationally. It operates through three segments: Solar Material Business, Solar Farm Business, and New Energy Business. The Solar Material Business segment primarily manufactures and sells polysilicon and wafer products to companies operating in the solar industry. The Solar Farm Business segment operates and manages 371 megawatts (MW) of solar farms, of which 18 MW solar farms located in the United States and 353 MW solar farms located in the People's Republic of China. The New Energy Business segment develops, constructs, operates, and manages solar farms. GCL-Poly Energy Holdings Limited was incorporated in 2006 and is based in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "3FV.F": {
        "short_name": "SOLARGIGA ENERGY H. HD-01",
        "long_name": "Solargiga Energy Holdings Limited",
        "summary": "Solargiga Energy Holdings Limited, an investment holding company, engages in the manufacture, processing, and trading of polysilicon and monocrystalline silicon solar ingots and wafers in Mainland China. The company also manufactures and trades in monocrystalline silicon solar cells and photovoltaic modules; installs photovoltaic systems; and constructs and operates photovoltaic power plants. In addition, it manufactures and trades in electronic semiconductor materials. The company serves silicon solar wafer, cell or modules manufacturers or traders. It exports its products to Japan, South Asia, Europe, and internationally. The company was founded in 2001 and is headquartered in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "3S9.DE": {
        "short_name": "SUNRUN INC.  DL-,0001",
        "long_name": "Sunrun Inc.",
        "summary": "Sunrun Inc. engages in the design, development, installation, sale, ownership, and maintenance of residential solar energy systems in the United States. It also sells solar energy systems and products, such as panels and racking; and solar leads generated to customers. In addition, the company offers battery storage along with solar energy systems. Its primary customers are residential homeowners. The company markets and sells its products through direct-to-consumer approach across online, retail, mass media, digital media, canvassing, field marketing, and referral channels, as well as its partner network. Sunrun Inc. was founded in 2007 and is headquartered in San Francisco, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "San Francisco"
    },
    "3S9.F": {
        "short_name": "SUNRUN INC.  DL-,0001",
        "long_name": "Sunrun Inc.",
        "summary": "Sunrun Inc. engages in the design, development, installation, sale, ownership, and maintenance of residential solar energy systems in the United States. It also sells solar energy systems and products, such as panels and racking; and solar leads generated to customers. In addition, the company offers battery storage along with solar energy systems. Its primary customers are residential homeowners. The company markets and sells its products through direct-to-consumer approach across online, retail, mass media, digital media, canvassing, field marketing, and referral channels, as well as its partner network. Sunrun Inc. was founded in 2007 and is headquartered in San Francisco, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Francisco"
    },
    "3SH.F": {
        "short_name": "SHUNFENG INTL CL.EN.HD-01",
        "long_name": "Shunfeng International Clean Energy Limited",
        "summary": "Shunfeng International Clean Energy Limited, together with its subsidiaries, provides clean energy and low-carbon energy-saving integrated solutions in the Peoples' Republic of China and internationally. It operates through Solar Power Generation in the PRC and Manufacturing and Sales of Light-Emitting Diode (LED) Products segments. The company offers GaN-on-silicon substrate LED epitaxial wafers and chips, LED packages, and other LED products; and solar products and related installation services. It also engages in the solar power generation business. The company was formerly known as Shunfeng Photovoltaic International Limited and changed its name to Shunfeng International Clean Energy Limited in November 2014. Shunfeng International Clean Energy Limited is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "4582.TWO": {
        "short_name": "HENGS",
        "long_name": "Hengs Technology Co., Ltd.",
        "summary": "Hengs Technology Co., Ltd. provides solar monitoring system integration and related products in Taiwan. The company's design products include solar pumps, RSK systems, off-grid solar power system kits, solar outdoor lightings, and solar mounting racks; and distributed products comprise PV modules, charge controllers, inverters, batteries, solar surge arresters, and wind turbines. It also markets related solar power products, as well as markets and services industry and precision instruments; and offers warranty services. The company was founded in 1998 and is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "4934.TW": {
        "short_name": "TAINERGY TECH CO LTD",
        "long_name": "Tainergy Tech Co., Ltd.",
        "summary": "Tainergy Tech Co., Ltd. designs, develops, manufactures, and markets solar cells in Taiwan. It offers solar energy application systems, including solar refrigerator, pumping, air conditioner, and deionized water systems; multi-crystalline and mono-crystalline silicon solar cells; solar modules with build in Li-NMC batteries; solar modules for briefcase, folding, flexible, and light weight solar panel applications; solar power storage systems; domestic back-up power systems, such as power unit, energy storage system, power walker, and portable power station; and solar power bricks. The company was founded in 2007 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "4U1A.F": {
        "short_name": "ISUN INC.  DL-,0001",
        "long_name": "iSun, Inc.",
        "summary": "iSun, Inc. operates as a solar engineering, construction, and procurement contractor for commercial and industrial customers in the Northeastern United States. It also provides electrical contracting services; and data and communication services. The company was formerly known as The Peck Company Holdings, Inc. and changed its name to iSun, Inc. in January 2021. iSun, Inc. was founded in 1972 and is headquartered in South Burlington, Vermont.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Williston"
    },
    "52Y.F": {
        "short_name": "VERDITEK PLC LS-,0004",
        "long_name": "Verditek PLC",
        "summary": "Verditek PLC operates as a clean technology company in the United Kingdom, rest of Europe, and the United States. It manufactures and commercializes solar technologies in the clean energy, CO2 emission reduction, deodorization markets. The company's solar modules are used in various applications, such as transportation, real estate, consumer retail, and telecom sectors, as well as in caravans and holiday homes, solar carports and electric vehicle charging, hotel, safari, glamping, and corporate events. It also develops filtration technologies. The company was incorporated in 2016 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "5J4.F": {
        "short_name": "SAVOSOLAR PLC A",
        "long_name": "Savosolar Oyj",
        "summary": "Savosolar Oyj, together with its subsidiaries, designs and supplies solar thermal systems primarily in Europe. The company produces flat plate collectors, collector fields, and turnkey solar thermal systems. Its products are used in district heating, industrial process heating, and hot water and space heating applications. The company was founded in 2009 and is based in Mikkeli, Finland.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Finland",
        "city": "Mikkeli"
    },
    "5UX.F": {
        "short_name": "MIDSUMMER AB",
        "long_name": "Midsummer AB (publ)",
        "summary": "Midsummer AB (publ) develops and supplies equipment for manufacturing CIGS thin film solar cells in Sweden. It offers Duo, a fully automatic deposition system for CIGS solar cell manufacturing; UNO, a platform for CIGS and CZTS solar cells; and flexible and lightweight modules for PV applications in membrane roofs, portable power plants, marine installations, vehicle usage, landfill covers, or other infrastructure projects. The company is headquartered in JÃ¤rfÃ¤lla, Sweden.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Sweden",
        "city": "JÃ¤rfÃ¤lla"
    },
    "600537.SS": {
        "short_name": "EGING PHOTOVOLTAIC TECHNOLOGY C",
        "long_name": "EGing Photovoltaic Technology Co.,Ltd.",
        "summary": "EGing Photovoltaic Technology Co.,Ltd. researches, develops, manufactures, and sells photovoltaic products in China and internationally. It offers mono and poly silicon solar modules, as well as glass-glass-solar modules. The company was formerly known as Haitong Food Group Co., Ltd. EGing Photovoltaic Technology Co.,Ltd. was founded in 2003 and is headquartered in Jintan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Jintan"
    },
    "600732.SS": {
        "short_name": "SHANGHAI AIKO SOLAR ENERGY CO L",
        "long_name": "Shanghai Aiko Solar Energy Co., Ltd.",
        "summary": "Shanghai Aiko Solar Energy Co., Ltd. engages in the research, manufacturing, and sale of crystalline silicon solar cells. The company was founded in 1996 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "603105.SS": {
        "short_name": "ZHEJIANG XINNENG PHOTOVOLTAIC T",
        "long_name": "Zhejiang Sunoren Solar Technology Co.,Ltd.",
        "summary": "Zhejiang Sunoren Solar Technology Co.,Ltd. engages in the photovoltaic industry in China. It develops solar power stations; produces solar modules; manufactures silicon wafers; and researches and develops in the field of photovoltaic manufacturing and distributed photovoltaic power plants. The company was founded in 2008 and is headquartered in Haining, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Haining"
    },
    "603366.SS": {
        "short_name": "SOLAREAST HOLDINGS CO LTD",
        "long_name": "Solareast Holdings Co., Ltd.",
        "summary": "Solareast Holdings Co., Ltd. operates in solar thermal industry worldwide. The company's products include compact solar water heaters, including non-pressure, pressurized pre-heated, pressurized heat pipe, non-pressure and pressurized flat plate, and pressurized double tank solar water heaters; solar collectors comprising heat pipe, U pipe, CPC, DMG, flat plate, and non-pressure project collectors; split solar heating systems; and domestic series and swimming pool heat pumps, as well as water purifiers. It also offers accessories, such as controllers, collector mounting brackets, mounting brackets, flexible steel pipes, expansion tanks, and thermostatic mixing faucets. The company was formerly known as Jiangsu Sunrain Solar Energy Co.,Ltd. Solareast Holdings Co., Ltd. was founded in 1999 and is headquartered in Lianyungang, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Lianyungang"
    },
    "603628.SS": {
        "short_name": "CLENERGY (XIAMEN) TECHNOLOGY CO",
        "long_name": "Clenergy (Xiamen) Technology Co., Ltd.",
        "summary": "Clenergy (Xiamen) Technology Co., Ltd. researches, develops, manufactures, sells, and services solar products in China and internationally. The company provides a range of solar mounting systems for various kinds of solar installations, including residential, industrial, commercial, and utility scale projects. It also offers power electronics products, such as integrated string combiner boxes, AC combiner boxes, and three phase string inverters. In addition, the company provides turnkey engineering services, including design, development, procurement, and construction of power plants; project consultation services, such as policy analysis, business trends analysis, project positioning analysis, risk analysis, and financing solutions; and technical consultation services comprising site investigation, technical scheme comparison and selection, economic analysis, technical risk assessment, on-site technical management, and project post-evaluation. Further, it offers project financing services. The company was founded in 2007 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Xiamen"
    },
    "6244.TWO": {
        "short_name": "MOTECH INDUSTRIES INC",
        "long_name": "Motech Industries Inc.",
        "summary": "Motech Industries Inc. researches, develops, manufactures, and sells solar products and services in Taiwan and internationally. It provides photovoltaic (PV) cells, PV modules, PV power systems, and PV inverters. The company was formerly known as Meter International Corporation. Motech Industries Inc. was founded in 1981 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6443.TW": {
        "short_name": "TSEC CORPORATION",
        "long_name": "TSEC Corporation",
        "summary": "TSEC Corporation engages in the design, manufacture, and sale of solar cells and modules in Taiwan, Japan, the United States, Europe, China, and internationally. It is also involved in power plant construction and operation services; rental of solar power generating equipment; sale of self-generated electricity; and provision of energy technology services. The company was incorporated in 2010 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "6477.TW": {
        "short_name": "ANJI TECHNOLOGY CO LTD",
        "long_name": "ANJI Technology Co., Ltd.",
        "summary": "ANJI Technology Co., Ltd. develops, manufactures, and sells solar modules in Taiwan. The company offers poly and mono crystalline, double glass, and building integrated photovoltaic solar modules, as well as AC modules. Its products are used in power generation systems. The company also provides 3D printing services. ANJI Technology Co., Ltd. was founded in 2007 and is headquartered in TÃ¡inÃ¡n, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "TÃ¡inÃ¡n"
    },
    "6692.TWO": {
        "short_name": "AES",
        "long_name": "Acmepoint Energy Services Co.,Ltd.",
        "summary": "Acmepoint Energy Services Co.,Ltd. provides engineering, procurement, construction consultancy, construction, and operation warranty and maintenance services for solar power stations in Taiwan and internationally. The company also offers solar systems, grid connected PV systems, standalone PV systems, solar hot water systems, biomass energy generation systems, and energy storage systems. In addition, it provides BIPV and BAPV system integration services, and solar system and station services. The company was founded in 1994 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei City"
    },
    "688408.SS": {
        "short_name": "ARCTECH SOLAR HOLDING CO LTD",
        "long_name": "Arctech Solar Holding Co., Ltd.",
        "summary": "Arctech Solar Holding Co., Ltd. provides solar tracking and racking systems for utilities, commercial, industrial, and residential projects worldwide. The company offers solar trackers, such as horizontal single axis trackers, horizontal single axis trackers with tilted modules, and tilt single axis trackers that improve the amount of the electricity through orientation of the PV panels towards the sun; and seasonal tilt, and dual and single pole mounting structures. As of December 31, 2018, it had a cumulatively installed capacity of approximately 19 GW; and had completed approximately 700 projects in 24 countries. The company is headquartered in Kunshan, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Kunshan"
    },
    "688599.SS": {
        "short_name": "TRINA SOLAR CO LTD",
        "long_name": "Trina Solar Co., Ltd",
        "summary": "Trina Solar Co., Ltd. operates as an integrated solar power products manufacturer and solar system developer in China, Europe, the United States, and other Asia Pacific regions. The company designs, develops, manufactures, and sells photovoltaic (PV) modules comprising monocrystalline and multicrystalline PV modules ranging in various power outputs for use in residential, commercial, industrial, and other solar power generation systems. It also provides mono- and multi-crystalline silicon ingots, wafers, cells, and related products. In addition, the company designs, constructs, sells, and/or operates solar power projects. It sells its products to power plant developers and operators, distributors, wholesalers, PV system integrators, and regional and national grid operators. Trina Solar Co., Ltd. was founded in 1997 and is headquartered in Changzhou, China.",
        "currency": "CNY",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Changzhou"
    },
    "6EH0.F": {
        "short_name": null,
        "long_name": "EnerDynamic Hybrid Technologies Corp.",
        "summary": "EnerDynamic Hybrid Technologies Corp. designs, develops, manufactures, assembles, and distributes structural building systems in Canada. The company provides modular building/home systems with integrated hybrid alternative energy systems. It offers fiberglass reinforced structural insulted panels, ultra-light solar panels, controlled environment growing pods, and alternative energy producing mobile trailers under the ENERTEC brand. The company also provides PWR wagon, a stock trailer customized to offer a remote site power source through its self-contained solar energy system. EnerDynamic Hybrid Technologies Corp. is headquartered in Niagara Falls, Canada.",
        "currency": null,
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Niagara Falls"
    },
    "7RT.F": {
        "short_name": "VALOE OYJ",
        "long_name": "Valoe Oyj",
        "summary": "Valoe Oyj develops and sells solar energy technology products worldwide. The company offers automated production technology for solar modules; production lines for modules, solar modules, and special components for solar modules; and solar cells. It also provides one-sided interdigitated back contact (IBC) and bifacial IBC back contact modules; and solar power plants and systems. The company was formerly known as Cencorp Oyj and changed its name to Valoe Oyj in May 2015. Valoe Oyj was founded in 1948 and is headquartered in Mikkeli, Finland.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Finland",
        "city": "Mikkeli"
    },
    "7SE.F": {
        "short_name": "SUNNOVA ENERGY INT.-,0001",
        "long_name": "Sunnova Energy International Inc.",
        "summary": "Sunnova Energy International Inc., together with its subsidiaries, provides residential solar and energy storage services in the United States. The company offers operations and maintenance, monitoring, repairs and replacements, equipment upgrades, on-site power optimization, and diagnostics services. It operates a fleet of residential solar energy systems with a generation capacity of approximately 790 megawatts serving approximately 107,000 customers. Sunnova Energy International Inc. was founded in 2012 and is headquartered in Houston, Texas.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Houston"
    },
    "7SL2.F": {
        "short_name": "SUNWORKS INC.  DL-,001",
        "long_name": "Sunworks, Inc.",
        "summary": "Sunworks, Inc., through its subsidiaries, provides photovoltaic based power systems for the agricultural, commercial, industrial, public works, and residential markets in California, Massachusetts, Nevada, Oregon, New Jersey, and Hawaii. The company also designs, finances, integrates, installs, and manages systems ranging in size from 2 kilowatt for residential loads to multi megawatt systems for larger projects. In addition, it offers a range of installation services, including design, system engineering, procurement, permitting, construction, grid connection, warranty, system monitoring, and maintenance services to its solar energy customers. The company was formerly known as Solar3D, Inc. and changed its name to Sunworks, Inc. in March 2016. Sunworks, Inc. was incorporated in 2002 and is headquartered in Roseville, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Roseville"
    },
    "7ST.F": {
        "short_name": "SOLTECH ENERGY SWEDEN AB",
        "long_name": "SolTech Energy Sweden AB (publ)",
        "summary": "SolTech Energy Sweden AB (publ) develops, installs, and sells energy and solar cell solutions for residential and multi-unit buildings, industrial and commercial properties, and public sectors primarily in Sweden and China. It offers SolTech RooF, a roofing tile with integrated solar cells; SolTech ShingEl, a roof tile to generate solar energy; Soltech FaÃ§ade, a solar cell facade; and surface-mounted solar panels. SolTech Energy Sweden AB (publ) was incorporated in 2006 and is based in Stockholm, Sweden.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "8C11.F": {
        "short_name": "COMTEC SOLAR SYS HD -,004",
        "long_name": "Comtec Solar Systems Group Limited",
        "summary": "Comtec Solar Systems Group Limited, an investment holding company, researches, produces, and sells mono-crystalline solar wafers and ingots in the People's Republic of China and Malaysia. The company operates through Upstream, and Downstream Solar and Power Storage segments. It offers solar grade products, such as pseudo square bricks, wafers, and polysilicon products. The company also invests in, develops, constructs, and operates solar photovoltaic power stations; and researches and develops, designs, integrates, and sells lithium battery management and battery systems to electric vehicle and lithium battery manufacturers, and power storage companies. In addition, it trades in solar related parts, equipment, and products; and generates solar power. The company was founded in 1999 and is headquartered in Shanghai, the People's Republic of China. Comtec Solar Systems Group Limited is a subsidiary of Fonty Holdings Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "9TS.DE": {
        "short_name": "TUBESOLAR AG  INH O.N.",
        "long_name": "TubeSolar AG",
        "summary": "TubeSolar AG manufactures photovoltaic thin-film tubes primarily for use in the agricultural sector. The company is headquartered in Augsburg, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "city": "Augsburg"
    },
    "9TS.DU": {
        "short_name": "TUBESOLAR AG  INH O.N.",
        "long_name": "TubeSolar AG",
        "summary": "TubeSolar AG manufactures photovoltaic thin-film tubes primarily for use in the agricultural sector. The company is headquartered in Augsburg, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "DUS",
        "market": "dr_market",
        "country": "Germany",
        "city": "Augsburg"
    },
    "9TS.F": {
        "short_name": "TUBESOLAR AG  INH O.N.",
        "long_name": "TubeSolar AG",
        "summary": "TubeSolar AG manufactures photovoltaic thin-film tubes primarily for use in the agricultural sector. The company is headquartered in Augsburg, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "city": "Augsburg"
    },
    "A82.F": {
        "short_name": "AURORA SOLAR TECHS",
        "long_name": "Aurora Solar Technologies Inc.",
        "summary": "Aurora Solar Technologies Inc. develops, manufactures, and markets production measurement and control systems for the solar wafer, cell, and panel manufacturing industries in Canada. The company offers DM sensors, which are measurement tools for production speeds; Visualize that enable real-time visualization of critical cell fabrication processes; and Insight, which addresses the challenges facing cell manufacturers in characterizing and controlling production variation. It also provides a suite of services, including system configuration and performance planning, such as design and engineering of DM, Visualize, and Inisght configurations to fit production line and performance objectives; system engineering and operations training courses; and post-installation support and optimization services. The company was formerly known as ACT Aurora Control Technologies Corp. and changed its name to Aurora Solar Technologies Inc. in May 2015. The company is headquartered in North Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "North Vancouver"
    },
    "AACTF": {
        "short_name": "AURORA SOLAR TECHNOLOGIES INC",
        "long_name": "Aurora Solar Technologies Inc.",
        "summary": "Aurora Solar Technologies Inc. develops, manufactures, and markets production measurement and control systems for the solar wafer, cell, and panel manufacturing industries in Canada. The company offers DM sensors, which are measurement tools for production speeds; Visualize that enable real-time visualization of critical cell fabrication processes; and Insight, which addresses the challenges facing cell manufacturers in characterizing and controlling production variation. It also provides a suite of services, including system configuration and performance planning, such as design and engineering of DM, Visualize, and Inisght configurations to fit production line and performance objectives; system engineering and operations training courses; and post-installation support and optimization services. The company was formerly known as ACT Aurora Control Technologies Corp. and changed its name to Aurora Solar Technologies Inc. in May 2015. The company is headquartered in North Vancouver, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "North Vancouver"
    },
    "ABCE": {
        "short_name": "ABCO ENERGY INC",
        "long_name": "ABCO Energy, Inc.",
        "summary": "ABCO Energy, Inc., together with its subsidiaries, operates as an electrical product and services supplier in the United States. The company sells and installs solar photovoltaic electric systems that allow customers to produce power on their residence or business property. It also sells and installs energy efficient lighting products, solar powered street lights, and lighting accessories to residential and commercial customers. In addition, the company offers solar leasing and long term financing programs to its customers, and other marketing and installation organizations. ABCO Energy, Inc. was founded in 2004 and is based in Tucson, Arizona.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Tucson"
    },
    "ACU.V": {
        "short_name": "AURORA SOLAR TECHNOLOGIES INC",
        "long_name": "Aurora Solar Technologies Inc.",
        "summary": "Aurora Solar Technologies Inc. develops, manufactures, and markets production measurement and control systems for the solar wafer, cell, and panel manufacturing industries in Canada. The company offers DM sensors, which are measurement tools for production speeds; Visualize that enable real-time visualization of critical cell fabrication processes; and Insight, which addresses the challenges facing cell manufacturers in characterizing and controlling production variation. It also provides a suite of services, including system configuration and performance planning, such as design and engineering of DM, Visualize, and Inisght configurations to fit production line and performance objectives; system engineering and operations training courses; and post-installation support and optimization services. The company was formerly known as ACT Aurora Control Technologies Corp. and changed its name to Aurora Solar Technologies Inc. in May 2015. The company is headquartered in North Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "North Vancouver"
    },
    "AGSO": {
        "short_name": "AGRISOLAR SOLUTION",
        "long_name": "AgriSolar Solutions, Inc.",
        "summary": "Agrisolar Solution, Inc., through its subsidiaries, engages in the design, manufacture, distribution, and sale of solar products for agricultural use in the People's Republic of China and internationally. It offers solar energy saving products, solar insect killers, solar mouse killers, solar bird repellers, portable solar power supply systems, solar sprinkling and irrigation systems, and other solar products. It also offers plastic products. The company is based in Denver, Colorado.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Denver"
    },
    "AKR-R.BK": {
        "short_name": "EKARAT ENGINEERING PUBLIC COMPA",
        "long_name": "Ekarat Engineering Public Company Limited",
        "summary": "Ekarat Engineering Public Company Limited manufactures and distributes transformers and solar farms in Thailand. It also distributes solar cells and solar panel; and engages in the solar electric power business. The company was founded in 1981 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "AKR.BK": {
        "short_name": "EKARAT ENGINEERING PUBLIC COMPA",
        "long_name": "Ekarat Engineering Public Company Limited",
        "summary": "Ekarat Engineering Public Company Limited manufactures and distributes transformers and solar farms in Thailand. It also distributes solar cells and solar panel; and engages in the solar electric power business. The company was founded in 1981 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "APLP.TA": {
        "short_name": "APOLLO POWER LTD",
        "long_name": "Apollo Power Ltd",
        "summary": "Apollo Power Ltd develops solutions and products in the solar energy field in Israel. Its flagship product is the Apollo Film, a solar film to transform surface under the sun into an electricity source. The company provides its products for various markets and applications, including off-grid areas, automotive, and floating solar. Apollo Power Ltd is based in Yokneam Illit, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Yokneam Illit"
    },
    "APVNF": {
        "short_name": "ARISE TECHNOLOGIES CORP",
        "long_name": "ARISE Technologies Corporation",
        "summary": "ARISE Technologies Corporation, a solar technology company, develops and manufactures photovoltaic (PV) products. It operates in three divisions: PV Cell, PV Silicon, and PV Systems. The PV Cell division manufactures and supplies PV cells to PV module makers. The PV Silicon division produces silicon at 7N+ high-purity for PV applications. The PV Systems division provides solar PV energy systems for solar farms and building rooftop installation applications in North America. This division also offers solar systems design and engineering, solar energy efficiency analysis, and energy opportunity assessment services for solar energy projects to residential, industrial, commercial, and public sector clients in Ontario. The company was formerly known as CVCC Holdings Inc. and changed its name to ARISE Technologies Corporation in March 1997. ARISE Technologies Corporation was incorporated in 1993 and is based in Waterloo, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Waterloo"
    },
    "ARRY": {
        "short_name": "Array Technologies, Inc.",
        "long_name": "Array Technologies, Inc.",
        "summary": "Array Technologies, Inc. manufactures and supplies solar tracking systems and related products for customers in the United States and internationally. Its products include DuraTrack HZ v3, a single-axis solar tracking system; and SmarTrack, a machine learning software that is used to identify the optimal position for a solar array in real time to increase energy production. The company was founded in 1989 and is based in Albuquerque, New Mexico.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "city": "Albuquerque"
    },
    "ASTI": {
        "short_name": "ASCENT SOLAR TECHNOLOGIES INC",
        "long_name": "Ascent Solar Technologies, Inc.",
        "summary": "Ascent Solar Technologies, Inc. designs, manufactures, and sells photovoltaic (PV) integrated consumer electronics and portable power applications for commercial and military users. It offers outdoor solar chargers, including XD-12 and XD-48 for the individual soldier and platoon power needs; high-voltage SuperLight thin-film CIGS PV blankets; and solar modules. The company markets and sells its products through distributors, value added resellers, and e-commerce companies. Ascent Solar Technologies, Inc. was founded in 2005 and is based in Thornton, Colorado.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Thornton"
    },
    "BEEM": {
        "short_name": "Beam Global",
        "long_name": "Beam Global",
        "summary": "Beam Global, a cleantech company, designs, develops, engineers, manufactures, and sells renewably energized products for electric vehicle (EV) charging infrastructure, outdoor media and branding, and energy security products. The company's product portfolio include EV ARC (electric vehicle autonomous renewable charger), an infrastructure product that uses integrated solar power and battery storage to provide a source of power for factory installed electric vehicle charging stations; Solar Tree DCFC, an off-grid, renewably energized, and single-column mounted smart generation and energy storage system to provide a 50kW DC fast charge to one or more electric vehicles or larger vehicles; and EV ARC DCFC, a DC fast charging system for charging EVs. It is also developing EV-Standard, a lamp standard, EV charging, and emergency power product that uses an existing streetlamp's foundation and a combination of solar, wind, grid connection, and onboard energy storage to provide curbside charging; and UAV ARC, an off-grid and renewably energized product and network used to charge aerial drone (UAV) fleets. The company was formerly known as Envision Solar International, Inc. and changed its name to Beam Global in September 2020. Beam Global was founded in 2006 and is headquartered in San Diego, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "San Diego"
    },
    "CBDEF": {
        "short_name": "BLUENRGY GROUP LTD",
        "long_name": "BlueNRGY Group Limited",
        "summary": "BlueNRGY Group Limited operates in the renewable energy and energy-efficiency sectors worldwide. The company's Solar PV segment is involved in the provision of engineering design, supply, and installation services to retail, commercial, and utility-scale customers with professional engineering solutions to make use of solar power. Its Parmac segment provides a range of mechanical services and air-conditioning services in support of developers, builders, and commercial tenants at the mid-tier level. The company's Monitoring & Performance Analytics segment offers device-agnostic energy monitoring solutions for solar photovoltaic installation. Its Power Plant Operations includes remote area power systems. BlueNRGY Group Limited markets its residential and commercial solar installations under the Westinghouse brand name. The company was formerly known as CBD Energy Limited and changed its name to BlueNRGY Group Limited in March 2015. BlueNRGY Group Limited was founded in 1989 and is based in Sydney, Australia.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "CBLU.V": {
        "short_name": "CLEAR BLUE TECHNOLOGIES INTL IN",
        "long_name": "Clear Blue Technologies International Inc.",
        "summary": "Clear Blue Technologies International Inc. develops and sells off-grid power solutions to the power, control, monitor, manage, and service solar and hybrid power systems in Canada, the United States, the Middle East, Africa, and internationally. The company's products are used in street lights, security systems, telecommunications systems, emergency power, and Internet of Things (IoT) devices. It offers solar and wind controllers, telecom solar power systems, illumience cloud controls, Nano-grid power packs, and IoT devices; and solar and wind-powered outdoor lighting systems under the Illumient brand. The company also provides remote power management services. Clear Blue Technologies International Inc. is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "CBUTF": {
        "short_name": "CLEAR BLUE TECHNOLOGIES INTL IN",
        "long_name": "Clear Blue Technologies International Inc.",
        "summary": "Clear Blue Technologies International Inc. develops and sells off-grid power solutions to the power, control, monitor, manage, and service solar and hybrid power systems in Canada, the United States, the Middle East, Africa, and internationally. The company's products are used in street lights, security systems, telecommunications systems, emergency power, and Internet of Things (IoT) devices. It offers solar and wind controllers, telecom solar power systems, illumience cloud controls, Nano-grid power packs, and IoT devices; and solar and wind-powered outdoor lighting systems under the Illumient brand. The company also provides remote power management services. Clear Blue Technologies International Inc. is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "CHJI": {
        "short_name": "CHINA CHANG JIANG MINING & NEW ",
        "long_name": "China Changjiang Mining & New Energy Company, Ltd.",
        "summary": "China Changjiang Mining & New Energy Company, Ltd., a development stage company, engages in real estate leasing business in the People's Republic of China. It develops and operates engineering, procurement, and construction projects comprising the Weinan Hechuan 137KWp solar PV building applications. The company also holds land use rights in a land parcel; and leases a portion of the land use rights on the 5.7 square kilometer parcel for the development and operation of a theme park. China Changjiang Mining & New Energy Company, Ltd. is headquartered in Xi'an, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Xi'an"
    },
    "CKJ.F": {
        "short_name": "CLEARVUE TECH. LTD",
        "long_name": "ClearVue Technologies Limited",
        "summary": "ClearVue Technologies Limited provides building integrated photovoltaic (BIPV) solutions worldwide. It offers its products for homes, vehicles, mobiles, public spaces, commercial buildings, and agriculture applications. The company was formerly known as Tropiglas Technologies Limited and changed its name to ClearVue Technologies. ClearVue Technologies Limited was incorporated in 1995 and is based in West Perth, Australia.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "West Perth"
    },
    "CPV.AX": {
        "short_name": "CLEARVUE FPO",
        "long_name": "ClearVue Technologies Limited",
        "summary": "ClearVue Technologies Limited provides building integrated photovoltaic (BIPV) solutions worldwide. It offers its products for homes, vehicles, mobiles, public spaces, commercial buildings, and agriculture applications. The company was formerly known as Tropiglas Technologies Limited and changed its name to ClearVue Technologies. ClearVue Technologies Limited was incorporated in 1995 and is based in West Perth, Australia.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "West Perth"
    },
    "CSIQ": {
        "short_name": "Canadian Solar Inc.",
        "long_name": "Canadian Solar Inc.",
        "summary": "Canadian Solar Inc., together with its subsidiaries, designs, develops, manufactures, and sells solar ingots, wafers, cells, modules, and other solar power products. The company operates through two segments, Module and System Solutions (MSS), and Energy. The MSS segment engages in the design, development, manufacture, and sale of a range of solar power products, including standard solar modules, specialty solar products, and solar system kits that are a ready-to-install packages comprising inverters, racking systems, and other accessories. It also provides engineering, procurement, and construction; and operation and maintenance (O&M) services. This segment's energy solution products include solar inverters and energy storage systems for utility, commercial, residential, and specialty product applications. Its O&M services include inspections, repair, and replacement of plant equipment; and site management and administrative support services for solar power projects. The Energy segment engages in the development and sale of solar power projects; and operation of solar power plants and sale of electricity. As of January 31, 2020, this segment had a fleet of solar power plants in operation with an aggregate capacity of approximately 880.2 MWp. The company's primary customers include distributors, system integrators, project developers, and installers/EPC companies. Canadian Solar Inc. sells its products primarily under its Canadian Solar brand name; and on an OEM basis. It has operations in North America, South America, Europe, South Africa, the Middle East, Australia, Asia, and internationally. The company was founded in 2001 and is headquartered in Guelph, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Guelph"
    },
    "CV3.MU": {
        "short_name": "CARPEVIGO HLDG AG",
        "long_name": "Carpevigo Holding AG",
        "summary": "CARPEVIGO Holding AG operates as an energy supplier in Germany. It develops, implements, and operates various photovoltaic power plants. The company is based in Holzkirchen, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Germany",
        "city": "Holzkirchen"
    },
    "CVUEF": {
        "short_name": "CLEARVUE TECHNOLOGIES LTD",
        "long_name": "ClearVue Technologies Limited",
        "summary": "ClearVue Technologies Limited provides building integrated photovoltaic (BIPV) solutions worldwide. It offers its products for homes, vehicles, mobiles, public spaces, commercial buildings, and agriculture applications. The company was formerly known as Tropiglas Technologies Limited and changed its name to ClearVue Technologies. ClearVue Technologies Limited was incorporated in 1995 and is based in West Perth, Australia.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "West Perth"
    },
    "E0P.F": {
        "short_name": "ENPHASE ENERGY INC.DL-,01",
        "long_name": "Enphase Energy, Inc.",
        "summary": "Enphase Energy, Inc., together with its subsidiaries, designs, develops, manufactures, and sells home energy solutions for the solar photovoltaic industry in the United States and internationally. The company offers semiconductor-based microinverter, which converts energy at the individual solar module level, and combines with its proprietary networking and software technologies to provide energy monitoring and control services. It also offers AC battery storage systems; Envoy communications gateway; and Enlighten cloud-based monitoring service, as well as other accessories. The company sells its solutions to solar distributors; and directly to large installers, original equipment manufacturers, strategic partners, and homeowners, as well as directly the do-it-yourself market through its legacy product upgrade program or online store. Enphase Energy, Inc. was incorporated in 2006 and is headquartered in Fremont, California.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Fremont"
    },
    "EBODF": {
        "short_name": "NEW ENERGY EXCHANGE LTD",
        "long_name": "New Energy Exchange Ltd.",
        "summary": "Renewable Energy Trade Board Corporation, together with its subsidiaries, provides solar energy products and solutions in the People's Republic of China, Hong Kong, and Europe. The company's products include solar modules for electricity generation; and related application products, such as solar power stations, solar home systems, solar lighting, and solar chargers. It also designs and installs on-grid and off-grid solar systems used in lighting for outdoor public facilities and in commercial buildings. In addition, the company is involved in the solar power plant development, as well as construction and installation of rooftop solar systems. It sells its products to residential, commercial, industrial utilities, and power plant developers. The company was formerly known as China Technology Development Group Corporation and changed its name to Renewable Energy Trade Board Corporation on October 24, 2012. Renewable Energy Trade Board Corporation Group Corporation was founded in 1995 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "EFORU.PR": {
        "short_name": "E4U",
        "long_name": "E4U a.s.",
        "summary": "E4U a.s. invests in and operates plants that generate energy from renewable sources in the Czech Republic. It operates two solar parks, Dubnany and Ratiskovice power stations with a total installed capacity of 4.4 MWp in the area of southern Moravia. The company was founded in 2006 and is based in Dubnany, the Czech Republic. E4U a.s. is a subsidiary of E4U Finance s.r.o.",
        "currency": "CZK",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PRA",
        "market": "cz_market",
        "country": "Czech Republic",
        "city": "Dubnany"
    },
    "ENKS": {
        "short_name": "ENERKON SOLAR INTERNATIONAL INC",
        "long_name": "Enerkon Solar International, Inc.",
        "summary": "Enerkon Solar International, Inc. operates utility scale PV power plants and renewable systems with focus on the Americas, Asia, the Middle East, and Africa. The company, through its subsidiaries, also operates as an engineering, planning, and construction contractor. The company was formerly known as Castle Holding Corp. and changed its name to Enerkon Solar International, Inc. in November 2017. Enerkon Solar International, Inc. was incorporated in 1986 and is based in Delray Beach, Florida.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Delray Beach"
    },
    "ENPH.MX": {
        "short_name": "ENPHASE ENERGY INC",
        "long_name": "Enphase Energy, Inc.",
        "summary": "Enphase Energy, Inc., together with its subsidiaries, designs, develops, manufactures, and sells home energy solutions for the solar photovoltaic industry in the United States and internationally. The company offers semiconductor-based microinverter, which converts energy at the individual solar module level, and combines with its proprietary networking and software technologies to provide energy monitoring and control services. It also offers AC battery storage systems; Envoy communications gateway; and Enlighten cloud-based monitoring service, as well as other accessories. The company sells its solutions to solar distributors; and directly to large installers, original equipment manufacturers, strategic partners, and homeowners, as well as directly the do-it-yourself market through its legacy product upgrade program or online store. Enphase Energy, Inc. was incorporated in 2006 and is headquartered in Fremont, California.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Fremont"
    },
    "ENPH": {
        "short_name": "Enphase Energy, Inc.",
        "long_name": "Enphase Energy, Inc.",
        "summary": "Enphase Energy, Inc., together with its subsidiaries, designs, develops, manufactures, and sells home energy solutions for the solar photovoltaic industry in the United States and internationally. The company offers semiconductor-based microinverter, which converts energy at the individual solar module level, and combines with its proprietary networking and software technologies to provide energy monitoring and control services. It also offers AC battery storage systems; Envoy communications gateway; and Enlighten cloud-based monitoring service, as well as other accessories. The company sells its solutions to solar distributors; and directly to large installers, original equipment manufacturers, strategic partners, and homeowners, as well as directly the do-it-yourself market through its legacy product upgrade program or online store. Enphase Energy, Inc. was incorporated in 2006 and is headquartered in Fremont, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Fremont"
    },
    "ENT.MI": {
        "short_name": "ENERTRONICA SANTERNO",
        "long_name": "Enertronica Santerno S.p.A.",
        "summary": "Enertronica Santerno S.p.A. operates in the field of renewable energy in Italy and internationally. It provides engineering, procurement, and construction services for building photovoltaic power plants for electricity production. The company also engages in the design and realization of anchoring systems of photovoltaic modules comprising mounting systems for pitched and flat roofs, facades, cantilevered roofs, and greenhouses; and mono-axial and biaxial solar tracking systems. In addition, it offers services to enhance the energy efficiency of plants/systems, installations, and/or places; and operates as a reseller and distributor of electricity. Enertronica Santerno S.p.A. is headquartered in Frosinone, Italy.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Frosinone"
    },
    "EUROMULTI.NS": {
        "short_name": "EURO MULTIVISION L",
        "long_name": "Euro Multivision Limited",
        "summary": "Euro Multivision Limited manufactures and sells optical discs and solar photovoltaic cells in India. The company offers compact disc and digital versatile disc recordable products for various applications, including data storage, recording, and reproduction of audio and video media for entertainment, education, software installation, etc. It also provides mono and multi crystalline solar cells, solar power plants, solar glasses, solar aluminum frames, street and garden lights, rooftops, telecom systems, water pumps, solar lanterns, solar water pumps, home lighting systems, street lighting systems, and others, as well as solar products for architects. The company was incorporated in 2004 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "F3A.DE": {
        "short_name": "FIRST SOLAR INC. D -,001",
        "long_name": "First Solar, Inc.",
        "summary": "First Solar, Inc. provides photovoltaic (PV) solar energy solutions in the United State, Japan, France, Canada, India, Australia, and internationally. It operates in two segments, Modules and Systems. The Modules segment designs, manufactures, and sells cadmium telluride solar modules that convert sunlight into electricity to integrators and operators of PV solar power systems. The Systems segment provides power plant solutions, such as project development; engineering, procurement, and construction; and operating and maintenance services to utilities, independent power producers, commercial and industrial companies, and other system owners. The company was formerly known as First Solar Holdings, Inc. and changed its name to First Solar, Inc. in 2006. First Solar, Inc. was founded in 1999 and is headquartered in Tempe, Arizona.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Tempe"
    },
    "F3A.F": {
        "short_name": "FIRST SOLAR INC. D -,001",
        "long_name": "First Solar, Inc.",
        "summary": "First Solar, Inc. provides photovoltaic (PV) solar energy solutions in the United State, Japan, France, Canada, India, Australia, and internationally. It operates in two segments, Modules and Systems. The Modules segment designs, manufactures, and sells cadmium telluride solar modules that convert sunlight into electricity to integrators and operators of PV solar power systems. The Systems segment provides power plant solutions, such as project development; engineering, procurement, and construction; and operating and maintenance services to utilities, independent power producers, commercial and industrial companies, and other system owners. The company was formerly known as First Solar Holdings, Inc. and changed its name to First Solar, Inc. in 2006. First Solar, Inc. was founded in 1999 and is headquartered in Tempe, Arizona.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Tempe"
    },
    "FERN": {
        "short_name": "FERNHILL CORP",
        "long_name": "Fernhill Corporation",
        "summary": "Fernhill Corporation operates as a media, technology, and entertainment company. It focuses on building and incubating mobile and Web applications from a range of genres, including Live advice, cannabis, real estate, crypto-currency, sports, and entertainment that primarily use its customizable matching platform. The company is based in Carson City, Nevada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Carson City"
    },
    "FSLR.BA": {
        "short_name": "FIRST SOLAR INC",
        "long_name": "First Solar, Inc.",
        "summary": "First Solar, Inc. provides photovoltaic (PV) solar energy solutions in the United State, Japan, France, Canada, India, Australia, and internationally. It operates in two segments, Modules and Systems. The Modules segment designs, manufactures, and sells cadmium telluride solar modules that convert sunlight into electricity to integrators and operators of PV solar power systems. The Systems segment provides power plant solutions, such as project development; engineering, procurement, and construction; and operating and maintenance services to utilities, independent power producers, commercial and industrial companies, and other system owners. The company was formerly known as First Solar Holdings, Inc. and changed its name to First Solar, Inc. in 2006. First Solar, Inc. was founded in 1999 and is headquartered in Tempe, Arizona.",
        "currency": "ARS",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "city": "Tempe"
    },
    "FSLR.MX": {
        "short_name": "FIRST SOLAR INC",
        "long_name": "First Solar, Inc.",
        "summary": "First Solar, Inc. provides photovoltaic (PV) solar energy solutions in the United State, Japan, France, Canada, India, Australia, and internationally. It operates in two segments, Modules and Systems. The Modules segment designs, manufactures, and sells cadmium telluride solar modules that convert sunlight into electricity to integrators and operators of PV solar power systems. The Systems segment provides power plant solutions, such as project development; engineering, procurement, and construction; and operating and maintenance services to utilities, independent power producers, commercial and industrial companies, and other system owners. The company was formerly known as First Solar Holdings, Inc. and changed its name to First Solar, Inc. in 2006. First Solar, Inc. was founded in 1999 and is headquartered in Tempe, Arizona.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Tempe"
    },
    "FSLR": {
        "short_name": "First Solar, Inc.",
        "long_name": "First Solar, Inc.",
        "summary": "First Solar, Inc. provides photovoltaic (PV) solar energy solutions in the United State, Japan, France, Canada, India, Australia, and internationally. It operates in two segments, Modules and Systems. The Modules segment designs, manufactures, and sells cadmium telluride solar modules that convert sunlight into electricity to integrators and operators of PV solar power systems. The Systems segment provides power plant solutions, such as project development; engineering, procurement, and construction; and operating and maintenance services to utilities, independent power producers, commercial and industrial companies, and other system owners. The company was formerly known as First Solar Holdings, Inc. and changed its name to First Solar, Inc. in 2006. First Solar, Inc. was founded in 1999 and is headquartered in Tempe, Arizona.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Tempe"
    },
    "FSLR.VI": {
        "short_name": "FIRST SOLAR INC",
        "long_name": "First Solar, Inc.",
        "summary": "First Solar, Inc. provides photovoltaic (PV) solar energy solutions in the United State, Japan, France, Canada, India, Australia, and internationally. It operates in two segments, Modules and Systems. The Modules segment designs, manufactures, and sells cadmium telluride solar modules that convert sunlight into electricity to integrators and operators of PV solar power systems. The Systems segment provides power plant solutions, such as project development; engineering, procurement, and construction; and operating and maintenance services to utilities, independent power producers, commercial and industrial companies, and other system owners. The company was formerly known as First Solar Holdings, Inc. and changed its name to First Solar, Inc. in 2006. First Solar, Inc. was founded in 1999 and is headquartered in Tempe, Arizona.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "Tempe"
    },
    "FSLR34.SA": {
        "short_name": "FIRST SOLAR DRN",
        "long_name": "First Solar, Inc.",
        "summary": "First Solar, Inc. provides photovoltaic (PV) solar energy solutions in the United State, Japan, France, Canada, India, Australia, and internationally. It operates in two segments, Modules and Systems. The Modules segment designs, manufactures, and sells cadmium telluride solar modules that convert sunlight into electricity to integrators and operators of PV solar power systems. The Systems segment provides power plant solutions, such as project development; engineering, procurement, and construction; and operating and maintenance services to utilities, independent power producers, commercial and industrial companies, and other system owners. The company was formerly known as First Solar Holdings, Inc. and changed its name to First Solar, Inc. in 2006. First Solar, Inc. was founded in 1999 and is headquartered in Tempe, Arizona.",
        "currency": "BRL",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Tempe"
    },
    "FTCI": {
        "short_name": "FTC Solar, Inc.",
        "long_name": "FTC Solar, Inc.",
        "summary": "FTC Solar, Inc. provides solar tracker systems, and software and engineering services in the United States and internationally. The company markets its two-panel in-portrait single-axis tracker systems under the Voyager brand name. Its software solutions include SunPath, a solution to enhance energy production; SunDAT, an online 3D solar PV design solution; and Atlas, a solar portfolio management solution. The company serves customers through a sales and support network. Its customers include solar asset owners and project developers; and engineering, procurement, and construction contractors that design and build solar energy projects. The company was incorporated in 2017 and is headquartered in Austin, Texas.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Austin"
    },
    "GCPEF": {
        "short_name": "GCL-POLY ENERGY HOLDINGS LIMITE",
        "long_name": "GCL-Poly Energy Holdings Limited",
        "summary": "GCL-Poly Energy Holdings Limited operates as a solar photovoltaic company in the People's Republic of China and internationally. It operates through three segments: Solar Material Business, Solar Farm Business, and New Energy Business. The Solar Material Business segment primarily manufactures and sells polysilicon and wafer products to companies operating in the solar industry. The Solar Farm Business segment operates and manages 371 megawatts (MW) of solar farms, of which 18 MW solar farms located in the United States and 353 MW solar farms located in the People's Republic of China. The New Energy Business segment develops, constructs, operates, and manages solar farms. GCL-Poly Energy Holdings Limited was incorporated in 2006 and is based in Kowloon, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "GJF.F": {
        "short_name": "CENTRAL DEVELOP.HLDGS",
        "long_name": "Central Development Holdings Limited",
        "summary": "Central Development Holdings Limited, an investment holding company, engages in the design, manufacture, and wholesale of fine jewelry products primarily in the People's Republic of China. It also manufactures and sells solar cooling intelligent technology products using thermal cooling-stored pipes; sells solar photovoltaic modules and components; and provides energy efficiency analysis and technology enhancement advisory services on solar energy projects. The company offers its jewelry products to jewelry distributors and retailers. The company was formerly known as Zhong Fa Zhan Holdings Limited and changed its name to Central Development Holdings Limited in October 2019. The company is headquartered in Wan Chai, Hong Kong. Central Development Holdings Limited is a subsidiary of Resources Rich Capital Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "GRYG": {
        "short_name": "GREEN ENERGY GRP INC",
        "long_name": "Green Energy Group, Inc.",
        "summary": "Green Energy Group, Inc. does not have significant operations. It intends to acquire business ventures. The company was formerly known as eCom eCom.com, Inc. and changed its name to Green Energy Group, Inc. in February 2011. Green Energy Group, Inc. was incorporated in 1994 and is based in Jupiter, Florida.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Jupiter"
    },
    "GSLO": {
        "short_name": "GO SOLAR USA INC",
        "long_name": "Go Solar USA, Inc.",
        "summary": "Go Solar USA, Inc. designs, sells, and installs renewable energy systems for homes, businesses, and building projects. It also provides a range of wind power systems. In addition, the company offers consultation and maintenance services. It serves residential and commercial customers; government agencies; and non-profit organizations. The company was formerly known as In a Breeze Technologies, Inc. and changed its name to Go Solar USA, Inc. in November 2009. Go Solar USA, Inc. was founded in 2007 and is based in Fremont, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Fremont"
    },
    "HRPK.DE": {
        "short_name": "7C SOLARPARKEN AG  O.N.",
        "long_name": "7C Solarparken AG",
        "summary": "7C Solarparken AG owns and operates PV farms primarily in Germany and Belgium. The company has a combined asset portfolio of 339 MWp. The company was formerly known as Colexon Energy, AG and changed its name to 7C Solarparken AG in January 2015. 7C Solarparken AG is headquartered in Bayreuth, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "city": "Bayreuth"
    },
    "HRPK.F": {
        "short_name": "7C SOLARPARKEN AG  O.N.",
        "long_name": "7C Solarparken AG",
        "summary": "7C Solarparken AG owns and operates PV farms primarily in Germany and Belgium. The company has a combined asset portfolio of 339 MWp. The company was formerly known as Colexon Energy, AG and changed its name to 7C Solarparken AG in January 2015. 7C Solarparken AG is headquartered in Bayreuth, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "city": "Bayreuth"
    },
    "HYSR": {
        "short_name": "SUNHYDROGEN INC",
        "long_name": "SunHydrogen, Inc.",
        "summary": "SunHydrogen, Inc. develops solar-powered nanoparticle systems that mimic photosynthesis to separate hydrogen from water. The company was formerly known as HyperSolar, Inc. and changed its name to SunHydrogen, Inc. in June 2020. SunHydrogen, Inc. was founded in 2009 and is based in Santa Barbara, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Santa Barbara"
    },
    "INDOSOLAR.NS": {
        "short_name": "INDOSOLAR LTD",
        "long_name": "Indosolar Limited",
        "summary": "Indosolar Limited is under corporate insolvency resolution process. Previously, it was engaged in the manufacture and sale of solar photovoltaic cells. The company was incorporated in 2005 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "ISUN": {
        "short_name": "iSun, Inc.",
        "long_name": "iSun, Inc.",
        "summary": "iSun, Inc. operates as a solar engineering, construction, and procurement contractor for commercial and industrial customers in the Northeastern United States. It also provides electrical contracting services; and data and communication services. The company was formerly known as The Peck Company Holdings, Inc. and changed its name to iSun, Inc. in January 2021. iSun, Inc. was founded in 1972 and is headquartered in South Burlington, Vermont.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Williston"
    },
    "JKS": {
        "short_name": "JinkoSolar Holding Company Limi",
        "long_name": "JinkoSolar Holding Co., Ltd.",
        "summary": "JinkoSolar Holding Co., Ltd., together with its subsidiaries, engages in the design, development, production, and marketing of photovoltaic products. The company offers solar modules, silicon wafers, solar cells, recovered silicon materials, and silicon ingots. It also provides solar system integration services; and develops commercial solar power projects. The company sells its products to distributors, project developers, and system integrators; and utility, commercial, and residential customers under the JinkoSolar brand, as well as on an original equipment manufacturer basis. As of December 31, 2020, it had an integrated annual capacity of 22 gigawatt (GW) for mono wafers; 11 GW for solar cells; and 31 GW for solar modules. The company has operations in the People's Republic of China, the United States, Japan, Germany, the United Kingdom, Chile, South Africa, India, Mexico, Brazil, the United Arab Emirates, Italy, Spain, France, Belgium, and internationally. JinkoSolar Holding Co., Ltd. was founded in 2006 and is based in Shangrao, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Shangrao"
    },
    "JKS.VI": {
        "short_name": "JINKOSOLAR HOLDING CO ADR",
        "long_name": "JinkoSolar Holding Co., Ltd.",
        "summary": "JinkoSolar Holding Co., Ltd., together with its subsidiaries, engages in the design, development, production, and marketing of photovoltaic products. The company offers solar modules, silicon wafers, solar cells, recovered silicon materials, and silicon ingots. It also provides solar system integration services; and develops commercial solar power projects. The company sells its products to distributors, project developers, and system integrators; and utility, commercial, and residential customers under the JinkoSolar brand, as well as on an original equipment manufacturer basis. As of December 31, 2020, it had an integrated annual capacity of 22 gigawatt (GW) for mono wafers; 11 GW for solar cells; and 31 GW for solar modules. The company has operations in the People's Republic of China, the United States, Japan, Germany, the United Kingdom, Chile, South Africa, India, Mexico, Brazil, the United Arab Emirates, Italy, Spain, France, Belgium, and internationally. JinkoSolar Holding Co., Ltd. was founded in 2006 and is based in Shangrao, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "VIE",
        "market": "at_market",
        "country": "China",
        "city": "Shangrao"
    },
    "JSKY.JK": {
        "short_name": "Sky Energy Indonesia Tbk.",
        "long_name": "PT Sky Energy Indonesia Tbk",
        "summary": "PT Sky Energy Indonesia Tbk manufactures and sells solar modules for homes, and commercial and government sectors worldwide. The company offers polycrystalline, monocrystalline, and flexible solar panels, as well as portable solar kits and accessories; light-emitting diode bulbs, lamps, and lights; solar mounting systems; solar inverters and monitoring solutions; and energy storage solutions. It is also involved in the technical design, installation, and maintenance of solar power plants. The company was founded in 2008 and is based in Bogor, Indonesia.",
        "currency": "IDR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bogor"
    },
    "KG0A.DU": {
        "short_name": "CHINA SHUIFA SING.E.DL-01",
        "long_name": "China Shuifa Singyes Energy Holdings Limited",
        "summary": "China Shuifa Singyes Energy Holdings Limited, an investment holding company, designs, fabricates, and installs conventional curtain walls and solar projects in Mainland China, Oceania, Macau, Malaysia, Hong Kong, and internationally. Its solar projects include building integrated photovoltaic systems, roof top solar systems, and ground mounted solar systems. The company also manufactures and sells renewable energy goods, including smart grid systems; solar thermal systems and products, such as air-source heat pumps, flat-pane solar thermal collectors, photovoltaic and photothermal composite modules, and absorbing coating products; smart LCD dimming films; smart LCD dimming glass products; and indium-tin oxide films. In addition, it engages in the development of new energy materials and marine biology technology; research and development of energy- saving products; research and development of electricity and new energy; provision of engineering design services; and research, construction, and operation of solar power station. The company was formerly known as China Singyes Solar Technologies Holdings Limited and changed its name to China Shuifa Singyes Energy Holdings Limited in April 2020. China Shuifa Singyes Energy Holdings Limited was founded in 1995 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "DUS",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "KG0A.F": {
        "short_name": "CHINA SHUIFA SING.E.DL-01",
        "long_name": "China Shuifa Singyes Energy Holdings Limited",
        "summary": "China Shuifa Singyes Energy Holdings Limited, an investment holding company, designs, fabricates, and installs conventional curtain walls and solar projects in Mainland China, Oceania, Macau, Malaysia, Hong Kong, and internationally. Its solar projects include building integrated photovoltaic systems, roof top solar systems, and ground mounted solar systems. The company also manufactures and sells renewable energy goods, including smart grid systems; solar thermal systems and products, such as air-source heat pumps, flat-pane solar thermal collectors, photovoltaic and photothermal composite modules, and absorbing coating products; smart LCD dimming films; smart LCD dimming glass products; and indium-tin oxide films. In addition, it engages in the development of new energy materials and marine biology technology; research and development of energy- saving products; research and development of electricity and new energy; provision of engineering design services; and research, construction, and operation of solar power station. The company was formerly known as China Singyes Solar Technologies Holdings Limited and changed its name to China Shuifa Singyes Energy Holdings Limited in April 2020. China Shuifa Singyes Energy Holdings Limited was founded in 1995 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "KOVR": {
        "short_name": "KORVER CORP",
        "long_name": "Korver Corp.",
        "summary": "Korver Corp. engages in the design and manufacture of integrated machine controls that are sold to manufacturers of plastic parts for the automotive, household products, and electronics industries worldwide. It manufactures microprocessor-based electronic control systems for injection molding machines. The company also supplies retrofit systems, which include hardware, software programming, and installation services. Its systems control the total machines, including sequencing, timing, barrel temperature control, speed and pressure control, linear positioning system diagnostics, data collection and monitoring, and statistical process control. Korver Corp. was founded in 1968 and is based in Golden Valley, Minnesota.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Golden Valley"
    },
    "L5A.F": {
        "short_name": "CANADIAN SOLAR INC.",
        "long_name": "Canadian Solar Inc.",
        "summary": "Canadian Solar Inc., together with its subsidiaries, designs, develops, manufactures, and sells solar ingots, wafers, cells, modules, and other solar power products. The company operates through two segments, Module and System Solutions (MSS), and Energy. The MSS segment engages in the design, development, manufacture, and sale of a range of solar power products, including standard solar modules, specialty solar products, and solar system kits that are a ready-to-install packages comprising inverters, racking systems, and other accessories. It also provides engineering, procurement, and construction; and operation and maintenance (O&M) services. This segment's energy solution products include solar inverters and energy storage systems for utility, commercial, residential, and specialty product applications. Its O&M services include inspections, repair, and replacement of plant equipment; and site management and administrative support services for solar power projects. The Energy segment engages in the development and sale of solar power projects; and operation of solar power plants and sale of electricity. As of January 31, 2020, this segment had a fleet of solar power plants in operation with an aggregate capacity of approximately 880.2 MWp. The company's primary customers include distributors, system integrators, project developers, and installers/EPC companies. Canadian Solar Inc. sells its products primarily under its Canadian Solar brand name; and on an OEM basis. It has operations in North America, South America, Europe, South Africa, the Middle East, Australia, Asia, and internationally. The company was founded in 2001 and is headquartered in Guelph, Canada.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Guelph"
    },
    "MADI": {
        "short_name": "MADISON SYSTEMS INC",
        "long_name": "Madison Systems, Inc.",
        "summary": "Madison Systems Inc. provides network security switching devices. It offers its products for prevention of unauthorized access to corporate and government internal computer networks from external sources. The company is based in Aurora, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Aurora"
    },
    "MAXN": {
        "short_name": "Maxeon Solar Technologies, Ltd.",
        "long_name": "Maxeon Solar Technologies, Ltd.",
        "summary": "Maxeon Solar Technologies, Ltd. designs, manufactures, markets, and sells solar panels and related solar system components worldwide. The company provides interdigitated back contact and shingled solar cells and panels under the SunPower brand. It offers its products to dealers, project developers, system integrators, distributors, resellers, and residential and small-scale commercial customers. The company is headquartered in Singapore.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "MIDS.ST": {
        "short_name": "Midsummer AB",
        "long_name": "Midsummer AB (publ)",
        "summary": "Midsummer AB (publ) develops and supplies equipment for manufacturing CIGS thin film solar cells in Sweden. It offers Duo, a fully automatic deposition system for CIGS solar cell manufacturing; UNO, a platform for CIGS and CZTS solar cells; and flexible and lightweight modules for PV applications in membrane roofs, portable power plants, marine installations, vehicle usage, landfill covers, or other infrastructure projects. The company is headquartered in JÃ¤rfÃ¤lla, Sweden.",
        "currency": "SEK",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "JÃ¤rfÃ¤lla"
    },
    "MPR.AX": {
        "short_name": "MPOWER FPO",
        "long_name": "MPower Group Limited",
        "summary": "MPower Group Limited designs and delivers renewable energy, battery storage, and microgrid solutions in Australia, New Zealand, and internationally. It operates through Power Investments and Property Investments segments. The company engages in the design, construction, installation, and commissioning of power system projects; and monitoring, and service and maintenance of power system assets. In addition, it finances power system projects, as well as owns a property in Melbourne. The company was formerly known as Tag Pacific Limited and changed its name to MPower Group Limited in January 2019. MPower Group Limited was incorporated in 1963 and is headquartered in Mascot, Australia. MPower Group Limited is a subsidiary of Tag Private Pty Limited.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Mascot"
    },
    "NEWH": {
        "short_name": "NEWHYDROGEN INC",
        "long_name": "NewHydrogen, Inc.",
        "summary": "BioSolar, Inc. engages in developing clean energy technologies and materials for storing electrical energy produced by photovoltaic solar modules. It offers BioBacksheet, a green back sheet for photovoltaic solar modules. The company focuses on developing silicon alloy-based anode materials for lithium-ion batteries. It develops an electrolyzer technology to lower the cost of green hydrogen. It plans to engage with lithium-ion battery manufacturers and identify licensing partners in the electric vehicles, consumer electronics, and grid electrical storage industries to market its products. The company was formerly known as BioSolar Labs, Inc. and changed its name to BioSolar, Inc. in June 2006. BioSolar, Inc. was incorporated in 2006 and is headquartered in Santa Clarita, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Santa Clarita"
    },
    "NOFR.TA": {
        "short_name": "O.Y. NOFAR ENERGY",
        "long_name": "O.Y. Nofar Energy Ltd",
        "summary": "O.Y. Nofar Energy Ltd operates in the solar field on rooftops in Israel. It engages in the initiation, licensing, financing, construction, management, and operation of solar projects. The company is based in Ashdod, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Ashdod"
    },
    "NOVA": {
        "short_name": "Sunnova Energy International In",
        "long_name": "Sunnova Energy International Inc.",
        "summary": "Sunnova Energy International Inc., together with its subsidiaries, provides residential solar and energy storage services in the United States. The company offers operations and maintenance, monitoring, repairs and replacements, equipment upgrades, on-site power optimization, and diagnostics services. It operates a fleet of residential solar energy systems with a generation capacity of approximately 790 megawatts serving approximately 107,000 customers. Sunnova Energy International Inc. was founded in 2012 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "NTCXF": {
        "short_name": "NATCORE TECHNOLOGY INC",
        "long_name": "Natcore Technology Inc.",
        "summary": "Natcore Technology Inc., a research and development company, develops and owns technology for the manufacturing of solar cells. The company offers laser-processed back-contact cells and liquid phase deposition technology, which enables the controlled deposition of silicon dioxide and mixed silicon oxides from an aqueous solution at ambient temperatures and pressures. It focuses on using its nanotechnology discoveries to enable various applications consisting of laser processing, tandem quantum-dot solar cells, and Natcore Foil Cell structure. The company also provides technical consultancy services for the design and construction of solar cell/solar panel fabrication facilities, and solar power plants. Natcore Technology Inc. was founded in 2007 and is headquartered in Delray Beach, Florida.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Delray Beach"
    },
    "OPVS": {
        "short_name": "NANOFLEX POWER CORPORATION",
        "long_name": "NanoFlex Power Corporation",
        "summary": "NanoFlex Power Corporation researches, develops, commercializes, and licenses photovoltaic technologies that enable thin film solar products. The company has worldwide license and right to sublicense intellectual property resulting from its sponsored research programs, which have resulted in a portfolio of issued and pending U.S. patents and their foreign counterparts. Its patented and patent-pending technologies include Gallium Arsenide based solar thin films; and organic photovoltaic materials, architectures, and fabrication processes for ultra-thin solar films offering aesthetics, such as semi-transparency and tinting, and highly flexible form factors. The company's technologies are targeted at various applications comprising portable and off-grid power generation, building applied photovoltaics, building integrated photovoltaics, space vehicles and unmanned aerial vehicles, semi-transparent solar power generating glazing or windows, ultra-thin solar films for automobiles or other consumer, and Internet of Things application, including sensors. NanoFlex Power Corporation was founded in 1994 and is based in Scottsdale, Arizona.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Scottsdale"
    },
    "P7V.MU": {
        "short_name": "PHOTON ENERGY NV  EO-,01",
        "long_name": "Photon Energy N.V.",
        "summary": "Photon Energy N.V., through its subsidiaries, provides solar power solutions and services worldwide. The company operates through Energy Solutions; Production of Electricity; FVE Investment; Operations, Maintenance, and PVPP Supervision; and Other segments. It had a portfolio of 69 power plants with an installed capacity of 57.1 MWp. The company is also involved in the design, development, finance, installation, operation, and maintenance of photovoltaic equipment focusing on green-field and rooftop installations. In addition, it offers project development; investment management; project finance; insurance; engineering, procurement, and construction; supervision services; and operations and maintenance services, as well as technology solutions for photovoltaic power plants. Further, the company engages in the import and wholesale of FVE components. Its power solutions provide solar and solar-hybrid power to a range of customers and applications. The company was founded in 2008 and is headquartered in Amsterdam, the Netherlands.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Netherlands",
        "city": "Amsterdam"
    },
    "PEN.PR": {
        "short_name": "PHOTON ENERGY",
        "long_name": "Photon Energy N.V.",
        "summary": "Photon Energy N.V., through its subsidiaries, provides solar power solutions and services worldwide. The company operates through Energy Solutions; Production of Electricity; FVE Investment; Operations, Maintenance, and PVPP Supervision; and Other segments. It had a portfolio of 69 power plants with an installed capacity of 57.1 MWp. The company is also involved in the design, development, finance, installation, operation, and maintenance of photovoltaic equipment focusing on green-field and rooftop installations. In addition, it offers project development; investment management; project finance; insurance; engineering, procurement, and construction; supervision services; and operations and maintenance services, as well as technology solutions for photovoltaic power plants. Further, the company engages in the import and wholesale of FVE components. Its power solutions provide solar and solar-hybrid power to a range of customers and applications. The company was founded in 2008 and is headquartered in Amsterdam, the Netherlands.",
        "currency": "CZK",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PRA",
        "market": "cz_market",
        "country": "Netherlands",
        "city": "Amsterdam"
    },
    "PPRW": {
        "short_name": "PREMIER POWER RENEWABLE ENERGY",
        "long_name": "Premier Power Renewable Energy, Inc.",
        "summary": "Premier Power Renewable Energy, Inc., through its wholly owned subsidiaries, engages in the design, development, and integration of ground mount and rooftop solar energy systems for commercial, industrial, residential, agricultural, and equity fund customers in North America, Europe, and Asia. It also provides a range of installation services to its solar energy customers, including design, engineering, procurement, permitting, construction, grid connection, warranty, system monitoring, and maintenance services. In addition, the company distributes solar energy system components comprising racking, wiring, inverters, solar modules, and other related components to smaller solar developers and integrators. Premier Power Renewable Energy, Inc. was founded in 2001 and is headquartered in El Dorado Hills, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "El Dorado Hills"
    },
    "PRPS": {
        "short_name": "PROPELLUS INC",
        "long_name": "Propellus Inc.",
        "summary": "Propellus Inc., through its subsidiary, Sunvalley Solar Tech, Inc., operates as a solar power technology and system integration company in California. It offers turnkey solar system solutions, which include designing, building, operating, monitoring, and maintaining solar power systems for owners, builders, and architecture firms. The company focuses on solar systems and LED design and installation, solar technology and LED research and development, and solar equipment and LED manufacturing and distribution areas. It serves small private residences and large commercial solar power users. The company was formerly known as Sunvalley Solar, Inc. and changed its name to Propellus Inc. in December 2020. Propellus Inc. was founded in 2007 and is headquartered in Walnut, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Walnut"
    },
    "PS4.HM": {
        "short_name": "PHOENIX SOLAR AG  O.N.",
        "long_name": "Phoenix Solar Aktiengesellschaft",
        "summary": "Phoenix Solar Aktiengesellschaft operates as a photovoltaic system integrator worldwide. It plans, develops, builds, and operates utility-scale, commercial, and industrial photovoltaic plants. The company is also involved in the wholesale of turnkey solar power plants and systems, modules, mounting systems, and accessories, as well as other support services. The company was formerly known as PhÃ¶nix SonnenStrom AG and changed its name to Phoenix Solar Aktiengesellschaft in June 2007. Phoenix Solar Aktiengesellschaft was founded in 1994 and is headquartered in Sulzemoos, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HAM",
        "market": "dr_market",
        "country": "Germany",
        "city": "Sulzemoos"
    },
    "PSWW": {
        "short_name": "PRINCIPAL SOLAR INC",
        "long_name": "Principal Solar, Inc.",
        "summary": "Principal Solar, Inc. focuses on renewable energy and natural gas sectors. The company was incorporated in 2012 and is headquatered in Dallas Texas.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Dallas"
    },
    "PTOS": {
        "short_name": "P2 SOLAR INC",
        "long_name": "P2 Solar, Inc",
        "summary": "P2 Solar, Inc. develops solar photovoltaic (PV) power and mini-hydro projects. It operates a solar PV rooftop project in Canada; and two mini-hydro power projects in India. The company was formerly known as Natco International Inc. and changed its name to P2 Solar, Inc. in March 2009. P2 Solar, Inc. was founded in 1990 and is based in Surrey, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Surrey"
    },
    "QCE.HM": {
        "short_name": "GLOBAL PVQ SE",
        "long_name": "Global PVQ SE",
        "summary": "Global PVQ SE engages in the development, manufacture, and marketing of solar cells, solar modules, and photovoltaic systems to module manufacturers worldwide. The company produces solar cells from monocrystalline and polycrystalline silicon wafers, as well as crystalline and thin-film modules. It also provides a range of services for the development and installation of ground-mounted and commercial rooftop photovoltaic systems. The company was formerly known as Q-Cells SE and changed its name to Global PVQ SE in September 2012. Global PVQ SE was founded in 1999 and is headquartered in Bitterfeld-Wolfen, Germany. Global PVQ SE is in reorganization.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HAM",
        "market": "dr_market",
        "country": "Germany",
        "city": "Bitterfeld-Wolfen"
    },
    "QCLSF": {
        "short_name": "GLOBAL PVQ SE",
        "long_name": "Global PVQ SE",
        "summary": "Global PVQ SE engages in the development, manufacture, and marketing of solar cells, solar modules, and photovoltaic systems to module manufacturers worldwide. The company produces solar cells from monocrystalline and polycrystalline silicon wafers, as well as crystalline and thin-film modules. It also provides a range of services for the development and installation of ground-mounted and commercial rooftop photovoltaic systems. The company was formerly known as Q-Cells SE and changed its name to Global PVQ SE in September 2012. Global PVQ SE was founded in 1999 and is headquartered in Bitterfeld-Wolfen, Germany. Global PVQ SE is in reorganization.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Germany",
        "city": "Bitterfeld-Wolfen"
    },
    "QTMM": {
        "short_name": "QUANTUM MATERIALS CORP",
        "long_name": "Quantum Materials Corp.",
        "summary": "Quantum Materials Corp., a nanotechnology company, designs, develops, produces, and supplies quantum dots, tetrapod quantum dots, and other nanoparticles in the United States. The company's products are used for a range of applications in the televisions, displays and other optoelectronics, photovoltaics, solid state lighting, life sciences, security ink, battery, and sensor sectors. It also operates QMC?HealthID, a management platform and mobile app that authenticates the process of infectious disease testing and gives the individual control over the data they share and their personal health status. The company was founded in 2007 and is headquartered in San Marcos, Texas.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "San Marcos"
    },
    "RGSEQ": {
        "short_name": "REAL GOODS SOLAR INC",
        "long_name": "Real Goods Solar, Inc.",
        "summary": "Real Goods Solar, Inc. operates as a residential and small business commercial solar energy engineering, procurement, and construction company in the United States. The company's Solar Division segment installs solar energy systems for homeowners, including lease financing, as well as small business commercial services in the continental United States. Its POWERHOUSE segment manufactures and sells solar shingles. The company offers turnkey services, including design, procurement, permitting, build-out, grid connection, financing referrals, and warranty. The company markets its products and services through an outside sales team, inside sales, e-sales, and customer referral programs, as well as an online direct marketing channel. Real Goods Solar, Inc. was founded in 1978 and is headquartered in Denver, Colorado. On March 5, 2020, Real Goods Solar, Inc., filed a voluntary petition for liquidation under Chapter 7 in the U.S. Bankruptcy Court for the District of Colorado.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Denver"
    },
    "RUN.MX": {
        "short_name": "SUNRUN INC",
        "long_name": "Sunrun Inc.",
        "summary": "Sunrun Inc. engages in the design, development, installation, sale, ownership, and maintenance of residential solar energy systems in the United States. It also sells solar energy systems and products, such as panels and racking; and solar leads generated to customers. In addition, the company offers battery storage along with solar energy systems. Its primary customers are residential homeowners. The company markets and sells its products through direct-to-consumer approach across online, retail, mass media, digital media, canvassing, field marketing, and referral channels, as well as its partner network. Sunrun Inc. was founded in 2007 and is headquartered in San Francisco, California.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "San Francisco"
    },
    "RUN": {
        "short_name": "Sunrun Inc.",
        "long_name": "Sunrun Inc.",
        "summary": "Sunrun Inc. engages in the design, development, installation, sale, ownership, and maintenance of residential solar energy systems in the United States. It also sells solar energy systems and products, such as panels and racking; and solar leads generated to customers. In addition, the company offers battery storage along with solar energy systems. Its primary customers are residential homeowners. The company markets and sells its products through direct-to-consumer approach across online, retail, mass media, digital media, canvassing, field marketing, and referral channels, as well as its partner network. Sunrun Inc. was founded in 2007 and is headquartered in San Francisco, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "San Francisco"
    },
    "S92.DE": {
        "short_name": "SMA SOLAR TECHNOL.AG",
        "long_name": "SMA Solar Technology AG",
        "summary": "SMA Solar Technology AG, together with its subsidiaries, develops, produces, and sells solar and battery inverters, monitoring systems for photovoltaic (PV) systems, medium-voltage technology products, transformers, and chokes worldwide. The company offers string and central solar inverters for various module types, grid-connection and feeding into stand-alone grids, small house systems, and commercial systems; battery inverters for high-voltage batteries, on- and off-grid applications, commercial and industrial storage solutions, storage solutions, and accessories; and preconfigured system components. It also provides DC-DC converters; E-mobility charging solutions; monitoring and control solutions for PV systems; and energy data services, as well as digital solutions to design, operate, and service PV systems and energy systems. The company was formerly known as SMA Technologie AG and changed its name to SMA Solar Technology AG in June 2008. SMA Solar Technology AG was founded in 1981 and is headquartered in Niestetal, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "city": "Niestetal"
    },
    "S92.F": {
        "short_name": "SMA SOLAR TECHNOL.AG",
        "long_name": "SMA Solar Technology AG",
        "summary": "SMA Solar Technology AG, together with its subsidiaries, develops, produces, and sells solar and battery inverters, monitoring systems for photovoltaic (PV) systems, medium-voltage technology products, transformers, and chokes worldwide. The company offers string and central solar inverters for various module types, grid-connection and feeding into stand-alone grids, small house systems, and commercial systems; battery inverters for high-voltage batteries, on- and off-grid applications, commercial and industrial storage solutions, storage solutions, and accessories; and preconfigured system components. It also provides DC-DC converters; E-mobility charging solutions; monitoring and control solutions for PV systems; and energy data services, as well as digital solutions to design, operate, and service PV systems and energy systems. The company was formerly known as SMA Technologie AG and changed its name to SMA Solar Technology AG in June 2008. SMA Solar Technology AG was founded in 1981 and is headquartered in Niestetal, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "city": "Niestetal"
    },
    "S92.VI": {
        "short_name": "SMA SOLAR AG",
        "long_name": "SMA Solar Technology AG",
        "summary": "SMA Solar Technology AG, together with its subsidiaries, develops, produces, and sells solar and battery inverters, monitoring systems for photovoltaic (PV) systems, medium-voltage technology products, transformers, and chokes worldwide. The company offers string and central solar inverters for various module types, grid-connection and feeding into stand-alone grids, small house systems, and commercial systems; battery inverters for high-voltage batteries, on- and off-grid applications, commercial and industrial storage solutions, storage solutions, and accessories; and preconfigured system components. It also provides DC-DC converters; E-mobility charging solutions; monitoring and control solutions for PV systems; and energy data services, as well as digital solutions to design, operate, and service PV systems and energy systems. The company was formerly known as SMA Technologie AG and changed its name to SMA Solar Technology AG in June 2008. SMA Solar Technology AG was founded in 1981 and is headquartered in Niestetal, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Germany",
        "city": "Niestetal"
    },
    "S9P2.F": {
        "short_name": "SUNPOWER CORP.  DL -,01",
        "long_name": "SunPower Corporation",
        "summary": "SunPower Corporation delivers solar solutions worldwide. It operates through Residential, Light Commercial; Commercial and Industrial Solutions; and Others segments. The company provides solar energy solutions, including sales to its third-party dealer network and resellers, storage solutions, cash and loan sales, and long-term leases directly to end customers; and sells turn-key engineering, procurement, and construction services, as well as sells energy under power purchase agreements. It also offers commercial roof, carport, and ground mounted systems; and post-installation operations and maintenance services. In addition, the company provides residential leasing program services, as well as sells inverters manufactured by third parties. The company also serves investors, financial institutions, project developers, electric utilities, independent power producers, commercial and governmental entities, production home builders, residential owners, and small commercial building owners. The company was incorporated in 1985 and is headquartered in San Jose, California. SunPower Corporation is a subsidiary of Total Energies Nouvelles ActivitÃ©s USA.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Jose"
    },
    "SAENF": {
        "short_name": "SOLAR ALLIANCE ENERGY INC",
        "long_name": "Solar Alliance Energy Inc.",
        "summary": "Solar Alliance Energy Inc., together with its subsidiaries, provides energy solutions. The company primarily focuses on development, engineering, procurement, and construction of commercial and industrial solar projects, and residential solar installations in Tennessee, Kentucky, Illinois, and North/South Carolina. It also offers electric vehicle charger installation services; and turnkey clean energy solutions. The company was formerly known as Finavera Solar Energy, Inc. and changed its name to Solar Alliance Energy Inc. in January 2016. Solar Alliance Energy Inc. was founded in 2003 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "SAVOH.HE": {
        "short_name": "Savosolar Plc",
        "long_name": "Savosolar Oyj",
        "summary": "Savosolar Oyj, together with its subsidiaries, designs and supplies solar thermal systems primarily in Europe. The company produces flat plate collectors, collector fields, and turnkey solar thermal systems. Its products are used in district heating, industrial process heating, and hot water and space heating applications. The company was founded in 2009 and is based in Mikkeli, Finland.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Mikkeli"
    },
    "SAVOS.ST": {
        "short_name": "Savosolar Plc",
        "long_name": "Savosolar Oyj",
        "summary": "Savosolar Oyj, together with its subsidiaries, designs and supplies solar thermal systems primarily in Europe. The company produces flat plate collectors, collector fields, and turnkey solar thermal systems. Its products are used in district heating, industrial process heating, and hot water and space heating applications. The company was founded in 2009 and is based in Mikkeli, Finland.",
        "currency": "SEK",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "STO",
        "market": "se_market",
        "country": "Finland",
        "city": "Mikkeli"
    },
    "SEDG": {
        "short_name": "SolarEdge Technologies, Inc.",
        "long_name": "SolarEdge Technologies, Inc.",
        "summary": "SolarEdge Technologies, Inc., together with its subsidiaries, designs, develops, and sells direct current (DC) optimized inverter systems for solar photovoltaic (PV) installations worldwide. It offers inverters, power optimizers, communication devices, and smart energy management solutions used in residential, commercial, and small utility-scale solar installations; and a cloud-based monitoring platform that collects and processes information from the power optimizers and inverters, as well as monitors and manages the solar PV system. The company also provides residential, commercial, and large scale photovoltaics, energy storage and backup, electric vehicle charging, and home energy management solutions, as well as grid services; and e-Mobility, automation machines, lithium-ion cells and battery packs, and uninterrupted power supply solutions, as well as virtual power plants, which helps to manage the load on the grid and grid stability. In addition, it offers pre-sales support, ongoing trainings, and technical support and after installation services. The company sells its products to the providers of solar PV systems; and solar installers and distributors, electrical equipment wholesalers, and PV module manufacturers, as well as engineering, procurement, and construction firms. SolarEdge Technologies, Inc. was founded in 2006 and is headquartered in Herzliya, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Herzliya"
    },
    "SEDG.VI": {
        "short_name": "SOLAREDGE TECHNOLOGIES INC",
        "long_name": "SolarEdge Technologies, Inc.",
        "summary": "SolarEdge Technologies, Inc., together with its subsidiaries, designs, develops, and sells direct current (DC) optimized inverter systems for solar photovoltaic (PV) installations worldwide. It offers inverters, power optimizers, communication devices, and smart energy management solutions used in residential, commercial, and small utility-scale solar installations; and a cloud-based monitoring platform that collects and processes information from the power optimizers and inverters, as well as monitors and manages the solar PV system. The company also provides residential, commercial, and large scale photovoltaics, energy storage and backup, electric vehicle charging, and home energy management solutions, as well as grid services; and e-Mobility, automation machines, lithium-ion cells and battery packs, and uninterrupted power supply solutions, as well as virtual power plants, which helps to manage the load on the grid and grid stability. In addition, it offers pre-sales support, ongoing trainings, and technical support and after installation services. The company sells its products to the providers of solar PV systems; and solar installers and distributors, electrical equipment wholesalers, and PV module manufacturers, as well as engineering, procurement, and construction firms. SolarEdge Technologies, Inc. was founded in 2006 and is headquartered in Herzliya, Israel.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Israel",
        "city": "Herzliya"
    },
    "SFX.F": {
        "short_name": "SOLAR-FABRIK AG O.N.",
        "long_name": "Solar-Fabrik Aktiengesellschaft",
        "summary": "Solar-Fabrik Aktiengesellschaft develops, manufactures, markets, and sells solar modules and systems, and various technical products and components to employ and convert solar energy in Germany and other countries in Europe. It operates through Solar Power Systems, Installation, and Power Generation segments. The company offers in-roof mounting systems, modules, inverters, data communicators and sensors, incell systems for roof integration, photovoltaic mounting systems, and innoframe module clamps, as well as operate convert-control.de, a portal that enables online access to solar power system in structured format. It also develops and installs solar arrays; and develops and constructs photovoltaic projects, as well as operates solar plant. The company was founded in 1996 and is headquartered in Freiburg, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "city": "Freiburg"
    },
    "SHLS": {
        "short_name": "Shoals Technologies Group, Inc.",
        "long_name": "Shoals Technologies Group, Inc.",
        "summary": "Shoals Technologies Group, Inc. provides electrical balance of system (EBOS) solutions for solar energy projects in the United States. It offers EBOS components, such as cable assemblies, inline fuses, combiners, recombiners, disconnects, wireless monitoring systems, junction boxes, transition enclosures, and splice boxes that carry the electric current produced by solar panels to an inverter and to the power grid. The company sells its products to engineering, procurement, and construction firms that build solar energy projects. Shoals Technologies Group, Inc. was founded in 1996 and is headquartered in Portland, Tennessee.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "city": "Portland"
    },
    "SHUNF": {
        "short_name": "SHUNFENG INTL CLEAN ENERGY LTD",
        "long_name": "Shunfeng International Clean Energy Limited",
        "summary": "Shunfeng International Clean Energy Limited, together with its subsidiaries, provides clean energy and low-carbon energy-saving integrated solutions in the Peoples' Republic of China and internationally. It operates through Solar Power Generation in the PRC and Manufacturing and Sales of Light-Emitting Diode (LED) Products segments. The company offers GaN-on-silicon substrate LED epitaxial wafers and chips, LED packages, and other LED products; and solar products and related installation services. It also engages in the solar power generation business. The company was formerly known as Shunfeng Photovoltaic International Limited and changed its name to Shunfeng International Clean Energy Limited in November 2014. Shunfeng International Clean Energy Limited is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "SING": {
        "short_name": "SINGLEPOINT INC",
        "long_name": "SinglePoint Inc.",
        "summary": "SinglePoint Inc. focuses on providing renewable energy solutions and energy-efficient applications in the United States. It offers solar and air purification services; and solar installation and financing brokerage services. The company also operates as an online retailer of health, wealth, and lifestyle products; and supplies hydroponic supplies and nutrients to commercial and individual farmers through online stores, as well as nutrients, lights, HVAC systems, and other products to individuals that are interested in horticulture. In addition, it offers mobile web credit card gateway services; and automotive technology solutions for vehicle repairs. The company was founded in 2007 and is based in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Phoenix"
    },
    "SIRC": {
        "short_name": "SOLAR INTEGRATED ROOFING CORP",
        "long_name": "Solar Integrated Roofing Corporation",
        "summary": "Solar Integrated Roofing Corporation operates as an integrated solar and roofing installation company specializing in commercial and residential properties. The company was formerly known as Landstar Development Group, Inc. and changed its name to Solar Integrated Roofing Corporation in November 2015. Solar Integrated Roofing Corporation was founded in 2007 and is headquartered in El Cajon, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "El Cajon"
    },
    "SMTGF": {
        "short_name": "SMA SOLAR TECHNOLOGY AG",
        "long_name": "SMA Solar Technology AG",
        "summary": "SMA Solar Technology AG, together with its subsidiaries, develops, produces, and sells solar and battery inverters, monitoring systems for photovoltaic (PV) systems, medium-voltage technology products, transformers, and chokes worldwide. The company offers string and central solar inverters for various module types, grid-connection and feeding into stand-alone grids, small house systems, and commercial systems; battery inverters for high-voltage batteries, on- and off-grid applications, commercial and industrial storage solutions, storage solutions, and accessories; and preconfigured system components. It also provides DC-DC converters; E-mobility charging solutions; monitoring and control solutions for PV systems; and energy data services, as well as digital solutions to design, operate, and service PV systems and energy systems. The company was formerly known as SMA Technologie AG and changed its name to SMA Solar Technology AG in June 2008. SMA Solar Technology AG was founded in 1981 and is headquartered in Niestetal, Germany.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Germany",
        "city": "Niestetal"
    },
    "SNPW": {
        "short_name": "SUN PACIFIC HOLDING CORP",
        "long_name": "Sun Pacific Holding Corp.",
        "summary": "Sun Pacific Holding Corp., a green energy company, provides solar panel and lighting products in the United States. The company offers solar bus stops, solar trashcans, and street kiosks, as well as advertising services. It also provides general, electrical, and plumbing contracting services to a range of public and commercial customers. In addition, the company engages in building and developing a waste to energy plant in the State of Rhode Island. The company was incorporated in 2009 and is based in Manalapan, New Jersey. Sun Pacific Holding Corp. is a subsidiary of EXOlifestyle, Inc.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Manalapan"
    },
    "SNRY": {
        "short_name": "SOLAR ENERGY INITIATIVES INC",
        "long_name": "Solar Energy Initiatives, Inc.",
        "summary": "Solar Energy Initiatives, Inc., together with its subsidiaries, markets and sells solar power products, systems, and services in the United States and the Caribbean. The company primarily designs, markets, and sells solar power systems for residential and commercial customers; and designs, markets, sells, owns, and operates solar power systems for municipal and commercial customers, as well as designs, develops, and manages solar parks. Its products include photovoltaic panels, photovoltaic roofing systems, solar thermal products, balance of system products, and management system products. The company was formerly known as NP Capital Corp. and changed its name to Solar Energy Initiatives, Inc. in September 2008. Solar Energy Initiatives, Inc. was founded in 2006 and is based in Cary, North Carolina.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Cary"
    },
    "SOEN": {
        "short_name": "SOLAR ENERTECH CORP",
        "long_name": "Solar Enertech Corp.",
        "summary": "Solar EnerTech Corp. operates as a photovoltaic (PV) solar energy cell manufacturing company. Its principal products include monocrystalline silicon and polycrystalline silicon solar cells and modules. The company's solar cells convert sunlight to electricity through the PV effect. It also designs and produces advanced PV modules for various applications, such as standard panels for solar power stations, roof panels, solar arrays, and modules incorporated directly into exterior walls. The company markets its products primarily to solar panel installers, who incorporate those modules into their power generating systems that are sold to end-customers located in Europe, Australia, North America, and China. It markets its solar cells and modules under the SolarE brand name. The company was formerly known as Safer Residence Corporation and changed its name to Solar EnerTech Corp. in April 2006. Solar EnerTech Corp. was incorporated in 2004 is headquartered in Mountain View, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Mountain View"
    },
    "SOL.MC": {
        "short_name": "SOLTEC POWER HOLDINGS, S.A.",
        "long_name": "Soltec Power Holdings, S.A.",
        "summary": "Soltec Power Holdings, S.A. engages in the design, manufacture, and supply of solar trackers and related components in Latin America, North America, Mexico, Europe, the Middle East and Africa, and the Asia-Pacific. The company provides a range of development, equipment supply, construction, and operations and maintenance services. Its principal products include SF7 single-axis and bi-facial trackers, SF7 Tandem trackers, and SF8 single-axis and bi-facial trackers. The company also offers design, procurement, installation, and construction services to solar power projects; and warranty and care services to its customers. The company was founded in 2004 and is headquartered in Murcia, Spain.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "MCE",
        "market": "es_market",
        "country": "Spain",
        "city": "Murcia"
    },
    "SOL": {
        "short_name": "Renesola Ltd. American Depsitar",
        "long_name": "ReneSola Ltd",
        "summary": "ReneSola Ltd, through its subsidiaries, develops, builds, operates, and sells solar power projects. It operates through three segments: Solar Power Project Development, EPC Services, and Electricity Generation Revenue. The company also develops community solar gardens; and sells projects rights. In addition, its engineering, and procurement and construction business includes engineering design, procurement of solar modules, balance-of-system components and other components, and construction contracting and management services. Further, the company generates and sells electricity. As of December 31, 2020, it operated approximately 100 solar power projects with an aggregate capacity of 173 megawatts. ReneSola Ltd has operations in the United States and Europe. The company was founded in 2005 and is headquartered in Stamford, Connecticut.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Stamford"
    },
    "SOLAR-R.BK": {
        "short_name": "SOLARTRON PUBLIC COMPANY LIMITE",
        "long_name": "Solartron Public Company Limited",
        "summary": "Solartron Public Company Limited, together with its subsidiaries, manufactures, distributes, sells, and installs solar-cell systems and related equipment in Thailand and internationally. The company operates through Selling and Installation of Solar-Cell Systems, Distribution SolarÂ\u0096Cell, Sale of Electricity, Hire of Work, and Other segments. It also constructs solar power plants; and produces and distributes electricity from solar energy. The company was incorporated in 1986 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SOLAR.BK": {
        "short_name": "SOLARTRON PUBLIC COMPANY LIMITE",
        "long_name": "Solartron Public Company Limited",
        "summary": "Solartron Public Company Limited, together with its subsidiaries, manufactures, distributes, sells, and installs solar-cell systems and related equipment in Thailand and internationally. The company operates through Selling and Installation of Solar-Cell Systems, Distribution SolarÂ\u0096Cell, Sale of Electricity, Hire of Work, and Other segments. It also constructs solar power plants; and produces and distributes electricity from solar energy. The company was incorporated in 1986 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "SOLR.TA": {
        "short_name": "SOLAER RENEWABLE",
        "long_name": "Solaer Renewable Energies Ltd",
        "summary": "Solaer Renewable Energies Ltd develops and installs photovoltaic solar arrays in ground-mounted and rooftop projects in Israel and Europe. The company was founded in 2009 and is based in Rehovot, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Rehovot"
    },
    "SOLR.V": {
        "short_name": "SOLAR ALLIANCE ENERGY INC",
        "long_name": "Solar Alliance Energy Inc.",
        "summary": "Solar Alliance Energy Inc., together with its subsidiaries, provides energy solutions. The company primarily focuses on the development, engineering, procurement, and construction of commercial and industrial solar projects, and residential solar installations in California, Tennessee, North/South Carolina, and Kentucky. It also provides turnkey clean energy solutions. The company was formerly known as Finavera Solar Energy, Inc. and changed its name to Solar Alliance Energy Inc. in January 2016. Solar Alliance Energy Inc. was founded in 2003 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "SOLT.ST": {
        "short_name": "SolTech Energy Sweden AB",
        "long_name": "SolTech Energy Sweden AB (publ)",
        "summary": "SolTech Energy Sweden AB (publ) develops, installs, and sells energy and solar cell solutions for residential and multi-unit buildings, industrial and commercial properties, and public sectors primarily in Sweden and China. It offers SolTech RooF, a roofing tile with integrated solar cells; SolTech ShingEl, a roof tile to generate solar energy; Soltech FaÃ§ade, a solar cell facade; and surface-mounted solar panels. SolTech Energy Sweden AB (publ) was incorporated in 2006 and is based in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "SOO1.HM": {
        "short_name": "SOLON SE O.N.",
        "long_name": "SOLON Energy GmbH",
        "summary": "SOLON Energy GmbH engages in the manufacture and sale of solar power modules and solar systems for rooftop, roof integrated, and greenfield installations worldwide. It is involved in the development, construction, and maintenance of commercial and utility-scale solar systems, as well as distribution to project developers. The company offers polycrystalline and monocrystalline solar modules with various outputs and turnkey power plant solutions to residential buildings, commercial rooftops, and power plant greenfields. It also engages in the organization and realization of solar power plant projects to utilities, financial investors, and industrial customers. The company was formerly known as SOLON SE and changed its name to SOLON Energy GmbH in March 2012. SOLON Energy GmbH was founded in 1997 and is headquartered in Berlin, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HAM",
        "market": "dr_market",
        "country": "Germany",
        "city": "Berlin"
    },
    "SPI": {
        "short_name": "SPI Energy Co., Ltd.",
        "long_name": "SPI Energy Co., Ltd.",
        "summary": "SPI Energy Co., Ltd. provides photovoltaic solutions for business, residential, government, and utility customers and investors. It offers engineering, procurement, and construction services to independent power developers and producers, and commercial and industrial companies. The company also develops, owns, and operates solar projects that sell electricity to power companies and other electricity off-takers. As of April 29, 2021, it owned and operated 16.8 megawatts of solar projects. In addition, the company, through its wholly owned subsidiary, EdisonFuture, Inc., designs and develops electric vehicles and EV charging solutions. It operates in Greece, the United States, Italy, Japan, the United Kingdom, Australia, and regulatory. SPI Energy Co., Ltd. is headquartered in Sha Tin, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Sha Tin"
    },
    "SPSO": {
        "short_name": "SPECTACULAR SOLAR INC",
        "long_name": "Spectacular Solar, Inc.",
        "summary": "Spectacular Solar, Inc., through its subsidiaries, engages in solar system installation, investment fund management, and roofing contracting businesses. It designs and installs solar conversions for homeowners and business owners; and provides new roof installation, roof repairs, and roof maintenance services. The company is based in Rahway, New Jersey.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Rahway"
    },
    "SPWR": {
        "short_name": "SunPower Corporation",
        "long_name": "SunPower Corporation",
        "summary": "SunPower Corporation delivers solar solutions worldwide. It operates through Residential, Light Commercial; Commercial and Industrial Solutions; and Others segments. The company provides solar energy solutions, including sales to its third-party dealer network and resellers, storage solutions, cash and loan sales, and long-term leases directly to end customers; and sells turn-key engineering, procurement, and construction services, as well as sells energy under power purchase agreements. It also offers commercial roof, carport, and ground mounted systems; and post-installation operations and maintenance services. In addition, the company provides residential leasing program services, as well as sells inverters manufactured by third parties. The company also serves investors, financial institutions, project developers, electric utilities, independent power producers, commercial and governmental entities, production home builders, residential owners, and small commercial building owners. The company was incorporated in 1985 and is headquartered in San Jose, California. SunPower Corporation is a subsidiary of Total Energies Nouvelles ActivitÃ©s USA.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "SRWRF": {
        "short_name": "SOLARWORLD AG",
        "long_name": "SolarWorld Aktiengesellschaft",
        "summary": "SolarWorld Aktiengesellschaft manufactures and sells solar power products for on-grid and off-grid applications worldwide. The company operates through Production Germany, Production U.S., and Trade segments. It offers Sunmodule Plus, Sunmodule Bisun, and Sunmodule XL solar modules. The company also provides SolarWorld Kits, which comprises components required for constructing and operating a solar power system; Sundeck, a roof-integrated solution suitable for rooftop covers and refurbishment projects; Sunfix Plus, a mounting system for pitched or flat roofs; and Sunfix aero and Sunfix Bisun flat roof mounting systems. In addition, it offers Suntrol for system data monitoring; Suntool, a planning software for architects, fitters, planners, and wholesale traders; Sunplug eco, an inverter for domestic solar systems; KOSTAL inverters; and Sunpass, which provides planning, installation, and documentation of key data of solar array. Further, the company distributes solar systems and modules, as well as sells wafers and cells. It offers solar energy solutions to home and business owners, and energy suppliers. SolarWorld Aktiengesellschaft was founded in 1988 and is headquartered in Bonn, Germany.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Germany",
        "city": "Bonn"
    },
    "SUNW": {
        "short_name": "Sunworks, Inc.",
        "long_name": "Sunworks, Inc.",
        "summary": "Sunworks, Inc., through its subsidiaries, provides photovoltaic based power systems for the agricultural, commercial, industrial, public works, and residential markets in California, Massachusetts, Nevada, Oregon, New Jersey, and Hawaii. The company also designs, finances, integrates, installs, and manages systems ranging in size from 2 kilowatt for residential loads to multi megawatt systems for larger projects. In addition, it offers a range of installation services, including design, system engineering, procurement, permitting, construction, grid connection, warranty, system monitoring, and maintenance services to its solar energy customers. The company was formerly known as Solar3D, Inc. and changed its name to Sunworks, Inc. in March 2016. Sunworks, Inc. was incorporated in 2002 and is headquartered in Roseville, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Roseville"
    },
    "SURANASOL.NS": {
        "short_name": "SURANA SOLAR LTD",
        "long_name": "Surana Solar Limited",
        "summary": "Surana Solar Limited manufactures and sells solar panels and solar photovoltaic modules in India and internationally. It operates through Solar products, and Wind and Solar Power segments. It also generates wind and solar power; and trades in other solar related products. The company was formerly known as Surana Ventures Limited. Surana Solar Limited was incorporated in 2006 and is based in Secunderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Secunderabad"
    },
    "SVLT": {
        "short_name": "SUNVAULT ENERGY INC",
        "long_name": "Sunvault Energy, Inc.",
        "summary": "Sunvault Energy, Inc. provides renewables integration into energy production, energy delivery, and energy consumption, as well as transport services. It is involved in the development of vertical solar appliance; PolyCell, a multi-celled battery for energy storage; and All-in-One, a photovoltaic and electrochemical cell that generates and stores energy at the molecular level. Sunvault Energy, Inc. is based in Edmonton, Canada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Edmonton"
    },
    "SWELECTES.NS": {
        "short_name": "SWELECT ENERGY SYS",
        "long_name": "Swelect Energy Systems Limited",
        "summary": "Swelect Energy Systems Limited manufactures and trades in solar modules, mounting structures, transformers, and inverters in India, Europe, and internationally. The company operates through Solar and Solar Related Activities, Foundry Business, and Others segments. It offers mono and multi crystalline solar photovoltaic modules, and building integrated photovoltaic modules; solar inverters; solar water pumps; and hydro panels. The company also engages in iron, steel, and investment casting activities. In addition, it provides stabilizers; energy conservation and audits, design/retrofit sustainable buildings, and LED lighting system; site feasibility analysis; engineering, procurement, and construction contracts; and operation and maintenance services, as well as engages in solar and wind power generation activities. The company was formerly known as Numeric Power Systems Limited and changed its name to Swelect Energy Systems Limited in May 2012. Swelect Energy Systems Limited was incorporated in 1994 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "SWSOLAR.NS": {
        "short_name": "Sterling & Wilson So Ltd",
        "long_name": "Sterling and Wilson Solar Limited",
        "summary": "Sterling and Wilson Solar Limited provides engineering, procurement, and construction (EPC) services to solar power projects. Its EPC services primarily include the design and engineering functions, procurement of raw materials and selection of vendors, inspection and audit, construction of the solar power project, and field quality monitoring services. The company also provides operations and maintenance services to third-party projects. Additionally, it imports, exports, and trades in solar modules, structures, invertors, and related accessories. Further, the company engages in the installation and maintenance of solar power generating facilities and other related activities. It has 245 solar power projects with an aggregate capacity of 10,134 mega-watt peak. The company's customers include independent power producers, developers, and equity funds. It operates in 25 countries with operations in India, the South-East Asia, the Middle East, Africa, Europe, the Americas, and Australia. The company was founded in 2011 and is based in New Delhi, India. Sterling and Wilson Solar Limited is a subsidiary of Shapoorji Pallonji and Company Private Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "SWVK.F": {
        "short_name": "SOLARWORLD AG  O.N.",
        "long_name": "SolarWorld Aktiengesellschaft",
        "summary": "SolarWorld Aktiengesellschaft manufactures and sells solar power products for on-grid and off-grid applications worldwide. The company operates through Production Germany, Production U.S., and Trade segments. It offers Sunmodule Plus, Sunmodule Bisun, and Sunmodule XL solar modules. The company also provides SolarWorld Kits, which comprises components required for constructing and operating a solar power system; Sundeck, a roof-integrated solution suitable for rooftop covers and refurbishment projects; Sunfix Plus, a mounting system for pitched or flat roofs; and Sunfix aero and Sunfix Bisun flat roof mounting systems. In addition, it offers Suntrol for system data monitoring; Suntool, a planning software for architects, fitters, planners, and wholesale traders; Sunplug eco, an inverter for domestic solar systems; KOSTAL inverters; and Sunpass, which provides planning, installation, and documentation of key data of solar array. Further, the company distributes solar systems and modules, as well as sells wafers and cells. It offers solar energy solutions to home and business owners, and energy suppliers. SolarWorld Aktiengesellschaft was founded in 1988 and is headquartered in Bonn, Germany.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "city": "Bonn"
    },
    "TIGI.TA": {
        "short_name": "TIGI LTD",
        "long_name": "Tigi Ltd.",
        "summary": "Tigi Ltd. manufactures heating, ventilation, air-conditioning, and cooling equipment. The company is based in Kefar Sava, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Kfar Saba"
    },
    "TSPG": {
        "short_name": "TGI SOLAR POWER GROUP INC",
        "long_name": "TGI Solar Power Group Inc.",
        "summary": "TGI Solar Power Group Inc. intends to provide clients with management, tools, and resources to deliver interactive, real-time, on demand staffing for full time and project based personnel. The company was formerly known as TenthGate International, Inc. and changed its name to TGI Solar Power Group Inc. in June 2008. TGI Solar Power Group Inc. was founded in 1967 and is based in Ewing, New Jersey.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Ewing"
    },
    "TUUF.F": {
        "short_name": "SOLARTRON -FGN-  BA 1",
        "long_name": "Solartron Public Company Limited",
        "summary": "Solartron Public Company Limited, together with its subsidiaries, manufactures, distributes, sells, and installs solar-cell systems and related equipment in Thailand and internationally. The company operates through Selling and Installation of Solar-Cell Systems, Distribution SolarÂ\u0096Cell, Sale of Electricity, Hire of Work, and Other segments. It also constructs solar power plants; and produces and distributes electricity from solar energy. The company was incorporated in 1986 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "UGE.V": {
        "short_name": "UGE INTERNATIONAL LTD",
        "long_name": "UGE International Ltd.",
        "summary": "UGE International Ltd., a solar and renewable energy solutions company, provides commercial and community solar energy solutions to commercial and industrial clients in Canada, the United States, and the Philippines. It develops, engineers, deploys, and finances solar projects, as well as provides engineering, procurement, construction, and consulting services. The company was founded in 2008 and is based in New York, New York.",
        "currency": "CAD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "United States",
        "city": "New York"
    },
    "UGEIF": {
        "short_name": "UGE INTERNATIONAL LTD",
        "long_name": "UGE International Ltd.",
        "summary": "UGE International Ltd., a solar and renewable energy solutions company, provides commercial and community solar energy solutions to commercial and industrial clients in Canada, the United States, and the Philippines. It develops, engineers, deploys, and finances solar projects, as well as provides engineering, procurement, construction, and consulting services. The company was founded in 2008 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "UJAAS.NS": {
        "short_name": "UJAAS ENERGY LTD",
        "long_name": "Ujaas Energy Limited",
        "summary": "Ujaas Energy Limited manufactures and sells solar power systems in India. It operates through Solar Power Generation and Maintenance; Manufacturing and Sale of Solar Power Plant; and EV segments. The company also develops, operates, owns, and maintains solar energy power plants under the UJAAS brand; and provides engineering, procurement, and construction solutions. Its products include various transformers, including convertor and special purpose transformers, power transformers, distribution transformers, and arc furnace and induction furnace transformers; and offers electric scooters. The company was formerly known as M and B Switchgears Limited and changed its name to Ujaas Energy Limited in August 2013. Ujaas Energy Limited was founded in 1979 and is based in Indore, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Indore"
    },
    "URJA.NS": {
        "short_name": "URJA GLOBAL LTD",
        "long_name": "Urja Global Limited",
        "summary": "Urja Global Limited engages in the design, consultancy, integration, supply, installation, commissioning, and maintenance of off grid and grid connected solar power plants and decentralized solar applications in India. It offers solar, e-rickshaw, automotive, and inverter batteries; solar inverters; LED street, flood, and panel lights, as well as LED bulbs and slim LED panel lights; PV modules; solar water heaters; solar lanterns; solar power packs; solar home lighting systems; and solar charge controllers. The company also provides electric vehicles. Urja Global Limited was incorporated in 1992 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "VALOE.HE": {
        "short_name": "Valoe Oyj",
        "long_name": "Valoe Oyj",
        "summary": "Valoe Oyj develops and sells solar energy technology products worldwide. The company offers automated production technology for solar modules; production lines for modules, solar modules, and special components for solar modules; and solar cells. It also provides one-sided interdigitated back contact (IBC) and bifacial IBC back contact modules; and solar power plants and systems. The company was formerly known as Cencorp Oyj and changed its name to Valoe Oyj in May 2015. Valoe Oyj was founded in 1948 and is headquartered in Mikkeli, Finland.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Mikkeli"
    },
    "VDTK.L": {
        "short_name": "VERDITEK PLC ORD GBP0.0004",
        "long_name": "Verditek PLC",
        "summary": "Verditek PLC operates as a clean technology company in the United Kingdom, rest of Europe, and the United States. It manufactures and commercializes solar technologies in the clean energy, CO2 emission reduction, deodorization markets. The company's solar modules are used in various applications, such as transportation, real estate, consumer retail, and telecom sectors, as well as in caravans and holiday homes, solar carports and electric vehicle charging, hotel, safari, glamping, and corporate events. It also develops filtration technologies. The company was incorporated in 2016 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "VQKB.F": {
        "short_name": "RENESOLA LTD ADR 10",
        "long_name": "ReneSola Ltd",
        "summary": "ReneSola Ltd, through its subsidiaries, develops, builds, operates, and sells solar power projects. It operates through three segments: Solar Power Project Development, EPC Services, and Electricity Generation Revenue. The company also develops community solar gardens; and sells projects rights. In addition, its engineering, and procurement and construction business includes engineering design, procurement of solar modules, balance-of-system components and other components, and construction contracting and management services. Further, the company generates and sells electricity. As of December 31, 2020, it operated approximately 100 solar power projects with an aggregate capacity of 173 megawatts. ReneSola Ltd has operations in the United States and Europe. The company was founded in 2005 and is headquartered in Stamford, Connecticut.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Stamford"
    },
    "VVPR": {
        "short_name": "VivoPower International PLC",
        "long_name": "VivoPower International PLC",
        "summary": "VivoPower International PLC, together with its subsidiaries, operates as a solar and critical power services company in the United States, Australia, and the United Kingdom. It operates through Critical Power Services and Solar Development segments. The Critical Power Services segment offers energy infrastructure generation and distribution solutions, including the design, supply, installation, and maintenance of power and control systems to a range of government, and commercial and industrial customers. The Solar Development segment engages in the origination, development, construction, financing, operation, optimization, and sale of photovoltaic solar projects. The company was founded in 2014 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "WEBELSOLAR.NS": {
        "short_name": "WEBSOL ENERGY SYST",
        "long_name": "Websol Energy System Limited",
        "summary": "Websol Energy System Limited manufactures and sells photovoltaic (PV) crystalline solar cells and modules in India. Its modules are used across sectors, such as solar PV power plants, remote communication, and rural electrification. The company was formerly known as Websol Energy Systems Ltd. and changed its name to Websol Energy System Limited in October 2011. Websol Energy System Limited was incorporated in 1990 and is based in Falta, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Falta"
    },
    "XISHY": {
        "short_name": "XINYI SOLAR HOLDINGS LIMITED UN",
        "long_name": "Xinyi Solar Holdings Limited",
        "summary": "Xinyi Solar Holdings Limited, an investment holding company, produces and sells solar glass products in the People's Republic of China, Malaysia, and internationally. It operates through three segments: Sales of Solar Glass; Solar Farm Business; and Engineering, Procurement and Construction Services. The company offers photovolatic power station, ultraclear patterned glasses, back glasses, and AR photovoltaic glasses, as well as double glass modules. It also develops and operates solar farms; and provides engineering, procurement, and construction services. In addition, the company engages in the provision of solar power systems; and trading of solar glass products. Xinyi Solar Holdings Limited was founded in 2008 and is headquartered in Wuhu, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Wuhu"
    },
    "XNYIF": {
        "short_name": "XINYI SOLAR HOLDINGS LIMITED",
        "long_name": "Xinyi Solar Holdings Limited",
        "summary": "Xinyi Solar Holdings Limited, an investment holding company, produces and sells solar glass products in the People's Republic of China, Malaysia, and internationally. It operates through three segments: Sales of Solar Glass; Solar Farm Business; and Engineering, Procurement and Construction Services. The company offers photovolatic power station, ultraclear patterned glasses, back glasses, and AR photovoltaic glasses, as well as double glass modules. It also develops and operates solar farms; and provides engineering, procurement, and construction services. In addition, the company engages in the provision of solar power systems; and trading of solar glass products. Xinyi Solar Holdings Limited was founded in 2008 and is headquartered in Wuhu, the People's Republic of China.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Wuhu"
    },
    "ZJS1.F": {
        "short_name": "JINKOSOLAR ADR/4 DL-00002",
        "long_name": "JinkoSolar Holding Co., Ltd.",
        "summary": "JinkoSolar Holding Co., Ltd., together with its subsidiaries, engages in the design, development, production, and marketing of photovoltaic products. The company offers solar modules, silicon wafers, solar cells, recovered silicon materials, and silicon ingots. It also provides solar system integration services; and develops commercial solar power projects. The company sells its products to distributors, project developers, and system integrators; and utility, commercial, and residential customers under the JinkoSolar brand, as well as on an original equipment manufacturer basis. As of December 31, 2020, it had an integrated annual capacity of 22 gigawatt (GW) for mono wafers; 11 GW for solar cells; and 31 GW for solar modules. The company has operations in the People's Republic of China, the United States, Japan, Germany, the United Kingdom, Chile, South Africa, India, Mexico, Brazil, the United Arab Emirates, Italy, Spain, France, Belgium, and internationally. JinkoSolar Holding Co., Ltd. was founded in 2006 and is based in Shangrao, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shangrao"
    }
}