{
    "2025.TW": {
        "short_name": "CHIEN SHING STAINLESS STEEL CO",
        "long_name": "Chien Shing Stainless Steel Co., Ltd.",
        "summary": "Chien Shing Stainless Steel Co., Ltd. engages in the stainless steel business in Taiwan and internationally. It manufactures and trades in stainless steel coils and materials; and engages in cutting and sliding stainless steel coils. The company was founded in 1978 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Steel & Iron",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": null,
        "website": "http://www.csssc.com.tw",
        "market_cap": "Nano Cap"
    },
    "ELSTR.AT": {
        "short_name": "ELASTRON S.A.",
        "long_name": "Elastron S.A. - Steel Service Centers",
        "summary": "Elastron S.A. - Steel Service Centers imports, processes, produces, and resells steel products and insulated composite panels worldwide. It offers hot-and cold-rolled, and galvanized steel plates, sheets, strips, and coils; long products, such as beams, joints, channels, flats, equal and unequal angles, rounds, squares, T-sections, and bulb flats; circular, square, and rectangular hollow sections; and structural tubes. The company also provides panels-cladding systems; composite SYMDECK decks; cladding single skin products; purlin for steel buildings; drywall metal profiles; hydroponic metal gutters; and core accessories consisting of translucent panels, flashings, and fastening and sealing materials, as well as handles installation services. Further, it produces and trades in electric energy from photovoltaic stations; and agricultural products from glasshouse cultivations. The company's steel products are used in the industry, construction, shipbuilding, agricultural, and energy sectors. The company was founded in 1958 and is headquartered in Aspropyrgos, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel & Iron",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Aspropyrgos",
        "zipcode": "193 00",
        "website": "http://www.elastron.gr",
        "market_cap": "Nano Cap"
    },
    "KORDE.AT": {
        "short_name": "KORDELLOS CH.BROS S.A.(CR)",
        "long_name": "Kordellos Ch. Bros S.A.",
        "summary": "Kordellos Ch. Bros S.A. engages in the processing, trading, and distributing iron and steel products in Greece. The company was founded in 1952 and is based in Mandra, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel & Iron",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Mandra",
        "zipcode": "19600",
        "website": "http://www.kordelos.gr",
        "market_cap": "Nano Cap"
    },
    "PKXN.MX": {
        "short_name": "POSCO",
        "long_name": "POSCO",
        "summary": "POSCO, together with its subsidiaries, manufactures and sells steel rolled products and plates in South Korea and internationally. It operates through four segments: Steel, Construction, Trading, and Others. The company offers hot and cold rolled steel, stainless steel, plates, wire rods, and silicon steel sheets. It also plans, designs, and constructs industrial plants, civil engineering projects, and commercial and residential buildings; exports and imports steel products and raw materials; and generates electricity; produces gas and refuse derived fuel, as well as provides network and system integration, and logistics services. In addition, the company is involved in the engineering and construction; computer hardware and software distribution; economic research and consulting; business facility maintenance; architecture and consulting; investment in venture, energy, and bio tech industries; electronic commerce; intellectual property services and consulting; refractories and quicklime manufacturing and sales; transporting and warehousing; real estate development, rental, sale, and management; house and train manufacturing and management; and education and real estate business. Further, it engages in the resource development; mine development; business facility maintenance; fuel cell; iron ore and coal sales; and cargo handling business, as well as operates housing business agency. Additionally, the company manufactures and sells coated, and anode material. It also engages in loading and unloading; IT service and DVR; electric control engineering; forest resources development; refractory materials sales and furnace maintenance; rice processing; grain sales; packing materials manufacturing; and social enterprise businesses. POSCO was incorporated in 1968 and is headquartered in Pohang, South",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Steel & Iron",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "South Korea",
        "state": null,
        "city": "Pohang",
        "zipcode": null,
        "website": "http://www.posco.com",
        "market_cap": "Large Cap"
    },
    "PROFK.AT": {
        "short_name": "PIPEWORKS GIRAKIAN PROFIL S.A",
        "long_name": "Pipe Works L. Girakian Profil S.A.",
        "summary": "Pipe Works L. Girakian Profil S.A. manufactures and sells various types of steel pipes in Greece. The company offers constructional pipes; galvanized pipes; hollow section pipes; hollow sections galvanized pipes; hollow sections used in the construction of prefabricated houses, steel buildings, and scaffolding, as well as lofts; and metal plates for manufacturing tanks and construction lofts. It also provides heavy duty tubes used in roof rafters, doors, windows, railings, housing, etc.; round tubes used in greenhouses, mesh fencing, shoring, awnings, and railings; and automotive tubes used in car seats and the exhaust. The company sells its products to wholesalers, industries, and crafts. Pipe Works L. Girakian Profil S.A. was founded in 1967 and is headquartered in Oinofyta, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel & Iron",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Oinofyta",
        "zipcode": "32011",
        "website": "http://www.tzirakian.com",
        "market_cap": "Nano Cap"
    },
    "SIDMA.AT": {
        "short_name": "SIDMA STEEL SA (CR)",
        "long_name": "Sidma S.A. Steel Products",
        "summary": "Sidma S.A. Steel Products engages in processing and trading of steel products in Greece and internationally. The company operates in two segments, Steel and Other. It offers flat products, such as hot rolled, pickled and oiled, chequered and tear drop, cold rolled, galvanized, stainless, pre painted, and plastified surface coils and sheets, as well as corrugated and trapezoidal sheets, hot rolled plates, shipbuilding plates, boiler plates, and abrasion resistant plates. The company also provides long products, including hot rolled steel bars with rectangular, square, equilateral and non-equilateral angular, T-shaped cross-section; hot rolled beams with U-shaped cross-section, hot rolled narrow flange I-beams with taper flanges, and hot rolled medium and wide flange I-beams with parallel flanges; hot rolled bulbflats for shipbuilding purposes; and hot rolled KS crane rails and ASCE rails. In addition, it offers tubes comprising electric resistance welding (ERW) uncoated selfcolor steel profiles, ERW zinc-coated steel profiles, ERW uncoated selfcolor construction steel pipes, and ERW zinc-coated hot-dip galvanized construction steel pipes for steel pipes for industrial, structural and general use, as well as wire products. Sidma S.A. Steel Products was founded in 1931 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel & Iron",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "152 33",
        "website": "http://www.sidma.gr",
        "market_cap": "Nano Cap"
    },
    "TUBN.MX": {
        "short_name": "TUBACEX SA",
        "long_name": "Tubacex, S.A.",
        "summary": "Tubacex, S.A., together with its subsidiaries, engages in the manufacture, supply, and sale of tubular seamless stainless steel, high-nickel alloy, and nickel superalloy tubular products worldwide. The company offers stainless steel tubes; mechanical tubes; square and round bars, rolled and forged billets, and ingots; fittings and special components, such as welding fittings, curved sections, elbows, tees, reducers, and caps; and Tubacoat, a ceramic coating for long steel and high-nickel alloy products. Its products are used in oil and gas exploration and production; hydrocarbon processing; fertilizer; power generation; aerospace; and other industries. The company was founded in 1963 and is headquartered in Llodio, Spain.",
        "currency": "MXN",
        "sector": "Basic Materials",
        "industry": "Steel & Iron",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Spain",
        "state": null,
        "city": "Llodio",
        "zipcode": "01400",
        "website": "http://www.tubacex.com",
        "market_cap": "Micro Cap"
    }
}