{
    "CPRIN.MX": {
        "short_name": "CAPRI HOLDINGS LTD",
        "long_name": "Capri Holdings Limited",
        "summary": "Capri Holdings Limited designs, markets, distributes, and retails branded women's and men's apparel, footwear, and accessories in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia. The company's Versace segment offers ready-to-wear, accessories, footwear, and home furnishings through a distribution network, including boutiques; and department and specialty stores, as well as through Versace e-commerce sites. It also licenses Versace brand name and trademarks to third parties to retail and/or wholesale its products; and has licensing agreements to the manufacture and sale of jeans, fragrances, watches, and eyewear. As of March 28, 2020, this segment operated 206 retail stores, including concessions; and 824 wholesale doors. Its Jimmy Choo segment sells luxury footwear, handbags, and small leather goods through directly operated Jimmy Choo stores; and Jimmy Choo e-commerce sites. It also licenses Jimmy Choo brand name and trademarks to third parties to retail and/or wholesale its products; and has licensing agreements to the manufacture and sale of fragrances, sunglasses, and eyewear. This segment operated 226 retail stores, including concessions; and 554 wholesale doors. The company's Michael Kors segment offers accessories, footwear, and apparel through retail stores, department stores, specialty stores, and select licensing partners, as well as through Michael Kors e-commerce sites. It also licenses Michael Kors brand name and trademarks to third parties to retail and/or wholesale its products; and has licensing agreements to the manufacture and sale of watches, jewelry, fragrances, and eyewear. This segment operated 839 retail stores, including concessions; and 2,982 wholesale doors. The company was formerly known as Michael Kors Holdings Limited and changed its name to Capri Holdings Limited in December 2018. The company was founded in 1981 and is based in London, the United Kingdom.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Textile - Apparel Clothing",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "WC2B 6UF",
        "website": "http://www.capriholdings.com",
        "market_cap": "Mid Cap"
    },
    "DUR.AT": {
        "short_name": "DUROS S.A. (CR)",
        "long_name": "Duros S.A.",
        "summary": "Duros S.A. operates as a menswear company in Greece. It offers shirts, polo shirts, knitwear and cardigans, T-shirts, trousers, jackets, suits, blazers, and shoes. The company operates 30 retail shops all over Greece under the DUR label, as well as exports to the Middle East, Lebanon, Albania, Cyprus, the Czech Republic, and Bulgaria. It also sells its products online. The company was founded in 1960 and is based in Patras, Greece.",
        "currency": "EUR",
        "sector": "Consumer Goods",
        "industry": "Textile - Apparel Clothing",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Patras",
        "zipcode": "26331",
        "website": "http://www.dur.gr",
        "market_cap": "Nano Cap"
    },
    "ELBE.AT": {
        "short_name": "ELVE S.A. (CR)",
        "long_name": "Elve S.A.",
        "summary": "Elve S.A. manufactures and sells ready-made garments in France and internationally. The company offers corporate clothing for business premises, such as museums, banks, casinos, hotels, and organizations; T-shirts, hoodies, and polos for customer service sectors, including gas stations and telecommunication stores; labor clothing, such as sleeves, work pants, waterproof clothes, overalls, safety shoes, reflective clothing, gloves, hats, and accessories; and safety suits and personal protective clothing, including bulletproof vests, and clothing bags, as well as isothermal and flammable clothes for police, military, and armed forces. It also invests in and owns 5 solar energy parks with a total capacity of 5.3 MW. The company was founded in 1971 and is headquartered in Kavala, Greece.",
        "currency": "EUR",
        "sector": "Consumer Goods",
        "industry": "Textile - Apparel Clothing",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Kavala",
        "zipcode": "64007",
        "website": "http://www.elvesa.gr",
        "market_cap": "Nano Cap"
    },
    "MONCN.MX": {
        "short_name": "MONCLER SPA",
        "long_name": "Moncler S.p.A.",
        "summary": "Moncler S.p.A., together with its subsidiaries, designs, produces, and distributes clothing and related accessories for men, women, and children under the Moncler brand name. Its product portfolio includes footwear products; leather goods, such as bags, backpacks, and accessories; and sunglasses, eyeglasses, frames, and men's and women's ski goggles under the Moncler Lunettes brand. As of December 31, 2020, the company operated 219 retail directly operated stores and 63 wholesale shop-in-shops. The company also sells its products through moncler.com, an online store. It serves in Italy, other European countries, Japan, the rest of Asia, and the Americas. The company was formerly known as Moncler S.r.l. and changed its name to Moncler S.p.A. in October 2013. Moncler S.p.A. was founded in 1952 and is headquartered in Milan, Italy.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Textile - Apparel Clothing",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20144",
        "website": "http://www.monclergroup.com",
        "market_cap": "Large Cap"
    },
    "PNGB": {
        "short_name": "PANGLOBAL BRANDS INC",
        "long_name": "Panglobal Brands, Inc.",
        "summary": "Panglobal Brands, Inc. engages in the design, production, and sale of clothing and accessories in the United States and internationally. It merchandises and sells junior T-shirts, junior denim, dresses, skirts, and knit and woven tops. The company sells its products under Sosik, Scrapbook, Scrapbook Originals, Crafty Couture, Tea and Honey, and Haven brand names. It sells its products through a network of wholesale accounts. The company is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Textile - Apparel Clothing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90023",
        "website": "http://www.panglobalbrand.com",
        "market_cap": "Nano Cap"
    }
}