{
    "000552.SZ": {
        "short_name": "GANSU JINGYUAN",
        "long_name": "Gansu Jingyuan Coal Industry & Electricity Power Co., Ltd",
        "summary": "Gansu Jingyuan Coal Industry & Electricity Power Co., Ltd. engages in the coal mining business in China. It is also involved in the thermal power and heat supply, gas power generation, and other businesses. The company is based in Baiyin, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Baiyin",
        "zipcode": null,
        "website": "http://www.jymdgs.com",
        "market_cap": 7020998144
    },
    "000780.SZ": {
        "short_name": "I/MONGOLIA PINGZHU",
        "long_name": "Inner Mongolia PingZhuang Energy Resources Co.,Ltd",
        "summary": "Inner Mongolia PingZhuang Energy Resources Co.,Ltd engages in the production, washing, processing, and sale of coal in China. The company is based in Chifeng, China. Inner Mongolia PingZhuang Energy Resources Co.,Ltd is a subsidiary of Inner Mongolia Pingzhuang Coal Group Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chifeng",
        "zipcode": "024076",
        "website": "http://pzny.chnenergy.com.cn",
        "market_cap": 4544109056
    },
    "000933.SZ": {
        "short_name": "HENAN SHENHUO COAL",
        "long_name": "Henan Shenhuo Coal & Power Co.,Ltd",
        "summary": "Henan Shenhuo Coal & Power Co.,Ltd produces, processes, washes, and sells aluminum and coal products in China. It offers electrolytic aluminum, aluminum alloy, aluminum profile, and extended products; processes waste aluminum and carbon products; and sells mining equipment and mineral products. The company also engages in the trading, energy development, transport, investment and asset management, power generation and supply, import and export, management, equity investment, and sales consulting businesses. In addition, it operates department stores. The company was founded in 1998 is based in Yongcheng, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yongcheng",
        "zipcode": "476600",
        "website": "http://www.shenhuo.com",
        "market_cap": 24791521280
    },
    "000937.SZ": {
        "short_name": "JIZHONG ENERGY RES",
        "long_name": "Jizhong Energy Resources Co., Ltd.",
        "summary": "Jizhong Energy Resources Co., Ltd. engages in the coal business in China. The company was founded in 1999 and is based in Xingtai, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xingtai",
        "zipcode": null,
        "website": "http://www.jznyjt.com",
        "market_cap": 14699568128
    },
    "000968.SZ": {
        "short_name": "SHANXI BLUE FLAME",
        "long_name": "Shanxi Blue Flame Holding Company Limited",
        "summary": "Shanxi Blue Flame Holding Company Limited engages in the exploration, development, and utilization of coal mine gas. The company produces and sells coalbed gas, which is a kind of hydrocarbon gas that is deposited in coal seam and coal strata. Its products are used in household, industrial, and vehicle fuel, as well as chemical raw materials and other fields. The company was formerly known as Taiyuan Coal Gasification Company, Limited and changed its name to Shanxi Blue Flame Holding Company Limited in May 2017. Shanxi Blue Flame Holding Company Limited was founded in 1998 and is based in Taiyuan, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": null,
        "website": "http://www.tymqh.com",
        "market_cap": 6530644992
    },
    "000983.SZ": {
        "short_name": "SHANXI COKING CO.E",
        "long_name": "Shanxi Coking Coal Energy Group Co. ,Ltd.",
        "summary": "Shanxi Coking Coal Energy Group Co. ,Ltd. produces and sells coal products in the People's Republic of China. It offers coking coal, fat coal, gas coal, lean coal, meager lean coal, etc.; and fined coal for metallurgy industry, pulverized coal, steam coal, screen mixed coal, and coke products, as well as operates coal fueled-power plants. The company was formerly known as Shanxi Xishan Coal and Electricity Power Co.,Ltd. and changed its name to Shanxi Coking Coal Energy Group Co. ,Ltd. in December 2020. The company was founded in 1956 and is headquartered in Taiyuan, the People's Republic of China. Shanxi Coking Coal Energy Group Co. ,Ltd. is a subsidiary of Shanxi Coking Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": "030053",
        "website": "http://www.xsmd.com.cn",
        "market_cap": 32608618496
    },
    "002128.SZ": {
        "short_name": "HUOLINHE OPENCUT C",
        "long_name": "Huolinhe Opencut Coal Industry Corporation Limited of Inner Mongolia",
        "summary": "Huolinhe Opencut Coal Industry Corporation Limited of Inner Mongolia, together with its subsidiaries, mines, produces, processes, and sells coal products in China. The company is based in Holingol, China. Huolinhe Opencut Coal Industry Corporation Limited of Inner Mongolia is a subsidiary of SPIC Mengdong Energy Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Holingol",
        "zipcode": "029200",
        "website": null,
        "market_cap": 21483153408
    },
    "024.F": {
        "short_name": "MASTERMYNE GROUP LTD",
        "long_name": "Mastermyne Group Limited",
        "summary": "Mastermyne Group Limited provides contracting services to the underground long wall mining operations and industrial products and services in coalfields and supporting industries of Queensland and New South Wales, Australia. The company offers various mining services and equipment to the coal mining industry including, new mine development, mine operation, roadway development, conveyors, outbye, ventilation, secondary support, long wall relocations, polymeric emergency strata consolidation, production and ancillary equipment, and mining consumables. It also provides acrow props; cable-hanging brackets; geosorb, quick drive cement, road salt, and safe mark paints; pigtails and brackets, and structure and leg pins; dewatering products comprising snorebox, strainers, and suction strainers; poly droppers, poly sticks, and reflective streamers; spear and trickle dusters; and cable hanging crooks, life line products, and measuring sticks. In addition, the company offers nuts, pipe hanging brackets, pogo sticks and snap jacks, rollers, shoulder pipes and manifolds, ventilation products, visi clips, and webbing straps. Further, it provides training and consulting services; design and engineering services; and manages and maintains mining projects. Additionally, the company engages in machinery hire activities. Mastermyne Group Limited was founded in 1996 and is headquartered in Mackay, Australia.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Mackay",
        "zipcode": "4740",
        "website": "http://www.mastermyne.com.au",
        "market_cap": 58497000
    },
    "0578.HK": {
        "short_name": "ROSAN RES",
        "long_name": "Rosan Resources Holdings Limited",
        "summary": "Rosan Resources Holdings Limited, together with its subsidiaries, produces and sells coal and building materials, and trades in purchased coal in the People's Republic of China. The company operates through Coal Business and Building Materials Business segment. It also provides management services; and engages in project investment, asset management, and investment consultation activities, as well as produces and leases aluminum boundary wall moulds. The company is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://rosanresources.com",
        "market_cap": 49928160
    },
    "0866.HK": {
        "short_name": "CHINA QINFA",
        "long_name": "China Qinfa Group Limited",
        "summary": "China Qinfa Group Limited, an investment holding company, engages in the mining, purchase and sale, filtering, storage, blending, shipping, and transportation of coal in the People's Republic of China. The company operates through Coal Business and Shipping Transportation segments. As of December 31, 2019, the company owned and operated five coal mines. It is also involved in goods transportation and logistics, and charter hire activities. The company was founded in 1996 and is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.qinfagroup.com",
        "market_cap": 354064224
    },
    "0DH.F": {
        "short_name": "DARMA HENWA TBK  RP 100",
        "long_name": "PT Darma Henwa Tbk",
        "summary": "PT Darma Henwa Tbk, together with its subsidiaries, provides mining contracting, general mining, and equipment maintenance services in Indonesia. It operates through two segments, Mining Contractor and Other Services. The company is involved in various mining activities, including land clearing, top soiling, drilling, blasting, overburden removal and dumping, coal getting, coal rom, coal hauling, coal barging, vegetation, and rehabilitation activities, as well as engages in equipment rental and port service businesses. The company was formerly known as PT HWE Indonesia and changed its name to PT Darma Henwa Tbk in September 2005. PT Darma Henwa Tbk was founded in 1991 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12940",
        "website": "http://www.ptdh.co.id",
        "market_cap": 6269450
    },
    "1088.HK": {
        "short_name": "CHINA SHENHUA",
        "long_name": "China Shenhua Energy Company Limited",
        "summary": "China Shenhua Energy Company Limited and its subsidiaries engage in the production and sales of coal and power; railway, port, and shipping transportation; and coal-to-olefins businesses in the People's Republic of China and internationally. The company's Coal segment produces coal from surface and underground mines; and sells coal to power plants, metallurgical and coal chemical producers, and provincial/regional electric grid companies. As of December 31, 2020, this segment had the recoverable coal reserves of 14.42 billion tones. Its Power segment generates and sells electric power to power grid companies. This segment generates electric power through coal, thermal, wind, water, and gas. The company's Railway segment provides railway transportation services. Its Port segment offers loading, transportation, and storage services. The company's Shipping segment provides shipment transportation services. Its Coal Chemical segment produces and sells methanol; and polyethylene and polypropylene, as well as other by-products. The company was incorporated in 2004 and is based in Beijing, China. China Shenhua Energy Company Limited is a subsidiary of China Energy Investment Corporation Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100011",
        "website": "http://www.csec.com",
        "market_cap": 481012973568
    },
    "1171.HK": {
        "short_name": "YANZHOU COAL",
        "long_name": "Yanzhou Coal Mining Company Limited",
        "summary": "Yanzhou Coal Mining Company Limited primarily engages in the mining, preparation, and sale of coal in China and internationally. It offers thermal, PCI, and coking coal for electric power, metallurgy and chemical industry, etc.; produces and sells coal chemicals, including methanol, liquid wax, stable light hydrocarbon, acetic acid, ethyl acetate, etc., as well as electricity and related heat supply services; and explores for potash mineral. The company also manufactures, installs, repairs, and sells coal mining and excavating equipment, cable, and electrical equipment. In addition, it provides railway, river, and lakes transportation services; and sells construction materials. Further, the company is involved in the wholesale of coal and non-ferrous metals; house and financial leasing; logistics storage and leasing; development of charcoal products; LTCC technology development and equipment rental operations; manufacturing and sale of cable and rubber products; and production and processing of steel engineering components. Additionally, it provides underground mines management; mining materials testing; equity investment fund and corporate asset management, investment advisory and management, foreign investment fund, import and export, and international trading; solar and wind power, and production management; educational software development and event planning; and coal mining technology development, transfer, and consultation services. The company is also involved in the processing, production, and sale of FischerTropsch synthesis catalyst, composite pipe, and plastic profile products; provision of real estate development and operation, property management, garden greening engineering, and sewage treatment and rental housing agency services; and issuing subordinated capital notes. The company was founded in 1973 and is based in Zoucheng, the People's Republic of China. Yanzhou Coal Mining Company Limited is a subsidiary of Yankuang Group Corporation Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zoucheng",
        "zipcode": "273500",
        "website": "http://www.yanzhoucoal.com.cn",
        "market_cap": 72838111232
    },
    "1393.HK": {
        "short_name": "HIDILI INDUSTRY",
        "long_name": "Hidili Industry International Development Limited",
        "summary": "Hidili Industry International Development Limited, an investment holding company, engages in the coal mining, and manufacture and sale of raw coal and clean coal in the People's Republic of China. It also provides clean coal washing services. The company was incorporated in 2006 and is headquartered in Panzhihua, the People's Republic of China. Hidili Industry International Development Limited is a subsidiary of Sanlian Investment Holding Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Panzhihua",
        "zipcode": "617000",
        "website": "http://www.hidili.com.cn",
        "market_cap": 450032000
    },
    "1514.T": {
        "short_name": "SUMISEKI HOLDINGS INC",
        "long_name": "Sumiseki Holdings,Inc.",
        "summary": "Sumiseki Holdings,Inc. imports, purchases, and sells coal in Japan. It also manufactures and sells artificial diamonds; and collects, processes, and sells crushed stones. In addition, it invests in coal companies and others. The company was founded in 2008 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0004",
        "website": "http://www.sumiseki.co.jp",
        "market_cap": 6871787008
    },
    "1518.T": {
        "short_name": "MITSUI MATSUSHIMA HOLDINGS CO L",
        "long_name": "Mitsui Matsushima Holdings Co., Ltd.",
        "summary": "Mitsui Matsushima Holdings Co., Ltd. engages in the production and sale of coal products in Japan and internationally. It also produces and markets coal to steel mills, power utilities, and general industries; and operates, generates, and sells solar power to electric power companies. In addition, the company provides coal mine development/operation and coal preparation technologies; shredders, office security products, pouches, and window guidance systems; mask blanks to photomask manufacturers for various applications; straw products for dairy and beverage companies; paper and PET beverage cup and food package products for various customers; custom-made suits, as well as manufactures and sells facilities and measuring equipment for the production of crystal devices. Further, it engages in the provision of nursing care services for the elderly, in-home, and outpatient; operation of coal storage and transportation equipment, sample testing of coal, inspection of conveyors used to transport ash and gypsum, and deployment and recovery of marine oil fences; operation of an LPG filling station in Saikai city, as well as the convenience store; provision of investment and lending services to coal mines; and port and harbor businesses. Additionally, the company sells food containers; manages elderly housing; produces and sells men's and women's clothing and dress shirts; and provides mining instruction, ventilation analysis, safety and security, and rescue and relief training services. The company was formerly known as Mitsui Matsushima Co., Ltd. and changed its name to Mitsui Matsushima Holdings Co., Ltd. in 2018. Mitsui Matsushima Holdings Co., Ltd. was founded in 1913 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka",
        "zipcode": "810-8527",
        "website": "http://www.mitsui-matsushima.co.jp",
        "market_cap": 12668331008
    },
    "16Q.F": {
        "short_name": "CHINA QINFA GROUP  HD-,10",
        "long_name": "China Qinfa Group Limited",
        "summary": "China Qinfa Group Limited, an investment holding company, engages in the mining, purchase and sale, filtering, storage, blending, shipping, and transportation of coal in the People's Republic of China. The company operates through Coal Business and Shipping Transportation segments. As of December 31, 2019, the company owned and operated five coal mines. It is also involved in goods transportation and logistics, and charter hire activities. The company was founded in 1996 and is based in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.qinfagroup.com",
        "market_cap": 9468199
    },
    "1738.HK": {
        "short_name": "FS ANTHRACITE",
        "long_name": "Feishang Anthracite Resources Limited",
        "summary": "Feishang Anthracite Resources Limited, an investment holding company, produces anthracite coal in the People's Republic of China. It primarily engages in the acquisition, construction, and development of anthracite coal mines; and extraction, sale, and trade of anthracite coal. The company's mining assets consist of four underground anthracite coal mines in Guizhou province. It is also involved in the coal washing activities. The company was formerly known as Wealthy Year Limited. Feishang Anthracite Resources Limited was incorporated in 2010 and is based in Sheung Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": null,
        "website": "http://www.fsanthracite.com",
        "market_cap": 1504799616
    },
    "1878.HK": {
        "short_name": "SOUTHGOBI-S",
        "long_name": "SouthGobi Resources Ltd.",
        "summary": "SouthGobi Resources Ltd., together with its subsidiaries, operates as an integrated coal mining, development, and exploration company in Mongolia, Hong Kong, and China. It primarily explores for coking and thermal coal. The company's flagship project is the Ovoot Tolgoi open pit coal mine located in the Umnugobi Aimag of Mongolia. It also engages in the logistics and trading of coal in Mongolia and China. The company was formerly known as SouthGobi Energy Resources Ltd. and changed its name to SouthGobi Resources Ltd. in May 2010. SouthGobi Resources Ltd. was incorporated in 2002 and is based in Mong kok, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Mong Kok",
        "zipcode": null,
        "website": "http://www.southgobi.com",
        "market_cap": 1311218048
    },
    "1I8.F": {
        "short_name": "KIBO ENERGY PLC EO -,001",
        "long_name": "Kibo Energy PLC",
        "summary": "Kibo Energy PLC, together with its subsidiaries, explores for and develops energy projects in Sub Saharan Africa and the United Kingdom. The company holds a 100% interest in the Mbeya Coal to Power project located in Songwe Regio, Tanzania. It also holds an 85% interest in the Mabesekwa Coal Independent Power Project located in Botswana; and 65% interest in the Benga Power Plant Project located in the Tete province of Mozambique. In addition, the company owns a 100% interest in the Bordersley power plant located near Birmingham. Further, it engages in power generation and treasury businesses. Kibo Energy PLC has a collaboration agreement with ESS Tech Inc. to develop energy storage solutions. The company was formerly known as Kibo Mining Plc and changed its name to Kibo Energy PLC in July 2018. Kibo Energy PLC was founded in 2008 and is based in Galway, Ireland.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Galway",
        "zipcode": null,
        "website": "http://www.kibo.energy",
        "market_cap": 11103660
    },
    "35BN.F": {
        "short_name": "MORIEN RES CORP.",
        "long_name": "Morien Resources Corp.",
        "summary": "Morien Resources Corp., a mining development company, engages in the identification and purchase of mineral projects in Canada. The company holds royalty interests in the Donkin coal mine located in Cape Breton, Nova Scotia; and the Black Point aggregate project located in Guysborough County, Nova Scotia. Morien Resources Corp. is headquartered in Halifax, Canada.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "NS",
        "city": "Halifax",
        "zipcode": "B3J 3M8",
        "website": "http://morienres.com",
        "market_cap": 5896363
    },
    "3668.HK": {
        "short_name": "YANCOAL AUS",
        "long_name": "Yancoal Australia Ltd",
        "summary": "Yancoal Australia Ltd engages in the exploration, development, production, and marketing of metallurgical and thermal coal in Japan, Singapore, China, South Korea, Taiwan, Thailand, Australia, and internationally. It owns 95% interests in the Moolarben coal mine located in the Western Coalfields of New South Wales; 100% interests in the Stratford Duralie mines located within the New South Wales Gloucester Basin; 100% interests in the Yarrabee mine located to the northeast of Blackwater in Central Queensland's Bowen Basin; and 80% interests in the Mount Thorley mine and 84.5% interests in the Warkworth mine in the Hunter Valley region of New South Wales. It also manages six other projects in New South Wales, Queensland, and Western Australia. The company was founded in 2004 and is based in Sydney, Australia. Yancoal Australia Ltd is a subsidiary of Yanzhou Coal Mining Company Limited.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.yancoal.com.au",
        "market_cap": 16241528832
    },
    "3948.HK": {
        "short_name": "YITAI COAL",
        "long_name": "Inner Mongolia Yitai Coal Co., Ltd.",
        "summary": "Inner Mongolia Yitai Coal Co., Ltd. engages in the mining, production, transportation, and sale of coal products in the Inner Mongolia autonomous region of the People's Republic of China. It operates through three segments: Coal, Coal-Related Chemical, and Transportation. The company also provides road and railway transportation services to coal companies; coal-related chemical products and oil products; and disaster management, supply chain management, industrial development and consultation, business management consultation, and business information consultation services. In addition, it is involved in the coal mining; international trade; goods storage and loading; coal technology development; consultation; infrastructure municipal administration; research and development; oil and coal testing; fund investment and investment management; and chemical production and sale activities. The company was founded in 1997 and is headquartered in Ordos, the People's Republic of China. Inner Mongolia Yitai Coal Co.,Ltd. is a subsidiary of Inner Mongolia Yitai Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Ordos",
        "zipcode": "017000",
        "website": "http://www.yitaicoal.com",
        "market_cap": 4094027520
    },
    "3H3.F": {
        "short_name": "HIDILI INDUSTRY INTL DEV.",
        "long_name": "Hidili Industry International Development Limited",
        "summary": "Hidili Industry International Development Limited, an investment holding company, engages in the coal mining, and manufacture and sale of raw coal and clean coal in the People's Republic of China. It also provides clean coal washing services. The company was incorporated in 2006 and is headquartered in Panzhihua, the People's Republic of China. Hidili Industry International Development Limited is a subsidiary of Sanlian Investment Holding Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Panzhihua",
        "zipcode": "617000",
        "website": "http://www.hidili.com.cn",
        "market_cap": 48062824
    },
    "3IB.F": {
        "short_name": "INDO TAMBANGR.MEGA.RP 500",
        "long_name": "PT Indo Tambangraya Megah Tbk",
        "summary": "PT Indo Tambangraya Megah Tbk, together with its subsidiaries, engages in coal mining activities. The company operates seven mining concessions in the island of Kalimantan covering East, Central, and South Kalimantan. It also owns and operates the Bontang Coal Terminal/BoCT, three loading ports, and Bontang power plant. In addition, the company provides mining support, coal and fuel trading, coal transportation, and alternative energy marketing and support services, as well as engages in electricity generation activity. It primarily sells its coal in Indonesia, India, Pakistan, Taiwan, China, Hong Kong, Korea, Japan, Europe, Australia, and other parts of Southeast Asia. The company was founded in 1987 and is headquartered in South Jakarta, Indonesia. PT Indo Tambangraya Megah Tbk is a subsidiary of Banpu Minerals (Singapore) Pte. Ltd.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12310",
        "website": "http://www.itmg.co.id",
        "market_cap": 967356032
    },
    "41H.SI": {
        "short_name": "$ BlackGoldNatural",
        "long_name": "BlackGold Natural Resources Limited",
        "summary": "BlackGold Natural Resources Limited, an investment holding company, engages in the exploration and mining of coal in Indonesia. The company holds interest in PT Samantaka Batubara concession covering an area of approximately 15,000 hectares located in Riau, Sumatra. It focuses on supplying coal to power plants located in Riau. BlackGold Natural Resources Limited is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "038987",
        "website": "http://www.blackgold-group.com",
        "market_cap": 18307440
    },
    "44H.F": {
        "short_name": "HARUM ENERGY TBK  RP 100",
        "long_name": "PT Harum Energy Tbk",
        "summary": "PT Harum Energy Tbk, together with its subsidiaries, engages in coal mining and logistics activities in Indonesia. It operates through Coal Mining Sectors, Shipping Services, and Others Sectors divisions. The Coal Mining Sectors division is involved in the general survey, exploration, exploitation, transportation, processing, and sale of coal. The Shipping Services division engages in the transportation and rental of tugboats and barges. The Others Sectors division invests in coal mining, trading, and services businesses. The company also exports its products to China, South Korea, Japan, Taiwan, Hong Kong, India, Bangladesh, Thailand, the Philippines, Singapore, and Vietnam. The company was formerly known as PT Asia Antrasit and changed its name to PT Harum Energy Tbk in November 2007. The company was founded in 1995 and is headquartered in Central Jakarta, Indonesia. PT Harum Energy Tbk is a subsidiary of PT Karunia Bara Perkasa.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Central Jakarta",
        "zipcode": "10310",
        "website": "http://www.harumenergy.com",
        "market_cap": 819821952
    },
    "4OK.F": {
        "short_name": "NUCOAL RESOURCES LTD",
        "long_name": "NuCoal Resources Limited",
        "summary": "NuCoal Resources Limited explores for coal mines in Australia. The company holds a 100% interest in the Savoy Hill Coal project located in New South Wales. NuCoal Resources Limited was incorporated in 1993 and is based in Newcastle, Australia.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Newcastle",
        "zipcode": "2300",
        "website": "http://nucoal.com.au",
        "market_cap": 5935350
    },
    "5UN.SI": {
        "short_name": "$ Sincap",
        "long_name": "Sincap Group Limited",
        "summary": "Sincap Group Limited, an investment holding company, engages in the trading of thermal coal in Singapore. The company operates through two segments, Coal Products; and Property Development and Investment. It also develops and invests in properties, as well as provides logistic management services. The company was founded in 1999 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048624",
        "website": "http://www.sincapgroup.com.sg",
        "market_cap": 8504999
    },
    "600121.SS": {
        "short_name": "ZHENGZHOU COAL INDUSTRY & ELECT",
        "long_name": "Zhengzhou Coal Industry & Electric Power Co., Ltd.",
        "summary": "Zhengzhou Coal Industry & Electric Power Co., Ltd. produces and sells coal in China. The company offers lean coal and anthracite for use as industrial power coal. It is also involved in material marketing and supply, power generation, power transmission and transformation, railway transport, and other businesses. The company is based in Zhengzhou, China. Zhengzhou Coal Industry & Electric Power Co., Ltd. operates as a subsidiary of Zhengzhou Coal Industry(Group)Co.,Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": "450007",
        "website": "http://www.zzce.com.cn",
        "market_cap": 7164250624
    },
    "600123.SS": {
        "short_name": "SHANXI LANHUA SCI-TECH VENTURE",
        "long_name": "Shanxi Lanhua Sci-Tech Venture Co.,Ltd",
        "summary": "Shanxi Lanhua Sci-Tech Venture Co.,Ltd engages in the production and sale of coal. It also offers chemical products comprising urea, fertilizer products, caprolactam products, dimethyl ether, and methanol. Shanxi Lanhua Sci-Tech Venture Co.,Ltd was founded in 1998 and is based in Jincheng, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jincheng",
        "zipcode": "048000",
        "website": "http://www.chinalanhua.com",
        "market_cap": 10510080000
    },
    "600157.SS": {
        "short_name": "WINTIME ENERGY CO LTD",
        "long_name": "Wintime Energy Co.,Ltd.",
        "summary": "Wintime Energy Co.,Ltd., an integrated energy company, engages in the power, coal, and petrochemical businesses in China. It mines and produces coking coal; generates power; and provides petrochemical products. The company has an electric power installed capacity of 12.41 million kilowatts. It is also involved in the blending and processing of fuel oil; storage and trading of petrochemical products; development of terminals; and operation and management business. The company was formerly known as Thai An Lurun Corporation and changed its name to Wintime Energy Co.,Ltd. in October 2010. Wintime Energy Co.,Ltd. was founded in 1992 and is headquartered in Taiyuan, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taiyuan",
        "zipcode": "030006",
        "website": "http://www.wtecl.com",
        "market_cap": 36215013376
    },
    "600188.SS": {
        "short_name": "YANZHOU COAL MINING COMPANY LIM",
        "long_name": "Yanzhou Coal Mining Company Limited",
        "summary": "Yanzhou Coal Mining Company Limited primarily engages in the mining, preparation, and sale of coal in China and internationally. It offers thermal, PCI, and coking coal for electric power, metallurgy and chemical industry, etc.; produces and sells coal chemicals, including methanol, liquid wax, stable light hydrocarbon, acetic acid, ethyl acetate, etc., as well as electricity and related heat supply services; and explores for potash mineral. The company also manufactures, installs, repairs, and sells coal mining and excavating equipment, cable, and electrical equipment. In addition, it provides railway, river, and lakes transportation services; and sells construction materials. Further, the company is involved in the wholesale of coal and non-ferrous metals; house and financial leasing; logistics storage and leasing; development of charcoal products; LTCC technology development and equipment rental operations; manufacturing and sale of cable and rubber products; and production and processing of steel engineering components. Additionally, it provides underground mines management; mining materials testing; equity investment fund and corporate asset management, investment advisory and management, foreign investment fund, import and export, and international trading; solar and wind power, and production management; educational software development and event planning; and coal mining technology development, transfer, and consultation services. The company is also involved in the processing, production, and sale of FischerTropsch synthesis catalyst, composite pipe, and plastic profile products; provision of real estate development and operation, property management, garden greening engineering, and sewage treatment and rental housing agency services; and issuing subordinated capital notes. The company was founded in 1973 and is based in Zoucheng, the People's Republic of China. Yanzhou Coal Mining Company Limited is a subsidiary of Yankuang Group Corporation Limited.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zoucheng",
        "zipcode": "273500",
        "website": "http://www.yanzhoucoal.com.cn",
        "market_cap": 60937420800
    },
    "600348.SS": {
        "short_name": "SHAN XI HUA YANG GROUP NEW ENER",
        "long_name": "Shan Xi Huayang Group New Energy Co.,Ltd.",
        "summary": "Shan Xi Huayang Group New Energy Co.,Ltd. operates in the coal mining industry. The company is involved in the production, washing and processing, and sale of coal; production and sale of electricity; production and sale of thermal energy; road general cargo transportation; equipment leasing; and construction machinery accessories businesses. Its coal products are used in electricity, fertilizer, metallurgy, machinery, building materials, and other industries. The company was formerly known as Yangquan Coal Industry (Group) Co., Ltd. and changed its name to Shan Xi Huayang Group New Energy Co.,Ltd. in January 2021. Shan Xi Huayang Group New Energy Co.,Ltd. was founded in 1999 and is based in Yangquan, China. Shan Xi Huayang Group New Energy Co.,Ltd. is a subsidiary of Shanxi State-Owned Capital Investment and Operation Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yangquan",
        "zipcode": null,
        "website": "http://www.yqmy.ymjt.com.cn",
        "market_cap": 16714748928
    },
    "600381.SS": {
        "short_name": "QINGHAI SPRING MEDICINAL RESOUR",
        "long_name": "Qinghai Spring Medicinal Resources Technology Co., Ltd.",
        "summary": "Qinghai Spring Medicinal Resources Technology Co., Ltd. explores and develops natural medicinal resources on the Qinghai-Tibet Plateau. It provides polar and Herborist grass 5X cordyceps sinensis series of products, and cordyceps sinensis pure powder tablets. The company was founded in 2003 and is based in Xining, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xining",
        "zipcode": "810007",
        "website": "http://www.verygrass.com",
        "market_cap": 4643652608
    },
    "600395.SS": {
        "short_name": "GUIZHOU PANJIANG REFINED COAL",
        "long_name": "Guizhou Panjiang Refined Coal Co.,Ltd.",
        "summary": "Guizhou Panjiang Refined Coal Co.,Ltd. engages in mining, processing, and selling of coal in China and internationally. The company offers coking coal, injection coal, etc. for use in the iron and steel chemical industry; and thermal coal for power supply, cement, and other industries. It also engages in the manufacture and repair of mechanical and electrical products; production and sale of electricity through coal; equipment rental and repair activities; installation, recovery, and maintenance of mining and excavation equipment; and inspection and experiment of industrial equipment. In addition, the company is involved in the leasing and sale of real estate; property management; heat supplies; hotel operation and management activities; and construction and maintenance of underground anti-well engineering projects and power supply lines. Further, it undertakes forest leisure health and vacation projects, woodland edible fungus planting projects, ecological breeding projects, etc.; and provides real estate intermediary, contract repair, technical and skill training, training financial handling and financing advisory, credit verification and related consulting, and insurance agency services, as well as support products for mine shafts. The company is based in Liupanshui, China. Guizhou Panjiang Refined Coal Co.,Ltd. is a subsidiary of GuiZhou PanJiang Investment Holdings (Group) Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Liupanshui",
        "zipcode": "553536",
        "website": "http://www.pjgf.cn",
        "market_cap": 12644581376
    },
    "600403.SS": {
        "short_name": "HENAN DAYOU ENERGY CO LTD",
        "long_name": "Henan Dayou Energy Co., Ltd",
        "summary": "Henan Dayou Energy Co., Ltd. engages in raw coal mining activities in China. The company is involved in mining, washing, processing, and wholesale of coal. It offers long flame, coking, lean, and cleaned coal for use in various industries, including chemical, power generation, building material, and other industries, as well as in industrial boilers and coking coal. The company was formerly known as Nanjing Xinwang Telecom Tech Co.,Ltd and changed its name to Henan Dayou Energy Co., Ltd. in 2010. Henan Dayou Energy Co., Ltd. was founded in 1998 and is based in Yima, China. Henan Dayou Energy Co., Ltd. is a subsidiary of Yima Coal Industry Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yima",
        "zipcode": "472300",
        "website": "http://hndayou.com.cn",
        "market_cap": 8535192064
    },
    "600508.SS": {
        "short_name": "SHANGHAI DATUN ENERGY RESOURCES",
        "long_name": "Shanghai Datun Energy Resources Co., Ltd.",
        "summary": "Shanghai Datun Energy Resources Co., Ltd. engages in the production and sale of coal primarily in China. The company offers coking coal, gas coal, gas fat coal, clean coal, washed and mixed medium block, mixed coal, and power clean coal. It also produces electricity; and provides aluminum ingots, aluminum rods, aluminum sheets, aluminum profiles, and anode carbon, as well as operates railway line for coal and passenger transportation. The company was founded in 1999 and is based in Shanghai, China. Shanghai Datun Energy Resources Co., Ltd. is a subsidiary of China Coal Energy Company Limited.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.sdtny.com",
        "market_cap": 7234407424
    },
    "600971.SS": {
        "short_name": "ANHUI HENGYUAN COAL INDUSTRY&EL",
        "long_name": "Anhui Hengyuan Coal-Electricity Group Co., Ltd.",
        "summary": "Anhui Hengyuan Coal-Electricity Group Co., Ltd. engages in mining, processing, washing, and sale of coal in China. It offers lean coal, 1/3 coking coal, gas fat coal, anthracite coal, and coking coal, which are used in electric power, metallurgy, petrochemical, building materials, coking, blast furnace injection, civil use, etc. The company is based in Huaibei City, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huaibei City",
        "zipcode": "234000",
        "website": "http://www.ahhymd.com.cn",
        "market_cap": 8267999744
    },
    "601001.SS": {
        "short_name": "JINNENG HOLDING SHANXI COAL IND",
        "long_name": "Jinneng Holding Shanxi Coal Industry Co.,ltd.",
        "summary": "Jinneng Holding Shanxi Coal Industry Co.,ltd., together with its subsidiaries, engages in the mining, washing, processing, production, and sale of coal products in China. The company also exports its products. It serves various industries, including electric power, metallurgical, etc. The company was founded in 2001 and is based in Datong, China.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Datong",
        "zipcode": "037003",
        "website": "http://www.dtcoalmine.com",
        "market_cap": 14075816960
    },
    "601088.SS": {
        "short_name": "CHINA SHENHUA ENERGY COMPANY LT",
        "long_name": "China Shenhua Energy Company Limited",
        "summary": "China Shenhua Energy Company Limited and its subsidiaries engage in the production and sales of coal and power; railway, port, and shipping transportation; and coal-to-olefins businesses in the People's Republic of China and internationally. The company's Coal segment produces coal from surface and underground mines; and sells coal to power plants, metallurgical and coal chemical producers, and provincial/regional electric grid companies. As of December 31, 2020, this segment had the recoverable coal reserves of 14.42 billion tones. Its Power segment generates and sells electric power to power grid companies. This segment generates electric power through coal, thermal, wind, water, and gas. The company's Railway segment provides railway transportation services. Its Port segment offers loading, transportation, and storage services. The company's Shipping segment provides shipment transportation services. Its Coal Chemical segment produces and sells methanol; and polyethylene and polypropylene, as well as other by-products. The company was incorporated in 2004 and is based in Beijing, China. China Shenhua Energy Company Limited is a subsidiary of China Energy Investment Corporation Limited.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100011",
        "website": "http://www.csec.com",
        "market_cap": 385428291584
    },
    "601101.SS": {
        "short_name": "BEIJING HAOHUA ENERGY RESOURCE ",
        "long_name": "Beijing Haohua Energy Resource Co., Ltd.",
        "summary": "Beijing Haohua Energy Resource Co., Ltd. engages in the mining, washing, processing, export, and sale of coal in China. It offers anthracite and thermal coal. The company provides anthracite coal for use in metallurgy, electric power, chemical industry, etc. Beijing Haohua Energy Resource Co., Ltd. was founded in 2002 and is based in Beijing, China. Beijing Haohua Energy Resource Co., Ltd. is a subsidiary of Beijing Energy Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102300",
        "website": "http://www.bjhhny.com",
        "market_cap": 6816000000
    },
    "601225.SS": {
        "short_name": "SHAANXI COAL INDUSTRY",
        "long_name": "Shaanxi Coal Industry Company Limited",
        "summary": "Shaanxi Coal Industry Company Limited, together with its subsidiaries, mines, produces, washes, processes, and sells coal in China and internationally. It primarily explores for power, chemical, and metallurgical coal. The company has coal reserves of 16.433 billion tons; and recoverable reserves of 10.269 billion tons. Its coal properties are primarily located in Northern Shaanxi and Huanghua. It markets its products under the Huangling, Huangling No.1, Yuhua, and Hongliulin brand names. The company was founded in 2008 and is based in Xi'an, China. Shaanxi Coal Industry Company Limited is a subsidiary of Shaanxi Coal and Chemical Industry Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710077",
        "website": "http://www.shxcoal.com",
        "market_cap": 126800003072
    },
    "601666.SS": {
        "short_name": "PINGDINGSHAN TIANAN COAL MINING",
        "long_name": "Pingdingshan Tianan Coal. Mining Co., Ltd.",
        "summary": "Pingdingshan Tianan Coal. Mining Co., Ltd. engages in the mining, washing, processing, and sale of coal in China. It offers coking, fat, thermal, and smelted refined coal. The company was incorporated in 1998 and is based in Pingdingshan, China. Pingdingshan Tianan Coal. Mining Co., Ltd. is a subsidiary of China Pingmei Shenma Energy Chemical Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Pingdingshan",
        "zipcode": null,
        "website": "http://www.pmta.com.cn",
        "market_cap": 17356744704
    },
    "601699.SS": {
        "short_name": "SHANXI LU'AN ENV.ENERGY DEV.CO.",
        "long_name": "Shanxi Lu'an Environmental Energy Development Co., Ltd.",
        "summary": "Shanxi Lu'an Environmental Energy Development Co., Ltd. engages in raw coal mining, coal washing, and coal coke smelting for power generation, power, coking, and steel industries. It develops and utilizes clean coal technology; develops coalbed methane; and offers thermal coal, blended coal, clean coal, injection coal, and mixed coal. The company has production mines in Wuyang Coal Mine, Zhangcun Coal Mine, Wangzhuang Coal Mine, and Changcun Coal Mine. The company was founded in 2001 and is based in Changzhi, China. Shanxi Lu'an Environmental Energy Development Co., Ltd. is a subsidiary of Shanxi Lu'an Mining Industry (Group) Company Limited.",
        "currency": "CNY",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhi",
        "zipcode": "046204",
        "website": "http://www.luanhn.com",
        "market_cap": 37931077632
    },
    "8203.HK": {
        "short_name": "KAISUN HOLDINGS",
        "long_name": "Kaisun Holdings Limited",
        "summary": "Kaisun Holdings Limited, an investment holding company, engages in the mining, exploitation, processing, production, and sale of coal. It operates through coal mining business, consulting and media service business, and corporate and investment business segments. The company mines for thermal coal. It also provides supply chain management services for the mineral business; produces mining and metallurgical machineries; trades in securities; and manufactures coal mining related equipment. In addition, the company engages in the provision of corporate, consulting, logistics, advertising and public relationship event, media, and trust and trustee services; and e-sport, and financial lease and general trading businesses. It has operations in Hong Kong, rest of the People's Republic of China, Taiwan, Australia, Vietnam, Dubai, and internationally. The company was formerly known as Kaisun Energy Group Limited and changed its name to Kaisun Holdings Limited in July 2018. Kaisun Holdings Limited was incorporated in 2002 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://kaisun.hk",
        "market_cap": 74953576
    },
    "900948.SS": {
        "short_name": "INNER MONGOLIA YITAI COAL",
        "long_name": "Inner Mongolia Yitai Coal Co., Ltd.",
        "summary": "Inner Mongolia Yitai Coal Co., Ltd. engages in the mining, production, transportation, and sale of coal products in the Inner Mongolia autonomous region of the People's Republic of China. It operates through three segments: Coal, Coal-Related Chemical, and Transportation. The company also provides road and railway transportation services to coal companies; coal-related chemical products and oil products; and disaster management, supply chain management, industrial development and consultation, business management consultation, and business information consultation services. In addition, it is involved in the coal mining; international trade; goods storage and loading; coal technology development; consultation; infrastructure municipal administration; research and development; oil and coal testing; fund investment and investment management; and chemical production and sale activities. The company was founded in 1997 and is headquartered in Ordos, the People's Republic of China. Inner Mongolia Yitai Coal Co.,Ltd. is a subsidiary of Inner Mongolia Yitai Group Co., Ltd.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ordos",
        "zipcode": "017000",
        "website": "http://www.yitaicoal.com",
        "market_cap": 3306950400
    },
    "9NE.F": {
        "short_name": "NCONDEZI ENERGY LTD.",
        "long_name": "Ncondezi Energy Limited",
        "summary": "Ncondezi Energy Limited, a power development company, focuses on the phased development of integrated thermal coal mine and power plant project in Mozambique. The company develops a 300MW integrated power plant and mine to produce and supply electricity to the Mozambican market. It also explores and develops coal mine. The company owns a 100% interest in the Ncondezi Project located in Tete province of Northern Mozambique. The company was formerly known as Ncondezi Coal Company Limited and changed its name to Ncondezi Energy Limited in July 2013. Ncondezi Energy Limited was incorporated in 2006 and is based in Road Town, the British Virgin Islands.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "British Virgin Islands",
        "state": null,
        "city": "Road Town",
        "zipcode": null,
        "website": "http://www.ncondezienergy.com",
        "market_cap": 11121581
    },
    "A64.F": {
        "short_name": "ADARO ENERGY TBK  RP 100",
        "long_name": "PT Adaro Energy Tbk",
        "summary": "PT Adaro Energy Tbk, together with its subsidiaries, operates as an integrated coal mining and energy company in Indonesia. It operates through Coal Mining and Trading; Mining Services; Logistics; and Others segments. The company provides coal mining and trading, mining contracting, quarrying, mining support services, warehousing, coal barging and ship loading, channel dredging and maintenance, stevedoring, port services, forestry, power generation, and water and mud treatment services; and coal handling and barging, terminal handling, farming, trading, power plant, and construction services, as well as repair and installation of machines; manufactures, repairs, and maintains sea transportation; and treats mine water into potable water. It also exports its products to China, Malaysia, Japan, India, South Korea, and internationally. The company was formerly known as PT Padang Karunia and changed its name to PT Adaro Energy Tbk in April 2008. PT Adaro Energy Tbk was founded in 2004 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12950",
        "website": "http://www.adaro.com",
        "market_cap": 2476118272
    },
    "ABMM.JK": {
        "short_name": "ABM Investama Tbk.",
        "long_name": "PT ABM Investama Tbk",
        "summary": "PT ABM Investama Tbk operates in the energy resources, energy services, and energy infrastructure sectors in Indonesia. It operates in three segments: Mining Contractors and Coal Mining, Services, and Fabrication. The company owns coal mining concessions; supplies fuel for mining process; and supports engineered product and manufacturing services for mining activities. It offers port management services, which include technical and operational management services for handling, storing, loading and unloading operations; stevedoring and seaport services; floating crane, harbor tug, tug boat, and transshipment logistics services; warehousing management solutions for storage, inventory management, and distribution; freight management services; transportation management services for overweight and oversized items, such as transportation of heavy equipment, machinery, factory equipment, and power plants; integrated logistics and material management services for resource and energy industry, including drilling, exploration, and production activities. It also provides business management consulting services, including planning and designing the framework of developing business management in mining, energy, engineering, industry, oil, gas and geothermal energy, energy resources, and other consulting services; and rents offices and residential areas, as well as heavy equipment in mining and other industries. In addition, the company engages in the trade of petroleum; provides electricity solutions; manufactures equipment for heavy equipment and material transportation; and produces low calorific thermal coal. The company was formerly known as PT Adiratna Bani Makmur and changed its name to PT ABM Investama Tbk in August 2009. The company was founded in 2006 and is based in South Jakarta, Indonesia. PT ABM Investama Tbk is a subsidiary of Valle Verde Pte. Ltd.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12560",
        "website": "http://www.abm-investama.com",
        "market_cap": 2353960321024
    },
    "ADANIENT.NS": {
        "short_name": "ADANI ENTERPRISES",
        "long_name": "Adani Enterprises Limited",
        "summary": "Adani Enterprises Limited, together with its subsidiaries, engages in the coal trading, coal mining, oil and gas exploration, ports, multi-modal logistics, power generation and transmission, gas distribution, and edible oil and agro commodities businesses in India and internationally. The company trades in coal; offers bunkering and integrated coal management services; imports fruits, apple, pear, kiwi, oranges, and grapes; and markets its apple under the FARM-PIK brand, as well as food grains. It is also involved in the mining, processing, acquisition, exploration, and development of various coal properties, including Parsa East and Kanta Basan coal block, Kente Extension coal block, Parsa coal block, and Jitpur coal block; a coal mining concession in Indonesia; and the Carmichael Coal mine in the Galilee Basin in Queensland, Australia, as well as solar PV manufacturing business. In addition, company offers edible oils, basmati rice, pulses, soya chunks, and besan and atta, as well as lauric and bakery fats, castor oil derivatives, oleo chemicals, and soya value added products under the Fortune, King's, Bullet, Raag, Avsar, Pilaf, Jubilee, Fryola, Alpha, and Aadhar brands. Further, it manufactures fighter aircraft, unmanned aerial systems, and helicopters; develops avionics and systems, aero structures and components, aerospace composites, and radar and electronic warfare systems, as well as constructs rail transit systems; and engages in the mining of minerals and ores activities. The company was founded in 1988 and is based in Ahmedabad, India. Adani Enterprises Limited is a subsidiary of S.B. Adani Family Trust.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "382421",
        "website": "http://www.adanienterprises.com",
        "market_cap": 1761039220736
    },
    "ADOOY": {
        "short_name": "ADARO ENERGY TBK",
        "long_name": "PT Adaro Energy Tbk",
        "summary": "PT Adaro Energy Tbk, together with its subsidiaries, operates as an integrated coal mining and energy company in Indonesia. It operates through Coal Mining and Trading; Mining Services; Logistics; and Others segments. The company provides coal mining and trading, mining contracting, quarrying, mining support services, warehousing, coal barging and ship loading, channel dredging and maintenance, stevedoring, port services, forestry, power generation, and water and mud treatment services; and coal handling and barging, terminal handling, farming, trading, power plant, and construction services, as well as repair and installation of machines; manufactures, repairs, and maintains sea transportation; and treats mine water into potable water. It also exports its products to China, Malaysia, Japan, India, South Korea, and internationally. The company was formerly known as PT Padang Karunia and changed its name to PT Adaro Energy Tbk in April 2008. PT Adaro Energy Tbk was founded in 2004 and is headquartered in Jakarta, Indonesia.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12950",
        "website": "http://www.adaro.com",
        "market_cap": 2715533568
    },
    "ADRO.JK": {
        "short_name": "Adaro Energy Tbk.",
        "long_name": "PT Adaro Energy Tbk",
        "summary": "PT Adaro Energy Tbk, together with its subsidiaries, operates as an integrated coal mining and energy company in Indonesia. It operates through Coal Mining and Trading; Mining Services; Logistics; and Others segments. The company provides coal mining and trading, mining contracting, quarrying, mining support services, warehousing, coal barging and ship loading, channel dredging and maintenance, stevedoring, port services, forestry, power generation, and water and mud treatment services; and coal handling and barging, terminal handling, farming, trading, power plant, and construction services, as well as repair and installation of machines; manufactures, repairs, and maintains sea transportation; and treats mine water into potable water. It also exports its products to China, Malaysia, Japan, India, South Korea, and internationally. The company was formerly known as PT Padang Karunia and changed its name to PT Adaro Energy Tbk in April 2008. PT Adaro Energy Tbk was founded in 2004 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12950",
        "website": "http://www.adaro.com",
        "market_cap": 42061587808256
    },
    "AEXE": {
        "short_name": "AIM EXPLORATION INC",
        "long_name": "Aim Exploration Inc.",
        "summary": "AIM Exploration Inc., an exploration stage company, engages in the acquisition and exploration of mineral properties. It also holds interests in three anthracite coal mining concessions located in the Province of Otuzco, Peru. The company was founded in 2010 and is headquartered in Henderson, Nevada.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Henderson",
        "zipcode": "89012",
        "website": "http://www.aimexploration.com",
        "market_cap": 291511
    },
    "AFR.AX": {
        "short_name": "AFRICAN EN CDI 1:1",
        "long_name": "African Energy Resources Limited",
        "summary": "African Energy Resources Limited develops various power projects in Botswana. The company operates through Coal-fired Power Projects and Power Investments segments. The company holds interests in Mmamantswe coal project and Mmamabula West coal project. African Energy Resources Limited was incorporated in 2006 and is based in St Martin, Guernsey.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Guernsey",
        "state": null,
        "city": "St Martin",
        "zipcode": "GY1 3RS",
        "website": "http://www.africanenergyresources.com",
        "market_cap": 14621249
    },
    "AGE.BK": {
        "short_name": "ASIA GREEN ENERGY PUBLIC COMPAN",
        "long_name": "Asia Green Energy Public Company Limited",
        "summary": "Asia Green Energy Public Company Limited engages in the distribution of coal for industrial use in Thailand. It also provides transportation and management, water transportation and port, and cargo services, as well as consultancy services for coal extraction and water transportation. In addition, the company generates and supplies electricity; and distributes fuel. It also imports and exports coal. It serves power plants, steel plants, cement plants, and paper factories; and industrial factories relating to textile, food, rubber, and alternative energy products. The company exports coal to China, India, Vietnam, and Taiwan. Asia Green Energy Public Company Limited was founded in 2004 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10150",
        "website": "http://www.agecoal.com",
        "market_cap": 3828900352
    },
    "AIMS.JK": {
        "short_name": "Akbar Indo Makmur Stimec Tbk",
        "long_name": "PT Akbar Indo Makmur Stimec Tbk",
        "summary": "PT Akbar Indo Makmur Stimec Tbk engages in the coal mining and trading business in Indonesia. The company was founded in 1957 and is headquartered in South Jakarta, Indonesia. PT Akbar Indo Makmur Stimec Tbk is a subsidiary of PT Aims Indo Investama.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12170",
        "website": "http://www.aims.co.id",
        "market_cap": 105159999488
    },
    "AQC.AX": {
        "short_name": "AUSPACCOAL FPO",
        "long_name": "Australian Pacific Coal Limited",
        "summary": "Australian Pacific Coal Limited acquires, explores for, develops, and produces thermal and metallurgical coal prospects in Australia. The company primarily holds interests in the Dartbrook project covering a total of 3,268 hectares located in the coal region of the Hunter Valley, New South Wales; and various coal tenements in the Bowen, Surat, Galilee, and Clarence-Moreton basins, Queensland. Australian Pacific Coal Limited is headquartered in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.aqcltd.com",
        "market_cap": 7292250
    },
    "AR9.F": {
        "short_name": "NAN NAN RES ENTERPR.HD-10",
        "long_name": "Nan Nan Resources Enterprise Limited",
        "summary": "Nan Nan Resources Enterprise Limited, an investment holding company, mines, sells, and distributes coal in the People's Republic of China, Hong Kong, Singapore, the United Kingdom, and Malaysia. The company operates through three segments: Coal Mining Business, Renewable Energy Business, and Information Technology Services Business. It owns mining right in the Kaiyuan Open Pit Coal Mine and an exploration right in the Zexu Open Pit Coal Mine in Xinjiang. The company also provides renewable energy solutions and solar farm development services in Malaysia. In addition, it provides information technology outsourcing, consultancy, and technical services in Hong Kong. The company was formerly known as International Resources Enterprise Limited and changed its name to Nan Nan Resources Enterprise Limited in September 2011. Nan Nan Resources Enterprise Limited was incorporated in 1995 and is headquartered in Admiralty, Hong Kong. Nan Nan Resources Enterprise Limited is a subsidiary of Ascent Goal Investments Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.nannanlisted.com",
        "market_cap": 9341841
    },
    "ARCH": {
        "short_name": "Arch Resources, Inc.",
        "long_name": "Arch Resources, Inc.",
        "summary": "Arch Resources, Inc. produces and sells thermal and metallurgical coal from surface and underground mines. As of December 31, 2020, the company operated seven active mines. It also owned or controlled primarily through long-term leases approximately 28,292 acres of coal land in Ohio; 1,060 acres of coal land in Maryland; 10,095 acres of coal land in Virginia; 306,253 acres of coal land in West Virginia; 81,470 acres of coal land in Wyoming; 234,437 acres of coal land in Illinois; 33,047 acres of coal land in Kentucky; 403 acres of coal land in Montana; 358 acres of coal land in Pennsylvania; and 19,146 acres of coal land in Colorado, as well as smaller parcels of property in Alabama, Indiana, Washington, Arkansas, California, Utah, and Texas. The company sells its products to utility, industrial, and steel producers in the United States, Europe, Asia, Central and South America, and Africa. The company was formerly known as Arch Coal, Inc. and changed its name to Arch Resources, Inc. in May 2020. Arch Resources, Inc. was founded in 1969 and is headquartered in St. Louis, Missouri.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MO",
        "city": "Saint Louis",
        "zipcode": "63141",
        "website": "http://www.archrsc.com",
        "market_cap": 817775552
    },
    "ARI.F": {
        "short_name": "INTRA ENERGY CORP. LTD",
        "long_name": "Intra Energy Corporation Limited",
        "summary": "Intra Energy Corporation Limited, a mining and energy company, primarily engages in the exploration, production, sale, and supply of coal in Eastern Africa. The company's flagship project is the Tancoal mine located in the Ngaka Coalfields, Tanzania. It is also involved in the exploration and development of the Minas Do Lurio gold project comprising 168.56 square kilometers of prospecting license located in the LÃºrio Belt, Mozambique. The company was formerly known as Atomic Resources Limited and changed its name to Intra Energy Corporation Limited in April 2011. Intra Energy Corporation Limited was founded in 2007 and is headquartered in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.intraenergycorp.com.au",
        "market_cap": 2297736
    },
    "ARII.JK": {
        "short_name": "Atlas Resources Tbk.",
        "long_name": "PT Atlas Resources Tbk",
        "summary": "PT Atlas Resources Tbk, together with its subsidiaries, engages in the mining, exploration, development, production, and sale of coal primarily in Indonesia and internationally. It produces a range of low to high calorific value thermal coal, as well as metallurgical coal for use in steel production, power generation, cement, and general manufacturing. The company holds various mining concessions covering a total area of approximately 200,000 hectares in Indonesia. In addition, it is involved in trading, services, construction, transportation, printing, industrial, logistics, investment, and agricultural activities. Further, the company operates workshops. The company was founded in 2007 and is based in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12930",
        "website": "http://www.atlas-coal.co.id",
        "market_cap": 888000020480
    },
    "ARLP": {
        "short_name": "Alliance Resource Partners, L.P",
        "long_name": "Alliance Resource Partners, L.P.",
        "summary": "Alliance Resource Partners, L.P., a diversified natural resource company, produces and markets coal primarily to utilities and industrial users in the United States. The company operates through three segments: Illinois Basin, Appalachia, and Minerals. It produces a range of thermal and metallurgical coal with sulfur and heat contents. The also company operates seven underground mining complexes in Illinois, Indiana, Kentucky, Maryland, and West Virginia. Further, it leases land and operates a coal loading terminal on the Ohio River at Mt. Vernon, Indiana; and buys and resells coal, as well as owns interests in various oil and gas mineral interests located within producing basins in the continental United States. In addition, the company offers various industrial and mining technology products and services, such as miner and equipment tracking systems, and proximity detection systems. As of December 31, 2020, it had approximately 1.65 billion tons of proven and probable coal reserves in Illinois, Indiana, Kentucky, Maryland, Pennsylvania, and West Virginia. The company was founded in 1971 and is headquartered in Tulsa, Oklahoma.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "OK",
        "city": "Tulsa",
        "zipcode": "74119",
        "website": "http://www.arlp.com",
        "market_cap": 742818816
    },
    "AUE.SI": {
        "short_name": "Golden Energy",
        "long_name": "Golden Energy and Resources Limited",
        "summary": "Golden Energy and Resources Limited, an investment holding company, engages in the exploration, mining, marketing, and trading of thermal coal. The company operates through Energy Coal, Metallurgical Coal, and Non-Coal Business segments. It holds interests in five coal mining concession areas that covers an area of approximately 66,204 hectares located in South Kalimantan, Central Kalimantan, Jambi, and South Sumatra Basin in Indonesia; and owns forestry concession rights of 265,095 hectares in Kalimantan, as well also owns the rights to mine approximately 2.9 billion tonnes of thermal coal resources with coal reserves of approximately 1.0 billion tonnes. The company also holds interest in 6 development mines to mine approximately 1.7 billion tonnes of energy coal resources with coal reserves of approximately 130 million tonnes in Australia. In addition, it offers management consultancy services. The company is also engaged in mining of gold. Golden Energy and Resources Limited operates in China, Indonesia, India, South Korea, Spain, and internationally. The company is based in Singapore. Golden Energy and Resources Limited is a subsidiary of PT Dian Swastatika Sentosa Tbk.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049705",
        "website": "http://www.gear.com.sg",
        "market_cap": 423558016
    },
    "AUH.AX": {
        "short_name": "AUSTCHINA FPO",
        "long_name": "AustChina Holdings Limited",
        "summary": "AustChina Holdings Limited engages in the exploration of coal properties in Australia. It holds 100% interests in two coal exploration permits, including the Barcoo River-Blackall Rail and Blackall South Corner Coal projects located in Central Queensland. The company was formerly known as Coalbank Limited and changed its name to AustChina Holdings Limited in August 2017. The company was founded in 1996 and is based in Brisbane, Australia. AustChina Holdings Limited is a subsidiary of Treasure Wheel Global Limited.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://austchinaholdings.com",
        "market_cap": 10894140
    },
    "BANPU-R.BK": {
        "short_name": "BANPU PUBLIC COMPANY LIMITED",
        "long_name": "Banpu Public Company Limited",
        "summary": "Banpu Public Company Limited engages in the coal mining and power businesses. It holds an interest in a 1,434 MW coal-fired power plant in Map Ta Phut Industrial Estate, Rayong Province, Thailand. The company also manages five coal mines in Kalimantan comprising Indominco, Jorong, Kitadin-Embalut, Trubaindo, and Bharinto, which produce a range of bituminous and sub-bituminous thermal coals in Indonesia. In addition, it operates the Gaohe mine in Shanxi Province and Hebi mine in Henan Province; operates and manages 3 coal-fired combined heat and power plants with a capacity of 539 megawatts in China; and owns 10 coal mines located in New South Wales, Australia. Further, the company operates various coal project in Mongolia; thermal power plants in Lao PDR; wind farm in Vietnam; and solar farms in Japan. Additionally, it provides solar rooftop solutions and installation for industries and large businesses; energy storage solutions; electric vehicle and fleet management services; consultation services on customized energy management system; and renewable energy ecosystem for clean energy. The company also involved in the power and steam production, purchase, and trading business; provident fund management; solar power generation; logistics; sales and marketing activities; natural gas business; investment in power and renewable energy; and research and development business. It also provides coal mining and trading; and business consultancy services, as well as fuel trading services. The company was formerly known as Ban Pu Coal Company Limited and changed its name to Banpu Public Company Limited in July 1993. Banpu Public Company Limited was founded in 1983 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10400",
        "website": "http://www.banpu.com",
        "market_cap": 2477882368
    },
    "BANPU.BK": {
        "short_name": "BANPU PUBLIC COMPANY LIMITED",
        "long_name": "Banpu Public Company Limited",
        "summary": "Banpu Public Company Limited engages in the coal mining and power businesses. It holds an interest in a 1,434 MW coal-fired power plant in Map Ta Phut Industrial Estate, Rayong Province, Thailand. The company also manages five coal mines in Kalimantan comprising Indominco, Jorong, Kitadin-Embalut, Trubaindo, and Bharinto, which produce a range of bituminous and sub-bituminous thermal coals in Indonesia. In addition, it operates the Gaohe mine in Shanxi Province and Hebi mine in Henan Province; operates and manages 3 coal-fired combined heat and power plants with a capacity of 539 megawatts in China; and owns 10 coal mines located in New South Wales, Australia. Further, the company operates various coal project in Mongolia; thermal power plants in Lao PDR; wind farm in Vietnam; and solar farms in Japan. Additionally, it provides solar rooftop solutions and installation for industries and large businesses; energy storage solutions; electric vehicle and fleet management services; consultation services on customized energy management system; and renewable energy ecosystem for clean energy. The company also involved in the power and steam production, purchase, and trading business; provident fund management; solar power generation; logistics; sales and marketing activities; natural gas business; investment in power and renewable energy; and research and development business. It also provides coal mining and trading; and business consultancy services, as well as fuel trading services. The company was formerly known as Ban Pu Coal Company Limited and changed its name to Banpu Public Company Limited in July 1993. Banpu Public Company Limited was founded in 1983 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10400",
        "website": "http://www.banpu.com",
        "market_cap": 80178364416
    },
    "BISI.L": {
        "short_name": "BISICHI PLC ORD 10P",
        "long_name": "Bisichi PLC",
        "summary": "Bisichi PLC engages in coal mining activities in the United Kingdom and South Africa. The company owns an interest in the Black Wattle Colliery located in South Africa. It also engages in the share dealing and retail property investment activities, as well as residential property development activity. The company was formerly known as Bisichi Mining Plc and changed its name to Bisichi PLC in March 2020. Bisichi PLC was incorporated in 1910 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1J 6NE",
        "website": "http://bisichi.co.uk",
        "market_cap": 8274520
    },
    "BLNG.ME": {
        "short_name": "BELON",
        "long_name": "Belon Joint Stock Company",
        "summary": "Belon Joint Stock Company extracts, processes, and produces coal and related products in Russia. It offers coking coal and concentrates. The company was founded in 1991 and is based in Belovo, Russia. Belon Joint Stock Company is a subsidiary of MMK - Mining Assets Management S.A.",
        "currency": "RUB",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Belovo",
        "zipcode": "652607",
        "website": "http://www.belon.ru",
        "market_cap": 8274250240
    },
    "BNB.F": {
        "short_name": "BAYAN RESOURCES GROUP",
        "long_name": "PT Bayan Resources Tbk",
        "summary": "PT Bayan Resources Tbk, together with its subsidiaries, engages in the open cut mining and sale of coal in Kalimantan. It operates through Coal and Non-Coal segments. The company produces semi-soft coking, bituminous, sub-bituminous low-sulphur, and low-ash coal. It has rights to mine 5 coal contracts of works and 16 mining business permits with a concession area of 126,293 hectares. The company also owns and operates a Balikpapan coal terminal located in Balikpapan, East Kalimantan, as well as owns and manages two Kalimantan floating transfer barges located in East Kalimantan. In addition, it is involved in the provision of mining contractor, port management, shipping, construction, transportation, and trading services. PT Bayan Resources Tbk was founded in 1973 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://www.bayan.com.sg",
        "market_cap": 2801382912
    },
    "BOSS.JK": {
        "short_name": "Borneo Olah Sarana Sukses Tbk.",
        "long_name": "PT. Borneo Olah Sarana Sukses Tbk",
        "summary": "PT. Borneo Olah Sarana Sukses Tbk operates as a coal exploration and production company in Indonesia. The company's mining assets are located in Muara Pahu, Kutai Barat, and East Kalimantan regions. It exports its products to Japan, South Korea, the United States, the Philippines, Thailand, Vietnam, India, and Bangladesh. PT. Borneo Olah Sarana Sukses Tbk is based in West Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Barat",
        "zipcode": "11410",
        "website": "http://www.bosscoal.com",
        "market_cap": 123199995904
    },
    "BP6.F": {
        "short_name": "AFRICAN ENERGY RES.CUFS1",
        "long_name": "African Energy Resources Limited",
        "summary": "African Energy Resources Limited develops various power projects in Botswana. The company operates through Coal-fired Power Projects and Power Investments segments. The company holds interests in Mmamantswe coal project and Mmamabula West coal project. African Energy Resources Limited was incorporated in 2006 and is based in St Martin, Guernsey.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Guernsey",
        "state": null,
        "city": "St Martin",
        "zipcode": "GY1 3RS",
        "website": "http://www.africanenergyresources.com",
        "market_cap": 4672207
    },
    "BPFG.F": {
        "short_name": "BANPU PCL -FGN-  BA 1",
        "long_name": "Banpu Public Company Limited",
        "summary": "Banpu Public Company Limited engages in the coal mining and power businesses. It holds an interest in a 1,434 MW coal-fired power plant in Map Ta Phut Industrial Estate, Rayong Province, Thailand. The company also manages five coal mines in Kalimantan comprising Indominco, Jorong, Kitadin-Embalut, Trubaindo, and Bharinto, which produce a range of bituminous and sub-bituminous thermal coals in Indonesia. In addition, it operates the Gaohe mine in Shanxi Province and Hebi mine in Henan Province; operates and manages 3 coal-fired combined heat and power plants with a capacity of 539 megawatts in China; and owns 10 coal mines located in New South Wales, Australia. Further, the company operates various coal project in Mongolia; thermal power plants in Lao PDR; wind farm in Vietnam; and solar farms in Japan. Additionally, it provides solar rooftop solutions and installation for industries and large businesses; energy storage solutions; electric vehicle and fleet management services; consultation services on customized energy management system; and renewable energy ecosystem for clean energy. The company also involved in the power and steam production, purchase, and trading business; provident fund management; solar power generation; logistics; sales and marketing activities; natural gas business; investment in power and renewable energy; and research and development business. It also provides coal mining and trading; and business consultancy services, as well as fuel trading services. The company was formerly known as Ban Pu Coal Company Limited and changed its name to Banpu Public Company Limited in July 1993. Banpu Public Company Limited was founded in 1983 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10400",
        "website": "http://www.banpu.com",
        "market_cap": 1961385472
    },
    "BSSR.JK": {
        "short_name": "Baramulti Suksessarana Tbk.",
        "long_name": "PT Baramulti Suksessarana Tbk",
        "summary": "PT Baramulti Suksessarana Tbk mines and trades in transports coal. The company holds interests in the PT Antang Gunung Meratus coal concession covering an area of approximately 22,433 hectares located in South Kalimantan; and the PT Baramulti Suksessarana coal concession totaling an area of approximately 2,459.8 hectares located in East Kalimantan. It exports coal to Indonesia, China, India, the Philippines, South Korea, Vietnam, Thailand, Taiwan, and Japan. The company was founded in 1990 and is headquartered in Jakarta, Indonesia. PT Baramulti Suksessarana Tbk is a subsidiary of PT Wahana Sentosa Cemerlang.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10220",
        "website": "http://www.bssr.co.id",
        "market_cap": 4552709898240
    },
    "BTU": {
        "short_name": "Peabody Energy Corporation",
        "long_name": "Peabody Energy Corporation",
        "summary": "Peabody Energy Corporation engages in coal mining business in the United States, Japan, Taiwan, Australia, China, India, Vietnam, South Korea, and internationally. The company operates through Seaborne Thermal Mining, Seaborne Metallurgical Mining, Powder River Basin Mining, and Other U.S. Thermal Mining segments. It is involved in mining, preparation, and sale of thermal coal primarily to electric utilities; mining bituminous and sub-bituminous coal deposits; and mining metallurgical coal, such as hard coking coal, semi-hard coking coal, semi-soft coking coal, and pulverized coal injection coal. The company supplies coal primarily to electricity generators, industrial facilities, and steel manufacturers. As of December 31, 2020, it owned interests in 17 coal mining operations located in the United States and Australia; and had approximately 3.0 billion tons of proven and probable coal reserves and approximately 450,000 acres of surface property through ownership and lease agreements. The company also engages in direct and brokered trading of coal and freight-related contracts, as well as provides transportation-related services, which involve financial derivative contracts and physical contracts. Peabody Energy Corporation was founded in 1883 and is headquartered in St. Louis, Missouri.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "MO",
        "city": "St. Louis",
        "zipcode": "63101",
        "website": "http://www.peabodyenergy.com",
        "market_cap": 503296000
    },
    "BTU.SN": {
        "short_name": "PEABODY ENERGY CO",
        "long_name": "Peabody Energy Corporation",
        "summary": "Peabody Energy Corporation engages in coal mining business in the United States, Japan, Taiwan, Australia, China, India, Vietnam, South Korea, and internationally. The company operates through Seaborne Thermal Mining, Seaborne Metallurgical Mining, Powder River Basin Mining, and Other U.S. Thermal Mining segments. It is involved in mining, preparation, and sale of thermal coal primarily to electric utilities; mining bituminous and sub-bituminous coal deposits; and mining metallurgical coal, such as hard coking coal, semi-hard coking coal, semi-soft coking coal, and pulverized coal injection coal. The company supplies coal primarily to electricity generators, industrial facilities, and steel manufacturers. As of December 31, 2020, it owned interests in 17 coal mining operations located in the United States and Australia; and had approximately 3.0 billion tons of proven and probable coal reserves and approximately 450,000 acres of surface property through ownership and lease agreements. The company also engages in direct and brokered trading of coal and freight-related contracts, as well as provides transportation-related services, which involve financial derivative contracts and physical contracts. Peabody Energy Corporation was founded in 1883 and is headquartered in St. Louis, Missouri.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "United States",
        "state": "MO",
        "city": "St. Louis",
        "zipcode": "63101",
        "website": "http://www.peabodyenergy.com",
        "market_cap": 412966848
    },
    "BUC.JO": {
        "short_name": "Buffalo Coal Corp",
        "long_name": "Buffalo Coal Corp.",
        "summary": "Buffalo Coal Corp., together with its subsidiaries, operates as a coal mining company in South Africa. It primarily focuses on the Aviemore anthracite mine covering an area of approximately 5,567 hectares located in the Kwa-Zulu, Natal Province of South Africa. The company was formerly known as Forbes & Manhattan Coal Corp. and changed its name to Buffalo Coal Corp. in July 2014. Buffalo Coal Corp. is headquartered in Dundee, South Africa.",
        "currency": "ZAc",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Dundee",
        "zipcode": "3000",
        "website": "http://www.buffalocoal.co.za",
        "market_cap": 124274400
    },
    "BUF.V": {
        "short_name": "BUFFALO COAL CORP",
        "long_name": "Buffalo Coal Corp.",
        "summary": "Buffalo Coal Corp., together with its subsidiaries, operates as a coal mining company in South Africa. It primarily focuses on the Aviemore anthracite mine covering an area of approximately 5,567 hectares located in the Kwa-Zulu, Natal Province of South Africa. The company was formerly known as Forbes & Manhattan Coal Corp. and changed its name to Buffalo Coal Corp. in July 2014. Buffalo Coal Corp. is headquartered in Dundee, South Africa.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "South Africa",
        "state": null,
        "city": "Dundee",
        "zipcode": "3000",
        "website": "http://www.buffalocoal.co.za",
        "market_cap": 14747355
    },
    "BUMI.JK": {
        "short_name": "Bumi Resources Tbk.",
        "long_name": "PT Bumi Resources Tbk",
        "summary": "PT Bumi Resources Tbk, through its subsidiaries, engages in the mining activities in Indonesia. It operates through Coal, Services, Oil and Gas, and Gold segments. The Coal segment engages in the exploration, exploitation, and sale of coal deposits. The Services segment offers marketing and management services. The Oil and Gas segment explores for oil and gas properties. The Gold segment explores for gold properties. It also exports its products. The company was formerly known as PT Bumi Modern Tbk. and changed its name to PT Bumi Resources Tbk in September 2000. PT Bumi Resources Tbk was founded in 1973 and is headquartered in Jakarta, Indonesia. PT Bumi Resources Tbk is a subsidiary of Long Haul Holdings Ltd.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12940",
        "website": "http://www.bumiresources.com",
        "market_cap": 4246729129984
    },
    "BYAN.JK": {
        "short_name": "Bayan Resources Tbk.",
        "long_name": "PT Bayan Resources Tbk",
        "summary": "PT Bayan Resources Tbk, together with its subsidiaries, engages in the open cut mining and sale of coal in Kalimantan. It operates through Coal and Non-Coal segments. The company produces semi-soft coking, bituminous, sub-bituminous low-sulphur, and low-ash coal. It has rights to mine 5 coal contracts of works and 16 mining business permits with a concession area of 126,293 hectares. The company also owns and operates a Balikpapan coal terminal located in Balikpapan, East Kalimantan, as well as owns and manages two Kalimantan floating transfer barges located in East Kalimantan. In addition, it is involved in the provision of mining contractor, port management, shipping, construction, transportation, and trading services. PT Bayan Resources Tbk was founded in 1973 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://www.bayan.com.sg",
        "market_cap": 46166620241920
    },
    "C9X.F": {
        "short_name": "CONSOL ENERGY INC.",
        "long_name": "CONSOL Energy Inc.",
        "summary": "CONSOL Energy Inc. produces and exports bituminous coal. It operates through PAMC, CONSOL Marine Terminal, and Other segments. The company mines, prepares, and markets thermal coal; and offers coal export terminal services, as well as develops the Itmann Mine and the Greenfield reserves. It owns and operates the Pennsylvania Mining Complex (PAMC), which includes the Bailey Mine, the Enlow Fork Mine, the Harvey Mine, and the Central Preparation Plant; and CONSOL Marine Terminal located in the port of Baltimore. As of December 31, 2020, the company had 657.9 million tons of proven and probable coal reserves at PAMC. It also owns approximately 1.5 billion tons of Greenfield reserves located in the Northern Appalachian, Central Appalachian, and Illinois basins. The company was founded in 1860 and is headquartered in Canonsburg, Pennsylvania.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Canonsburg",
        "zipcode": "15317-6506",
        "website": "http://www.consolenergy.com",
        "market_cap": 575233088
    },
    "CCOZF": {
        "short_name": "CHINA COAL ENERGY COMPANY",
        "long_name": "China Coal Energy Company Limited",
        "summary": "China Coal Energy Company Limited primarily mines for, processes, produces, and sells coal in the People's Republic of China and internationally. It operates through Coal, Coal-Chemical, Mining Machinery, Finance, and Others segments. The company offers thermal and coking coal. It also produces and sells polyolefin, methanol, urea, and other coal chemical products, as well as coke; researches, designs, develops, manufactures, and sells coal mining machinery and equipment; and provides after-sales services. In addition, the company is involved in aluminum, electricity generation, and other manufacturing businesses. Further, it provides equipment trading agency, tendering, investment management, finance, and waste disposal services. The company was founded in 2006 and is based in Beijing, the People's Republic of China. China Coal Energy Company Limited is a subsidiary of China National Coal Group Corporation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100120",
        "website": "http://www.chinacoalenergy.com",
        "market_cap": 15044795392
    },
    "CCOZY": {
        "short_name": "CHINA COAL ENERGY COMPANY",
        "long_name": "China Coal Energy Company Limited",
        "summary": "China Coal Energy Company Limited primarily mines for, processes, produces, and sells coal in the People's Republic of China and internationally. It operates through Coal, Coal-Chemical, Mining Machinery, Finance, and Others segments. The company offers thermal and coking coal. It also produces and sells polyolefin, methanol, urea, and other coal chemical products, as well as coke; researches, designs, develops, manufactures, and sells coal mining machinery and equipment; and provides after-sales services. In addition, the company is involved in aluminum, electricity generation, and other manufacturing businesses. Further, it provides equipment trading agency, tendering, investment management, finance, and waste disposal services. The company was founded in 2006 and is based in Beijing, the People's Republic of China. China Coal Energy Company Limited is a subsidiary of China National Coal Group Corporation.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100120",
        "website": "http://www.chinacoalenergy.com",
        "market_cap": 14534543360
    },
    "CEIX": {
        "short_name": "CONSOL Energy Inc.",
        "long_name": "CONSOL Energy Inc.",
        "summary": "CONSOL Energy Inc. produces and exports bituminous coal. It operates through PAMC, CONSOL Marine Terminal, and Other segments. The company mines, prepares, and markets thermal coal; and offers coal export terminal services, as well as develops the Itmann Mine and the Greenfield reserves. It owns and operates the Pennsylvania Mining Complex (PAMC), which includes the Bailey Mine, the Enlow Fork Mine, the Harvey Mine, and the Central Preparation Plant; and CONSOL Marine Terminal located in the port of Baltimore. As of December 31, 2020, the company had 657.9 million tons of proven and probable coal reserves at PAMC. It also owns approximately 1.5 billion tons of Greenfield reserves located in the Northern Appalachian, Central Appalachian, and Illinois basins. The company was founded in 1860 and is headquartered in Canonsburg, Pennsylvania.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Canonsburg",
        "zipcode": "15317-6506",
        "website": "http://www.consolenergy.com",
        "market_cap": 442196768
    },
    "CERX": {
        "short_name": "COLOMBIA ENERGY RES IN",
        "long_name": "Colombia Energy Resources, Inc.",
        "summary": "Colombia Energy Resources, Inc. engages in the exploration and development of coal mines in the Republic of Columbia. The company holds 10 coal mining concession contracts to exploit coal deposits in 10,455 hectares in the BoyacÃ  and Santander districts of the Republic of Colombia. It also has an option to purchase a coal mining concession contract with 1,550 hectares in the BoyacÃ  district. The company was formerly known as Colombia Clean Power & Fuels, Inc. and changed its name to Colombia Energy Resources, Inc. in November 2011. Colombia Energy Resources, Inc. was founded in 1996 and is based in San Francisco, California.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94111",
        "website": null,
        "market_cap": 134426
    },
    "COALINDIA.NS": {
        "short_name": "COAL INDIA LTD",
        "long_name": "Coal India Limited",
        "summary": "Coal India Limited, together with its subsidiaries, produces and sells coal worldwide. It offers coking coal primarily for use in steel making and metallurgical industries, and for hard coke manufacturing; and semi coking coal that is used as blend-able coal in steel making, merchant coke manufacturing, and other metallurgical industries. The company also provides non-coking coal for use as thermal grade coal for power generation, as well as for cement, fertilizer, glass, ceramic, paper, chemical, and brick manufacturing, and other heating purposes. In addition, it offers beneficiated and washed non-coking coal for use in power generation; beneficiated non-coking coal, which is used in cement, sponge iron, and other industrial plants; and middling products for use in power generation, domestic fuel plants, brick manufacturing units, cement plants, industrial plants, etc. Further, the company provides rejects for use in fluidized bed combustion boilers for power generation, road repairs, briquette making, land filling, etc.; CIL/LTC coke that is used in furnaces and kilns of industrial units, as well as for use as domestic fuel by halwais, hotels, etc.; and coal/coke fines that are used in industrial furnaces, and for domestic purposes. Additionally, it offers tar/heavy oil/light oil/soft pitches, which are used in furnaces and boilers of industrial plants, as well as power houses, oil, dye, pharmaceutical industries, etc. The company was formerly known as Coal Mines Authority Limited and changed its name to Coal India Limited in November 1975. The company was incorporated in 1973 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700156",
        "website": "http://www.coalindia.in",
        "market_cap": 1002368008192
    },
    "CSUAY": {
        "short_name": "CHINA SHENHUA ENERGY COMPANY LT",
        "long_name": "China Shenhua Energy Company Limited",
        "summary": "China Shenhua Energy Company Limited and its subsidiaries engage in the production and sales of coal and power; railway, port, and shipping transportation; and coal-to-olefins businesses in the People's Republic of China and internationally. The company's Coal segment produces coal from surface and underground mines; and sells coal to power plants, metallurgical and coal chemical producers, and provincial/regional electric grid companies. As of December 31, 2020, this segment had the recoverable coal reserves of 14.42 billion tones. Its Power segment generates and sells electric power to power grid companies. This segment generates electric power through coal, thermal, wind, water, and gas. The company's Railway segment provides railway transportation services. Its Port segment offers loading, transportation, and storage services. The company's Shipping segment provides shipment transportation services. Its Coal Chemical segment produces and sells methanol; and polyethylene and polypropylene, as well as other by-products. The company was incorporated in 2004 and is based in Beijing, China. China Shenhua Energy Company Limited is a subsidiary of China Energy Investment Corporation Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100011",
        "website": "http://www.csec.com",
        "market_cap": 58096963584
    },
    "CUAEF": {
        "short_name": "CHINA SHENHUA ENERGY COMPANY LT",
        "long_name": "China Shenhua Energy Company Limited",
        "summary": "China Shenhua Energy Company Limited and its subsidiaries engage in the production and sales of coal and power; railway, port, and shipping transportation; and coal-to-olefins businesses in the People's Republic of China and internationally. The company's Coal segment produces coal from surface and underground mines; and sells coal to power plants, metallurgical and coal chemical producers, and provincial/regional electric grid companies. As of December 31, 2020, this segment had the recoverable coal reserves of 14.42 billion tones. Its Power segment generates and sells electric power to power grid companies. This segment generates electric power through coal, thermal, wind, water, and gas. The company's Railway segment provides railway transportation services. Its Port segment offers loading, transportation, and storage services. The company's Shipping segment provides shipment transportation services. Its Coal Chemical segment produces and sells methanol; and polyethylene and polypropylene, as well as other by-products. The company was incorporated in 2004 and is based in Beijing, China. China Shenhua Energy Company Limited is a subsidiary of China Energy Investment Corporation Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100011",
        "website": "http://www.csec.com",
        "market_cap": 60833792000
    },
    "CVV.F": {
        "short_name": "CHINA COAL ENERGY H  YC 1",
        "long_name": "China Coal Energy Company Limited",
        "summary": "China Coal Energy Company Limited primarily mines for, processes, produces, and sells coal in the People's Republic of China and internationally. It operates through Coal, Coal-Chemical, Mining Machinery, Finance, and Others segments. The company offers thermal and coking coal. It also produces and sells polyolefin, methanol, urea, and other coal chemical products, as well as coke; researches, designs, develops, manufactures, and sells coal mining machinery and equipment; and provides after-sales services. In addition, the company is involved in aluminum, electricity generation, and other manufacturing businesses. Further, it provides equipment trading agency, tendering, investment management, finance, and waste disposal services. The company was founded in 2006 and is based in Beijing, the People's Republic of China. China Coal Energy Company Limited is a subsidiary of China National Coal Group Corporation.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100120",
        "website": "http://www.chinacoalenergy.com",
        "market_cap": 11463950336
    },
    "DEWA.JK": {
        "short_name": "Darma Henwa Tbk",
        "long_name": "PT Darma Henwa Tbk",
        "summary": "PT Darma Henwa Tbk, together with its subsidiaries, provides mining contracting, general mining, and equipment maintenance services in Indonesia. It operates through two segments, Mining Contractor and Other Services. The company is involved in various mining activities, including land clearing, top soiling, drilling, blasting, overburden removal and dumping, coal getting, coal rom, coal hauling, coal barging, vegetation, and rehabilitation activities, as well as engages in equipment rental and port service businesses. The company was formerly known as PT HWE Indonesia and changed its name to PT Darma Henwa Tbk in September 2005. PT Darma Henwa Tbk was founded in 1991 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12940",
        "website": "http://www.ptdh.co.id",
        "market_cap": 1092685004800
    },
    "DMCHY": {
        "short_name": "DMCI HLDGS INC",
        "long_name": "DMCI Holdings, Inc.",
        "summary": "DMCI Holdings, Inc., through its subsidiaries, engages in the general construction, coal and nickel mining, power generation, real estate development, water concession, and manufacturing businesses in the Philippines and internationally. It operates through seven segments: Construction and Others, Coal Mining, Nickel Mining, Real Estate, On-Grid Power, Off-Grid Power, and Water. It constructs various projects comprising commercial and residential buildings; bridges, power plants, industrial plants, and water and sewer facilities, as well as chapels, hotels, irrigation dams, power transmission lines, and theaters. The company is also involved in the production and trading of concrete products; and handling steel fabrication, and electrical and foundation works. In addition, it engages in the development of mid-income residential properties under the DMCI Homes brand; generation of power through coal-fired and satellite power plants; exploration, mining, development, and sale of coal resources on Semirara Island in Caluya, Antique; mining, extracting, and selling of nickel, chromite, and iron laterite from Berong, Moorsom, and Ulugan mines in Palawan, as well as from Acoje mines in Zambales; and provision of water distribution and sewer services for the western side of Metro Manila and parts of Cavite. The company was incorporated in 1995 and is headquartered in Makati City, the Philippines.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "state": null,
        "city": "Makati City",
        "zipcode": "1231",
        "website": "http://www.dmciholdings.com",
        "market_cap": 1515333632
    },
    "DOID.JK": {
        "short_name": "Delta Dunia Makmur Tbk.",
        "long_name": "PT Delta Dunia Makmur Tbk",
        "summary": "PT Delta Dunia Makmur Tbk, through its subsidiaries, operates as a mining contractor in Indonesia. The company provides coal mining, overburden removal, coal hauling, waste removal, reclamation, and land rehabilitation services, as well as coal transportation and road maintenance services. It also engages in the rental of heavy equipment. PT Delta Dunia Makmur Tbk was founded in 1990 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://deltadunia.com",
        "market_cap": 3223812571136
    },
    "DSSA.JK": {
        "short_name": "Dian Swastatika Sentosa Tbk",
        "long_name": "PT Dian Swastatika Sentosa Tbk",
        "summary": "PT Dian Swastatika Sentosa Tbk, together with its subsidiaries, engages in the power generation, trading, coal mining and trading, multimedia, forestry, and infrastructure businesses. It operates through Supply of Steam and Electricity, Fertilizer and Chemicals Trading, Rent, and Coal Mining and Trading segments. The company operates 4 units of captive power plants located in Tangerang, Serang, Karawang-1, and Karawang-2 with a total capacity of 600 megawatts. It also offers research and development, and management consulting services; trades in chemicals, pesticides, and fertilizers; and engages in the pulp and wood chip mill activities. In addition, the company provides pay TV and Internet service provider services; and venture capital and management services. It also operates in Indonesia, China, India, Korea, Spain, Thailand, Cambodia, and Dubai. The company was founded in 1996 and is headquartered in Jakarta, Indonesia. PT Dian Swastatika Sentosa Tbk is a subsidiary of PT Sinar Mas Tunggal.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10350",
        "website": "http://www.dss.co.id",
        "market_cap": 8321961558016
    },
    "DSX.SG": {
        "short_name": "Dian Swastatika Sentosa Tbk Reg",
        "long_name": "PT Dian Swastatika Sentosa Tbk",
        "summary": "PT Dian Swastatika Sentosa Tbk, together with its subsidiaries, engages in the power generation, trading, coal mining and trading, multimedia, forestry, and infrastructure businesses. It operates through Supply of Steam and Electricity, Fertilizer and Chemicals Trading, Rent, and Coal Mining and Trading segments. The company operates 4 units of captive power plants located in Tangerang, Serang, Karawang-1, and Karawang-2 with a total capacity of 600 megawatts. It also offers research and development, and management consulting services; trades in chemicals, pesticides, and fertilizers; and engages in the pulp and wood chip mill activities. In addition, the company provides pay TV and Internet service provider services; and venture capital and management services. It also operates in Indonesia, China, India, Korea, Spain, Thailand, Cambodia, and Dubai. The company was founded in 1996 and is headquartered in Jakarta, Indonesia. PT Dian Swastatika Sentosa Tbk is a subsidiary of PT Sinar Mas Tunggal.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10350",
        "website": "http://www.dss.co.id",
        "market_cap": 563253760
    },
    "DWGL.JK": {
        "short_name": "Dwi Guna Laksana Tbk.",
        "long_name": "PT Dwi Guna Laksana Tbk",
        "summary": "PT Dwi Guna Laksana Tbk, together with its subsidiaries, engages in the coal mining and trading activities in Indonesia. It also offers port, crushing, loading, and barging services. The company has a concession area of 412.8 hectares located in the Jilatan Village, district of Batu Ampar, Regency of Tanah Laut, South Kalimantan. The company was founded in 1986 and is headquartered in Banjarmasin, Indonesia. PT Dwi Guna Laksana Tbk is a subsidiary of Hawthorn-Capital Investment Pte. Ltd.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Banjarmasin",
        "zipcode": "70235",
        "website": "http://dwigunalaksana.co.id",
        "market_cap": 1585511268352
    },
    "ECX-H.V": {
        "short_name": "EASTCOAL INC",
        "long_name": "EastCoal Inc.",
        "summary": "EastCoal Inc. engages in the acquisition and development of mineral properties. The company was incorporated in 1986 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 1V6",
        "website": "http://www.eastcoal.ca",
        "market_cap": 3137953
    },
    "EDL.L": {
        "short_name": "EDENVILLE ENERGY PLC ORD 1P",
        "long_name": "Edenville Energy Plc",
        "summary": "Edenville Energy Plc engages in the exploration, development, and mining of energy commodities, primarily coal in Africa. Its principal project is the Rukwa project located in Tanzania. The company was incorporated in 2004 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "N3 1LF",
        "website": "http://www.edenville-energy.com",
        "market_cap": 4345872
    },
    "EXX.JO": {
        "short_name": "Exxaro Resources Ltd",
        "long_name": "Exxaro Resources Limited",
        "summary": "Exxaro Resources Limited engages in coal, iron ore investment, pigment manufacturing, and renewable energy businesses in South Africa, Europe, the United States, and Asia. The company produces thermal coal, metallurgical coal, and semi-soft coking coal products primarily in the Waterberg and Mpumalanga regions; offers gas-atomised ferrosilicon for use in separation plants, as well as iron ore; and operates two wind farms. It also owns 26% interest in the Black Mountain zinc project located in the Northern Cape. The company was formerly known as Kumba Iron Ore Limited and changed its name to Exxaro Resources Limited in November 2006. The company is headquartered in Centurion, South Africa.",
        "currency": "ZAc",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Centurion",
        "zipcode": "0157",
        "website": "http://www.exxaro.com",
        "market_cap": 39472234496
    },
    "FIRE.JK": {
        "short_name": "Alfa Energi Investama Tbk.",
        "long_name": "PT Alfa Energi Investama Tbk",
        "summary": "PT Alfa Energi Investama Tbk, through its subsidiaries, engages in the coal mining and trading business in Indonesia. The company holds interests in a concession with approximately 2,089 hectares located in Kutai Kartanegara, East Kalimantan; and a concession with approximately 6,000 hectares located in West Kutai, East Kalimantan. It also provides coal mining management services. The company was founded in 2015 and is based in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": null,
        "website": "http://www.alfacentra.com",
        "market_cap": 890330087424
    },
    "G1V.F": {
        "short_name": "MC MINING LTD",
        "long_name": "MC Mining Limited",
        "summary": "MC Mining Limited, together with its subsidiaries, acquires, explores, develops, and operates metallurgical and thermal coal projects in South Africa. The company's principal projects include the Uitkomst Colliery, a metallurgical and thermal coal project located in the KwaZulu Natal province; the Makhado hard coking and thermal coal project situated in the Soutpansberg coalfield in the Limpopo province; and the Vele Colliery, a semi-soft coking and thermal coal mine located to the west of Musina in the Limpopo province. Its principal projects also comprise three coking and thermal coal projects, including Chapudi, Generaal, and Mopane located in Limpopo province. The company was formerly known as Coal of Africa Limited and changed its name to MC Mining Limited in November 2017. MC Mining Limited is based in Mount Pleasant, Australia.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "WA",
        "city": "Mount Pleasant",
        "zipcode": "6153",
        "website": "http://www.mcmining.co.za",
        "market_cap": 11369396
    },
    "GCM.L": {
        "short_name": "GCM RESOURCES PLC ORD 1P",
        "long_name": "GCM Resources Plc",
        "summary": "GCM Resources Plc operates as a resource exploration and development company. It primarily develops the Phulbari coal and power project that relates to thermal coal and semi-soft coking coal located in Bangladesh. GCM Resources Plc was incorporated in 2003 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC1Y 8YZ",
        "website": "http://www.gcmplc.com",
        "market_cap": 9902100
    },
    "GMDCLTD.NS": {
        "short_name": "GUJARAT MINERAL DE",
        "long_name": "Gujarat Mineral Development Corporation Limited",
        "summary": "Gujarat Mineral Development Corporation Limited engages in mining business in India. It operates in two segments, Mining and Power. The company explores for lignite, bauxite, fluorspar, manganese, silica sand, limestone, bentonite, and ball clay. It also generates power using thermal, wind, and solar sources. The company was incorporated in 1963 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380052",
        "website": "http://www.gmdcltd.com",
        "market_cap": 24974284800
    },
    "H7H.F": {
        "short_name": "HALLADOR ENERGY  DL-,01",
        "long_name": "Hallador Energy Company",
        "summary": "Hallador Energy Company, through its subsidiaries, engages in the production of steam coal in the Illinois basin for the electric power generation industry. The company owns the Oaktown 1 and Oaktown 2 underground mines in Oaktown, Indiana; and Ace in the Hole mine located near Clay City, Indiana. It is also involved in gas exploration activities in Indiana. The company was founded in 1949 and is headquartered in Terre Haute, Indiana.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IN",
        "city": "Terre Haute",
        "zipcode": "47802",
        "website": "http://www.halladorenergy.com",
        "market_cap": 76598176
    },
    "HMU.DE": {
        "short_name": "HMS BERGBAU AG",
        "long_name": "HMS Bergbau AG",
        "summary": "HMS Bergbau AG distributes coal and other energy raw materials to power plants, cement manufacturers, and industrial consumers worldwide. The company offers steam coal, coking coal and coke, and anthracite and PCI coal; wood pellets, wood chips, and other biomass; iron ore, including pellets, iron lumps, fines, and other ores; cement and cementitious products, such as clinker, fly ash, etc.; and sea, rail, and road logistics services. It also provides consulting services in the areas of power plant design and construction, harbor planning and configuration, coal mine operation, and on-site optimization of raw materials logistics. In addition, the company charters sea going vessels and inland barges; and organizes logistics by barge, train, or truck; and provides logistics solutions comprising harbor operations, storage management, and technical oversight. It supplies its products to power plant companies, as well as steel and cement manufacturers; and industrial companies, such as glassworks, paper mills, and waste processing plants. HMS Bergbau AG was founded in 1995 and is headquartered in Berlin, Germany.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "state": null,
        "city": "Berlin",
        "zipcode": "12459",
        "website": "http://www.hms-ag.com",
        "market_cap": 93824416
    },
    "HMU.F": {
        "short_name": "HMS BERGBAU AG",
        "long_name": "HMS Bergbau AG",
        "summary": "HMS Bergbau AG distributes coal and other energy raw materials to power plants, cement manufacturers, and industrial consumers worldwide. The company offers steam coal, coking coal and coke, and anthracite and PCI coal; wood pellets, wood chips, and other biomass; iron ore, including pellets, iron lumps, fines, and other ores; cement and cementitious products, such as clinker, fly ash, etc.; and sea, rail, and road logistics services. It also provides consulting services in the areas of power plant design and construction, harbor planning and configuration, coal mine operation, and on-site optimization of raw materials logistics. In addition, the company charters sea going vessels and inland barges; and organizes logistics by barge, train, or truck; and provides logistics solutions comprising harbor operations, storage management, and technical oversight. It supplies its products to power plant companies, as well as steel and cement manufacturers; and industrial companies, such as glassworks, paper mills, and waste processing plants. HMS Bergbau AG was founded in 1995 and is headquartered in Berlin, Germany.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "state": null,
        "city": "Berlin",
        "zipcode": "12459",
        "website": "http://www.hms-ag.com",
        "market_cap": 93824416
    },
    "HNRG": {
        "short_name": "Hallador Energy Company",
        "long_name": "Hallador Energy Company",
        "summary": "Hallador Energy Company, through its subsidiaries, engages in the production of steam coal in the Illinois basin for the electric power generation industry. The company owns the Oaktown 1 and Oaktown 2 underground mines in Oaktown, Indiana; and Ace in the Hole mine located near Clay City, Indiana. It is also involved in gas exploration activities in Indiana. The company was founded in 1949 and is headquartered in Terre Haute, Indiana.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "IN",
        "city": "Terre Haute",
        "zipcode": "47802",
        "website": "http://www.halladorenergy.com",
        "market_cap": 87245904
    },
    "HOX.F": {
        "short_name": "SOUTHGOBI RESOURCES LTD.",
        "long_name": "SouthGobi Resources Ltd.",
        "summary": "SouthGobi Resources Ltd., together with its subsidiaries, operates as an integrated coal mining, development, and exploration company in Mongolia, Hong Kong, and China. It primarily explores for coking and thermal coal. The company's flagship project is the Ovoot Tolgoi open pit coal mine located in the Umnugobi Aimag of Mongolia. It also engages in the logistics and trading of coal in Mongolia and China. The company was formerly known as SouthGobi Energy Resources Ltd. and changed its name to SouthGobi Resources Ltd. in May 2010. SouthGobi Resources Ltd. was incorporated in 2002 and is based in Mong kok, Hong Kong.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Mong Kok",
        "zipcode": null,
        "website": "http://www.southgobi.com",
        "market_cap": 53451372
    },
    "HRUM.JK": {
        "short_name": "Harum Energy Tbk.",
        "long_name": "PT Harum Energy Tbk",
        "summary": "PT Harum Energy Tbk, together with its subsidiaries, engages in coal mining and logistics activities in Indonesia. It operates through Coal Mining Sectors, Shipping Services, and Others Sectors divisions. The Coal Mining Sectors division is involved in the general survey, exploration, exploitation, transportation, processing, and sale of coal. The Shipping Services division engages in the transportation and rental of tugboats and barges. The Others Sectors division invests in coal mining, trading, and services businesses. The company also exports its products to China, South Korea, Japan, Taiwan, Hong Kong, India, Bangladesh, Thailand, the Philippines, Singapore, and Vietnam. The company was formerly known as PT Asia Antrasit and changed its name to PT Harum Energy Tbk in November 2007. The company was founded in 1995 and is headquartered in Central Jakarta, Indonesia. PT Harum Energy Tbk is a subsidiary of PT Karunia Bara Perkasa.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Central Jakarta",
        "zipcode": "10310",
        "website": "http://www.harumenergy.com",
        "market_cap": 13705014149120
    },
    "IEC.AX": {
        "short_name": "INTRA ENGY FPO",
        "long_name": "Intra Energy Corporation Limited",
        "summary": "Intra Energy Corporation Limited, a mining and energy company, primarily engages in the exploration, production, sale, and supply of coal in Eastern Africa. The company's flagship project is the Tancoal mine located in the Ngaka Coalfields, Tanzania. It is also involved in the exploration and development of the Minas Do Lurio gold project comprising 168.56 square kilometers of prospecting license located in the LÃºrio Belt, Mozambique. The company was formerly known as Atomic Resources Limited and changed its name to Intra Energy Corporation Limited in April 2011. Intra Energy Corporation Limited was founded in 2007 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.intraenergycorp.com.au",
        "market_cap": 3977240
    },
    "IKF.F": {
        "short_name": "CHINA SHENHUA EN. H  YC 1",
        "long_name": "China Shenhua Energy Company Limited",
        "summary": "China Shenhua Energy Company Limited and its subsidiaries engage in the production and sales of coal and power; railway, port, and shipping transportation; and coal-to-olefins businesses in the People's Republic of China and internationally. The company's Coal segment produces coal from surface and underground mines; and sells coal to power plants, metallurgical and coal chemical producers, and provincial/regional electric grid companies. As of December 31, 2020, this segment had the recoverable coal reserves of 14.42 billion tones. Its Power segment generates and sells electric power to power grid companies. This segment generates electric power through coal, thermal, wind, water, and gas. The company's Railway segment provides railway transportation services. Its Port segment offers loading, transportation, and storage services. The company's Shipping segment provides shipment transportation services. Its Coal Chemical segment produces and sells methanol; and polyethylene and polypropylene, as well as other by-products. The company was incorporated in 2004 and is based in Beijing, China. China Shenhua Energy Company Limited is a subsidiary of China Energy Investment Corporation Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100011",
        "website": "http://www.csec.com",
        "market_cap": 48948727808
    },
    "IKFC.F": {
        "short_name": "CHINA SHENHUA EN.A  ADR/4",
        "long_name": "China Shenhua Energy Company Limited",
        "summary": "China Shenhua Energy Company Limited and its subsidiaries engage in the production and sales of coal and power; railway, port, and shipping transportation; and coal-to-olefins businesses in the People's Republic of China and internationally. The company's Coal segment produces coal from surface and underground mines; and sells coal to power plants, metallurgical and coal chemical producers, and provincial/regional electric grid companies. As of December 31, 2020, this segment had the recoverable coal reserves of 14.42 billion tones. Its Power segment generates and sells electric power to power grid companies. This segment generates electric power through coal, thermal, wind, water, and gas. The company's Railway segment provides railway transportation services. Its Port segment offers loading, transportation, and storage services. The company's Shipping segment provides shipment transportation services. Its Coal Chemical segment produces and sells methanol; and polyethylene and polypropylene, as well as other by-products. The company was incorporated in 2004 and is based in Beijing, China. China Shenhua Energy Company Limited is a subsidiary of China Energy Investment Corporation Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100011",
        "website": "http://www.csec.com",
        "market_cap": 50032865280
    },
    "IKW.AX": {
        "short_name": "IKWEZI FPO",
        "long_name": "Ikwezi Mining Limited",
        "summary": "Ikwezi Mining Limited engages in the coal mining and development activities. It operates the Kliprand Colliery and Emoyeni coal bene?ciation plants located in the Dannhauser, Kwa-zulu Natal province of South Africa. The company was incorporated in 2011 and is based in Johannesburg, South Africa.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": null,
        "website": "http://www.ikwezimining.com",
        "market_cap": 7520250
    },
    "INDY.JK": {
        "short_name": "Indika Energy Tbk.",
        "long_name": "PT. Indika Energy Tbk",
        "summary": "PT. Indika Energy Tbk operates as an integrated energy company in Indonesia. The company operates through Energy Resources, Energy Services, Energy Infrastructure, and Other Portfolio Holdings segments. The Energy Resources segment produces coal. This segment undertakes surface coal mining at a 50,921 hectares concession in Paser Regency, East Kalimantan, Indonesia. The Energy Services segment provides mining, engineering, procurement, construction, and offshore supply base services in the coal, and oil and gas sectors; and operation, maintenance, and logistics services. The Energy Infrastructure segment operates 660 megawatt coal-fired power plant in Cirebon, West Java. It also provides sea logistics and transportation solutions for bulk materials and natural resources; and offshore supply logistics services for oil and gas companies. In addition, this segment engages in the port operations; and provision of logistics, integrated operation, management, and maintenance services. The company is also involved in the investment, general trading, marketing, financing, coal and mineral trading, contracting, development, construction, industrial, agriculture, printing, workshop, and transportation activities; and provision of consultancy services for construction, industry, and infrastructure, as well as waste management services. In addition, the company provides transportation management, business and management consultancy, gold mining, real estate and trading, shipping, warehousing, and other services. Further, it offers information and communication, professional, scientific and technical manpower, travelling agent, insurance, vehicle repair maintenance, and retail and rental and lease services, as well as digital technology services. The company was founded in 1972 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12930",
        "website": "http://www.indikaenergy.co.id",
        "market_cap": 7036853551104
    },
    "IO0.F": {
        "short_name": "ICHOR COAL N.V.  EO-,10",
        "long_name": "Ichor Coal N.V.",
        "summary": "Ichor Coal N.V., a mining company, engages in the thermal coal production in South Africa. The company has access to approximately 400 million metric tons of coal resources on 16 properties located in the Mpumalanga coalfields in South Africa. Ichor Coal N.V. was founded in 2011 and is headquartered in Bryanston, South Africa.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Bryanston",
        "zipcode": "2191",
        "website": "http://www.ichorcoal.com",
        "market_cap": 6662960
    },
    "ITMG.JK": {
        "short_name": "Indo Tambangraya Megah Tbk.",
        "long_name": "PT Indo Tambangraya Megah Tbk",
        "summary": "PT Indo Tambangraya Megah Tbk, together with its subsidiaries, engages in coal mining activities. The company operates seven mining concessions in the island of Kalimantan covering East, Central, and South Kalimantan. It also owns and operates the Bontang Coal Terminal/BoCT, three loading ports, and Bontang power plant. In addition, the company provides mining support, coal and fuel trading, coal transportation, and alternative energy marketing and support services, as well as engages in electricity generation activity. It primarily sells its coal in Indonesia, India, Pakistan, Taiwan, China, Hong Kong, Korea, Japan, Europe, Australia, and other parts of Southeast Asia. The company was founded in 1987 and is headquartered in South Jakarta, Indonesia. PT Indo Tambangraya Megah Tbk is a subsidiary of Banpu Minerals (Singapore) Pte. Ltd.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12310",
        "website": "http://www.itmg.co.id",
        "market_cap": 16338744508416
    },
    "KALG": {
        "short_name": "KAL ENERGY INC",
        "long_name": "KAL Energy, Inc.",
        "summary": "KAL Energy, Inc. engages in the exploration, extraction, and distribution of coal. It holds interests in two coal concessions situated near the Mahakam River in north eastern Kalimantan, Indonesia. The company was formerly known as Patriarch, Inc. and changed its name to KAL Energy, Inc. in November 2006. KAL Energy, Inc. was founded in 2001 and is based in Jakarta, Indonesia.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12920",
        "website": null,
        "market_cap": 1146537
    },
    "KBO.JO": {
        "short_name": "Kibo Energy plc",
        "long_name": "Kibo Energy PLC",
        "summary": "Kibo Energy PLC, together with its subsidiaries, explores for and develops energy projects in Sub Saharan Africa and the United Kingdom. The company holds a 100% interest in the Mbeya Coal to Power project located in Songwe Regio, Tanzania. It also holds an 85% interest in the Mabesekwa Coal Independent Power Project located in Botswana; and 65% interest in the Benga Power Plant Project located in the Tete province of Mozambique. In addition, the company owns a 100% interest in the Bordersley power plant located near Birmingham. Further, it engages in power generation and treasury businesses. Kibo Energy PLC has a collaboration agreement with ESS Tech Inc. to develop energy storage solutions. The company was formerly known as Kibo Mining Plc and changed its name to Kibo Energy PLC in July 2018. Kibo Energy PLC was founded in 2008 and is based in Galway, Ireland.",
        "currency": "ZAc",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JNB",
        "market": "za_market",
        "country": "Ireland",
        "state": null,
        "city": "Galway",
        "zipcode": null,
        "website": "http://www.kibo.energy",
        "market_cap": 121224000
    },
    "KBTK.ME": {
        "short_name": "KUZBASSKAYA TOP CO",
        "long_name": "Public Joint Stock Company \"Kuzbasskaya Toplivnaya Company\"",
        "summary": "Public Joint Stock Company 'Kuzbasskaya Toplivnaya Company', together with its subsidiaries, engages in the extraction and production of thermal coal. The company operates through four segments: Domestic Sales of Produced Coal, Export Sales of Produced Coal, Resale of Purchased Coal, and Other Operations. It operates open-pit mines located in the territory of the Kemerovo region in Russia. The company is also involved in the wholesale supply of coal in Russia and internationally. In addition, it engages in the retail sale of coal to households, and municipal and commercial boilers through its distribution networks located in the Kemerovo, Omsk, Novosibirsk, and Altai regions, as well as in Poland. Further, the company is involved in the resale of coal purchased from other coal producers; generation of electricity, heat power, and hot water; provision of storage and railroad transportation services; and lease of land. It has operations in Russia, the European Union, and Asia. The company was founded in 2000 and is headquartered in Kemerovo, Russia. As of February 27, 2020, Public Joint Stock Company 'Kuzbasskaya Toplivnaya Company' operates as a subsidiary of Kilton Overseas Limited.",
        "currency": "RUB",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Kemerovo",
        "zipcode": "650000",
        "website": "http://ktk.company/en/company",
        "market_cap": 19498297344
    },
    "KIBO.L": {
        "short_name": "KIBO ENERGY PLC ORD EUR0.001 (C",
        "long_name": "Kibo Energy PLC",
        "summary": "Kibo Energy PLC, together with its subsidiaries, explores for and develops energy projects in Sub Saharan Africa and the United Kingdom. The company holds a 100% interest in the Mbeya Coal to Power project located in Songwe Regio, Tanzania. It also holds an 85% interest in the Mabesekwa Coal Independent Power Project located in Botswana; and 65% interest in the Benga Power Plant Project located in the Tete province of Mozambique. In addition, the company owns a 100% interest in the Bordersley power plant located near Birmingham. Further, it engages in power generation and treasury businesses. Kibo Energy PLC has a collaboration agreement with ESS Tech Inc. to develop energy storage solutions. The company was formerly known as Kibo Mining Plc and changed its name to Kibo Energy PLC in July 2018. Kibo Energy PLC was founded in 2008 and is based in Galway, Ireland.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Ireland",
        "state": null,
        "city": "Galway",
        "zipcode": null,
        "website": "http://www.kibo.energy",
        "market_cap": 5782171
    },
    "KIRY": {
        "short_name": "KIEWIT ROYALTY TRUST",
        "long_name": "Kiewit Royalty Trust",
        "summary": "Kiewit Royalty Trust, a royalty trust, holds royalty and overriding royalty interests in the leases of four coal mines located in the states of Montana and Wyoming. It has coal royalties in Decker Mine and Spring Creek Mine located in Big Horn County, Montana. The company also owns rights in a lease in the Black Butte Mine in Sweetwater County, Wyoming. Kiewit Royalty Trust was founded in 1982 and is based in Omaha, Nebraska.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NE",
        "city": "Omaha",
        "zipcode": "68102",
        "website": null,
        "market_cap": 1263340
    },
    "KKGI.JK": {
        "short_name": "Resource Alam Indonesia Tbk.",
        "long_name": "PT Resource Alam Indonesia Tbk",
        "summary": "PT Resource Alam Indonesia Tbk engages in coal and methane mining in Indonesia. It also manufactures and sells high pressure laminate and melamine laminated particle boards; and provides harbor management and electricity supply services. In addition, the company engages in hydropower plant industry, real estate, and trading activities. The company was formerly known as PT Kurnia Kapuas Utama Tbk and changed its name to PT Resource Alam Indonesia Tbk in November 2003. PT Resource Alam Indonesia Tbk was founded in 1981 and is headquartered in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10130",
        "website": "http://www.raintbk.com",
        "market_cap": 1145201885184
    },
    "LANNA-R.BK": {
        "short_name": "THE LANNA RESOURCES PUBLIC COMP",
        "long_name": "Lanna Resources Public Company Limited",
        "summary": "Lanna Resources Public Company Limited manufactures and distributes lignite in Thailand and internationally. It operates through five segments: Domestic Coal, Overseas Coal, Ethanol, Wood Pellet, and Soil Conditioner. The company also purchases and sells coal; produces and sells coal, ethanol, and wood pellets; and generates and distributes power. In addition, it is involved in renewable energy, coal trading, and ocean freight shipping businesses. The company was founded in 1985 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10330",
        "website": "http://www.lannar.com",
        "market_cap": 7346157056
    },
    "LANNA.BK": {
        "short_name": "THE LANNA RESOURCES PUBLIC COMP",
        "long_name": "Lanna Resources Public Company Limited",
        "summary": "Lanna Resources Public Company Limited manufactures and distributes lignite in Thailand and internationally. It operates through five segments: Domestic Coal, Overseas Coal, Ethanol, Wood Pellet, and Soil Conditioner. The company also purchases and sells coal; produces and sells coal, ethanol, and wood pellets; and generates and distributes power. In addition, it is involved in renewable energy, coal trading, and ocean freight shipping businesses. The company was founded in 1985 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10330",
        "website": "http://www.lannar.com",
        "market_cap": 8924999680
    },
    "LFD.F": {
        "short_name": "GCM RESOURCES PLC  LS-,01",
        "long_name": "GCM Resources Plc",
        "summary": "GCM Resources Plc operates as a resource exploration and development company. It primarily develops the Phulbari coal and power project that relates to thermal coal and semi-soft coking coal located in Bangladesh. GCM Resources Plc was incorporated in 2003 and is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC1Y 8YZ",
        "website": "http://www.gcmplc.com",
        "market_cap": 10468266
    },
    "MBAP.JK": {
        "short_name": "Mitrabara Adiperdana Tbk.",
        "long_name": "PT Mitrabara Adiperdana Tbk",
        "summary": "PT Mitrabara Adiperdana Tbk, together with its subsidiaries, engages in coal mining, trading, and industrial businesses. It holds interests in coal mines, which cover a total area of 2,960 hectares located in Malinau Regency, North Kalimantan. The company also operates biomass power plants; and provides plantation and forestry services. It sells its products in South Korea, China, the Philippines, Indonesia, Malaysia, New Zealand, Vietnam, Hongkong, Japan, and internationally. The company was founded in 1992 and is headquartered in Jakarta Pusat, Indonesia. PT Mitrabara Adiperdana Tbk is a subsidiary of PT Wahana Sentosa Cemerlang.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10130",
        "website": "http://www.mitrabaraadiperdana.co.id",
        "market_cap": 3571355746304
    },
    "MCM.AX": {
        "short_name": "MCMINING FPO",
        "long_name": "MC Mining Limited",
        "summary": "MC Mining Limited, together with its subsidiaries, acquires, explores, develops, and operates metallurgical and thermal coal projects in South Africa. The company's principal projects include the Uitkomst Colliery, a metallurgical and thermal coal project located in the KwaZulu Natal province; the Makhado hard coking and thermal coal project situated in the Soutpansberg coalfield in the Limpopo province; and the Vele Colliery, a semi-soft coking and thermal coal mine located to the west of Musina in the Limpopo province. Its principal projects also comprise three coking and thermal coal projects, including Chapudi, Generaal, and Mopane located in Limpopo province. The company was formerly known as Coal of Africa Limited and changed its name to MC Mining Limited in November 2017. MC Mining Limited is based in Mount Pleasant, Australia.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Mount Pleasant",
        "zipcode": "6153",
        "website": "http://www.mcmining.co.za",
        "market_cap": 16214099
    },
    "MCM.L": {
        "short_name": "MC MINING LIMITED ORD NPV",
        "long_name": "MC Mining Limited",
        "summary": "MC Mining Limited, together with its subsidiaries, acquires, explores, develops, and operates metallurgical and thermal coal projects in South Africa. The company's principal projects include the Uitkomst Colliery, a metallurgical and thermal coal project located in the KwaZulu Natal province; the Makhado hard coking and thermal coal project situated in the Soutpansberg coalfield in the Limpopo province; and the Vele Colliery, a semi-soft coking and thermal coal mine located to the west of Musina in the Limpopo province. Its principal projects also comprise three coking and thermal coal projects, including Chapudi, Generaal, and Mopane located in Limpopo province. The company was formerly known as Coal of Africa Limited and changed its name to MC Mining Limited in November 2017. MC Mining Limited is based in Mount Pleasant, Australia.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Australia",
        "state": "WA",
        "city": "Mount Pleasant",
        "zipcode": "6153",
        "website": "http://www.mcmining.co.za",
        "market_cap": 10844349
    },
    "MCZ.JO": {
        "short_name": "MC Mining Limited",
        "long_name": "MC Mining Limited",
        "summary": "MC Mining Limited, together with its subsidiaries, acquires, explores, develops, and operates metallurgical and thermal coal projects in South Africa. The company's principal projects include the Uitkomst Colliery, a metallurgical and thermal coal project located in the KwaZulu Natal province; the Makhado hard coking and thermal coal project situated in the Soutpansberg coalfield in the Limpopo province; and the Vele Colliery, a semi-soft coking and thermal coal mine located to the west of Musina in the Limpopo province. Its principal projects also comprise three coking and thermal coal projects, including Chapudi, Generaal, and Mopane located in Limpopo province. The company was formerly known as Coal of Africa Limited and changed its name to MC Mining Limited in November 2017. MC Mining Limited is based in Mount Pleasant, Australia.",
        "currency": "ZAc",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JNB",
        "market": "za_market",
        "country": "Australia",
        "state": "WA",
        "city": "Mount Pleasant",
        "zipcode": "6153",
        "website": "http://www.mcmining.co.za",
        "market_cap": 242074048
    },
    "MERCATOR.NS": {
        "short_name": "MERCATOR LTD",
        "long_name": "Mercator Limited",
        "summary": "Mercator Limited, together with its subsidiaries, engages in shipping, dredging, oil and gas, and coal businesses. It operates in two segments, Shipping; and Coal Mining, Trading and Logistics. The company is involved in coal mining, procurement, and logistics activities. It owns and operates coal mines in Indonesia; and a mining license in Mozambique. The company also explores for petroleum in two blocks located in Cambay basin, Gujarat in India. In addition, it has a fleet of oil tankers and dredgers; and rents and leases water-transport equipment. The company was formerly known as Mercator Lines Limited and changed its name to Mercator Limited in November 2011. Mercator Limited was founded in 1983 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.mercator.in",
        "market_cap": 453688512
    },
    "MOX.V": {
        "short_name": "MORIEN RESOURCES CORP",
        "long_name": "Morien Resources Corp.",
        "summary": "Morien Resources Corp., a mining development company, engages in the identification and purchase of mineral projects in Canada. The company holds royalty interests in the Donkin coal mine located in Cape Breton, Nova Scotia; and the Black Point aggregate project located in Guysborough County, Nova Scotia. Morien Resources Corp. is headquartered in Halifax, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "NS",
        "city": "Halifax",
        "zipcode": "B3J 3M8",
        "website": "http://morienres.com",
        "market_cap": 10192320
    },
    "MYE.AX": {
        "short_name": "MASTERMYNE FPO",
        "long_name": "Mastermyne Group Limited",
        "summary": "Mastermyne Group Limited provides contracting services to the underground long wall mining operations and industrial products and services in coalfields and supporting industries of Queensland and New South Wales, Australia. The company offers various mining services and equipment to the coal mining industry including, new mine development, mine operation, roadway development, conveyors, outbye, ventilation, secondary support, long wall relocations, polymeric emergency strata consolidation, production and ancillary equipment, and mining consumables. It also provides acrow props; cable-hanging brackets; geosorb, quick drive cement, road salt, and safe mark paints; pigtails and brackets, and structure and leg pins; dewatering products comprising snorebox, strainers, and suction strainers; poly droppers, poly sticks, and reflective streamers; spear and trickle dusters; and cable hanging crooks, life line products, and measuring sticks. In addition, the company offers nuts, pipe hanging brackets, pogo sticks and snap jacks, rollers, shoulder pipes and manifolds, ventilation products, visi clips, and webbing straps. Further, it provides training and consulting services; design and engineering services; and manages and maintains mining projects. Additionally, the company engages in machinery hire activities. Mastermyne Group Limited was founded in 1996 and is headquartered in Mackay, Australia.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Mackay",
        "zipcode": "4740",
        "website": "http://www.mastermyne.com.au",
        "market_cap": 93912656
    },
    "MYOH.JK": {
        "short_name": "Samindo Resources Tbk.",
        "long_name": "PT Samindo Resources Tbk",
        "summary": "PT Samindo Resources Tbk, through its subsidiaries, provides coal and other mining services primarily in Indonesia. Its activities include overburden removal, coal getting, coal hauling, and geological mapping and drilling. The company was formerly known as PT Myoh Technology, Tbk and changed its name to PT Samindo Resources Tbk in February 2012. The company was founded in 2000 and is based in South Jakarta, Indonesia. Samindo Resources Tbk is a subsidiary of ST International Corporation.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12930",
        "website": "http://www.samindoresources.com",
        "market_cap": 3088833839104
    },
    "NC": {
        "short_name": "NACCO Industries, Inc.",
        "long_name": "NACCO Industries, Inc.",
        "summary": "NACCO Industries, Inc., together with its subsidiaries, engages in the mining and natural resources businesses. The company operates through three segments: Coal Mining, North American Mining, and Minerals Management. The Coal Mining segment operates surface coal mines under long-term contracts with power generation companies, as well as with activated carbon producers in North Dakota, Texas, Mississippi, Louisiana, and Navajo Nation. The North American Mining segment provides value-added contract mining and other services for producers of aggregates, lithium, and other minerals; and contract mining services for independently owned mines and quarries in Florida. The Minerals Management segment is involved in the leasing of its royalty and mineral interests to third-party exploration and production companies, and other mining companies, which grants them the rights to explore, develop, mine, produce, market, and sell gas, oil, and coal; and provision of surface and mineral acquisition, and lease maintenance services. NACCO Industries, Inc. was founded in 1913 and is headquartered in Cleveland, Ohio.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Cleveland",
        "zipcode": "44124-4069",
        "website": "http://www.nacco.com",
        "market_cap": 195844768
    },
    "NCCL.L": {
        "short_name": "NCONDEZI ENERGY LIMITED ORD NPV",
        "long_name": "Ncondezi Energy Limited",
        "summary": "Ncondezi Energy Limited, a power development company, focuses on the phased development of integrated thermal coal mine and power plant project in Mozambique. The company develops a 300MW integrated power plant and mine to produce and supply electricity to the Mozambican market. It also explores and develops coal mine. The company owns a 100% interest in the Ncondezi Project located in Tete province of Northern Mozambique. The company was formerly known as Ncondezi Coal Company Limited and changed its name to Ncondezi Energy Limited in July 2013. Ncondezi Energy Limited was incorporated in 2006 and is based in Road Town, the British Virgin Islands.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "British Virgin Islands",
        "state": null,
        "city": "Road Town",
        "zipcode": null,
        "website": "http://www.ncondezienergy.com",
        "market_cap": 11584812
    },
    "NCR.AX": {
        "short_name": "NUCOAL FPO",
        "long_name": "NuCoal Resources Limited",
        "summary": "NuCoal Resources Limited explores for coal mines in Australia. The company holds a 100% interest in the Savoy Hill Coal project located in New South Wales. NuCoal Resources Limited was incorporated in 1993 and is based in Newcastle, Australia.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Newcastle",
        "zipcode": "2300",
        "website": "http://nucoal.com.au",
        "market_cap": 8454732
    },
    "NHC.AX": {
        "short_name": "NEW HOPE FPO",
        "long_name": "New Hope Corporation Limited",
        "summary": "New Hope Corporation Limited explores, develops, produces, and processes coal, and oil and gas properties. It operates through three segments: Coal mining in Queensland, Coal mining in New South Wales, and Other. The company has interests in two open cut coal mines in South East Queensland that produce thermal coal, including the New Acland project, which is located in north-west of Oakey, Queensland; and the Jeebropilly coal mine located in the West Moreton region near Ipswich. It also holds interests in oil projects and exploration permits based in the Eromanga Basin of south west Queensland; and two onshore exploration permits in the Otway Basin of south western Victoria. In addition, the company engages in the port management, agriculture, marketing, and logistics activities. It has operations in Japan, China, Taiwan, Chile, Korea, Vietnam, India, Australia, and internationally. The company was founded in 1952 and is based in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.newhopegroup.com.au",
        "market_cap": 953048768
    },
    "NHPEF": {
        "short_name": "NEW HOPE CORPORATION",
        "long_name": "New Hope Corporation Limited",
        "summary": "New Hope Corporation Limited explores, develops, produces, and processes coal, and oil and gas properties. It operates through three segments: Coal mining in Queensland, Coal mining in New South Wales, and Other. The company has interests in two open cut coal mines in South East Queensland that produce thermal coal, including the New Acland project, which is located in north-west of Oakey, Queensland; and the Jeebropilly coal mine located in the West Moreton region near Ipswich. It also holds interests in oil projects and exploration permits based in the Eromanga Basin of south west Queensland; and two onshore exploration permits in the Otway Basin of south western Victoria. In addition, the company engages in the port management, agriculture, marketing, and logistics activities. It has operations in Japan, China, Taiwan, Chile, Korea, Vietnam, India, Australia, and internationally. The company was founded in 1952 and is based in Brisbane, Australia.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.newhopegroup.com.au",
        "market_cap": 1187359616
    },
    "NRP": {
        "short_name": "Natural Resource Partners LP Li",
        "long_name": "Natural Resource Partners L.P.",
        "summary": "Natural Resource Partners L.P., through its subsidiaries, owns, manages, and leases a portfolio of mineral properties in the United States. It operates in two segments, Coal Royalty and Other, and Soda Ash. The company owns interests in coal, soda ash, trona, and other natural resources. Its coal reserves are primarily located in Appalachia, the Illinois Basin, and the Northern Powder River Basin in the United States; industrial minerals and aggregates properties are located in the United States; oil and gas royalty assets located in Louisiana; timber assets located in West Virginia; and trona ore mining operation and soda ash refinery are located in the Green River Basin, Wyoming. The company leases a portion of its reserves in exchange for royalty payments; and owns and leases transportation and processing infrastructure related to coal properties. NRP (GP) LP serves as the general partner of the company. Natural Resource Partners L.P. was founded in 2002 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77002",
        "website": "http://www.nrplp.com",
        "market_cap": 221828112
    },
    "NVAC.F": {
        "short_name": "BANPU PCL -NVDR-  BA 10",
        "long_name": "Banpu Public Company Limited",
        "summary": "Banpu Public Company Limited engages in the coal mining and power businesses. It holds an interest in a 1,434 MW coal-fired power plant in Map Ta Phut Industrial Estate, Rayong Province, Thailand. The company also manages five coal mines in Kalimantan comprising Indominco, Jorong, Kitadin-Embalut, Trubaindo, and Bharinto, which produce a range of bituminous and sub-bituminous thermal coals in Indonesia. In addition, it operates the Gaohe mine in Shanxi Province and Hebi mine in Henan Province; operates and manages 3 coal-fired combined heat and power plants with a capacity of 539 megawatts in China; and owns 10 coal mines located in New South Wales, Australia. Further, the company operates various coal project in Mongolia; thermal power plants in Lao PDR; wind farm in Vietnam; and solar farms in Japan. Additionally, it provides solar rooftop solutions and installation for industries and large businesses; energy storage solutions; electric vehicle and fleet management services; consultation services on customized energy management system; and renewable energy ecosystem for clean energy. The company also involved in the power and steam production, purchase, and trading business; provident fund management; solar power generation; logistics; sales and marketing activities; natural gas business; investment in power and renewable energy; and research and development business. It also provides coal mining and trading; and business consultancy services, as well as fuel trading services. The company was formerly known as Ban Pu Coal Company Limited and changed its name to Banpu Public Company Limited in July 1993. Banpu Public Company Limited was founded in 1983 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10400",
        "website": "http://www.banpu.com",
        "market_cap": 1969307392
    },
    "OD8.F": {
        "short_name": "NEW HOPE CORP. LTD",
        "long_name": "New Hope Corporation Limited",
        "summary": "New Hope Corporation Limited explores, develops, produces, and processes coal, and oil and gas properties. It operates through three segments: Coal mining in Queensland, Coal mining in New South Wales, and Other. The company has interests in two open cut coal mines in South East Queensland that produce thermal coal, including the New Acland project, which is located in north-west of Oakey, Queensland; and the Jeebropilly coal mine located in the West Moreton region near Ipswich. It also holds interests in oil projects and exploration permits based in the Eromanga Basin of south west Queensland; and two onshore exploration permits in the Otway Basin of south western Victoria. In addition, the company engages in the port management, agriculture, marketing, and logistics activities. It has operations in Japan, China, Taiwan, Chile, Korea, Vietnam, India, Australia, and internationally. The company was founded in 1952 and is based in Brisbane, Australia.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.newhopegroup.com.au",
        "market_cap": 1005351744
    },
    "ORCP.L": {
        "short_name": "ORACLE POWER PLC ORD 0.1P",
        "long_name": "Oracle Power plc",
        "summary": "Oracle Power plc engages in the exploration and development of coal in Pakistan. The company is also involved in building a mine-mouth power plant. It primarily holds interests in the Thar Coalfield Block VI license area that covers an area of approximately 9,100 square kilometers located in the Sindh Province of South East Pakistan. The company was formerly known as Oracle Coalfields PLC and changed its name to Oracle Power plc in June 2017. Oracle Power plc was incorporated in 2006 and is based in London, the United Kingdom. Oracle Power plc is a subsidiary of Oracle Power Plc Group.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W2 6BD",
        "website": "http://www.oraclepower.co.uk",
        "market_cap": 10428720
    },
    "PBE.F": {
        "short_name": "PEABODY ENERGY  DL-,01",
        "long_name": "Peabody Energy Corporation",
        "summary": "Peabody Energy Corporation engages in coal mining business in the United States, Japan, Taiwan, Australia, China, India, Vietnam, South Korea, and internationally. The company operates through Seaborne Thermal Mining, Seaborne Metallurgical Mining, Powder River Basin Mining, and Other U.S. Thermal Mining segments. It is involved in mining, preparation, and sale of thermal coal primarily to electric utilities; mining bituminous and sub-bituminous coal deposits; and mining metallurgical coal, such as hard coking coal, semi-hard coking coal, semi-soft coking coal, and pulverized coal injection coal. The company supplies coal primarily to electricity generators, industrial facilities, and steel manufacturers. As of December 31, 2020, it owned interests in 17 coal mining operations located in the United States and Australia; and had approximately 3.0 billion tons of proven and probable coal reserves and approximately 450,000 acres of surface property through ownership and lease agreements. The company also engages in direct and brokered trading of coal and freight-related contracts, as well as provides transportation-related services, which involve financial derivative contracts and physical contracts. Peabody Energy Corporation was founded in 1883 and is headquartered in St. Louis, Missouri.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MO",
        "city": "St. Louis",
        "zipcode": "63101",
        "website": "http://www.peabodyenergy.com",
        "market_cap": 774278400
    },
    "PBMRF": {
        "short_name": "BUMI RESOURCES TBK",
        "long_name": "PT Bumi Resources Tbk",
        "summary": "PT Bumi Resources Tbk, through its subsidiaries, engages in the mining activities in Indonesia. It operates through Coal, Services, Oil and Gas, and Gold segments. The Coal segment engages in the exploration, exploitation, and sale of coal deposits. The Services segment offers marketing and management services. The Oil and Gas segment explores for oil and gas properties. The Gold segment explores for gold properties. It also exports its products. The company was formerly known as PT Bumi Modern Tbk. and changed its name to PT Bumi Resources Tbk in September 2000. PT Bumi Resources Tbk was founded in 1973 and is headquartered in Jakarta, Indonesia. PT Bumi Resources Tbk is a subsidiary of Long Haul Holdings Ltd.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12940",
        "website": "http://www.bumiresources.com",
        "market_cap": 262506720
    },
    "PBMRY": {
        "short_name": "BUMI RESOURCES TBK",
        "long_name": "PT Bumi Resources Tbk",
        "summary": "PT Bumi Resources Tbk, through its subsidiaries, engages in the mining activities in Indonesia. It operates through Coal, Services, Oil and Gas, and Gold segments. The Coal segment engages in the exploration, exploitation, and sale of coal deposits. The Services segment offers marketing and management services. The Oil and Gas segment explores for oil and gas properties. The Gold segment explores for gold properties. It also exports its products. The company was formerly known as PT Bumi Modern Tbk. and changed its name to PT Bumi Resources Tbk in September 2000. PT Bumi Resources Tbk was founded in 1973 and is headquartered in Jakarta, Indonesia. PT Bumi Resources Tbk is a subsidiary of Long Haul Holdings Ltd.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12940",
        "website": "http://www.bumiresources.com",
        "market_cap": 295146368
    },
    "PJM.F": {
        "short_name": "PT BUMI RES.  RP 500",
        "long_name": "PT Bumi Resources Tbk",
        "summary": "PT Bumi Resources Tbk, through its subsidiaries, engages in the mining activities in Indonesia. It operates through Coal, Services, Oil and Gas, and Gold segments. The Coal segment engages in the exploration, exploitation, and sale of coal deposits. The Services segment offers marketing and management services. The Oil and Gas segment explores for oil and gas properties. The Gold segment explores for gold properties. It also exports its products. The company was formerly known as PT Bumi Modern Tbk. and changed its name to PT Bumi Resources Tbk in September 2000. PT Bumi Resources Tbk was founded in 1973 and is headquartered in Jakarta, Indonesia. PT Bumi Resources Tbk is a subsidiary of Long Haul Holdings Ltd.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12940",
        "website": "http://www.bumiresources.com",
        "market_cap": 227396752
    },
    "PNGZF": {
        "short_name": "PARINGA RESOURCES LTD",
        "long_name": "Paringa Resources Limited",
        "summary": "Paringa Resources Limited focuses on exploring for gold and copper tenements in Australia. It holds 100% interest in exploration tenements in the Onslow gold project covering approximately 115 square kilometers located in the Western Australia. The company is based in Perth, Australia.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6000",
        "website": "http://www.paringaresources.com",
        "market_cap": 14163128
    },
    "PNRLY": {
        "short_name": "PARINGA RESOURCES LTD SPON ADS ",
        "long_name": "Paringa Resources Limited",
        "summary": "Paringa Resources Limited focuses on exploring for gold and copper tenements in Australia. It holds 100% interest in exploration tenements in the Onslow gold project covering approximately 115 square kilometers located in the Western Australia. The company is based in Perth, Australia.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6000",
        "website": "http://www.paringaresources.com",
        "market_cap": 485592
    },
    "PTBA.JK": {
        "short_name": "Bukit Asam Tbk.",
        "long_name": "PT Bukit Asam Tbk",
        "summary": "PT Bukit Asam Tbk, together with its subsidiaries, engages in the coal mining activities in Indonesia. The company operates through two segments, Coal Mining and Other. Its coal mining activities include general surveying, exploration, exploitation, processing, refining, transportation, and trading. It manages special coal port facilities; operates steam power plants; and provides consulting services related to the coal mining industry and production. The company also offers briquette processing, mining services, oil palm plantation and processing, and health services. It also operates in India, Taiwan, China, Hong Kong, South Korea, Thailand, Malaysia, the Philippines, Japan, and Vietnam. The company was formerly known as PT Bukit Asam Persero Tbk and changed its name to PT Bukit Asam Tbk in November 2017. PT Bukit Asam Tbk was founded in 1919 and is headquartered in Tanjung Enim Selatan, Indonesia. PT Bukit Asam Tbk is a subsidiary of PT Indonesia Asahan Aluminium.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tanjung Enim Selatan",
        "zipcode": "31716",
        "website": "http://www.ptba.co.id",
        "market_cap": 25499749318656
    },
    "PTIZF": {
        "short_name": "INDO TAMBANGRAYA MEGAH TBK",
        "long_name": "PT Indo Tambangraya Megah Tbk",
        "summary": "PT Indo Tambangraya Megah Tbk, together with its subsidiaries, engages in coal mining activities. The company operates seven mining concessions in the island of Kalimantan covering East, Central, and South Kalimantan. It also owns and operates the Bontang Coal Terminal/BoCT, three loading ports, and Bontang power plant. In addition, the company provides mining support, coal and fuel trading, coal transportation, and alternative energy marketing and support services, as well as engages in electricity generation activity. It primarily sells its coal in Indonesia, India, Pakistan, Taiwan, China, Hong Kong, Korea, Japan, Europe, Australia, and other parts of Southeast Asia. The company was founded in 1987 and is headquartered in South Jakarta, Indonesia. PT Indo Tambangraya Megah Tbk is a subsidiary of Banpu Minerals (Singapore) Pte. Ltd.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12310",
        "website": "http://www.itmg.co.id",
        "market_cap": 917809216
    },
    "RE4.SI": {
        "short_name": "Geo Energy Res",
        "long_name": "Geo Energy Resources Limited",
        "summary": "Geo Energy Resources Limited, an investment holding company, engages in the mining, production, and trading of coal. The company operates through Coal Mining, Coal Trading, and Mining Services segments. The Coal Mining segment engages in the production and sale of coal. The Coal Trading segment is involved in the purchase and sale of coal from third parties. The Mining Services segment provides mining contracting and project management services for mining activities conducted at third party mines. The company owns and operates PT Bumi Enggang Khatulistiwa mining concession that covers approximately 4,570 hectares of land located in Kutai Barat, East Kalimantan; the PT Sungai Danau Jaya mining concession that covers 235.5 hectares of land located in Tanah Bumbu, South Kalimantan; PT Tanah Bumbu Resources mining concession covering an area of 489 hectares of land located in Tanah Bumbu, South Kalimantan; and PT Surya Tambang Tolindo mining concession covering an area of 4,600 hectares in Kutai Barat, East Kalimantan. It also engages in the power generation and general trading activities; and operates as a multimedia supplier, as well as offers management consultant services. The company operates in Indonesia, the People's Republic of China, Thailand, India, the Philippines, Vietnam, Korea, and Pakistan. Geo Energy Resources Limited was founded in 2008 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "018982",
        "website": "http://www.geocoal.com",
        "market_cap": 293846688
    },
    "REFEX.NS": {
        "short_name": "REFEX INDUSTRIES L",
        "long_name": "Refex Industries Limited",
        "summary": "Refex Industries Limited engages in handling and disposal of fly ash from power plants in India. It operates through Coal & Ash Handling Business, Solar Power-Generation and Related Activities, Refrigerant Gases-Manufacturing (Refilling), and Sale of Service segments. The company primarily refills hydrofluorocarbons, which are used in automobile and room air-conditioners, and refrigerating equipment. It also generates and distributes solar power; trades in coal and solar accessories; provides coal crushing and coal yard management services; and consultancy services, such as techo-commercial feasibility study for power evacuation systems, labor services for EPC contracts with respect to the solar business. The company was formerly known as Refex Refrigerants Limited and changed its name to Refex Industries Limited in November 2013. Refex Industries Limited was incorporated in 2002 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600017",
        "website": "http://refex.co.in",
        "market_cap": 3117086208
    },
    "REY.AX": {
        "short_name": "REY RES FPO",
        "long_name": "Rey Resources Limited",
        "summary": "Rey Resources Limited engages in exploring for and developing energy resources in Western Australia. It holds a 40% interest in the Canning Basin petroleum permits EP457 and EP458 (Fitzroy Blocks), and a 100% interest in the Derby Block EP487. The company also holds a 100% interest in the Lennard Shelf Blocks, which comprises a petroleum exploration license EP104, a retention license R1, and one production license L15 in the Canning Basin. In addition, it holds 100% interests in the Duchess Paradise Coal Project located in the Canning Basin. Rey Resources Limited was incorporated in 2004 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.reyresources.com",
        "market_cap": 57220564
    },
    "RHNO": {
        "short_name": "RHINO RESOURCE PARTNERS LP",
        "long_name": "Rhino Resource Partners LP",
        "summary": "Rhino Resource Partners LP, together with its subsidiaries, produces, processes, and sells various grades of steam and metallurgical coal from surface and underground mines in the United States. It operates mines in Kentucky, Ohio, West Virginia, and Utah. The company markets its steam coal primarily to electric utility companies as fuel for their steam powered generators; and metallurgical coal primarily to steel and coke producers. As of December 31, 2018, it controlled an estimated 268.5 million tons of proven and probable coal reserves, consisting of an estimated 214.0 million tons of steam coal and an estimated 54.5 million tons of metallurgical coal; and 164.1 million tons of non-reserve coal deposits. Rhino GP LLC operates as a general partner of the company. The company was founded in 2003 and is based in Lexington, Kentucky. On July 22, 2020, Rhino Resource Partners LP filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the Southern District of Ohio. The plan was later approved as Chapter 11 liquidation on January 15, 2021. It is in joint administration with Hopedale Mining LLC.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "KY",
        "city": "Lexington",
        "zipcode": "40503",
        "website": "http://www.rhinolp.com",
        "market_cap": 978459
    },
    "ROYE": {
        "short_name": "ROYAL ENERGY RESOURCES INC",
        "long_name": "Royal Energy Resources, Inc.",
        "summary": "Royal Energy Resources, Inc. produces and markets coal from surface and underground mines located in Kentucky, Ohio, Utah, and West Virginia in the United States. It provides coal of various steam and metallurgical grades, including steam coal primarily to electric utility companies as fuel for their steam powered generators; and metallurgical coal for steel and coke producers who use its coal to produce coke. As of December 31, 2018, the company had an estimated 268.5 million tons of proven and probable coal reserves consisting of an estimated 214.0 million tons of steam coal and an estimated 54.5 million tons of metallurgical coal. The company was formerly known as World Marketing, Inc. and changed its name to Royal Energy Resources, Inc. in December 2007. Royal Energy Resources, Inc. was founded in 1999 and is headquartered in Charleston, South Carolina. Royal Energy Resources, Inc. is a subsidiary of E-Starts Money Co.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "SC",
        "city": "Charleston",
        "zipcode": "29401",
        "website": "http://www.royalenergy.us",
        "market_cap": 9943615
    },
    "S0D.F": {
        "short_name": "STANMORE RESOURCES LTD.",
        "long_name": "Stanmore Resources Limited",
        "summary": "Stanmore Resources Limited explores for, produces, and sells metallurgical and thermal coal in Australia. The company holds interests in the Isaac Plains, Isaac Downs, Belview, The Range, Lilyvale, Mackenzie, and Clifford projects in the Bowen and Surat basins of Queensland, as well as the Millennium and Mavis Downs mine located near Moranbah, Queensland. It also exports its products. The company was formerly known as Stanmore Coal Limited and changed its name to Stanmore Resources Limited in May 2021. Stanmore Resources Limited was incorporated in 2008 and is headquartered in Brisbane, Australia. Stanmore Resources Limited is a subsidiary of Golden Investments (Australia) Pte. Ltd.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.stanmorecoal.com.au",
        "market_cap": 135023744
    },
    "SGBH": {
        "short_name": "GRAND CHINA ENERGY GROUP LIMITE",
        "long_name": "Grand China Energy Group Limited",
        "summary": "Grand China Energy Group Limited, through its subsidiaries, engages in the exploration, development, mining, production, and sale of coal properties in the People's Republic of China. It owns and operates a coal mine in Shangzhai Village, Yongding County, Longyan City, Fujian Province. The company was formerly known as SGB International Holdings Inc. and changed its name to Grand China Energy Group Limited on August 2014. Grand China Energy Group Limited is based in Causeway Bay, Hong Kong.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": null,
        "market_cap": 53945000
    },
    "SGER.JK": {
        "short_name": "Sumber Global Energy Tbk.",
        "long_name": "PT Sumber Global Energy Tbk",
        "summary": "PT Sumber Global Energy offers coal trading services. The company is based in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "South Jakarta",
        "zipcode": "12930",
        "website": "http://sumberglobalenergy.co.id",
        "market_cap": 469247983616
    },
    "SGQ.TO": {
        "short_name": "SOUTHGOBI RESOURCES LTD",
        "long_name": "SouthGobi Resources Ltd.",
        "summary": "SouthGobi Resources Ltd., together with its subsidiaries, operates as an integrated coal mining, development, and exploration company in Mongolia, Hong Kong, and China. It primarily explores for coking and thermal coal. The company's flagship project is the Ovoot Tolgoi open pit coal mine located in the Umnugobi Aimag of Mongolia. It also engages in the logistics and trading of coal in Mongolia and China. The company was formerly known as SouthGobi Energy Resources Ltd. and changed its name to SouthGobi Resources Ltd. in May 2010. SouthGobi Resources Ltd. was incorporated in 2002 and is based in Mong kok, Hong Kong.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Mong Kok",
        "zipcode": null,
        "website": "http://www.southgobi.com",
        "market_cap": 98329320
    },
    "SGQRF": {
        "short_name": "SOUTHGOBI RESOURCES LTD",
        "long_name": "SouthGobi Resources Ltd.",
        "summary": "SouthGobi Resources Ltd., together with its subsidiaries, operates as an integrated coal mining, development, and exploration company in Mongolia, Hong Kong, and China. It primarily explores for coking and thermal coal. The company's flagship project is the Ovoot Tolgoi open pit coal mine located in the Umnugobi Aimag of Mongolia. It also engages in the logistics and trading of coal in Mongolia and China. The company was formerly known as SouthGobi Energy Resources Ltd. and changed its name to SouthGobi Resources Ltd. in May 2010. SouthGobi Resources Ltd. was incorporated in 2002 and is based in Mong kok, Hong Kong.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Mong Kok",
        "zipcode": null,
        "website": "http://www.southgobi.com",
        "market_cap": 115508688
    },
    "SHGP": {
        "short_name": "SHARPE RESOURCES CORP",
        "long_name": "Sharpe Resources Corporation",
        "summary": "Sharpe Resources Corporation engages in the exploration and development of mineral resources and oil and gas in the western United States. The company primarily focuses on the coal, coal bed methane, and shale gas projects. It principally holds interests in the coal seams on 17,000 acres property located in Preston County, West Virginia. The company was formerly known as Sharpe Energy & Resources Limited and changed its name to Sharpe Resources Corporation in July 1996. Sharpe Resources Corporation was incorporated in 1980 and is based in Heathsville, Virginia.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Heathsville",
        "zipcode": "22473",
        "website": null,
        "market_cap": 249902
    },
    "SML.V": {
        "short_name": "SOUTHSTONE MINERALS LIMITED",
        "long_name": "Southstone Minerals Limited",
        "summary": "Southstone Minerals Limited, a junior mining company, engages in the acquisition, exploration, evaluation, and development of mineral properties in Canada. It holds interest in the Oena Diamond Mine, an alluvial diamond property, which is located in Northern Cape Province in South Africa. The company was formerly known as Tango Mining Limited and changed its name to Southstone Minerals Limited in October 2019. Southstone Minerals Limited was incorporated in 2007 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6M 4E1",
        "website": "http://www.southstoneminerals.com",
        "market_cap": 1365595
    },
    "SMMT.JK": {
        "short_name": "Golden Eagle Energy Tbk.",
        "long_name": "PT Golden Eagle Energy Tbk",
        "summary": "PT Golden Eagle Energy Tbk, together with its subsidiaries, engages in the coal mining business in Indonesia. The company owns interests in a coal concession that covers an area of 3,238 hectares located in Samarinda, East Kalimantan; and three coal concessions covering 2.143 hectares located in Musi Rawas Regency, South Sumatera province. It also offers mining support and coal transportation services. In addition, the company exports its products. The company was formerly known as PT Eatertainment International Tbk and changed its name to PT Golden Eagle Energy Tbk in August 2012. PT Golden Eagle Energy Tbk was founded in 1980 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12950",
        "website": "http://www.go-eagle.co.id",
        "market_cap": 359100022784
    },
    "SMR.AX": {
        "short_name": "STANMORE FPO",
        "long_name": "Stanmore Resources Limited",
        "summary": "Stanmore Resources Limited explores for, produces, and sells metallurgical and thermal coal in Australia. The company holds interests in the Isaac Plains, Isaac Downs, Belview, The Range, Lilyvale, Mackenzie, and Clifford projects in the Bowen and Surat basins of Queensland, as well as the Millennium and Mavis Downs mine located near Moranbah, Queensland. It also exports its products. The company was formerly known as Stanmore Coal Limited and changed its name to Stanmore Resources Limited in May 2021. Stanmore Resources Limited was incorporated in 2008 and is headquartered in Brisbane, Australia. Stanmore Resources Limited is a subsidiary of Golden Investments (Australia) Pte. Ltd.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.stanmorecoal.com.au",
        "market_cap": 196044368
    },
    "SOL.AX": {
        "short_name": "SOUL W.H. FPO",
        "long_name": "Washington H. Soul Pattinson and Company Limited",
        "summary": "Washington H. Soul Pattinson and Company Limited, together with its subsidiaries, engages in the equity investment, mining, and property investment businesses. It is involved in the coal, oil, and gas activities, which include exploration, development, production, processing, associated transport infrastructure, and ancillary activities. The company also engages in zinc, copper, and goldmining activities comprising exploration, mining, and processing of ore into copper concentrate, copper sulphide, and gold. In addition, it produces and sells citrus fruit, macadamia nuts, cereal crops, and cotton products. Further, the company invests in equities, properties, loans, cash, and term deposits. Washington H. Soul Pattinson and Company Limited was founded in 1872 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.whsp.com.au",
        "market_cap": 7509821440
    },
    "TBA.F": {
        "short_name": "BUKIT ASAM TBK  RP 100",
        "long_name": "PT Bukit Asam Tbk",
        "summary": "PT Bukit Asam Tbk, together with its subsidiaries, engages in the coal mining activities in Indonesia. The company operates through two segments, Coal Mining and Other. Its coal mining activities include general surveying, exploration, exploitation, processing, refining, transportation, and trading. It manages special coal port facilities; operates steam power plants; and provides consulting services related to the coal mining industry and production. The company also offers briquette processing, mining services, oil palm plantation and processing, and health services. It also operates in India, Taiwan, China, Hong Kong, South Korea, Thailand, Malaysia, the Philippines, Japan, and Vietnam. The company was formerly known as PT Bukit Asam Persero Tbk and changed its name to PT Bukit Asam Tbk in November 2017. PT Bukit Asam Tbk was founded in 1919 and is headquartered in Tanjung Enim Selatan, Indonesia. PT Bukit Asam Tbk is a subsidiary of PT Indonesia Asahan Aluminium.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tanjung Enim Selatan",
        "zipcode": "31716",
        "website": "http://www.ptba.co.id",
        "market_cap": 1444017152
    },
    "TBNGY": {
        "short_name": "BUKIT ASAM TBK",
        "long_name": "PT Bukit Asam Tbk",
        "summary": "PT Bukit Asam Tbk, together with its subsidiaries, engages in the coal mining activities in Indonesia. The company operates through two segments, Coal Mining and Other. Its coal mining activities include general surveying, exploration, exploitation, processing, refining, transportation, and trading. It manages special coal port facilities; operates steam power plants; and provides consulting services related to the coal mining industry and production. The company also offers briquette processing, mining services, oil palm plantation and processing, and health services. It also operates in India, Taiwan, China, Hong Kong, South Korea, Thailand, Malaysia, the Philippines, Japan, and Vietnam. The company was formerly known as PT Bukit Asam Persero Tbk and changed its name to PT Bukit Asam Tbk in November 2017. PT Bukit Asam Tbk was founded in 1919 and is headquartered in Tanjung Enim Selatan, Indonesia. PT Bukit Asam Tbk is a subsidiary of PT Indonesia Asahan Aluminium.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tanjung Enim Selatan",
        "zipcode": "31716",
        "website": "http://www.ptba.co.id",
        "market_cap": 1764440064
    },
    "TIG.AX": {
        "short_name": "TIG REALM FPO",
        "long_name": "Tigers Realm Coal Limited",
        "summary": "Tigers Realm Coal Limited engages in the identification, exploration, development, mining, and sale of coal deposits in Russia and Asia. The company holds 100% interest in the Amaam North project; and 80% interests in the Amaam project located in the Bering Basin in the Chukotka province, Russia. It also owns and operates the Beringovsky port and coal terminal located to the north east of the Amaam North deposit. Tigers Realm Coal Limited was incorporated in 2010 and is headquartered in Moscow, the Russian Federation.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "125167",
        "website": "http://www.tigersrealmcoal.com",
        "market_cap": 104533600
    },
    "TOBA.JK": {
        "short_name": "TBS Energi Utama Tbk.",
        "long_name": "PT TBS Energi Utama Tbk",
        "summary": "PT TBS Energi Utama Tbk, through its subsidiaries, engages in the coal mining, palm oil plantation, and power generation businesses in Indonesia and internationally. It owns interests in the Adimitra Baratama Nusantara mine covering an area of 2,990 hectares; the Trisensa Mineral Utama that covers an area of 3,414 hectares; and the Indomining mine covering an area of 683 hectares situated in Sangasanga, Kutai Kartanegara, East Kalimantan. The company also trades in coal. In addition, it has palm oil cultivation area totaling 8,633 hectares in Muara Jawa, Sangasanga, and Loa Janan District, Kutai Kartanegara Regency, East Kalimantan; and operates as an independent power producer. The company was formerly known as PT Toba Bara Sejahtra Tbk. PT TBS Energi Utama Tbk was founded in 2007 and is headquartered in Jakarta, Indonesia. PT TBS Energi Utama Tbk is a subsidiary of Highland Strategic Holdings Pte. Ltd.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12190",
        "website": "http://www.tobabara.com",
        "market_cap": 4024979947520
    },
    "UF7N.SG": {
        "short_name": "Golden Energy & Resources Ltd.R",
        "long_name": "Golden Energy and Resources Limited",
        "summary": "Golden Energy and Resources Limited, an investment holding company, engages in the exploration, mining, marketing, and trading of thermal coal. The company operates through Energy Coal, Metallurgical Coal, and Non-Coal Business segments. It holds interests in five coal mining concession areas that covers an area of approximately 66,204 hectares located in South Kalimantan, Central Kalimantan, Jambi, and South Sumatra Basin in Indonesia; and owns forestry concession rights of 265,095 hectares in Kalimantan, as well also owns the rights to mine approximately 2.9 billion tonnes of thermal coal resources with coal reserves of approximately 1.0 billion tonnes. The company also holds interest in 6 development mines to mine approximately 1.7 billion tonnes of energy coal resources with coal reserves of approximately 130 million tonnes in Australia. In addition, it offers management consultancy services. The company is also engaged in mining of gold. Golden Energy and Resources Limited operates in China, Indonesia, India, South Korea, Spain, and internationally. The company is based in Singapore. Golden Energy and Resources Limited is a subsidiary of PT Dian Swastatika Sentosa Tbk.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049705",
        "website": "http://www.gear.com.sg",
        "market_cap": 273466400
    },
    "UKUZ.ME": {
        "short_name": "SOUTHERN KUZBASS C",
        "long_name": "Southern Kuzbass Coal company Public joint-stock company",
        "summary": "Southern Kuzbass Coal company Public joint-stock company produces coking and steam coal in Russia. Its mines are located in Mezhdurechensk, Kemerovo region. The company was founded in 1993 and is based in Mezhdurechensk, Russia. Southern Kuzbass Coal company Public joint-stock company is a subsidiary of Mechel Mining OAO.",
        "currency": "RUB",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Mezhdurechensk",
        "zipcode": "652877",
        "website": "http://www.mechel.com/sector/mining/yuzhnij_kuzbass",
        "market_cap": 21593300992
    },
    "UMS-R.BK": {
        "short_name": "UNIQUE MINING SERVICES PUBLIC C",
        "long_name": "Unique Mining Services Public Company Limited",
        "summary": "Unique Mining Services Public Company Limited, together with its subsidiaries, imports and sells coal in Thailand. It primarily offers bituminous and sub-bituminous coal. The company also engages in the provision of port and barge transportation services; and generating and distributing electricity from other renewable energy, such as wind power, biomass, solar energy, and others. It serves medium and small sized industries, such as food and beverage, pulp and paper, textile, and cement industries. The company was founded in 1994 and is headquartered in Bangkok, Thailand. Unique Mining Services Public Company Limited is a subsidiary of Athene Holding Co., Ltd.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10330",
        "website": "http://www.umspcl.com",
        "market_cap": 1530598400
    },
    "UMS.BK": {
        "short_name": "UNIQUE MINING SERVICES PUBLIC C",
        "long_name": "Unique Mining Services Public Company Limited",
        "summary": "Unique Mining Services Public Company Limited, together with its subsidiaries, imports and sells coal in Thailand. It primarily offers bituminous and sub-bituminous coal. The company also engages in the provision of port and barge transportation services; and generating and distributing electricity from other renewable energy, such as wind power, biomass, solar energy, and others. It serves medium and small sized industries, such as food and beverage, pulp and paper, textile, and cement industries. The company was founded in 1994 and is headquartered in Bangkok, Thailand. Unique Mining Services Public Company Limited is a subsidiary of Athene Holding Co., Ltd.",
        "currency": "THB",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10330",
        "website": "http://www.umspcl.com",
        "market_cap": 1591827968
    },
    "UNIQ.JK": {
        "short_name": "Ulima Nitra Tbk.",
        "long_name": "PT Ulima Nitra Tbk",
        "summary": "PT Ulima Nitra Tbk offers mining services, truck and heavy equipment rental, construction services, and others. The company was founded in 1992 and is based in Palembang, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Palembang",
        "zipcode": "30113",
        "website": "http://www.ulimanitra.co.id",
        "market_cap": 310759030784
    },
    "UXX.F": {
        "short_name": "LUBELSKI WEGIEL BOGD.ZY 5",
        "long_name": "Lubelski Wegiel Bogdanka S.A.",
        "summary": "Lubelski Wegiel Bogdanka S.A. engages in the mining, agglomeration, manufacture, and sale of hard coal for industrial companies in the power industry in Poland. It offers energetic coal for the generation of electric and thermal energy, as well as for use in cement production. The company also provides services to mines, which comprise supply of heat energy; conducting water/wastewater management; recovery and reuse of spoil; mining works, auxiliary works, and run-of-mine services; renovation, repair, and construction services; works in underground machinery departments; and regeneration and production of steel constructions. In addition, it is involved in the construction and refurbishment of heat-generating, water supply, and sewage disposal installations; and sale of goods and materials, as well as provision of transportation services. The company is based in Leczna, Poland. Lubelski Wegiel Bogdanka S.A. is a subsidiary of ENEA S.A.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "state": null,
        "city": "Leczna",
        "zipcode": "21-013",
        "website": "http://www.lw.com.pl",
        "market_cap": 193728640
    },
    "WC2.F": {
        "short_name": "WHITEHAVEN COAL LTD",
        "long_name": "Whitehaven Coal Limited",
        "summary": "Whitehaven Coal Limited develops and operates coal mines in New South Wales and Queensland. The company operates in two segments, Open Cut Operations and Underground Operations. The company operates four mines in North West New South Wales; three open cut mines at Maules Creek, Tarrawonga, Werris Creek, and Sunnyside; and one underground mine at Narrabri. It offers thermal and metallurgical coal. The company sells its coal primarily in Japan, Taiwan, Korea, India, China, Malaysia, Indonesia, Vietnam, the Philippines, New Caledonia, and internationally. Whitehaven Coal Limited was founded in 1999 and is headquartered in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.whitehavencoal.com.au",
        "market_cap": 1353146880
    },
    "WD3.SG": {
        "short_name": "Washington H.Soul Pat.&Co.Ltd.R",
        "long_name": "Washington H. Soul Pattinson and Company Limited",
        "summary": "Washington H. Soul Pattinson and Company Limited, together with its subsidiaries, engages in the equity investment, mining, and property investment businesses. It is involved in the coal, oil, and gas activities, which include exploration, development, production, processing, associated transport infrastructure, and ancillary activities. The company also engages in zinc, copper, and goldmining activities comprising exploration, mining, and processing of ore into copper concentrate, copper sulphide, and gold. In addition, it produces and sells citrus fruit, macadamia nuts, cereal crops, and cotton products. Further, the company invests in equities, properties, loans, cash, and term deposits. Washington H. Soul Pattinson and Company Limited was founded in 1872 and is based in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.whsp.com.au",
        "market_cap": 4784755712
    },
    "WEC.AX": {
        "short_name": "WHITE ENER FPO",
        "long_name": "White Energy Company Limited",
        "summary": "White Energy Company Limited engages in coal technology, coal mining, and exploration businesses in Australia, Indonesia, China, Singapore, South Africa, Mauritius, the United States, and the United Kingdom. The company holds license for the Binderless Coal Briquetting technology, which processes poor quality coal into a higher quality product. White Energy Company Limited is headquartered in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.whiteenergyco.com",
        "market_cap": 96809872
    },
    "WECFF": {
        "short_name": "WHITE ENERGY COMPANY LIMITED",
        "long_name": "White Energy Company Limited",
        "summary": "White Energy Company Limited engages in coal technology, coal mining, and exploration businesses in Australia, Indonesia, China, Singapore, South Africa, Mauritius, the United States, and the United Kingdom. The company holds license for the Binderless Coal Briquetting technology, which processes poor quality coal into a higher quality product. White Energy Company Limited is headquartered in Brisbane, Australia.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.whiteenergyco.com",
        "market_cap": 74161464
    },
    "WHC.AX": {
        "short_name": "WHITEHAVEN FPO",
        "long_name": "Whitehaven Coal Limited",
        "summary": "Whitehaven Coal Limited develops and operates coal mines in New South Wales and Queensland. The company operates in two segments, Open Cut Operations and Underground Operations. The company operates four mines in North West New South Wales; three open cut mines at Maules Creek, Tarrawonga, Werris Creek, and Sunnyside; and one underground mine at Narrabri. It offers thermal and metallurgical coal. The company sells its coal primarily in Japan, Taiwan, Korea, India, China, Malaysia, Indonesia, Vietnam, the Philippines, New Caledonia, and internationally. Whitehaven Coal Limited was founded in 1999 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.whitehavencoal.com.au",
        "market_cap": 2153054464
    },
    "WHITF": {
        "short_name": "WHITEHAVEN COAL LIMITED",
        "long_name": "Whitehaven Coal Limited",
        "summary": "Whitehaven Coal Limited develops and operates coal mines in New South Wales and Queensland. The company operates in two segments, Open Cut Operations and Underground Operations. The company operates four mines in North West New South Wales; three open cut mines at Maules Creek, Tarrawonga, Werris Creek, and Sunnyside; and one underground mine at Narrabri. It offers thermal and metallurgical coal. The company sells its coal primarily in Japan, Taiwan, Korea, India, China, Malaysia, Indonesia, Vietnam, the Philippines, New Caledonia, and internationally. Whitehaven Coal Limited was founded in 1999 and is headquartered in Sydney, Australia.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.whitehavencoal.com.au",
        "market_cap": 1037482048
    },
    "WRLC": {
        "short_name": "WINDROCK LD CO",
        "long_name": "Windrock Land Company",
        "summary": "Windrock Land Company develops natural resources comprising timber, oil, and natural gas in Tennessee. It owns and manages approximately 73,000 acres located in Anderson, Campbell, Morgan, and Roane Counties. The company was formerly known as The Coal Creek Company and changed its name to Windrock Land Company in September 2020. The company was founded in 1872 and is headquartered in Knoxville, Tennessee.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TN",
        "city": "Knoxville",
        "zipcode": "37932",
        "website": "http://windrockland.com",
        "market_cap": null
    },
    "WSL.JO": {
        "short_name": "Wescoal Holdings Ltd",
        "long_name": "Wescoal Holdings Limited",
        "summary": "Wescoal Holdings Limited, through its subsidiaries, engages in mining, processing, selling, and distributing of thermal coal primarily in South Africa. It is involved in the exploration, beneficiation, and mining of bituminous coal; and buys and sells coal to inland customers. The company holds interests in Elandspruit Colliery, Khanyisa Complex Colliery, and Vanggatfontein Colliery mines; and Moabsvelden, Leeuw Braakfontein Colliery, Sterkfontein, and Braakfontein and Rietkuil projects. It also supplies coal by road and rail to power generation and manufacturing sectors; and provides technical support for steam generation. In addition, it engages in the property investment activities. Wescoal Holdings Limited was incorporated in 2005 and is headquartered in Sandton, South Africa.",
        "currency": "ZAc",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2191",
        "website": "http://www.wescoal.com",
        "market_cap": 394721984
    },
    "WWY1.SG": {
        "short_name": "E-Commodities Holdings Ltd. Reg",
        "long_name": "E-Commodities Holdings Limited",
        "summary": "E-Commodities Holdings Limited, together with its subsidiaries, processes and trades in coal and other products. It operates in two segments, Processing and Trading of Coal and Other Products, and Logistics Services. The company also provides supply chain trading and logistics, as well as raw materials processing and washing services. In addition, it operates Yee Link, a platform specializing in intelligent logistic of bulk commodities; E-Coking Coal platform for coking coal supply chain; and E-Petrochem platform. E-Commodities Holdings Limited serves steel mills in the People's Republic of China, Turkey, India, Poland, Brazil, Mongolia, South Korea, the United States, Indonesia, Japan, and internationally. The company was formerly known as Winsway Enterprises Holdings Limited and changed its name to E-Commodities Holdings Limited in August 2016. E-Commodities Holdings Limited was founded in 2007 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100020",
        "website": "http://www.e-comm.com/tc/home.aspx",
        "market_cap": 129306752
    },
    "XPK.F": {
        "short_name": "WHITE ENERGY LTD.",
        "long_name": "White Energy Company Limited",
        "summary": "White Energy Company Limited engages in coal technology, coal mining, and exploration businesses in Australia, Indonesia, China, Singapore, South Africa, Mauritius, the United States, and the United Kingdom. The company holds license for the Binderless Coal Briquetting technology, which processes poor quality coal into a higher quality product. White Energy Company Limited is headquartered in Brisbane, Australia.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.whiteenergyco.com",
        "market_cap": 65191972
    },
    "YA1.F": {
        "short_name": "YANCOAL AUSTRALIA LTD",
        "long_name": "Yancoal Australia Ltd",
        "summary": "Yancoal Australia Ltd engages in the exploration, development, production, and marketing of metallurgical and thermal coal in Japan, Singapore, China, South Korea, Taiwan, Thailand, Australia, and internationally. It owns 95% interests in the Moolarben coal mine located in the Western Coalfields of New South Wales; 100% interests in the Stratford Duralie mines located within the New South Wales Gloucester Basin; 100% interests in the Yarrabee mine located to the northeast of Blackwater in Central Queensland's Bowen Basin; and 80% interests in the Mount Thorley mine and 84.5% interests in the Warkworth mine in the Hunter Valley region of New South Wales. It also manages six other projects in New South Wales, Queensland, and Western Australia. The company was founded in 2004 and is based in Sydney, Australia. Yancoal Australia Ltd is a subsidiary of Yanzhou Coal Mining Company Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.yancoal.com.au",
        "market_cap": 1785176832
    },
    "YA1.SG": {
        "short_name": "Yancoal Australia Ltd. Register",
        "long_name": "Yancoal Australia Ltd",
        "summary": "Yancoal Australia Ltd engages in the exploration, development, production, and marketing of metallurgical and thermal coal in Japan, Singapore, China, South Korea, Taiwan, Thailand, Australia, and internationally. It owns 95% interests in the Moolarben coal mine located in the Western Coalfields of New South Wales; 100% interests in the Stratford Duralie mines located within the New South Wales Gloucester Basin; 100% interests in the Yarrabee mine located to the northeast of Blackwater in Central Queensland's Bowen Basin; and 80% interests in the Mount Thorley mine and 84.5% interests in the Warkworth mine in the Hunter Valley region of New South Wales. It also manages six other projects in New South Wales, Queensland, and Western Australia. The company was founded in 2004 and is based in Sydney, Australia. Yancoal Australia Ltd is a subsidiary of Yanzhou Coal Mining Company Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.yancoal.com.au",
        "market_cap": 1785576704
    },
    "YAL.AX": {
        "short_name": "YANCOAL FPO",
        "long_name": "Yancoal Australia Ltd",
        "summary": "Yancoal Australia Ltd engages in the exploration, development, production, and marketing of metallurgical and thermal coal in Japan, Singapore, China, South Korea, Taiwan, Thailand, Australia, and internationally. It owns 95% interests in the Moolarben coal mine located in the Western Coalfields of New South Wales; 100% interests in the Stratford Duralie mines located within the New South Wales Gloucester Basin; 100% interests in the Yarrabee mine located to the northeast of Blackwater in Central Queensland's Bowen Basin; and 80% interests in the Mount Thorley mine and 84.5% interests in the Warkworth mine in the Hunter Valley region of New South Wales. It also manages six other projects in New South Wales, Queensland, and Western Australia. The company was founded in 2004 and is based in Sydney, Australia. Yancoal Australia Ltd is a subsidiary of Yanzhou Coal Mining Company Limited.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.yancoal.com.au",
        "market_cap": 2706902016
    },
    "YT8.F": {
        "short_name": "INNER MONG.YITAI  H YC 1",
        "long_name": "Inner Mongolia Yitai Coal Co., Ltd.",
        "summary": "Inner Mongolia Yitai Coal Co., Ltd. engages in the mining, production, transportation, and sale of coal products in the Inner Mongolia autonomous region of the People's Republic of China. It operates through three segments: Coal, Coal-Related Chemical, and Transportation. The company also provides road and railway transportation services to coal companies; coal-related chemical products and oil products; and disaster management, supply chain management, industrial development and consultation, business management consultation, and business information consultation services. In addition, it is involved in the coal mining; international trade; goods storage and loading; coal technology development; consultation; infrastructure municipal administration; research and development; oil and coal testing; fund investment and investment management; and chemical production and sale activities. The company was founded in 1997 and is headquartered in Ordos, the People's Republic of China. Inner Mongolia Yitai Coal Co.,Ltd. is a subsidiary of Inner Mongolia Yitai Group Co., Ltd.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Ordos",
        "zipcode": "017000",
        "website": "http://www.yitaicoal.com",
        "market_cap": 413528288
    },
    "YZC.F": {
        "short_name": "YANZHOU COAL MNG H ADR/10",
        "long_name": "Yanzhou Coal Mining Company Limited",
        "summary": "Yanzhou Coal Mining Company Limited primarily engages in the mining, preparation, and sale of coal in China and internationally. It offers thermal, PCI, and coking coal for electric power, metallurgy and chemical industry, etc.; produces and sells coal chemicals, including methanol, liquid wax, stable light hydrocarbon, acetic acid, ethyl acetate, etc., as well as electricity and related heat supply services; and explores for potash mineral. The company also manufactures, installs, repairs, and sells coal mining and excavating equipment, cable, and electrical equipment. In addition, it provides railway, river, and lakes transportation services; and sells construction materials. Further, the company is involved in the wholesale of coal and non-ferrous metals; house and financial leasing; logistics storage and leasing; development of charcoal products; LTCC technology development and equipment rental operations; manufacturing and sale of cable and rubber products; and production and processing of steel engineering components. Additionally, it provides underground mines management; mining materials testing; equity investment fund and corporate asset management, investment advisory and management, foreign investment fund, import and export, and international trading; solar and wind power, and production management; educational software development and event planning; and coal mining technology development, transfer, and consultation services. The company is also involved in the processing, production, and sale of FischerTropsch synthesis catalyst, composite pipe, and plastic profile products; provision of real estate development and operation, property management, garden greening engineering, and sewage treatment and rental housing agency services; and issuing subordinated capital notes. The company was founded in 1973 and is based in Zoucheng, the People's Republic of China. Yanzhou Coal Mining Company Limited is a subsidiary of Yankuang Group Corporation Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Zoucheng",
        "zipcode": "273500",
        "website": "http://www.yanzhoucoal.com.cn",
        "market_cap": 8098316288
    },
    "YZCA.F": {
        "short_name": "YANZHOU COAL MNG  H YC 1",
        "long_name": "Yanzhou Coal Mining Company Limited",
        "summary": "Yanzhou Coal Mining Company Limited primarily engages in the mining, preparation, and sale of coal in China and internationally. It offers thermal, PCI, and coking coal for electric power, metallurgy and chemical industry, etc.; produces and sells coal chemicals, including methanol, liquid wax, stable light hydrocarbon, acetic acid, ethyl acetate, etc., as well as electricity and related heat supply services; and explores for potash mineral. The company also manufactures, installs, repairs, and sells coal mining and excavating equipment, cable, and electrical equipment. In addition, it provides railway, river, and lakes transportation services; and sells construction materials. Further, the company is involved in the wholesale of coal and non-ferrous metals; house and financial leasing; logistics storage and leasing; development of charcoal products; LTCC technology development and equipment rental operations; manufacturing and sale of cable and rubber products; and production and processing of steel engineering components. Additionally, it provides underground mines management; mining materials testing; equity investment fund and corporate asset management, investment advisory and management, foreign investment fund, import and export, and international trading; solar and wind power, and production management; educational software development and event planning; and coal mining technology development, transfer, and consultation services. The company is also involved in the processing, production, and sale of FischerTropsch synthesis catalyst, composite pipe, and plastic profile products; provision of real estate development and operation, property management, garden greening engineering, and sewage treatment and rental housing agency services; and issuing subordinated capital notes. The company was founded in 1973 and is based in Zoucheng, the People's Republic of China. Yanzhou Coal Mining Company Limited is a subsidiary of Yankuang Group Corporation Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Zoucheng",
        "zipcode": "273500",
        "website": "http://www.yanzhoucoal.com.cn",
        "market_cap": 7794141184
    },
    "YZCAY": {
        "short_name": "YANZHOU COAL MINING COMPANY LIM",
        "long_name": "Yanzhou Coal Mining Company Limited",
        "summary": "Yanzhou Coal Mining Company Limited primarily engages in the mining, preparation, and sale of coal in China and internationally. It offers thermal, PCI, and coking coal for electric power, metallurgy and chemical industry, etc.; produces and sells coal chemicals, including methanol, liquid wax, stable light hydrocarbon, acetic acid, ethyl acetate, etc., as well as electricity and related heat supply services; and explores for potash mineral. The company also manufactures, installs, repairs, and sells coal mining and excavating equipment, cable, and electrical equipment. In addition, it provides railway, river, and lakes transportation services; and sells construction materials. Further, the company is involved in the wholesale of coal and non-ferrous metals; house and financial leasing; logistics storage and leasing; development of charcoal products; LTCC technology development and equipment rental operations; manufacturing and sale of cable and rubber products; and production and processing of steel engineering components. Additionally, it provides underground mines management; mining materials testing; equity investment fund and corporate asset management, investment advisory and management, foreign investment fund, import and export, and international trading; solar and wind power, and production management; educational software development and event planning; and coal mining technology development, transfer, and consultation services. The company is also involved in the processing, production, and sale of FischerTropsch synthesis catalyst, composite pipe, and plastic profile products; provision of real estate development and operation, property management, garden greening engineering, and sewage treatment and rental housing agency services; and issuing subordinated capital notes. The company was founded in 1973 and is based in Zoucheng, the People's Republic of China. Yanzhou Coal Mining Company Limited is a subsidiary of Yankuang Group Corporation Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Zoucheng",
        "zipcode": "273500",
        "website": "http://www.yanzhoucoal.com.cn",
        "market_cap": 8757743616
    },
    "YZCHF": {
        "short_name": "YANZHOU COAL MINING COMPANY LIM",
        "long_name": "Yanzhou Coal Mining Company Limited",
        "summary": "Yanzhou Coal Mining Company Limited primarily engages in the mining, preparation, and sale of coal in China and internationally. It offers thermal, PCI, and coking coal for electric power, metallurgy and chemical industry, etc.; produces and sells coal chemicals, including methanol, liquid wax, stable light hydrocarbon, acetic acid, ethyl acetate, etc., as well as electricity and related heat supply services; and explores for potash mineral. The company also manufactures, installs, repairs, and sells coal mining and excavating equipment, cable, and electrical equipment. In addition, it provides railway, river, and lakes transportation services; and sells construction materials. Further, the company is involved in the wholesale of coal and non-ferrous metals; house and financial leasing; logistics storage and leasing; development of charcoal products; LTCC technology development and equipment rental operations; manufacturing and sale of cable and rubber products; and production and processing of steel engineering components. Additionally, it provides underground mines management; mining materials testing; equity investment fund and corporate asset management, investment advisory and management, foreign investment fund, import and export, and international trading; solar and wind power, and production management; educational software development and event planning; and coal mining technology development, transfer, and consultation services. The company is also involved in the processing, production, and sale of FischerTropsch synthesis catalyst, composite pipe, and plastic profile products; provision of real estate development and operation, property management, garden greening engineering, and sewage treatment and rental housing agency services; and issuing subordinated capital notes. The company was founded in 1973 and is based in Zoucheng, the People's Republic of China. Yanzhou Coal Mining Company Limited is a subsidiary of Yankuang Group Corporation Limited.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Zoucheng",
        "zipcode": "273500",
        "website": "http://www.yanzhoucoal.com.cn",
        "market_cap": 8464944640
    }
}