{
    "KGXN.MX": {
        "short_name": "KION GROUP AG",
        "long_name": "KION GROUP AG",
        "summary": "KION GROUP AG provides industrial trucks, warehouse technology, supply chain solutions, and related services worldwide. The company operates through Industrial Trucks and Services, Supply Chain Solutions, and Corporate Services segments. It develops, manufactures, and sells forklifts and warehouse trucks, such as counterbalance trucks with electric drive and internal combustion engine, ride-on and hand-operated industrial trucks, and towing vehicles under the Linde, Fenwick, STILL, Baoli, and OM Voltas brand names. The company also manufactures and sells spare parts; leases industrial trucks and related items; offers maintenance and repair, and fleet management services, as well as provides finance solutions. In addition, it provides integrated technology and software solutions, including conveyors, sorters, storage and retrieval systems, picking equipment, palletizers, and robotic solutions under the Dematic brand. The company was formerly known as KION Holding 1 GmbH. KION GROUP AG was founded in 2006 and is based in Frankfurt am Main, Germany.",
        "currency": "MXN",
        "sector": "Consumer Goods",
        "industry": "Trucks & Other Vehicles",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Germany",
        "state": null,
        "city": "Frankfurt am Main",
        "zipcode": "60549",
        "website": "http://www.kiongroup.com",
        "market_cap": "Large Cap"
    },
    "PETRO.AT": {
        "short_name": "P. PETROPOULOS S.A. (CR)",
        "long_name": "Petros Petropoulos AEBE",
        "summary": "Petros Petropoulos AEBE manufactures, modifies, distributes, and supports a range of automotive products in Greece and internationally. The company operates through three segments: Motor Vehicle, Self-Propelled Machines, and Car Care. It offers trucks and buses under the SCANIA, ISUZU, Allison Transmission, KOGEL, and GETMAN brands; passenger cars under the LAND ROVER and JAGUAR brands; generating sets under the PETROGEN brand; and engines and boats under the ZODIAC, ZODIAC MILPRO, EVINRUDE, AVON, Bombard, SEADOO, can-am, SPYDER, TOHATSU, ISUZU, Perkins, Perkins Marine, KOHLER, LOMBARDINI, LOMBARDINI Marine, SCANIA, and BRIGGS & STRATTON brands. The company also provides agricultural equipment under the McCORMICK, Landini, and Kubota brands; semi trucks under the ISUZU brand; and industrial equipment under the Ingersoll Rand and Sauer Compressors brands. In addition, it offers lubricants under the Shell and Rocol brands; Batteries under the EXIDE and HANKOOK brands; and Tires under the COOPERTIRES, INTERSTATE TIRES, AVON TYRES, and Starfire TIRES brands. The company was founded in 1922 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Consumer Goods",
        "industry": "Trucks & Other Vehicles",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "122 10",
        "website": "http://www.petropoulos.com",
        "market_cap": "Micro Cap"
    }
}