{
    "000409.SZ": {
        "short_name": "SHANDONG GEO-MINER",
        "long_name": "ShanDong Geo-Mineral Co.,Ltd",
        "summary": "ShanDong Geo-Mineral Co.,Ltd mines for ferrous and precious metal deposits. It is also involved in biomedicine, clean energy, tires, real estate development, commodity trading, and other activities. The company was formerly known as Taifu Industry Co., Ltd. and changed its name to ShanDong Geo-Mineral Co.,Ltd in November 2013. ShanDong Geo-Mineral Co.,Ltd was founded in 1993 and is headquartered in Jinan, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Jinan"
    },
    "000598.SZ": {
        "short_name": "CHENGDU XINGRONG E",
        "long_name": "Chengdu Xingrong Environment Co., Ltd.",
        "summary": "Chengdu Xingrong Environment Co., Ltd. provides water utilities and environmental services in China. It produces, distributes, and markets tap water; and operates and manages sewage treatment services comprising municipal sewage, rural sewage, and industrial wastewater services. The company also engages in the investment, design, construction, operation management, technical development and consultation, and technical services of reclaimed water-related projects, as well as maintenance and repair of reclaimed water facilities; and sale of reclaimed water. In addition, it is involved in the design, construction, and consulting of water supply and drainage services; and provides pipeline technical services, such as water supply pipeline leakage control engineering, drainage pipeline inspection, repair and cleaning, pressure pipeline leak point positioning, underground pipeline detection, engineering measurement, data test of pipe networks, and other related technical and consultation services. The company operates 8 waterworks, 13 sewage treatment plants, 2 waste-to-energy plants, 2 leachate treatment plants, and 1 sewage sludge treatment plant. The company was formerly known as Chengdu Xingrong Investment Co., Ltd. and changed its name to Chengdu Xingrong Environment Co., Ltd. in June 2015. Chengdu Xingrong Environment Co., Ltd. was founded in 1995 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Chengdu"
    },
    "000605.SZ": {
        "short_name": "BOHAI WATER INDUST",
        "long_name": "Bohai Water Industry Co.,Ltd",
        "summary": "Bohai Water Industry Co.,Ltd engages in water supply and sewage treatment businesses. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "0270.HK": {
        "short_name": "GUANGDONG INV",
        "long_name": "Guangdong Investment Limited",
        "summary": "Guangdong Investment Limited, together with its subsidiaries, engages in water resources, property investment and development, department store, electric power generation, energy project operation, road and bridge operation, and hotel businesses. The Water Resources segment provides water distribution and sewage treatment services, as well as constructs water supply and sewage treatment infrastructure in Mainland China and Hong Kong. The Property Investment and Development segment invests in various properties, such as shopping malls, office buildings, and hotels in Hong Kong and Mainland China; and develops and sells properties in Mainland China. This segment also provides property management services for various commercial properties. The Department Stores segment operates department stores that sales goods and concessionaire in Mainland China. The Electric Power Generation segment operates coal-fired power plants that supply electricity and steam in the Guangdong province, Mainland China. The Hotel Operation and Management segment operate hotels and manages third parties' hotels in Hong Kong and Mainland China. As of December 31, 2019, this segment managed 35 hotels, including three in Hong Kong, one in Macau, and 31 in Mainland China. The Road and Bridge segment invests in various road and bridge projects, which engages in the toll road operation, and construction and road management in Mainland China. It also provides treasury services in Hong Kong and Mainland China, as well as corporate, finance, and infrastructure services. The company was formerly known as Union Globe Development Limited and changed its name to Guangdong Investment Limited in January 1987. The company was incorporated in 1973 and is headquartered in Central, Hong Kong. Guangdong Investment Limited is a subsidiary of GDH Limited.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0371.HK": {
        "short_name": "BJ ENT WATER",
        "long_name": "Beijing Enterprises Water Group Limited",
        "summary": "Beijing Enterprises Water Group Limited, together with its subsidiaries, provides water services and environmental protection services. The company offers construction services for water treatment plants and renovation projects, as well as provides sewage and reclaimed water treatment; seawater desalination; and technical and consultancy services. In addition, it distributes and sells piped water; and machineries for sewage treatment, as well as licenses technical know-how related to sewage treatment. The company provides its services in the People's Republic of China, Malaysia, Australia, Singapore, Portugal, New Zealand, and the Republic of Botswana. The company was formerly known as Shang Hua Holdings Ltd. and changed its name to Beijing Enterprises Water Group Limited in March 2008. Beijing Enterprises Water Group Limited is headquartered in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0855.HK": {
        "short_name": "CHINA WATER",
        "long_name": "China Water Affairs Group Limited",
        "summary": "China Water Affairs Group Limited, an investment holding company, engages in the water supply, sewage treatment, and property businesses in the People's Republic of China. It operates through City Water Supply Operation and Construction, Environmental Protection, and Property Development and Investment segments. The City Water Supply Operation and Construction segment is involved in the provision of water supply operation and construction services. The Environmental Protection segment engages in the sewage treatment and drainage operation and construction, solid waste and hazardous waste, environmental sanitation, and water environment management businesses. The Property Development and Investment segment develops properties for sale and invests in properties. It is also involved in the development and infrastructure of sightseeing area; provision of water environmental renovation infrastructure; and investment, construction, and operation of water conservation and hydropower related projects, as well as energy conservation and environmental protection and hotel operations. The company was formerly known as China Silver Dragon Group Limited and changed its name to China Water Affairs Group Limited in December 2004. China Water Affairs Group Limited is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "1542.HK": {
        "short_name": "TAIZHOU WATER",
        "long_name": "Taizhou Water Group Co., Ltd.",
        "summary": "Taizhou Water Group Co., Ltd. engages in supplying municipal, tap, and raw water in Mainland China. It is also involved in installation of water pipelines. The company was founded in 1993 and is headquartered in Taizhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Taizhou"
    },
    "2281.HK": {
        "short_name": "XINGLU WATER",
        "long_name": "Luzhou Xinglu Water (Group) Co., Ltd.",
        "summary": "Luzhou Xinglu Water (Group) Co., Ltd., an integrated municipal water service provider, together with its subsidiaries, engages in the tap water supply and wastewater treatment businesses in China. It also provides tap water supply related installation and maintenance services; and construction and upgrading services related to tap water supply and wastewater treatment infrastructure. The company owns 10 tap water plants with a daily supply capacity of approximately 491,500 tons; and has a total of 9 wastewater treatment plants with an aggregate wastewater treatment capacity of 301,000 tons per day. It serves urban and rural residents, industrial and commercial users, local governments, and other institutions. The company was founded in 1958 and is headquartered in Luzhou, the People's Republic of China. Luzhou Xinglu Water (Group) Co., Ltd. is a subsidiary of Luzhou City Xinglu Investment Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Luzhou"
    },
    "27K.SG": {
        "short_name": "Kangda Intl Environmen.Co.Ltd.R",
        "long_name": "Kangda International Environmental Company Limited",
        "summary": "Kangda International Environmental Company Limited, an investment holding company, engages in the urban water treatment, water environment comprehensive remediation, and rural water improvement businesses in People's Republic of China. Its Urban Water Treatment segment is involved in the design, construction, upgradation, and operation of waste water treatment plants (WTP), reclaimed water treatment plants, sludge treatment plants, and water distribution plants; and the operation and maintenance of waste water treatment facilities entrusted by governments. The company's Water Environment Comprehensive Remediation segment engages in the river harnessing and improvement, foul water body treatment, sponge city construction, pipeline network project, and urban comprehensive pipe tunnels construction works. Its Rural Water Improvement segment is involved in the construction and operation of villages, including waste water treatment, pipeline construction for collecting waste water, and rural living environment activities. The company also constructs municipal infrastructure; invests and manages environmental and public infrastructure projects; develops and sells WTP equipment; develops computer software; and sells water purifying materials. It serves municipal, district, or county level governments, as well as their designees. The company was founded in 1996 and is headquartered in Chongqing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "city": "Chongqing"
    },
    "2ZC.F": {
        "short_name": "CADIZ INC.",
        "long_name": "Cadiz Inc.",
        "summary": "Cadiz Inc. operates as a natural resources development company in the United States. It engages in the water resource and agricultural development activities in San Bernardino County properties. The company owns approximately 35,000 acres of land in the Cadiz and Fenner valleys of eastern San Bernardino County; and approximately 11,000 acres of land in the eastern Mojave Desert portion of San Bernardino County. It is also involved in the cultivation of lemons and grapes/raisins, and spring and fall plantings of vegetables on the Cadiz Valley properties. Cadiz Inc. was founded in 1983 and is headquartered in Los Angeles, California.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "300021.SZ": {
        "short_name": "DAYU WATER-SAVING",
        "long_name": "Dayu Water-saving Group Co., Ltd",
        "summary": "Dayu Water-saving Group Co., Ltd engages in the research and development, manufacture, and sale of water-saving irrigation materials in China and internationally. The company offers internal inlay drip tapes, pressure compensated drip tapes, filter systems, irrigation automatic control systems, PE and PVC pipes, drip irrigation fittings, spray irrigation products, PE and PVC pipe fittings, PP connection fittings, sprinklers, and integrated water-fertilizer irrigation systems. It also provides project design, construction, and servicing of water-saving irrigation projects. The company was founded in 1999 and is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Tianjin"
    },
    "300055.SZ": {
        "short_name": "BEIJING WATER BUSI",
        "long_name": "Beijing Water Business Doctor Co., Ltd.",
        "summary": "Beijing Water Business Doctor Co., Ltd. engages in the industrial and municipal water supply business in China. It is also involved in the provision of sewage treatment, industrial production, sludge treatment, and garbage disposal facilities; sewage solutions for hazardous waste treatment plant; coking wastewater solution; petrochemical wastewater solutions; and provision of energy-saving equipment, as well as environmental protection equipment manufacturing activities. The company was founded in 1998 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "300262.SZ": {
        "short_name": "SHANGHAII SAFBON W",
        "long_name": "SafBon Water Service (Holding) Inc.,Shanghai",
        "summary": "SafBon Water Service (Holding) Inc.,Shanghai provides water treatment services in China. The company offers industrial waste water treatment solutions, including lime technology for reclaimed water treatment, membrane bio-reactor technology for reclaimed water treatment, flue gas desulfurization wastewater treatment, zero liquid discharge, and oily water separation technology; municipal water treatment solutions comprising drinking water purification systems and processes, BIOBON process with biological suspending chain aeration system, precoat filtration technology, low impact development system, and sewage treatment for municipal waste water; and membrane and ion exchange solutions, including hi-tower regeneration, power coated, and demineralized water treatment technology. It also provides solid waste treatment solutions, such as hazardous incineration, and the thin film sludge dryer technology; seawater desalination solutions comprising membrane and containerized desalination technology; compressed natural gas (CNG)/liquefied natural gas (LNG) filling stations, LNG gasification stations, natural gas regulation stations, and long distance gas pipelines, as well as combined cooling, heating, and power systems; and sea water flue gas desulfurization technology. In addition, the company offers ceramic flat membrane systems, which removes pollutants like particles and microorganisms and produces clear water free from biological and toxic hazards; and dissolved air flotation systems that treats water and waste water. SafBon Water Service (Holding) Inc.,Shanghai is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "3768.HK": {
        "short_name": "DCWT",
        "long_name": "Kunming Dianchi Water Treatment Co., Ltd.",
        "summary": "Kunming Dianchi Water Treatment Co., Ltd. and its subsidiaries design, develop, construct, operate, and maintain water supply and wastewater treatment facilities in the People's Republic of China. It operates through Wastewater Treatment, Water Supply, and Others segments. The company designs, constructs, operates, and maintains wastewater treatment or water supply facilities under the transfer-operate-transfer (TOT) and build-operate-transfer (BOT) concession agreements. It is also involved in the reclaimed water supply and running water supply; municipal wastewater treatment; water quality testing; provision of logistics and leasing services, and professional training; and manufacture and sale of chemical products. The company was founded in 1989 and is headquartered in Kunming, the People's Republic of China. Kunming Dianchi Water Treatment Co., Ltd. is a subsidiary of Kunming Dianchi Investment Co., Ltd.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Kunming"
    },
    "3PNA.F": {
        "short_name": "PENNON GROUP NEW LS -,407",
        "long_name": "Pennon Group Plc",
        "summary": "Pennon Group Plc engages in the environmental infrastructure businesses in the United Kingdom, rest of European Union, China, and internationally. The company's Water segment comprises the regulated water and wastewater services for customers in Cornwall, Devon, and parts of Dorset and Somerset; and water services in the areas of Dorset, Hampshire, and Wiltshire. It operates 23 raw water reservoirs, 650 wastewater treatment works, 17,515 kilometers wastewater mains network, 18,370 kilometers of drinking water mains network, and 34 drinking water treatment works, as well as serves 2 million population. The company's Waste Management segment provides recycling, energy recovery, and waste management services serving local authorities, as well as 34,000 customers. It operates 11 energy recovery facilities; 200 recycling, energy recovery, and waste management facilities; 6.7 million tonnes of waste materials; and 5.5 million tonnes of recycled or recovered materials. The company's Non-Household Retail Business water and wastewater retail services to non-household customers. It serves 1.2 million businesses and other non-household customers. Pennon Group Plc was founded in 1989 and is based in Exeter, the United Kingdom.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Exeter"
    },
    "5WE.SI": {
        "short_name": "$ Moya Asia",
        "long_name": "Moya Holdings Asia Limited",
        "summary": "Moya Holdings Asia Limited, an investment holding company offers a range of water treatment solutions to government in Indonesia. It offers commissioning, operation, and maintenance of various water treatment plants on design, build, operate, and transfer arrangements. The company also provides management, technical advisory and analysis, and management consultancy services to the clean water industry; and supplies and distributes clean water. It serves approximately 3.5 million people and is connected to approximately 560,000 customers in the Greater Jakarta region. The company was incorporated in 2013 and is based in Singapore. Moya Holdings Asia Limited is a subsidiary of Tamaris Infrastructure Pte. Ltd.",
        "currency": "SGD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "600168.SS": {
        "short_name": "WUHAN SANZHEN INDUSTRY HOLDING ",
        "long_name": "Wuhan Sanzhen Industry Holding Co.,Ltd",
        "summary": "Wuhan Sanzhen Industry Holding Co., Ltd. engages in water production and supply, and sewage treatment activities in China. It is also involved in the construction and operation of tunnels and other infrastructure. The company is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Wuhan"
    },
    "600187.SS": {
        "short_name": "HEILONGJIANG INTERCHINA WATER C",
        "long_name": "Heilongjiang Interchina Water Treatment Co.,Ltd.",
        "summary": "Heilongjiang Interchina Water Treatment Co.,Ltd. engages in the construction and operation of water project in China. The company is involved in the purification and supply of water. It also offers sewage treatment, drainage integration, engineering, and technical services. In addition, the company provides green sustainable energy and project construction services. The company was founded in 1998 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600461.SS": {
        "short_name": "JIANGXI HONGCHENG WATERWORKS CO",
        "long_name": "Jiangxi Hongcheng Waterworks  Co., Ltd.",
        "summary": "Jiangxi Hongcheng Waterworks Co., Ltd. engages in the production and supply of water in China. It is also involved in the operation of sewage treatment plants. The company is based in Nanchang, China. Jiangxi Hongcheng Waterworks Co., Ltd. is a subsidiary of Nanchang Waterworks Group Ltd.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Nanchang"
    },
    "601368.SS": {
        "short_name": "GUANGXI NANNING WATERWORKS CO L",
        "long_name": "Guangxi Nanning Waterworks Co., Ltd.",
        "summary": "Guangxi Nanning Waterworks Co., Ltd. produces and sells water in China. It is also involved in sewage treatment activities; and the construction and operation of water supply and drainage facilities. The company was founded in 2006 and is based in Nanning, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Nanning"
    },
    "603817.SS": {
        "short_name": "FUJIAN HAIXIA ENVIRONMENTAL PRO",
        "long_name": "Fujian Haixia Environmental Protection Group Co.,Ltd.",
        "summary": "Fujian Haixia Environmental Protection Group Co.,Ltd. provides environmental services in China. It offers single and municipal sewage treatment, garbage leachate treatment, industrial wastewater treatment, township sewage treatment, sludge treatment and disposal, solid and hazardous waste disposal, and linen washing services, as well as resource utilization of muck and construction waste. The company was founded in 2002 and is based in Fuzhou, China. Fujian Haixia Environmental Protection Group Co.,Ltd. is a subsidiary of Fuzhou Water Affairs Investment and Development Co., Ltd.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Fuzhou"
    },
    "6136.HK": {
        "short_name": "KANGDA ENV",
        "long_name": "Kangda International Environmental Company Limited",
        "summary": "Kangda International Environmental Company Limited, an investment holding company, engages in the urban water treatment, water environment comprehensive remediation, and rural water improvement businesses in People's Republic of China. Its Urban Water Treatment segment is involved in the design, construction, upgradation, and operation of waste water treatment plants (WTP), reclaimed water treatment plants, sludge treatment plants, and water distribution plants; and the operation and maintenance of waste water treatment facilities entrusted by governments. The company's Water Environment Comprehensive Remediation segment engages in the river harnessing and improvement, foul water body treatment, sponge city construction, pipeline network project, and urban comprehensive pipe tunnels construction works. Its Rural Water Improvement segment is involved in the construction and operation of villages, including waste water treatment, pipeline construction for collecting waste water, and rural living environment activities. The company also constructs municipal infrastructure; invests and manages environmental and public infrastructure projects; develops and sells WTP equipment; develops computer software; and sells water purifying materials. It serves municipal, district, or county level governments, as well as their designees. The company was founded in 1996 and is headquartered in Chongqing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Chongqing"
    },
    "6839.HK": {
        "short_name": "YUNNAN WATER",
        "long_name": "Yunnan Water Investment Co., Limited",
        "summary": "Yunnan Water Investment Co., Limited, an investment holding company, designs, develops, constructs, operates, and maintains municipal water supply and solid wastewater treatment facilities in the People's Republic of China and internationally. It operates through five segments: Wastewater Treatment, Water Supply, Solid Waste Treatment Construction and Sales of Equipment, and Others. It constructs and operates wastewater treatment projects, water supply projects, and solid waste treatment projects; undertakes build and transfer (BT) projects, and engineering-procurement-construction (EPC) projects; and produces, installs, and sells equipment for wastewater treatment, water supply, solid waste treatment, and other infrastructure facilities. The company undertakes operation and maintenance (O&M) projects for wastewater treatment, water supply, and solid waste treatment facilities owned by third parties; and offers technical and consultancy services. As at 31 December 2019, it had 124 concession wastewater treatment projects, including 7 build-own-operate (BOO), 69 build-operate-transfer (BOT), 2 transfer-own-operate (TOO), 21 transfer-operate-transfer (TOT) projects, 2 rehabilitate-operate-transfer (ROT), and 23 municipal environment comprehensive treatment projects, with total daily treatment capacity of approximately 3,380,400 tonnes; 66 concession water supply projects comprising, 15 BOO projects, 35 BOT projects, 11 TOT projects, and 4 municipal environment comprehensive treatment projects with total daily capacity of approximately 224,100 tonnes; 21 solid waste treatment projects with annual treatment capacity of approximately 3,571,000 tonnes; 11 BT projects and 10 EPC projects; and 30 O&M projects. The company was formerly known as Yunnan Water Industry Investment and Development Co., Ltd. and changed its name to Yunnan Water Investment Company Limited in July 2014. The company was founded in 2009 and is headquartered in Kunming, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Kunming"
    },
    "688096.SS": {
        "short_name": "JIANGSU JINGYUAN ENVIRONMENTAL ",
        "long_name": "Jiangsu Jingyuan Environmental Protection Co., Ltd.",
        "summary": "Jiangsu Jingyuan Environmental Protection Co., Ltd. provides professional and integrated water treatment solutions for customers in China and internationally. The company offers industrial waste sewage treatment equipment and systems, including coal-containing wastewater treatment, desulfurization wastewater treatment, zero-emissions, electrocatalytic oxidation treatment, and reclaimed water processing and reuse systems, etc. for use in the wastewater treatment and zero-emission treatment stages. It also provides water supply treatment equipment and systems, such as raw water pretreatment and desalinated water preparation systems that are used in the water supply treatment stage. In addition, the company engages in the consulting, integration, and sales and engineering contracting business. Jiangsu Jingyuan Environmental Protection Co., Ltd. was founded in 1999 and is based in Nantong, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Nantong"
    },
    "688101.SS": {
        "short_name": "SUNTAR ENVIRONMENTAL TECHNOLOGY",
        "long_name": "Suntar Environmental Technology Co., Ltd.",
        "summary": "Suntar Environmental Technology Co., Ltd. provides industrial membrane separation solutions in China. It offers It offers ceramic, spiral, and PP/PE membrane separation; and flow-cel membrane, solvent recovery, membrane bioreactor, and continuous chromatography separation and ion exchange technologies. The company also provides ceramic, spiral wound, hollow fiber, and spiral membranes, as well as lab equipment and IMBRs. It serves customers in biological, chemical engineering, pharmaceutical, and food and beverage industries. The company was founded in 2005 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Xiamen"
    },
    "76W.SG": {
        "short_name": "SJW Group Registered Shares DL ",
        "long_name": "SJW Group",
        "summary": "SJW Group, through its subsidiaries, provides water utility services in the United States. It engages in the production, purchase, storage, purification, distribution, wholesale, and retail sale of water and wastewater services. The company also provides non-tariffed services, including water system operations, maintenance agreements, and antenna site leases; contracted services and sewer operations to water utilities in Connecticut; and a Linebacker, subscription service line protection plan for public drinking water customers, as well as offers repair or replace a leaking or broken water service line, curb box, curb box cover, meter pit, meter pit cover, and meter pit valve. Its water supply consists of groundwater from wells, surface water from watershed run-off and diversion, reclaimed water, and imported water purchased from the Santa Clara Valley Water District. The company offers water service to approximately 231,000 connections that serve approximately one million people residing in portions of the cities of San Jose and Cupertino, as well as in the cities of Campbell, Monte Sereno, Saratoga, and the Town of Los Gatos; and adjacent unincorporated territories in the County of Santa Clara in the State of California. In addition, it provides water service to approximately 18,000 connections, which serve 54,000 people in a service area comprising 246 square miles in the region between San Antonio and Austin, Texas; and 137,000 connections that serve approximately 480,000 people in 80 municipalities in Connecticut and Maine, and approximately 3,000 wastewater connections in Southbury, Connecticut. Further, the company owns undeveloped land in California and Tennessee; and owns and operates commercial buildings and warehouse properties in Tennessee. The company was formerly known as SJW Corp. and changed its name to SJW Group in November 2016. SJW Group was founded in 1866 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "city": "San Jose"
    },
    "A1T.F": {
        "short_name": "AS TALLINNA VESI A EO 0,6",
        "long_name": "AS Tallinna Vesi",
        "summary": "AS Tallinna Vesi, a water utility company, collects, treats, and distributes water for private houses, apartment associations, and commercial customers in Estonia. It principally operates the Ã\u009clemiste water treatment and Paljassaare wastewater treatment plants. The company offers drinking water and wastewater disposal services to approximately 23,600 private customers and businesses, and 450,000 end consumers in Tallinn, as well as to various neighboring municipalities of Tallinn. Its public water supply system comprises approximately 1,180 kilometers of water pipes, 22 water pumping stations, 45 ground water pumping stations, and 91 boreholes; and public sewerage system consist of 1,170 kilometers of wastewater networks, 513 kilometers of storm water networks, and 180 sewage and storm water pumping stations. The company also offers owner supervision and project management services; design work; water and wastewater services; laboratory services; and transportation and road construction services, as well as undertakes pipe construction works. AS Tallinna Vesi was founded in 1967 and is headquartered in Tallinn, Estonia.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Estonia",
        "city": "Tallinn"
    },
    "AEPT": {
        "short_name": "AMERICAN ENERGY PARTNERS INC",
        "long_name": "American Energy Partners, Inc.",
        "summary": "American Energy Partners, Inc., through its subsidiaries, sources, treats, and distributes reclaimed water in the United States. The company engages in the design, construction, and operation of regional water treatment facilities that serve industrial, energy, and government sectors. It also focuses on drilling, operating, and partnership opportunities in the upstream oil and gas space. It also provides geotechnical services. The company is based in Allentown, Pennsylvania.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Allentown"
    },
    "AGUAS-A.SN": {
        "short_name": "AGUAS ANDINAS S.A.",
        "long_name": "Aguas Andinas S.A.",
        "summary": "Aguas Andinas S.A., together with its subsidiaries, operates as a water utility company in Chile. It engages in the catchment of raw water; production, transportation, and distribution of water; and the collection, treatment, and final disposal of sewage. The company also provides integral advisory and management services in sewage and liquid waste; sells equipment and nonconventional renewable energies; develops energy projects relating to sanitation companies; and offers laboratory sampling and environmental analysis services. It delivers potable water, sewerage, and wastewater treatment services to approximately two million residential, commercial, and industrial clients. The company was formerly known as Empresa Metropolitana de Obras Sanitarias and changed its name to Aguas Andinas S.A. in 2001. The company was founded in 1861 and is based in Santiago, Chile. Aguas Andinas S.A. is a subsidiary of Inversiones Aguas Metropolitanas S.A.",
        "currency": "CLP",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "city": "Santiago"
    },
    "ALHEO.PA": {
        "short_name": "H2O INNOVATION INC",
        "long_name": "H2O Innovation Inc.",
        "summary": "H2O Innovation Inc. provides integrated water treatment solutions based on membrane filtration technology. The company operates through three segments: Water Technologies and Services, Specialty Products, and Operation and Maintenance Services. It offers systems and equipment for the production of drinking and industrial process water, reclamation and reuse of water, and desalination of seawater and treatment of wastewater; and provides products and membrane filtration systems' spare parts, such as pumps, valves, membranes, filters, media, and other replacement parts. The company also offers Spectraguard, a membrane pretreatment chemical; OptiClean, a membrane cleaners; and coagulants and flocculants, and membrane preservatives under the PWT brand. In addition, it provides specialty reverse osmosis (RO) membrane chemicals, such as antiscalants, cleaners, flocculants, biocides, and others; laboratory services, including feed water and pretreatment tests, membrane autopsies, and cleaning programs; a line of couplings and fittings; cartridge filter housings, bag filters, strainers, and cartridge filter elements; and maple syrup products and equipment, such as evaporators, RO separators, monitoring solutions, membranes, fittings, tubing, tanks, press filters, and other products. Further, the company offers operation and maintenance services; public works services, including street and drainage maintenance, and solid waste collection; and construction services for water lines, sewer lines, and fire hydrants, as well as leases containerized water or wastewater treatment systems, and pilot units. Additionally, it provides Intelogx, a data analysis and interpretation software solution for monitoring water treatment plant; Clearlogx technology, a patented automation and control technology; and onsite and technical support services. The company also offers water and waste water projects and services. The company was founded in 2000 and is headquartered in Quebec City, Canada.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "Canada",
        "city": "Quebec City"
    },
    "ARTNA": {
        "short_name": "Artesian Resources Corporation",
        "long_name": "Artesian Resources Corporation",
        "summary": "Artesian Resources Corporation, through its subsidiaries, provides water, wastewater, and other services on the Delmarva Peninsula. The company distributes and sells water to residential, commercial, industrial, governmental, municipal, and utility customers, as well as for public and private fire protection in the states of Delaware, Maryland, and Pennsylvania; and offers wastewater collection, treatment infrastructure, and wastewater services to customers in Delaware. It also provides contract water and wastewater services; water, sewer, and internal service line protection plans; and wastewater management services, as well as design, construction, and engineering services. In addition, the company offers services to other water utilities, including operations and billing functions; owns real estate properties, including land for office buildings, a water treatment plant, and wastewater facility; and provides designing, installing, maintaining, and repairing services for storm water management systems. As of December 31, 2019, it served approximately 87,800 metered water customers in Delaware, 2,500 metered water customers in Maryland, and 40 customers in Pennsylvania through 1,331 miles of transmission and distribution mains. Artesian Resources Corporation was founded in 1905 and is headquartered in Newark, Delaware.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Newark"
    },
    "ARTNB": {
        "short_name": "ARTESIAN RESOURCES CORP",
        "long_name": "Artesian Resources Corporation",
        "summary": "Artesian Resources Corporation, through its subsidiaries, provides water, wastewater, and other services on the Delmarva Peninsula. The company distributes and sells water to residential, commercial, industrial, governmental, municipal, and utility customers, as well as for public and private fire protection in the states of Delaware, Maryland, and Pennsylvania; and offers wastewater collection, treatment infrastructure, and wastewater services to customers in Delaware. It also provides contract water and wastewater services; water, sewer, and internal service line protection plans; and wastewater management services, as well as design, construction, and engineering services. In addition, the company offers services to other water utilities, including operations and billing functions; owns real estate properties, including land for office buildings, a water treatment plant, and wastewater facility; and provides designing, installing, maintaining, and repairing services for storm water management systems. As of December 31, 2019, it served approximately 87,800 metered water customers in Delaware, 2,500 metered water customers in Maryland, and 40 customers in Pennsylvania through 1,331 miles of transmission and distribution mains. Artesian Resources Corporation was founded in 1905 and is headquartered in Newark, Delaware.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Newark"
    },
    "AWC.DE": {
        "short_name": "AMERICAN WATER WKS DL-,01",
        "long_name": "American Water Works Company, Inc.",
        "summary": "American Water Works Company, Inc., through its subsidiaries, provides water and wastewater services in the United States. It offers water and wastewater services to approximately 1,700 communities in 16 states serving approximately 3.4 million active customers. The company serves residential customers; commercial customers, such as food and beverage providers, commercial property developers and proprietors, and energy suppliers; fire service and private fire customers; industrial customers, such as large-scale manufacturers, mining, and production operations; public authorities comprising government buildings and other public sector facilities, such as schools and universities; and other utilities and community water and wastewater systems. It also provides various warranty protection programs to residential customers; and water and wastewater services on various military installations. In addition, the company undertakes contracts with municipal customers, primarily to operate and manage water and wastewater facilities, as well as offers other related services. It operates approximately 80 surface water treatment plants; 520 groundwater treatment plants; 140 wastewater treatment plants; 52,500 miles of transmission, distribution, and collection mains and pipes; 1,000 groundwater wells; 1,500 water and wastewater pumping stations; 1,300 treated water storage facilities; and 76 dams. The company serves approximately 15 million people with drinking water, wastewater, and other water-related services in 46 states. The company was founded in 1886 and is headquartered in Camden, New Jersey.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Camden"
    },
    "AWC.F": {
        "short_name": "AMERICAN WATER WKS DL-,01",
        "long_name": "American Water Works Company, Inc.",
        "summary": "American Water Works Company, Inc., through its subsidiaries, provides water and wastewater services in the United States. It offers water and wastewater services to approximately 1,700 communities in 16 states serving approximately 3.4 million active customers. The company serves residential customers; commercial customers, such as food and beverage providers, commercial property developers and proprietors, and energy suppliers; fire service and private fire customers; industrial customers, such as large-scale manufacturers, mining, and production operations; public authorities comprising government buildings and other public sector facilities, such as schools and universities; and other utilities and community water and wastewater systems. It also provides various warranty protection programs to residential customers; and water and wastewater services on various military installations. In addition, the company undertakes contracts with municipal customers, primarily to operate and manage water and wastewater facilities, as well as offers other related services. It operates approximately 80 surface water treatment plants; 520 groundwater treatment plants; 140 wastewater treatment plants; 52,500 miles of transmission, distribution, and collection mains and pipes; 1,000 groundwater wells; 1,500 water and wastewater pumping stations; 1,300 treated water storage facilities; and 76 dams. The company serves approximately 15 million people with drinking water, wastewater, and other water-related services in 46 states. The company was founded in 1886 and is headquartered in Camden, New Jersey.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Camden"
    },
    "AWK": {
        "short_name": "American Water Works Company, I",
        "long_name": "American Water Works Company, Inc.",
        "summary": "American Water Works Company, Inc., through its subsidiaries, provides water and wastewater services in the United States. It offers water and wastewater services to approximately 1,700 communities in 16 states serving approximately 3.4 million active customers. The company serves residential customers; commercial customers, such as food and beverage providers, commercial property developers and proprietors, and energy suppliers; fire service and private fire customers; industrial customers, such as large-scale manufacturers, mining, and production operations; public authorities comprising government buildings and other public sector facilities, such as schools and universities; and other utilities and community water and wastewater systems. It also provides various warranty protection programs to residential customers; and water and wastewater services on various military installations. In addition, the company undertakes contracts with municipal customers, primarily to operate and manage water and wastewater facilities, as well as offers other related services. It operates approximately 80 surface water treatment plants; 520 groundwater treatment plants; 140 wastewater treatment plants; 52,500 miles of transmission, distribution, and collection mains and pipes; 1,000 groundwater wells; 1,500 water and wastewater pumping stations; 1,300 treated water storage facilities; and 76 dams. The company serves approximately 15 million people with drinking water, wastewater, and other water-related services in 46 states. The company was founded in 1886 and is headquartered in Camden, New Jersey.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Camden"
    },
    "AWK.MX": {
        "short_name": "AMERICAN WATER WORKS COMPANY IN",
        "long_name": "American Water Works Company, Inc.",
        "summary": "American Water Works Company, Inc., through its subsidiaries, provides water and wastewater services in the United States. It offers water and wastewater services to approximately 1,700 communities in 16 states serving approximately 3.4 million active customers. The company serves residential customers; commercial customers, such as food and beverage providers, commercial property developers and proprietors, and energy suppliers; fire service and private fire customers; industrial customers, such as large-scale manufacturers, mining, and production operations; public authorities comprising government buildings and other public sector facilities, such as schools and universities; and other utilities and community water and wastewater systems. It also provides various warranty protection programs to residential customers; and water and wastewater services on various military installations. In addition, the company undertakes contracts with municipal customers, primarily to operate and manage water and wastewater facilities, as well as offers other related services. It operates approximately 80 surface water treatment plants; 520 groundwater treatment plants; 140 wastewater treatment plants; 52,500 miles of transmission, distribution, and collection mains and pipes; 1,000 groundwater wells; 1,500 water and wastewater pumping stations; 1,300 treated water storage facilities; and 76 dams. The company serves approximately 15 million people with drinking water, wastewater, and other water-related services in 46 states. The company was founded in 1886 and is headquartered in Camden, New Jersey.",
        "currency": "MXN",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Camden"
    },
    "AWK.VI": {
        "short_name": "AMERICAN WATER WORKS COMPANY",
        "long_name": "American Water Works Company, Inc.",
        "summary": "American Water Works Company, Inc., through its subsidiaries, provides water and wastewater services in the United States. It offers water and wastewater services to approximately 1,700 communities in 16 states serving approximately 3.4 million active customers. The company serves residential customers; commercial customers, such as food and beverage providers, commercial property developers and proprietors, and energy suppliers; fire service and private fire customers; industrial customers, such as large-scale manufacturers, mining, and production operations; public authorities comprising government buildings and other public sector facilities, such as schools and universities; and other utilities and community water and wastewater systems. It also provides various warranty protection programs to residential customers; and water and wastewater services on various military installations. In addition, the company undertakes contracts with municipal customers, primarily to operate and manage water and wastewater facilities, as well as offers other related services. It operates approximately 80 surface water treatment plants; 520 groundwater treatment plants; 140 wastewater treatment plants; 52,500 miles of transmission, distribution, and collection mains and pipes; 1,000 groundwater wells; 1,500 water and wastewater pumping stations; 1,300 treated water storage facilities; and 76 dams. The company serves approximately 15 million people with drinking water, wastewater, and other water-related services in 46 states. The company was founded in 1886 and is headquartered in Camden, New Jersey.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "Camden"
    },
    "AWR": {
        "short_name": "American States Water Company",
        "long_name": "American States Water Company",
        "summary": "American States Water Company, through its subsidiaries, provides water and electric services to residential, industrial, and other customers in the United States. It operates through three segments: Water, Electric, and Contracted Services. The company purchases, produces, distributes, and sells water, as well as distributes electricity. As of February 24, 2020, it provided water service to approximately 261,000 customers located throughout 10 counties in Northern, Coastal, and Southern California; and distributed electricity to approximately 24,000 customers in the City of Big Bear and surrounding areas in San Bernardino County, California. The company also provides water and/or wastewater services, including the operation, maintenance, and construction of facilities at the water and/or wastewater systems at various military installations. American States Water Company was founded in 1929 and is headquartered in San Dimas, California.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "San Dimas"
    },
    "BJWTF": {
        "short_name": "BEIJING ENTERPRISES WATER GP LT",
        "long_name": "Beijing Enterprises Water Group Limited",
        "summary": "Beijing Enterprises Water Group Limited, together with its subsidiaries, provides water services and environmental protection services. The company offers construction services for water treatment plants and renovation projects, as well as provides sewage and reclaimed water treatment; seawater desalination; and technical and consultancy services. In addition, it distributes and sells piped water; and machineries for sewage treatment, as well as licenses technical know-how related to sewage treatment. The company provides its services in the People's Republic of China, Malaysia, Australia, Singapore, Portugal, New Zealand, and the Republic of Botswana. The company was formerly known as Shang Hua Holdings Ltd. and changed its name to Beijing Enterprises Water Group Limited in March 2008. Beijing Enterprises Water Group Limited is headquartered in Wanchai, Hong Kong.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "CDZI": {
        "short_name": "Cadiz, Inc.",
        "long_name": "Cadiz Inc.",
        "summary": "Cadiz Inc. operates as a natural resources development company in the United States. It engages in the water resource and agricultural development activities in San Bernardino County properties. The company owns approximately 35,000 acres of land in the Cadiz and Fenner valleys of eastern San Bernardino County; and approximately 11,000 acres of land in the eastern Mojave Desert portion of San Bernardino County. It is also involved in the cultivation of lemons and grapes/raisins, and spring and fall plantings of vegetables on the Cadiz Valley properties. Cadiz Inc. was founded in 1983 and is headquartered in Los Angeles, California.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "CSMG3.SA": {
        "short_name": "COPASA      ON      NM",
        "long_name": "Companhia de Saneamento de Minas Gerais",
        "summary": "Companhia de Saneamento de Minas Gerais plans, designs, performs, expands, remodels, manages, and provides water supply and sewage treatment services in Brazil and internationally. It operates through Water Services, Sewage Services, and Solid Waste segments. The company offers collection, recycling, treatment, and final disposal of urban, domestic, and industrial waste; and draining and management of rainwater in urban areas in cities of the North of Minas Gerais, as well as the water basins of the Jequitinhonha, Mucuri, SÃ£o Mateus, BuranhÃ©m, ItanhÃ©m, and JucuruÃ§u rivers. As of December 31, 2019, it had 641 concessions to provide water services; and 311 concessions to offer sewage services. The company was formerly known as Companhia Mineira de Ã\u0081gua e Esgotos and changed its name to Companhia de Saneamento de Minas Gerais in November 1974. Companhia de Saneamento de Minas Gerais was founded in 1963 and is headquartered in Belo Horizonte, Brazil.",
        "currency": "BRL",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "Belo Horizonte"
    },
    "CUBB.F": {
        "short_name": "CHINA WAT.AFF.GRP NEW",
        "long_name": "China Water Affairs Group Limited",
        "summary": "China Water Affairs Group Limited, an investment holding company, engages in the water supply, sewage treatment, and property businesses in the People's Republic of China. It operates through City Water Supply Operation and Construction, Environmental Protection, and Property Development and Investment segments. The City Water Supply Operation and Construction segment is involved in the provision of water supply operation and construction services. The Environmental Protection segment engages in the sewage treatment and drainage operation and construction, solid waste and hazardous waste, environmental sanitation, and water environment management businesses. The Property Development and Investment segment develops properties for sale and invests in properties. It is also involved in the development and infrastructure of sightseeing area; provision of water environmental renovation infrastructure; and investment, construction, and operation of water conservation and hydropower related projects, as well as energy conservation and environmental protection and hotel operations. The company was formerly known as China Silver Dragon Group Limited and changed its name to China Water Affairs Group Limited in December 2004. China Water Affairs Group Limited is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "CWAFF": {
        "short_name": "CHINA WATER AFFAIR GROUP LTD",
        "long_name": "China Water Affairs Group Limited",
        "summary": "China Water Affairs Group Limited, an investment holding company, engages in the water supply, sewage treatment, and property businesses in the People's Republic of China. It operates through City Water Supply Operation and Construction, Environmental Protection, and Property Development and Investment segments. The City Water Supply Operation and Construction segment is involved in the provision of water supply operation and construction services. The Environmental Protection segment engages in the sewage treatment and drainage operation and construction, solid waste and hazardous waste, environmental sanitation, and water environment management businesses. The Property Development and Investment segment develops properties for sale and invests in properties. It is also involved in the development and infrastructure of sightseeing area; provision of water environmental renovation infrastructure; and investment, construction, and operation of water conservation and hydropower related projects, as well as energy conservation and environmental protection and hotel operations. The company was formerly known as China Silver Dragon Group Limited and changed its name to China Water Affairs Group Limited in December 2004. China Water Affairs Group Limited is headquartered in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "CWCO": {
        "short_name": "Consolidated Water Co. Ltd.",
        "long_name": "Consolidated Water Co. Ltd.",
        "summary": "Consolidated Water Co. Ltd., together with its subsidiaries, designs, constructs, manages, and operates water production and treatment plants primarily in the Cayman Islands, the Bahamas, Indonesia, and the United States. The company operates through four segments: Retail, Bulk, Services, and Manufacturing. It uses reverse osmosis technology to produce potable water from seawater. The company produces and supplies water to end-users, including residential, commercial, and government customers, as well as government-owned distributors. It also provides design, engineering, construction, procurement, and management services for desalination projects and plants. In addition, the company manufactures and services a range of water-related products, including reverse osmosis desalination equipment, membrane separation equipment, filtration equipment, piping systems, vessels, and custom fabricated components; and provides design, engineering, consulting, management, inspection, training, and equipment maintenance services for commercial, municipal, and industrial water production, supply, and treatment, as well as wastewater treatment. Consolidated Water Co. Ltd. was founded in 1973 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "CWT": {
        "short_name": "California Water Service Group",
        "long_name": "California Water Service Group",
        "summary": "California Water Service Group, through its subsidiaries, provides water utility and other related services in California, Washington, New Mexico, and Hawaii. It is involved in the production, purchase, storage, treatment, testing, distribution, and sale of water for domestic, industrial, public, and irrigation uses, as well as for fire protection. The company offers its services to approximately 486,900 customer connections in 100 California communities; approximately 5,000 water and wastewater customer connections on the islands of Maui and Hawaii; approximately 17,700 customer connections in the Tacoma and Olympia areas in Washington; and approximately 8,300 water and wastewater customer connections in the Belen, Los Lunas, Indian Hills, and Elephant Butte areas in New Mexico. It also engages in the provision of non-regulated water-related services, including operating municipally owned water systems, privately owned water, and recycled water distribution systems; providing water system operation, meter reading, and billing services to private companies and municipalities; leasing communication antenna sites on its properties to telecommunication companies; billing optional third-party insurance programs to its residential customers; and providing lab services. California Water Service Group was founded in 1926 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "D2O.AX": {
        "short_name": "DUXTON FPO",
        "long_name": "Duxton Water Limited",
        "summary": "Duxton Water Limited provides water supply solutions through its water entitlements. It serves various agricultural industries, including dairy, viticulture, citrus, broadacre, olives, almonds, and dried fruit. The company was incorporated in 2016 and is based in Stirling, Australia.",
        "currency": "AUD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Stirling"
    },
    "DOMWF": {
        "short_name": "DOMINION WATER RESERVES CORP",
        "long_name": "Dominion Water Reserves Corp.",
        "summary": "Dominion Water Reserves Corp. acquires, manages, and develops spring water assets. The company was founded in 2015 and is headquartered in Montreal, Canada.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Montreal"
    },
    "DWR.CN": {
        "short_name": "DominionWater",
        "long_name": "Dominion Water Reserves Corp.",
        "summary": "Dominion Water Reserves Corp. acquires, manages, and develops spring water assets. The company was founded in 2015 and is headquartered in Montreal, Canada.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Montreal"
    },
    "EASTW-R.BK": {
        "short_name": "EASTERN WATER RESOURCES DEVELOP",
        "long_name": "Eastern Water Resources Development and Management Public Company Limited",
        "summary": "Eastern Water Resources Development and Management Public Company Limited, together with its subsidiaries, develops and manages water distribution pipeline systems in the eastern seaboard area of Thailand. It produces and supplies tap water; provides waste treatment, waterworks management, operation and maintenance management, and engineering services; recycles water; supplies raw water; and offers renewable energy management services. Eastern Water Resources Development and Management Public Company Limited was founded in 1992 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "EASTW.BK": {
        "short_name": "EASTERN WATER RESOURCES DEVELOP",
        "long_name": "Eastern Water Resources Development and Management Public Company Limited",
        "summary": "Eastern Water Resources Development and Management Public Company Limited, together with its subsidiaries, develops and manages water distribution pipeline systems in the eastern seaboard area of Thailand. It produces and supplies tap water; provides waste treatment, waterworks management, operation and maintenance management, and engineering services; recycles water; supplies raw water; and offers renewable energy management services. Eastern Water Resources Development and Management Public Company Limited was founded in 1992 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "ESSBIO-C.SN": {
        "short_name": "ESSBIO SA",
        "long_name": "Essbio S.A.",
        "summary": "Essbio S.A. primarily engages in the catchment, decantation, filtration, disinfection, purification, storage, and distribution of water. It also provides sewage collection and treatment, sludge treatment, and liquid industrial waste treatment services; sewers maintenance services; and project management, advisory, and technical assistance for rural health services. The company serves agro-industrial, forestry, port, and mining sectors, as well as commercial and residential customers primarily in the regions of O'Higgins and BiobÃ­o in Chile. Essbio S.A. was founded in 1990 and is based in ConcepciÃ³n, Chile.",
        "currency": "CLP",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "city": "ConcepciÃ³n"
    },
    "ESVAL-C.SN": {
        "short_name": "ESVAL S.A.",
        "long_name": "Esval S.A.",
        "summary": "Esval S.A. produces and distributes drinking water in Chile. It also engages in the collection, decontamination, and disposal of wastewater and sewage. The company provides services in the municipalities of Valparaiso, except Panquehue, OlmuÃ©, Juan Fernandez, Santo Domingo, and Easter Island. It also offers potable water services in Algarrobo. Esval S.A. was founded in 1989 and is based in ValparaÃ­so, Chile.",
        "currency": "CLP",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "city": "ValparaÃ­so"
    },
    "EYP.F": {
        "short_name": "EYDAP S.A. INH  EO 0,6",
        "long_name": "Athens Water Supply and Sewerage Company S.A.",
        "summary": "Athens Water Supply and Sewerage Company S.A., together with its subsidiaries, engages in water supply, and sewerage and waste management activities in Greece. The company is involved in the analysis, construction, establishment, operation, exploitation, maintenance, expansion, and modernization/renewal of water supply and sewerage installation and networks. It operates a water distribution network of 14,000 kilometers; four units of water refining with a total daily capacity of 1.8 million cubic water meters; a sewerage network of 9,500 kilometers, which primarily includes main collectors system and the secondary sewerage network; and three waste management centers in Psitalia, Metamorphosi, and Thriasio. The company also engages in irrigation and rain water collection activities. In addition, it produces electric energy through hydro, biogas, natural gas, and thermal energy sources. Athens Water Supply and Sewerage Company S.A. was founded in 1980 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "F1P.F": {
        "short_name": "TTW PCL -FGN-  BA 1",
        "long_name": "TTW Public Company Limited",
        "summary": "TTW Public Company Limited, together with its subsidiaries, produces and sells treated water in Thailand. The company supplies water to the Provincial Waterworks Authority in the Amphur Nakorn Chaisri, Amphur Sam Pran, and Amphur Budha Monthon areas of Nakhon Pathom; and Amphur Muang and Amphur Kratumban areas of Samut Sakhon under the water purchase agreement. It is also involved in the management of water production and distribution systems, and waste water treatment systems; and operation and maintenance of water supply project. The company was formerly known as Thai Tap Water Supply Public Company Limited and changed its name to TTW Public Company Limited in April 2014. The company was incorporated in 2000 and is headquartered in Nakhon Pathom, Thailand.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Nakhon Pathom"
    },
    "F1P2.F": {
        "short_name": "TTW PCL  -NVDR- BA1",
        "long_name": "TTW Public Company Limited",
        "summary": "TTW Public Company Limited, together with its subsidiaries, produces and sells treated water in Thailand. The company supplies water to the Provincial Waterworks Authority in the Amphur Nakorn Chaisri, Amphur Sam Pran, and Amphur Budha Monthon areas of Nakhon Pathom; and Amphur Muang and Amphur Kratumban areas of Samut Sakhon under the water purchase agreement. It is also involved in the management of water production and distribution systems, and waste water treatment systems; and operation and maintenance of water supply project. The company was formerly known as Thai Tap Water Supply Public Company Limited and changed its name to TTW Public Company Limited in April 2014. The company was incorporated in 2000 and is headquartered in Nakhon Pathom, Thailand.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Nakhon Pathom"
    },
    "FHW.F": {
        "short_name": "FERNHEIZ.NEUKOELLN O.N.",
        "long_name": "Fernheizwerk Neukölln Aktiengesellschaft",
        "summary": "Fernheizwerk NeukÃ¶lln Aktiengesellschaft operates as a district heating supplier. The company generates and distributes heating energy to approximately 40,000 households, as well as various department stores, hotels, other commercial and industrial customers, and public facilities primarily in the district of NeukÃ¶lln, Berlin. It also generates electricity; and rents commercial premises. The company was founded in 1911 and is based in Berlin, Germany.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Germany",
        "city": "Berlin"
    },
    "GGDVF": {
        "short_name": "GUANGDONG INVESTMENT",
        "long_name": "Guangdong Investment Limited",
        "summary": "Guangdong Investment Limited, together with its subsidiaries, engages in water resources, property investment and development, department store, electric power generation, energy project operation, road and bridge operation, and hotel businesses. The Water Resources segment provides water distribution and sewage treatment services, as well as constructs water supply and sewage treatment infrastructure in Mainland China and Hong Kong. The Property Investment and Development segment invests in various properties, such as shopping malls, office buildings, and hotels in Hong Kong and Mainland China; and develops and sells properties in Mainland China. This segment also provides property management services for various commercial properties. The Department Stores segment operates department stores that sales goods and concessionaire in Mainland China. The Electric Power Generation segment operates coal-fired power plants that supply electricity and steam in the Guangdong province, Mainland China. The Hotel Operation and Management segment operate hotels and manages third parties' hotels in Hong Kong and Mainland China. As of December 31, 2019, this segment managed 35 hotels, including three in Hong Kong, one in Macau, and 31 in Mainland China. The Road and Bridge segment invests in various road and bridge projects, which engages in the toll road operation, and construction and road management in Mainland China. It also provides treasury services in Hong Kong and Mainland China, as well as corporate, finance, and infrastructure services. The company was formerly known as Union Globe Development Limited and changed its name to Guangdong Investment Limited in January 1987. The company was incorporated in 1973 and is headquartered in Central, Hong Kong. Guangdong Investment Limited is a subsidiary of GDH Limited.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "GGDVY": {
        "short_name": "GUANGDONG INVESTMENT",
        "long_name": "Guangdong Investment Limited",
        "summary": "Guangdong Investment Limited, together with its subsidiaries, engages in water resources, property investment and development, department store, electric power generation, energy project operation, road and bridge operation, and hotel businesses. The Water Resources segment provides water distribution and sewage treatment services, as well as constructs water supply and sewage treatment infrastructure in Mainland China and Hong Kong. The Property Investment and Development segment invests in various properties, such as shopping malls, office buildings, and hotels in Hong Kong and Mainland China; and develops and sells properties in Mainland China. This segment also provides property management services for various commercial properties. The Department Stores segment operates department stores that sales goods and concessionaire in Mainland China. The Electric Power Generation segment operates coal-fired power plants that supply electricity and steam in the Guangdong province, Mainland China. The Hotel Operation and Management segment operate hotels and manages third parties' hotels in Hong Kong and Mainland China. As of December 31, 2019, this segment managed 35 hotels, including three in Hong Kong, one in Macau, and 31 in Mainland China. The Road and Bridge segment invests in various road and bridge projects, which engages in the toll road operation, and construction and road management in Mainland China. It also provides treasury services in Hong Kong and Mainland China, as well as corporate, finance, and infrastructure services. The company was formerly known as Union Globe Development Limited and changed its name to Guangdong Investment Limited in January 1987. The company was incorporated in 1973 and is headquartered in Central, Hong Kong. Guangdong Investment Limited is a subsidiary of GDH Limited.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "GWR.TO": {
        "short_name": "GLOBAL WATER RESOURCES INC",
        "long_name": "Global Water Resources, Inc.",
        "summary": "Global Water Resources, Inc., a water resource management company, owns, operates, and manages regulated water, wastewater, and recycled water utilities primarily in metropolitan Phoenix, Arizona. As of December 31, 2019, it served approximately 61,000 people in 23,000 homes. The company was founded in 2003 and is based in Phoenix, Arizona.",
        "currency": "CAD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "United States",
        "city": "Phoenix"
    },
    "GWRS": {
        "short_name": "Global Water Resources, Inc.",
        "long_name": "Global Water Resources, Inc.",
        "summary": "Global Water Resources, Inc., a water resource management company, owns, operates, and manages regulated water, wastewater, and recycled water utilities primarily in metropolitan Phoenix, Arizona. As of December 31, 2019, it served approximately 61,000 people in 23,000 homes. The company was founded in 2003 and is based in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Phoenix"
    },
    "HEOFF": {
        "short_name": "H2O INNOVATION INC",
        "long_name": "H2O Innovation Inc.",
        "summary": "H2O Innovation Inc. provides integrated water treatment solutions based on membrane filtration technology. The company operates through three segments: Water Technologies and Services, Specialty Products, and Operation and Maintenance Services. It offers systems and equipment for the production of drinking and industrial process water, reclamation and reuse of water, and desalination of seawater and treatment of wastewater; and provides products and membrane filtration systems' spare parts, such as pumps, valves, membranes, filters, media, and other replacement parts. The company also offers Spectraguard, a membrane pretreatment chemical; OptiClean, a membrane cleaners; and coagulants and flocculants, and membrane preservatives under the PWT brand. In addition, it provides specialty reverse osmosis (RO) membrane chemicals, such as antiscalants, cleaners, flocculants, biocides, and others; laboratory services, including feed water and pretreatment tests, membrane autopsies, and cleaning programs; a line of couplings and fittings; cartridge filter housings, bag filters, strainers, and cartridge filter elements; and maple syrup products and equipment, such as evaporators, RO separators, monitoring solutions, membranes, fittings, tubing, tanks, press filters, and other products. Further, the company offers operation and maintenance services; public works services, including street and drainage maintenance, and solid waste collection; and construction services for water lines, sewer lines, and fire hydrants, as well as leases containerized water or wastewater treatment systems, and pilot units. Additionally, it provides Intelogx, a data analysis and interpretation software solution for monitoring water treatment plant; Clearlogx technology, a patented automation and control technology; and onsite and technical support services. The company also offers water and waste water projects and services. The company was founded in 2000 and is headquartered in Quebec City, Canada.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Quebec City"
    },
    "HNRC": {
        "short_name": "HOUSTON NAT RES CORP",
        "long_name": "Houston Natural Resources Corp.",
        "summary": "Houston Natural Resources Corp., together with its subsidiaries, engages in the recycling and remediation of oil produced contaminates. It provides oil field waste water treatment and disposal services through a reclamation plant located in south Texas. The company was formerly known as Worldwide Diversified Holdings, Inc. and changed its name to Houston Natural Resources Corp. in June 2020. Houston Natural Resources Corp. is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "HYFXF": {
        "short_name": "HYFLUX",
        "long_name": "Hyflux Ltd",
        "summary": "Hyflux Ltd provides various solutions in water and energy areas worldwide. The company operates through two segments, Municipal and Industrial. The Municipal segment supplies a range of infrastructure solutions, including water, power, and waste-to-energy to municipalities and governments. The Industrial segment supplies infrastructure solutions for water to industrial customers. The company provides seawater desalination, raw water purification, wastewater cleaning, water recycling, water reclamation, and pure water production services to municipal and industrial clients, as well as to home consumers; and filtration and purification products. It also designs, constructs, owns, operates, and sells water treatment, seawater desalination, wastewater treatment, and water recycling plants under service concession arrangements; and sells oxygen-rich water and related products and services. In addition, the company designs, constructs, owns, operates, and sells power plants and waste-to-energy plants; trades in the electricity markets; and sells retail electricity contracts. Hyflux Ltd was founded in 1989 and is headquartered in Singapore.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "IAM.SN": {
        "short_name": "INVERSIONES AGUAS",
        "long_name": "Inversiones Aguas Metropolitanas S.A.",
        "summary": "Inversiones Aguas Metropolitanas S.A., through its subsidiaries, engages in the sanitation business in Chile. The company operates through Water and Non-Water segments. The Water Utility segment produces and distributes potable water; and collects and treats sewage water. The Non-Water segment provides outsourcing services in the operations of industrial waste and excess organic load treatment plants; and engineering services, as well as sells products, including pipes, valves, taps, and other related items. The company is also involved in the physical, chemical, and biological analysis of water, air, and solids; and the conversion of biogas to bio-methane. It provides sanitation services to residential, commercial, and industrial customers. The company was founded in 1999 and is based in Las Condes, Chile. Inversiones Aguas Metropolitanas S.A. is a subsidiary of Suez Inversiones Aguas del Gran Santiago Ltda.",
        "currency": "CLP",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "city": "Las Condes"
    },
    "MLEDR.PA": {
        "short_name": "EAUX DE ROYAN",
        "long_name": "Compagnie des Eaux de Royan",
        "summary": "Compagnie des Eaux de Royan engages in the distribution of drinkable water and related services in France. It also offers waste water sanitation and piping installation services. The company is based in Vaux-sur-Mer, France. Compagnie des Eaux de Royan is a subsidiary of Saur France S.A.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Vaux-sur-Mer"
    },
    "MPIR": {
        "short_name": "EMPIRE DIVERSIFIED ENERGY INC",
        "long_name": "Empire Diversified Energy, Inc.",
        "summary": "Empire Diversified Energy, Inc., a development stage company, undertakes Green Energy projects in the United States. The company's project include Fly Ash Remediation project at major southeastern utilities in the United States; and develops a new hybrid fuel pellets. Empire Diversified Energy, Inc. was founded in 1986 and is headquartered in Fort Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Fort Lauderdale"
    },
    "MSEX": {
        "short_name": "Middlesex Water Company",
        "long_name": "Middlesex Water Company",
        "summary": "Middlesex Water Company owns and operates regulated water utility and wastewater systems. It operates in two segments, Regulated and Non-Regulated. The Regulated segment collects, treats, and distributes water on a retail and wholesale basis to residential, commercial, industrial, and fire protection customers in parts of New Jersey, Delaware, and Pennsylvania. This segment also includes regulated wastewater systems in New Jersey and Delaware. The Non-Regulated segment provides non-regulated contract services for the operation and maintenance of municipal and private water and wastewater systems in New Jersey and Delaware. Middlesex Water Company was founded in 1897 and is headquartered in Iselin, New Jersey.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Iselin"
    },
    "MSX.SG": {
        "short_name": "MIDDLESEX WATER CO. Registered ",
        "long_name": "Middlesex Water Company",
        "summary": "Middlesex Water Company owns and operates regulated water utility and wastewater systems. It operates in two segments, Regulated and Non-Regulated. The Regulated segment collects, treats, and distributes water on a retail and wholesale basis to residential, commercial, industrial, and fire protection customers in parts of New Jersey, Delaware, and Pennsylvania. This segment also includes regulated wastewater systems in New Jersey and Delaware. The Non-Regulated segment provides non-regulated contract services for the operation and maintenance of municipal and private water and wastewater systems in New Jersey and Delaware. Middlesex Water Company was founded in 1897 and is headquartered in Iselin, New Jersey.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "city": "Iselin"
    },
    "MWTCF": {
        "short_name": "MANILA WATER COMPANY",
        "long_name": "Manila Water Company, Inc.",
        "summary": "Manila Water Company, Inc., together with its subsidiaries, provides water treatment, water distribution, sewerage, and sanitation services to residential, commercial, industrial, and semi-business customers in the Philippines, Thailand, Vietnam, Indonesia, and internationally. It also offers pipe laying and integrated used water services, as well as sells purified water in selected areas in Metro Manila; and bulk water in the province of Cebu. The company provides its services to approximately six million people in the six encompassing 23 cities and municipalities, including Makati, Mandaluyong, Pasig, Pateros, San Juan, Taguig, Marikina, Quezon City, and Manila, as well as various towns of Rizal. Manila Water Company, Inc. was founded in 1997 and is based in Quezon City, the Philippines. Manila Water Company, Inc. is a subsidiary of Ayala Corporation.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "city": "Quezon City"
    },
    "MWTCY": {
        "short_name": "MANILA WATER COMPANY",
        "long_name": "Manila Water Company, Inc.",
        "summary": "Manila Water Company, Inc., together with its subsidiaries, provides water treatment, water distribution, sewerage, and sanitation services to residential, commercial, industrial, and semi-business customers in the Philippines, Thailand, Vietnam, Indonesia, and internationally. It also offers pipe laying and integrated used water services, as well as sells purified water in selected areas in Metro Manila; and bulk water in the province of Cebu. The company provides its services to approximately six million people in the six encompassing 23 cities and municipalities, including Makati, Mandaluyong, Pasig, Pateros, San Juan, Taguig, Marikina, Quezon City, and Manila, as well as various towns of Rizal. Manila Water Company, Inc. was founded in 1997 and is based in Quezon City, the Philippines. Manila Water Company, Inc. is a subsidiary of Ayala Corporation.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "city": "Quezon City"
    },
    "NESW": {
        "short_name": "NEW ENGLAND SERVICE CO",
        "long_name": "New England Service Company, Inc.",
        "summary": "New England Service Company, Inc. engages in the operation, management, and financing of water utilities and other related services in New Hampshire, Massachusetts, Rhode Island, and Connecticut. The company's Residential Services division provides plumbing; water softener and treatment; backflow testing and repairs; water service line installation; carpentry; and handy man services. Its water system operations division offers sampling and testing; primary operator; project engineering and consulting; accounting and billing; valve and main locating; and on-call services. It also offers water and sewer service line maintenance services. The company's Regulatory Services division provides water sampling services, as well as meter testing, repair, and installation services. New England Service Company, Inc. was founded in 1997 and is headquartered in Plainville, Connecticut.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Plainville"
    },
    "PCYO": {
        "short_name": "Pure Cycle Corporation",
        "long_name": "Pure Cycle Corporation",
        "summary": "Pure Cycle Corporation designs, constructs, operates, and maintains water and wastewater systems in the Denver metropolitan area and Colorado Front Range in the United States. It operates in two segments, Wholesale Water and Wastewater Services, and Land Development. The company engages in the wholesale water production, storage, treatment, and distribution systems; wastewater collection and treatment systems; development of master planned community; and oil and gas leasing business. It serves domestic, commercial, and industrial customers in the Denver metropolitan region. Pure Cycle Corporation was founded in 1976 and is based in Watkins, Colorado.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Watkins"
    },
    "PEGRF": {
        "short_name": "PENNON GROUP",
        "long_name": "Pennon Group Plc",
        "summary": "Pennon Group Plc engages in the environmental infrastructure businesses in the United Kingdom, rest of European Union, China, and internationally. The company's Water segment comprises the regulated water and wastewater services for customers in Cornwall, Devon, and parts of Dorset and Somerset; and water services in the areas of Dorset, Hampshire, and Wiltshire. It operates 23 raw water reservoirs, 650 wastewater treatment works, 17,515 kilometers wastewater mains network, 18,370 kilometers of drinking water mains network, and 34 drinking water treatment works, as well as serves 2 million population. The company's Waste Management segment provides recycling, energy recovery, and waste management services serving local authorities, as well as 34,000 customers. It operates 11 energy recovery facilities; 200 recycling, energy recovery, and waste management facilities; 6.7 million tonnes of waste materials; and 5.5 million tonnes of recycled or recovered materials. The company's Non-Household Retail Business water and wastewater retail services to non-household customers. It serves 1.2 million businesses and other non-household customers. Pennon Group Plc was founded in 1989 and is based in Exeter, the United Kingdom.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Exeter"
    },
    "PEGRY": {
        "short_name": "PENNON GROUP",
        "long_name": "Pennon Group Plc",
        "summary": "Pennon Group Plc engages in the environmental infrastructure businesses in the United Kingdom, rest of European Union, China, and internationally. The company's Water segment comprises the regulated water and wastewater services for customers in Cornwall, Devon, and parts of Dorset and Somerset; and water services in the areas of Dorset, Hampshire, and Wiltshire. It operates 23 raw water reservoirs, 650 wastewater treatment works, 17,515 kilometers wastewater mains network, 18,370 kilometers of drinking water mains network, and 34 drinking water treatment works, as well as serves 2 million population. The company's Waste Management segment provides recycling, energy recovery, and waste management services serving local authorities, as well as 34,000 customers. It operates 11 energy recovery facilities; 200 recycling, energy recovery, and waste management facilities; 6.7 million tonnes of waste materials; and 5.5 million tonnes of recycled or recovered materials. The company's Non-Household Retail Business water and wastewater retail services to non-household customers. It serves 1.2 million businesses and other non-household customers. Pennon Group Plc was founded in 1989 and is based in Exeter, the United Kingdom.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Exeter"
    },
    "PICO": {
        "short_name": "PICO Holdings Inc.",
        "long_name": "PICO Holdings, Inc.",
        "summary": "PICO Holdings, Inc., together with its subsidiaries, engages in the water resource and water storage activities in the southwestern United States. It engages in selling its water rights and storage credits in Arizona, Colorado, Nevada, and New Mexico. The Company sells its water rights to real estate developers, power generating facilities, or other commercial and industrial users, as well as to water utilities, municipalities, and other government agencies; and sells its stored water to state agencies, commercial developers, or municipalities for their commercial projects or communities. It also leases and sells water assets and land. PICO Holdings, Inc. was founded in 1981 and is based in Carson City, Nevada.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Carson City"
    },
    "PNN.L": {
        "short_name": "PENNON GROUP PLC ORD 40.7P",
        "long_name": "Pennon Group Plc",
        "summary": "Pennon Group Plc engages in the environmental infrastructure businesses in the United Kingdom, rest of European Union, China, and internationally. The company's Water segment comprises the regulated water and wastewater services for customers in Cornwall, Devon, and parts of Dorset and Somerset; and water services in the areas of Dorset, Hampshire, and Wiltshire. It operates 23 raw water reservoirs, 650 wastewater treatment works, 17,515 kilometers wastewater mains network, 18,370 kilometers of drinking water mains network, and 34 drinking water treatment works, as well as serves 2 million population. The company's Waste Management segment provides recycling, energy recovery, and waste management services serving local authorities, as well as 34,000 customers. It operates 11 energy recovery facilities; 200 recycling, energy recovery, and waste management facilities; 6.7 million tonnes of waste materials; and 5.5 million tonnes of recycled or recovered materials. The company's Non-Household Retail Business water and wastewater retail services to non-household customers. It serves 1.2 million businesses and other non-household customers. Pennon Group Plc was founded in 1989 and is based in Exeter, the United Kingdom.",
        "currency": "GBp",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Exeter"
    },
    "PO3.AX": {
        "short_name": "PURIFLOH FPO",
        "long_name": "PuriflOH Limited",
        "summary": "PuriflOH Limited provides indoor air purification, water sanitation, and medical sterilization products in Australia. Its free radical generator technology produces a range of reactive oxygen species that include hydroxyl radical, superoxide radical, oxygen radical, and the ozone molecule. The company was formerly known as Water Resources Group Limited and changed its name to PuriflOH Limited in May 2018. PuriflOH Limited was founded in 2007 and is based in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "SAJA.F": {
        "short_name": "CIA SANEAMENTO BA.ADR/2",
        "long_name": "Companhia de Saneamento Básico do Estado de São Paulo - SABESP",
        "summary": "Companhia de Saneamento BÃ¡sico do Estado de SÃ£o Paulo - SABESP provides water and sewage services to residential, commercial, industrial, and governmental customers. It provides water supply, sanitary sewage, urban rainwater management and drainage, urban cleaning, and solid waste management services, as well as related activities, including the planning, operation, maintenance, and commercialization of energy. As of December 31, 2019, the company provided water services through 9.9 million water connections to approximately 27.1 million people; and sewage services through 8.3 million sewage connections to approximately 23.8 million people, as well as operated 81,324 kilometers of water pipes and water transmission lines, and 55,983 kilometers of sewer lines. It also offers water and/or sewage services to other municipalities through special purpose companies. The company was founded in 1954 and is headquartered in SÃ£o Paulo, Brazil.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "SAPR11.SA": {
        "short_name": "SANEPAR     UNT     N2",
        "long_name": "Companhia de Saneamento do Paraná - SANEPAR",
        "summary": "Companhia de Saneamento do ParanÃ¡ - SANEPAR provides sanitation services in Brazil. The company is involved in the water treatment and distribution; and collection and treatment of sewage and solid waste, as well as study, project, and construction work of facilities. It also offers advisory and technical assistance services for related activities. The company provides sanitary services in 345 municipalities of ParanÃ¡ and Santa Catarina. It operates approximately 168 water treatment plants; 1,104 wells; 249 sewage treatment plants; and 3 landfills. The company was founded in 1963 and is headquartered in Curitiba, Brazil.",
        "currency": "BRL",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "Curitiba"
    },
    "SAPR3.SA": {
        "short_name": "SANEPAR     ON      N2",
        "long_name": "Companhia de Saneamento do Paraná - SANEPAR",
        "summary": "Companhia de Saneamento do ParanÃ¡ - SANEPAR provides sanitation services in Brazil. The company is involved in the water treatment and distribution; and collection and treatment of sewage and solid waste, as well as study, project, and construction work of facilities. It also offers advisory and technical assistance services for related activities. The company provides sanitary services in 345 municipalities of ParanÃ¡ and Santa Catarina. It operates approximately 168 water treatment plants; 1,104 wells; 249 sewage treatment plants; and 3 landfills. The company was founded in 1963 and is headquartered in Curitiba, Brazil.",
        "currency": "BRL",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "Curitiba"
    },
    "SAPR4.SA": {
        "short_name": "SANEPAR     PN      N2",
        "long_name": "Companhia de Saneamento do Paraná - SANEPAR",
        "summary": "Companhia de Saneamento do ParanÃ¡ - SANEPAR provides sanitation services in Brazil. The company is involved in the water treatment and distribution; and collection and treatment of sewage and solid waste, as well as study, project, and construction work of facilities. It also offers advisory and technical assistance services for related activities. The company provides sanitary services in 345 municipalities of ParanÃ¡ and Santa Catarina. It operates approximately 168 water treatment plants; 1,104 wells; 249 sewage treatment plants; and 3 landfills. The company was founded in 1963 and is headquartered in Curitiba, Brazil.",
        "currency": "BRL",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "Curitiba"
    },
    "SBS": {
        "short_name": "Companhia de saneamento Basico ",
        "long_name": "Companhia de Saneamento Básico do Estado de São Paulo - SABESP",
        "summary": "Companhia de Saneamento BÃ¡sico do Estado de SÃ£o Paulo - SABESP provides water and sewage services to residential, commercial, industrial, and governmental customers. It provides water supply, sanitary sewage, urban rainwater management and drainage, urban cleaning, and solid waste management services, as well as related activities, including the planning, operation, maintenance, and commercialization of energy. As of December 31, 2019, the company provided water services through 9.9 million water connections to approximately 27.1 million people; and sewage services through 8.3 million sewage connections to approximately 23.8 million people, as well as operated 81,324 kilometers of water pipes and water transmission lines, and 55,983 kilometers of sewer lines. It also offers water and/or sewage services to other municipalities through special purpose companies. The company was founded in 1954 and is headquartered in SÃ£o Paulo, Brazil.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "SBSP3.SA": {
        "short_name": "SABESP      ON      NM",
        "long_name": "Companhia de Saneamento Básico do Estado de São Paulo - SABESP",
        "summary": "Companhia de Saneamento BÃ¡sico do Estado de SÃ£o Paulo - SABESP provides water and sewage services to residential, commercial, industrial, and governmental customers. It provides water supply, sanitary sewage, urban rainwater management and drainage, urban cleaning, and solid waste management services, as well as related activities, including the planning, operation, maintenance, and commercialization of energy. As of December 31, 2019, the company provided water services through 9.9 million water connections to approximately 27.1 million people; and sewage services through 8.3 million sewage connections to approximately 23.8 million people, as well as operated 81,324 kilometers of water pipes and water transmission lines, and 55,983 kilometers of sewer lines. It also offers water and/or sewage services to other municipalities through special purpose companies. The company was founded in 1954 and is headquartered in SÃ£o Paulo, Brazil.",
        "currency": "BRL",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Brazil",
        "city": "SÃ£o Paulo"
    },
    "SEV.PA": {
        "short_name": "SUEZ",
        "long_name": "Suez SA",
        "summary": "Suez SA, together with its subsidiaries, engages in the water cycle and waste cycle management business in France, Europe, North America, South America, Africa, the Middle East, and the Asia-Pacific. The company operates through five segments: Water Europe, Recycling and Recovery Europe, International, Water Technologies & Solutions, and Other. It provides water distribution and treatment services to individuals, local authorities, and industrial clients; and waste collection and treatment services, including collection, sorting, recycling, composting, energy recovery, and landfilling for non-hazardous and hazardous waste for local authorities and industrial clients. The company also offers water network management services; technical assistance, operation, cleaning, and maintenance services; and spare parts, refurbishment, and associated services, as well as designs and operates storage facilities for hazardous and non-hazardous residual waste. In addition, it provides resource management consulting services; engineering and construction contracts and other services; and digital technology solutions for resource and asset protection, as well as deconstructs sites in the end-of-life phase and decontaminates soil and water tables. The company serves food and beverage, chemical and pharmaceutical, construction, site deconstruction and soil decontamination, mining, oil and gas, power, and pulp and paper industries. Suez SA was founded in 1869 and is headquartered in Paris, France.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Paris"
    },
    "SGXXF": {
        "short_name": "SOUND GLOBAL LTD",
        "long_name": "Sound Global Ltd.",
        "summary": "Sound Global Ltd., an investment holding company, provides water and wastewater treatment solutions in the People's Republic of China, Singapore, and Bangladesh. It operates in three segments: Turnkey Projects and Services; Equipment Fabrications; and Operations and Maintenance of Water Supply and Wastewater Treatment Facilities. The company designs, constructs, operates, and maintains water and wastewater treatment facilities; and manufactures water and wastewater treatment equipment. It is also involved in the municipal water supply, wastewater treatment, and water recycling and reuse; research and development of water treatment technologies and provision of services of technology consultation; labor subcontracting activities; and leasing of construction machinery and equipment. In addition, the company plans, designs, constructs, and manages industrial zone water management systems, municipal wastewater projects, and water supply projects; and offers integrated solutions in various fields, such as industrial water supply, desalination, and industrial wastewater treatment and cyclical reuse, as well as centralized treatment for water supply and drainage in industrial zones. Further, it engages in the integration of water supply and drainage in villages and small towns; industrial and residential properties construction, and engineering design and construction activities; sale of building materials; leasing of properties; and computer software development activities. Additionally, the company offers equity investment management and consulting services; and property management and maintenance services. The company was formerly known as Epure International Ltd. and changed its name to Sound Global Ltd. in May 2010. Sound Global Ltd. was founded in 1993 and is based in Singapore. Sound Global Ltd. is a subsidiary of Sound Water (BVI) Limited.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "SJW": {
        "short_name": "SJW Group",
        "long_name": "SJW Group",
        "summary": "SJW Group, through its subsidiaries, provides water utility services in the United States. It engages in the production, purchase, storage, purification, distribution, wholesale, and retail sale of water and wastewater services. The company also provides non-tariffed services, including water system operations, maintenance agreements, and antenna site leases; contracted services and sewer operations to water utilities in Connecticut; and a Linebacker, subscription service line protection plan for public drinking water customers, as well as offers repair or replace a leaking or broken water service line, curb box, curb box cover, meter pit, meter pit cover, and meter pit valve. Its water supply consists of groundwater from wells, surface water from watershed run-off and diversion, reclaimed water, and imported water purchased from the Santa Clara Valley Water District. The company offers water service to approximately 231,000 connections that serve approximately one million people residing in portions of the cities of San Jose and Cupertino, as well as in the cities of Campbell, Monte Sereno, Saratoga, and the Town of Los Gatos; and adjacent unincorporated territories in the County of Santa Clara in the State of California. In addition, it provides water service to approximately 18,000 connections, which serve 54,000 people in a service area comprising 246 square miles in the region between San Antonio and Austin, Texas; and 137,000 connections that serve approximately 480,000 people in 80 municipalities in Connecticut and Maine, and approximately 3,000 wastewater connections in Southbury, Connecticut. Further, the company owns undeveloped land in California and Tennessee; and owns and operates commercial buildings and warehouse properties in Tennessee. The company was formerly known as SJW Corp. and changed its name to SJW Group in November 2016. SJW Group was founded in 1866 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "STRNY": {
        "short_name": "SEVERN TRENT",
        "long_name": "Severn Trent Plc",
        "summary": "Severn Trent Plc operates as a water and sewerage company in England and Wales. It operates through two segments, Regulated Water and Waste Water, and Business Services. The Regulated Water and Waste Water segment offers water and waste water services to approximately 4.6 million households and businesses in the Midlands and Wales. The Business Services segment provides sludge treatment and related renewable energy generating services; and generates renewable energy from anaerobic digestion, crop, hydropower, wind turbines, and solar technology. It also provides contract services to municipal and industrial clients in the United Kingdom and Ireland; and the United Kingdom Ministry of Defense for design, build, and operation of water and waste water treatment facilities and networks, as well as services to developers. In addition, this segment manages and sells land; and offers developer, property search, and others services. The company was founded in 1974 and is headquartered in Coventry, the United Kingdom.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Coventry"
    },
    "SVT.L": {
        "short_name": "SEVERN TRENT PLC ORD 97 17/19P",
        "long_name": "Severn Trent Plc",
        "summary": "Severn Trent Plc operates as a water and sewerage company in England and Wales. It operates through two segments, Regulated Water and Waste Water, and Business Services. The Regulated Water and Waste Water segment offers water and waste water services to approximately 4.6 million households and businesses in the Midlands and Wales. The Business Services segment provides sludge treatment and related renewable energy generating services; and generates renewable energy from anaerobic digestion, crop, hydropower, wind turbines, and solar technology. It also provides contract services to municipal and industrial clients in the United Kingdom and Ireland; and the United Kingdom Ministry of Defense for design, build, and operation of water and waste water treatment facilities and networks, as well as services to developers. In addition, this segment manages and sells land; and offers developer, property search, and others services. The company was founded in 1974 and is headquartered in Coventry, the United Kingdom.",
        "currency": "GBp",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Coventry"
    },
    "SVTRF": {
        "short_name": "SEVERN TRENT",
        "long_name": "Severn Trent Plc",
        "summary": "Severn Trent Plc operates as a water and sewerage company in England and Wales. It operates through two segments, Regulated Water and Waste Water, and Business Services. The Regulated Water and Waste Water segment offers water and waste water services to approximately 4.6 million households and businesses in the Midlands and Wales. The Business Services segment provides sludge treatment and related renewable energy generating services; and generates renewable energy from anaerobic digestion, crop, hydropower, wind turbines, and solar technology. It also provides contract services to municipal and industrial clients in the United Kingdom and Ireland; and the United Kingdom Ministry of Defense for design, build, and operation of water and waste water treatment facilities and networks, as well as services to developers. In addition, this segment manages and sells land; and offers developer, property search, and others services. The company was founded in 1974 and is headquartered in Coventry, the United Kingdom.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Coventry"
    },
    "SYM.SI": {
        "short_name": "$ Memiontec",
        "long_name": "Memiontec Holdings Ltd.",
        "summary": "Memiontec Holdings Ltd., a water treatment company, provides water and wastewater management services in Singapore, Indonesia, and the People's Republic of China. The company operates through Total Solutions with Engineering, Procurement and Construction (TSEPC); Operation, Maintenance and Service (OMS); Sales and Distribution of Water System and Equipment (Trading); and Others segments. The TSEPC segment engages in the provision of a range of solutions in water treatment, wastewater treatment, water recycling treatment, and sea water treatment and desalination. This segment's customers include public sectors and industrial-related industries, including agro, food and beverage, power, petrochemical, palm oil, chemical, semiconductor, and real estate. The OMS segment offers operational, preventive, and corrective maintenance works, as well as technical support and consultation services for plant maintenance to TSEPC customers with water and wastewater infrastructure. The Trading segment sells and distributes modular and customized water treatment systems, water treatment equipment, components or spare parts, and specialty and/or blended chemicals. The Others segment sells treated water. Memiontec Holdings Ltd. was founded in 1992 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "SZ1.F": {
        "short_name": "SUEZ  EO 4",
        "long_name": "Suez SA",
        "summary": "Suez SA, together with its subsidiaries, engages in the water cycle and waste cycle management business in France, Europe, North America, South America, Africa, the Middle East, and the Asia-Pacific. The company operates through five segments: Water Europe, Recycling and Recovery Europe, International, Water Technologies & Solutions, and Other. It provides water distribution and treatment services to individuals, local authorities, and industrial clients; and waste collection and treatment services, including collection, sorting, recycling, composting, energy recovery, and landfilling for non-hazardous and hazardous waste for local authorities and industrial clients. The company also offers water network management services; technical assistance, operation, cleaning, and maintenance services; and spare parts, refurbishment, and associated services, as well as designs and operates storage facilities for hazardous and non-hazardous residual waste. In addition, it provides resource management consulting services; engineering and construction contracts and other services; and digital technology solutions for resource and asset protection, as well as deconstructs sites in the end-of-life phase and decontaminates soil and water tables. The company serves food and beverage, chemical and pharmaceutical, construction, site deconstruction and soil decontamination, mining, oil and gas, power, and pulp and paper industries. Suez SA was founded in 1869 and is headquartered in Paris, France.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "city": "Paris"
    },
    "SZEVF": {
        "short_name": "SUEZ SA",
        "long_name": "Suez SA",
        "summary": "Suez SA, together with its subsidiaries, engages in the water cycle and waste cycle management business in France, Europe, North America, South America, Africa, the Middle East, and the Asia-Pacific. The company operates through five segments: Water Europe, Recycling and Recovery Europe, International, Water Technologies & Solutions, and Other. It provides water distribution and treatment services to individuals, local authorities, and industrial clients; and waste collection and treatment services, including collection, sorting, recycling, composting, energy recovery, and landfilling for non-hazardous and hazardous waste for local authorities and industrial clients. The company also offers water network management services; technical assistance, operation, cleaning, and maintenance services; and spare parts, refurbishment, and associated services, as well as designs and operates storage facilities for hazardous and non-hazardous residual waste. In addition, it provides resource management consulting services; engineering and construction contracts and other services; and digital technology solutions for resource and asset protection, as well as deconstructs sites in the end-of-life phase and decontaminates soil and water tables. The company serves food and beverage, chemical and pharmaceutical, construction, site deconstruction and soil decontamination, mining, oil and gas, power, and pulp and paper industries. Suez SA was founded in 1869 and is headquartered in Paris, France.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "France",
        "city": "Paris"
    },
    "SZSAY": {
        "short_name": "SUEZ SA",
        "long_name": "Suez SA",
        "summary": "Suez SA, together with its subsidiaries, engages in the water cycle and waste cycle management business in France, Europe, North America, South America, Africa, the Middle East, and the Asia-Pacific. The company operates through five segments: Water Europe, Recycling and Recovery Europe, International, Water Technologies & Solutions, and Other. It provides water distribution and treatment services to individuals, local authorities, and industrial clients; and waste collection and treatment services, including collection, sorting, recycling, composting, energy recovery, and landfilling for non-hazardous and hazardous waste for local authorities and industrial clients. The company also offers water network management services; technical assistance, operation, cleaning, and maintenance services; and spare parts, refurbishment, and associated services, as well as designs and operates storage facilities for hazardous and non-hazardous residual waste. In addition, it provides resource management consulting services; engineering and construction contracts and other services; and digital technology solutions for resource and asset protection, as well as deconstructs sites in the end-of-life phase and decontaminates soil and water tables. The company serves food and beverage, chemical and pharmaceutical, construction, site deconstruction and soil decontamination, mining, oil and gas, power, and pulp and paper industries. Suez SA was founded in 1869 and is headquartered in Paris, France.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "France",
        "city": "Paris"
    },
    "TORW": {
        "short_name": "TORRINGTON WATER CO",
        "long_name": "The Torrington Water Company",
        "summary": "The Torrington Water Company operates as a regulated public water utility. It offers water sources to approximately 10,000 customers in the city of Torrington, as well as in the towns of Burlington, Harwinton, Litchfield, and New Hartford, Connecticut. The company was founded in 1873 and is based in Torrington, Connecticut.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Torrington"
    },
    "TTAPY": {
        "short_name": "TTW PUBLIC COMPANY LIMITED",
        "long_name": "TTW Public Company Limited",
        "summary": "TTW Public Company Limited, together with its subsidiaries, produces and sells treated water in Thailand. The company supplies water to the Provincial Waterworks Authority in the Amphur Nakorn Chaisri, Amphur Sam Pran, and Amphur Budha Monthon areas of Nakhon Pathom; and Amphur Muang and Amphur Kratumban areas of Samut Sakhon under the water purchase agreement. It is also involved in the management of water production and distribution systems, and waste water treatment systems; and operation and maintenance of water supply project. The company was formerly known as Thai Tap Water Supply Public Company Limited and changed its name to TTW Public Company Limited in April 2014. The company was incorporated in 2000 and is headquartered in Nakhon Pathom, Thailand.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Thailand",
        "city": "Nakhon Pathom"
    },
    "TTW-R.BK": {
        "short_name": "TTW PUBLIC COMPANY LIMITED",
        "long_name": "TTW Public Company Limited",
        "summary": "TTW Public Company Limited, together with its subsidiaries, produces and sells treated water in Thailand. The company supplies water to the Provincial Waterworks Authority in the Amphur Nakorn Chaisri, Amphur Sam Pran, and Amphur Budha Monthon areas of Nakhon Pathom; and Amphur Muang and Amphur Kratumban areas of Samut Sakhon under the water purchase agreement. It is also involved in the management of water production and distribution systems, and waste water treatment systems; and operation and maintenance of water supply project. The company was formerly known as Thai Tap Water Supply Public Company Limited and changed its name to TTW Public Company Limited in April 2014. The company was incorporated in 2000 and is headquartered in Nakhon Pathom, Thailand.",
        "currency": "THB",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Nakhon Pathom"
    },
    "TTW.BK": {
        "short_name": "TTW PUBLIC COMPANY LIMITED",
        "long_name": "TTW Public Company Limited",
        "summary": "TTW Public Company Limited, together with its subsidiaries, produces and sells treated water in Thailand. The company supplies water to the Provincial Waterworks Authority in the Amphur Nakorn Chaisri, Amphur Sam Pran, and Amphur Budha Monthon areas of Nakhon Pathom; and Amphur Muang and Amphur Kratumban areas of Samut Sakhon under the water purchase agreement. It is also involved in the management of water production and distribution systems, and waste water treatment systems; and operation and maintenance of water supply project. The company was formerly known as Thai Tap Water Supply Public Company Limited and changed its name to TTW Public Company Limited in April 2014. The company was incorporated in 2000 and is headquartered in Nakhon Pathom, Thailand.",
        "currency": "THB",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Nakhon Pathom"
    },
    "TVEAT.TL": {
        "short_name": "Tallinna Vesi",
        "long_name": "AS Tallinna Vesi",
        "summary": "AS Tallinna Vesi, a water utility company, collects, treats, and distributes water for private houses, apartment associations, and commercial customers in Estonia. It principally operates the Ã\u009clemiste water treatment and Paljassaare wastewater treatment plants. The company offers drinking water and wastewater disposal services to approximately 23,600 private customers and businesses, and 450,000 end consumers in Tallinn, as well as to various neighboring municipalities of Tallinn. Its public water supply system comprises approximately 1,180 kilometers of water pipes, 22 water pumping stations, 45 ground water pumping stations, and 91 boreholes; and public sewerage system consist of 1,170 kilometers of wastewater networks, 513 kilometers of storm water networks, and 180 sewage and storm water pumping stations. The company also offers owner supervision and project management services; design work; water and wastewater services; laboratory services; and transportation and road construction services, as well as undertakes pipe construction works. AS Tallinna Vesi was founded in 1967 and is headquartered in Tallinn, Estonia.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "city": "Tallinn"
    },
    "UUEA.F": {
        "short_name": "UNITED UTILITIES GP ADR/2",
        "long_name": "United Utilities Group PLC",
        "summary": "United Utilities Group PLC provides water and wastewater services in the United Kingdom. It is also involved in renewable energy generation, corporate trustee, financing, and property management activities; and the provision of waste treatment, consulting, and project management services. The company operates 42,000 kilometers (km) of water pipes; 78,000 km of wastewater pipes; 566 wastewater treatment works; and 86 water treatment works. It serves 3 million households and 200,000 business customers. United Utilities Group PLC was incorporated in 2008 is based in Warrington, the United Kingdom.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Warrington"
    },
    "UUEC.F": {
        "short_name": "UNITED UTILITIES GRP",
        "long_name": "United Utilities Group PLC",
        "summary": "United Utilities Group PLC provides water and wastewater services in the United Kingdom. It is also involved in renewable energy generation, corporate trustee, financing, and property management activities; and the provision of waste treatment, consulting, and project management services. The company operates 42,000 kilometers (km) of water pipes; 78,000 km of wastewater pipes; 566 wastewater treatment works; and 86 water treatment works. It serves 3 million households and 200,000 business customers. United Utilities Group PLC was incorporated in 2008 is based in Warrington, the United Kingdom.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Warrington"
    },
    "UUGRY": {
        "short_name": "UNITED UTILITIES GROUP PLC",
        "long_name": "United Utilities Group PLC",
        "summary": "United Utilities Group PLC provides water and wastewater services in the United Kingdom. It is also involved in renewable energy generation, corporate trustee, financing, and property management activities; and the provision of waste treatment, consulting, and project management services. The company operates 42,000 kilometers (km) of water pipes; 78,000 km of wastewater pipes; 566 wastewater treatment works; and 86 water treatment works. It serves 3 million households and 200,000 business customers. United Utilities Group PLC was incorporated in 2008 is based in Warrington, the United Kingdom.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Warrington"
    },
    "UUGWF": {
        "short_name": "UNITED UTILITIES GROUP PLC",
        "long_name": "United Utilities Group PLC",
        "summary": "United Utilities Group PLC provides water and wastewater services in the United Kingdom. It is also involved in renewable energy generation, corporate trustee, financing, and property management activities; and the provision of waste treatment, consulting, and project management services. The company operates 42,000 kilometers (km) of water pipes; 78,000 km of wastewater pipes; 566 wastewater treatment works; and 86 water treatment works. It serves 3 million households and 200,000 business customers. United Utilities Group PLC was incorporated in 2008 is based in Warrington, the United Kingdom.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Warrington"
    },
    "WHAUP-R.BK": {
        "short_name": "WHA UTILITIES AND POWER PUBLIC ",
        "long_name": "WHA Utilities and Power Public Company Limited",
        "summary": "WHA Utilities and Power Public Company Limited provides integrated utilities products and services in Thailand and internationally. The company operates through three segments: Water Business, Power Business, and Holding Company. It procures and distributes raw water; produces and distributes industrial water; and provides wastewater treatment services to operators in industrial estates and industrial lands, as well as other consumers. The company also generates and distributes electricity. It operates three power plants with a capacity of 2,588 megawatts (MW) that utilize gas, coal, and water, as well as possesses a total renewable energy capacity of 18.9 MW, which comprises solar and waste to energy. The company was formerly known as Hemaraj Clean Water Company Limited and changed its name to WHA Utilities and Power Public Company Limited in August 2016. The company was founded in 2008 and is headquartered in Samut Prakarn, Thailand. WHA Utilities and Power Public Company Limited is a subsidiary of WHA Industrial Development Public Company Limited.",
        "currency": "THB",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Samut Prakarn"
    },
    "WHAUP.BK": {
        "short_name": "WHA UTILITIES AND POWER PUBLIC ",
        "long_name": "WHA Utilities and Power Public Company Limited",
        "summary": "WHA Utilities and Power Public Company Limited provides integrated utilities products and services in Thailand and internationally. The company operates through three segments: Water Business, Power Business, and Holding Company. It procures and distributes raw water; produces and distributes industrial water; and provides wastewater treatment services to operators in industrial estates and industrial lands, as well as other consumers. The company also generates and distributes electricity. It operates three power plants with a capacity of 2,588 megawatts (MW) that utilize gas, coal, and water, as well as possesses a total renewable energy capacity of 18.9 MW, which comprises solar and waste to energy. The company was formerly known as Hemaraj Clean Water Company Limited and changed its name to WHA Utilities and Power Public Company Limited in August 2016. The company was founded in 2008 and is headquartered in Samut Prakarn, Thailand. WHA Utilities and Power Public Company Limited is a subsidiary of WHA Industrial Development Public Company Limited.",
        "currency": "THB",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Samut Prakarn"
    },
    "WTRG": {
        "short_name": "Essential Utilities, Inc.",
        "long_name": "Essential Utilities, Inc.",
        "summary": "Essential Utilities, Inc., through its subsidiaries, operates regulated utilities that provide water or wastewater services in the United States. It offers water services through operating and maintenance contracts with municipal authorities and other parties. The company also provides non-utility raw water supply services for firms in the natural gas drilling industry; and water and sewer line protection solutions, and repair services to households through a third-party. It serves approximately 3 million residential water, commercial water, fire protection, industrial water, wastewater, and other water and utility customers in Pennsylvania, Ohio, Texas, Illinois, North Carolina, New Jersey, Indiana, and Virginia. The company was formerly known as Aqua America, Inc. and changed its name to Essential Utilities, Inc. in February 2020. Essential Utilities, Inc. was founded in 1886 and is headquartered in Bryn Mawr, Pennsylvania.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Bryn Mawr"
    },
    "WXV.F": {
        "short_name": "PURIFLOH LTD",
        "long_name": "PuriflOH Limited",
        "summary": "PuriflOH Limited provides indoor air purification, water sanitation, and medical sterilization products in Australia. Its free radical generator technology produces a range of reactive oxygen species that include hydroxyl radical, superoxide radical, oxygen radical, and the ozone molecule. The company was formerly known as Water Resources Group Limited and changed its name to PuriflOH Limited in May 2018. PuriflOH Limited was founded in 2007 and is based in Melbourne, Australia.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "YORW": {
        "short_name": "The York Water Company",
        "long_name": "The York Water Company",
        "summary": "The York Water Company impounds, purifies, and distributes drinking water. The company owns and operates two wastewater collection systems and two wastewater treatment systems; and two reservoirs, including Lake Williams and Lake Redman, which hold approximately 2.2 billion gallons of water. It also operates a 15-mile pipeline from the Susquehanna River to Lake Redman; and owns seven wells that supply water to its customers in Carroll Valley Borough and Cumberland Township, Adams County. The company serves customers in the fixtures and furniture, electrical machinery, food product, paper, ordnance unit, textile product, air conditioning system, laundry detergent, barbell, and motorcycle industries in 39 municipalities within York County and 9 municipalities within Adams County, Pennsylvania. The York Water Company was founded in 1816 and is based in York, Pennsylvania.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "York"
    },
    "YWA.SG": {
        "short_name": "YORK WATER CO. Registered Share",
        "long_name": "The York Water Company",
        "summary": "The York Water Company impounds, purifies, and distributes drinking water. The company owns and operates two wastewater collection systems and two wastewater treatment systems; and two reservoirs, including Lake Williams and Lake Redman, which hold approximately 2.2 billion gallons of water. It also operates a 15-mile pipeline from the Susquehanna River to Lake Redman; and owns seven wells that supply water to its customers in Carroll Valley Borough and Cumberland Township, Adams County. The company serves customers in the fixtures and furniture, electrical machinery, food product, paper, ordnance unit, textile product, air conditioning system, laundry detergent, barbell, and motorcycle industries in 39 municipalities within York County and 9 municipalities within Adams County, Pennsylvania. The York Water Company was founded in 1816 and is based in York, Pennsylvania.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities—Regulated Water",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "city": "York"
    }
}