{
    "17LA.F": {
        "short_name": "LENTA PLC GDR S 1/2",
        "long_name": "Lenta PLC",
        "summary": "Lenta PLC, together with its subsidiaries, develops and operates hypermarket and supermarket stores. As of December 31, 2020, it operated 254 hypermarkets and 139 supermarkets in 89 cities across Russia. The company was founded in 1993 and is headquartered in Saint Petersburg, Russia. Lenta PLC is a subsidiary of Severgroup LLC.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Russia",
        "state": null,
        "city": "Saint Petersburg",
        "zipcode": "197374",
        "website": "http://www.lentainvestor.com",
        "market_cap": "Small Cap"
    },
    "DSKY.ME": {
        "short_name": "DETSKY MIR PUBLIC",
        "long_name": "Public Joint Stock Company Detsky Mir",
        "summary": "Public Joint Stock Company Detsky Mir, a multi-format digital retailer, operates a chain of children's clothing and goods retail stores. The company offers toys and games, products for newborns, apparel and footwear, art and craft sets, recreational goods, car seats, furniture, and stationery, as well as pet goods. As of March 1, 2021, it operated through a network of 834 Detsky Mir stores located in 331 cities in Russia, Kazakhstan, and Belarus; 16 Detmir Pickup stores; and 21 Zoozavr stores, as well as detmir.ru, an online store. The company was founded in 1947 and is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "127238",
        "website": "http://www.detmir.ru",
        "market_cap": "Small Cap"
    },
    "GAZA.ME": {
        "short_name": "GAZ PUBLIC JOINT",
        "long_name": "Public Joint Stock Company GAZ",
        "summary": "Public Joint Stock Company GAZ manufactures and sells commercial motor vehicles primarily in Russia. The company offers light commercial vehicles under the GAZelle NEXT, GAZelle BUSINESS, and Sobol names; and medium duty trucks under the GAZon Next, GAZ-3309, Sadko, and Zemliak names, as well as specialty vehicles. It also provides all-wheelÂ\u0096drive off-road and heavy duty trucks; buses and coaches; diesel engines, fuel injection equipment for diesel engines, and gearboxes; and auto components, such as iron castings, forged products, stampings, dies and molds, tools, systems and assemblies, and non-ferrous castings. The company was formerly known as Open Joint Stock Company GAZ and changed its name to Public Joint Stock Company GAZ in June 2016. The company is based in Nizhny Novgorod, Russia. Public Joint Stock Company GAZ is a subsidiary of Russkie Mashiny, Ooo.",
        "currency": "RUB",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Nizhny Novgorod",
        "zipcode": "603950",
        "website": "http://www.gazgroup.ru",
        "market_cap": "Small Cap"
    },
    "GAZAP.ME": {
        "short_name": "GAZ PUBLIC JOINT",
        "long_name": "Public Joint Stock Company GAZ",
        "summary": "Public Joint Stock Company GAZ manufactures and sells commercial motor vehicles primarily in Russia. The company offers light commercial vehicles under the GAZelle NEXT, GAZelle BUSINESS, and Sobol names; and medium duty trucks under the GAZon Next, GAZ-3309, Sadko, and Zemliak names, as well as specialty vehicles. It also provides all-wheelÂ\u0096drive off-road and heavy duty trucks; buses and coaches; diesel engines, fuel injection equipment for diesel engines, and gearboxes; and auto components, such as iron castings, forged products, stampings, dies and molds, tools, systems and assemblies, and non-ferrous castings. The company was formerly known as Open Joint Stock Company GAZ and changed its name to Public Joint Stock Company GAZ in June 2016. The company is based in Nizhny Novgorod, Russia. Public Joint Stock Company GAZ is a subsidiary of Russkie Mashiny, Ooo.",
        "currency": "RUB",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Nizhny Novgorod",
        "zipcode": "603950",
        "website": "http://www.gazgroup.ru",
        "market_cap": "Small Cap"
    },
    "LNTA.ME": {
        "short_name": "LENTA IPJSC",
        "long_name": "Lenta PLC",
        "summary": "Lenta PLC, together with its subsidiaries, develops and operates hypermarket and supermarket stores. As of December 31, 2020, it operated 254 hypermarkets and 139 supermarkets in 89 cities across Russia. The company was founded in 1993 and is headquartered in Saint Petersburg, Russia. Lenta PLC is a subsidiary of Severgroup LLC.",
        "currency": "RUB",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Saint Petersburg",
        "zipcode": "197374",
        "website": "http://www.lentainvestor.com",
        "market_cap": "Small Cap"
    },
    "LNTA.VI": {
        "short_name": "LENTA GDR",
        "long_name": "Lenta PLC",
        "summary": "Lenta PLC, together with its subsidiaries, develops and operates hypermarket and supermarket stores. As of December 31, 2020, it operated 254 hypermarkets and 139 supermarkets in 89 cities across Russia. The company was founded in 1993 and is headquartered in Saint Petersburg, Russia. Lenta PLC is a subsidiary of Severgroup LLC.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Russia",
        "state": null,
        "city": "Saint Petersburg",
        "zipcode": "197374",
        "website": "http://www.lentainvestor.com",
        "market_cap": "Small Cap"
    },
    "MVID.ME": {
        "short_name": "M VIDEO PJSC",
        "long_name": "Public Joint Stock Company M.video",
        "summary": "Public Joint Stock Company M.video, together with its subsidiaries, operates a chain of consumer electronic outlets and online internet stores in Russia. The company engages in the sale of television, audio, video, and Hi-Fi products, as well as home appliances and digital equipment; and the provision of related services. As of December 31, 2019, it had a network of 1,038 stores, including 983 leased stores and 55 owned stores. The company was founded in 1993 and is headquartered in Moscow, Russia. Public Joint Stock Company M.video operates as a subsidiary of Ericaria Holdings Limited.",
        "currency": "RUB",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "105066",
        "website": "http://www.mvideo.ru",
        "market_cap": "Small Cap"
    },
    "NFAZ.ME": {
        "short_name": "NEFAZ PTC",
        "long_name": "NEFAZ Publicly Traded Company",
        "summary": "NEFAZ Publicly Traded Company operates in the automobile industry in Russia. It produces buses, tank trucks, flatbed trailers, crew buses, fire fighting equipment, semi-trailers, tank semi-trailers, tank trailers, dump trucks, tipper semi-trailers, tipper trailers, flatbed trailers, and agricultural machinery, as well as car chassis and spare parts. The company was founded in 1977 and is based in Neftekamsk, Russia. NEFAZ Publicly Traded Company operates as a subsidiary of KAMAZ Publicly Traded Company.",
        "currency": "RUB",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Neftekamsk",
        "zipcode": "452680",
        "website": "http://www.nefaz.ru",
        "market_cap": "Small Cap"
    },
    "NKSH.ME": {
        "short_name": "NIZHNEKAMSKSHINA C",
        "long_name": "PJSC Nizhnekamskshina",
        "summary": "PJSC Nizhnekamskshina manufactures and distributes tires in Russian and CIS countries. It offers tires for passenger and light trucks under the KAMA and Viatti brand names. The company was founded in 1971 and is based in Almetyevsk, Russia. PJSC Nizhnekamskshina is a subsidiary of OOO Tatneft-Neftekhim Management Company.",
        "currency": "RUB",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Almetyevsk",
        "zipcode": "423400",
        "website": "http://shinakama.tatneft.ru",
        "market_cap": "Small Cap"
    },
    "ORUP.ME": {
        "short_name": "OR PUB JOINT STK C",
        "long_name": "Public Joint-Stock Company OR",
        "summary": "Public Joint-Stock Company OR engages in the manufacture, wholesale, retail, and franchising of footwear, accessories, and related products in Russia. It offers men's and women's footwear products; summer, beach, sport, hiking, and garden-style shoes; and sneakers, and spring-autumn and winter boots, as well as winter and seasonal jackets, windcheaters, and raincoats. As of December 31, 2019, the company operates 908 retail stores, which provides its products under the Westfalika, Peshekhod, Emilia Estra, Rossita, Lisette, S-TEP, All.Go, and Snow Guard brand names. It also provides a range of financial services, such as payment through installments, cash loans, cash payments, etc. In addition, the company operates online stores, such as westfalika.ru, emilia-estra.ru, westfalika-home.ru, lisette.me, and rossita.com. It also engages in the research and development activities in natural sciences and engineering. Public Joint-Stock Company OR was founded in 2003 and is headquartered in Novosibirsk, Russia.",
        "currency": "RUB",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Novosibirsk",
        "zipcode": "630110",
        "website": "http://obuvrus.ru",
        "market_cap": "Small Cap"
    },
    "PAZA.ME": {
        "short_name": "PAVLOVO BUS PJSC",
        "long_name": "Public Joint Stock Company Pavlovo Bus",
        "summary": "Public Joint Stock Company Pavlovo Bus produces and sells buses and special vehicles, automotive components, and spare parts in Russia. It also sells illiquid assets. The company was formerly known as Pavlovsky Avtobusny Zavod. The company was founded in 1932 and is based in Pavlovo, Russia. Public Joint Stock Company Pavlovo Bus is a subsidiary of Public Joint Stock Company GAZ.",
        "currency": "RUB",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Pavlovo",
        "zipcode": "606108",
        "website": "http://www.paz-bus.ru",
        "market_cap": "Small Cap"
    },
    "ROST.ME": {
        "short_name": "ROSINTER RESTAURAN",
        "long_name": "Public Joint Stock Company Rosinter Restaurants Holding",
        "summary": "Public Joint Stock Company Rosinter Restaurants Holding, together with its subsidiaries, operates a chain of casual dining restaurants. It primarily operates Italian cuisine under the IL Patio brand; Pan Asian cuisine under the Shikary brand; Japanese cuisine under the Planet Sushi brand; American cuisine under the American Bar & Grill brand; and Russian cuisine under the Mama Russia brand. The company also develops the international brands, including American cuisine under the TGI Fridays brand; and coffee shops under the Costa Coffee brand through a franchise agreement. As of June 30, 2020, it operated 247 outlets in 29 cities in Russia and CIS countries, as well as Central Europe, including Baltic countries. The company was founded in 1990 and is headquartered in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "111024",
        "website": "http://www.rosinter.com",
        "market_cap": "Small Cap"
    },
    "SGZH.ME": {
        "short_name": "SEGEZHA GROUP PJSC",
        "long_name": "Group of Companies Segezha Public Joint Stock Company",
        "summary": "Segezha Group PJSC operates in the forestry industry in Russia and internationally. It operates through four segments: Paper and Packaging, Forestry Management and Woodworking, Plywood and Boards, and Other. The Paper and Packaging segment produces sack paper and artificial parchment from unbleached craft pulp, as well as industrial and consumer packaging in the form of paper sacks, such as paper pouches and retailer bags for use in construction, food, agriculture, chemical, and mineral markets. The Forestry Management and Woodworking segment produces sawn timber products, pellets, woodchips, and fiberboards. This segment is also involved in the wood harvesting operations to supply wood to third parties. The Plywood and Boards segment produces birch plywood for use in the construction, transportation, furniture, flooring, and packaging markets; medium density fiberboards for use in manufacturing doors and wall panels, construction, wood moldings, furniture, and packaging; and briquettes for use as a wood fuel source made from sawdust. The Other segment offers glulam for use in the construction of wooden houses, ceilings in multi-story buildings, load bearing structures, rafter systems, stairs, claddings, and other applications; pre-fabricated glulam-based housing kits to construct wooden houses and multi-story buildings; and CLT panels and sawn timber products. The company was incorporated in 2013 and is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "123112",
        "website": "http://segezha-group.com",
        "market_cap": null
    },
    "SVAV.ME": {
        "short_name": "SOLLERS PJSC",
        "long_name": "Sollers Public Joint Stock Company",
        "summary": "Sollers Public Joint Stock Company, together with its subsidiaries, manufactures and sells vehicles in Russia. It offers SUVs and LCVs; and automotive components, assembly kits, and engines. The company markets and sells its products under the UAZ, ZMZ, Ford Sollers, and Mazda Sollers brands. The company was founded in 2002 and is based in Moscow, Russia. Sollers Public Joint Stock Company is a subsidiary of ERFIX LLC.",
        "currency": "RUB",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "123317",
        "website": "http://www.sollers-auto.com",
        "market_cap": "Small Cap"
    },
    "ZVEZ.ME": {
        "short_name": "ZVEZDA PJSC",
        "long_name": "Public Joint Stock Company Zvezda",
        "summary": "Public Joint Stock Company Zvezda develops, manufactures, and sells diesel engines for shipbuilding, rail transport, diesel generators, and industrial units in Russia. It offers high-speed diesel engines and units, ship-reduction and reverse-reduction transmissions, ship and industrial diesel generators, emergency-reserve power plants, and energy equipment for marine equipment, as well as heavy ship gearboxes. The company also provides master-mounting, start-up, maintenance, spare part, repair, training, and consultation services related to its diesel engines; and aluminum casting and mechanical processing services. Public Joint Stock Company Zvezda was founded in 1932 and is based in Saint Petersburg, Russia.",
        "currency": "RUB",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Saint Petersburg",
        "zipcode": "192012",
        "website": "http://www.zvezda.spb.ru",
        "market_cap": "Small Cap"
    }
}