{"66T.F": {"short_name": "SCATEC ASA  NK -,02", "long_name": "Scatec ASA", "summary": "Scatec ASA, together with its subsidiaries, operates as an integrated independent solar power producer. The company operates through Power Production; Services; and Development and Construction segments. It is involved in the project design and development, financing, engineering, procurement, construction management, ownership, operation and maintenance, and asset management of solar photovoltaic power plants. The company has a total of 1.9 GW in operation and under construction in Argentina, Brazil, the Czech Republic, Egypt, Honduras, Jordan, Malaysia, Mozambique, Rwanda, South Africa, Ukraine, and internationally. The company was formerly known as Scatec Solar ASA and changed its name to Scatec ASA in November 2020. Scatec ASA was founded in 2007 and is headquartered in Oslo, Norway.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "FRA", "market": "dr_market", "country": "Norway", "city": "Oslo"}, "AEGA.OL": {"short_name": "AEGA ASA", "long_name": "Aega ASA", "summary": "Aega ASA, a solar utility company, acquires, invests in, and operates solar power plants. The company was formerly known as Nordic Financials ASA and changed its name to Aega ASA in January 2016. Aega ASA was founded in 2011 and is headquartered in Oslo, Norway.", "currency": "NOK", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "OSL", "market": "no_market", "country": "Norway", "city": "Oslo"}, "AFK.OL": {"short_name": "ARENDALS FOSSEKOMP", "long_name": "Arendals Fossekompani ASA", "summary": "Arendals Fossekompani ASA, an industrial investment company, engages in the operating hydro power plants. The company also builds and operates cogeneration power plants; provides industrial induction heating processes; offers satellite communications and IT solutions; develops and delivers business-critical IT solutions and services; and provides system solutions and products in the fields of instrumentation, data collection, and remote monitoring and control. In addition, it offers equipment for powder production of advanced materials; and data and consulting services to the European energy market. Further, the company operates airport, as well as develops various properties. Arendals Fossekompani ASA was founded in 1896 and is headquartered in Arendal, Norway.", "currency": "NOK", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "OSL", "market": "no_market", "country": "Norway", "city": "Arendal"}, "AOW.OL": {"short_name": "AKER OFFSH WIND AS", "long_name": "Aker Offshore Wind AS", "summary": "Aker Offshore Wind Holding AS engages in the development of deep-water wind power production. It has a portfolio of development projects and prospects in Europe, North America, and Asia. The company is based in Lysaker, Norway. Aker Offshore Wind Holding AS(OB:AOW-ME) operates independently of Aker Solutions ASA as of August 26, 2020.", "currency": "NOK", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "OSL", "market": "no_market", "country": "Norway", "city": "Lysaker"}, "EAM.OL": {"short_name": "EAM SOLAR ASA", "long_name": "EAM Solar ASA", "summary": "EAM Solar ASA acquires, owns, and operates solar power plants in Europe. The company sells electricity under long-term fixed price sales contracts. It owns and operates four power plants with a combined installed capacity of 4.0 MW in Italy. The company was founded in 2011 and is based in Oslo, Norway.", "currency": "NOK", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "OSL", "market": "no_market", "country": "Norway", "city": "Oslo"}, "FKRFT.OL": {"short_name": "FJORDKRAFT HLDG", "long_name": "Fjordkraft Holding ASA", "summary": "Fjordkraft Holding ASA, together with its subsidiaries, engages in the purchase, sale, and portfolio management of electrical power to households, private and public companies, and municipalities in Norway. It operates through Consumer and Business segments. The Consumer segment sells electrical power and related services to private consumers. The Business segment sells electrical power and related services to business consumers. The company also provides mobile phone services to private customers. Fjordkraft Holding ASA was founded in 2001 and is headquartered in Bergen, Norway.", "currency": "NOK", "sector": "Utilities", "industry": "Utilities—Regulated Electric", "exchange": "OSL", "market": "no_market", "country": "Norway", "city": "Bergen"}, "OSUN.OL": {"short_name": "OCEAN SUN AS", "long_name": "Ocean Sun AS", "summary": "Ocean Sun AS develops floating power system with solar panels. Its system consists of one or multiple floaters anchored side-by-side to build larger power plants, as well as takes local water depth, wave, current, and wind conditions into consideration. The company has a strategic partnership with GCL System Integration. Ocean Sun AS was founded in 2016 and is headquartered Fornebu, Norway with locations in Singapore; Shanghai, China.", "currency": "NOK", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "OSL", "market": "no_market", "country": "Norway", "city": "Fornebu"}, "SCATC.OL": {"short_name": "SCATEC ASA", "long_name": "Scatec ASA", "summary": "Scatec ASA, together with its subsidiaries, operates as an integrated independent solar power producer. The company operates through Power Production; Services; and Development and Construction segments. It is involved in the project design and development, financing, engineering, procurement, construction management, ownership, operation and maintenance, and asset management of solar photovoltaic power plants. The company has a total of 1.9 GW in operation and under construction in Argentina, Brazil, the Czech Republic, Egypt, Honduras, Jordan, Malaysia, Mozambique, Rwanda, South Africa, Ukraine, and internationally. The company was formerly known as Scatec Solar ASA and changed its name to Scatec ASA in November 2020. Scatec ASA was founded in 2007 and is headquartered in Oslo, Norway.", "currency": "NOK", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "OSL", "market": "no_market", "country": "Norway", "city": "Oslo"}}