{
    "2239.TW": {
        "short_name": "CAYMAN ENGLEY INDUSTRIAL CO. LT",
        "long_name": "Cayman Engley Industrial Co., Ltd.",
        "summary": "Cayman Engley Industrial Co., Ltd. produces and sells automobile parts in China and internationally. The company offers stamping and welding parts, including body in white parts, cockpit carriers, and stamping bumpers; and roll parts, such as rolling bumpers and door sills. It also provides long fiberglass hot-pressing and injection products comprising under body shields, front ends, spare wheel pans, door modules, battery trays, wheel arch liners, heat shields, interior trim parts, and lamp brackets; and mold manufacturing products consisting of prototype and sop tools. In addition, the company engages in the development and manufacture of soft robot software; and provision of related technical consulting services. Cayman Engley Industrial Co., Ltd. was founded in 1991 and is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.engley.com",
        "market_cap": "Large Cap"
    },
    "2248.TWO": {
        "short_name": "eLAND",
        "long_name": "Shining Victory Motor Electronic Co., Ltd.",
        "summary": "Shining Victory Motor Electronic Co., Ltd. engages in the production and sale of automotive components. It offers optoelectronic products, automotive electronics, and automotive metal and plastic decorative parts, including car door illuminating welcome pedals, car interior light bar ambient lights, shifting atmosphere lights, sun visors, luggage racks, bright strips, etc. The company is based in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-1208",
        "website": "http://www.top-elan.com/",
        "market_cap": "Small Cap"
    },
    "4581.TW": {
        "short_name": "WORLD KNOWN MFG (CAYMAN) LTD",
        "long_name": "World Known MFG (Cayman) Limited",
        "summary": "World Known MFG (Cayman) Limited produces and sells commercial vehicle parts in the United States, the United Kingdom, Sweden, Denmark, and Japan. The company offers exhaust manifolds, disc brakes, gearbox and pump housing products, and knuckles; and diesel engine and air disc brake components. It serves customers in commercial vehicle, green energy, construction machinery, agricultural machinery, and other industrial equipment industries. The company was founded in 2015 and is based in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.wkgroup.com",
        "market_cap": "Small Cap"
    },
    "8423.TWO": {
        "short_name": "POLYGREEN RESOURCES CO LTD",
        "long_name": "Polygreen Resources Co., Ltd.",
        "summary": "Polygreen Resources Co., Ltd., an investment holding company, engages in resource recycling and environmental protection business in Malaysia. The company manufactures and sells Tyrec, a tyrec reclaimed rubber for use in tires, conveyor belts, inner tubes, ring pads, rubber matting, shoe soles, vibration pads, dock fenders, and other rubber products; Burec, a butyl reclaimed rubber for use in butyl inner tubes, tire inner liners, butyl adhesives, and other butyl rubber-related products; and Narec, a natural inner tube reclaimed rubber for use in rubber matting, shoe soles, and other rubber products. Its products also comprise T-Mesh, a crumb rubber for use in various applications in rubber products as compounding substitute, such as tire, ring pads, and rubber matting; and rubber granules that are recycled from the tire and industrial rubber waste that is used in the underlayment for running tracks, children's playgrounds, gym, and rubber tiles. The company also exports its products to Japan, Europe, Taiwan, Vietnam, the Philippines, Indonesia, Thailand, Pakistan, China, the Middle East, Australia, Singapore, and internationally. It serves manufacturers in the tire and conveyor-belt industries. The company was founded in 1988 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.pgr.com.tw",
        "market_cap": "Small Cap"
    }
}