{
    "5543.TWO": {
        "short_name": "BUIMA GROUP INC",
        "long_name": "Buima Group Inc.",
        "summary": "Buima Group Inc. engages in the research, design, development, production, and sale of metal building materials in China, rest of Asia, Europe, and internationally. The company offers metal ceiling, such as corrugated board; grid, juno, and tube ceiling; and metal mesh board, square ceiling system, and the clip in ceiling system. It also provides various ceiling grid, such as premium, cliq, buima line, smart, deco, V-grid, eco, and a-line. In addition, the company offers Xing Li, Xing Chai, and Xingde compartment systems, as well as data room decorative wall panel, metal compartment, SD steel door, decorative metal wall panel, office compartment, and glass compartment systems. Further, it engages in punching technology, high-precision leveling technology, and commodity development activities. The company's products are used in medical and biology medicines, aerospace science and technology, cloud data center, and public construction and commercial space applications, as well as engineering, commercial office buildings, and electronic factories applications. The company was founded in 2009 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.buima.com.tw",
        "market_cap": "Mid Cap"
    },
    "8466.TW": {
        "short_name": "MJ INTERNATIONAL CO LTD",
        "long_name": "M.J. International Co., Ltd.",
        "summary": "M.J. International Co., Ltd., together with its subsidiaries, engages in the development, production, and sales of luxury vinyl tile (LVT) floors. The company offers rigid core, LVT click, non-polyvinyl chloride, LVT dry back wood and stone design, and LVT dry back carpet and exclusive design products for commercial and residential customers. It also engages in the production and sales of titles, and decoration and construction materials. The company operates in Europe, North America, Mainland China, Taiwan, and internationally. M.J. International Co., Ltd. was founded in 1982 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.mjig.com",
        "market_cap": "Mid Cap"
    }
}