{
    "4002.SR": {
        "short_name": "Mouwasat Medical Services Co.",
        "long_name": "Mouwasat Medical Services Company",
        "summary": "Mouwasat Medical Services Company acquires, manages, operates, and maintains hospitals, medical centers, drug stores, and pharmacies in the Kingdom of Saudi Arabia. It operates a network of hospitals in Dammam, Jubail, Madinah, Khobar, Qatif, and Riyadh that provides a range of medical services. The company also operates skin care centers that offer clinical and cosmetic dermatology, aesthetic and reconstructive plastic surgery, weight reduction, and esthetician services; a fertility center; and a clinic for bariatric surgery. In addition, it is involved in the wholesale of medical equipment and drugs. The company was founded in 1974 and is based in Dammam, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Dammam"
    },
    "4004.SR": {
        "short_name": "Dallah Healthcare Co.",
        "long_name": "Dallah Healthcare Company",
        "summary": "Dallah Healthcare Company provides and operates healthcare programs and utilities in the Kingdom of Saudi Arabia. The company engages in operating, managing, equipping, and developing hospitals and healthcare facilities, medical policlinics, compounds, and lands; and the provision of manpower and support services to hospitals and medical centers. It also manufactures and distributes pharmaceutical, herbal, and cosmetic products to retail pharmacies, health and beauty stores, hospitals, and governmental agencies. In addition, the company engages in the management and operation of hospitals owned by third-parties; and provision of other support services. The company was formerly known as Dallah Healthcare Holding Company and changed its name to Dallah Healthcare Company in November 2016. The company was founded in 1994 and is based in Riyadh, Saudi Arabia. Dallah Healthcare Company is the subsidiary of Dallah Albaraka Group LLC.",
        "currency": "SAR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "4007.SR": {
        "short_name": "Al Hammadi Company for Developm",
        "long_name": "Al Hammadi Company For Development and Investment",
        "summary": "Al Hammadi Company For Development and Investment establishes, maintains, manages, and operates hospitals and medical centers in the Kingdom of Saudi Arabia. The company operates through Medical Services and Pharmaceuticals Products segments. It is also involved in the wholesale and retail trading of medical equipment, pharmaceutical and cosmetic products, and food and beverages; and the acquisition and rental of land for constructing buildings. In addition, the company invests in various industrial projects; and establishes, operates, and maintains commercial centers. It operates three hospitals under the Al Hammadi Hospital name in Olaya, Suwaidi, and Al Nuzha districts of Riyadh. The company was founded in 1985 and is based in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    },
    "4013.SR": {
        "short_name": "Dr. Sulaiman Al Habib Medical S",
        "long_name": "Dr. Sulaiman Al Habib Medical Services Group Company",
        "summary": "Dr. Sulaiman Al Habib Medical Services Group Company develops, owns, and operates hospitals and medical centers. The company operates spinal surgery, vascular, general medicine, urology, dental, diabetes and endocrine, ENT, family medicine, gastroenterology, general surgery, sport medicine, rheumatology, internal medicine, nutrition, nephrology, neurology, neurosurgery, orthopedic, OB/GYN, pulmonary, psychiatry, pediatric, and pain treatment clinics. It also operates physiotherapy, plastic surgery, cardiology, dermatology, in vitro fertilization, obesity treatment, ophthalmology, and laser hair removal centers; endoscopy, speech therapy, intensive care, hematology, kidney dialysis, sleep disorder treatment, laser and Lasik eye surgery, nuclear medicine, low vision, and ER units; a tissue laboratory and radiology center; and pharmacies. Dr. Sulaiman Al Habib Medical Services Group Company was founded in 1995 and is based in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "city": "Riyadh"
    }
}