{"ARENA.IS": {"short_name": "ARENA BILGISAYAR", "long_name": "Arena Bilgisayar Sanayi ve Ticaret A.S.", "summary": "Arena Bilgisayar Sanayi ve Ticaret A.S. engages in the distribution of technology in Turkey. The company offers computing materials, international trade, and Internet electronic retailing and marketing, as well as provides electronic security product trading, payment brokerage, and location management services. It is also involved in wholesale trading of telecommunication product, such as mobile phones and other mobile devices. Arena Bilgisayar Sanayi ve Ticaret A.S. was founded in 1991 and is headquartered in Istanbul, Turkey.", "currency": "TRY", "sector": "Technology", "industry": "Electronics & Computer Distribution", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Istanbul"}, "ARMDA.IS": {"short_name": "ARMADA BILGISAYAR", "long_name": "Armada Bilgisayar Sistemleri Sanayi ve Ticaret A.S.", "summary": "Armada Bilgisayar Sistemleri Sanayi ve Ticaret A.S. operates as a distributor in the information technology sector in Turkey. It offers IT products and solutions to end users through business partners. The company was founded in 1989 and is based in Istanbul, Turkey. Armada Bilgisayar Sistemleri Sanayi ve Ticaret A.S. is a subsidiary of Aptec Holdings Limited.", "currency": "TRY", "sector": "Technology", "industry": "Electronics & Computer Distribution", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Istanbul"}, "DESPC.IS": {"short_name": "DESPEC BILGISAYAR", "long_name": "Despec Bilgisayar Pazarlama ve Ticaret Anonim Sirketi", "summary": "Despec Bilgisayar Pazarlama ve Ticaret Anonim Sirketi distributes ICT consumables in Turkey and internationally. The company distributes laser toners and accessories, and ink cartridges; magnetic media products, such as data cartridges and optical media products; printer ribbons; and photo, continuous form, inkjet, laserjet, deskjet, and plotter papers, as well as fax rolls and labels. It also distributes accessories consisting of mouse, speakers, game consoles, keyboards, adapters, cables, storage and carrying boxes, and cleaning materials; and wholesales computer consumables, and mobiles. The company was founded in 1995 and is headquartered in Istanbul, Turkey.", "currency": "TRY", "sector": "Technology", "industry": "Electronics & Computer Distribution", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Istanbul"}}