{"ARDYZ.IS": {"short_name": "ARD BILISIM TEKNOLOJILERI", "long_name": "ARD Grup Bilisim Teknolojileri Anonim Sirketi", "summary": "ARD Grup Bilisim Teknolojileri A.S. provides software solutions in Turkey. Its software solutions include e-Invoice, a solution for preparation and sharing of invoices used in enterprises in a digital environment; e-Archive that allows to store, submit, and report invoices in electronic media; national law software solutions; cloud solutions; cyber security software and systems; and SAP solutions, including SAP ERP, business analytics, mobile, and CRM solutions. The company also offers enterprise software solutions comprising corporate information management systems, corporate identity and access management systems, enterprise equipment tracking systems, e-government projects, RFID-based software and integration solutions, vehicle tracking and security control systems, logistic warehouse and container tracking systems, textile tracking and process management solutions, and social media tracking systems, as well as staff, visitor, and person tracking systems. In addition, it offers health system solutions consisting of sterilization tracking systems, patient tracking and baby tracking systems, hospital textile tracking systems, hospital fixtures and medical equipment tracking systems, and hospital warehouse tracking systems. Further, the company offers system solutions, including cyber security solutions, information system solutions, command center and security solutions, and smart technology solutions. ARD Grup Bilisim Teknolojileri A.S. was founded in 2011 and is based in Ankara, Turkey.", "currency": "TRY", "sector": "Technology", "industry": "Software—Infrastructure", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Ankara"}, "SMART.IS": {"short_name": "SMARTIKS YAZILIM", "long_name": "Smartiks Yazilim A.S.", "summary": "Smartiks Yazilim A.S. provides software development and consulting services. The company offers Oracle Human Resources, Oracle Siebel CRM, Oracle customer experience, corporate software development, The Internet of Things, and SmartXperience solutions. It serves health, insurance, banking and finance, retail, automotive, public, and telecom sectors. The company was founded in 2006 and is headquartered in Istanbul, Turkey.", "currency": "TRY", "sector": "Technology", "industry": "Software—Infrastructure", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Istanbul"}}