{
    "KFEIN.IS": {
        "short_name": "KAFEIN YAZILIM",
        "long_name": "Kafein Yazilim Hizmetleri Ticaret A.S.",
        "summary": "Kafein Yazilim Hizmetleri Ticaret A.S. provides various software solutions and services in Turkey and internationally. The company offers application development, test/test automation, project management, turn-key software solution, consultancy, managed, and outsourcing services. It also provides data analysis and data mining services primarily BSS support business support system and data archiving services, as well as data management and system integration services. The company serves telecom firms, insurance companies, banks, organizations, and retail and manufacturing companies. Kafein Yazilim Hizmetleri Ticaret A.S. was founded in 2005 and is based in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "city": "Istanbul"
    },
    "LINK.IS": {
        "short_name": "LINK BILGISAYAR",
        "long_name": "Link Bilgisayar Sistemleri Yazilimi ve Donanimi Sanayi ve Ticaret A.S.",
        "summary": "Link Bilgisayar Sistemleri Yazilimi ve Donanimi Sanayi ve Ticaret A.S. operates as a software development company in Turkey. The company develops integrated business application software that covers various accounting, production, and commercial operational requirements. Its software products include modules for tracking sales, marketing, purchasing, inventory management, warehouse-store management, current accounts, finance, accounting, production, budget planning, human resources, and fixed assets operations. The company also offers sales and after sales training, and support services through a network of approximately 500 authorized resellers and dealers. It distributes its products through distributor and business partner companies. The company was founded in 1984 and is headquartered in Istanbul, Turkey.",
        "currency": "TRY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "city": "Istanbul"
    },
    "LOGO.IS": {
        "short_name": "LOGO YAZILIM",
        "long_name": "Logo Yazilim Sanayi ve Ticaret A.S.",
        "summary": "Logo Yazilim Sanayi ve Ticaret A.S. develops software solutions in Turkey and internationally. It develops ERP solutions, such as j-Platform, a business management solution; Tiger 3 Enterprise and Netsis 3 Enterprise, which are ERP software products; Tiger 3, a corporate and operational solution to enterprises operating in sales, distribution, and service fields; and Netsis 3 Standard for end-to-end management of internal processes in the company. The company also offers SME solutions comprising GO 3 that enhances the business processes; Netsis 3 Entegre, a software; Mali Musavir Plus, an account software; and Start, a solution to manage inventory, cost, cash, invoicing, order, bank, and customer information, as well as project solutions, including treasury management, data collection and reporting, and B2B systems. In addition, it provides business analytics solutions, including Logo Mind Insight, a real-time reporting solution; Logo Mind Navigator, a reporting solution; and Logo Mind Budget, a budget management solution, as well as human resources solutions, such as j-HR, Tiger HR, Payroll Plus, Netsis HR, and Netsis 3 Bordro. Further, the company offers supply chain solutions, which comprise Logo Ocean, Logo Neon, and Logo Mobile Sales; integrated products, such as Logo Connect Bank, Logo Connect B2B, Netsis B2B, Logo Connect FDA, Go Garanti, and Turkcell Services for integrating data on Logo program that with internal/external software programs; and workflow management solutions. Additionally, it provides retail cloud solutions; CRM solutions; and e-government solutions, such as e-invoice, e-ledger, e-archive, and e-reconciliation solutions. The company serves distribution, machine and automotive spare part, packaging, retail, cement-glass-steel, furniture, telecom-information and communication, tourism, and textile sectors. Logo Yazilim Sanayi ve Ticaret Anonim Sirketi was founded in 1984 and is headquartered in Gebze, Turkey.",
        "currency": "TRY",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "IST",
        "market": "tr_market",
        "country": "Turkey",
        "city": "Gebze"
    }
}