{
    "TKCN.MX": {
        "short_name": "TURKCELL ILETISIM HIZMET",
        "long_name": "Turkcell Iletisim Hizmetleri A.S.",
        "summary": "Turkcell Iletisim Hizmetleri A.S. provides digital services in Turkey, Ukraine, Belarus, Azerbaijan, Cyprus, Germany, and the Netherlands. It operates through two segments, Turkcell Turkey and Turkcell International. It offers voice, data, and video communication solutions to its individual and corporate customers; and broadband services. The company also provides BiP, an all-access communication service application; TV+, which enables subscribers to watch series and other TV contents whenever and wherever they want; fizy, a digital music platform; Lifebox, a cloud data storage service; Dergilik, a digital publishing platform; Yaani, a search engine application; Digital Operator, an application for its customers to view and pay their bills, access packages, and make transactions; Turkcell Academy identifies training needs and provides trainings in areas of employee development; and Kopilot, an application that offers car driving experience with various features. In addition, it offers digital business, techfin, big data processing, business intelligence applications, location based services and platforms, customer relationship management and solutions, network management solutions, value added services, mobile financial systems, IPTV services, mobile marketing solutions, Internet of Things, geographic information systems, voice identification, AR/VR, 5G infrastructure projects, campaign management systems, image and video processing based on artificial intelligence, text analysis, suggestion engines, voice analytics, robot assistants, robotics process automation, mobile analytical platforms, digital broadcast solutions, content delivery network solutions, over-the-top, and block chain solutions; artificial intelligence in health, learning and education applications solutions; trades in electricity; consumer financing and insurance agency; and property investments services. The company was incorporated in 1993 and is headquartered in Istanbul, Turkey.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Wireless Communications",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Turkey",
        "state": null,
        "city": "Istanbul",
        "zipcode": "34854",
        "website": "http://www.turkcell.com.tr",
        "full_time_employees": null
    }
}