{
    "APTK.ME": {
        "short_name": "PHARMACY CHAIN 36.",
        "long_name": "Public Joint-Stock Company Pharmacy Chain 36.6",
        "summary": "Public Joint-Stock Company Pharmacy Chain 36.6 operates pharmacies in Russia. Its pharmacies offer health and beauty products. The company serves customers under the 36.6, Romir, and Gorzdrav brands. Public Joint-Stock Company Pharmacy Chain 36.6 was founded in 1991 and is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    },
    "DIOD.ME": {
        "short_name": "DIOD PJSC",
        "long_name": "DIOD Maker of Eco-Friendly Equipment and Nutrition Public Joint Stock Company",
        "summary": "DIOD Maker of Eco-Friendly Equipment and Nutrition Public Joint Stock Company researches, develops, manufactures, and sells nutritional supplements, pharmaceuticals, active cosmetics, and health equipment for home use. The company offers dihydroquercetine that is used in the production of nutritional supplements, drugs, cosmetics, and food additives; biologically active food additives; healthy cosmetics and skin care products; clinical nutrition products; and medical and environmental technology products. It also provides medicines to cure and prevent the development of socially important vascular and coronary diseases, inflammatory joint diseases, and weight-related problems, as well as diseases related to male and female reproductive health. The company markets its products primarily under the Capilar, Arthro-Active, Phase 2, Stella, Viardo, Iod-Active, and Selenium-Active brand names. It sells its products through wholesalers and foreign partners in Russia, Belarus, Ukraine, Kazakhstan, Georgia, Armenia, Serbia, Montenegro, Moldova, Latvia, the Czech Republic, Bulgaria, and internationally. DIOD Maker of Eco-Friendly Equipment and Nutrition Public Joint Stock Company was founded in 1931 and is based in Moscow, Russia.",
        "currency": "RUB",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    },
    "GEMA.ME": {
        "short_name": "INTL MED CNTR OF B",
        "long_name": "International Medical Center of Biomaterials Processing and Cryostorage Public Joint-stock company",
        "summary": "International Medical Center of Biomaterials Processing and Cryostorage Public Joint-stock company operates as a licensed bank for personal storage of cord blood stem cells in Russia and the CIS countries. The company is based in Moscow, Russia. International Medical Center of Biomaterials Processing and Cryostorage Public Joint-stock company is a subsidiary of Human Stem Cells Institute PJSC.",
        "currency": "RUB",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    },
    "ISKJ.ME": {
        "short_name": "HUMAN STEM CELLS",
        "long_name": "Public Joint-Stock Company \"Human Stem Cells Institute\"",
        "summary": "Public Joint-Stock Company Â\u0091Human Stem Cells Institute' operates as a biotech company primarily in Russia. The company engages in the drug discovery, research and development, and marketing of proprietary products and services in the field of regenerative medicine; bio-insurance; medical genetics, including reproductive genetics; gene therapy; and biopharmaceutics. It owns and operates Gemabank, a family cord blood stem cell bank in Russia and the CIS; and Reprobank, a reproductive cell and tissue bank for personal storage of reproductive cells and tissues, as well as a sperm/oocyte donation. The company also offers Neovasculgen, a gene-therapy drug for treatment of peripheral arterial disease, including critical limb ischemia; and SPRS-therapy (service for personal regeneration of skin), a set of personalized diagnostics and treatment procedures for repairing skin damages. In addition, it operates GENETICO, a medical genetics center and molecular diagnostic lab that provides a range of genetic analysis and counseling services for the early detection, prediction, and prophylactic treatment of genetic disorders, including reproductive system diseases; and provides preimplantation genetic diagnosis and screening that includes testing of developing embryos for monogenic inherited diseases and chromosome abnormalities during an in vitro fertilization cycle. Further, the company offers non-invasive prenatal testing of fetal chromosome abnormalities; and develops Gemacell, a cell-based drug candidate for treatment of myocardial infarction. Additionally, it provides range of diagnostic services for identification of genetic predisposition to oncological diseases; and distributes cell processing equipment. The company was founded in 2003 and is based in Moscow, Russia. Public Joint-Stock Company Â\u0091Human Stem Cells Institute' is a subsidiary of PJSC International Medical Center Processings and Kriokhraneniya of Biomaterialy.",
        "currency": "RUB",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Moscow"
    },
    "LIFE.ME": {
        "short_name": "PHARMSYNTHEZ PJSC",
        "long_name": "Public Joint-Stock Company \"Pharmsynthez\"",
        "summary": "Public Joint-Stock Company Â\u0091Pharmsynthez', a pharmaceutical company, researches, manufactures, and distributes officinal and generic active pharmaceutical ingredients in Russia and CIS countries. The company offers officinal medicines, including Neovir, Segidrin, Fenasid, and Penkrofton that are used in oncology, gynecology, treatment of immune deficiencies, and tuberculosis. Public Joint-Stock Company Â\u0091Pharmsynthez' has partnership with HiFiBiO Therapeutics Inks for the clinical development and commercialization of its SARS-CoV-2 neutralizing antibody in Russia. Public Joint-Stock Company Â\u0091Pharmsynthez' was founded in 1996 and is based in St. Petersburg, Russia.",
        "currency": "RUB",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "city": "Saint Petersburg"
    }
}