{
    "APL.NZ": {
        "short_name": "Asset Plus Limited Ordinary Sha",
        "long_name": "Asset Plus Limited",
        "summary": "NPT Limited operates as a property company. It invests in retail, commercial, and industrial properties located in Auckland, Wellington, Napier, and Christchurch. The company was formerly known as The National Property Trust and changed its name to NPT Limited on April 1, 2011. NPT Limited was founded in 1994 and is based in Wellington, New Zealand.",
        "currency": "NZD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.assetplusnz.co.nz",
        "market_cap": "Small Cap"
    },
    "ARG.NZ": {
        "short_name": "Argosy Property Limited Ordinar",
        "long_name": "Argosy Property Limited",
        "summary": "Argosy Property Limited in properties in New Zealand. Its investment portfolio consists of approximately 100 properties comprising retail, industrial, and commercial properties. The company's properties are primarily located in Auckland, Hamilton, and Wellington in New Zealand. The firm was formerly known as Argosy Property Trust. Argosy Property Limited is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.argosy.co.nz",
        "market_cap": "Small Cap"
    },
    "CDI.NZ": {
        "short_name": "CDL Investments New Zealand Lim",
        "long_name": "CDL Investments New Zealand Limited",
        "summary": "CDL Investments New Zealand Limited, together with its subsidiary, CDL Land New Zealand Limited engages in the investment, development, management, and sale of residential land properties in New Zealand. It holds approximately 290 hectares of land for development. CDL Investments New Zealand Limited is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1140",
        "website": "http://www.cdlinvestments.co.nz",
        "market_cap": "Small Cap"
    },
    "GMT.NZ": {
        "short_name": "Goodman Property Trust (NS) Ord",
        "long_name": "Goodman Property Trust",
        "summary": "Goodman Property Trust own, develop and manage industrial real estate in 17 countries including logistics facilities, warehouses and business parks. Our investment Partnerships give institutional investors access to our specialist investment management services and commercial and industrial property assets. In New Zealand, Goodman owns, develops and manages modern, high quality industrial and business space. The portfolio is exclusively invested in the Auckland industrial sector with estates located in the key suburbs of East Tamaki, Mangere, Mt Roskill, Mt Wellington, Otahuhu, Panmure, Penrose and Wiri. With over one million sqm of floorspace there is a scale to the portfolio that helps attract and retain customers. The top 10 customers provide approximately 32% of portfolio income. They include Coda, DHL, Fletcher Building, Fliway Transport, Foodstuffs, Freightways, NZ Post Group, OfficeMax, T&G Global, and Toll.",
        "currency": "NZD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://nz.goodman.com",
        "market_cap": "Mid Cap"
    },
    "IPL.NZ": {
        "short_name": "Investore Property Limited (NS)",
        "long_name": "Investore Property Limited",
        "summary": "Investore Property Limited (Investore) is a commercial property ownership business that has been established to invest in quality Large Format Retail property assets. Investore was established in October 2015 in connection with the acquisition of 19 Countdown supermarkets from Antipodean Supermarkets Limited and Antipodean Properties Limited. The transfer of six properties from Stride Property Limited (Stride) and Stride Holdings Limited to Investore took place between 29 April and 9 June 2016 by way of sale and purchase agreements for cash consideration equal to the most recently obtained independent valuation of the properties transferred (in each case, 31 March 2016). In June 2016, Investore entered into a sale and purchase agreement to acquire 14 Countdown supermarkets from Shopping Centres Australasia Property Group Trustee NZ Limited (the SCA Acquisition). Settlement of six properties occurred on 12 July 2016, with the other eight properties expected to settle in September 2016. Investore's investment strategy is focused on Large Format Retail property assets. Large Format Retail means a single-storey or low level property comprising retail shops and outlets and car parking areas with more than 50% of the property generally occupied by, and more than 50% of the rental generally provided by, a single major tenant or a limited number of major tenants under net leases. Investore believes that Large Format Retail assets have a specific, differentiating set of attributes that can provide a reliable income return to shareholders.",
        "currency": "NZD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.investoreproperty.co.nz",
        "market_cap": "Small Cap"
    },
    "KPG.NZ": {
        "short_name": "Kiwi Property Group Limited Ord",
        "long_name": "Kiwi Property Group Limited",
        "summary": "Kiwi Property (NZX: KPG) is one of the largest listed property companies on the New Zealand Stock Exchange and is a member of the S&P/NZX 20 Index. We've been around for over 25 years and proudly own, and manage a significant real estate portfolio, comprising some of New Zealand's best mixed-use, retail and office buildings. Our objective is to provide investors with a reliable investment in New Zealand property through the ownership and active management of a diversified, high-quality portfolio. S&P Global Ratings has assigned Kiwi Property an issuer credit rating of BBB (stable) and an issue credit rating of BBB+ for each of its fixed rate senior secured bonds. Kiwi Property is the highest rated New Zealand company within CDP (Carbon Disclosure Project) and is a member of FTSE4 Good, a series of benchmark and tradable indices for ESG (Environmental, Social and Governance) investors. Kiwi Property is licensed under the Real Estate Agents Act 2008.",
        "currency": "NZD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": null,
        "website": "http://www.kp.co.nz",
        "market_cap": "Small Cap"
    },
    "KWIPF": {
        "short_name": "KIWI PROPERTY GROUP LIMITED",
        "long_name": "Kiwi Property Group Limited",
        "summary": "Kiwi Property (NZX: KPG) is one of the largest listed property companies on the New Zealand Stock Exchange and is a member of the S&P/NZX 20 Index. We've been around for over 25 years and proudly own, and manage a significant real estate portfolio, comprising some of New Zealand's best mixed-use, retail and office buildings. Our objective is to provide investors with a reliable investment in New Zealand property through the ownership and active management of a diversified, high-quality portfolio. S&P Global Ratings has assigned Kiwi Property an issuer credit rating of BBB (stable) and an issue credit rating of BBB+ for each of its fixed rate senior secured bonds. Kiwi Property is the highest rated New Zealand company within CDP (Carbon Disclosure Project) and is a member of FTSE4 Good, a series of benchmark and tradable indices for ESG (Environmental, Social and Governance) investors. Kiwi Property is licensed under the Real Estate Agents Act 2008.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": null,
        "website": "http://www.kp.co.nz",
        "market_cap": "Small Cap"
    },
    "NZL.NZ": {
        "short_name": "New Zealand Rural Land Company ",
        "long_name": "New Zealand Rural Land Company Limited",
        "summary": "New Zealand Rural Land Company Limited focuses on investing and acquiring rural land across the New Zealand agricultural sector. It owns the land and provide a platform for farmers and food producers. The company was incorporated in 2020 and is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1023",
        "website": "http://nzrlc.co.nz",
        "market_cap": "Small Cap"
    },
    "PCT.NZ": {
        "short_name": "Precinct Properties New Zealand",
        "long_name": "Precinct Properties New Zealand Limited",
        "summary": "Precinct is New Zealand's only listed city centre specialist investing predominately in premium and A-grade commercial office property. Listed on the NZX Main Board, PCT currently owns Auckland's PwC Tower, AMP Centre, ANZ Centre (50%), Jarden House, HSBC House, Mason Bros. Building, 12 Madden Street, 10 Madden Street and Commercial Bay; and Wellington's AON Centre, NTT Tower, No. 1 and No. 3 The Terrace, Mayfair House and Bowen Campus. Precinct owns Generator NZ, New Zealand's premier flexible office space provider. Generator currently offers 13,600 square metres of space across four locations in Auckland.",
        "currency": "NZD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.precinct.co.nz",
        "market_cap": "Mid Cap"
    },
    "PFI.NZ": {
        "short_name": "Property For Industry Limited O",
        "long_name": "Property For Industry Limited",
        "summary": "Property For Industry Limited engages in the property investment and management business in New Zealand. The company invests in industrial properties located in North Harbour, Avondale, Penrose, Mount Wellington, Manukau, Mangere, East Tamaki, Wellington, and Christchurch. As of December 23, 2020, it operated a portfolio of 94 properties that are leased to 147 tenants. Property For Industry Limited was founded in 1994 and is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.propertyforindustry.co.nz",
        "market_cap": "Small Cap"
    },
    "SPG.NZ": {
        "short_name": "Stride Prop & Stride Invest Mgm",
        "long_name": "Stride Stapled Group",
        "summary": "Stride Stapled Group is a real estate investment firm specializing in co-investments and investments in commercial, retail, and industrial real estate properties. Investment properties comprise of freehold land, leasehold land, buildings and improvements that are held either to earn rental income or for capital appreciation or both. It seeks to invest in New Zealand. Stride Stapled Group is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.strideproperty.co.nz",
        "market_cap": "Mid Cap"
    },
    "VHP.NZ": {
        "short_name": "Vital Healthcare Property Trust",
        "long_name": "Vital Healthcare Property Trust",
        "summary": "Vital Healthcare Property Trust is a real estate investment trust externally managed by Vital Healthcare Management Limited. The firm investments in health and medical related properties in New Zealand and Australia. It undertakes acquisition or development of medical or healthcare-related properties such as surgical and medical facilities, geriatric and continuing care facilities primary healthcare facilities, and health support facilities. The fund may invest in conjunction with other health service providers. It was formerly known as ING Medical Properties Trust and Calan Healthcare Properties Trust.",
        "currency": "NZD",
        "sector": "Real Estate",
        "industry": "REIT - Healthcare Facilities",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.vitalhealthcareproperty.co.nz",
        "market_cap": "Small Cap"
    }
}