{
    "GMT.NZ": {
        "short_name": "Goodman Property Trust (NS) Ord",
        "long_name": "Goodman Property Trust",
        "summary": "Goodman Property Trust own, develop and manage industrial real estate in 17 countries including logistics facilities, warehouses and business parks. Our investment Partnerships give institutional investors access to our specialist investment management services and commercial and industrial property assets. In New Zealand, Goodman owns, develops and manages modern, high quality industrial and business space. The portfolio is exclusively invested in the Auckland industrial sector with estates located in the key suburbs of East Tamaki, Mangere, Mt Roskill, Mt Wellington, Otahuhu, Panmure, Penrose and Wiri. With over one million sqm of floorspace there is a scale to the portfolio that helps attract and retain customers. The top 10 customers provide approximately 32% of portfolio income. They include Coda, DHL, Fletcher Building, Fliway Transport, Foodstuffs, Freightways, NZ Post Group, OfficeMax, T&G Global, and Toll.",
        "currency": "NZD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://nz.goodman.com",
        "market_cap": 3199828736
    },
    "PFI.NZ": {
        "short_name": "Property For Industry Limited O",
        "long_name": "Property For Industry Limited",
        "summary": "Property For Industry Limited engages in the property investment and management business in New Zealand. The company invests in industrial properties located in North Harbour, Avondale, Penrose, Mount Wellington, Manukau, Mangere, East Tamaki, Wellington, and Christchurch. As of December 23, 2020, it operated a portfolio of 94 properties that are leased to 147 tenants. Property For Industry Limited was founded in 1994 and is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.propertyforindustry.co.nz",
        "market_cap": 1428955776
    }
}