{
    "0004.HK": {
        "short_name": "WHARF HOLDINGS",
        "long_name": "Wharf (Holdings) Limited",
        "summary": "Founded in 1886 with Hong Kong as its base, The Wharf (Holdings) Limited (Stock code: 0004) is the 17th company incorporated in Hong Kong and a premier company with a long history. As one of the 30 constituent stocks in the original Hang Seng Index since more than 50 years ago, Wharf is among the top local blue chips that is most actively traded and widely held. Backed by a long standing mission of Â\u0093Building for TomorrowÂ\u0094 and a proven track record in management and execution, the Group has produced consistent and productive performance over the years. Subsequent to the separate listing of Wharf Real Estate Investment Company Limited in November 2017 which focuses on its Hong Kong investment properties portfolio, The Wharf (Holdings) Limited's businesses are largely property-related, comprising Investment Properties, Hotels and Development Properties in Hong Kong and Mainland China. Other businesses include Logistics through Modern Terminals and Hong Kong Air Cargo Terminals. Wharf's Peak Portfolio redefines the concept of luxury living with a collection of the rare and most prestigious residences, epitomising a unique and exclusive lifestyle at the most sought-after addresses in town. Besides the highly-acclaimed Mount Nicholson, other properties under development include 1 Plantation Road, 11 Plantation Road and 77 Peak Road. Besides The Peak Portfolio, the development pipeline of Hong Kong Properties also includes the Kowloon Tong Residential Project and projects in Kowloon East. In the Mainland, Wharf spearheads its investment properties with the International Finance Square (IFS) series at the very heart of CBD or new CBD in high potential cities including Changsha, Chengdu, Chongqing, Suzhou and Wuxi. IFS developments are positioned as trendsetting landmarks with unrivalled locations, superior planning and design, retailer and shopper critical mass, as well as top-notch retail management. Changsha IFS, 2018's newest to the collection, and Chengdu IFS opened in 2014 are comparable to Harbour City in Hong Kong in scale and prominence. The boutique Chongqing IFS, featuring the largest cluster of first-tier brands in Chongqing, was opened in 2017. The Group continues to adopt a selective land acquisition policy with strategic focus on key Tier 1 or 2 cities in order to secure high quality land bank with returns. The development property landbank at the end of June 2019 totalled 3.6 million square metres. Wharf Hotels manages an expanding portfolio of 17 hotels in Asia, spearheaded by a prominent Niccolo brand in recent years. The Wharf Hotels owns four contemporary, urban, chic Niccolo hotels (including The Murray, Hong Kong and Niccolo Changsha) and manages 13 Marco Polo hotels in Hong Kong, Mainland China and the Philippines. Niccolo Suzhou is the newest addition under development and is scheduled to open in 2021. The Group also owns and operates Modern Terminals and Hong Kong Air Cargo Terminals, key components in Hong Kong's success as a hub for international trade and international transportation for decades. CME2 is the Group's long-term investment, representing a strategic initiative of reinvesting capital and profit released from the CME1 exit in Hong Kong in a progressive new economy infrastructure CME2 arena that covers much larger markets with greater growth potential. Â\u0093Building for TomorrowÂ\u0094 also extends to Wharf's Â\u0093Business-in-CommunityÂ\u0094 (Â\u0093BICÂ\u0094) pursuit. With the flagship school improvement programme Â\u0093Project WecanÂ\u0094 growing from strength to strength, the Group supports a series of BIC initiatives including Wu Zhi Qiao (Bridge to China) Charitable Foundation, Shanghai International Tower-running Grand Prix and Operation Panda with an aim of promoting BIC and to bring benefits to different segments of society.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "0009.HK": {
        "short_name": "KEYNE LTD",
        "long_name": "Keyne Ltd",
        "summary": "Keyne Ltd, an investment holding company, primarily engages in the property and hotel development business in Hong Kong and Mainland China. The company is involved in the property rental and centralized heat supply businesses. It also provides management services. The company was formerly known as Nine Express Limited and changed its name to Keyne Ltd in March 2020. The company was incorporated in 2001 and is headquartered in Causeway Bay, Hong Kong. Keyne Ltd is a subsidiary of Keyne Holdings Ltd.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "0010.HK": {
        "short_name": "HANG LUNG GROUP",
        "long_name": "Hang Lung Group Limited",
        "summary": "Hang Lung Group Limited, an investment holding company, operates as a property developer in Hong Kong and Mainland China. The company operates through Property Leasing and Property Sales segments. It develops properties for sale and lease, such as large-scale commercial, office, and residential developments. The company also develops various properties, including shopping mall, office, residential, serviced apartments, and carparks. Its investment properties portfolio includes Grand Gateway 66, a commercial, office, and residential complex, as well as Plaza 66, a commercial and office complex in Shanghai; Palace 66 and Forum 66 in Shenyang; Parc 66 in Jinan; Center 66 in Wuxi; Riverside 66 in Tianjin; Olympia 66 in Dalian; Spring City 66 in Kunming; Heartland 66 in Wuhan; and Westlake 66. In addition, the company offers car park and property management, securities trading, financial, project management, and property agency services, as well as operates and manages apartment. Hang Lung Group Limited was incorporated in 1960 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0014.HK": {
        "short_name": "HYSAN DEV",
        "long_name": "Hysan Development Company Limited",
        "summary": "Hysan is a leading property investment, management and development company in Hong Kong, with a portfolio of more than 4 million square feet of high-quality office, retail and residential properties. Operating primarily in the city's prime retail/office district of Causeway Bay, we are focused on delighting our customers and providing investors with outstanding returns.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0029.HK": {
        "short_name": "DYNAMIC HOLD",
        "long_name": "Dynamic Holdings Limited",
        "summary": "Dynamic Holdings Limited, an investment holding company, engages in the investment and development of properties in the People's Republic of China and Hong Kong. The company operates through Property Rental and Property Sales segments. Its investment properties portfolio primarily comprises offices, shopping malls, and car parks, as well as residential properties. Dynamic Holdings Limited company also leases and sells properties. In addition, it is involved in the provision of nominee, management, financing, and management consultancy services. Dynamic Holdings Limited was founded in 1992 and is based in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "0034.HK": {
        "short_name": "KOWLOON DEV",
        "long_name": "Kowloon Development Company Limited",
        "summary": "Kowloon Development Company Limited, an investment holding company, engages in the investment, development, and management of properties in Hong Kong and Mainland China. The company develops, leases, and sells various residential and commercial projects, such as club houses, car parking facilities, retail shops, shopping arcades, and residential towers, as well as hotels and office buildings. As of December 31, 2020, its land bank for development totaled to approximately 3.7 million square meters of gross floor area. The company also provides security, technical, and housekeeping services; building surveying and guarding services; financial investments and services; and project management services, as well as undertakes construction contracts. In addition, it engages in the treasury operations; retail activities; and distribution of films and cinematograph films. The company was incorporated in 1961 and is headquartered in Mong Kok, Hong Kong. Kowloon Development Company Limited is a subsidiary of Intellinsight Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Mong Kok"
    },
    "0035.HK": {
        "short_name": "FE CONSORT INTL",
        "long_name": "Far East Consortium International Limited",
        "summary": "Far East Consortium International Limited, an investment holding company, engages in the property development and investment, hotel operations and management, car park operations and facilities management, gaming operations and management, and treasury management businesses. It develops a portfolio of residential properties; invests in retail and office buildings; and operates hotels. The company also operates third party and self-owned car parks; and owns and operates casinos and gaming facilities. In addition, it provides loan financing, sales agency, mortgage, administration and management, vault, and hotel management and consultancy services, as well as engages in the securities and financial investment activities. As of March 31, 2020, the company owned and operated 31 hotels with approximately 8,100 rooms; and managed 470 car parks with approximately 106,696 car parking bays. It has operations in Australia, New Zealand, the Czech Republic, Hong Kong, Malaysia, the People's Republic of China, Singapore, the United Kingdom, and the rest of Europe. The company is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0050.HK": {
        "short_name": "HK FERRY (HOLD)",
        "long_name": "Hong Kong Ferry (Holdings) Company Limited",
        "summary": "Hong Kong Ferry (Holdings) Company Limited, an investment holding company, primarily engages in the property development and investment business in Hong Kong. The company operates in four segments: Property Development; Property Investment; Ferry, Shipyard and Related Operations; and Securities Investment. It develops and sells residential units, commercial arcades, and car parking spaces; invests in and leases real estate properties; and offers property management services. The company also provides dangerous goods vehicular ferry, and ship repair and maintenance services, as well as sells goods on cruise vessels. In addition, it invests in debt and equity securities; provides property finance; and engages in the trading and floating restaurant business. The company was formerly known as The Hongkong and Yaumati Ferry Company Limited and changed its name to Hong Kong Ferry (Holdings) Company Limited in 1989. Hong Kong Ferry (Holdings) Company Limited was founded in 1923 and is based in Tsing Yi, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsing Yi"
    },
    "0075.HK": {
        "short_name": "Y.T. REALTY",
        "long_name": "Y. T. Realty Group Limited",
        "summary": "Y. T. Realty Group Limited, an investment holding company, engages in the property investment and trading activities in Hong Kong and the United Kingdom. It operates through four segments: Property Investment, Property Trading, Property Management and Related Services, and Treasury Management. The company also offers property management and related technical consultancy services; property rental services; and corporate management services. In addition, it invests in debt securities and time deposits. The company was formerly known as Prestige Properties Holdings Limited and changed its name to Y. T. Realty Group Limited in June 2002. Y. T. Realty Group Limited is headquartered in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0081.HK": {
        "short_name": "CH OVS G OCEANS",
        "long_name": "China Overseas Grand Oceans Group Limited",
        "summary": "China Overseas Grand Oceans Group Limited, together with its subsidiaries, invests in, develops, and leases real estate properties in the People's Republic of China. It operates through Property Investment and Development, Property Leasing, and Other segments. The Property Investment and Development segment constructs residential and commercial properties. The Property Leasing segment leases office units, commercial units, and hotel properties. The Other segment operates a hotel. It is also involved in fund raising activities; and provision of financing and investment, and property management services. The company was formerly known as Shell Electric Manufacturing (Holdings) Co. Ltd. and changed its name to China Overseas Grand Oceans Group Limited in March 2010. China Overseas Grand Oceans Group Limited was founded in 1955 and is based in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Admiralty"
    },
    "0088.HK": {
        "short_name": "TAI CHEUNG HOLD",
        "long_name": "Tai Cheung Holdings Limited",
        "summary": "Tai Cheung Holdings Limited, an investment holding company, engages in the property investment, development, and management activities in Hong Kong. The company's property portfolio includes office towers, and industrial and residential buildings. It also provides construction and corporate secretary services. The company was founded in 1956 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0093.HK": {
        "short_name": "TERMBRAY IND",
        "long_name": "Termbray Industries International (Holdings) Limited",
        "summary": "Termbray Industries International (Holdings) Limited, an investment holding company, invests in, develops, and sells real estate properties in the People's Republic of China. The company's portfolio of properties includes residential units, commercial arcades, and car parks. It also engages in the money lending business. The company was incorporated in 1990 and is headquartered in Tsuen Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsuen Wan"
    },
    "0095.HK": {
        "short_name": "LVGEM CHINA",
        "long_name": "LVGEM (China) Real Estate Investment Company Limited",
        "summary": "LVGEM (China) Real Estate Investment Company Limited, an investment holding company, engages in property development and investment businesses in the People's Republic of China. The company operates through Real Estate Development and Sales, Commercial Property Investment and Operations, and Comprehensive Services segments. It develops and sells properties; invests in, operates, and leases commercial properties, office premises, apartments, and car parks; operates hotels; and offers property management, consultancy, and other services to customers and tenants of its residential and commercial properties. LVGEM (China) Real Estate Investment Company Limited was founded in 1995 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "0101.HK": {
        "short_name": "HANG LUNG PPT",
        "long_name": "Hang Lung Properties Limited",
        "summary": "Hang Lung Properties Limited, an investment holding company, engages in the property investment, development, and management activities in Hong Kong and Mainland China. The company operates through Property Leasing and Property Sales segments. The company is involved in the property leasing business; and development and sale of properties. Its investment properties portfolio includes shopping malls, office, residential, serviced apartment, hotel, and car parking properties, as well as industrial premises. The company also engages in the apartment operating and management; car parking and project management; and property agency activities. In addition, it provides management and financial services. The company was incorporated in 1949 and is headquartered in Central, Hong Kong. Hang Lung Properties Limited is a subsidiary of Hang Lung Group Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0106.HK": {
        "short_name": "LANDSEA PPT",
        "long_name": "Landsea Green Properties Co., Ltd.",
        "summary": "Landsea Green Properties Co., Ltd., an investment holding company, develops and sells properties in Mainland China and the United States. The company operates through Property Development and Sales in Mainland China, Property Development and Sales in the US, Management Services, and Office Property Investment segments. It is also involved in the property leasing, decoration and design, marketing, and financial and elderly care services businesses. The company was formerly known as Landsea Green Group Co., Ltd. and changed its name to Landsea Green Properties Co., Ltd. in November 2019. The company was founded in 2001 and is headquartered in Central, Hong Kong. Landsea Green Properties Co., Ltd. is a subsidiary of Greensheid Corporation.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0120.HK": {
        "short_name": "COSMOPOL INT'L",
        "long_name": "Cosmopolitan International Holdings Limited",
        "summary": "Cosmopolitan International Holdings Limited, an investment holding company, develops and invests in real estate properties in Hong Kong and Mainland China. It operates through two segments, Property Development and Investment, and Financial Assets Investments. The company develops and sells properties; leases properties; and trades in financial assets, as well as invests in other financial assets. Cosmopolitan International Holdings Limited also provides financing and development consultancy services. The company was founded in 1991 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "0123.HK": {
        "short_name": "YUEXIU PROPERTY",
        "long_name": "Yuexiu Property Company Limited",
        "summary": "Yuexiu Property Company Limited, together with its subsidiaries, develops, sells, and manages properties primarily in Mainland China and Hong Kong. It operates through Property Development, Property Management, Property Investment, and Other segments. The company is also involved in holding investment properties. In addition, it offers property development and management consulting, property rental, decoration and design, project management, real estate and property agency, investment consulting, metal manufacturing, information consulting, car parking management, financial, building management, commercial, greening, construction, and trade finance services. As of December 31, 2020, the company owned investment properties under lease of approximately 774,000 sq.m. comprising offices, commercial properties, car parks, and others; and a total landbank of approximately 24.54 million sq.m. The company was formerly known as Guangzhou Investment Company Limited. The company was incorporated in 1992 and is based in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0124.HK": {
        "short_name": "GD LAND",
        "long_name": "Guangdong Land Holdings Limited",
        "summary": "Guangdong Land Holdings Limited, an investment holding company, engages in property development and investment businesses primarily in Mainland China. The company was formerly known as Kingway Brewery Holdings Limited and changed its name to Guangdong Land Holdings Limited in September 2013. The company was incorporated in 1997 and is headquartered in Central, Hong Kong and is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange. Guangdong Land Holdings Ltd. is a subsidiary of Guangdong Investment Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0131.HK": {
        "short_name": "CHEUK NANG HOLD",
        "long_name": "Cheuk Nang (Holdings) Limited",
        "summary": "Cheuk Nang (Holdings) Limited, an investment holding company, engages in the investment, development, management, and trading of properties in the People's Republic of China, Hong Kong, and Malaysia. It operates through Property Sales, Property Rental, Estate Management, and Others segments. The company develops residential, commercial, and retail properties. It is also involved in the provision of secretarial and management services; and securities trading and debentures, and mortgage lending activities. The company was formerly known as Far East Wool & Fibre Mill, Limited and changed its name to Cheuk Nang (Holdings) Limited in 1988. The company was founded in 1963 and is based in Wan Chai, Hong Kong. Cheuk Nang (Holdings) Limited is a subsidiary of Yan Yin Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0141.HK": {
        "short_name": "SKYCHINAFORTUNE",
        "long_name": "Sky Chinafortune Holdings Group Limited",
        "summary": "Sky Chinafortune Holdings Group Limited, an investment holding company, engages in property investment activities in the People's Republic of China. It operates through Property Investment, Trading of Properties and Property Related Services, and Retail Business segments. The company leases residential premises, shops, and car parks; sells properties; and offers property management and property related services. It is also involved in the retail sale of Chinese liquor and wine, and everyday items. The company was formerly known as Great China Holdings Limited and changed its name to Sky Chinafortune Holdings Group Limited in July 2019. The company was incorporated in 1965 and is based in Central, Hong Kong. Sky Chinafortune Holdings Group Limited is a subsidiary of Hopevision Group Ltd.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0158.HK": {
        "short_name": "MELBOURNE ENT",
        "long_name": "Melbourne Enterprises Limited",
        "summary": "Melbourne Enterprises Limited, an investment holding company, engages in property investment activities in Hong Kong. Its investment properties include commercial and retail. The company is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0160.HK": {
        "short_name": "HON KWOK LAND",
        "long_name": "Hon Kwok Land Investment Company, Limited",
        "summary": "Hon Kwok Land Investment Company, Limited, an investment holding company, engages in the property development, investment, and related activities in Hong Kong and Mainland China. It operates through three segments: Property Development; Property Investment; and Property, Carpark Management, and Others. The company's properties include commercial/office buildings, hotels, serviced apartment, and residential buildings. It also provides management services for residential and commercial properties. In addition, the company engages in carpark management, property holding and letting, project management, and sub-leasing activities. Further, it provides nominee, financing, and money lending services. The company is based in Central, Hong Kong. Hon Kwok Land Investment Company, Limited is a subsidiary of Chinney Investments, Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0163.HK": {
        "short_name": "EMPEROR INT'L",
        "long_name": "Emperor International Holdings Limited",
        "summary": "Emperor International Holdings Limited, an investment holding company, engages in the property investment and development, and hospitality activities in Hong Kong, Macau, the United Kingdom, and the People's Republic of China. It operates through Lease of Properties, Properties Development, and Hotel and Hotel Related Operations segments. The Lease of Properties segment rents properties. The Properties Development segment engages in the development and redevelopment of properties for sale. The Hotel and Hotel Related Operations segment operates the Emperor Hotel, MORI MORI serviced apartments, the unit serviced apartments, Grand Emperor Hotel, and Inn Hotel Macau; and mass market halls, VIP rooms, and slot machine halls, as well as provides gaming-related marketing and public relation services. The company's property portfolio includes residential properties, retail spaces, shopping malls, and industrial and commercial buildings. In addition, it provides project financing and management, treasury service, property agency, and catering services. The company was founded in 1990 is headquartered in Wan Chai, Hong Kong. Emperor International Holdings Limited is a subsidiary of Emperor International Group Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0169.HK": {
        "short_name": "WANDA HOTEL DEV",
        "long_name": "Wanda Hotel Development Company Limited",
        "summary": "Wanda Hotel Development Company Limited, an investment holding company, engages in the property development, investment, leasing, and management activities in the People's Republic of China. The company operates through three segments: Hotel Operation and Management Services, Hotel Design and Construction Management Services, and Investment Properties Leasing. It develops, leases, and sells commercial and residential properties. The company also engages in the design, development, construction, operation, and management of hotels, as well as provides construction consulting services; and sells goods. As of 31 December 2020, it manages, leases, operates, and franchises 94 hotels that consists of 25,473 rooms under the Wanda Reign, Wanda Vista, Wanda Realm, Wanda Jin, Wanda Yi, Wanda Moments, and Wanda Yue brands in the People's Republic of China. The company was formerly known as Wanda Commercial Properties (Group) Co., Limited and changed its name to Wanda Hotel Development Company Limited in October 2014. The company is based in Central, Hong Kong. Wanda Hotel Development Company Limited is a subsidiary of Wanda Commercial Properties Overseas Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0171.HK": {
        "short_name": "SILVER GRANT",
        "long_name": "Silver Grant International Holdings Group Limited",
        "summary": "Silver Grant International Holdings Group Limited, an investment holding company, engages in the property investment and securities trading businesses in the People's Republic of China. It operates through Investments and Property Leasing segments. The company primarily invests in and develops residential and commercial properties, as well as financial assets. It also engages in the environmental conservation and renewable energy business; and property rental business. The company was formerly known as Silver Grant International Industries Limited and changed its name to Silver Grant International Holdings Group Limited in May 2019. The company is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0173.HK": {
        "short_name": "K. WAH INT'L",
        "long_name": "K. Wah International Holdings Limited",
        "summary": "K. Wah International Holdings Limited, an investment holding company, engages in the property development and investment activities in Hong Kong and Mainland China. Its property portfolio comprises residential developments, office towers, hotels, serviced apartments, and commercial facilities. The company also provides property management services to residential buildings, commercial facilities, office towers, and real estate complexes. In addition, it offers financial, management, and decoration services. K. Wah International Holdings Limited was incorporated in 1990 and is headquartered in North Point, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "North Point"
    },
    "0183.HK": {
        "short_name": "WINFULL GP",
        "long_name": "Winfull Group Holdings Limited",
        "summary": "Winfull Group Holdings Limited, an investment holding company, engages in the property investment, development, and trading businesses in Hong Kong, the United Kingdom, and Japan. It is also involved in the provision of renovation services; security investment and trading business; and money lending activities. The company was formerly known as Richfield Group Holdings Limited and changed its name to Winfull Group Holdings Limited in March 2015. The company is headquartered in Central, Hong Kong. Winfull Group Holdings Limited is a subsidiary of Virtue Partner Group Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0185.HK": {
        "short_name": "ZENSUN ENT",
        "long_name": "Zensun Enterprises Limited",
        "summary": "Zensun Enterprises Limited, an investment holding company, engages in the property development, property investment and management, and securities trading and investment businesses. The company also offers loan financing services. It has operations in Hong Kong, the People's Republic of China, Singapore, Japan, and the United States. The company was formerly known as ZH International Holdings Limited and changed its name to Zensun Enterprises Limited in July 2019. The company was founded in 1965 and is headquartered in Central, Hong Kong. Zensun Enterprises Limited is a subsidiary of Joy Town Inc.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0190.HK": {
        "short_name": "HKC (HOLDINGS)",
        "long_name": "HKC (Holdings) Limited",
        "summary": "HKC (Holdings) Limited, together with its subsidiaries, engages in the property development and investment, and renewable energy investment and operation businesses in the People's Republic of China. It operates through Properties Development, Property Investment and Leasing, Renewable Energy, and Other Operations segments. The company develops and builds residential properties, including townhouses, high-rise apartments, and commercial shops; and invests in shopping malls and offices, as well as properties for restaurants and retails. It also holds properties; develops and operates building materials center; owns and operates wind power and distributed solar projects; and provides property management services. The company was incorporated in 2006 and is headquartered in Tsim Sha Tsui, Hong Kong. HKC (Holdings) Limited is a subsidiary of Claudio Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "0191.HK": {
        "short_name": "LAI SUN INT'L",
        "long_name": "Lai Sun Garment (International) Limited",
        "summary": "Lai Sun Garment (International) Limited, an investment holding company, invests in, develops, leases, manages, and sells properties. The company operates through Property Development and Sales, Property Investment, Hotel Operation, Restaurant Operation, Media and Entertainment, Film and TV Program, Cinema Operation, Theme Park Operation, and Others segments. Its property portfolio includes commercial/retail, office, industrial, residential, and hotel/serviced apartment properties. The company also invests in, develops, operates, and manages hotels and restaurants, cultural, leisure, entertainment, and related facilities; and provides management and consultancy services to hotels, restaurants, and serviced apartments. In addition, it engages in the development, operation, and investment of media, entertainment, and music production and distribution; and cinema operations, as well as provides related advertising services. Further, the company invests in, produces, sells, licenses, and distributes television programs, films, and video format products, as well as engages in golf apparel retailing. Additionally, the company offers property management, real estate agency, performance agency, leasing agency, and building services; luxury yachts brokerage, charter, marketing, management, and crew placement services; and finance and treasury services. It also provides artiste management services; sells albums; distributes and licenses music; trades in gaming products; and develops and operates theme parks. The company is involved in the film library management, central kitchen operation, and video duplication services, as well as translating and subtitling of television programs. It operates in Hong Kong, the United Kingdom, Vietnam, Mainland China, Macau, and internationally. Lai Sun Garment (International) Limited was founded in 1947 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0194.HK": {
        "short_name": "LIU CHONG HING",
        "long_name": "Liu Chong Hing Investment Limited",
        "summary": "Liu Chong Hing Investment Limited, an investment holding company, engages in the investment, development, management, and letting of real estate properties in Hong Kong and the People's Republic of China. The company operates through Property Investment, Property Development, Property Management, Treasury Investment, Trading and Manufacturing, and Hotel Operation segments. Its projects primarily include offices, commercial buildings, residential buildings, industrial buildings, and shopping centers, as well as retail stores. The company also provides money lending and nominee services; operates and manages budget hotels under the Hanting name, as well as 183-room hotel and serviced residences; manufactures magnetic materials; and deals and invests in securities and other financial instruments, as well as develops and sells properties, including interior decoration services. In addition, it is involved in the food and beverage business. The company was incorporated in 1970 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0202.HK": {
        "short_name": "EVERCHINA INT'L",
        "long_name": "EverChina Int'l Holdings Company Limited",
        "summary": "EverChina Int'l Holdings Company Limited primarily engages in the property investment and hotel operations in Hong Kong, the People's Republic of China, and Bolivia. It operates through Property Investment Operation, Hotel operation, Securities Investment and Financing Operation, and Agricultural Operation segments. The company is involved in the leasing of residential and commercial properties, as well as car parking space rental; exploration, mining processing, and sale of manganese resources; securities investment activities; and provision of corporate management, and financial services. It also engages in the raising and sale of cattle, as well as agricultural farming activities; and sale of soybean, corn, and rice. The company was formerly known as Interchina Holdings Company Limited and changed its name to EverChina Int'l Holdings Company Limited in February 2014. EverChina Int'l Holdings Company Limited is based in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0208.HK": {
        "short_name": "POLYTEC ASSET",
        "long_name": "Polytec Asset Holdings Limited",
        "summary": "Polytec Asset Holdings Limited, an investment holding company, primarily invests in, develops, and trades in real estate properties in the People's Republic of China and Kazakhstan. The company operates through four segments: Properties, Oil, Ice and Cold Storage, and Financial Investments. It develops residential and commercial properties. The company has a development land bank of 294,000 square meters; and investment land bank of approximately 18,000 square meters in Macau. It is also involved in the oil exploration and production activities in Kazakhstan; manufacturing and trading ice; the provision of cold storage and consultancy services; and general trading activities. In addition, the company involved in equity and debt securities. The company was formerly known as Kin Don Holdings Limited and changed its name to Polytec Asset Holdings Limited in January 2004. The company was incorporated in 1998 and is headquartered in Kowloon, Hong Kong. Polytec Asset Holdings Limited is a subsidiary of Marble King International Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "0212.HK": {
        "short_name": "NANYANG HOLD",
        "long_name": "Nanyang Holdings Limited",
        "summary": "Nanyang Holdings Limited, an investment holding company, engages in the property investment and trading businesses in Hong Kong, the United States, Europe, Taiwan, and internationally. The company operates through Real Estate and Financial Investments segments. The Real Estate segment invests in and leases industrial/office spaces. The Financial Investments segment holds and trades in investment securities. Nanyang Holdings Limited was founded in 1947 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0216.HK": {
        "short_name": "CHINNEY INV",
        "long_name": "Chinney Investments, Limited",
        "summary": "Chinney Investments, Limited, an investment holding company, primarily engages in the property development and investment activities in Hong Kong and Mainland China. It operates through three segments: Property Development; Property Investment; and Property, Carpark Management and Others. The company is also involved in sub-leasing business, as well as offers management services to residential and commercial properties. It also offers property holding and letting, project management, carpark management, nominee, financing, and money lending services. The company was incorporated in 1959 and is based in Central, Hong Kong. Chinney Investments, Limited is a subsidiary of Chinney Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0225.HK": {
        "short_name": "POKFULAM",
        "long_name": "Pokfulam Development Company Limited",
        "summary": "Pokfulam Development Company Limited, an investment holding company, invests in, develops, and manages real estate properties in Hong Kong. It operates through three segments: Property Investment and Management, Trading of Goods, and Securities Investment. The company lets out and manages commercial, industrial, and residential properties. It also trades in visual and sound equipment; deals in listed securities; and provides trustee and nominee services. Pokfulam Development Company Limited was incorporated in 1970 and is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0230.HK": {
        "short_name": "MINMETALS LAND",
        "long_name": "Minmetals Land Limited",
        "summary": "Minmetals Land Limited, an investment holding company, engages in the real estate development business in the People's Republic of China. It operates through Real Estate Development, Specialized Construction, Property Investment, and Securities Investment segments. The company develops and sells residential and commercial properties; and designs, installs, and sells curtain walls, as well as aluminum windows, doors, and other materials. It also holds and rents properties; invests in securities; and provides management, property management, and fund-raising services. The company is based in Tsim Sha Tsui, Hong Kong. Minmetals Land Limited is a subsidiary of June Glory International Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "0237.HK": {
        "short_name": "SAFETY GODOWN",
        "long_name": "Safety Godown Company, Limited",
        "summary": "Safety Godown Company, Limited, an investment holding company, engages in leasing of investment properties in Hong Kong. It operates through Godown Operations, Property Investment, and Treasury Investment segments. The company is also involved in the operation of godowns; and securities trading and investment activities. Safety Godown Company, Limited was founded in 1960 and is based in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "0242.HK": {
        "short_name": "SHUN TAK HOLD",
        "long_name": "Shun Tak Holdings Limited",
        "summary": "Shun Tak Holdings Limited, an investment holding company, engages in property, transportation, hospitality, and investment businesses in Hong Kong, Macau, Mainland China, and internationally. It develops and sells property; markets and leases retail, office, and residential properties; offers property management services for residential and commercial properties; and provides property cleaning, laundry, maintenance and repair, project works, hygiene, pest control, waste management, legal advice, and financial management services. The company also offers passenger sea and land transportation services across destinations within the Pearl River Delta connecting cities, such as Hong Kong, Macau, Zhuhai, Shenzhen, and Shekou under the TurboJET brand name. In addition, it operates hotels and golf clubs, entertainment attractions, and travel consultancies, as well as offers MICE and transportation services; invests in gaming concessionaires; and operates toy stores under the Â\u0093ToysÂ\u0091R'UsÂ\u0094 name. Additionally, the company provides financing; hospitality management and auxiliary; and travel agency services. Shun Tak Holdings Limited was founded in 1972 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0247.HK": {
        "short_name": "TST PROPERTIES",
        "long_name": "Tsim Sha Tsui Properties Limited",
        "summary": "Tsim Sha Tsui Properties Limited, an investment holding company, invests in, develops, manages, and trades in properties primarily in the People's Republic of China, Singapore, and Australia. The company operates through six segments: Property Sales; Property Rental; Property Management and Other Services; Hotel Operations; Investments in Securities; and Financing. It is also involved in the share investment and dealing, mortgage loan financing, building construction and management, and project management activities. In addition, it offers financial, cleaning, management, premium living, consultancy, administrative, deposit placing, financing, and security services. Its property portfolio includes residential, commercial, industrial, hotels and car parks. As of June 30, 2020, the company had a land bank of approximately 22.3 million square feet floor area. Tsim Sha Tsui Properties Limited was incorporated in 1972 and is based in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "0258.HK": {
        "short_name": "TOMSON GROUP",
        "long_name": "Tomson Group Limited",
        "summary": "Tomson Group Limited, an investment holding company, engages in property development and investment, hospitality and leisure, securities trading, PVC, and media and entertainment investment businesses in Hong Kong, Macau, and Mainland China. It develops commercial, residential, and industrial properties, as well as offers property management services. The company also operates Tomson Shanghai Pudong golf club located in Huamu District of Pudong, Shanghai; and holds a 50% interest in a hotel situated in Lujiazui of Pudong. In addition, it manufactures and trades in PVC pipes and fittings; and provides nominee and secretarial, and administrative services. Further, the company engages in the investment and production of live entertainment shows; film distribution business; and trademark holding activities. Tomson Group Limited is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0262.HK": {
        "short_name": "DESON DEV INT'L",
        "long_name": "Deson Development International Holdings Limited",
        "summary": "Deson Development International Holdings Limited, an investment holding company, primarily engages in the property investment and development businesses in Hong Kong and Mainland China. It invests in and develops residential and commercial properties. The company also trades in medical equipment, and home security and automation products, as well as provides related installation and maintenance services; wellness, health care, and cosmetic products; and wellness and pandemic prevention products. It offers wired and wireless security devices and systems, which are used in various applications, such as residential estates, commercial offices, shops, hotels, hospitals, museums, and prisons; and operates property funds. Deson Development International Holdings Limited was founded in 1988 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "0266.HK": {
        "short_name": "TIAN TECK LAND",
        "long_name": "Tian Teck Land Limited",
        "summary": "Tian Teck Land Limited, an investment holding company, engages in the property investment activities in the People's Republic of China and Hong Kong. As of March 31, 2020, its investment properties include iSQUARE complex in Tsim Sha Tsui; various units of Good Luck Industrial Building; a floor of Euro Trade Centre; various units of an industrial property; and two residential properties. The company is based in Tsim Sha Tsui, Hong Kong. Tian Teck Land Limited is a subsidiary of Tian Teck Investment Holding Co., Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "0271.HK": {
        "short_name": "ASIASEC PPT",
        "long_name": "Asiasec Properties Limited",
        "summary": "Asiasec Properties Limited, an investment holding company, engages in property investment, property leasing, and estate management businesses primarily in Hong Kong. The company's investment properties include commercial, residential, and industrial/godown properties, as well as carparks. It also provides financing services. The company was formerly known as Dan Form Holdings Company Limited and changed its name to Asiasec Properties Limited in June 2017. The company was incorporated in 1973 and is based in Wan chai, Hong Kong. Asiasec Properties Limited is a subsidiary of Autobest Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0287.HK": {
        "short_name": "WINFAIR INV",
        "long_name": "Winfair Investment Company Limited",
        "summary": "Winfair Investment Company Limited, together with its subsidiaries, engages in the property and share investment, property development, and securities dealing activities in Hong Kong. The company operates through Securities Investment, Property Leasing, and Property Development segments. It invests in short-term and long-term securities, as well as leases residential, commercial, and industrial properties. The company was founded in 1971 and is based in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "0298.HK": {
        "short_name": "CHUANG'S CHINA",
        "long_name": "Chuang's China Investments Limited",
        "summary": "Chuang's China Investments Limited, an investment holding company, engages in the property development, investment, and trading activities in the People's Republic of China, Hong Kong, the United Kingdom, and Malaysia. The company develops, sells, rents, and manages commercial and residential properties; and operates and manages hotels. It is also involved in the sale of goods and merchandises, including art pieces; provision of securities investment and trading services; development and construction of cemeteries and provision of related management services; and money lending activities. The company is headquartered in Central, Hong Kong. Chuang's China Investments Limited is a subsidiary of Profit Stability Investments Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0313.HK": {
        "short_name": "RICHLY FIELD",
        "long_name": "Richly Field China Development Limited",
        "summary": "Richly Field China Development Limited, an investment holding company, engages in the outlets commercial operation in the People's Republic of China. The company also develops and operates featured commercial properties, including tourism and senior care properties, and wine chateaus; and develops and manages residential properties. In addition, it is involved in the construction and maintenance, and home furnishing activities; and trading of fashion wears and accessories. The company was formerly known as Dickson Group Holdings Limited and changed its name to Richly Field China Development Limited in March 2009. Richly Field China Development Limited was incorporated in 1990 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0367.HK": {
        "short_name": "CHUANG'S INT'L",
        "long_name": "Chuang's Consortium International Limited",
        "summary": "Chuang's Consortium International Limited, an investment holding company, primarily engages in the property development, investment, and trading operations in Hong Kong, the People's Republic of China, the United Kingdom, and internationally. It owns a portfolio of investment properties comprising retail, office, residential, hotel, and industrial, as well as car parking spaces. The company is also involved in the securities investment and trading; money lending; project management; hiring of assets and trading of merchandises; and the provision of property agency, property management, and nominee and secretarial services. In addition, the company engages in the development and construction of cemetery and the provision of related management services; operation and management of hotel; and manufacture and sale of home finishing products. Further it offers watch components and merchandises. Chuang's Consortium International Limited is based in Central, Hong Kong. Chuang's Consortium International Limited operates as a subsidiary of Evergain Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0405.HK": {
        "short_name": "YUEXIU REIT",
        "long_name": "Yuexiu Real Estate Investment Trust",
        "summary": "Yuexiu Real Estate Investment Trust (Â\u0093Yuexiu REITÂ\u0094) was listed on the Hong Kong Stock Exchange of Hong Kong Limited on 21 December 2005 and is the first listed real estate investment trust only investing in properties in the People's Republic of China (the Â\u0093PRCÂ\u0094) in the world. Yuexiu REIT focuses on office, retail and other commercial purposes, strives for properties which can bring considerable cash flows and returns and identifies business opportunities for achieving higher revenue growth through the optimization of its operations. The current property portfolio comprises eight high quality properties, namely White Horse Building, Fortune Plaza, City Development Plaza, Victory Plaza, Guangzhou International Finance Center in Guangzhou, Yuexiu Tower in Shanghai, Wuhan Properties in Wuhan and Victory Business Centre in Hangzhou, with a total area of ownership of approximately 973,001 square metres. All properties are located in the central business district (Â\u0093CBDÂ\u0094) of Guangzhou, Shanghai, Wuhan and Hangzhou respectively. The categories of the properties include professional clothing market, Grade-A offices, multiple functional commercial offices, retail business, hotel and serviced apartments etc. The Manager of Yuexiu REIT is Yuexiu REIT Asset Management Limited (Â\u0093ManagerÂ\u0094). Yuexiu REIT is managed by an experienced professional team with extensive experience in real estate management, asset management and the securities market and brings long-term and steady investment incomes to the Unitholders (Â\u0093UnitholdersÂ\u0094) of Yuexiu REIT through actively managing its assets and expanding its operations. While the real estate investment trust market is flourishing, the Manager is committed to becoming a professional asset management institution with a focus on the PRC commercial property market, continuing asset appreciation capability, commercial operation capability, capital operation capability and a leading position in the industry.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wanchai"
    },
    "0435.HK": {
        "short_name": "SUNLIGHT REIT",
        "long_name": "Sunlight Real Estate Investment Trust",
        "summary": "Sunlight REIT (Stock code: 435) is a real estate investment trust authorized by the Securities and Futures Commission and constituted by the trust deed dated 26 May 2006 (as amended and supplemented by six supplemental deeds) (the Â\u0093Trust DeedÂ\u0094), and has been listed on The Stock Exchange of Hong Kong Limited on 21 December 2006. Sunlight REIT offers investors the opportunity to invest in a diversified portfolio of 11 office and five retail properties in Hong Kong with a total gross rentable area of over 1.2 million sq. ft.. The office properties are primarily located in core business areas, including Wan Chai and Sheung Wan, as well as in decentralized business areas such as Mong Kok and North Point. The key retail properties are situated in regional transportation hubs and new towns including Sheung Shui, Tseung Kwan O and Yuen Long.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0459.HK": {
        "short_name": "MIDLAND IC&I",
        "long_name": "Midland IC&I Limited",
        "summary": "Midland IC&I Limited, an investment holding company, provides property agency services for commercial and industrial properties, and shops in Hong Kong. It is also involved in the property investment, securities investment, surveying, and money lending activities; and operation of serviced apartments. In addition, the company provides treasury and management services. The company was incorporated in 2001 is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0480.HK": {
        "short_name": "HKR INT'L",
        "long_name": "HKR International Limited",
        "summary": "HKR International Limited, an investment holding company, invests in, develops, and manages real estate properties in Hong Kong, Macau, Mainland China, Japan, and South East Asia. It operates in five segments: Property Development, Property Investment, Services Provided, Hotel Operations, and Healthcare. The company primarily develops and manages residential, commercial, and industrial properties, as well as leisure projects. It also owns, operates, and manages hotels; and a healthcare service network, including chronic disease management and integrated medical centers, Chinese medicine centers, dental clinics, medical diagnostic centers, and medical network services. In addition, the company offers transportation services in Discovery Bay, including ferry, land transport, and tunnel operations; operates clubs; and invests in securities. Further, HKR International Limited provides cancer treatment and diagnostic imaging, commercial leasing agency, property agency, bus and garage, dental health and care, and project management services; corporate consultancy services to healthcare operating units; and financial services to first hand purchasers of properties in Discovery Bay, as well as trades in medical and dental equipment and supplies. Additionally, the company engages in the operation of a shipyard and road tunnel; and diabetes and endocrine disorders clinics, as well as acts as an estate manager and principal lessee of communication network in Discovery Bay. HKR International Limited was founded in 1977 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0485.HK": {
        "short_name": "CHINASINOSTAR",
        "long_name": "China Sinostar Group Company Limited",
        "summary": "China Sinostar Group Company Limited, an investment holding company, engages in the development and sale of properties in the People's Republic of China. It is also involved in the operation and management of hydroelectric power stations; and property investment and management businesses. The company was formerly known as Shihua Development Company Limited and changed its name to China Sinostar Group Company Limited in October 2016. The company was founded in 1969 and is based in Cheung Sha Wan, Hong Kong. China Sinostar Group Company Limited is a subsidiary of Achieve Prosper Capital Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Cheung Sha Wan"
    },
    "0495.HK": {
        "short_name": "PALADIN",
        "long_name": "Paladin Limited",
        "summary": "Paladin Limited, an investment holding company, engages in the property investment, and research and development of high technology system and applications in Hong Kong and Finland. The company primarily invests in and leases properties. It also engages in the development of portable x-ray imaging systems used in inspection devices for security and counter-intelligence applications in the areas of baggage scanning, border control and customs, detection of explosive devices, forensic investigation, and security at large scale sporting and other events; and dynamic range video cameras and artificial intelligences processors for machine vision applications for use in the healthcare and agricultural sectors, as well as in devices to improve driver situational awareness and security cameras. In addition, the company is involved in the development of accurate positioning and image sensing technologies to be integrated into semi-automated agricultural vehicles and advanced driver assistance systems in agricultural vehicles, and for application in marine navigation systems; and three dimensional machine vision software for three dimensional industrial cameras, artificial intelligence industrial cameras, and three dimensional vision software. Further, it engages in the development of ambient display solutions and advanced algorithm and software solutions for use in advanced driver assistance systems, collision warning systems, driver awareness systems, and advanced traffic monitoring and control systems; and linear image sensors for use in spectroscopy, document scanners, and sensors used for various security applications. The company was incorporated in 1988 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0499.HK": {
        "short_name": "QINGDAO HLDGS",
        "long_name": "Qingdao Holdings International Limited",
        "summary": "Qingdao Holdings International Limited, an investment holding company, engages in property leasing activities in Hong Kong and the People's Republic of China. It operates through three segments: Leasing of Properties, Production and Sale of Education Equipment, and Loan Financing. The Leasing of Properties segment primarily leases residential, industrial, and commercial premises. The Production and Sale of Education Equipment segment is involved in the research, development, production, and sale of digital Chinese calligraphy education equipment; and provision of learning and tutorial systems. The Loan Financing segment provides loan financing services to individual and corporate customers, as well as money lending services. The company also offers project construction services. The company was formerly known as HyComm Wireless Limited and changed its name to Qingdao Holdings International Limited in November 2014. Qingdao Holdings International Limited is headquartered in Admiralty, Hong Kong. Qingdao Holdings International Limited is a subsidiary of China Qingdao International (Holdings) Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Admiralty"
    },
    "0535.HK": {
        "short_name": "GEMDALE PPT",
        "long_name": "Gemdale Properties and Investment Corporation Limited",
        "summary": "Gemdale Properties and Investment Corporation Limited, an investment holding company, engages in the property investment, development, and management activities in Mainland China. The company operates through Property Development, Property Investment and Management, and Micro-Finance segments. It develops and sells residential and commercial properties; and invests in and manages business parks and commercial properties, as well as offers financial services to property buyers and small businesses. The company was formerly known as Frasers Property (China) Limited and changed its name to Gemdale Properties and Investment Corporation Limited in March 2013. Gemdale Properties and Investment Corporation Limited was incorporated in 1989 and is headquartered in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0593.HK": {
        "short_name": "DREAMEAST",
        "long_name": "DreamEast Group Limited",
        "summary": "DreamEast Group Limited, an investment holding company, engages in the property development and leasing, tourism park operation, and other services businesses in the People's Republic of China. It also operates cultural tourist resorts and theme parks under the DreamEast brand; and provides movie and television culture services. The company was formerly known as SkyOcean International Holdings Limited and changed its name to DreamEast Group Limited in July 2017. DreamEast Group Limited is headquartered in Causeway Bay, Hong Kong. DreamEast Group Limited is a subsidiary of SkyOcean Investment Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "0616.HK": {
        "short_name": "EMINENCE ENT",
        "long_name": "Eminence Enterprise Limited",
        "summary": "Eminence Enterprise Limited, an investment holding company, engages in the property investment and development activities in Hong Kong, the People's Republic of China, and Singapore. It operates through Property Investment, Property Development, Investment in Securities, and Loan Financing segments. The company owns and invests in residential, commercial, and industrial properties. It is also involved in investing in listed securities; and loan financing businesses. The company was formerly known as Easyknit Enterprises Holdings Limited and changed its name to Eminence Enterprise Limited in March 2016. Eminence Enterprise Limited was founded in 1981 and is based in Cheung Sha Wan, Hong Kong. As on April 21, 2021, Eminence Enterprise Limited operates as a subsidiary of Ace Winner Investment Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Cheung Sha Wan"
    },
    "0618.HK": {
        "short_name": "PKU RESOURCES",
        "long_name": "Peking University Resources (Holdings) Company Limited",
        "summary": "Peking University Resources (Holdings) Company Limited, together with its subsidiaries, distributes information products, and invests in and develops properties in Mainland China and Hong Kong. The company primarily distributes servers, printers, switches, networking products, storage devices, workstations, optical screen products, video conference hosts, conference controllers, codec, UPS power supply products, and notebook computer of various manufacturers, such as HP, H3C, CommScope, Brocade, Microsoft, Corning, Lenovo, Huawei, DELL, IBM, Netgear, CommScope, and SGi. It also acts as a distribution channel for the products of other IT companies, such as LifeSize, BARCO, CommScope, Fujitsu, Samsung, Uniview, Corning, Brocade, Librestream, Ruckus, and Impinj. In addition, the company leases and subleases, and sells properties. The company was formerly known as EC-Founder (Holdings) Company Limited and changed its name to Peking University Resources (Holdings) Company Limited in December 2013. Peking University Resources (Holdings) Company Limited is headquartered in Tsuen Wan, Hong Kong. Peking University Resources (Holdings) Company Limited is a subsidiary of Founder Information (Hong Kong) Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsuen Wan"
    },
    "0655.HK": {
        "short_name": "HK CHINESE LTD",
        "long_name": "Hongkong Chinese Limited",
        "summary": "Hongkong Chinese Limited, an investment holding company, engages in property investment and development, healthcare services, and hotel operations. Its Property Investment segment engages in the letting and resale of properties. The company's Property Development segment is involved in the development and sale of properties. Its Treasury Investment segment invests in money markets. The company's Securities Investment segment invests in securities held-for-trading. Its Other segment engages in the provision of money lending and project management services. The company also owns a motor yacht. It has operations in Hong Kong, Mainland China, Singapore, Indonesia, and internationally. The company was founded in 1992 and is based in Hong Kong, Hong Kong. Hongkong Chinese Limited is a subsidiary of Hennessy Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "0674.HK": {
        "short_name": "CHINA TANGSHANG",
        "long_name": "China Tangshang Holdings Limited",
        "summary": "China Tangshang Holdings Limited, an investment holding company, engages in exhibition-related, property sub-leasing, property development and investment, food and beverages, and financial services businesses in Hong Kong and the People's Republic of China. The company is involved in organizing various exhibition and meeting events; and sub-leasing and developing real estates, as well as leasing investment properties. It also engages in the sale of food and beverages; operates restaurants; and provision of loans to individuals and corporations. The company was formerly known as Culture Landmark Investment Limited and changed its name to China Tangshang Holdings Limited in August 2017. China Tangshang Holdings Limited is based in Tsim Sha Tsui, Hong Kong. China Tangshang Holdings Limited is a subsidiary of Grand Nice International Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "0683.HK": {
        "short_name": "KERRY PPT",
        "long_name": "Kerry Properties Limited",
        "summary": "Kerry Properties Limited, an investment holding company, engages in the development, investment, management, and trading of properties in Hong Kong, the People's Republic of China, and the Asia Pacific region. The company also owns and operates hotels; and offers logistics and freight forwarding, consultancy, administrative support, project management, financial, IT system and consultancy, estate agency, and construction services. In addition, it is involved in the warehouse operations, as well as operation of restaurants, recreation parks, and ice rinks. The company was incorporated in 1978 and is headquartered in Quarry Bay, Hong Kong. Kerry Properties Limited is a subsidiary of Kerry Group Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Quarry Bay"
    },
    "0715.HK": {
        "short_name": "CHINA OCEANWIDE",
        "long_name": "China Oceanwide Holdings Limited",
        "summary": "China Oceanwide Holdings Limited, an investment holding company, engages in property investment, real estate development, energy, and finance investment and other activities in the United States, Indonesia, the People's Republic of China, and Hong Kong. It owns and rents two office and commercial properties in Shanghai; develops real estate properties in the United States; provides management services; invests in debt and equity securities; and develops two coal-fired steam power plants with a net capacity of 150 megawatt each in the Medan industrial zone of Indonesia. The company was formerly known as Hutchison Harbour Ring Limited and changed its name to China Oceanwide Holdings Limited in December 2014. China Oceanwide Holdings Limited is headquartered in Hong Kong, Hong Kong. China Oceanwide Holdings Limited is a subsidiary of Oceanwide Holdings International Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "0754.HK": {
        "short_name": "HOPSON DEV-100",
        "long_name": "Hopson Development Holdings Limited",
        "summary": "Hopson Development Holdings Limited, an investment holding company, primarily develops residential properties in the People's Republic of China and Hong Kong. The company operates through Property Development, Commercial Properties Investment, Property Management, Infrastructure, and Investments segments. It invests in and rents properties; manages restaurants, hotels, and properties; and operates hotels. The company also provides construction, water supply, clubhouse and residential, consultancy, and architectural design services. In addition, it engages in design and renovation services; sale of properties; and decoration activities. The company was founded in 1992 and is headquartered in Central, Hong Kong. Hopson Development Holdings Limited is a subsidiary of Sounda Properties Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0755.HK": {
        "short_name": "SHANGHAI ZENDAI",
        "long_name": "Shanghai Zendai Property Limited",
        "summary": "Shanghai Zendai Property Limited, an investment holding company, invests in, develops, and sells commercial and residential properties in the People's Republic of China. It also provides properties rental, management, and agency services. In addition, the company engages in the operation of hotels. Shanghai Zendai Property Limited is headquartered in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0760.HK": {
        "short_name": "TALENT PPT GP",
        "long_name": "Talent Property Group Limited",
        "summary": "Talent Property Group Limited, an investment holding company, invests in, develops, and manages real estate properties in the People's Republic of China. It also provides cleaning services. The company was formerly known as Tomorrow International Holdings Limited and changed its name to Talent Property Group Limited in May 2011. The company was founded in 1995 and is based in Tsim Sha Tsui East, Hong Kong. Talent Property Group Limited is a subsidiary of Talent Trend Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "0808.HK": {
        "short_name": "PROSPERITY REIT",
        "long_name": "Prosperity Real Estate Investment Trust",
        "summary": "Prosperity REIT [SEHK: 808] is a Hong Kong collective investment scheme authorized under section 104 of the Securities and Futures Ordinance (Chapter 571 of the Laws of Hong Kong). Prosperity REIT owns a diverse portfolio of seven high-quality properties in the decentralized business districts of Hong Kong, comprising all, or a portion of, three Grade A office buildings, one commercial building, two industrial/office buildings and one industrial building, with a total gross rentable area of about 1.28 million sq. ft.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0813.HK": {
        "short_name": "SHIMAO GROUP",
        "long_name": "Shimao Group Holdings Limited",
        "summary": "Shimao Group Holdings Limited, an investment holding company, engages in the property development and investment activities in the People's Republic of China. The company develops residential and commercial properties; and operates hotels and shopping malls. It is also involved in the trading of construction materials; and property management activities. The company was formerly known as Shimao Property Holdings Limited and changed its name to Shimao Group Holdings Limited in May 2020. Shimao Group Holdings Limited was incorporated in 2004 and is based in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "0817.HK": {
        "short_name": "CHINA JINMAO",
        "long_name": "China Jinmao Holdings Group Limited",
        "summary": "China Jinmao Holdings Group Limited, an investment holding company, operates in real estate and hotel businesses in Mainland China. It operates in four segments: City and Property Development, Commercial Leasing and Retail Operations, Hotel Operations, and Others. The City and Property Development segment develops city complexes and properties, as well as develops land. The Commercial Leasing and Retail Operations segment engages in the leasing of office and retail commercial premises. This segment has twelve investment properties with an area of approximately 0.80 million square meters. The Hotel Operations segment provides hotel accommodation, and food and beverages services. This segment operates ten luxury hotels that offers 3,968 guest rooms. The Others segment offers property management, and design and decoration services, as well as operates an observation deck. The company also engages in technology and services business. It holds 277 projects of city operations and property development, commercial leasing and retail operations, and hotel operations. The company was formerly known as Franshion Properties (China) Limited and changed its name to China Jinmao Holdings Group Limited in September 2015. China Jinmao Holdings Group Limited was incorporated in 2004 and is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "0845.HK": {
        "short_name": "GLORIOUS PPT H",
        "long_name": "Glorious Property Holdings Limited",
        "summary": "Glorious Property Holdings Limited, an investment holding company, invests in, develops, and sells real estate properties in the People's Republic of China. It develops residential, commercial, serviced apartment, office, and hotel projects. As of December 31, 2020, the company had a total land bank of 6.6 million square meters in Shanghai region, Yangtze River Delta, Pan Bohai Rim, and Northeast China. It is also involved in the provision of corporate, culture, advertising planning, investment holding, advisory, business consulting, interior and exterior decoration, renovation, business management, property leasing, and hotel operation and property management services; and wholesale of construction materials, mechanical equipment, and building materials. The company was founded in 1996 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wanchai"
    },
    "0859.HK": {
        "short_name": "ZHONGCHANG INTL",
        "long_name": "Zhongchang International Holdings Group Limited",
        "summary": "Zhongchang International Holdings Group Limited, an investment holding company, engages in property investment, leasing, and development activities in Hong Kong and the People's Republic of China. The company operates through Property Investment, Property Development, and Property Project Management Services segments. The company is also involved in the investment, development, and construction of ocean engineering and real estates; investment and development of tourism project; provision of real estate agent services; consultation of information services; and property management activities. In addition, it engages in construction works; and provision of real estate intermediate services. Further, the company provides family services. The company was formerly known as Henry Group Holdings Limited and changed its name to Zhongchang International Holdings Group Limited in May 2018. Zhongchang International Holdings Group Limited was incorporated in 1999 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "0865.HK": {
        "short_name": "JIANDE INT'L",
        "long_name": "Jiande International Holdings Limited",
        "summary": "Jiande International Holdings Limited, an investment holding company, engages in the development and sale of properties in the People's Republic of China. It also provides building management services. The company is headquartered in North Point, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "North Point"
    },
    "0878.HK": {
        "short_name": "SOUNDWILL HOLD",
        "long_name": "Soundwill Holdings Limited",
        "summary": "Soundwill Holdings Limited, an investment holding company, provides property development, property leasing, and building management services in the People's Republic of China. The company develops medium to high end commercial and residential, as well as industrial properties; and offers building management, repair and maintenance services to large-scale commercial buildings, and small and medium sized residential estates. It also invests in and leases commercial, office, and residential buildings, as well as advertising and mini-storage spaces; and provides property assembly and sales services. The company was founded in 1978 and is headquartered in Causeway Bay, Hong Kong. Soundwill Holdings Limited is a subsidiary of Ko Bee Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "0898.HK": {
        "short_name": "MULTIFIELD INTL",
        "long_name": "Multifield International Holdings Limited",
        "summary": "Multifield International Holdings Limited, an investment holding company, engages in the investment, development, management, rental, and sale of real estate properties in Hong Kong and Mainland China. It operates through three segments: Property Investment, Provision of Serviced Apartment and Property Management Services, and Trading and Investment. The company owns various properties, including office and industrial buildings, retail shops, and car parks, as well as residential complexes, such as hotel-serviced villas and apartments under the Windsor Renaissance name. It is also involved in the provision of property agency, administration, and consultant services; and securities investment and trading activities. The company was founded in 1988 and is headquartered in Wong Chuk Hang, Hong Kong. Multifield International Holdings Limited is a subsidiary of Lucky Speculator Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wong Chuk Hang"
    },
    "0910.HK": {
        "short_name": "CHINA SANDI",
        "long_name": "China Sandi Holdings Limited",
        "summary": "China Sandi Holdings Limited, an investment holding company, engages in the investment and development of properties in the People's Republic of China. The company operates in Property Development, Property Investment, and Hotel Operation segments. It is also involved in the leasing of investment properties and providing property management services. In addition, the company provides hotel accommodation and catering services. Further, it engages in the securities trading. It owns and leases shopping malls, hotels, office units, commercial units, kindergartens, and car parking facilities. The Company was formerly known as China Grand Forestry Green Resources Group Limited and changed its name to China Sandi Holdings Limited in October 2012. China Sandi Holdings Limited is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "0983.HK": {
        "short_name": "SOCAM DEV",
        "long_name": "SOCAM Development Limited",
        "summary": "SOCAM Development Limited, an investment holding company, engages in the property and construction businesses in the People's Republic of China and Hong Kong. It operates through Property, Construction and Building Maintenance, and Other Businesses segments. It undertakes the construction of public housings, offices/SOHO, and retail facilities, as well as commercial, residential, and institutional buildings. The company is involved in property, investment, development, and management activities; and interior fitting out, and building renovation and premise maintenance activities. In addition, it provides venture capital investment, design and contracting, management, and consultancy services, as well as structural steel construction works; and owns and leases plants and machineries. The company was formerly known as Shui On Construction and Materials Limited and changed its name to SOCAM Development Limited in September 2011. SOCAM Development Limited is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "1036.HK": {
        "short_name": "VANKE OVERSEAS",
        "long_name": "Vanke Overseas Investment Holding Company Limited",
        "summary": "Vanke Overseas Investment Holding Company Limited, an investment holding company, invests in, develops, finances, rents, and manages real estate properties in Hong Kong, the United Kingdom, and the United States. It also provides administrative, asset management, property redevelopment, and investment advisory services. The company was formerly known as Vanke Property (Overseas) Limited and changed its name to Vanke Overseas Investment Holding Company Limited in December 2019. The company is headquartered in Central, Hong Kong. Vanke Overseas Investment Holding Company Limited is a subsidiary of China Vanke Co., Ltd.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "1125.HK": {
        "short_name": "LAI FUNG HOLD",
        "long_name": "Lai Fung Holdings Limited",
        "summary": "Lai Fung Holdings Limited, an investment holding company, engages in the property development and investment businesses in Mainland China. It operates through four segments: The Property Development, The Property Investment, The Hotel and Serviced Apartment Operation, and The Theme Park Operation. The company invests in and develops hotels and serviced apartments, as well as residential, office, and commercial properties; and invests in, develops, and operates cultural, leisure, and entertainment and related facilities. It is also involved in the property and building management business. In addition, the company operates theme parks. The company was incorporated in 1997 and is headquartered in Central, Hong Kong. Lai Fung Holdings Limited is a subsidiary of Lai Sun Development Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "1168.HK": {
        "short_name": "SINOLINK HOLD",
        "long_name": "Sinolink Worldwide Holdings Limited",
        "summary": "Sinolink Worldwide Holdings Limited, an investment holding company, invests in, develops, manages, and sells real estate properties in the People's Republic of China. It operates in four segments: Property Development, Property Management, Property Investment, and Financing Services. The company develops and sells residential properties; and invests in commercial and car parking properties. It also provides property, facilities, and project management services; finance leasing and loan financing, business factoring, administrative service supporting, and insurance services; and consultancy services in relation to information, multimedia, and communication technologies. In addition, the company engages in hotel operations. Sinolink Worldwide Holdings Limited was founded in 1992 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "1176.HK": {
        "short_name": "ZHUGUANG HOLD",
        "long_name": "Zhuguang Holdings Group Company Limited",
        "summary": "Zhuguang Holdings Group Company Limited, an investment holding company, engages in the development, investment, management, sale, and rental of properties in the People's Republic of China. It operates through three segments: Property Development, Property Investment, and Project Management Services. The company holds interest in a portfolio of property development projects in Hebei and Guangdong provinces. It also provides property trading, construction and management, and other property development related services. The company was incorporated in 1996 and is based in Central, Hong Kong. Zhuguang Holdings Group Company Limited is a subsidiary of Rong De Investments Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "1195.HK": {
        "short_name": "KINGWELL GROUP",
        "long_name": "Kingwell Group Limited",
        "summary": "Kingwell Group Limited, an investment holding company, engages in the property development, property leasing, and property management services business in Mainland China. The company is involved in the development of villas, apartments, and commercial buildings; property leasing of self-owned properties; sale of carpark spaces; and provision of property management services and construction services. It also owns and operates a mining project with an aggregate mining area of approximately 309.3 square kilometers located in Zeyskiy region, Russia. The company was formerly known as Sinotronics Holdings Limited and changed its name to Kingwell Group Limited in 2010. Kingwell Group Limited was founded in 1996 and is headquartered in Tsim Sha Tsui East, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "1200.HK": {
        "short_name": "MIDLAND HOLDING",
        "long_name": "Midland Holdings Limited",
        "summary": "Midland Holdings Limited, an investment holding company, provides property agency services in the Hong Kong, Macau, and the People's Republic of China. The company offers residential property agency services; and money lending, project planning, commercial property management, and marketing and sales planning services, as well as surveying, leasing, and property management services. It also provides immigration consultancy services; surveying consultancy services, including valuation advisory, development study, sales, marketing, tender, and auction for projects; and operates internet website. In addition, the company offers property investment services; and overseas property projects' marketing and referral services in Hong Kong. Midland Holdings Limited was founded in 1973 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "1201.HK": {
        "short_name": "TESSON HOLDINGS",
        "long_name": "Tesson Holdings Limited",
        "summary": "Tesson Holdings Limited, an investment holding company, engages in the lithium-ion motive battery business in the People's Republic of China. It operates through Lithium Ion Motive Battery Business, and Property and Cultural Business. The company manufactures, sells, and trades in lithium-ion motive batteries, lithium-ion battery modules, battery charging devices, and battery material machines and production lines. It also provides new energy solutions and related equipment, such as electric passenger car power battery, electric logistics vehicle power battery, electric passenger car power battery, electric tool power battery, garden tool power battery, industrial energy storage, and home energy storage systems for the use in new energy vehicles, energy storage, aerospace, military equipment, electric motorcycle and special vehicle, and electric equipment applications. In addition, the company is involved in the sale of equipment; import and export trading activities; and operation of research and development center. Further, it engages in the planning and organization of cultural events, performance creativity and execution, creation and shooting of documentary film and TV works, museum creative planning, design and construction, execution of the combination of cultural, business, and tourism, etc., as well as event production and themed museums, and architectural design and engineering businesses; property holding activities; and property development activities comprising industrial residential projects. The company was formerly known as Kith Holdings Limited and changed its name to Tesson Holdings Limited in June 2015. Tesson Holdings Limited was founded in 1982 and is headquartered in Tsim Sha Tsui, Hong Kong. Tesson Holdings Limited is a subsidiary of Double Key International Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "1218.HK": {
        "short_name": "EASYKNIT INT'L",
        "long_name": "Easyknit International Holdings Limited",
        "summary": "Easyknit International Holdings Limited, an investment holding company, engages in the investment, development, and management of properties in Hong Kong. The company operates through Property Investment, Property Development, Investment in Securities, and Loan Financing segments. Its investment properties primarily include residential, commercial, industrial, and retail properties. The company is also involved in securities investment and loan financing businesses. Easyknit International Holdings Limited was founded in 1981 and is based in Cheung Sha Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Cheung Sha Wan"
    },
    "1222.HK": {
        "short_name": "WANG ON GROUP",
        "long_name": "Wang On Group Limited",
        "summary": "Wang On Group Limited, an investment holding company, primarily engages in the property development and investment activities in Hong Kong, Mainland China, Macau, and internationally. It operates through five segments: Property Development, Property Investment, Fresh Markets, Pharmaceutical, and Treasury Management. The company invests in industrial and commercial premises, and residential units for rental or for sale; and invests in debt and other securities. It is also involved in the management and sub-licensing of fresh markets; butchery business, which includes management and sale of properties in agricultural produce exchange markets; and production and sale of Chinese and Western pharmaceutical, health food, and personal care products under the Wai Yuen Tong and Madame Pearl's brand names. In addition, the company provides financial services, such as mortgages and personal loans; management services; and sells fresh pork. The company was founded in 1987 and is headquartered in Kowloon Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon Bay"
    },
    "1240.HK": {
        "short_name": "CNQC INT'L",
        "long_name": "CNQC International Holdings Limited",
        "summary": "CNQC International Holdings Limited, an investment holding company, operates as a property developer and contractor. It operates through four segments: Foundation and construction Â\u0097 Hong Kong and Macau; Property development Â\u0097 Hong Kong; Construction Â\u0097 Singapore and Southeast Asia; and Property development - Singapore and Southeast Asia. The company primarily engages in the development and sale of executive condominiums and condominiums in the outside Central Region of Singapore; and the provision of construction services as main contractor for governmental authorities and private property developers. It also undertakes foundation works; and provides ancillary services with specialization in piling works, as well as superstructure construction services in Hong Kong and Macau. In addition, the company undertakes construction projects in Singapore and other Southeast Asia, Hong Kong, and Macau. Further, it is involved in the rental of machinery and construction equipment; general wholesale trade business; and provision of general contracting, and building and civil engineering services. The company is based in Kowloon Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon Bay"
    },
    "1243.HK": {
        "short_name": "WANG ON PPT",
        "long_name": "Wang On Properties Limited",
        "summary": "Wang On Properties Limited, an investment holding company, invests in, develops, and sells residential and commercial properties in Hong Kong. It operates in two segments, Property Development and Property Investment. The company engages in the acquisition of land to develop property, as well as the acquisition of existing buildings to be demolished and rebuilt into new property; and acquires of ready-made property for long-term investments. It also engages in the investment of car parking spaces; rental or sale of commercial and industrial premises; and provision of management, securities investment, and financial services. The company was founded in 1987 and is headquartered in Kowloon Bay, Hong Kong. Wang On Properties Limited is a subsidiary of Earnest Spot Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon Bay"
    },
    "1246.HK": {
        "short_name": "BOILLHEALTHCARE",
        "long_name": "Boill Healthcare Holdings Limited",
        "summary": "Boill Healthcare Holdings Limited, an investment holding company, undertakes contracts for foundation piling in Hong Kong and Mainland China. It operates through Property Development, Healthcare Holiday Resort Development and Operation, Foundation Piling, and Securities Investment segments. The company also develops and sells properties, as well as provides property management services. In addition, it trades and invests in securities; and provides elderly home care, healthcare, and leisure services. The company was formerly known as Ngai Shun Holdings Limited and changed its name to Boill Healthcare Holdings Limited in September 2017. Boill Healthcare Holdings Limited is headquartered in Sheung Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Sheung Wan"
    },
    "1383.HK": {
        "short_name": "SUNCITY GROUP",
        "long_name": "Suncity Group Holdings Limited",
        "summary": "Suncity Group Holdings Limited, an investment holding company, engages in property development, leasing, and management business in the People's Republic of China, Macau, Hong Kong, Japan, Cambodia, Vietnam, the Philippines, and Turkey. It operates through Property Development; Property Leasing; Hotel and Integrated Resort General Consultancy Services; Travel Related Products and Services; and Others segments. The company develops and sells office premises, and residential and retail properties. It also provides management and consultancy services to hotels and integrated resorts; and transportation and travel agency services, as well as travel related products. The company was formerly known as Sun Century Group Limited and changed its name to Suncity Group Holdings Limited in May 2017. The company is based in Shenzhen, the People's Republic of China. Suncity Group Holdings Limited is a subsidiary of Fame Select Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "1387.HK": {
        "short_name": "CHINA DILI",
        "long_name": "China Dili Group",
        "summary": "China Dili Group, an investment holding company, engages in the operation of agriculture wholesale markets in the People's Republic of China. It leases and manages agriculture wholesale market. The company operates 10 wholesale markets in Harbin, Shenyang, Shouguang, Guiyang, Qiqihar, Mudanjiang, and Hangzhou. The company was formerly known as Renhe Commercial Holdings Company Limited and changed its name to China Dili Group in June 2019. China Dili Group was founded in 2002 and is based in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "1560.HK": {
        "short_name": "STAR PROPERTIES",
        "long_name": "Star Properties Group (Cayman Islands) Limited",
        "summary": "Star Properties Group (Cayman Islands) Limited, an investment holding company, engages in the property development and investment activities in Hong Kong. It also provides property management; and financing services to the property buyers. The company was incorporated in 2016 and is headquartered in Kwun Tong, Hong Kong. Star Properties Group (Cayman Islands) Limited is a subsidiary of Star Properties Holdings (BVI) Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "1821.HK": {
        "short_name": "ESR",
        "long_name": "ESR Cayman Limited",
        "summary": "ESR Cayman Limited, together with its subsidiaries, engages in the logistics real estate development, leasing, and management activities in the Public's Republic of China, Japan, South Korea, Singapore, Australia, and India. It operates through three segments: Investment, Fund Management, and Development. The company develops, constructs, invests in, and sells logistics real estate properties. It is also involved in the fund management business. In addition, the company invests in properties, co-investments funds and investment vehicles, public REIT, and other investments. It serves e-commerce companies, 3PL providers, bricks-and-mortar retailers, manufacturers, cold-chain logistics providers, and other enterprises in various industries comprising electronics, fast-moving consumer goods, retail, food and beverage, general logistics services, auto and parts, pharmaceuticals, medical instruments, and machinery. The company was incorporated in 2011 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "1881.HK": {
        "short_name": "REGAL REIT",
        "long_name": "Regal Real Estate Investment Trust",
        "summary": "Regal REIT is a Hong Kong collective investment scheme authorised under section 104 of the Securities and Futures Ordinance (Chapter 571 of the Laws of Hong Kong) and its Units were listed on The Stock Exchange of Hong Kong Limited on 30th March, 2007. Regal REIT is governed by a trust deed dated 11th December, 2006 (as amended by the first supplemental trust deed dated 2nd March, 2007, the second supplemental trust deed dated 15th May, 2008, the third supplemental trust deed dated 8th May, 2009, the fourth supplemental trust deed dated 23rd July, 2010, the fifth supplemental trust deed dated 3rd May, 2011, the sixth supplemental trust deed dated 21st July, 2011 and the seventh supplemental trust deed dated 14th April, 2015) constituting Regal REIT (the Â\u0093Trust DeedÂ\u0094) and the REIT Code. The principal activity of Regal REIT and its subsidiaries (collectively, the Â\u0093GroupÂ\u0094) is to own and invest in income-producing hotels, serviced apartments or commercial properties (including office premises) with the objectives of producing stable and growing distributions to Unitholders and to achieve long-term growth in the net asset value per Unit.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "REIT - Hotel & Motel",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "1972.HK": {
        "short_name": "SWIREPROPERTIES",
        "long_name": "Swire Properties Limited",
        "summary": "Swire Properties Limited, together with its subsidiaries, develops, owns, and operates mixed-use, primarily commercial properties in Hong Kong, Mainland China, the United States, and internationally. It operates through three segments: Property Investment, Property Trading, and Hotels. The company is involved in the development, leasing, and management of commercial, retail, and residential properties; development, construction, and sale of residential apartments; and operation of hotels. It also provides financial and real estate agency services. The company was incorporated in 1972 and is based in Hong Kong, Hong Kong. Swire Properties Limited is a subsidiary of Swire Pacific Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "1997.HK": {
        "short_name": "WHARF REIC",
        "long_name": "Wharf Real Estate Investment Company Limited",
        "summary": "Wharf Real Estate Investment Company Limited, an investment holding company, invests in, develops, constructs, owns, operates, trades in, and sells real estate properties in Hong Kong, Mainland China, and Singapore. The company operates through Investment Property, Development Property, Hotels, and Investment segments. It primarily operates Harbour City, a commercial space comprising offices, retail shops, serviced apartments, hotels and club, and car parking spaces; and Times Square, a retail space that consists of office and car parking spaces. The company also operates Wheelock House and Crawford House commercial properties; The Murray, a luxury hotel that consists of 336 rooms; Plaza Hollywood, a shopping mall with retail outlets, restaurants, and a stadium housing six-screen cinema multiplex; The Star Ferry, which provides a ferry service between Tsim Sha Tsui and Wan Chai; and Wheelock Place and Scotts Square mall. In addition, it offers leasing, finance, and management services; and accepts bank deposits. Wharf Real Estate Investment Company Limited was incorporated in 2017 and is headquartered in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "1J9.F": {
        "short_name": "JIAYUAN INT.GRP.LTD ,-01",
        "long_name": "Jiayuan International Group Limited",
        "summary": "Jiayuan International Group Limited, an investment holding company, invests in, develops, and manages residential and commercial properties in the People's Republic of China. It also offers industrial park management and enterprise management consulting services. The company was formerly known as Jiayuan International Holdings Limited and changed its name to Jiayuan International Group Limited. Jiayuan International Group Limited was founded in 2003 and is headquartered in Central, Hong Kong. Jiayuan International Group Limited is a subsidiary of Mingyuan Group Investment Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "2183.HK": {
        "short_name": "SANSHENG HLDG",
        "long_name": "Sansheng Holdings (Group) Co. Ltd.",
        "summary": "Sansheng Holdings (Group) Co. Ltd., an investment holding company, engages in the investment, development, and sale of properties in the People's Republic of China. Its properties are used for commercial, residential, and office use. The company was formerly known as Lifestyle Properties Development Limited and changed its name to Sansheng Holdings (Group) Co. Ltd. in August 2017. The company was founded in 1988 and is headquartered in Tsim Sha Tsui, Hong Kong. Sansheng Holdings (Group) Co. Ltd. is a subsidiary of Mega Regal Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "2288.HK": {
        "short_name": "RYKADAN CAPITAL",
        "long_name": "Rykadan Capital Limited",
        "summary": "Rykadan Capital Limited, an investment holding company, engages in the property investment and development business in Hong Kong, the People's Republic of China, the United States, and internationally. The company develops and holds residential, commercial, and industrial properties; and leases premises. It also distributes construction and interior decorative materials, such as quartz and marble-based engineered stone composite surface products. In addition, it provides asset, investment, and fund management services; and project, property, and corporate management services. The company was formerly known as Sundart International Holdings Limited and changed its name to Rykadan Capital Limited in September 2012. Rykadan Capital Limited was founded in 1986 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "2292.HK": {
        "short_name": "THING ON ENT",
        "long_name": "Thing On Enterprise Limited",
        "summary": "Thing On Enterprise Limited, an investment holding company, engages in the property investment and management business in Hong Kong. The company primarily rents office, retail, and industrial properties. As of December 31, 2020, it had 38 properties with an aggregate saleable area of approximately 59,887 square feet. The company was founded in 1990 and is headquartered in Wan Chai, Hong Kong. Thing On Enterprise Limited is a subsidiary of Thing On Group Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "2330.HK": {
        "short_name": "CHINA UPTOWN",
        "long_name": "China Uptown Group Company Limited",
        "summary": "China Uptown Group Company Limited, an investment holding company, invests in and develops real estate properties in the People's Republic of China. The company develops residential and commercial properties. It also trades in raw cane sugar; and provides management services. China Uptown Group Company Limited is headquartered in Tsimshatsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "2340.HK": {
        "short_name": "SYNERGIS HOLD",
        "long_name": "Synergis Holdings Limited",
        "summary": "Synergis Holdings Limited, an investment holding company, engages in property and facility management, interiors and special projects, and ancillary businesses in Hong Kong, China, and Macau. The company provides property and facility management services to government, corporate clients, public institutions, and private clients. It manages a portfolio of approximately 82,000 residential units and 7.6 million square meters of residential, commercial, and industrial facilities. The company also provides asset management services, such as feasibility study, market positioning, tenancy and financial management, operation management, marketing and promotion, sales and leasing, advertising, etc. In addition, it offers corporate real estate services; capital markets advisory, investment advisory, and lifestyle services; other supporting services comprising security guarding and consultancy services, as well as security systems and maintenance/repair; gardening, pest control, building exterior cleaning, carpet cleaning, and marble repair and maintenance services; cleaning services; project management, architectural design, slope inspection services, etc.; and laundry services. Further, the company provides car park management services; fitting-out, renovation and addition, and alteration works; curtain walling, cladding, and related products; procurement and supply chain services, and trading services; repair and maintenance services for equipment; indoor cleaning services; and property agency services, as well as operates as a licensed, a registered general building, and a registered specialist contractor. The company was founded in 1978 and is headquartered in Kwun Tong, Hong Kong. Synergis Holdings Limited is a subsidiary of Champ Key Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "2768.HK": {
        "short_name": "JIAYUAN INTL",
        "long_name": "Jiayuan International Group Limited",
        "summary": "Jiayuan International Group Limited, an investment holding company, invests in, develops, and manages residential and commercial properties in the People's Republic of China. It also offers industrial park management and enterprise management consulting services. The company was formerly known as Jiayuan International Holdings Limited and changed its name to Jiayuan International Group Limited. Jiayuan International Group Limited was founded in 2003 and is headquartered in Central, Hong Kong. Jiayuan International Group Limited is a subsidiary of Mingyuan Group Investment Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "3F5.F": {
        "short_name": "CHINA JINMAO HLDGS GR.LTD",
        "long_name": "China Jinmao Holdings Group Limited",
        "summary": "China Jinmao Holdings Group Limited, an investment holding company, operates in real estate and hotel businesses in Mainland China. It operates in four segments: City and Property Development, Commercial Leasing and Retail Operations, Hotel Operations, and Others. The City and Property Development segment develops city complexes and properties, as well as develops land. The Commercial Leasing and Retail Operations segment engages in the leasing of office and retail commercial premises. This segment has twelve investment properties with an area of approximately 0.80 million square meters. The Hotel Operations segment provides hotel accommodation, and food and beverages services. This segment operates ten luxury hotels that offers 3,968 guest rooms. The Others segment offers property management, and design and decoration services, as well as operates an observation deck. The company also engages in technology and services business. It holds 277 projects of city operations and property development, commercial leasing and retail operations, and hotel operations. The company was formerly known as Franshion Properties (China) Limited and changed its name to China Jinmao Holdings Group Limited in September 2015. China Jinmao Holdings Group Limited was incorporated in 2004 and is based in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "4WF.F": {
        "short_name": "WHARF REAL ESTATE INV.",
        "long_name": "Wharf Real Estate Investment Company Limited",
        "summary": "Wharf Real Estate Investment Company Limited, an investment holding company, invests in, develops, constructs, owns, operates, trades in, and sells real estate properties in Hong Kong, Mainland China, and Singapore. The company operates through Investment Property, Development Property, Hotels, and Investment segments. It primarily operates Harbour City, a commercial space comprising offices, retail shops, serviced apartments, hotels and club, and car parking spaces; and Times Square, a retail space that consists of office and car parking spaces. The company also operates Wheelock House and Crawford House commercial properties; The Murray, a luxury hotel that consists of 336 rooms; Plaza Hollywood, a shopping mall with retail outlets, restaurants, and a stadium housing six-screen cinema multiplex; The Star Ferry, which provides a ferry service between Tsim Sha Tsui and Wan Chai; and Wheelock Place and Scotts Square mall. In addition, it offers leasing, finance, and management services; and accepts bank deposits. Wharf Real Estate Investment Company Limited was incorporated in 2017 and is headquartered in Kowloon, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "8271.HK": {
        "short_name": "GDC",
        "long_name": "Global Digital Creations Holdings Limited",
        "summary": "Global Digital Creations Holdings Limited, an investment holding company, engages in the computer graphic (CG) creation and production, and property leasing and building management services in the People's Republic of China and Hong Kong. The CG Creation and Production segment is involved in the production of television series, movies, and animated films; digital virtual human; and box office receipts. This segment also holds copyrights of original animated films and animated television series. The New Cultural Space provides property leasing and building management services. The company also provides administration and management services; invests in animation business; and develops multimedia software and hardware, as well as offers related technical consultancy services. Global Digital Creations Holdings Limited was founded in 2000 and is headquartered in North Point, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "North Point"
    },
    "87001.HK": {
        "short_name": "HUI XIAN REIT",
        "long_name": "Hui Xian Real Estate Investment Trust",
        "summary": "Hui Xian Real Estate Investment Trust (\"Hui Xian REIT\") is a Hong Kong collective investment scheme authorised under section 104 of the Securities and Futures Ordinance (Chapter 571 of the Laws of Hong Kong). Hui Xian REIT was established on 1 April 2011 and had not carried on any operation prior to 29 April 2011 (date of listing), and its units were listed on The Stock Exchange of Hong Kong Limited (the \"HKSE\") since that date. Hui Xian REIT is governed by the Deed of Trust constituting Hui Xian REIT dated 1 April 2011 as amended by four supplemental deeds dated 24 May 2013, 16 May 2014, 28 May 2015 and 19 May 2017 (the \"Trust Deed\") made between Hui Xian Asset Management Limited (the \"Manager\") and DB Trustees (Hong Kong) Limited (the \"Trustee\"), and the Code on Real Estate Investment Trusts (the \"REIT Code\") issued by the Securities and Futures Commission (the \"SFC\"). The principal activity of Hui Xian REIT and its controlled entities (the \"Group\") is to own and invest in high quality commercial properties with the objective of producing stable and sustainable distributions to unitholders and to achieve long term growth in the net asset value per unit.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "8G7.F": {
        "short_name": "LANDSEA GREEN PPTYS CONS.",
        "long_name": "Landsea Green Properties Co., Ltd.",
        "summary": "Landsea Green Properties Co., Ltd., an investment holding company, develops and sells properties in Mainland China and the United States. The company operates through Property Development and Sales in Mainland China, Property Development and Sales in the US, Management Services, and Office Property Investment segments. It is also involved in the property leasing, decoration and design, marketing, and financial and elderly care services businesses. The company was formerly known as Landsea Green Group Co., Ltd. and changed its name to Landsea Green Properties Co., Ltd. in November 2019. The company was founded in 2001 and is headquartered in Central, Hong Kong. Landsea Green Properties Co., Ltd. is a subsidiary of Greensheid Corporation.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "AOP.F": {
        "short_name": "HANG LUNG P.",
        "long_name": "Hang Lung Properties Limited",
        "summary": "Hang Lung Properties Limited, an investment holding company, engages in the property investment, development, and management activities in Hong Kong and Mainland China. The company operates through Property Leasing and Property Sales segments. The company is involved in the property leasing business; and development and sale of properties. Its investment properties portfolio includes shopping malls, office, residential, serviced apartment, hotel, and car parking properties, as well as industrial premises. The company also engages in the apartment operating and management; car parking and project management; and property agency activities. In addition, it provides management and financial services. The company was incorporated in 1949 and is headquartered in Central, Hong Kong. Hang Lung Properties Limited is a subsidiary of Hang Lung Group Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "CAOVF": {
        "short_name": "CHINA OVERSEAS LAND & INVESTMNT",
        "long_name": "China Overseas Land & Investment Limited",
        "summary": "China Overseas Land & Investment Limited, an investment holding company, engages in the property development and investment, and other operations. It operates through Property Development, Property Investment, and Other Operations segments. The company is involved in the investment, development, and rental of residential and commercial properties; issuance of guaranteed notes; property consultancy and real estate agency; and loan financing, security investment, and hotel management activities. It also provides construction and building design consultancy services; and operates serviced apartments. The company primarily operates in Hong Kong, Macau, Guangzhou, Shenzhen, Shanghai, Beijing, Tianjin, Jinan, Nanjing, Suzhou, Chengdu, Shenyang, and other regions in Mainland China. The company was founded in 1979 and is based in Central, Hong Kong. China Overseas Land & Investment Limited is a subsidiary of China Overseas Holdings Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "CAOVY": {
        "short_name": "CHINA OVERSEAS LAND & INVESTMNT",
        "long_name": "China Overseas Land & Investment Limited",
        "summary": "China Overseas Land & Investment Limited, an investment holding company, engages in the property development and investment, and treasury operations. It operates through Property Development, Property Investment, and Other Operations segments. The company is involved in the investment, development, and rental of residential and commercial properties; issuance of guaranteed notes; property consultancy and real estate agency; and loan financing, security investment, and hotel management activities. It also provides commercial project; and construction and building design consultancy services; and operates serviced apartments. The company primarily operates in Hong Kong, Macau, Guangzhou, Shenzhen, Shanghai, Beijing, Tianjin, Jinan, Nanjing, Suzhou, Chengdu, Shenyang, and other regions in Mainland China. The company was founded in 1979 and is based in Central, Hong Kong. China Overseas Land & Investment Limited is a subsidiary of China Overseas Holdings Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "CAQ.AX": {
        "short_name": "CAQHOLDLTD FPO",
        "long_name": "CAQ Holdings Limited",
        "summary": "CAQ Holdings Limited, together with its subsidiaries, engages in the property development and jewelry trading activities in Mainland China. The company is involved in the construction and leasing of the Haikou project, a shopping center constructed in a free trade zone consisting of multi-storey buildings, including factories, warehouses, a commercial/administration building, and a retail complex located in Hainan Island, China. It also processes, exhibits, and sells diamonds, jewelry, and other commodities through physical stores under the Zuanxihui brand name in Haikou Meilan duty-free mall and Haikou Mova outlet, as well as through an online e-commerce platform. CAQ Holdings Limited was incorporated in 2000 and is based in Wan Chai, Hong Kong.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "CESTF": {
        "short_name": "CHINESE ESTATES",
        "long_name": "Chinese Estates Holdings Limited",
        "summary": "Chinese Estates Group (the \"Group\") is one of the leading property developers in Hong Kong. Chinese Estates Holdings Limited is the holding company of the Group and it is publicly listed on The Stock Exchange of Hong Kong Limited with stock code: 127. Chinese Estates' core businesses comprise of property investment for rental and property development for sale. The Group focuses primarily in Hong Kong, and diversifies its property interests to mainland China and the United Kingdom. The Group's investment properties include retail and office assets. Most of the investment properties of Chinese Estates are highly accessible and strategically located in prime commercial areas in Hong Kong such as Causeway Bay and Wanchai. In mainland China, Chinese Estates owns a five-star international hotel in Beijing. In the United Kingdom, Chinese Estates owns four investment properties in London. Over the past twenty years, Chinese Estates has built a reputation for conceptualising and implementing redevelopment, renovation works and repackaging programmes to enhance the value and revenue of its investment properties. Chinese Estates specializes in developing mid to high-end commercial and residential property projects. A number of quality and cosmopolitan residential properties are developed for sale.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Wanchai"
    },
    "CGR.F": {
        "short_name": "COASTAL GREENLAND  HD-,10",
        "long_name": "Coastal Greenland Limited",
        "summary": "Coastal Greenland Limited, an investment holding company, primarily invests in, develops, and sells properties in the People's Republic of China. The company operates through Property Development, Property Investment, Project Management, and Project Investment Services segments. It also invests in and rents commercial and residential properties; and provides loan financing and management services, as well as invests in land development projects; and offers asset management services. The company was founded in 1990 and is based in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "CHKGF": {
        "short_name": "CK ASSET HOLDINGS LTD",
        "long_name": "CK Asset Holdings Limited",
        "summary": "CK Asset Holdings Limited operates as a property developer in Hong Kong, the Mainland, Singapore, the United Kingdom, continental Europe, Australia, Canada, and the United States. The company is involved in the leasing of office, industrial, retail, and other properties; residential property investment and development; and pub, and hotel and serviced suite operations. It also provides property and project management, aircraft leasing, investment in infrastructure and utility asset operation, finance, and property agency services. The company was formerly known as Cheung Kong Property Holdings Limited and changed its name to CK Asset Holdings Limited in September 2017. CK Asset Holdings Limited was incorporated in 2015 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "CHZ.F": {
        "short_name": "CHIN.RES.LA.  HD-,10",
        "long_name": "China Resources Land Limited",
        "summary": "China Resources Land Limited, an investment holding company, invests, develops, manages, and sells properties in the People's Republic of China. It invests in commercial, office, hotel, and apartment properties. As of December 31, 2020, the company had land bank of 68.087 million square meters. It also operates hotels; offers construction, decoration, and other property development related services; and manufactures and sells furniture. The company was incorporated in 1996 and is headquartered in Wanchai, Hong Kong. China Resources Land Limited is a subsidiary of CRH (Land) Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "CL1A.F": {
        "short_name": "WANDA HOTEL DEVEL. CO.",
        "long_name": "Wanda Hotel Development Company Limited",
        "summary": "Wanda Hotel Development Company Limited, an investment holding company, engages in the property development, investment, leasing, and management activities in the People's Republic of China. The company operates through three segments: Hotel Operation and Management Services, Hotel Design and Construction Management Services, and Investment Properties Leasing. It develops, leases, and sells commercial and residential properties. The company also engages in the design, development, construction, operation, and management of hotels, as well as provides construction consulting services; and sells goods. As of 31 December 2020, it manages, leases, operates, and franchises 94 hotels that consists of 25,473 rooms under the Wanda Reign, Wanda Vista, Wanda Realm, Wanda Jin, Wanda Yi, Wanda Moments, and Wanda Yue brands in the People's Republic of China. The company was formerly known as Wanda Commercial Properties (Group) Co., Limited and changed its name to Wanda Hotel Development Company Limited in October 2014. The company is based in Central, Hong Kong. Wanda Hotel Development Company Limited is a subsidiary of Wanda Commercial Properties Overseas Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "CL7.F": {
        "short_name": "HUA YIN INTL HLDGS LTD",
        "long_name": "Hua Yin International Holdings Limited",
        "summary": "Hua Yin International Holdings Limited, an investment holding company, engages in the property development and management business in the People's Republic of China. It operates through Property Development and Management, and Property Investment segments. The Property Development and Management segment develops properties; and provides management services, including planning, design, budgeting, licensing, contract tendering, and contract administration for the development of properties. The Property Investment segment holds properties for long term investment and leasing purposes, such as shopping mall units. It is also involved in real estate rental management; and tourism development and management business. The company was formerly known as Ground International Development Limited and changed its name to Hua Yin International Holdings Limited in March 2021. Hua Yin International Holdings Limited was founded in 1990 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "CMJ.F": {
        "short_name": "POLY PPTY GR.CO.LTD.",
        "long_name": "Poly Property Group Co., Limited",
        "summary": "Poly Property Group Co., Limited, an investment holding company, engages in the property development, investment, and management activities in Hong Kong and the People's Republic of China. The company operates in four segments: Property Development, Property Investment and Management, Hotel Operations, and Other Operations. It is involved in the development of residential and commercial properties; and hotel and restaurant business, as well as provision of related services. The company also provides financial, management, asset management, property agency, and construction services. In addition, it manufactures and sells digital discs and others. The company was formerly known as Poly (Hong Kong) Investments Limited. Poly Property Group Co., Limited is based in Hong Kong, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "CMPNF": {
        "short_name": "CHAMPION REAL ESTATE INVESTMENT",
        "long_name": "Champion Real Estate Investment Trust",
        "summary": "Champion Real Estate Investment Trust is a trust formed to own and invest in income- producing office and retail properties. The Trust focuses on Grade-A commercial properties in prime locations. It currently offers investors direct exposure to 2.93 million sq. ft. of prime office and retail properties by way of two landmark properties, Three Garden Road and Langham Place, one on each side of the Victoria Harbour.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "CPP.F": {
        "short_name": "CHINA OV.LD",
        "long_name": "China Overseas Land & Investment Limited",
        "summary": "China Overseas Land & Investment Limited, an investment holding company, engages in the property development and investment, and other operations. It operates through Property Development, Property Investment, and Other Operations segments. The company is involved in the investment, development, and rental of residential and commercial properties; issuance of guaranteed notes; property consultancy and real estate agency; and loan financing, security investment, and hotel management activities. It also provides construction and building design consultancy services; and operates serviced apartments. The company primarily operates in Hong Kong, Macau, Guangzhou, Shenzhen, Shanghai, Beijing, Tianjin, Jinan, Nanjing, Suzhou, Chengdu, Shenyang, and other regions in Mainland China. The company was founded in 1979 and is based in Central, Hong Kong. China Overseas Land & Investment Limited is a subsidiary of China Overseas Holdings Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "CQ3.F": {
        "short_name": "CHINESE ESTATES H. HD-,10",
        "long_name": "Chinese Estates Holdings Limited",
        "summary": "Chinese Estates Group (the \"Group\") is one of the leading property developers in Hong Kong. Chinese Estates Holdings Limited is the holding company of the Group and it is publicly listed on The Stock Exchange of Hong Kong Limited with stock code: 127. Chinese Estates' core businesses comprise of property investment for rental and property development for sale. The Group focuses primarily in Hong Kong, and diversifies its property interests to mainland China and the United Kingdom. The Group's investment properties include retail and office assets. Most of the investment properties of Chinese Estates are highly accessible and strategically located in prime commercial areas in Hong Kong such as Causeway Bay and Wanchai. In mainland China, Chinese Estates owns a five-star international hotel in Beijing. In the United Kingdom, Chinese Estates owns four investment properties in London. Over the past twenty years, Chinese Estates has built a reputation for conceptualising and implementing redevelopment, renovation works and repackaging programmes to enhance the value and revenue of its investment properties. Chinese Estates specializes in developing mid to high-end commercial and residential property projects. A number of quality and cosmopolitan residential properties are developed for sale.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wanchai"
    },
    "CQH3.F": {
        "short_name": "CHEUK NANG CONS.",
        "long_name": "Cheuk Nang (Holdings) Limited",
        "summary": "Cheuk Nang (Holdings) Limited, an investment holding company, engages in the investment, development, management, and trading of properties in the People's Republic of China, Hong Kong, and Malaysia. It operates through Property Sales, Property Rental, Estate Management, and Others segments. The company develops residential, commercial, and retail properties. It is also involved in the provision of secretarial and management services; and securities trading and debentures, and mortgage lending activities. The company was formerly known as Far East Wool & Fibre Mill, Limited and changed its name to Cheuk Nang (Holdings) Limited in 1988. The company was founded in 1963 and is based in Wan Chai, Hong Kong. Cheuk Nang (Holdings) Limited is a subsidiary of Yan Yin Company Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "CRBJF": {
        "short_name": "CHINA RESOURCES LAND",
        "long_name": "China Resources Land Limited",
        "summary": "China Resources Land Limited, an investment holding company, invests, develops, manages, and sells properties in the People's Republic of China. It invests in commercial, office, hotel, and apartment properties. As of December 31, 2020, the company had land bank of 68.087 million square meters. It also operates hotels; offers construction, decoration, and other property development related services; and manufactures and sells furniture. The company was incorporated in 1996 and is headquartered in Wanchai, Hong Kong. China Resources Land Limited is a subsidiary of CRH (Land) Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "CRBJY": {
        "short_name": "CHINA RESOURCES LAND",
        "long_name": "China Resources Land Limited",
        "summary": "China Resources Land Limited, an investment holding company, invests, develops, manages, and sells properties in the People's Republic of China. It invests in commercial, office, hotel, and apartment properties. As of December 31, 2020, the company had land bank of 68.087 million square meters. It also operates hotels; offers construction, decoration, and other property development related services; and manufactures and sells furniture. The company was incorporated in 1996 and is headquartered in Wanchai, Hong Kong. China Resources Land Limited is a subsidiary of CRH (Land) Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "CS4.F": {
        "short_name": "CN SOUTH CITY HLGS",
        "long_name": "China South City Holdings Limited",
        "summary": "China South City Holdings Limited, together with its subsidiaries, develops and operates integrated logistics and trade centers in the People's Republic of China. The company operates a trading platform of raw materials and finished products for domestic and international wholesale suppliers, traders, manufacturers, distributors, and retail clients; and sells and leases trade center units for businesses to display and sell their products. It also operates and manages outlets, which offers sports, outdoor, casual, and men's and women's fashion wear; and an e-commerce platform. In addition, the company provides warehousing management services; develops residential and commercial ancillary facilities; and arranges on-site third party delivery and distribution services. Further, it offers property management, and convention and exhibition services; and advertising, logistics, micro-credit, and other services. China South City Holdings Limited was founded in 2002 and is based in Tsim Sha Tsui, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "CUG.F": {
        "short_name": "CHUANG'S CH.  HD-,05",
        "long_name": "Chuang's China Investments Limited",
        "summary": "Chuang's China Investments Limited, an investment holding company, engages in the property development, investment, and trading activities in the People's Republic of China, Hong Kong, the United Kingdom, and Malaysia. The company develops, sells, rents, and manages commercial and residential properties; and operates and manages hotels. It is also involved in the sale of goods and merchandises, including art pieces; provision of securities investment and trading services; development and construction of cemeteries and provision of related management services; and money lending activities. The company is headquartered in Central, Hong Kong. Chuang's China Investments Limited is a subsidiary of Profit Stability Investments Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "DOF5.F": {
        "short_name": "PAC.CENT.PREM.  HD-,50",
        "long_name": "Pacific Century Premium Developments Limited",
        "summary": "Pacific Century Premium Developments Limited, together with its subsidiaries, develops and manages property and infrastructure projects in the Asia-Pacific region. The company also invests in residential and office buildings and properties; and provides professional property management, facilities management, asset management, and administrative services. In addition, it offers property leasing and sale agency, leasing and financing, travel agency, trademark registrant, ski operation, and hotel management services. The company is based in Hong Kong, Hong Kong. Pacific Century Premium Developments Limited is a subsidiary of Asian Motion Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "EM3A.F": {
        "short_name": "EMPEROR INTL SUBDIV.HD-01",
        "long_name": "Emperor International Holdings Limited",
        "summary": "Emperor International Holdings Limited, an investment holding company, engages in the property investment and development, and hospitality activities in Hong Kong, Macau, the United Kingdom, and the People's Republic of China. It operates through Lease of Properties, Properties Development, and Hotel and Hotel Related Operations segments. The Lease of Properties segment rents properties. The Properties Development segment engages in the development and redevelopment of properties for sale. The Hotel and Hotel Related Operations segment operates the Emperor Hotel, MORI MORI serviced apartments, the unit serviced apartments, Grand Emperor Hotel, and Inn Hotel Macau; and mass market halls, VIP rooms, and slot machine halls, as well as provides gaming-related marketing and public relation services. The company's property portfolio includes residential properties, retail spaces, shopping malls, and industrial and commercial buildings. In addition, it provides project financing and management, treasury service, property agency, and catering services. The company was founded in 1990 is headquartered in Wan Chai, Hong Kong. Emperor International Holdings Limited is a subsidiary of Emperor International Group Holdings Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "ESRCF": {
        "short_name": "ESR CAYMAN LIMITED",
        "long_name": "ESR Cayman Limited",
        "summary": "ESR Cayman Limited, together with its subsidiaries, engages in the logistics real estate development, leasing, and management activities in the Public's Republic of China, Japan, South Korea, Singapore, Australia, and India. It operates through three segments: Investment, Fund Management, and Development. The company develops, constructs, invests in, and sells logistics real estate properties. It is also involved in the fund management business. In addition, the company invests in properties, co-investments funds and investment vehicles, public REIT, and other investments. It serves e-commerce companies, 3PL providers, bricks-and-mortar retailers, manufacturers, cold-chain logistics providers, and other enterprises in various industries comprising electronics, fast-moving consumer goods, retail, food and beverage, general logistics services, auto and parts, pharmaceuticals, medical instruments, and machinery. The company was incorporated in 2011 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "FET.F": {
        "short_name": "FAR EAST CONS. INTL HD-10",
        "long_name": "Far East Consortium International Limited",
        "summary": "Far East Consortium International Limited, an investment holding company, engages in the property development and investment, hotel operations and management, car park operations and facilities management, gaming operations and management, and treasury management businesses. It develops a portfolio of residential properties; invests in retail and office buildings; and operates hotels. The company also operates third party and self-owned car parks; and owns and operates casinos and gaming facilities. In addition, it provides loan financing, sales agency, mortgage, administration and management, vault, and hotel management and consultancy services, as well as engages in the securities and financial investment activities. As of March 31, 2020, the company owned and operated 31 hotels with approximately 8,100 rooms; and managed 470 car parks with approximately 106,696 car parking bays. It has operations in Australia, New Zealand, the Czech Republic, Hong Kong, Malaysia, the People's Republic of China, Singapore, the United Kingdom, and the rest of Europe. The company is based in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "GFW1.F": {
        "short_name": "CHIN.SANDI HLDG.LTD.HD-01",
        "long_name": "China Sandi Holdings Limited",
        "summary": "China Sandi Holdings Limited, an investment holding company, engages in the investment and development of properties in the People's Republic of China. The company operates in Property Development, Property Investment, and Hotel Operation segments. It is also involved in the leasing of investment properties and providing property management services. In addition, the company provides hotel accommodation and catering services. Further, it engages in the securities trading. It owns and leases shopping malls, hotels, office units, commercial units, kindergartens, and car parking facilities. The Company was formerly known as China Grand Forestry Green Resources Group Limited and changed its name to China Sandi Holdings Limited in October 2012. China Sandi Holdings Limited is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "GI0A.F": {
        "short_name": "GLORIOUS PPTY REGS HD-,01",
        "long_name": "Glorious Property Holdings Limited",
        "summary": "Glorious Property Holdings Limited, an investment holding company, invests in, develops, and sells real estate properties in the People's Republic of China. It develops residential, commercial, serviced apartment, office, and hotel projects. As of December 31, 2020, the company had a total land bank of 6.6 million square meters in Shanghai region, Yangtze River Delta, Pan Bohai Rim, and Northeast China. It is also involved in the provision of corporate, culture, advertising planning, investment holding, advisory, business consulting, interior and exterior decoration, renovation, business management, property leasing, and hotel operation and property management services; and wholesale of construction materials, mechanical equipment, and building materials. The company was founded in 1996 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wanchai"
    },
    "GUW.F": {
        "short_name": "GUANGD.LAND HLDGS HD -,01",
        "long_name": "Guangdong Land Holdings Limited",
        "summary": "Guangdong Land Holdings Limited, an investment holding company, engages in property development and investment businesses primarily in Mainland China. The company was formerly known as Kingway Brewery Holdings Limited and changed its name to Guangdong Land Holdings Limited in September 2013. The company was incorporated in 1997 and is headquartered in Central, Hong Kong and is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange. Guangdong Land Holdings Ltd. is a subsidiary of Guangdong Investment Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "GUZ.F": {
        "short_name": "YUEXIU PPTY CO.LTD.",
        "long_name": "Yuexiu Property Company Limited",
        "summary": "Yuexiu Property Company Limited, together with its subsidiaries, develops, sells, and manages properties primarily in Mainland China and Hong Kong. It operates through Property Development, Property Management, Property Investment, and Other segments. The company is also involved in holding investment properties. In addition, it offers property development and management consulting, property rental, decoration and design, project management, real estate and property agency, investment consulting, metal manufacturing, information consulting, car parking management, financial, building management, commercial, greening, construction, and trade finance services. As of December 31, 2020, the company owned investment properties under lease of approximately 774,000 sq.m. comprising offices, commercial properties, car parks, and others; and a total landbank of approximately 24.54 million sq.m. The company was formerly known as Guangzhou Investment Company Limited. The company was incorporated in 1992 and is based in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "H8CC.F": {
        "short_name": "HKC (HLDGS)  HD -,25",
        "long_name": "HKC (Holdings) Limited",
        "summary": "HKC (Holdings) Limited, together with its subsidiaries, engages in the property development and investment, and renewable energy investment and operation businesses in the People's Republic of China. It operates through Properties Development, Property Investment and Leasing, Renewable Energy, and Other Operations segments. The company develops and builds residential properties, including townhouses, high-rise apartments, and commercial shops; and invests in shopping malls and offices, as well as properties for restaurants and retails. It also holds properties; develops and operates building materials center; owns and operates wind power and distributed solar projects; and provides property management services. The company was incorporated in 2006 and is headquartered in Tsim Sha Tsui, Hong Kong. HKC (Holdings) Limited is a subsidiary of Claudio Holdings Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "HKC.F": {
        "short_name": "HK CHINESE  HD 1",
        "long_name": "Hongkong Chinese Limited",
        "summary": "Hongkong Chinese Limited, an investment holding company, engages in property investment and development, healthcare services, and hotel operations. Its Property Investment segment engages in the letting and resale of properties. The company's Property Development segment is involved in the development and sale of properties. Its Treasury Investment segment invests in money markets. The company's Securities Investment segment invests in securities held-for-trading. Its Other segment engages in the provision of money lending and project management services. The company also owns a motor yacht. It has operations in Hong Kong, Mainland China, Singapore, Indonesia, and internationally. The company was founded in 1992 and is based in Hong Kong, Hong Kong. Hongkong Chinese Limited is a subsidiary of Hennessy Holdings Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "HKP.F": {
        "short_name": "JOY CITY PPTY  HD -,10",
        "long_name": "Joy City Property Limited",
        "summary": "Joy City Property Limited, an investment holding company, engages in property investment and development, property management, and hotel operation activities in Mainland China and Hong Kong. It operates through four segments: Property Investment, Property and Land Development, Hotel Operations, and Output Management Project and Other Services. The company engages in the development, operation, sale, leasing, and management of mixed use complexes and other commercial properties, including shopping centers, hotels, offices, serviced apartments, and resort and tourist properties. It also owns and manages hotels; and provides agency services and property management services, as well as tourism services. The company was formerly known as COFCO Land Holdings Limited and changed its name to Joy City Property Limited in December 2014. The company was incorporated in 1992 and is headquartered in Causeway Bay, Hong Kong. Joy City Property Limited is a subsidiary of Grandjoy Holdings Group Co., Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "HKR.F": {
        "short_name": "HKR INTL LTD  HD-,25",
        "long_name": "HKR International Limited",
        "summary": "HKR International Limited, an investment holding company, invests in, develops, and manages real estate properties in Hong Kong, Macau, Mainland China, Japan, and South East Asia. It operates in five segments: Property Development, Property Investment, Services Provided, Hotel Operations, and Healthcare. The company primarily develops and manages residential, commercial, and industrial properties, as well as leisure projects. It also owns, operates, and manages hotels; and a healthcare service network, including chronic disease management and integrated medical centers, Chinese medicine centers, dental clinics, medical diagnostic centers, and medical network services. In addition, the company offers transportation services in Discovery Bay, including ferry, land transport, and tunnel operations; operates clubs; and invests in securities. Further, HKR International Limited provides cancer treatment and diagnostic imaging, commercial leasing agency, property agency, bus and garage, dental health and care, and project management services; corporate consultancy services to healthcare operating units; and financial services to first hand purchasers of properties in Discovery Bay, as well as trades in medical and dental equipment and supplies. Additionally, the company engages in the operation of a shipyard and road tunnel; and diabetes and endocrine disorders clinics, as well as acts as an estate manager and principal lessee of communication network in Discovery Bay. HKR International Limited was founded in 1977 and is based in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "HLD.F": {
        "short_name": "HENDERSON LD DEV.",
        "long_name": "Henderson Land Development Company Limited",
        "summary": "Henderson Land Development Company Limited, an investment holding company, engages in the property development and investment activities in Hong Kong and Mainland China. The company operates through Property Development, Property Leasing, Department Stores and Supermarket-Cum-Stores Operations, Other Businesses, and Utility and Energy segments. The Property Development segment develops and sells real estate properties. Its property portfolio primarily includes offices, shopping arcades, shopping malls, commercial complexes, and residential properties. The Property Leasing segment leases properties. The Department Stores and Supermarket-Cum-Stores Operations segment operates and manages department stores and supermarket-cum-stores. The Other Businesses segment operates and manages hotels; provides construction, finance, project management, property management, agency, and cleaning and security guard services; and trades in building materials, as well as disposes leasehold land. The Utility and Energy segment is involved in production, distribution, and marketing gas; and water supply and environmentally friendly energy businesses. Henderson Land Development Company Limited was incorporated in 1976 and is based in Central, Hong Kong. Henderson Land Development Company Limited is a subsidiary of Henderson Development Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "HLDCY": {
        "short_name": "HENDERSON LAND DEVELOPMENT CO",
        "long_name": "Henderson Land Development Company Limited",
        "summary": "Henderson Land Development Company Limited, an investment holding company, engages in the property development and investment activities in Hong Kong and Mainland China. The company operates through Property Development, Property Leasing, Department Stores and Supermarket-Cum-Stores Operations, Other Businesses, and Utility and Energy segments. The Property Development segment develops and sells real estate properties. Its property portfolio primarily includes offices, shopping arcades, shopping malls, commercial complexes, and residential properties. The Property Leasing segment leases properties. The Department Stores and Supermarket-Cum-Stores Operations segment operates and manages department stores and supermarket-cum-stores. The Other Businesses segment operates and manages hotels; provides construction, finance, project management, property management, agency, and cleaning and security guard services; and trades in building materials, as well as disposes leasehold land. The Utility and Energy segment is involved in production, distribution, and marketing gas; and water supply and environmentally friendly energy businesses. Henderson Land Development Company Limited was incorporated in 1976 and is based in Central, Hong Kong. Henderson Land Development Company Limited is a subsidiary of Henderson Development Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "HLPPF": {
        "short_name": "HANG LUNG PROPERTIES (HLP)",
        "long_name": "Hang Lung Properties Limited",
        "summary": "Hang Lung Properties Limited, an investment holding company, engages in the property investment, development, and management activities in Hong Kong and Mainland China. The company operates through Property Leasing and Property Sales segments. The company is involved in the property leasing business; and development and sale of properties. Its investment properties portfolio includes shopping malls, office, residential, serviced apartment, hotel, and car parking properties, as well as industrial premises. The company also engages in the apartment operating and management; car parking and project management; and property agency activities. In addition, it provides management and financial services. The company was incorporated in 1949 and is headquartered in Central, Hong Kong. Hang Lung Properties Limited is a subsidiary of Hang Lung Group Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "HLPPY": {
        "short_name": "HANG LUNG PROPERTIES (HLP)",
        "long_name": "Hang Lung Properties Limited",
        "summary": "Hang Lung Properties Limited, an investment holding company, engages in the property investment, development, and management activities in Hong Kong and Mainland China. The company operates through Property Leasing and Property Sales segments. The company is involved in the property leasing business; and development and sale of properties. Its investment properties portfolio includes shopping malls, office, residential, serviced apartment, hotel, and car parking properties, as well as industrial premises. The company also engages in the apartment operating and management; car parking and project management; and property agency activities. In addition, it provides management and financial services. The company was incorporated in 1949 and is headquartered in Central, Hong Kong. Hang Lung Properties Limited is a subsidiary of Hang Lung Group Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "HLU.F": {
        "short_name": "HANG LUNG GR",
        "long_name": "Hang Lung Group Limited",
        "summary": "Hang Lung Group Limited, an investment holding company, operates as a property developer in Hong Kong and Mainland China. The company operates through Property Leasing and Property Sales segments. It develops properties for sale and lease, such as large-scale commercial, office, and residential developments. The company also develops various properties, including shopping mall, office, residential, serviced apartments, and carparks. Its investment properties portfolio includes Grand Gateway 66, a commercial, office, and residential complex, as well as Plaza 66, a commercial and office complex in Shanghai; Palace 66 and Forum 66 in Shenyang; Parc 66 in Jinan; Center 66 in Wuxi; Riverside 66 in Tianjin; Olympia 66 in Dalian; Spring City 66 in Kunming; Heartland 66 in Wuhan; and Westlake 66. In addition, the company offers car park and property management, securities trading, financial, project management, and property agency services, as well as operates and manages apartment. Hang Lung Group Limited was incorporated in 1960 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "HNLGF": {
        "short_name": "HANG LUNG GROUP",
        "long_name": "Hang Lung Group Limited",
        "summary": "Hang Lung Group Limited, an investment holding company, operates as a property developer in Hong Kong and Mainland China. The company operates through Property Leasing and Property Sales segments. It develops properties for sale and lease, such as large-scale commercial, office, and residential developments. The company also develops various properties, including shopping mall, office, residential, serviced apartments, and carparks. Its investment properties portfolio includes Grand Gateway 66, a commercial, office, and residential complex, as well as Plaza 66, a commercial and office complex in Shanghai; Palace 66 and Forum 66 in Shenyang; Parc 66 in Jinan; Center 66 in Wuxi; Riverside 66 in Tianjin; Olympia 66 in Dalian; Spring City 66 in Kunming; Heartland 66 in Wuhan; and Westlake 66. In addition, the company offers car park and property management, securities trading, financial, project management, and property agency services, as well as operates and manages apartment. Hang Lung Group Limited was incorporated in 1960 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "HNLGY": {
        "short_name": "HANG LUNG GROUP",
        "long_name": "Hang Lung Group Limited",
        "summary": "Hang Lung Group Limited, an investment holding company, operates as a property developer in Hong Kong and Mainland China. The company operates through Property Leasing and Property Sales segments. It develops properties for sale and lease, such as large-scale commercial, office, and residential developments. The company also develops various properties, including shopping mall, office, residential, serviced apartments, and carparks. Its investment properties portfolio includes Grand Gateway 66, a commercial, office, and residential complex, as well as Plaza 66, a commercial and office complex in Shanghai; Palace 66 and Forum 66 in Shenyang; Parc 66 in Jinan; Center 66 in Wuxi; Riverside 66 in Tianjin; Olympia 66 in Dalian; Spring City 66 in Kunming; Heartland 66 in Wuhan; and Westlake 66. In addition, the company offers car park and property management, securities trading, financial, project management, and property agency services, as well as operates and manages apartment. Hang Lung Group Limited was incorporated in 1960 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "HRH.F": {
        "short_name": "CHINA OCEANWIDE HLDGS",
        "long_name": "China Oceanwide Holdings Limited",
        "summary": "China Oceanwide Holdings Limited, an investment holding company, engages in property investment, real estate development, energy, and finance investment and other activities in the United States, Indonesia, the People's Republic of China, and Hong Kong. It owns and rents two office and commercial properties in Shanghai; develops real estate properties in the United States; provides management services; invests in debt and equity securities; and develops two coal-fired steam power plants with a net capacity of 150 megawatt each in the Medan industrial zone of Indonesia. The company was formerly known as Hutchison Harbour Ring Limited and changed its name to China Oceanwide Holdings Limited in December 2014. China Oceanwide Holdings Limited is headquartered in Hong Kong, Hong Kong. China Oceanwide Holdings Limited is a subsidiary of Oceanwide Holdings International Company Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "HU8.F": {
        "short_name": "SOCAM DEVELOPMENT LTD HD1",
        "long_name": "SOCAM Development Limited",
        "summary": "SOCAM Development Limited, an investment holding company, engages in the property and construction businesses in the People's Republic of China and Hong Kong. It operates through Property, Construction and Building Maintenance, and Other Businesses segments. It undertakes the construction of public housings, offices/SOHO, and retail facilities, as well as commercial, residential, and institutional buildings. The company is involved in property, investment, development, and management activities; and interior fitting out, and building renovation and premise maintenance activities. In addition, it provides venture capital investment, design and contracting, management, and consultancy services, as well as structural steel construction works; and owns and leases plants and machineries. The company was formerly known as Shui On Construction and Materials Limited and changed its name to SOCAM Development Limited in September 2011. SOCAM Development Limited is headquartered in Hong Kong, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "HVP.F": {
        "short_name": "HOPSON DEV. HLDGS  HD-,10",
        "long_name": "Hopson Development Holdings Limited",
        "summary": "Hopson Development Holdings Limited, an investment holding company, primarily develops residential properties in the People's Republic of China and Hong Kong. The company operates through Property Development, Commercial Properties Investment, Property Management, Infrastructure, and Investments segments. It invests in and rents properties; manages restaurants, hotels, and properties; and operates hotels. The company also provides construction, water supply, clubhouse and residential, consultancy, and architectural design services. In addition, it engages in design and renovation services; sale of properties; and decoration activities. The company was founded in 1992 and is headquartered in Central, Hong Kong. Hopson Development Holdings Limited is a subsidiary of Sounda Properties Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "HYN.F": {
        "short_name": "HYSAN DEV. CO.LTD",
        "long_name": "Hysan Development Company Limited",
        "summary": "Hysan is a leading property investment, management and development company in Hong Kong, with a portfolio of more than 4 million square feet of high-quality office, retail and residential properties. Operating primarily in the city's prime retail/office district of Causeway Bay, we are focused on delighting our customers and providing investors with outstanding returns.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "HYSNY": {
        "short_name": "HYSAN DEVELOPMENT",
        "long_name": "Hysan Development Company Limited",
        "summary": "Hysan is a leading property investment, management and development company in Hong Kong, with a portfolio of more than 4 million square feet of high-quality office, retail and residential properties. Operating primarily in the city's prime retail/office district of Causeway Bay, we are focused on delighting our customers and providing investors with outstanding returns.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "ICHA.F": {
        "short_name": "EVERCHINA INT.HDGS.",
        "long_name": "EverChina Int'l Holdings Company Limited",
        "summary": "EverChina Int'l Holdings Company Limited primarily engages in the property investment and hotel operations in Hong Kong, the People's Republic of China, and Bolivia. It operates through Property Investment Operation, Hotel operation, Securities Investment and Financing Operation, and Agricultural Operation segments. The company is involved in the leasing of residential and commercial properties, as well as car parking space rental; exploration, mining processing, and sale of manganese resources; securities investment activities; and provision of corporate management, and financial services. It also engages in the raising and sale of cattle, as well as agricultural farming activities; and sale of soybean, corn, and rice. The company was formerly known as Interchina Holdings Company Limited and changed its name to EverChina Int'l Holdings Company Limited in February 2014. EverChina Int'l Holdings Company Limited is based in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "KID1.F": {
        "short_name": "POLYTEC ASS. HLDGS HD-,10",
        "long_name": "Polytec Asset Holdings Limited",
        "summary": "Polytec Asset Holdings Limited, an investment holding company, primarily invests in, develops, and trades in real estate properties in the People's Republic of China and Kazakhstan. The company operates through four segments: Properties, Oil, Ice and Cold Storage, and Financial Investments. It develops residential and commercial properties. The company has a development land bank of 294,000 square meters; and investment land bank of approximately 18,000 square meters in Macau. It is also involved in the oil exploration and production activities in Kazakhstan; manufacturing and trading ice; the provision of cold storage and consultancy services; and general trading activities. In addition, the company involved in equity and debt securities. The company was formerly known as Kin Don Holdings Limited and changed its name to Polytec Asset Holdings Limited in January 2004. The company was incorporated in 1998 and is headquartered in Kowloon, Hong Kong. Polytec Asset Holdings Limited is a subsidiary of Marble King International Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "KOX.F": {
        "short_name": "KOWLOON DEVELOP.",
        "long_name": "Kowloon Development Company Limited",
        "summary": "Kowloon Development Company Limited, an investment holding company, engages in the investment, development, and management of properties in Hong Kong and Mainland China. The company develops, leases, and sells various residential and commercial projects, such as club houses, car parking facilities, retail shops, shopping arcades, and residential towers, as well as hotels and office buildings. As of December 31, 2020, its land bank for development totaled to approximately 3.7 million square meters of gross floor area. The company also provides security, technical, and housekeeping services; building surveying and guarding services; financial investments and services; and project management services, as well as undertakes construction contracts. In addition, it engages in the treasury operations; retail activities; and distribution of films and cinematograph films. The company was incorporated in 1961 and is headquartered in Mong Kok, Hong Kong. Kowloon Development Company Limited is a subsidiary of Intellinsight Holdings Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Mong Kok"
    },
    "KR3.F": {
        "short_name": "KERRY PROPERTIES  HD 1",
        "long_name": "Kerry Properties Limited",
        "summary": "Kerry Properties Limited, an investment holding company, engages in the development, investment, management, and trading of properties in Hong Kong, the People's Republic of China, and the Asia Pacific region. The company also owns and operates hotels; and offers logistics and freight forwarding, consultancy, administrative support, project management, financial, IT system and consultancy, estate agency, and construction services. In addition, it is involved in the warehouse operations, as well as operation of restaurants, recreation parks, and ice rinks. The company was incorporated in 1978 and is headquartered in Quarry Bay, Hong Kong. Kerry Properties Limited is a subsidiary of Kerry Group Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Quarry Bay"
    },
    "KRYPF": {
        "short_name": "KERRY PROPERTIES LTD",
        "long_name": "Kerry Properties Limited",
        "summary": "Kerry Properties Limited, an investment holding company, engages in the development, investment, management, and trading of properties in Hong Kong, the People's Republic of China, and the Asia Pacific region. The company also owns and operates hotels; and offers logistics and freight forwarding, consultancy, administrative support, project management, financial, IT system and consultancy, estate agency, and construction services. In addition, it is involved in the warehouse operations, as well as operation of restaurants, recreation parks, and ice rinks. The company was incorporated in 1978 and is headquartered in Quarry Bay, Hong Kong. Kerry Properties Limited is a subsidiary of Kerry Group Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Quarry Bay"
    },
    "KW2.F": {
        "short_name": "K.WAH INTL HLDGS  HD-10",
        "long_name": "K. Wah International Holdings Limited",
        "summary": "K. Wah International Holdings Limited, an investment holding company, engages in the property development and investment activities in Hong Kong and Mainland China. Its property portfolio comprises residential developments, office towers, hotels, serviced apartments, and commercial facilities. The company also provides property management services to residential buildings, commercial facilities, office towers, and real estate complexes. In addition, it offers financial, management, and decoration services. K. Wah International Holdings Limited was incorporated in 1990 and is headquartered in North Point, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "North Point"
    },
    "KWLGF": {
        "short_name": "KWG LIVING GROUP HLDGS LTD",
        "long_name": "KWG Living Group Holdings Limited",
        "summary": "KWG Living Group Holdings Limited, an investment holding company, provides various residential and non-residential property management services in the People's Republic of China. The company also offers commercial operational, real estate intermediary, and business services. As of December 31, 2020, it managed 183 residential properties with an aggregate gross floor area (GFA) under management of 29.1 million square meters; and 172 non-residential properties with an aggregate GFA under management of 12.5 million square meters. The company was founded in 2004 and is based in Kowloon, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "LKREF": {
        "short_name": "LINK REAL ESTATE INVESTMENT TRU",
        "long_name": "Link Real Estate Investment Trust",
        "summary": "Link Real Estate Investment Trust (Hong Kong stock code: 823), managed by Link Asset Management Limited, is a leading retail-focused REIT in the world and Asia's largest REIT in terms of market capitalisation. Listed in 2005 as the first REIT in Hong Kong, Link has been 100% held by public and institutional investors and is a Hang Seng Index constituent stock. From its home in Hong Kong, Link manages a diversified portfolio including retail facilities, car parks and offices spanning Hong Kong, Beijing, Guangzhou, Shanghai, Shenzhen, London and Sydney. Link seeks to extend its portfolio growth trajectory and grasp expansion opportunities in different markets in pursuit of our medium-term target Vision 2025.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "LVSDF": {
        "short_name": "LAI SUN DEVELOPMENT CO",
        "long_name": "Lai Sun Development Company Limited",
        "summary": "Lai Sun Development Company Limited, together with its subsidiaries, invests in, develops, leases, and sells real estate properties in Hong Kong, Mainland China, the United Kingdom, Vietnam, and internationally. It operates through Property Development and Sales; Property Investment; Hotel Operation; Restaurant Operation; Media and Entertainment; Film and TV Program; Cinema Operation; Theme Park Operation; and Others segments. The company also invests in, develops, operates in, and manages cultural, leisure, entertainment, and related facilities; hotels and restaurants; and provides management and consultancy services to hotels, serviced apartments, and restaurants. In addition, it engages in the development, operation, and investment of media and entertainment events; cinema operations; golf apparel retailing; and music production and distribution, as well as provision of related advertising services. Further, the company invests in, produces, licenses, and distributes television programs, films, and video format products. Additionally, the company offers property management, real estate agency, leasing agency, performance agency, and building services; and luxury yachts brokerage, charter, marketing, management, and crew placement services; and finance and treasury services. It also provides artiste management services; sells albums; distributes and licenses music and film rights; and trades in gaming products. In addition, the company distributes movie video compact discs, digital video discs, and Blu-ray discs. Further, it engages in film library management; video duplication services; and translating and subtitling of television programs. The company was incorporated in 1959 and is headquartered in Central, Hong Kong. Lai Sun Development Company Limited is a subsidiary of Lai Sun Garment (International) Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "MKU.F": {
        "short_name": "PEKING UNI.RES(H.) HD-,10",
        "long_name": "Peking University Resources (Holdings) Company Limited",
        "summary": "Peking University Resources (Holdings) Company Limited, together with its subsidiaries, distributes information products, and invests in and develops properties in Mainland China and Hong Kong. The company primarily distributes servers, printers, switches, networking products, storage devices, workstations, optical screen products, video conference hosts, conference controllers, codec, UPS power supply products, and notebook computer of various manufacturers, such as HP, H3C, CommScope, Brocade, Microsoft, Corning, Lenovo, Huawei, DELL, IBM, Netgear, CommScope, and SGi. It also acts as a distribution channel for the products of other IT companies, such as LifeSize, BARCO, CommScope, Fujitsu, Samsung, Uniview, Corning, Brocade, Librestream, Ruckus, and Impinj. In addition, the company leases and subleases, and sells properties. The company was formerly known as EC-Founder (Holdings) Company Limited and changed its name to Peking University Resources (Holdings) Company Limited in December 2013. Peking University Resources (Holdings) Company Limited is headquartered in Tsuen Wan, Hong Kong. Peking University Resources (Holdings) Company Limited is a subsidiary of Founder Information (Hong Kong) Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Tsuen Wan"
    },
    "MPY.F": {
        "short_name": "GREAT WALL PAN ASI.HD-,10",
        "long_name": "Great Wall Pan Asia Holdings Limited",
        "summary": "Great Wall Pan Asia Holdings Limited, an investment holding company, engages in the property investment business in Hong Kong and internationally. The company operates through two segments, Property Investment and Financial Services. The Property Investment segment invests in retail shops, office buildings, industrial buildings and car parking spaces. The Financial Services segment provides asset management, advising on securities, loan investment, and corporate finance services; as well as deals in securities. The company was formerly known as Armada Holdings Limited and changed its name to Great Wall Pan Asia Holdings Limited in December 2016. The company is headquartered in Central, Hong Kong. Great Wall Pan Asia Holdings Limited is a subsidiary of China Great Wall AMC (International) Holdings Company Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "MTK.F": {
        "short_name": "MIDLAND HLDGS LTD. HD-,10",
        "long_name": "Midland Holdings Limited",
        "summary": "Midland Holdings Limited, an investment holding company, provides property agency services in the Hong Kong, Macau, and the People's Republic of China. The company offers residential property agency services; and money lending, project planning, commercial property management, and marketing and sales planning services, as well as surveying, leasing, and property management services. It also provides immigration consultancy services; surveying consultancy services, including valuation advisory, development study, sales, marketing, tender, and auction for projects; and operates internet website. In addition, the company offers property investment services; and overseas property projects' marketing and referral services in Hong Kong. Midland Holdings Limited was founded in 1973 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "NDVLY": {
        "short_name": "NEW WORLD DEVELOPMENT CO",
        "long_name": "New World Development Company Limited",
        "summary": "New World Development Company Limited, an investment holding company, engages in the property development and investment business in Hong Kong and internationally. Its property portfolio comprises residential, retail, office, and industrial properties. The company also provides commercial aircraft leasing services; operates expressways; and constructs residential and commercial projects, as well as provides protection and savings-related life and medical insurance products. In addition, it is involved in the duty free operation and general trading, civil engineering, loyalty program, marketing, promotion, fashion retailing and trading, and piling and ground investigation businesses; development and operation of sports park; operation of household goods shop and convenience store; sale of LED lighting products and systems; and trading of telecommunication system integration products. Further, the company manages Hong Kong Convention and Exhibition Centre; operates hotels, golf and tennis academies, and shopping malls; operates department stores; and provides information technology, healthcare, training course, ticketing, financial, project management, management, advertising and media related, business and investment consultancy, franchised and non-franchised bus, estate agency, wellness and rehabilitation, endoscopic, carpark management, supply chain management, and catering services, as well as property agency, management, and consultancy services. Additionally, the company undertakes faÃ§ade and foundation works; and offers elderly residential and nursing care services. As of June 30, 2020, the company had a total of 17 hotel properties with approximately 7,400 rooms in Hong Kong, Mainland China, and the Southeast Asia. New World Development Company Limited was founded in 1970 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "NWDA.F": {
        "short_name": "NEW WORLD DEV.CO.(B.L.)",
        "long_name": "New World Development Company Limited",
        "summary": "New World Development Company Limited, an investment holding company, engages in the property development and investment business in Hong Kong and internationally. Its property portfolio comprises residential, retail, office, and industrial properties. The company also provides commercial aircraft leasing services; operates expressways; and constructs residential and commercial projects, as well as provides protection and savings-related life and medical insurance products. In addition, it is involved in the duty free operation and general trading, civil engineering, loyalty program, marketing, promotion, fashion retailing and trading, and piling and ground investigation businesses; development and operation of sports park; operation of household goods shop and convenience store; sale of LED lighting products and systems; and trading of telecommunication system integration products. Further, the company manages Hong Kong Convention and Exhibition Centre; operates hotels, golf and tennis academies, and shopping malls; operates department stores; and provides information technology, healthcare, training course, ticketing, financial, project management, management, advertising and media related, business and investment consultancy, franchised and non-franchised bus, estate agency, wellness and rehabilitation, endoscopic, carpark management, supply chain management, and catering services, as well as property agency, management, and consultancy services. Additionally, the company undertakes faÃ§ade and foundation works; and offers elderly residential and nursing care services. As of June 30, 2020, the company had a total of 17 hotel properties with approximately 7,400 rooms in Hong Kong, Mainland China, and the Southeast Asia. New World Development Company Limited was founded in 1970 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "NWWDF": {
        "short_name": "NEW WORLD DEVELOPMENT CO",
        "long_name": "New World Development Company Limited",
        "summary": "New World Development Company Limited, an investment holding company, engages in the property development and investment business in Hong Kong and internationally. Its property portfolio comprises residential, retail, office, and industrial properties. The company also provides commercial aircraft leasing services; operates expressways; and constructs residential and commercial projects, as well as provides protection and savings-related life and medical insurance products. In addition, it is involved in the duty free operation and general trading, civil engineering, loyalty program, marketing, promotion, fashion retailing and trading, and piling and ground investigation businesses; development and operation of sports park; operation of household goods shop and convenience store; sale of LED lighting products and systems; and trading of telecommunication system integration products. Further, the company manages Hong Kong Convention and Exhibition Centre; operates hotels, golf and tennis academies, and shopping malls; operates department stores; and provides information technology, healthcare, training course, ticketing, financial, project management, management, advertising and media related, business and investment consultancy, franchised and non-franchised bus, estate agency, wellness and rehabilitation, endoscopic, carpark management, supply chain management, and catering services, as well as property agency, management, and consultancy services. Additionally, the company undertakes faÃ§ade and foundation works; and offers elderly residential and nursing care services. As of June 30, 2020, the company had a total of 17 hotel properties with approximately 7,400 rooms in Hong Kong, Mainland China, and the Southeast Asia. New World Development Company Limited was founded in 1970 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "OIHC.F": {
        "short_name": "CSI PROPERT.SUBDIV.HD-008",
        "long_name": "CSI Properties Limited",
        "summary": "CSI Properties Limited, an investment holding company, engages in the property development and investment activities in Hong Kong, Singapore, the People's Republic of China, and Macau. The company operates through four segments: Commercial Property Holding, Residential Property Holding, Macau Property Holding, and Securities Investment. It invests and trades in commercial and residential properties. The company is also involved in securities trading and investment activities; issuing bonds; treasury management; and provision of management and property management services. CSI Properties Limited is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "ONF.F": {
        "short_name": "MINMETALS LAND LTD HD-,10",
        "long_name": "Minmetals Land Limited",
        "summary": "Minmetals Land Limited, an investment holding company, engages in the real estate development business in the People's Republic of China. It operates through Real Estate Development, Specialized Construction, Property Investment, and Securities Investment segments. The company develops and sells residential and commercial properties; and designs, installs, and sells curtain walls, as well as aluminum windows, doors, and other materials. It also holds and rents properties; invests in securities; and provides management, property management, and fund-raising services. The company is based in Tsim Sha Tsui, Hong Kong. Minmetals Land Limited is a subsidiary of June Glory International Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "OVZ3.F": {
        "short_name": "ZENSUN ENTERPRISES LTD.",
        "long_name": "Zensun Enterprises Limited",
        "summary": "Zensun Enterprises Limited, an investment holding company, engages in the property development, property investment and management, and securities trading and investment businesses. The company also offers loan financing services. It has operations in Hong Kong, the People's Republic of China, Singapore, Japan, and the United States. The company was formerly known as ZH International Holdings Limited and changed its name to Zensun Enterprises Limited in July 2019. The company was founded in 1965 and is headquartered in Central, Hong Kong. Zensun Enterprises Limited is a subsidiary of Joy Town Inc.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "P36.SI": {
        "short_name": "Pan Hong",
        "long_name": "Pan Hong Holdings Group Limited",
        "summary": "Pan Hong Holdings Group Limited, an investment holding company, engages in the development of residential and commercial properties in the second and third-tier cities in the People's Republic of China. It is also involved in the operation and management of hotels; investment management activities; provision of property consultation services; and general trading and consultancy services businesses. The company was formerly known as Pan Hong Property Group Limited and changed its name to Pan Hong Holdings Group Limited in September 2015. The company was incorporated in 2005 and is headquartered in Hunghom, Hong Kong. Pan Hong Holdings Group Limited is a subsidiary of Extra Good Enterprises Limited.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Hong Kong",
        "city": "Hung Hom"
    },
    "PCPDF": {
        "short_name": "PACIFIC CENTURY PREMIUM DEVELOP",
        "long_name": "Pacific Century Premium Developments Limited",
        "summary": "Pacific Century Premium Developments Limited, together with its subsidiaries, develops and manages property and infrastructure projects in the Asia-Pacific region. The company also invests in residential and office buildings and properties; and provides professional property management, facilities management, asset management, and administrative services. In addition, it offers property leasing and sale agency, leasing and financing, travel agency, trademark registrant, ski operation, and hotel management services. The company is based in Hong Kong, Hong Kong. Pacific Century Premium Developments Limited is a subsidiary of Asian Motion Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "PHKIF": {
        "short_name": "POLY PROPERTY GROUP CO LTD",
        "long_name": "Poly Property Group Co., Limited",
        "summary": "Poly Property Group Co., Limited, an investment holding company, engages in the property development, investment, and management activities in Hong Kong and the People's Republic of China. The company operates in four segments: Property Development, Property Investment and Management, Hotel Operations, and Other Operations. It is involved in the development of residential and commercial properties; and hotel and restaurant business, as well as provision of related services. The company also provides financial, management, asset management, property agency, and construction services. In addition, it manufactures and sells digital discs and others. The company was formerly known as Poly (Hong Kong) Investments Limited. Poly Property Group Co., Limited is based in Hong Kong, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "QHI.F": {
        "short_name": "SHIMAO GROUP HLDGS HD-,10",
        "long_name": "Shimao Group Holdings Limited",
        "summary": "Shimao Group Holdings Limited, an investment holding company, engages in the property development and investment activities in the People's Republic of China. The company develops residential and commercial properties; and operates hotels and shopping malls. It is also involved in the trading of construction materials; and property management activities. The company was formerly known as Shimao Property Holdings Limited and changed its name to Shimao Group Holdings Limited in May 2020. Shimao Group Holdings Limited was incorporated in 2004 and is based in Hong Kong, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "QU4B.F": {
        "short_name": "C C LAND HOLDINGS  HD-,10",
        "long_name": "C C Land Holdings Limited",
        "summary": "C C Land Holdings Limited, an investment holding company, invests in and develops properties in the United Kingdom, Hong Kong, and Mainland China. The company operates through two segments, Property Development and Investment; and Treasury Investment. It also invests in securities and notes receivable; and provides financial services, as well as engages in vessel management and yacht investment activity. The company was formerly known as Qualipak International Holdings Limited and changed its name to C C Land Holdings Limited in January 2007. C C Land Holdings Limited was incorporated in 1998 and is headquartered in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "R9HA.F": {
        "short_name": "CHINA DILI GROUP  HD -,10",
        "long_name": "China Dili Group",
        "summary": "China Dili Group, an investment holding company, engages in the operation of agriculture wholesale markets in the People's Republic of China. It leases and manages agriculture wholesale market. The company operates 10 wholesale markets in Harbin, Shenyang, Shouguang, Guiyang, Qiqihar, Mudanjiang, and Hangzhou. The company was formerly known as Renhe Commercial Holdings Company Limited and changed its name to China Dili Group in June 2019. China Dili Group was founded in 2002 and is based in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "RHGN.F": {
        "short_name": "CN AGRI-PRODS EXCH.HK-,01",
        "long_name": "China Agri-Products Exchange Limited",
        "summary": "China Agri-Products Exchange Limited, an investment holding company, engages in the investment, development, construction, operation, and management of agricultural wholesale markets in the People's Republic of China. The company operates in two segments, Agricultural Produce Exchange Market Operation and Property Sales. It operates various agricultural markets, including the Wuhan Baisazhou agricultural and by-product exchange market located in Wuhan City, Hongshan District; the Yulin Hongjin agricultural and by-product exchange market in Guangxi Zhuang Autonomous Region; the Luoyang Hongjin agricultural and by-product exchange market located in Henan Province; the Xuzhou agricultural and by-product exchange market in the northern part of Jiangsu Province; Puyang Hongjin agricultural and by-product exchange market located in Henan Province; Kaifeng Hongjin agricultural and by-product exchange market located in Henan Province; Qinzhou Hongjin agricultural and by-product exchange market in the Guangxi Region; Huangshi Hongjin agricultural and by-product exchange market in Hubei Province; Huai'an Market in Jiangsu Province; Panjin Market in Liaoning Province; and Suizhou Market located in Suizhou city. The company also sells properties; offers financial services; and operates agricultural logistics center to provide distribution and logistics services in central China. China Agri-Products Exchange Limited is headquartered in Kowloon Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Kowloon Bay"
    },
    "RNHEF": {
        "short_name": "CHINA DILI GROUP",
        "long_name": "China Dili Group",
        "summary": "China Dili Group, an investment holding company, engages in the operation of agriculture wholesale markets in the People's Republic of China. It leases and manages agriculture wholesale market. The company operates 10 wholesale markets in Harbin, Shenyang, Shouguang, Guiyang, Qiqihar, Mudanjiang, and Hangzhou. The company was formerly known as Renhe Commercial Holdings Company Limited and changed its name to China Dili Group in June 2019. China Dili Group was founded in 2002 and is based in Wanchai, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "S1H1.MU": {
        "short_name": "SOUNDWILL HLDGS  HD-,10",
        "long_name": "Soundwill Holdings Limited",
        "summary": "Soundwill Holdings Limited, an investment holding company, provides property development, property leasing, and building management services in the People's Republic of China. The company develops medium to high end commercial and residential, as well as industrial properties; and offers building management, repair and maintenance services to large-scale commercial buildings, and small and medium sized residential estates. It also invests in and leases commercial, office, and residential buildings, as well as advertising and mini-storage spaces; and provides property assembly and sales services. The company was founded in 1978 and is headquartered in Causeway Bay, Hong Kong. Soundwill Holdings Limited is a subsidiary of Ko Bee Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Causeway Bay"
    },
    "SHG.F": {
        "short_name": "SUN HUNG KAI PTIES",
        "long_name": "Sun Hung Kai Properties Limited",
        "summary": "Sun Hung Kai Properties Limited develops and invests in properties for sale and rent in Hong Kong, Mainland China, and internationally. It develops and sells properties, including residential estates, offices, shopping malls, industrial buildings, and hotels and serviced suites. As of June 30, 2020, the company's land bank comprised 57.5 million square feet of gross floor area in Hong Kong; and 68.1 million square feet of gross floor area in Mainland China. It also provides property management services; construction-related services, including landscaping, electrical and fire prevention systems, and construction plant and machinery leasing; and insurance products to individuals and businesses comprising householder's comprehensive, fire, employees' compensation, travel, personal accident, motor vehicles, contractors' all risks, third party liability, and property all risks. In addition, the company offers voice, multimedia, and mobile broadband services; and data center services, including infrastructure, facility management, server co-location, and other value-added services. Further, it manages car parks, tunnels, bridges, and toll roads; offers transport facilities for private and the public sectors; operates an expressway; provides public bus transportation services; and offers airport freight forwarding and aviation support services. Additionally, the company provides container handling and storage, container freight station, and other port-related services; operates department stores and supermarkets; and offers mortgage and other loan financing facilities, as well as asset and project management, architectural and engineering, cleaning, and secretarial services. It also engages in club and road management activities. The company was formerly known as Sun Hung Kai (Holdings) Limited and changed its name to Sun Hung Kai Properties Limited in March 1973. Sun Hung Kai Properties Limited was incorporated in 1972 and is based in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "SHMAY": {
        "short_name": "SHIMAO GROUP HOLDINGS LTD UNSP ",
        "long_name": "Shimao Group Holdings Limited",
        "summary": "Shimao Group Holdings Limited, an investment holding company, engages in the property development and investment activities in the People's Republic of China. The company develops residential and commercial properties; and operates hotels and shopping malls. It is also involved in the trading of construction materials; and property management activities. The company was formerly known as Shimao Property Holdings Limited and changed its name to Shimao Group Holdings Limited in May 2020. Shimao Group Holdings Limited was incorporated in 2004 and is based in Hong Kong, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "SHS.F": {
        "short_name": "SHENZHEN INV.(CONS.)",
        "long_name": "Shenzhen Investment Limited",
        "summary": "Shenzhen Investment Limited, together with its subsidiaries, invests in, develops, and manages real estate properties in Mainland China. The company operates through five segments: Property Development, Property Investment, Property Management, Manufacture, and Others. It invests in and develops residential and commercial properties; invests in commercial properties for rental income; manages properties; and manufactures and sells industrial and commercial products. The company also manufactures and sells aluminum alloy, agricultural, and LCD products; provides construction services; and operates hotels and warehouses. The company was founded in 1992 and is based in Tsim Sha Tsui, Hong Kong. Shenzhen Investment Limited is a subsidiary of Shum Yip Holdings Company Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "SIOPF": {
        "short_name": "SHIMAO GROUP HOLDINGS LTD",
        "long_name": "Shimao Group Holdings Limited",
        "summary": "Shimao Group Holdings Limited, an investment holding company, engages in the property development and investment activities in the People's Republic of China. The company develops residential and commercial properties; and operates hotels and shopping malls. It is also involved in the trading of construction materials; and property management activities. The company was formerly known as Shimao Property Holdings Limited and changed its name to Shimao Group Holdings Limited in May 2020. Shimao Group Holdings Limited was incorporated in 2004 and is based in Hong Kong, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "SNLAF": {
        "short_name": "SINO LAND CO",
        "long_name": "Sino Land Company Limited",
        "summary": "Sino Land Company Limited, an investment holding company, invests in, develops, manages, and trades in properties. It operates through six segments: Property Sales, Property Rental, Property Management and Other Services, Hotel Operations, Investments in Securities, and Financing. The company's property portfolio includes office, industrial, and residential buildings, as well as shopping malls, car parks, and hotels. It also provides cleaning, building construction and management, financing, administration, security, mortgage loan financing, secretarial, management, project management, securities investment, living, consultancy, and deposit placing services, as well as operates hotels. As of June 30, 2020, the company had a land bank of approximately 22.3 million square feet of attributable floor area in Mainland China, Hong Kong, Singapore, and Sydney. The company was incorporated in 1971 and is based in Tsim Sha Tsui, Hong Kong. Sino Land Company Limited is a subsidiary of Tsim Sha Tsui Properties Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "SNLAY": {
        "short_name": "SINO LAND CO",
        "long_name": "Sino Land Company Limited",
        "summary": "Sino Land Company Limited, an investment holding company, invests in, develops, manages, and trades in properties. It operates through six segments: Property Sales, Property Rental, Property Management and Other Services, Hotel Operations, Investments in Securities, and Financing. The company's property portfolio includes office, industrial, and residential buildings, as well as shopping malls, car parks, and hotels. It also provides cleaning, building construction and management, financing, administration, security, mortgage loan financing, secretarial, management, project management, securities investment, living, consultancy, and deposit placing services, as well as operates hotels. As of June 30, 2020, the company had a land bank of approximately 22.3 million square feet of attributable floor area in Mainland China, Hong Kong, Singapore, and Sydney. The company was incorporated in 1971 and is based in Tsim Sha Tsui, Hong Kong. Sino Land Company Limited is a subsidiary of Tsim Sha Tsui Properties Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "SNLKF": {
        "short_name": "SINOLINK WORLDWIDE HLDGS",
        "long_name": "Sinolink Worldwide Holdings Limited",
        "summary": "Sinolink Worldwide Holdings Limited, an investment holding company, invests in, develops, manages, and sells real estate properties in the People's Republic of China. It operates in four segments: Property Development, Property Management, Property Investment, and Financing Services. The company develops and sells residential properties; and invests in commercial and car parking properties. It also provides property, facilities, and project management services; finance leasing and loan financing, business factoring, administrative service supporting, and insurance services; and consultancy services in relation to information, multimedia, and communication technologies. In addition, the company engages in hotel operations. Sinolink Worldwide Holdings Limited was founded in 1992 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "SNO.F": {
        "short_name": "SINO LD CO.",
        "long_name": "Sino Land Company Limited",
        "summary": "Sino Land Company Limited, an investment holding company, invests in, develops, manages, and trades in properties. It operates through six segments: Property Sales, Property Rental, Property Management and Other Services, Hotel Operations, Investments in Securities, and Financing. The company's property portfolio includes office, industrial, and residential buildings, as well as shopping malls, car parks, and hotels. It also provides cleaning, building construction and management, financing, administration, security, mortgage loan financing, secretarial, management, project management, securities investment, living, consultancy, and deposit placing services, as well as operates hotels. As of June 30, 2020, the company had a land bank of approximately 22.3 million square feet of attributable floor area in Mainland China, Hong Kong, Singapore, and Sydney. The company was incorporated in 1971 and is based in Tsim Sha Tsui, Hong Kong. Sino Land Company Limited is a subsidiary of Tsim Sha Tsui Properties Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Tsim Sha Tsui"
    },
    "SUHJF": {
        "short_name": "SUN HUNG KAI PROPERTIES LTD",
        "long_name": "Sun Hung Kai Properties Limited",
        "summary": "Sun Hung Kai Properties Limited develops and invests in properties for sale and rent in Hong Kong, Mainland China, and internationally. It develops and sells properties, including residential estates, offices, shopping malls, industrial buildings, and hotels and serviced suites. As of June 30, 2020, the company's land bank comprised 57.5 million square feet of gross floor area in Hong Kong; and 68.1 million square feet of gross floor area in Mainland China. It also provides property management services; construction-related services, including landscaping, electrical and fire prevention systems, and construction plant and machinery leasing; and insurance products to individuals and businesses comprising householder's comprehensive, fire, employees' compensation, travel, personal accident, motor vehicles, contractors' all risks, third party liability, and property all risks. In addition, the company offers voice, multimedia, and mobile broadband services; and data center services, including infrastructure, facility management, server co-location, and other value-added services. Further, it manages car parks, tunnels, bridges, and toll roads; offers transport facilities for private and the public sectors; operates an expressway; provides public bus transportation services; and offers airport freight forwarding and aviation support services. Additionally, the company provides container handling and storage, container freight station, and other port-related services; operates department stores and supermarkets; and offers mortgage and other loan financing facilities, as well as asset and project management, architectural and engineering, cleaning, and secretarial services. It also engages in club and road management activities. The company was formerly known as Sun Hung Kai (Holdings) Limited and changed its name to Sun Hung Kai Properties Limited in March 1973. Sun Hung Kai Properties Limited was incorporated in 1972 and is based in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "SUHJY": {
        "short_name": "SUN HUNG KAI PROPERTIES LTD",
        "long_name": "Sun Hung Kai Properties Limited",
        "summary": "Sun Hung Kai Properties Limited develops and invests in properties for sale and rent in Hong Kong, Mainland China, and internationally. It develops and sells properties, including residential estates, offices, shopping malls, industrial buildings, and hotels and serviced suites. As of June 30, 2020, the company's land bank comprised 57.5 million square feet of gross floor area in Hong Kong; and 68.1 million square feet of gross floor area in Mainland China. It also provides property management services; construction-related services, including landscaping, electrical and fire prevention systems, and construction plant and machinery leasing; and insurance products to individuals and businesses comprising householder's comprehensive, fire, employees' compensation, travel, personal accident, motor vehicles, contractors' all risks, third party liability, and property all risks. In addition, the company offers voice, multimedia, and mobile broadband services; and data center services, including infrastructure, facility management, server co-location, and other value-added services. Further, it manages car parks, tunnels, bridges, and toll roads; offers transport facilities for private and the public sectors; operates an expressway; provides public bus transportation services; and offers airport freight forwarding and aviation support services. Additionally, the company provides container handling and storage, container freight station, and other port-related services; operates department stores and supermarkets; and offers mortgage and other loan financing facilities, as well as asset and project management, architectural and engineering, cleaning, and secretarial services. It also engages in club and road management activities. The company was formerly known as Sun Hung Kai (Holdings) Limited and changed its name to Sun Hung Kai Properties Limited in March 1973. Sun Hung Kai Properties Limited was incorporated in 1972 and is based in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "SW9.F": {
        "short_name": "SWIRE PROPERTIES LTD",
        "long_name": "Swire Properties Limited",
        "summary": "Swire Properties Limited, together with its subsidiaries, develops, owns, and operates mixed-use, primarily commercial properties in Hong Kong, Mainland China, the United States, and internationally. It operates through three segments: Property Investment, Property Trading, and Hotels. The company is involved in the development, leasing, and management of commercial, retail, and residential properties; development, construction, and sale of residential apartments; and operation of hotels. It also provides financial and real estate agency services. The company was incorporated in 1972 and is based in Hong Kong, Hong Kong. Swire Properties Limited is a subsidiary of Swire Pacific Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "SWPFF": {
        "short_name": "SWIRE PROPERTIES LTD",
        "long_name": "Swire Properties Limited",
        "summary": "Swire Properties Limited, together with its subsidiaries, develops, owns, and operates mixed-use, primarily commercial properties in Hong Kong, Mainland China, the United States, and internationally. It operates through three segments: Property Investment, Property Trading, and Hotels. The company is involved in the development, leasing, and management of commercial, retail, and residential properties; development, construction, and sale of residential apartments; and operation of hotels. It also provides financial and real estate agency services. The company was incorporated in 1972 and is based in Hong Kong, Hong Kong. Swire Properties Limited is a subsidiary of Swire Pacific Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Hong Kong"
    },
    "TIACF": {
        "short_name": "TIAN AN CHINA INVESTMENTS CO",
        "long_name": "Tian An China Investments Company Limited",
        "summary": "Tian An China Investments Company Limited, an investment holding company, invests in, develops, and manages properties in the People's Republic of China, Hong Kong, the United Kingdom, and Australia. It operates through Property Development, Property Investment, and Other Operations segments. The company develops apartments, villas, office buildings, and commercial properties. It is also involved in the golf course and club house operations, and hotel management activities. In addition, the company provides property leasing and estate management, car parking space, securities dealing, and money lending services. Tian An China Investments Company Limited was founded in 1986 and is based in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "TNY1.SG": {
        "short_name": "China Merchants Land Ltd. Regis",
        "long_name": "China Merchants Land Limited",
        "summary": "China Merchants Land Limited, an investment holding company, engages in the investment, development, management, lease, and sale of properties. The company operates through Properties and Asset Management segments. Its property portfolio includes residential properties; and residential and commercial complex properties, such as apartments, villas, offices, retail shops, etc. The company also offers asset management services for office premises and shopping malls. As of December 31, 2019, its portfolio of property development projects includes 33 projects in Foshan, Guangzhou, Chongqing, Nanjing, Jurong, and Xi'an; and a land bank of approximately 5,954,429 square metres. The company was formerly known as Tonic Industries Holdings Limited. China Merchants Land Limited was founded in 1997 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "USH.F": {
        "short_name": "WING TAI PROPE.LTD HD-,50",
        "long_name": "Wing Tai Properties Limited",
        "summary": "Wing Tai Properties Limited, an investment holding company, invests in, develops, and manages properties in Hong Kong, the United Kingdom, the People's Republic of China, Singapore, and internationally. The company operates through Property Development, Property Investment and Management, Hospitality Investment and Management, and Others divisions. It develops and manages residential and commercial properties. The company's investment properties include office buildings, industrial buildings, car parking spaces, retail spaces, and serviced apartments. It is also involved in the hospitality management, investment, licensing, treasury investment, financing, and property agency activities. The company was formerly known as USI Holdings Limited and changed its name to Wing Tai Properties Limited in 2010. Wing Tai Properties Limited is headquartered in Kwun Tong, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "V2U.F": {
        "short_name": "RYKADAN CAPITAL LTD.HD-01",
        "long_name": "Rykadan Capital Limited",
        "summary": "Rykadan Capital Limited, an investment holding company, engages in the property investment and development business in Hong Kong, the People's Republic of China, the United States, and internationally. The company develops and holds residential, commercial, and industrial properties; and leases premises. It also distributes construction and interior decorative materials, such as quartz and marble-based engineered stone composite surface products. In addition, it provides asset, investment, and fund management services; and project, property, and corporate management services. The company was formerly known as Sundart International Holdings Limited and changed its name to Rykadan Capital Limited in September 2012. Rykadan Capital Limited was founded in 1986 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Kwun Tong"
    },
    "WARFF": {
        "short_name": "WHARF(HLDGS)",
        "long_name": "Wharf (Holdings) Limited",
        "summary": "Founded in 1886 with Hong Kong as its base, The Wharf (Holdings) Limited (Stock code: 0004) is the 17th company incorporated in Hong Kong and a premier company with a long history. As one of the 30 constituent stocks in the original Hang Seng Index since more than 50 years ago, Wharf is among the top local blue chips that is most actively traded and widely held. Backed by a long standing mission of Â\u0093Building for TomorrowÂ\u0094 and a proven track record in management and execution, the Group has produced consistent and productive performance over the years. Subsequent to the separate listing of Wharf Real Estate Investment Company Limited in November 2017 which focuses on its Hong Kong investment properties portfolio, The Wharf (Holdings) Limited's businesses are largely property-related, comprising Investment Properties, Hotels and Development Properties in Hong Kong and Mainland China. Other businesses include Logistics through Modern Terminals and Hong Kong Air Cargo Terminals. Wharf's Peak Portfolio redefines the concept of luxury living with a collection of the rare and most prestigious residences, epitomising a unique and exclusive lifestyle at the most sought-after addresses in town. Besides the highly-acclaimed Mount Nicholson, other properties under development include 1 Plantation Road, 11 Plantation Road and 77 Peak Road. Besides The Peak Portfolio, the development pipeline of Hong Kong Properties also includes the Kowloon Tong Residential Project and projects in Kowloon East. In the Mainland, Wharf spearheads its investment properties with the International Finance Square (IFS) series at the very heart of CBD or new CBD in high potential cities including Changsha, Chengdu, Chongqing, Suzhou and Wuxi. IFS developments are positioned as trendsetting landmarks with unrivalled locations, superior planning and design, retailer and shopper critical mass, as well as top-notch retail management. Changsha IFS, 2018's newest to the collection, and Chengdu IFS opened in 2014 are comparable to Harbour City in Hong Kong in scale and prominence. The boutique Chongqing IFS, featuring the largest cluster of first-tier brands in Chongqing, was opened in 2017. The Group continues to adopt a selective land acquisition policy with strategic focus on key Tier 1 or 2 cities in order to secure high quality land bank with returns. The development property landbank at the end of June 2019 totalled 3.6 million square metres. Wharf Hotels manages an expanding portfolio of 17 hotels in Asia, spearheaded by a prominent Niccolo brand in recent years. The Wharf Hotels owns four contemporary, urban, chic Niccolo hotels (including The Murray, Hong Kong and Niccolo Changsha) and manages 13 Marco Polo hotels in Hong Kong, Mainland China and the Philippines. Niccolo Suzhou is the newest addition under development and is scheduled to open in 2021. The Group also owns and operates Modern Terminals and Hong Kong Air Cargo Terminals, key components in Hong Kong's success as a hub for international trade and international transportation for decades. CME2 is the Group's long-term investment, representing a strategic initiative of reinvesting capital and profit released from the CME1 exit in Hong Kong in a progressive new economy infrastructure CME2 arena that covers much larger markets with greater growth potential. Â\u0093Building for TomorrowÂ\u0094 also extends to Wharf's Â\u0093Business-in-CommunityÂ\u0094 (Â\u0093BICÂ\u0094) pursuit. With the flagship school improvement programme Â\u0093Project WecanÂ\u0094 growing from strength to strength, the Group supports a series of BIC initiatives including Wu Zhi Qiao (Bridge to China) Charitable Foundation, Shanghai International Tower-running Grand Prix and Operation Panda with an aim of promoting BIC and to bring benefits to different segments of society.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "WARFY": {
        "short_name": "WHARF(HLDGS)",
        "long_name": "Wharf (Holdings) Limited",
        "summary": "Founded in 1886 with Hong Kong as its base, The Wharf (Holdings) Limited (Stock code: 0004) is the 17th company incorporated in Hong Kong and a premier company with a long history. As one of the 30 constituent stocks in the original Hang Seng Index since more than 50 years ago, Wharf is among the top local blue chips that is most actively traded and widely held. Backed by a long standing mission of Â\u0093Building for TomorrowÂ\u0094 and a proven track record in management and execution, the Group has produced consistent and productive performance over the years. Subsequent to the separate listing of Wharf Real Estate Investment Company Limited in November 2017 which focuses on its Hong Kong investment properties portfolio, The Wharf (Holdings) Limited's businesses are largely property-related, comprising Investment Properties, Hotels and Development Properties in Hong Kong and Mainland China. Other businesses include Logistics through Modern Terminals and Hong Kong Air Cargo Terminals. Wharf's Peak Portfolio redefines the concept of luxury living with a collection of the rare and most prestigious residences, epitomising a unique and exclusive lifestyle at the most sought-after addresses in town. Besides the highly-acclaimed Mount Nicholson, other properties under development include 1 Plantation Road, 11 Plantation Road and 77 Peak Road. Besides The Peak Portfolio, the development pipeline of Hong Kong Properties also includes the Kowloon Tong Residential Project and projects in Kowloon East. In the Mainland, Wharf spearheads its investment properties with the International Finance Square (IFS) series at the very heart of CBD or new CBD in high potential cities including Changsha, Chengdu, Chongqing, Suzhou and Wuxi. IFS developments are positioned as trendsetting landmarks with unrivalled locations, superior planning and design, retailer and shopper critical mass, as well as top-notch retail management. Changsha IFS, 2018's newest to the collection, and Chengdu IFS opened in 2014 are comparable to Harbour City in Hong Kong in scale and prominence. The boutique Chongqing IFS, featuring the largest cluster of first-tier brands in Chongqing, was opened in 2017. The Group continues to adopt a selective land acquisition policy with strategic focus on key Tier 1 or 2 cities in order to secure high quality land bank with returns. The development property landbank at the end of June 2019 totalled 3.6 million square metres. Wharf Hotels manages an expanding portfolio of 17 hotels in Asia, spearheaded by a prominent Niccolo brand in recent years. The Wharf Hotels owns four contemporary, urban, chic Niccolo hotels (including The Murray, Hong Kong and Niccolo Changsha) and manages 13 Marco Polo hotels in Hong Kong, Mainland China and the Philippines. Niccolo Suzhou is the newest addition under development and is scheduled to open in 2021. The Group also owns and operates Modern Terminals and Hong Kong Air Cargo Terminals, key components in Hong Kong's success as a hub for international trade and international transportation for decades. CME2 is the Group's long-term investment, representing a strategic initiative of reinvesting capital and profit released from the CME1 exit in Hong Kong in a progressive new economy infrastructure CME2 arena that covers much larger markets with greater growth potential. Â\u0093Building for TomorrowÂ\u0094 also extends to Wharf's Â\u0093Business-in-CommunityÂ\u0094 (Â\u0093BICÂ\u0094) pursuit. With the flagship school improvement programme Â\u0093Project WecanÂ\u0094 growing from strength to strength, the Group supports a series of BIC initiatives including Wu Zhi Qiao (Bridge to China) Charitable Foundation, Shanghai International Tower-running Grand Prix and Operation Panda with an aim of promoting BIC and to bring benefits to different segments of society.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "WHA.F": {
        "short_name": "WHARF (HLDGS) LTD",
        "long_name": "Wharf (Holdings) Limited",
        "summary": "Founded in 1886 with Hong Kong as its base, The Wharf (Holdings) Limited (Stock code: 0004) is the 17th company incorporated in Hong Kong and a premier company with a long history. As one of the 30 constituent stocks in the original Hang Seng Index since more than 50 years ago, Wharf is among the top local blue chips that is most actively traded and widely held. Backed by a long standing mission of Â\u0093Building for TomorrowÂ\u0094 and a proven track record in management and execution, the Group has produced consistent and productive performance over the years. Subsequent to the separate listing of Wharf Real Estate Investment Company Limited in November 2017 which focuses on its Hong Kong investment properties portfolio, The Wharf (Holdings) Limited's businesses are largely property-related, comprising Investment Properties, Hotels and Development Properties in Hong Kong and Mainland China. Other businesses include Logistics through Modern Terminals and Hong Kong Air Cargo Terminals. Wharf's Peak Portfolio redefines the concept of luxury living with a collection of the rare and most prestigious residences, epitomising a unique and exclusive lifestyle at the most sought-after addresses in town. Besides the highly-acclaimed Mount Nicholson, other properties under development include 1 Plantation Road, 11 Plantation Road and 77 Peak Road. Besides The Peak Portfolio, the development pipeline of Hong Kong Properties also includes the Kowloon Tong Residential Project and projects in Kowloon East. In the Mainland, Wharf spearheads its investment properties with the International Finance Square (IFS) series at the very heart of CBD or new CBD in high potential cities including Changsha, Chengdu, Chongqing, Suzhou and Wuxi. IFS developments are positioned as trendsetting landmarks with unrivalled locations, superior planning and design, retailer and shopper critical mass, as well as top-notch retail management. Changsha IFS, 2018's newest to the collection, and Chengdu IFS opened in 2014 are comparable to Harbour City in Hong Kong in scale and prominence. The boutique Chongqing IFS, featuring the largest cluster of first-tier brands in Chongqing, was opened in 2017. The Group continues to adopt a selective land acquisition policy with strategic focus on key Tier 1 or 2 cities in order to secure high quality land bank with returns. The development property landbank at the end of June 2019 totalled 3.6 million square metres. Wharf Hotels manages an expanding portfolio of 17 hotels in Asia, spearheaded by a prominent Niccolo brand in recent years. The Wharf Hotels owns four contemporary, urban, chic Niccolo hotels (including The Murray, Hong Kong and Niccolo Changsha) and manages 13 Marco Polo hotels in Hong Kong, Mainland China and the Philippines. Niccolo Suzhou is the newest addition under development and is scheduled to open in 2021. The Group also owns and operates Modern Terminals and Hong Kong Air Cargo Terminals, key components in Hong Kong's success as a hub for international trade and international transportation for decades. CME2 is the Group's long-term investment, representing a strategic initiative of reinvesting capital and profit released from the CME1 exit in Hong Kong in a progressive new economy infrastructure CME2 arena that covers much larger markets with greater growth potential. Â\u0093Building for TomorrowÂ\u0094 also extends to Wharf's Â\u0093Business-in-CommunityÂ\u0094 (Â\u0093BICÂ\u0094) pursuit. With the flagship school improvement programme Â\u0093Project WecanÂ\u0094 growing from strength to strength, the Group supports a series of BIC initiatives including Wu Zhi Qiao (Bridge to China) Charitable Foundation, Shanghai International Tower-running Grand Prix and Operation Panda with an aim of promoting BIC and to bring benefits to different segments of society.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "WRFRF": {
        "short_name": "WHARF REAL ESTATE INVESTMENT CO",
        "long_name": "Wharf Real Estate Investment Company Limited",
        "summary": "Wharf Real Estate Investment Company Limited, an investment holding company, invests in, develops, constructs, owns, operates, trades in, and sells real estate properties in Hong Kong, Mainland China, and Singapore. The company operates through Investment Property, Development Property, Hotels, and Investment segments. It primarily operates Harbour City, a commercial space comprising offices, retail shops, serviced apartments, hotels and club, and car parking spaces; and Times Square, a retail space that consists of office and car parking spaces. The company also operates Wheelock House and Crawford House commercial properties; The Murray, a luxury hotel that consists of 336 rooms; Plaza Hollywood, a shopping mall with retail outlets, restaurants, and a stadium housing six-screen cinema multiplex; The Star Ferry, which provides a ferry service between Tsim Sha Tsui and Wan Chai; and Wheelock Place and Scotts Square mall. In addition, it offers leasing, finance, and management services; and accepts bank deposits. Wharf Real Estate Investment Company Limited was incorporated in 2017 and is headquartered in Kowloon, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Kowloon"
    },
    "XUN.F": {
        "short_name": "SHUN TAK HLDGS",
        "long_name": "Shun Tak Holdings Limited",
        "summary": "Shun Tak Holdings Limited, an investment holding company, engages in property, transportation, hospitality, and investment businesses in Hong Kong, Macau, Mainland China, and internationally. It develops and sells property; markets and leases retail, office, and residential properties; offers property management services for residential and commercial properties; and provides property cleaning, laundry, maintenance and repair, project works, hygiene, pest control, waste management, legal advice, and financial management services. The company also offers passenger sea and land transportation services across destinations within the Pearl River Delta connecting cities, such as Hong Kong, Macau, Zhuhai, Shenzhen, and Shekou under the TurboJET brand name. In addition, it operates hotels and golf clubs, entertainment attractions, and travel consultancies, as well as offers MICE and transportation services; invests in gaming concessionaires; and operates toy stores under the Â\u0093ToysÂ\u0091R'UsÂ\u0094 name. Additionally, the company provides financing; hospitality management and auxiliary; and travel agency services. Shun Tak Holdings Limited was founded in 1972 and is based in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    },
    "YSG.F": {
        "short_name": "SILVER GR.INTL HLGDS GR.",
        "long_name": "Silver Grant International Holdings Group Limited",
        "summary": "Silver Grant International Holdings Group Limited, an investment holding company, engages in the property investment and securities trading businesses in the People's Republic of China. It operates through Investments and Property Leasing segments. The company primarily invests in and develops residential and commercial properties, as well as financial assets. It also engages in the environmental conservation and renewable energy business; and property rental business. The company was formerly known as Silver Grant International Industries Limited and changed its name to Silver Grant International Holdings Group Limited in May 2019. The company is based in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "YUEXF": {
        "short_name": "YUEXIU PROPERTY CO LTD",
        "long_name": "Yuexiu Property Company Limited",
        "summary": "Yuexiu Property Company Limited, together with its subsidiaries, develops, sells, and manages properties primarily in Mainland China and Hong Kong. It operates through Property Development, Property Management, Property Investment, and Other segments. The company is also involved in holding investment properties. In addition, it offers property development and management consulting, property rental, decoration and design, project management, real estate and property agency, investment consulting, metal manufacturing, information consulting, car parking management, financial, building management, commercial, greening, construction, and trade finance services. As of December 31, 2020, the company owned investment properties under lease of approximately 774,000 sq.m. comprising offices, commercial properties, car parks, and others; and a total landbank of approximately 24.54 million sq.m. The company was formerly known as Guangzhou Investment Company Limited. The company was incorporated in 1992 and is based in Wanchai, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "city": "Wan Chai"
    },
    "ZYW.F": {
        "short_name": "CHINA PROP.GRP LTD HD-,10",
        "long_name": "China Properties Group Limited",
        "summary": "China Properties Group Limited, an investment holding company, primarily engages in the property development and investment activities in the People's Republic of China. It operates through Property Development, Property Investment, and Others segments. The company develops, sells, and leases properties in Shanghai and Chongqing; and offers property management services. It primarily develops middle-class residential projects and theme shopping street developments for retail, residential, entertainment, cultural, and recreational users. The company is headquartered in Central, Hong Kong. China Properties Group Limited is a subsidiary of Hillwealth Holdings Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "city": "Central"
    }
}