{
    "0010.HK": {
        "short_name": "HANG LUNG GROUP",
        "long_name": "Hang Lung Group Limited",
        "summary": "Hang Lung Group Limited, an investment holding company, operates as a property developer in Hong Kong and Mainland China. The company operates through Property Leasing and Property Sales segments. It develops properties for sale and lease, such as large-scale commercial, office, and residential developments. The company also develops various properties, including shopping mall, office, residential, serviced apartments, and carparks. Its investment properties portfolio includes Grand Gateway 66, a commercial, office, and residential complex, as well as Plaza 66, a commercial and office complex in Shanghai; Palace 66 and Forum 66 in Shenyang; Parc 66 in Jinan; Center 66 in Wuxi; Riverside 66 in Tianjin; Olympia 66 in Dalian; Spring City 66 in Kunming; Heartland 66 in Wuhan; and Westlake 66. In addition, the company offers car park and property management, securities trading, financial, project management, and property agency services, as well as operates and manages apartment. Hang Lung Group Limited was incorporated in 1960 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hanglung.com/en-US/group/home",
        "full_time_employees": 4500
    },
    "0050.HK": {
        "short_name": "HK FERRY (HOLD)",
        "long_name": "Hong Kong Ferry (Holdings) Company Limited",
        "summary": "Hong Kong Ferry (Holdings) Company Limited, an investment holding company, primarily engages in the property development and investment business in Hong Kong. The company operates in four segments: Property Development; Property Investment; Ferry, Shipyard and Related Operations; and Securities Investment. It develops and sells residential units, commercial arcades, and car parking spaces; invests in and leases real estate properties; and offers property management services. The company also provides dangerous goods vehicular ferry, and ship repair and maintenance services, as well as sells goods on cruise vessels. In addition, it invests in debt and equity securities; provides property finance; and engages in the trading and floating restaurant business. The company was formerly known as The Hongkong and Yaumati Ferry Company Limited and changed its name to Hong Kong Ferry (Holdings) Company Limited in 1989. Hong Kong Ferry (Holdings) Company Limited was founded in 1923 and is based in Tsing Yi, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsing Yi",
        "zipcode": null,
        "website": "http://www.hkf.com",
        "full_time_employees": 207
    },
    "0120.HK": {
        "short_name": "COSMOPOL INT'L",
        "long_name": "Cosmopolitan International Holdings Limited",
        "summary": "Cosmopolitan International Holdings Limited, an investment holding company, develops and invests in real estate properties in Hong Kong and Mainland China. It operates through two segments, Property Development and Investment, and Financial Assets Investments. The company develops and sells properties; leases properties; and trades in financial assets, as well as invests in other financial assets. Cosmopolitan International Holdings Limited also provides financing and development consultancy services. The company was founded in 1991 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.cosmoholdings.com",
        "full_time_employees": null
    },
    "0242.HK": {
        "short_name": "SHUN TAK HOLD",
        "long_name": "Shun Tak Holdings Limited",
        "summary": "Shun Tak Holdings Limited, an investment holding company, engages in property, transportation, hospitality, and investment businesses in Hong Kong, Macau, Mainland China, and internationally. It develops and sells property; markets and leases retail, office, and residential properties; offers property management services for residential and commercial properties; and provides property cleaning, laundry, maintenance and repair, project works, hygiene, pest control, waste management, legal advice, and financial management services. The company also offers passenger sea and land transportation services across destinations within the Pearl River Delta connecting cities, such as Hong Kong, Macau, Zhuhai, Shenzhen, and Shekou under the TurboJET brand name. In addition, it operates hotels and golf clubs, entertainment attractions, and travel consultancies, as well as offers MICE and transportation services; invests in gaming concessionaires; and operates toy stores under the Â\u0093ToysÂ\u0091R'UsÂ\u0094 name. Additionally, the company provides financing; hospitality management and auxiliary; and travel agency services. Shun Tak Holdings Limited was founded in 1972 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.shuntakgroup.com",
        "full_time_employees": 1600
    },
    "0258.HK": {
        "short_name": "TOMSON GROUP",
        "long_name": "Tomson Group Limited",
        "summary": "Tomson Group Limited, an investment holding company, engages in property development and investment, hospitality and leisure, securities trading, PVC, and media and entertainment investment businesses in Hong Kong, Macau, and Mainland China. It develops commercial, residential, and industrial properties, as well as offers property management services. The company also operates Tomson Shanghai Pudong golf club located in Huamu District of Pudong, Shanghai; and holds a 50% interest in a hotel situated in Lujiazui of Pudong. In addition, it manufactures and trades in PVC pipes and fittings; and provides nominee and secretarial, and administrative services. Further, the company engages in the investment and production of live entertainment shows; film distribution business; and trademark holding activities. Tomson Group Limited is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.tomson.com.hk",
        "full_time_employees": null
    },
    "0480.HK": {
        "short_name": "HKR INT'L",
        "long_name": "HKR International Limited",
        "summary": "HKR International Limited, an investment holding company, invests in, develops, and manages real estate properties in Hong Kong, Macau, Mainland China, Japan, and South East Asia. It operates in five segments: Property Development, Property Investment, Services Provided, Hotel Operations, and Healthcare. The company primarily develops and manages residential, commercial, and industrial properties, as well as leisure projects. It also owns, operates, and manages hotels; and a healthcare service network, including chronic disease management and integrated medical centers, Chinese medicine centers, dental clinics, medical diagnostic centers, and medical network services. In addition, the company offers transportation services in Discovery Bay, including ferry, land transport, and tunnel operations; operates clubs; and invests in securities. Further, HKR International Limited provides cancer treatment and diagnostic imaging, commercial leasing agency, property agency, bus and garage, dental health and care, and project management services; corporate consultancy services to healthcare operating units; and financial services to first hand purchasers of properties in Discovery Bay, as well as trades in medical and dental equipment and supplies. Additionally, the company engages in the operation of a shipyard and road tunnel; and diabetes and endocrine disorders clinics, as well as acts as an estate manager and principal lessee of communication network in Discovery Bay. HKR International Limited was founded in 1977 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hkri.com",
        "full_time_employees": 1655
    },
    "0535.HK": {
        "short_name": "GEMDALE PPT",
        "long_name": "Gemdale Properties and Investment Corporation Limited",
        "summary": "Gemdale Properties and Investment Corporation Limited, an investment holding company, engages in the property investment, development, and management activities in Mainland China. The company operates through Property Development, Property Investment and Management, and Micro-Finance segments. It develops and sells residential and commercial properties; and invests in and manages business parks and commercial properties, as well as offers financial services to property buyers and small businesses. The company was formerly known as Frasers Property (China) Limited and changed its name to Gemdale Properties and Investment Corporation Limited in March 2013. Gemdale Properties and Investment Corporation Limited was incorporated in 1989 and is headquartered in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.gemdalepi.com",
        "full_time_employees": 3069
    },
    "0760.HK": {
        "short_name": "TALENT PPT GP",
        "long_name": "Talent Property Group Limited",
        "summary": "Talent Property Group Limited, an investment holding company, invests in, develops, and manages real estate properties in the People's Republic of China. It also provides cleaning services. The company was formerly known as Tomorrow International Holdings Limited and changed its name to Talent Property Group Limited in May 2011. The company was founded in 1995 and is based in Tsim Sha Tsui East, Hong Kong. Talent Property Group Limited is a subsidiary of Talent Trend Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.760hk.com",
        "full_time_employees": 216
    },
    "0878.HK": {
        "short_name": "SOUNDWILL HOLD",
        "long_name": "Soundwill Holdings Limited",
        "summary": "Soundwill Holdings Limited, an investment holding company, provides property development, property leasing, and building management services in the People's Republic of China. The company develops medium to high end commercial and residential, as well as industrial properties; and offers building management, repair and maintenance services to large-scale commercial buildings, and small and medium sized residential estates. It also invests in and leases commercial, office, and residential buildings, as well as advertising and mini-storage spaces; and provides property assembly and sales services. The company was founded in 1978 and is headquartered in Causeway Bay, Hong Kong. Soundwill Holdings Limited is a subsidiary of Ko Bee Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.soundwill.com.hk",
        "full_time_employees": 316
    },
    "0910.HK": {
        "short_name": "CHINA SANDI",
        "long_name": "China Sandi Holdings Limited",
        "summary": "China Sandi Holdings Limited, an investment holding company, engages in the investment and development of properties in the People's Republic of China. The company operates in Property Development, Property Investment, and Hotel Operation segments. It is also involved in the leasing of investment properties and providing property management services. In addition, the company provides hotel accommodation and catering services. Further, it engages in the securities trading. It owns and leases shopping malls, hotels, office units, commercial units, kindergartens, and car parking facilities. The Company was formerly known as China Grand Forestry Green Resources Group Limited and changed its name to China Sandi Holdings Limited in October 2012. China Sandi Holdings Limited is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": "168-200",
        "website": "http://www.chinasandi.com.hk",
        "full_time_employees": 702
    },
    "1125.HK": {
        "short_name": "LAI FUNG HOLD",
        "long_name": "Lai Fung Holdings Limited",
        "summary": "Lai Fung Holdings Limited, an investment holding company, engages in the property development and investment businesses in Mainland China. It operates through four segments: The Property Development, The Property Investment, The Hotel and Serviced Apartment Operation, and The Theme Park Operation. The company invests in and develops hotels and serviced apartments, as well as residential, office, and commercial properties; and invests in, develops, and operates cultural, leisure, and entertainment and related facilities. It is also involved in the property and building management business. In addition, the company operates theme parks. The company was incorporated in 1997 and is headquartered in Central, Hong Kong. Lai Fung Holdings Limited is a subsidiary of Lai Sun Development Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.laisun.com/lai-fung-holdings/en-US",
        "full_time_employees": 2000
    },
    "1168.HK": {
        "short_name": "SINOLINK HOLD",
        "long_name": "Sinolink Worldwide Holdings Limited",
        "summary": "Sinolink Worldwide Holdings Limited, an investment holding company, invests in, develops, manages, and sells real estate properties in the People's Republic of China. It operates in four segments: Property Development, Property Management, Property Investment, and Financing Services. The company develops and sells residential properties; and invests in commercial and car parking properties. It also provides property, facilities, and project management services; finance leasing and loan financing, business factoring, administrative service supporting, and insurance services; and consultancy services in relation to information, multimedia, and communication technologies. In addition, the company engages in hotel operations. Sinolink Worldwide Holdings Limited was founded in 1992 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.sinolinkhk.com",
        "full_time_employees": 691
    },
    "1195.HK": {
        "short_name": "KINGWELL GROUP",
        "long_name": "Kingwell Group Limited",
        "summary": "Kingwell Group Limited, an investment holding company, engages in the property development, property leasing, and property management services business in Mainland China. The company is involved in the development of villas, apartments, and commercial buildings; property leasing of self-owned properties; sale of carpark spaces; and provision of property management services and construction services. It also owns and operates a mining project with an aggregate mining area of approximately 309.3 square kilometers located in Zeyskiy region, Russia. The company was formerly known as Sinotronics Holdings Limited and changed its name to Kingwell Group Limited in 2010. Kingwell Group Limited was founded in 1996 and is headquartered in Tsim Sha Tsui East, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://kingwell.todayir.com",
        "full_time_employees": 87
    },
    "1222.HK": {
        "short_name": "WANG ON GROUP",
        "long_name": "Wang On Group Limited",
        "summary": "Wang On Group Limited, an investment holding company, primarily engages in the property development and investment activities in Hong Kong, Mainland China, Macau, and internationally. It operates through five segments: Property Development, Property Investment, Fresh Markets, Pharmaceutical, and Treasury Management. The company invests in industrial and commercial premises, and residential units for rental or for sale; and invests in debt and other securities. It is also involved in the management and sub-licensing of fresh markets; butchery business, which includes management and sale of properties in agricultural produce exchange markets; and production and sale of Chinese and Western pharmaceutical, health food, and personal care products under the Wai Yuen Tong and Madame Pearl's brand names. In addition, the company provides financial services, such as mortgages and personal loans; management services; and sells fresh pork. The company was founded in 1987 and is headquartered in Kowloon Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon Bay",
        "zipcode": null,
        "website": "http://www.wangon.com",
        "full_time_employees": 2138
    },
    "1240.HK": {
        "short_name": "CNQC INT'L",
        "long_name": "CNQC International Holdings Limited",
        "summary": "CNQC International Holdings Limited, an investment holding company, operates as a property developer and contractor. It operates through four segments: Foundation and construction Â\u0097 Hong Kong and Macau; Property development Â\u0097 Hong Kong; Construction Â\u0097 Singapore and Southeast Asia; and Property development - Singapore and Southeast Asia. The company primarily engages in the development and sale of executive condominiums and condominiums in the outside Central Region of Singapore; and the provision of construction services as main contractor for governmental authorities and private property developers. It also undertakes foundation works; and provides ancillary services with specialization in piling works, as well as superstructure construction services in Hong Kong and Macau. In addition, the company undertakes construction projects in Singapore and other Southeast Asia, Hong Kong, and Macau. Further, it is involved in the rental of machinery and construction equipment; general wholesale trade business; and provision of general contracting, and building and civil engineering services. The company is based in Kowloon Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon Bay",
        "zipcode": null,
        "website": "http://www.cnqc.com.hk",
        "full_time_employees": 2026
    },
    "1383.HK": {
        "short_name": "SUNCITY GROUP",
        "long_name": "Suncity Group Holdings Limited",
        "summary": "Suncity Group Holdings Limited, an investment holding company, engages in property development, leasing, and management business in the People's Republic of China, Macau, Hong Kong, Japan, Cambodia, Vietnam, the Philippines, and Turkey. It operates through Property Development; Property Leasing; Hotel and Integrated Resort General Consultancy Services; Travel Related Products and Services; and Others segments. The company develops and sells office premises, and residential and retail properties. It also provides management and consultancy services to hotels and integrated resorts; and transportation and travel agency services, as well as travel related products. The company was formerly known as Sun Century Group Limited and changed its name to Suncity Group Holdings Limited in May 2017. The company is based in Shenzhen, the People's Republic of China. Suncity Group Holdings Limited is a subsidiary of Fame Select Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.suncitygroup.com.hk",
        "full_time_employees": 1291
    },
    "2330.HK": {
        "short_name": "CHINA UPTOWN",
        "long_name": "China Uptown Group Company Limited",
        "summary": "China Uptown Group Company Limited, an investment holding company, invests in and develops real estate properties in the People's Republic of China. The company develops residential and commercial properties. It also trades in raw cane sugar; and provides management services. China Uptown Group Company Limited is headquartered in Tsimshatsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.chinauptown.com.hk/t1.htm",
        "full_time_employees": 41
    },
    "CS4.F": {
        "short_name": "CN SOUTH CITY HLGS",
        "long_name": "China South City Holdings Limited",
        "summary": "China South City Holdings Limited, together with its subsidiaries, develops and operates integrated logistics and trade centers in the People's Republic of China. The company operates a trading platform of raw materials and finished products for domestic and international wholesale suppliers, traders, manufacturers, distributors, and retail clients; and sells and leases trade center units for businesses to display and sell their products. It also operates and manages outlets, which offers sports, outdoor, casual, and men's and women's fashion wear; and an e-commerce platform. In addition, the company provides warehousing management services; develops residential and commercial ancillary facilities; and arranges on-site third party delivery and distribution services. Further, it offers property management, and convention and exhibition services; and advertising, logistics, micro-credit, and other services. China South City Holdings Limited was founded in 2002 and is based in Tsim Sha Tsui, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.chinasouthcity.com",
        "full_time_employees": 4050
    },
    "GFW1.F": {
        "short_name": "CHIN.SANDI HLDG.LTD.HD-01",
        "long_name": "China Sandi Holdings Limited",
        "summary": "China Sandi Holdings Limited, an investment holding company, engages in the investment and development of properties in the People's Republic of China. The company operates in Property Development, Property Investment, and Hotel Operation segments. It is also involved in the leasing of investment properties and providing property management services. In addition, the company provides hotel accommodation and catering services. Further, it engages in the securities trading. It owns and leases shopping malls, hotels, office units, commercial units, kindergartens, and car parking facilities. The Company was formerly known as China Grand Forestry Green Resources Group Limited and changed its name to China Sandi Holdings Limited in October 2012. China Sandi Holdings Limited is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": "168-200",
        "website": "http://www.chinasandi.com.hk",
        "full_time_employees": 702
    },
    "HKP.F": {
        "short_name": "JOY CITY PPTY  HD -,10",
        "long_name": "Joy City Property Limited",
        "summary": "Joy City Property Limited, an investment holding company, engages in property investment and development, property management, and hotel operation activities in Mainland China and Hong Kong. It operates through four segments: Property Investment, Property and Land Development, Hotel Operations, and Output Management Project and Other Services. The company engages in the development, operation, sale, leasing, and management of mixed use complexes and other commercial properties, including shopping centers, hotels, offices, serviced apartments, and resort and tourist properties. It also owns and manages hotels; and provides agency services and property management services, as well as tourism services. The company was formerly known as COFCO Land Holdings Limited and changed its name to Joy City Property Limited in December 2014. The company was incorporated in 1992 and is headquartered in Causeway Bay, Hong Kong. Joy City Property Limited is a subsidiary of Grandjoy Holdings Group Co., Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.joy-cityproperty.com",
        "full_time_employees": 4423
    },
    "HKR.F": {
        "short_name": "HKR INTL LTD  HD-,25",
        "long_name": "HKR International Limited",
        "summary": "HKR International Limited, an investment holding company, invests in, develops, and manages real estate properties in Hong Kong, Macau, Mainland China, Japan, and South East Asia. It operates in five segments: Property Development, Property Investment, Services Provided, Hotel Operations, and Healthcare. The company primarily develops and manages residential, commercial, and industrial properties, as well as leisure projects. It also owns, operates, and manages hotels; and a healthcare service network, including chronic disease management and integrated medical centers, Chinese medicine centers, dental clinics, medical diagnostic centers, and medical network services. In addition, the company offers transportation services in Discovery Bay, including ferry, land transport, and tunnel operations; operates clubs; and invests in securities. Further, HKR International Limited provides cancer treatment and diagnostic imaging, commercial leasing agency, property agency, bus and garage, dental health and care, and project management services; corporate consultancy services to healthcare operating units; and financial services to first hand purchasers of properties in Discovery Bay, as well as trades in medical and dental equipment and supplies. Additionally, the company engages in the operation of a shipyard and road tunnel; and diabetes and endocrine disorders clinics, as well as acts as an estate manager and principal lessee of communication network in Discovery Bay. HKR International Limited was founded in 1977 and is based in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hkri.com",
        "full_time_employees": 1655
    },
    "HLU.F": {
        "short_name": "HANG LUNG GR",
        "long_name": "Hang Lung Group Limited",
        "summary": "Hang Lung Group Limited, an investment holding company, operates as a property developer in Hong Kong and Mainland China. The company operates through Property Leasing and Property Sales segments. It develops properties for sale and lease, such as large-scale commercial, office, and residential developments. The company also develops various properties, including shopping mall, office, residential, serviced apartments, and carparks. Its investment properties portfolio includes Grand Gateway 66, a commercial, office, and residential complex, as well as Plaza 66, a commercial and office complex in Shanghai; Palace 66 and Forum 66 in Shenyang; Parc 66 in Jinan; Center 66 in Wuxi; Riverside 66 in Tianjin; Olympia 66 in Dalian; Spring City 66 in Kunming; Heartland 66 in Wuhan; and Westlake 66. In addition, the company offers car park and property management, securities trading, financial, project management, and property agency services, as well as operates and manages apartment. Hang Lung Group Limited was incorporated in 1960 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hanglung.com/en-US/group/home",
        "full_time_employees": 4500
    },
    "HNLGF": {
        "short_name": "HANG LUNG GROUP",
        "long_name": "Hang Lung Group Limited",
        "summary": "Hang Lung Group Limited, an investment holding company, operates as a property developer in Hong Kong and Mainland China. The company operates through Property Leasing and Property Sales segments. It develops properties for sale and lease, such as large-scale commercial, office, and residential developments. The company also develops various properties, including shopping mall, office, residential, serviced apartments, and carparks. Its investment properties portfolio includes Grand Gateway 66, a commercial, office, and residential complex, as well as Plaza 66, a commercial and office complex in Shanghai; Palace 66 and Forum 66 in Shenyang; Parc 66 in Jinan; Center 66 in Wuxi; Riverside 66 in Tianjin; Olympia 66 in Dalian; Spring City 66 in Kunming; Heartland 66 in Wuhan; and Westlake 66. In addition, the company offers car park and property management, securities trading, financial, project management, and property agency services, as well as operates and manages apartment. Hang Lung Group Limited was incorporated in 1960 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hanglung.com/en-US/group/home",
        "full_time_employees": 4500
    },
    "HNLGY": {
        "short_name": "HANG LUNG GROUP",
        "long_name": "Hang Lung Group Limited",
        "summary": "Hang Lung Group Limited, an investment holding company, operates as a property developer in Hong Kong and Mainland China. The company operates through Property Leasing and Property Sales segments. It develops properties for sale and lease, such as large-scale commercial, office, and residential developments. The company also develops various properties, including shopping mall, office, residential, serviced apartments, and carparks. Its investment properties portfolio includes Grand Gateway 66, a commercial, office, and residential complex, as well as Plaza 66, a commercial and office complex in Shanghai; Palace 66 and Forum 66 in Shenyang; Parc 66 in Jinan; Center 66 in Wuxi; Riverside 66 in Tianjin; Olympia 66 in Dalian; Spring City 66 in Kunming; Heartland 66 in Wuhan; and Westlake 66. In addition, the company offers car park and property management, securities trading, financial, project management, and property agency services, as well as operates and manages apartment. Hang Lung Group Limited was incorporated in 1960 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hanglung.com/en-US/group/home",
        "full_time_employees": 4500
    },
    "NDVLY": {
        "short_name": "NEW WORLD DEVELOPMENT CO",
        "long_name": "New World Development Company Limited",
        "summary": "New World Development Company Limited, an investment holding company, engages in the property development and investment business in Hong Kong and internationally. Its property portfolio comprises residential, retail, office, and industrial properties. The company also provides commercial aircraft leasing services; operates expressways; and constructs residential and commercial projects, as well as provides protection and savings-related life and medical insurance products. In addition, it is involved in the duty free operation and general trading, civil engineering, loyalty program, marketing, promotion, fashion retailing and trading, and piling and ground investigation businesses; development and operation of sports park; operation of household goods shop and convenience store; sale of LED lighting products and systems; and trading of telecommunication system integration products. Further, the company manages Hong Kong Convention and Exhibition Centre; operates hotels, golf and tennis academies, and shopping malls; operates department stores; and provides information technology, healthcare, training course, ticketing, financial, project management, management, advertising and media related, business and investment consultancy, franchised and non-franchised bus, estate agency, wellness and rehabilitation, endoscopic, carpark management, supply chain management, and catering services, as well as property agency, management, and consultancy services. Additionally, the company undertakes faÃ§ade and foundation works; and offers elderly residential and nursing care services. As of June 30, 2020, the company had a total of 17 hotel properties with approximately 7,400 rooms in Hong Kong, Mainland China, and the Southeast Asia. New World Development Company Limited was founded in 1970 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.nwd.com.hk",
        "full_time_employees": 38000
    },
    "NWDA.F": {
        "short_name": "NEW WORLD DEV.CO.(B.L.)",
        "long_name": "New World Development Company Limited",
        "summary": "New World Development Company Limited, an investment holding company, engages in the property development and investment business in Hong Kong and internationally. Its property portfolio comprises residential, retail, office, and industrial properties. The company also provides commercial aircraft leasing services; operates expressways; and constructs residential and commercial projects, as well as provides protection and savings-related life and medical insurance products. In addition, it is involved in the duty free operation and general trading, civil engineering, loyalty program, marketing, promotion, fashion retailing and trading, and piling and ground investigation businesses; development and operation of sports park; operation of household goods shop and convenience store; sale of LED lighting products and systems; and trading of telecommunication system integration products. Further, the company manages Hong Kong Convention and Exhibition Centre; operates hotels, golf and tennis academies, and shopping malls; operates department stores; and provides information technology, healthcare, training course, ticketing, financial, project management, management, advertising and media related, business and investment consultancy, franchised and non-franchised bus, estate agency, wellness and rehabilitation, endoscopic, carpark management, supply chain management, and catering services, as well as property agency, management, and consultancy services. Additionally, the company undertakes faÃ§ade and foundation works; and offers elderly residential and nursing care services. As of June 30, 2020, the company had a total of 17 hotel properties with approximately 7,400 rooms in Hong Kong, Mainland China, and the Southeast Asia. New World Development Company Limited was founded in 1970 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.nwd.com.hk",
        "full_time_employees": 38000
    },
    "NWWDF": {
        "short_name": "NEW WORLD DEVELOPMENT CO",
        "long_name": "New World Development Company Limited",
        "summary": "New World Development Company Limited, an investment holding company, engages in the property development and investment business in Hong Kong and internationally. Its property portfolio comprises residential, retail, office, and industrial properties. The company also provides commercial aircraft leasing services; operates expressways; and constructs residential and commercial projects, as well as provides protection and savings-related life and medical insurance products. In addition, it is involved in the duty free operation and general trading, civil engineering, loyalty program, marketing, promotion, fashion retailing and trading, and piling and ground investigation businesses; development and operation of sports park; operation of household goods shop and convenience store; sale of LED lighting products and systems; and trading of telecommunication system integration products. Further, the company manages Hong Kong Convention and Exhibition Centre; operates hotels, golf and tennis academies, and shopping malls; operates department stores; and provides information technology, healthcare, training course, ticketing, financial, project management, management, advertising and media related, business and investment consultancy, franchised and non-franchised bus, estate agency, wellness and rehabilitation, endoscopic, carpark management, supply chain management, and catering services, as well as property agency, management, and consultancy services. Additionally, the company undertakes faÃ§ade and foundation works; and offers elderly residential and nursing care services. As of June 30, 2020, the company had a total of 17 hotel properties with approximately 7,400 rooms in Hong Kong, Mainland China, and the Southeast Asia. New World Development Company Limited was founded in 1970 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.nwd.com.hk",
        "full_time_employees": 38000
    },
    "OIHC.F": {
        "short_name": "CSI PROPERT.SUBDIV.HD-008",
        "long_name": "CSI Properties Limited",
        "summary": "CSI Properties Limited, an investment holding company, engages in the property development and investment activities in Hong Kong, Singapore, the People's Republic of China, and Macau. The company operates through four segments: Commercial Property Holding, Residential Property Holding, Macau Property Holding, and Securities Investment. It invests and trades in commercial and residential properties. The company is also involved in securities trading and investment activities; issuing bonds; treasury management; and provision of management and property management services. CSI Properties Limited is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.csigroup.hk",
        "full_time_employees": null
    },
    "RHGN.F": {
        "short_name": "CN AGRI-PRODS EXCH.HK-,01",
        "long_name": "China Agri-Products Exchange Limited",
        "summary": "China Agri-Products Exchange Limited, an investment holding company, engages in the investment, development, construction, operation, and management of agricultural wholesale markets in the People's Republic of China. The company operates in two segments, Agricultural Produce Exchange Market Operation and Property Sales. It operates various agricultural markets, including the Wuhan Baisazhou agricultural and by-product exchange market located in Wuhan City, Hongshan District; the Yulin Hongjin agricultural and by-product exchange market in Guangxi Zhuang Autonomous Region; the Luoyang Hongjin agricultural and by-product exchange market located in Henan Province; the Xuzhou agricultural and by-product exchange market in the northern part of Jiangsu Province; Puyang Hongjin agricultural and by-product exchange market located in Henan Province; Kaifeng Hongjin agricultural and by-product exchange market located in Henan Province; Qinzhou Hongjin agricultural and by-product exchange market in the Guangxi Region; Huangshi Hongjin agricultural and by-product exchange market in Hubei Province; Huai'an Market in Jiangsu Province; Panjin Market in Liaoning Province; and Suizhou Market located in Suizhou city. The company also sells properties; offers financial services; and operates agricultural logistics center to provide distribution and logistics services in central China. China Agri-Products Exchange Limited is headquartered in Kowloon Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon Bay",
        "zipcode": null,
        "website": "http://www.cnagri-products.com",
        "full_time_employees": 1193
    },
    "S1H1.MU": {
        "short_name": "SOUNDWILL HLDGS  HD-,10",
        "long_name": "Soundwill Holdings Limited",
        "summary": "Soundwill Holdings Limited, an investment holding company, provides property development, property leasing, and building management services in the People's Republic of China. The company develops medium to high end commercial and residential, as well as industrial properties; and offers building management, repair and maintenance services to large-scale commercial buildings, and small and medium sized residential estates. It also invests in and leases commercial, office, and residential buildings, as well as advertising and mini-storage spaces; and provides property assembly and sales services. The company was founded in 1978 and is headquartered in Causeway Bay, Hong Kong. Soundwill Holdings Limited is a subsidiary of Ko Bee Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.soundwill.com.hk",
        "full_time_employees": 316
    },
    "SNLKF": {
        "short_name": "SINOLINK WORLDWIDE HLDGS",
        "long_name": "Sinolink Worldwide Holdings Limited",
        "summary": "Sinolink Worldwide Holdings Limited, an investment holding company, invests in, develops, manages, and sells real estate properties in the People's Republic of China. It operates in four segments: Property Development, Property Management, Property Investment, and Financing Services. The company develops and sells residential properties; and invests in commercial and car parking properties. It also provides property, facilities, and project management services; finance leasing and loan financing, business factoring, administrative service supporting, and insurance services; and consultancy services in relation to information, multimedia, and communication technologies. In addition, the company engages in hotel operations. Sinolink Worldwide Holdings Limited was founded in 1992 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.sinolinkhk.com",
        "full_time_employees": 691
    },
    "TNY1.SG": {
        "short_name": "China Merchants Land Ltd. Regis",
        "long_name": "China Merchants Land Limited",
        "summary": "China Merchants Land Limited, an investment holding company, engages in the investment, development, management, lease, and sale of properties. The company operates through Properties and Asset Management segments. Its property portfolio includes residential properties; and residential and commercial complex properties, such as apartments, villas, offices, retail shops, etc. The company also offers asset management services for office premises and shopping malls. As of December 31, 2019, its portfolio of property development projects includes 33 projects in Foshan, Guangzhou, Chongqing, Nanjing, Jurong, and Xi'an; and a land bank of approximately 5,954,429 square metres. The company was formerly known as Tonic Industries Holdings Limited. China Merchants Land Limited was founded in 1997 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.cmland.hk",
        "full_time_employees": 814
    },
    "XUN.F": {
        "short_name": "SHUN TAK HLDGS",
        "long_name": "Shun Tak Holdings Limited",
        "summary": "Shun Tak Holdings Limited, an investment holding company, engages in property, transportation, hospitality, and investment businesses in Hong Kong, Macau, Mainland China, and internationally. It develops and sells property; markets and leases retail, office, and residential properties; offers property management services for residential and commercial properties; and provides property cleaning, laundry, maintenance and repair, project works, hygiene, pest control, waste management, legal advice, and financial management services. The company also offers passenger sea and land transportation services across destinations within the Pearl River Delta connecting cities, such as Hong Kong, Macau, Zhuhai, Shenzhen, and Shekou under the TurboJET brand name. In addition, it operates hotels and golf clubs, entertainment attractions, and travel consultancies, as well as offers MICE and transportation services; invests in gaming concessionaires; and operates toy stores under the Â\u0093ToysÂ\u0091R'UsÂ\u0094 name. Additionally, the company provides financing; hospitality management and auxiliary; and travel agency services. Shun Tak Holdings Limited was founded in 1972 and is based in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.shuntakgroup.com",
        "full_time_employees": 1600
    }
}