{
    "0004.HK": {
        "short_name": "WHARF HOLDINGS",
        "long_name": "Wharf (Holdings) Limited",
        "summary": "Founded in 1886 with Hong Kong as its base, The Wharf (Holdings) Limited (Stock code: 0004) is the 17th company incorporated in Hong Kong and a premier company with a long history. As one of the 30 constituent stocks in the original Hang Seng Index since more than 50 years ago, Wharf is among the top local blue chips that is most actively traded and widely held. Backed by a long standing mission of Â\u0093Building for TomorrowÂ\u0094 and a proven track record in management and execution, the Group has produced consistent and productive performance over the years. Subsequent to the separate listing of Wharf Real Estate Investment Company Limited in November 2017 which focuses on its Hong Kong investment properties portfolio, The Wharf (Holdings) Limited's businesses are largely property-related, comprising Investment Properties, Hotels and Development Properties in Hong Kong and Mainland China. Other businesses include Logistics through Modern Terminals and Hong Kong Air Cargo Terminals. Wharf's Peak Portfolio redefines the concept of luxury living with a collection of the rare and most prestigious residences, epitomising a unique and exclusive lifestyle at the most sought-after addresses in town. Besides the highly-acclaimed Mount Nicholson, other properties under development include 1 Plantation Road, 11 Plantation Road and 77 Peak Road. Besides The Peak Portfolio, the development pipeline of Hong Kong Properties also includes the Kowloon Tong Residential Project and projects in Kowloon East. In the Mainland, Wharf spearheads its investment properties with the International Finance Square (IFS) series at the very heart of CBD or new CBD in high potential cities including Changsha, Chengdu, Chongqing, Suzhou and Wuxi. IFS developments are positioned as trendsetting landmarks with unrivalled locations, superior planning and design, retailer and shopper critical mass, as well as top-notch retail management. Changsha IFS, 2018's newest to the collection, and Chengdu IFS opened in 2014 are comparable to Harbour City in Hong Kong in scale and prominence. The boutique Chongqing IFS, featuring the largest cluster of first-tier brands in Chongqing, was opened in 2017. The Group continues to adopt a selective land acquisition policy with strategic focus on key Tier 1 or 2 cities in order to secure high quality land bank with returns. The development property landbank at the end of June 2019 totalled 3.6 million square metres. Wharf Hotels manages an expanding portfolio of 17 hotels in Asia, spearheaded by a prominent Niccolo brand in recent years. The Wharf Hotels owns four contemporary, urban, chic Niccolo hotels (including The Murray, Hong Kong and Niccolo Changsha) and manages 13 Marco Polo hotels in Hong Kong, Mainland China and the Philippines. Niccolo Suzhou is the newest addition under development and is scheduled to open in 2021. The Group also owns and operates Modern Terminals and Hong Kong Air Cargo Terminals, key components in Hong Kong's success as a hub for international trade and international transportation for decades. CME2 is the Group's long-term investment, representing a strategic initiative of reinvesting capital and profit released from the CME1 exit in Hong Kong in a progressive new economy infrastructure CME2 arena that covers much larger markets with greater growth potential. Â\u0093Building for TomorrowÂ\u0094 also extends to Wharf's Â\u0093Business-in-CommunityÂ\u0094 (Â\u0093BICÂ\u0094) pursuit. With the flagship school improvement programme Â\u0093Project WecanÂ\u0094 growing from strength to strength, the Group supports a series of BIC initiatives including Wu Zhi Qiao (Bridge to China) Charitable Foundation, Shanghai International Tower-running Grand Prix and Operation Panda with an aim of promoting BIC and to bring benefits to different segments of society.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.wharfholdings.com",
        "market_cap": "Large Cap"
    },
    "0014.HK": {
        "short_name": "HYSAN DEV",
        "long_name": "Hysan Development Company Limited",
        "summary": "Hysan is a leading property investment, management and development company in Hong Kong, with a portfolio of more than 4 million square feet of high-quality office, retail and residential properties. Operating primarily in the city's prime retail/office district of Causeway Bay, we are focused on delighting our customers and providing investors with outstanding returns.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.hysan.com.hk",
        "market_cap": "Mid Cap"
    },
    "0029.HK": {
        "short_name": "DYNAMIC HOLD",
        "long_name": "Dynamic Holdings Limited",
        "summary": "Dynamic Holdings Limited, an investment holding company, engages in the investment and development of properties in the People's Republic of China and Hong Kong. The company operates through Property Rental and Property Sales segments. Its investment properties portfolio primarily comprises offices, shopping malls, and car parks, as well as residential properties. Dynamic Holdings Limited company also leases and sells properties. In addition, it is involved in the provision of nominee, management, financing, and management consultancy services. Dynamic Holdings Limited was founded in 1992 and is based in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.dynamic.hk",
        "market_cap": "Small Cap"
    },
    "0075.HK": {
        "short_name": "Y.T. REALTY",
        "long_name": "Y. T. Realty Group Limited",
        "summary": "Y. T. Realty Group Limited, an investment holding company, engages in the property investment and trading activities in Hong Kong and the United Kingdom. It operates through four segments: Property Investment, Property Trading, Property Management and Related Services, and Treasury Management. The company also offers property management and related technical consultancy services; property rental services; and corporate management services. In addition, it invests in debt securities and time deposits. The company was formerly known as Prestige Properties Holdings Limited and changed its name to Y. T. Realty Group Limited in June 2002. Y. T. Realty Group Limited is headquartered in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.ytrealtygroup.com.hk",
        "market_cap": "Small Cap"
    },
    "0093.HK": {
        "short_name": "TERMBRAY IND",
        "long_name": "Termbray Industries International (Holdings) Limited",
        "summary": "Termbray Industries International (Holdings) Limited, an investment holding company, invests in, develops, and sells real estate properties in the People's Republic of China. The company's portfolio of properties includes residential units, commercial arcades, and car parks. It also engages in the money lending business. The company was incorporated in 1990 and is headquartered in Tsuen Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.termbray.com.hk",
        "market_cap": "Small Cap"
    },
    "0101.HK": {
        "short_name": "HANG LUNG PPT",
        "long_name": "Hang Lung Properties Limited",
        "summary": "Hang Lung Properties Limited, an investment holding company, engages in the property investment, development, and management activities in Hong Kong and Mainland China. The company operates through Property Leasing and Property Sales segments. The company is involved in the property leasing business; and development and sale of properties. Its investment properties portfolio includes shopping malls, office, residential, serviced apartment, hotel, and car parking properties, as well as industrial premises. The company also engages in the apartment operating and management; car parking and project management; and property agency activities. In addition, it provides management and financial services. The company was incorporated in 1949 and is headquartered in Central, Hong Kong. Hang Lung Properties Limited is a subsidiary of Hang Lung Group Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hanglung.com",
        "market_cap": "Large Cap"
    },
    "0141.HK": {
        "short_name": "SKYCHINAFORTUNE",
        "long_name": "Sky Chinafortune Holdings Group Limited",
        "summary": "Sky Chinafortune Holdings Group Limited, an investment holding company, engages in property investment activities in the People's Republic of China. It operates through Property Investment, Trading of Properties and Property Related Services, and Retail Business segments. The company leases residential premises, shops, and car parks; sells properties; and offers property management and property related services. It is also involved in the retail sale of Chinese liquor and wine, and everyday items. The company was formerly known as Great China Holdings Limited and changed its name to Sky Chinafortune Holdings Group Limited in July 2019. The company was incorporated in 1965 and is based in Central, Hong Kong. Sky Chinafortune Holdings Group Limited is a subsidiary of Hopevision Group Ltd.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.skychinafortune.com",
        "market_cap": "Small Cap"
    },
    "0158.HK": {
        "short_name": "MELBOURNE ENT",
        "long_name": "Melbourne Enterprises Limited",
        "summary": "Melbourne Enterprises Limited, an investment holding company, engages in property investment activities in Hong Kong. Its investment properties include commercial and retail. The company is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "0171.HK": {
        "short_name": "SILVER GRANT",
        "long_name": "Silver Grant International Holdings Group Limited",
        "summary": "Silver Grant International Holdings Group Limited, an investment holding company, engages in the property investment and securities trading businesses in the People's Republic of China. It operates through Investments and Property Leasing segments. The company primarily invests in and develops residential and commercial properties, as well as financial assets. It also engages in the environmental conservation and renewable energy business; and property rental business. The company was formerly known as Silver Grant International Industries Limited and changed its name to Silver Grant International Holdings Group Limited in May 2019. The company is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.silvergrant.com.hk",
        "market_cap": "Small Cap"
    },
    "0183.HK": {
        "short_name": "WINFULL GP",
        "long_name": "Winfull Group Holdings Limited",
        "summary": "Winfull Group Holdings Limited, an investment holding company, engages in the property investment, development, and trading businesses in Hong Kong, the United Kingdom, and Japan. It is also involved in the provision of renovation services; security investment and trading business; and money lending activities. The company was formerly known as Richfield Group Holdings Limited and changed its name to Winfull Group Holdings Limited in March 2015. The company is headquartered in Central, Hong Kong. Winfull Group Holdings Limited is a subsidiary of Virtue Partner Group Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.winfullgroup.hk",
        "market_cap": "Small Cap"
    },
    "0202.HK": {
        "short_name": "EVERCHINA INT'L",
        "long_name": "EverChina Int'l Holdings Company Limited",
        "summary": "EverChina Int'l Holdings Company Limited primarily engages in the property investment and hotel operations in Hong Kong, the People's Republic of China, and Bolivia. It operates through Property Investment Operation, Hotel operation, Securities Investment and Financing Operation, and Agricultural Operation segments. The company is involved in the leasing of residential and commercial properties, as well as car parking space rental; exploration, mining processing, and sale of manganese resources; securities investment activities; and provision of corporate management, and financial services. It also engages in the raising and sale of cattle, as well as agricultural farming activities; and sale of soybean, corn, and rice. The company was formerly known as Interchina Holdings Company Limited and changed its name to EverChina Int'l Holdings Company Limited in February 2014. EverChina Int'l Holdings Company Limited is based in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.everchina202.com.hk",
        "market_cap": "Small Cap"
    },
    "0212.HK": {
        "short_name": "NANYANG HOLD",
        "long_name": "Nanyang Holdings Limited",
        "summary": "Nanyang Holdings Limited, an investment holding company, engages in the property investment and trading businesses in Hong Kong, the United States, Europe, Taiwan, and internationally. The company operates through Real Estate and Financial Investments segments. The Real Estate segment invests in and leases industrial/office spaces. The Financial Investments segment holds and trades in investment securities. Nanyang Holdings Limited was founded in 1947 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.nanyangholdingslimited.com",
        "market_cap": "Small Cap"
    },
    "0225.HK": {
        "short_name": "POKFULAM",
        "long_name": "Pokfulam Development Company Limited",
        "summary": "Pokfulam Development Company Limited, an investment holding company, invests in, develops, and manages real estate properties in Hong Kong. It operates through three segments: Property Investment and Management, Trading of Goods, and Securities Investment. The company lets out and manages commercial, industrial, and residential properties. It also trades in visual and sound equipment; deals in listed securities; and provides trustee and nominee services. Pokfulam Development Company Limited was incorporated in 1970 and is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.pokfulam.com.hk",
        "market_cap": "Small Cap"
    },
    "0237.HK": {
        "short_name": "SAFETY GODOWN",
        "long_name": "Safety Godown Company, Limited",
        "summary": "Safety Godown Company, Limited, an investment holding company, engages in leasing of investment properties in Hong Kong. It operates through Godown Operations, Property Investment, and Treasury Investment segments. The company is also involved in the operation of godowns; and securities trading and investment activities. Safety Godown Company, Limited was founded in 1960 and is based in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.safetygodown.com",
        "market_cap": "Small Cap"
    },
    "0247.HK": {
        "short_name": "TST PROPERTIES",
        "long_name": "Tsim Sha Tsui Properties Limited",
        "summary": "Tsim Sha Tsui Properties Limited, an investment holding company, invests in, develops, manages, and trades in properties primarily in the People's Republic of China, Singapore, and Australia. The company operates through six segments: Property Sales; Property Rental; Property Management and Other Services; Hotel Operations; Investments in Securities; and Financing. It is also involved in the share investment and dealing, mortgage loan financing, building construction and management, and project management activities. In addition, it offers financial, cleaning, management, premium living, consultancy, administrative, deposit placing, financing, and security services. Its property portfolio includes residential, commercial, industrial, hotels and car parks. As of June 30, 2020, the company had a land bank of approximately 22.3 million square feet floor area. Tsim Sha Tsui Properties Limited was incorporated in 1972 and is based in Tsim Sha Tsui, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.sino.com/en-US/Investor-Relations/Tsim-Sha-Tsui-Properties-Limited",
        "market_cap": "Mid Cap"
    },
    "0266.HK": {
        "short_name": "TIAN TECK LAND",
        "long_name": "Tian Teck Land Limited",
        "summary": "Tian Teck Land Limited, an investment holding company, engages in the property investment activities in the People's Republic of China and Hong Kong. As of March 31, 2020, its investment properties include iSQUARE complex in Tsim Sha Tsui; various units of Good Luck Industrial Building; a floor of Euro Trade Centre; various units of an industrial property; and two residential properties. The company is based in Tsim Sha Tsui, Hong Kong. Tian Teck Land Limited is a subsidiary of Tian Teck Investment Holding Co., Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://ttll.etnet.com.hk/tc/index.php",
        "market_cap": "Small Cap"
    },
    "0271.HK": {
        "short_name": "ASIASEC PPT",
        "long_name": "Asiasec Properties Limited",
        "summary": "Asiasec Properties Limited, an investment holding company, engages in property investment, property leasing, and estate management businesses primarily in Hong Kong. The company's investment properties include commercial, residential, and industrial/godown properties, as well as carparks. It also provides financing services. The company was formerly known as Dan Form Holdings Company Limited and changed its name to Asiasec Properties Limited in June 2017. The company was incorporated in 1973 and is based in Wan chai, Hong Kong. Asiasec Properties Limited is a subsidiary of Autobest Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.asiasec.com.hk",
        "market_cap": "Small Cap"
    },
    "0287.HK": {
        "short_name": "WINFAIR INV",
        "long_name": "Winfair Investment Company Limited",
        "summary": "Winfair Investment Company Limited, together with its subsidiaries, engages in the property and share investment, property development, and securities dealing activities in Hong Kong. The company operates through Securities Investment, Property Leasing, and Property Development segments. It invests in short-term and long-term securities, as well as leases residential, commercial, and industrial properties. The company was founded in 1971 and is based in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.winfairinvestment.com",
        "market_cap": "Small Cap"
    },
    "0313.HK": {
        "short_name": "RICHLY FIELD",
        "long_name": "Richly Field China Development Limited",
        "summary": "Richly Field China Development Limited, an investment holding company, engages in the outlets commercial operation in the People's Republic of China. The company also develops and operates featured commercial properties, including tourism and senior care properties, and wine chateaus; and develops and manages residential properties. In addition, it is involved in the construction and maintenance, and home furnishing activities; and trading of fashion wears and accessories. The company was formerly known as Dickson Group Holdings Limited and changed its name to Richly Field China Development Limited in March 2009. Richly Field China Development Limited was incorporated in 1990 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.richlyfieldchinagroup.com",
        "market_cap": "Small Cap"
    },
    "0367.HK": {
        "short_name": "CHUANG'S INT'L",
        "long_name": "Chuang's Consortium International Limited",
        "summary": "Chuang's Consortium International Limited, an investment holding company, primarily engages in the property development, investment, and trading operations in Hong Kong, the People's Republic of China, the United Kingdom, and internationally. It owns a portfolio of investment properties comprising retail, office, residential, hotel, and industrial, as well as car parking spaces. The company is also involved in the securities investment and trading; money lending; project management; hiring of assets and trading of merchandises; and the provision of property agency, property management, and nominee and secretarial services. In addition, the company engages in the development and construction of cemetery and the provision of related management services; operation and management of hotel; and manufacture and sale of home finishing products. Further it offers watch components and merchandises. Chuang's Consortium International Limited is based in Central, Hong Kong. Chuang's Consortium International Limited operates as a subsidiary of Evergain Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.chuangs-consortium.com",
        "market_cap": "Small Cap"
    },
    "0459.HK": {
        "short_name": "MIDLAND IC&I",
        "long_name": "Midland IC&I Limited",
        "summary": "Midland IC&I Limited, an investment holding company, provides property agency services for commercial and industrial properties, and shops in Hong Kong. It is also involved in the property investment, securities investment, surveying, and money lending activities; and operation of serviced apartments. In addition, the company provides treasury and management services. The company was incorporated in 2001 is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.midlandici.com.hk",
        "market_cap": "Small Cap"
    },
    "0495.HK": {
        "short_name": "PALADIN",
        "long_name": "Paladin Limited",
        "summary": "Paladin Limited, an investment holding company, engages in the property investment, and research and development of high technology system and applications in Hong Kong and Finland. The company primarily invests in and leases properties. It also engages in the development of portable x-ray imaging systems used in inspection devices for security and counter-intelligence applications in the areas of baggage scanning, border control and customs, detection of explosive devices, forensic investigation, and security at large scale sporting and other events; and dynamic range video cameras and artificial intelligences processors for machine vision applications for use in the healthcare and agricultural sectors, as well as in devices to improve driver situational awareness and security cameras. In addition, the company is involved in the development of accurate positioning and image sensing technologies to be integrated into semi-automated agricultural vehicles and advanced driver assistance systems in agricultural vehicles, and for application in marine navigation systems; and three dimensional machine vision software for three dimensional industrial cameras, artificial intelligence industrial cameras, and three dimensional vision software. Further, it engages in the development of ambient display solutions and advanced algorithm and software solutions for use in advanced driver assistance systems, collision warning systems, driver awareness systems, and advanced traffic monitoring and control systems; and linear image sensors for use in spectroscopy, document scanners, and sensors used for various security applications. The company was incorporated in 1988 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": null,
        "market_cap": "Small Cap"
    },
    "0499.HK": {
        "short_name": "QINGDAO HLDGS",
        "long_name": "Qingdao Holdings International Limited",
        "summary": "Qingdao Holdings International Limited, an investment holding company, engages in property leasing activities in Hong Kong and the People's Republic of China. It operates through three segments: Leasing of Properties, Production and Sale of Education Equipment, and Loan Financing. The Leasing of Properties segment primarily leases residential, industrial, and commercial premises. The Production and Sale of Education Equipment segment is involved in the research, development, production, and sale of digital Chinese calligraphy education equipment; and provision of learning and tutorial systems. The Loan Financing segment provides loan financing services to individual and corporate customers, as well as money lending services. The company also offers project construction services. The company was formerly known as HyComm Wireless Limited and changed its name to Qingdao Holdings International Limited in November 2014. Qingdao Holdings International Limited is headquartered in Admiralty, Hong Kong. Qingdao Holdings International Limited is a subsidiary of China Qingdao International (Holdings) Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.qingdaohi.com",
        "market_cap": "Small Cap"
    },
    "0593.HK": {
        "short_name": "DREAMEAST",
        "long_name": "DreamEast Group Limited",
        "summary": "DreamEast Group Limited, an investment holding company, engages in the property development and leasing, tourism park operation, and other services businesses in the People's Republic of China. It also operates cultural tourist resorts and theme parks under the DreamEast brand; and provides movie and television culture services. The company was formerly known as SkyOcean International Holdings Limited and changed its name to DreamEast Group Limited in July 2017. DreamEast Group Limited is headquartered in Causeway Bay, Hong Kong. DreamEast Group Limited is a subsidiary of SkyOcean Investment Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.dreameast.com",
        "market_cap": "Small Cap"
    },
    "0616.HK": {
        "short_name": "EMINENCE ENT",
        "long_name": "Eminence Enterprise Limited",
        "summary": "Eminence Enterprise Limited, an investment holding company, engages in the property investment and development activities in Hong Kong, the People's Republic of China, and Singapore. It operates through Property Investment, Property Development, Investment in Securities, and Loan Financing segments. The company owns and invests in residential, commercial, and industrial properties. It is also involved in investing in listed securities; and loan financing businesses. The company was formerly known as Easyknit Enterprises Holdings Limited and changed its name to Eminence Enterprise Limited in March 2016. Eminence Enterprise Limited was founded in 1981 and is based in Cheung Sha Wan, Hong Kong. As on April 21, 2021, Eminence Enterprise Limited operates as a subsidiary of Ace Winner Investment Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Cheung Sha Wan",
        "zipcode": null,
        "website": "http://www.eminence-enterprise.com",
        "market_cap": "Small Cap"
    },
    "0655.HK": {
        "short_name": "HK CHINESE LTD",
        "long_name": "Hongkong Chinese Limited",
        "summary": "Hongkong Chinese Limited, an investment holding company, engages in property investment and development, healthcare services, and hotel operations. Its Property Investment segment engages in the letting and resale of properties. The company's Property Development segment is involved in the development and sale of properties. Its Treasury Investment segment invests in money markets. The company's Securities Investment segment invests in securities held-for-trading. Its Other segment engages in the provision of money lending and project management services. The company also owns a motor yacht. It has operations in Hong Kong, Mainland China, Singapore, Indonesia, and internationally. The company was founded in 1992 and is based in Hong Kong, Hong Kong. Hongkong Chinese Limited is a subsidiary of Hennessy Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.hkchinese.com.hk",
        "market_cap": "Small Cap"
    },
    "0674.HK": {
        "short_name": "CHINA TANGSHANG",
        "long_name": "China Tangshang Holdings Limited",
        "summary": "China Tangshang Holdings Limited, an investment holding company, engages in exhibition-related, property sub-leasing, property development and investment, food and beverages, and financial services businesses in Hong Kong and the People's Republic of China. The company is involved in organizing various exhibition and meeting events; and sub-leasing and developing real estates, as well as leasing investment properties. It also engages in the sale of food and beverages; operates restaurants; and provision of loans to individuals and corporations. The company was formerly known as Culture Landmark Investment Limited and changed its name to China Tangshang Holdings Limited in August 2017. China Tangshang Holdings Limited is based in Tsim Sha Tsui, Hong Kong. China Tangshang Holdings Limited is a subsidiary of Grand Nice International Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.ts674.com",
        "market_cap": "Small Cap"
    },
    "0715.HK": {
        "short_name": "CHINA OCEANWIDE",
        "long_name": "China Oceanwide Holdings Limited",
        "summary": "China Oceanwide Holdings Limited, an investment holding company, engages in property investment, real estate development, energy, and finance investment and other activities in the United States, Indonesia, the People's Republic of China, and Hong Kong. It owns and rents two office and commercial properties in Shanghai; develops real estate properties in the United States; provides management services; invests in debt and equity securities; and develops two coal-fired steam power plants with a net capacity of 150 megawatt each in the Medan industrial zone of Indonesia. The company was formerly known as Hutchison Harbour Ring Limited and changed its name to China Oceanwide Holdings Limited in December 2014. China Oceanwide Holdings Limited is headquartered in Hong Kong, Hong Kong. China Oceanwide Holdings Limited is a subsidiary of Oceanwide Holdings International Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.oceanwide.hk",
        "market_cap": "Small Cap"
    },
    "0859.HK": {
        "short_name": "ZHONGCHANG INTL",
        "long_name": "Zhongchang International Holdings Group Limited",
        "summary": "Zhongchang International Holdings Group Limited, an investment holding company, engages in property investment, leasing, and development activities in Hong Kong and the People's Republic of China. The company operates through Property Investment, Property Development, and Property Project Management Services segments. The company is also involved in the investment, development, and construction of ocean engineering and real estates; investment and development of tourism project; provision of real estate agent services; consultation of information services; and property management activities. In addition, it engages in construction works; and provision of real estate intermediate services. Further, the company provides family services. The company was formerly known as Henry Group Holdings Limited and changed its name to Zhongchang International Holdings Group Limited in May 2018. Zhongchang International Holdings Group Limited was incorporated in 1999 and is headquartered in Causeway Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.zhongchangintl.hk",
        "market_cap": "Small Cap"
    },
    "0898.HK": {
        "short_name": "MULTIFIELD INTL",
        "long_name": "Multifield International Holdings Limited",
        "summary": "Multifield International Holdings Limited, an investment holding company, engages in the investment, development, management, rental, and sale of real estate properties in Hong Kong and Mainland China. It operates through three segments: Property Investment, Provision of Serviced Apartment and Property Management Services, and Trading and Investment. The company owns various properties, including office and industrial buildings, retail shops, and car parks, as well as residential complexes, such as hotel-serviced villas and apartments under the Windsor Renaissance name. It is also involved in the provision of property agency, administration, and consultant services; and securities investment and trading activities. The company was founded in 1988 and is headquartered in Wong Chuk Hang, Hong Kong. Multifield International Holdings Limited is a subsidiary of Lucky Speculator Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wong Chuk Hang",
        "zipcode": null,
        "website": "http://www.multifield.com.hk",
        "market_cap": "Small Cap"
    },
    "1036.HK": {
        "short_name": "VANKE OVERSEAS",
        "long_name": "Vanke Overseas Investment Holding Company Limited",
        "summary": "Vanke Overseas Investment Holding Company Limited, an investment holding company, invests in, develops, finances, rents, and manages real estate properties in Hong Kong, the United Kingdom, and the United States. It also provides administrative, asset management, property redevelopment, and investment advisory services. The company was formerly known as Vanke Property (Overseas) Limited and changed its name to Vanke Overseas Investment Holding Company Limited in December 2019. The company is headquartered in Central, Hong Kong. Vanke Overseas Investment Holding Company Limited is a subsidiary of China Vanke Co., Ltd.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.vankeoverseas.com",
        "market_cap": "Small Cap"
    },
    "1200.HK": {
        "short_name": "MIDLAND HOLDING",
        "long_name": "Midland Holdings Limited",
        "summary": "Midland Holdings Limited, an investment holding company, provides property agency services in the Hong Kong, Macau, and the People's Republic of China. The company offers residential property agency services; and money lending, project planning, commercial property management, and marketing and sales planning services, as well as surveying, leasing, and property management services. It also provides immigration consultancy services; surveying consultancy services, including valuation advisory, development study, sales, marketing, tender, and auction for projects; and operates internet website. In addition, the company offers property investment services; and overseas property projects' marketing and referral services in Hong Kong. Midland Holdings Limited was founded in 1973 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.midland.com.hk",
        "market_cap": "Small Cap"
    },
    "1387.HK": {
        "short_name": "CHINA DILI",
        "long_name": "China Dili Group",
        "summary": "China Dili Group, an investment holding company, engages in the operation of agriculture wholesale markets in the People's Republic of China. It leases and manages agriculture wholesale market. The company operates 10 wholesale markets in Harbin, Shenyang, Shouguang, Guiyang, Qiqihar, Mudanjiang, and Hangzhou. The company was formerly known as Renhe Commercial Holdings Company Limited and changed its name to China Dili Group in June 2019. China Dili Group was founded in 2002 and is based in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": "999077",
        "website": "http://www.diligrp.com",
        "market_cap": "Mid Cap"
    },
    "1821.HK": {
        "short_name": "ESR",
        "long_name": "ESR Cayman Limited",
        "summary": "ESR Cayman Limited, together with its subsidiaries, engages in the logistics real estate development, leasing, and management activities in the Public's Republic of China, Japan, South Korea, Singapore, Australia, and India. It operates through three segments: Investment, Fund Management, and Development. The company develops, constructs, invests in, and sells logistics real estate properties. It is also involved in the fund management business. In addition, the company invests in properties, co-investments funds and investment vehicles, public REIT, and other investments. It serves e-commerce companies, 3PL providers, bricks-and-mortar retailers, manufacturers, cold-chain logistics providers, and other enterprises in various industries comprising electronics, fast-moving consumer goods, retail, food and beverage, general logistics services, auto and parts, pharmaceuticals, medical instruments, and machinery. The company was incorporated in 2011 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.esr.com",
        "market_cap": "Mid Cap"
    },
    "1972.HK": {
        "short_name": "SWIREPROPERTIES",
        "long_name": "Swire Properties Limited",
        "summary": "Swire Properties Limited, together with its subsidiaries, develops, owns, and operates mixed-use, primarily commercial properties in Hong Kong, Mainland China, the United States, and internationally. It operates through three segments: Property Investment, Property Trading, and Hotels. The company is involved in the development, leasing, and management of commercial, retail, and residential properties; development, construction, and sale of residential apartments; and operation of hotels. It also provides financial and real estate agency services. The company was incorporated in 1972 and is based in Hong Kong, Hong Kong. Swire Properties Limited is a subsidiary of Swire Pacific Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.swireproperties.com",
        "market_cap": "Large Cap"
    },
    "1997.HK": {
        "short_name": "WHARF REIC",
        "long_name": "Wharf Real Estate Investment Company Limited",
        "summary": "Wharf Real Estate Investment Company Limited, an investment holding company, invests in, develops, constructs, owns, operates, trades in, and sells real estate properties in Hong Kong, Mainland China, and Singapore. The company operates through Investment Property, Development Property, Hotels, and Investment segments. It primarily operates Harbour City, a commercial space comprising offices, retail shops, serviced apartments, hotels and club, and car parking spaces; and Times Square, a retail space that consists of office and car parking spaces. The company also operates Wheelock House and Crawford House commercial properties; The Murray, a luxury hotel that consists of 336 rooms; Plaza Hollywood, a shopping mall with retail outlets, restaurants, and a stadium housing six-screen cinema multiplex; The Star Ferry, which provides a ferry service between Tsim Sha Tsui and Wan Chai; and Wheelock Place and Scotts Square mall. In addition, it offers leasing, finance, and management services; and accepts bank deposits. Wharf Real Estate Investment Company Limited was incorporated in 2017 and is headquartered in Kowloon, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.wharfreic.com",
        "market_cap": "Large Cap"
    },
    "2292.HK": {
        "short_name": "THING ON ENT",
        "long_name": "Thing On Enterprise Limited",
        "summary": "Thing On Enterprise Limited, an investment holding company, engages in the property investment and management business in Hong Kong. The company primarily rents office, retail, and industrial properties. As of December 31, 2020, it had 38 properties with an aggregate saleable area of approximately 59,887 square feet. The company was founded in 1990 and is headquartered in Wan Chai, Hong Kong. Thing On Enterprise Limited is a subsidiary of Thing On Group Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.toenterprise.com",
        "market_cap": "Small Cap"
    },
    "2340.HK": {
        "short_name": "SYNERGIS HOLD",
        "long_name": "Synergis Holdings Limited",
        "summary": "Synergis Holdings Limited, an investment holding company, engages in property and facility management, interiors and special projects, and ancillary businesses in Hong Kong, China, and Macau. The company provides property and facility management services to government, corporate clients, public institutions, and private clients. It manages a portfolio of approximately 82,000 residential units and 7.6 million square meters of residential, commercial, and industrial facilities. The company also provides asset management services, such as feasibility study, market positioning, tenancy and financial management, operation management, marketing and promotion, sales and leasing, advertising, etc. In addition, it offers corporate real estate services; capital markets advisory, investment advisory, and lifestyle services; other supporting services comprising security guarding and consultancy services, as well as security systems and maintenance/repair; gardening, pest control, building exterior cleaning, carpet cleaning, and marble repair and maintenance services; cleaning services; project management, architectural design, slope inspection services, etc.; and laundry services. Further, the company provides car park management services; fitting-out, renovation and addition, and alteration works; curtain walling, cladding, and related products; procurement and supply chain services, and trading services; repair and maintenance services for equipment; indoor cleaning services; and property agency services, as well as operates as a licensed, a registered general building, and a registered specialist contractor. The company was founded in 1978 and is headquartered in Kwun Tong, Hong Kong. Synergis Holdings Limited is a subsidiary of Champ Key Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.synergis.com.hk",
        "market_cap": "Small Cap"
    },
    "4WF.F": {
        "short_name": "WHARF REAL ESTATE INV.",
        "long_name": "Wharf Real Estate Investment Company Limited",
        "summary": "Wharf Real Estate Investment Company Limited, an investment holding company, invests in, develops, constructs, owns, operates, trades in, and sells real estate properties in Hong Kong, Mainland China, and Singapore. The company operates through Investment Property, Development Property, Hotels, and Investment segments. It primarily operates Harbour City, a commercial space comprising offices, retail shops, serviced apartments, hotels and club, and car parking spaces; and Times Square, a retail space that consists of office and car parking spaces. The company also operates Wheelock House and Crawford House commercial properties; The Murray, a luxury hotel that consists of 336 rooms; Plaza Hollywood, a shopping mall with retail outlets, restaurants, and a stadium housing six-screen cinema multiplex; The Star Ferry, which provides a ferry service between Tsim Sha Tsui and Wan Chai; and Wheelock Place and Scotts Square mall. In addition, it offers leasing, finance, and management services; and accepts bank deposits. Wharf Real Estate Investment Company Limited was incorporated in 2017 and is headquartered in Kowloon, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.wharfreic.com",
        "market_cap": "Large Cap"
    },
    "8271.HK": {
        "short_name": "GDC",
        "long_name": "Global Digital Creations Holdings Limited",
        "summary": "Global Digital Creations Holdings Limited, an investment holding company, engages in the computer graphic (CG) creation and production, and property leasing and building management services in the People's Republic of China and Hong Kong. The CG Creation and Production segment is involved in the production of television series, movies, and animated films; digital virtual human; and box office receipts. This segment also holds copyrights of original animated films and animated television series. The New Cultural Space provides property leasing and building management services. The company also provides administration and management services; invests in animation business; and develops multimedia software and hardware, as well as offers related technical consultancy services. Global Digital Creations Holdings Limited was founded in 2000 and is headquartered in North Point, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.gdc-world.com",
        "market_cap": "Small Cap"
    },
    "AOP.F": {
        "short_name": "HANG LUNG P.",
        "long_name": "Hang Lung Properties Limited",
        "summary": "Hang Lung Properties Limited, an investment holding company, engages in the property investment, development, and management activities in Hong Kong and Mainland China. The company operates through Property Leasing and Property Sales segments. The company is involved in the property leasing business; and development and sale of properties. Its investment properties portfolio includes shopping malls, office, residential, serviced apartment, hotel, and car parking properties, as well as industrial premises. The company also engages in the apartment operating and management; car parking and project management; and property agency activities. In addition, it provides management and financial services. The company was incorporated in 1949 and is headquartered in Central, Hong Kong. Hang Lung Properties Limited is a subsidiary of Hang Lung Group Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hanglung.com",
        "market_cap": "Large Cap"
    },
    "DOF5.F": {
        "short_name": "PAC.CENT.PREM.  HD-,50",
        "long_name": "Pacific Century Premium Developments Limited",
        "summary": "Pacific Century Premium Developments Limited, together with its subsidiaries, develops and manages property and infrastructure projects in the Asia-Pacific region. The company also invests in residential and office buildings and properties; and provides professional property management, facilities management, asset management, and administrative services. In addition, it offers property leasing and sale agency, leasing and financing, travel agency, trademark registrant, ski operation, and hotel management services. The company is based in Hong Kong, Hong Kong. Pacific Century Premium Developments Limited is a subsidiary of Asian Motion Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.pcpd.com",
        "market_cap": "Small Cap"
    },
    "ESRCF": {
        "short_name": "ESR CAYMAN LIMITED",
        "long_name": "ESR Cayman Limited",
        "summary": "ESR Cayman Limited, together with its subsidiaries, engages in the logistics real estate development, leasing, and management activities in the Public's Republic of China, Japan, South Korea, Singapore, Australia, and India. It operates through three segments: Investment, Fund Management, and Development. The company develops, constructs, invests in, and sells logistics real estate properties. It is also involved in the fund management business. In addition, the company invests in properties, co-investments funds and investment vehicles, public REIT, and other investments. It serves e-commerce companies, 3PL providers, bricks-and-mortar retailers, manufacturers, cold-chain logistics providers, and other enterprises in various industries comprising electronics, fast-moving consumer goods, retail, food and beverage, general logistics services, auto and parts, pharmaceuticals, medical instruments, and machinery. The company was incorporated in 2011 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.esr.com",
        "market_cap": "Mid Cap"
    },
    "HKC.F": {
        "short_name": "HK CHINESE  HD 1",
        "long_name": "Hongkong Chinese Limited",
        "summary": "Hongkong Chinese Limited, an investment holding company, engages in property investment and development, healthcare services, and hotel operations. Its Property Investment segment engages in the letting and resale of properties. The company's Property Development segment is involved in the development and sale of properties. Its Treasury Investment segment invests in money markets. The company's Securities Investment segment invests in securities held-for-trading. Its Other segment engages in the provision of money lending and project management services. The company also owns a motor yacht. It has operations in Hong Kong, Mainland China, Singapore, Indonesia, and internationally. The company was founded in 1992 and is based in Hong Kong, Hong Kong. Hongkong Chinese Limited is a subsidiary of Hennessy Holdings Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.hkchinese.com.hk",
        "market_cap": "Small Cap"
    },
    "HLD.F": {
        "short_name": "HENDERSON LD DEV.",
        "long_name": "Henderson Land Development Company Limited",
        "summary": "Henderson Land Development Company Limited, an investment holding company, engages in the property development and investment activities in Hong Kong and Mainland China. The company operates through Property Development, Property Leasing, Department Stores and Supermarket-Cum-Stores Operations, Other Businesses, and Utility and Energy segments. The Property Development segment develops and sells real estate properties. Its property portfolio primarily includes offices, shopping arcades, shopping malls, commercial complexes, and residential properties. The Property Leasing segment leases properties. The Department Stores and Supermarket-Cum-Stores Operations segment operates and manages department stores and supermarket-cum-stores. The Other Businesses segment operates and manages hotels; provides construction, finance, project management, property management, agency, and cleaning and security guard services; and trades in building materials, as well as disposes leasehold land. The Utility and Energy segment is involved in production, distribution, and marketing gas; and water supply and environmentally friendly energy businesses. Henderson Land Development Company Limited was incorporated in 1976 and is based in Central, Hong Kong. Henderson Land Development Company Limited is a subsidiary of Henderson Development Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hld.com",
        "market_cap": "Large Cap"
    },
    "HLDCY": {
        "short_name": "HENDERSON LAND DEVELOPMENT CO",
        "long_name": "Henderson Land Development Company Limited",
        "summary": "Henderson Land Development Company Limited, an investment holding company, engages in the property development and investment activities in Hong Kong and Mainland China. The company operates through Property Development, Property Leasing, Department Stores and Supermarket-Cum-Stores Operations, Other Businesses, and Utility and Energy segments. The Property Development segment develops and sells real estate properties. Its property portfolio primarily includes offices, shopping arcades, shopping malls, commercial complexes, and residential properties. The Property Leasing segment leases properties. The Department Stores and Supermarket-Cum-Stores Operations segment operates and manages department stores and supermarket-cum-stores. The Other Businesses segment operates and manages hotels; provides construction, finance, project management, property management, agency, and cleaning and security guard services; and trades in building materials, as well as disposes leasehold land. The Utility and Energy segment is involved in production, distribution, and marketing gas; and water supply and environmentally friendly energy businesses. Henderson Land Development Company Limited was incorporated in 1976 and is based in Central, Hong Kong. Henderson Land Development Company Limited is a subsidiary of Henderson Development Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hld.com",
        "market_cap": "Large Cap"
    },
    "HLPPF": {
        "short_name": "HANG LUNG PROPERTIES (HLP)",
        "long_name": "Hang Lung Properties Limited",
        "summary": "Hang Lung Properties Limited, an investment holding company, engages in the property investment, development, and management activities in Hong Kong and Mainland China. The company operates through Property Leasing and Property Sales segments. The company is involved in the property leasing business; and development and sale of properties. Its investment properties portfolio includes shopping malls, office, residential, serviced apartment, hotel, and car parking properties, as well as industrial premises. The company also engages in the apartment operating and management; car parking and project management; and property agency activities. In addition, it provides management and financial services. The company was incorporated in 1949 and is headquartered in Central, Hong Kong. Hang Lung Properties Limited is a subsidiary of Hang Lung Group Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hanglung.com",
        "market_cap": "Large Cap"
    },
    "HLPPY": {
        "short_name": "HANG LUNG PROPERTIES (HLP)",
        "long_name": "Hang Lung Properties Limited",
        "summary": "Hang Lung Properties Limited, an investment holding company, engages in the property investment, development, and management activities in Hong Kong and Mainland China. The company operates through Property Leasing and Property Sales segments. The company is involved in the property leasing business; and development and sale of properties. Its investment properties portfolio includes shopping malls, office, residential, serviced apartment, hotel, and car parking properties, as well as industrial premises. The company also engages in the apartment operating and management; car parking and project management; and property agency activities. In addition, it provides management and financial services. The company was incorporated in 1949 and is headquartered in Central, Hong Kong. Hang Lung Properties Limited is a subsidiary of Hang Lung Group Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hanglung.com",
        "market_cap": "Large Cap"
    },
    "HRH.F": {
        "short_name": "CHINA OCEANWIDE HLDGS",
        "long_name": "China Oceanwide Holdings Limited",
        "summary": "China Oceanwide Holdings Limited, an investment holding company, engages in property investment, real estate development, energy, and finance investment and other activities in the United States, Indonesia, the People's Republic of China, and Hong Kong. It owns and rents two office and commercial properties in Shanghai; develops real estate properties in the United States; provides management services; invests in debt and equity securities; and develops two coal-fired steam power plants with a net capacity of 150 megawatt each in the Medan industrial zone of Indonesia. The company was formerly known as Hutchison Harbour Ring Limited and changed its name to China Oceanwide Holdings Limited in December 2014. China Oceanwide Holdings Limited is headquartered in Hong Kong, Hong Kong. China Oceanwide Holdings Limited is a subsidiary of Oceanwide Holdings International Company Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.oceanwide.hk",
        "market_cap": "Small Cap"
    },
    "HYN.F": {
        "short_name": "HYSAN DEV. CO.LTD",
        "long_name": "Hysan Development Company Limited",
        "summary": "Hysan is a leading property investment, management and development company in Hong Kong, with a portfolio of more than 4 million square feet of high-quality office, retail and residential properties. Operating primarily in the city's prime retail/office district of Causeway Bay, we are focused on delighting our customers and providing investors with outstanding returns.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.hysan.com.hk",
        "market_cap": "Mid Cap"
    },
    "HYSNY": {
        "short_name": "HYSAN DEVELOPMENT",
        "long_name": "Hysan Development Company Limited",
        "summary": "Hysan is a leading property investment, management and development company in Hong Kong, with a portfolio of more than 4 million square feet of high-quality office, retail and residential properties. Operating primarily in the city's prime retail/office district of Causeway Bay, we are focused on delighting our customers and providing investors with outstanding returns.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.hysan.com.hk",
        "market_cap": "Mid Cap"
    },
    "ICHA.F": {
        "short_name": "EVERCHINA INT.HDGS.",
        "long_name": "EverChina Int'l Holdings Company Limited",
        "summary": "EverChina Int'l Holdings Company Limited primarily engages in the property investment and hotel operations in Hong Kong, the People's Republic of China, and Bolivia. It operates through Property Investment Operation, Hotel operation, Securities Investment and Financing Operation, and Agricultural Operation segments. The company is involved in the leasing of residential and commercial properties, as well as car parking space rental; exploration, mining processing, and sale of manganese resources; securities investment activities; and provision of corporate management, and financial services. It also engages in the raising and sale of cattle, as well as agricultural farming activities; and sale of soybean, corn, and rice. The company was formerly known as Interchina Holdings Company Limited and changed its name to EverChina Int'l Holdings Company Limited in February 2014. EverChina Int'l Holdings Company Limited is based in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.everchina202.com.hk",
        "market_cap": "Small Cap"
    },
    "KWLGF": {
        "short_name": "KWG LIVING GROUP HLDGS LTD",
        "long_name": "KWG Living Group Holdings Limited",
        "summary": "KWG Living Group Holdings Limited, an investment holding company, provides various residential and non-residential property management services in the People's Republic of China. The company also offers commercial operational, real estate intermediary, and business services. As of December 31, 2020, it managed 183 residential properties with an aggregate gross floor area (GFA) under management of 29.1 million square meters; and 172 non-residential properties with an aggregate GFA under management of 12.5 million square meters. The company was founded in 2004 and is based in Kowloon, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.kwgliving.com",
        "market_cap": "Mid Cap"
    },
    "LVSDF": {
        "short_name": "LAI SUN DEVELOPMENT CO",
        "long_name": "Lai Sun Development Company Limited",
        "summary": "Lai Sun Development Company Limited, together with its subsidiaries, invests in, develops, leases, and sells real estate properties in Hong Kong, Mainland China, the United Kingdom, Vietnam, and internationally. It operates through Property Development and Sales; Property Investment; Hotel Operation; Restaurant Operation; Media and Entertainment; Film and TV Program; Cinema Operation; Theme Park Operation; and Others segments. The company also invests in, develops, operates in, and manages cultural, leisure, entertainment, and related facilities; hotels and restaurants; and provides management and consultancy services to hotels, serviced apartments, and restaurants. In addition, it engages in the development, operation, and investment of media and entertainment events; cinema operations; golf apparel retailing; and music production and distribution, as well as provision of related advertising services. Further, the company invests in, produces, licenses, and distributes television programs, films, and video format products. Additionally, the company offers property management, real estate agency, leasing agency, performance agency, and building services; and luxury yachts brokerage, charter, marketing, management, and crew placement services; and finance and treasury services. It also provides artiste management services; sells albums; distributes and licenses music and film rights; and trades in gaming products. In addition, the company distributes movie video compact discs, digital video discs, and Blu-ray discs. Further, it engages in film library management; video duplication services; and translating and subtitling of television programs. The company was incorporated in 1959 and is headquartered in Central, Hong Kong. Lai Sun Development Company Limited is a subsidiary of Lai Sun Garment (International) Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.laisun.com/lai-sun-development/en-US",
        "market_cap": "Small Cap"
    },
    "MPY.F": {
        "short_name": "GREAT WALL PAN ASI.HD-,10",
        "long_name": "Great Wall Pan Asia Holdings Limited",
        "summary": "Great Wall Pan Asia Holdings Limited, an investment holding company, engages in the property investment business in Hong Kong and internationally. The company operates through two segments, Property Investment and Financial Services. The Property Investment segment invests in retail shops, office buildings, industrial buildings and car parking spaces. The Financial Services segment provides asset management, advising on securities, loan investment, and corporate finance services; as well as deals in securities. The company was formerly known as Armada Holdings Limited and changed its name to Great Wall Pan Asia Holdings Limited in December 2016. The company is headquartered in Central, Hong Kong. Great Wall Pan Asia Holdings Limited is a subsidiary of China Great Wall AMC (International) Holdings Company Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.gwpaholdings.com",
        "market_cap": "Small Cap"
    },
    "MTK.F": {
        "short_name": "MIDLAND HLDGS LTD. HD-,10",
        "long_name": "Midland Holdings Limited",
        "summary": "Midland Holdings Limited, an investment holding company, provides property agency services in the Hong Kong, Macau, and the People's Republic of China. The company offers residential property agency services; and money lending, project planning, commercial property management, and marketing and sales planning services, as well as surveying, leasing, and property management services. It also provides immigration consultancy services; surveying consultancy services, including valuation advisory, development study, sales, marketing, tender, and auction for projects; and operates internet website. In addition, the company offers property investment services; and overseas property projects' marketing and referral services in Hong Kong. Midland Holdings Limited was founded in 1973 and is headquartered in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.midland.com.hk",
        "market_cap": "Small Cap"
    },
    "PCPDF": {
        "short_name": "PACIFIC CENTURY PREMIUM DEVELOP",
        "long_name": "Pacific Century Premium Developments Limited",
        "summary": "Pacific Century Premium Developments Limited, together with its subsidiaries, develops and manages property and infrastructure projects in the Asia-Pacific region. The company also invests in residential and office buildings and properties; and provides professional property management, facilities management, asset management, and administrative services. In addition, it offers property leasing and sale agency, leasing and financing, travel agency, trademark registrant, ski operation, and hotel management services. The company is based in Hong Kong, Hong Kong. Pacific Century Premium Developments Limited is a subsidiary of Asian Motion Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.pcpd.com",
        "market_cap": "Small Cap"
    },
    "R9HA.F": {
        "short_name": "CHINA DILI GROUP  HD -,10",
        "long_name": "China Dili Group",
        "summary": "China Dili Group, an investment holding company, engages in the operation of agriculture wholesale markets in the People's Republic of China. It leases and manages agriculture wholesale market. The company operates 10 wholesale markets in Harbin, Shenyang, Shouguang, Guiyang, Qiqihar, Mudanjiang, and Hangzhou. The company was formerly known as Renhe Commercial Holdings Company Limited and changed its name to China Dili Group in June 2019. China Dili Group was founded in 2002 and is based in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": "999077",
        "website": "http://www.diligrp.com",
        "market_cap": "Mid Cap"
    },
    "RNHEF": {
        "short_name": "CHINA DILI GROUP",
        "long_name": "China Dili Group",
        "summary": "China Dili Group, an investment holding company, engages in the operation of agriculture wholesale markets in the People's Republic of China. It leases and manages agriculture wholesale market. The company operates 10 wholesale markets in Harbin, Shenyang, Shouguang, Guiyang, Qiqihar, Mudanjiang, and Hangzhou. The company was formerly known as Renhe Commercial Holdings Company Limited and changed its name to China Dili Group in June 2019. China Dili Group was founded in 2002 and is based in Wanchai, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": "999077",
        "website": "http://www.diligrp.com",
        "market_cap": "Mid Cap"
    },
    "SW9.F": {
        "short_name": "SWIRE PROPERTIES LTD",
        "long_name": "Swire Properties Limited",
        "summary": "Swire Properties Limited, together with its subsidiaries, develops, owns, and operates mixed-use, primarily commercial properties in Hong Kong, Mainland China, the United States, and internationally. It operates through three segments: Property Investment, Property Trading, and Hotels. The company is involved in the development, leasing, and management of commercial, retail, and residential properties; development, construction, and sale of residential apartments; and operation of hotels. It also provides financial and real estate agency services. The company was incorporated in 1972 and is based in Hong Kong, Hong Kong. Swire Properties Limited is a subsidiary of Swire Pacific Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.swireproperties.com",
        "market_cap": "Large Cap"
    },
    "SWPFF": {
        "short_name": "SWIRE PROPERTIES LTD",
        "long_name": "Swire Properties Limited",
        "summary": "Swire Properties Limited, together with its subsidiaries, develops, owns, and operates mixed-use, primarily commercial properties in Hong Kong, Mainland China, the United States, and internationally. It operates through three segments: Property Investment, Property Trading, and Hotels. The company is involved in the development, leasing, and management of commercial, retail, and residential properties; development, construction, and sale of residential apartments; and operation of hotels. It also provides financial and real estate agency services. The company was incorporated in 1972 and is based in Hong Kong, Hong Kong. Swire Properties Limited is a subsidiary of Swire Pacific Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.swireproperties.com",
        "market_cap": "Large Cap"
    },
    "WARFF": {
        "short_name": "WHARF(HLDGS)",
        "long_name": "Wharf (Holdings) Limited",
        "summary": "Founded in 1886 with Hong Kong as its base, The Wharf (Holdings) Limited (Stock code: 0004) is the 17th company incorporated in Hong Kong and a premier company with a long history. As one of the 30 constituent stocks in the original Hang Seng Index since more than 50 years ago, Wharf is among the top local blue chips that is most actively traded and widely held. Backed by a long standing mission of Â\u0093Building for TomorrowÂ\u0094 and a proven track record in management and execution, the Group has produced consistent and productive performance over the years. Subsequent to the separate listing of Wharf Real Estate Investment Company Limited in November 2017 which focuses on its Hong Kong investment properties portfolio, The Wharf (Holdings) Limited's businesses are largely property-related, comprising Investment Properties, Hotels and Development Properties in Hong Kong and Mainland China. Other businesses include Logistics through Modern Terminals and Hong Kong Air Cargo Terminals. Wharf's Peak Portfolio redefines the concept of luxury living with a collection of the rare and most prestigious residences, epitomising a unique and exclusive lifestyle at the most sought-after addresses in town. Besides the highly-acclaimed Mount Nicholson, other properties under development include 1 Plantation Road, 11 Plantation Road and 77 Peak Road. Besides The Peak Portfolio, the development pipeline of Hong Kong Properties also includes the Kowloon Tong Residential Project and projects in Kowloon East. In the Mainland, Wharf spearheads its investment properties with the International Finance Square (IFS) series at the very heart of CBD or new CBD in high potential cities including Changsha, Chengdu, Chongqing, Suzhou and Wuxi. IFS developments are positioned as trendsetting landmarks with unrivalled locations, superior planning and design, retailer and shopper critical mass, as well as top-notch retail management. Changsha IFS, 2018's newest to the collection, and Chengdu IFS opened in 2014 are comparable to Harbour City in Hong Kong in scale and prominence. The boutique Chongqing IFS, featuring the largest cluster of first-tier brands in Chongqing, was opened in 2017. The Group continues to adopt a selective land acquisition policy with strategic focus on key Tier 1 or 2 cities in order to secure high quality land bank with returns. The development property landbank at the end of June 2019 totalled 3.6 million square metres. Wharf Hotels manages an expanding portfolio of 17 hotels in Asia, spearheaded by a prominent Niccolo brand in recent years. The Wharf Hotels owns four contemporary, urban, chic Niccolo hotels (including The Murray, Hong Kong and Niccolo Changsha) and manages 13 Marco Polo hotels in Hong Kong, Mainland China and the Philippines. Niccolo Suzhou is the newest addition under development and is scheduled to open in 2021. The Group also owns and operates Modern Terminals and Hong Kong Air Cargo Terminals, key components in Hong Kong's success as a hub for international trade and international transportation for decades. CME2 is the Group's long-term investment, representing a strategic initiative of reinvesting capital and profit released from the CME1 exit in Hong Kong in a progressive new economy infrastructure CME2 arena that covers much larger markets with greater growth potential. Â\u0093Building for TomorrowÂ\u0094 also extends to Wharf's Â\u0093Business-in-CommunityÂ\u0094 (Â\u0093BICÂ\u0094) pursuit. With the flagship school improvement programme Â\u0093Project WecanÂ\u0094 growing from strength to strength, the Group supports a series of BIC initiatives including Wu Zhi Qiao (Bridge to China) Charitable Foundation, Shanghai International Tower-running Grand Prix and Operation Panda with an aim of promoting BIC and to bring benefits to different segments of society.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.wharfholdings.com",
        "market_cap": "Large Cap"
    },
    "WARFY": {
        "short_name": "WHARF(HLDGS)",
        "long_name": "Wharf (Holdings) Limited",
        "summary": "Founded in 1886 with Hong Kong as its base, The Wharf (Holdings) Limited (Stock code: 0004) is the 17th company incorporated in Hong Kong and a premier company with a long history. As one of the 30 constituent stocks in the original Hang Seng Index since more than 50 years ago, Wharf is among the top local blue chips that is most actively traded and widely held. Backed by a long standing mission of Â\u0093Building for TomorrowÂ\u0094 and a proven track record in management and execution, the Group has produced consistent and productive performance over the years. Subsequent to the separate listing of Wharf Real Estate Investment Company Limited in November 2017 which focuses on its Hong Kong investment properties portfolio, The Wharf (Holdings) Limited's businesses are largely property-related, comprising Investment Properties, Hotels and Development Properties in Hong Kong and Mainland China. Other businesses include Logistics through Modern Terminals and Hong Kong Air Cargo Terminals. Wharf's Peak Portfolio redefines the concept of luxury living with a collection of the rare and most prestigious residences, epitomising a unique and exclusive lifestyle at the most sought-after addresses in town. Besides the highly-acclaimed Mount Nicholson, other properties under development include 1 Plantation Road, 11 Plantation Road and 77 Peak Road. Besides The Peak Portfolio, the development pipeline of Hong Kong Properties also includes the Kowloon Tong Residential Project and projects in Kowloon East. In the Mainland, Wharf spearheads its investment properties with the International Finance Square (IFS) series at the very heart of CBD or new CBD in high potential cities including Changsha, Chengdu, Chongqing, Suzhou and Wuxi. IFS developments are positioned as trendsetting landmarks with unrivalled locations, superior planning and design, retailer and shopper critical mass, as well as top-notch retail management. Changsha IFS, 2018's newest to the collection, and Chengdu IFS opened in 2014 are comparable to Harbour City in Hong Kong in scale and prominence. The boutique Chongqing IFS, featuring the largest cluster of first-tier brands in Chongqing, was opened in 2017. The Group continues to adopt a selective land acquisition policy with strategic focus on key Tier 1 or 2 cities in order to secure high quality land bank with returns. The development property landbank at the end of June 2019 totalled 3.6 million square metres. Wharf Hotels manages an expanding portfolio of 17 hotels in Asia, spearheaded by a prominent Niccolo brand in recent years. The Wharf Hotels owns four contemporary, urban, chic Niccolo hotels (including The Murray, Hong Kong and Niccolo Changsha) and manages 13 Marco Polo hotels in Hong Kong, Mainland China and the Philippines. Niccolo Suzhou is the newest addition under development and is scheduled to open in 2021. The Group also owns and operates Modern Terminals and Hong Kong Air Cargo Terminals, key components in Hong Kong's success as a hub for international trade and international transportation for decades. CME2 is the Group's long-term investment, representing a strategic initiative of reinvesting capital and profit released from the CME1 exit in Hong Kong in a progressive new economy infrastructure CME2 arena that covers much larger markets with greater growth potential. Â\u0093Building for TomorrowÂ\u0094 also extends to Wharf's Â\u0093Business-in-CommunityÂ\u0094 (Â\u0093BICÂ\u0094) pursuit. With the flagship school improvement programme Â\u0093Project WecanÂ\u0094 growing from strength to strength, the Group supports a series of BIC initiatives including Wu Zhi Qiao (Bridge to China) Charitable Foundation, Shanghai International Tower-running Grand Prix and Operation Panda with an aim of promoting BIC and to bring benefits to different segments of society.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.wharfholdings.com",
        "market_cap": "Large Cap"
    },
    "WHA.F": {
        "short_name": "WHARF (HLDGS) LTD",
        "long_name": "Wharf (Holdings) Limited",
        "summary": "Founded in 1886 with Hong Kong as its base, The Wharf (Holdings) Limited (Stock code: 0004) is the 17th company incorporated in Hong Kong and a premier company with a long history. As one of the 30 constituent stocks in the original Hang Seng Index since more than 50 years ago, Wharf is among the top local blue chips that is most actively traded and widely held. Backed by a long standing mission of Â\u0093Building for TomorrowÂ\u0094 and a proven track record in management and execution, the Group has produced consistent and productive performance over the years. Subsequent to the separate listing of Wharf Real Estate Investment Company Limited in November 2017 which focuses on its Hong Kong investment properties portfolio, The Wharf (Holdings) Limited's businesses are largely property-related, comprising Investment Properties, Hotels and Development Properties in Hong Kong and Mainland China. Other businesses include Logistics through Modern Terminals and Hong Kong Air Cargo Terminals. Wharf's Peak Portfolio redefines the concept of luxury living with a collection of the rare and most prestigious residences, epitomising a unique and exclusive lifestyle at the most sought-after addresses in town. Besides the highly-acclaimed Mount Nicholson, other properties under development include 1 Plantation Road, 11 Plantation Road and 77 Peak Road. Besides The Peak Portfolio, the development pipeline of Hong Kong Properties also includes the Kowloon Tong Residential Project and projects in Kowloon East. In the Mainland, Wharf spearheads its investment properties with the International Finance Square (IFS) series at the very heart of CBD or new CBD in high potential cities including Changsha, Chengdu, Chongqing, Suzhou and Wuxi. IFS developments are positioned as trendsetting landmarks with unrivalled locations, superior planning and design, retailer and shopper critical mass, as well as top-notch retail management. Changsha IFS, 2018's newest to the collection, and Chengdu IFS opened in 2014 are comparable to Harbour City in Hong Kong in scale and prominence. The boutique Chongqing IFS, featuring the largest cluster of first-tier brands in Chongqing, was opened in 2017. The Group continues to adopt a selective land acquisition policy with strategic focus on key Tier 1 or 2 cities in order to secure high quality land bank with returns. The development property landbank at the end of June 2019 totalled 3.6 million square metres. Wharf Hotels manages an expanding portfolio of 17 hotels in Asia, spearheaded by a prominent Niccolo brand in recent years. The Wharf Hotels owns four contemporary, urban, chic Niccolo hotels (including The Murray, Hong Kong and Niccolo Changsha) and manages 13 Marco Polo hotels in Hong Kong, Mainland China and the Philippines. Niccolo Suzhou is the newest addition under development and is scheduled to open in 2021. The Group also owns and operates Modern Terminals and Hong Kong Air Cargo Terminals, key components in Hong Kong's success as a hub for international trade and international transportation for decades. CME2 is the Group's long-term investment, representing a strategic initiative of reinvesting capital and profit released from the CME1 exit in Hong Kong in a progressive new economy infrastructure CME2 arena that covers much larger markets with greater growth potential. Â\u0093Building for TomorrowÂ\u0094 also extends to Wharf's Â\u0093Business-in-CommunityÂ\u0094 (Â\u0093BICÂ\u0094) pursuit. With the flagship school improvement programme Â\u0093Project WecanÂ\u0094 growing from strength to strength, the Group supports a series of BIC initiatives including Wu Zhi Qiao (Bridge to China) Charitable Foundation, Shanghai International Tower-running Grand Prix and Operation Panda with an aim of promoting BIC and to bring benefits to different segments of society.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.wharfholdings.com",
        "market_cap": "Large Cap"
    },
    "WRFRF": {
        "short_name": "WHARF REAL ESTATE INVESTMENT CO",
        "long_name": "Wharf Real Estate Investment Company Limited",
        "summary": "Wharf Real Estate Investment Company Limited, an investment holding company, invests in, develops, constructs, owns, operates, trades in, and sells real estate properties in Hong Kong, Mainland China, and Singapore. The company operates through Investment Property, Development Property, Hotels, and Investment segments. It primarily operates Harbour City, a commercial space comprising offices, retail shops, serviced apartments, hotels and club, and car parking spaces; and Times Square, a retail space that consists of office and car parking spaces. The company also operates Wheelock House and Crawford House commercial properties; The Murray, a luxury hotel that consists of 336 rooms; Plaza Hollywood, a shopping mall with retail outlets, restaurants, and a stadium housing six-screen cinema multiplex; The Star Ferry, which provides a ferry service between Tsim Sha Tsui and Wan Chai; and Wheelock Place and Scotts Square mall. In addition, it offers leasing, finance, and management services; and accepts bank deposits. Wharf Real Estate Investment Company Limited was incorporated in 2017 and is headquartered in Kowloon, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.wharfreic.com",
        "market_cap": "Large Cap"
    },
    "YSG.F": {
        "short_name": "SILVER GR.INTL HLGDS GR.",
        "long_name": "Silver Grant International Holdings Group Limited",
        "summary": "Silver Grant International Holdings Group Limited, an investment holding company, engages in the property investment and securities trading businesses in the People's Republic of China. It operates through Investments and Property Leasing segments. The company primarily invests in and develops residential and commercial properties, as well as financial assets. It also engages in the environmental conservation and renewable energy business; and property rental business. The company was formerly known as Silver Grant International Industries Limited and changed its name to Silver Grant International Holdings Group Limited in May 2019. The company is based in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.silvergrant.com.hk",
        "market_cap": "Small Cap"
    }
}