{
    "0009.HK": {
        "short_name": "KEYNE LTD",
        "long_name": "Keyne Ltd",
        "summary": "Keyne Ltd, an investment holding company, primarily engages in the property and hotel development business in Hong Kong and Mainland China. The company is involved in the property rental and centralized heat supply businesses. It also provides management services. The company was formerly known as Nine Express Limited and changed its name to Keyne Ltd in March 2020. The company was incorporated in 2001 and is headquartered in Causeway Bay, Hong Kong. Keyne Ltd is a subsidiary of Keyne Holdings Ltd.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Causeway Bay",
        "zipcode": null,
        "website": "http://www.keyneltd.com",
        "market_cap": 235540144
    },
    "0034.HK": {
        "short_name": "KOWLOON DEV",
        "long_name": "Kowloon Development Company Limited",
        "summary": "Kowloon Development Company Limited, an investment holding company, engages in the investment, development, and management of properties in Hong Kong and Mainland China. The company develops, leases, and sells various residential and commercial projects, such as club houses, car parking facilities, retail shops, shopping arcades, and residential towers, as well as hotels and office buildings. As of December 31, 2020, its land bank for development totaled to approximately 3.7 million square meters of gross floor area. The company also provides security, technical, and housekeeping services; building surveying and guarding services; financial investments and services; and project management services, as well as undertakes construction contracts. In addition, it engages in the treasury operations; retail activities; and distribution of films and cinematograph films. The company was incorporated in 1961 and is headquartered in Mong Kok, Hong Kong. Kowloon Development Company Limited is a subsidiary of Intellinsight Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Mong Kok",
        "zipcode": null,
        "website": "http://www.kdc.com.hk",
        "market_cap": 10883827712
    },
    "0035.HK": {
        "short_name": "FE CONSORT INTL",
        "long_name": "Far East Consortium International Limited",
        "summary": "Far East Consortium International Limited, an investment holding company, engages in the property development and investment, hotel operations and management, car park operations and facilities management, gaming operations and management, and treasury management businesses. It develops a portfolio of residential properties; invests in retail and office buildings; and operates hotels. The company also operates third party and self-owned car parks; and owns and operates casinos and gaming facilities. In addition, it provides loan financing, sales agency, mortgage, administration and management, vault, and hotel management and consultancy services, as well as engages in the securities and financial investment activities. As of March 31, 2020, the company owned and operated 31 hotels with approximately 8,100 rooms; and managed 470 car parks with approximately 106,696 car parking bays. It has operations in Australia, New Zealand, the Czech Republic, Hong Kong, Malaysia, the People's Republic of China, Singapore, the United Kingdom, and the rest of Europe. The company is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.fecil.com.hk",
        "market_cap": 6873879040
    },
    "0081.HK": {
        "short_name": "CH OVS G OCEANS",
        "long_name": "China Overseas Grand Oceans Group Limited",
        "summary": "China Overseas Grand Oceans Group Limited, together with its subsidiaries, invests in, develops, and leases real estate properties in the People's Republic of China. It operates through Property Investment and Development, Property Leasing, and Other segments. The Property Investment and Development segment constructs residential and commercial properties. The Property Leasing segment leases office units, commercial units, and hotel properties. The Other segment operates a hotel. It is also involved in fund raising activities; and provision of financing and investment, and property management services. The company was formerly known as Shell Electric Manufacturing (Holdings) Co. Ltd. and changed its name to China Overseas Grand Oceans Group Limited in March 2010. China Overseas Grand Oceans Group Limited was founded in 1955 and is based in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.cogogl.com.hk",
        "market_cap": 17048333312
    },
    "0088.HK": {
        "short_name": "TAI CHEUNG HOLD",
        "long_name": "Tai Cheung Holdings Limited",
        "summary": "Tai Cheung Holdings Limited, an investment holding company, engages in the property investment, development, and management activities in Hong Kong. The company's property portfolio includes office towers, and industrial and residential buildings. It also provides construction and corporate secretary services. The company was founded in 1956 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.taicheung.com",
        "market_cap": 2957973504
    },
    "0095.HK": {
        "short_name": "LVGEM CHINA",
        "long_name": "LVGEM (China) Real Estate Investment Company Limited",
        "summary": "LVGEM (China) Real Estate Investment Company Limited, an investment holding company, engages in property development and investment businesses in the People's Republic of China. The company operates through Real Estate Development and Sales, Commercial Property Investment and Operations, and Comprehensive Services segments. It develops and sells properties; invests in, operates, and leases commercial properties, office premises, apartments, and car parks; operates hotels; and offers property management, consultancy, and other services to customers and tenants of its residential and commercial properties. LVGEM (China) Real Estate Investment Company Limited was founded in 1995 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.lvgem-china.com",
        "market_cap": 10754458624
    },
    "0106.HK": {
        "short_name": "LANDSEA PPT",
        "long_name": "Landsea Green Properties Co., Ltd.",
        "summary": "Landsea Green Properties Co., Ltd., an investment holding company, develops and sells properties in Mainland China and the United States. The company operates through Property Development and Sales in Mainland China, Property Development and Sales in the US, Management Services, and Office Property Investment segments. It is also involved in the property leasing, decoration and design, marketing, and financial and elderly care services businesses. The company was formerly known as Landsea Green Group Co., Ltd. and changed its name to Landsea Green Properties Co., Ltd. in November 2019. The company was founded in 2001 and is headquartered in Central, Hong Kong. Landsea Green Properties Co., Ltd. is a subsidiary of Greensheid Corporation.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.landsea.hk",
        "market_cap": 2502824192
    },
    "0123.HK": {
        "short_name": "YUEXIU PROPERTY",
        "long_name": "Yuexiu Property Company Limited",
        "summary": "Yuexiu Property Company Limited, together with its subsidiaries, develops, sells, and manages properties primarily in Mainland China and Hong Kong. It operates through Property Development, Property Management, Property Investment, and Other segments. The company is also involved in holding investment properties. In addition, it offers property development and management consulting, property rental, decoration and design, project management, real estate and property agency, investment consulting, metal manufacturing, information consulting, car parking management, financial, building management, commercial, greening, construction, and trade finance services. As of December 31, 2020, the company owned investment properties under lease of approximately 774,000 sq.m. comprising offices, commercial properties, car parks, and others; and a total landbank of approximately 24.54 million sq.m. The company was formerly known as Guangzhou Investment Company Limited. The company was incorporated in 1992 and is based in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.yuexiuproperty.com",
        "market_cap": 29261547520
    },
    "0124.HK": {
        "short_name": "GD LAND",
        "long_name": "Guangdong Land Holdings Limited",
        "summary": "Guangdong Land Holdings Limited, an investment holding company, engages in property development and investment businesses primarily in Mainland China. The company was formerly known as Kingway Brewery Holdings Limited and changed its name to Guangdong Land Holdings Limited in September 2013. The company was incorporated in 1997 and is headquartered in Central, Hong Kong and is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange. Guangdong Land Holdings Ltd. is a subsidiary of Guangdong Investment Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.gdland.com.hk",
        "market_cap": 1831347840
    },
    "0131.HK": {
        "short_name": "CHEUK NANG HOLD",
        "long_name": "Cheuk Nang (Holdings) Limited",
        "summary": "Cheuk Nang (Holdings) Limited, an investment holding company, engages in the investment, development, management, and trading of properties in the People's Republic of China, Hong Kong, and Malaysia. It operates through Property Sales, Property Rental, Estate Management, and Others segments. The company develops residential, commercial, and retail properties. It is also involved in the provision of secretarial and management services; and securities trading and debentures, and mortgage lending activities. The company was formerly known as Far East Wool & Fibre Mill, Limited and changed its name to Cheuk Nang (Holdings) Limited in 1988. The company was founded in 1963 and is based in Wan Chai, Hong Kong. Cheuk Nang (Holdings) Limited is a subsidiary of Yan Yin Company Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.cheuknang.com.hk",
        "market_cap": 1807915264
    },
    "0160.HK": {
        "short_name": "HON KWOK LAND",
        "long_name": "Hon Kwok Land Investment Company, Limited",
        "summary": "Hon Kwok Land Investment Company, Limited, an investment holding company, engages in the property development, investment, and related activities in Hong Kong and Mainland China. It operates through three segments: Property Development; Property Investment; and Property, Carpark Management, and Others. The company's properties include commercial/office buildings, hotels, serviced apartment, and residential buildings. It also provides management services for residential and commercial properties. In addition, the company engages in carpark management, property holding and letting, project management, and sub-leasing activities. Further, it provides nominee, financing, and money lending services. The company is based in Central, Hong Kong. Hon Kwok Land Investment Company, Limited is a subsidiary of Chinney Investments, Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.honkwok.com.hk",
        "market_cap": 2290964224
    },
    "0163.HK": {
        "short_name": "EMPEROR INT'L",
        "long_name": "Emperor International Holdings Limited",
        "summary": "Emperor International Holdings Limited, an investment holding company, engages in the property investment and development, and hospitality activities in Hong Kong, Macau, the United Kingdom, and the People's Republic of China. It operates through Lease of Properties, Properties Development, and Hotel and Hotel Related Operations segments. The Lease of Properties segment rents properties. The Properties Development segment engages in the development and redevelopment of properties for sale. The Hotel and Hotel Related Operations segment operates the Emperor Hotel, MORI MORI serviced apartments, the unit serviced apartments, Grand Emperor Hotel, and Inn Hotel Macau; and mass market halls, VIP rooms, and slot machine halls, as well as provides gaming-related marketing and public relation services. The company's property portfolio includes residential properties, retail spaces, shopping malls, and industrial and commercial buildings. In addition, it provides project financing and management, treasury service, property agency, and catering services. The company was founded in 1990 is headquartered in Wan Chai, Hong Kong. Emperor International Holdings Limited is a subsidiary of Emperor International Group Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.emperorint.com",
        "market_cap": 4302733312
    },
    "0169.HK": {
        "short_name": "WANDA HOTEL DEV",
        "long_name": "Wanda Hotel Development Company Limited",
        "summary": "Wanda Hotel Development Company Limited, an investment holding company, engages in the property development, investment, leasing, and management activities in the People's Republic of China. The company operates through three segments: Hotel Operation and Management Services, Hotel Design and Construction Management Services, and Investment Properties Leasing. It develops, leases, and sells commercial and residential properties. The company also engages in the design, development, construction, operation, and management of hotels, as well as provides construction consulting services; and sells goods. As of 31 December 2020, it manages, leases, operates, and franchises 94 hotels that consists of 25,473 rooms under the Wanda Reign, Wanda Vista, Wanda Realm, Wanda Jin, Wanda Yi, Wanda Moments, and Wanda Yue brands in the People's Republic of China. The company was formerly known as Wanda Commercial Properties (Group) Co., Limited and changed its name to Wanda Hotel Development Company Limited in October 2014. The company is based in Central, Hong Kong. Wanda Hotel Development Company Limited is a subsidiary of Wanda Commercial Properties Overseas Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.wanda-hotel.com.hk",
        "market_cap": 2325188352
    },
    "0173.HK": {
        "short_name": "K. WAH INT'L",
        "long_name": "K. Wah International Holdings Limited",
        "summary": "K. Wah International Holdings Limited, an investment holding company, engages in the property development and investment activities in Hong Kong and Mainland China. Its property portfolio comprises residential developments, office towers, hotels, serviced apartments, and commercial facilities. The company also provides property management services to residential buildings, commercial facilities, office towers, and real estate complexes. In addition, it offers financial, management, and decoration services. K. Wah International Holdings Limited was incorporated in 1990 and is headquartered in North Point, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.kwih.com",
        "market_cap": 12038834176
    },
    "0185.HK": {
        "short_name": "ZENSUN ENT",
        "long_name": "Zensun Enterprises Limited",
        "summary": "Zensun Enterprises Limited, an investment holding company, engages in the property development, property investment and management, and securities trading and investment businesses. The company also offers loan financing services. It has operations in Hong Kong, the People's Republic of China, Singapore, Japan, and the United States. The company was formerly known as ZH International Holdings Limited and changed its name to Zensun Enterprises Limited in July 2019. The company was founded in 1965 and is headquartered in Central, Hong Kong. Zensun Enterprises Limited is a subsidiary of Joy Town Inc.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.zensunenterprises.com",
        "market_cap": 11671680000
    },
    "0190.HK": {
        "short_name": "HKC (HOLDINGS)",
        "long_name": "HKC (Holdings) Limited",
        "summary": "HKC (Holdings) Limited, together with its subsidiaries, engages in the property development and investment, and renewable energy investment and operation businesses in the People's Republic of China. It operates through Properties Development, Property Investment and Leasing, Renewable Energy, and Other Operations segments. The company develops and builds residential properties, including townhouses, high-rise apartments, and commercial shops; and invests in shopping malls and offices, as well as properties for restaurants and retails. It also holds properties; develops and operates building materials center; owns and operates wind power and distributed solar projects; and provides property management services. The company was incorporated in 2006 and is headquartered in Tsim Sha Tsui, Hong Kong. HKC (Holdings) Limited is a subsidiary of Claudio Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.hkcholdings.com",
        "market_cap": 4139699456
    },
    "0191.HK": {
        "short_name": "LAI SUN INT'L",
        "long_name": "Lai Sun Garment (International) Limited",
        "summary": "Lai Sun Garment (International) Limited, an investment holding company, invests in, develops, leases, manages, and sells properties. The company operates through Property Development and Sales, Property Investment, Hotel Operation, Restaurant Operation, Media and Entertainment, Film and TV Program, Cinema Operation, Theme Park Operation, and Others segments. Its property portfolio includes commercial/retail, office, industrial, residential, and hotel/serviced apartment properties. The company also invests in, develops, operates, and manages hotels and restaurants, cultural, leisure, entertainment, and related facilities; and provides management and consultancy services to hotels, restaurants, and serviced apartments. In addition, it engages in the development, operation, and investment of media, entertainment, and music production and distribution; and cinema operations, as well as provides related advertising services. Further, the company invests in, produces, sells, licenses, and distributes television programs, films, and video format products, as well as engages in golf apparel retailing. Additionally, the company offers property management, real estate agency, performance agency, leasing agency, and building services; luxury yachts brokerage, charter, marketing, management, and crew placement services; and finance and treasury services. It also provides artiste management services; sells albums; distributes and licenses music; trades in gaming products; and develops and operates theme parks. The company is involved in the film library management, central kitchen operation, and video duplication services, as well as translating and subtitling of television programs. It operates in Hong Kong, the United Kingdom, Vietnam, Mainland China, Macau, and internationally. Lai Sun Garment (International) Limited was founded in 1947 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.laisun.com/lai-sun-garment/en-US",
        "market_cap": 2520562688
    },
    "0194.HK": {
        "short_name": "LIU CHONG HING",
        "long_name": "Liu Chong Hing Investment Limited",
        "summary": "Liu Chong Hing Investment Limited, an investment holding company, engages in the investment, development, management, and letting of real estate properties in Hong Kong and the People's Republic of China. The company operates through Property Investment, Property Development, Property Management, Treasury Investment, Trading and Manufacturing, and Hotel Operation segments. Its projects primarily include offices, commercial buildings, residential buildings, industrial buildings, and shopping centers, as well as retail stores. The company also provides money lending and nominee services; operates and manages budget hotels under the Hanting name, as well as 183-room hotel and serviced residences; manufactures magnetic materials; and deals and invests in securities and other financial instruments, as well as develops and sells properties, including interior decoration services. In addition, it is involved in the food and beverage business. The company was incorporated in 1970 and is based in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.lchi.com.hk",
        "market_cap": 3134667264
    },
    "0208.HK": {
        "short_name": "POLYTEC ASSET",
        "long_name": "Polytec Asset Holdings Limited",
        "summary": "Polytec Asset Holdings Limited, an investment holding company, primarily invests in, develops, and trades in real estate properties in the People's Republic of China and Kazakhstan. The company operates through four segments: Properties, Oil, Ice and Cold Storage, and Financial Investments. It develops residential and commercial properties. The company has a development land bank of 294,000 square meters; and investment land bank of approximately 18,000 square meters in Macau. It is also involved in the oil exploration and production activities in Kazakhstan; manufacturing and trading ice; the provision of cold storage and consultancy services; and general trading activities. In addition, the company involved in equity and debt securities. The company was formerly known as Kin Don Holdings Limited and changed its name to Polytec Asset Holdings Limited in January 2004. The company was incorporated in 1998 and is headquartered in Kowloon, Hong Kong. Polytec Asset Holdings Limited is a subsidiary of Marble King International Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.polytecasset.com",
        "market_cap": 6614065152
    },
    "0216.HK": {
        "short_name": "CHINNEY INV",
        "long_name": "Chinney Investments, Limited",
        "summary": "Chinney Investments, Limited, an investment holding company, primarily engages in the property development and investment activities in Hong Kong and Mainland China. It operates through three segments: Property Development; Property Investment; and Property, Carpark Management and Others. The company is also involved in sub-leasing business, as well as offers management services to residential and commercial properties. It also offers property holding and letting, project management, carpark management, nominee, financing, and money lending services. The company was incorporated in 1959 and is based in Central, Hong Kong. Chinney Investments, Limited is a subsidiary of Chinney Holdings Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.chinneygroup.com/",
        "market_cap": 1075167616
    },
    "0230.HK": {
        "short_name": "MINMETALS LAND",
        "long_name": "Minmetals Land Limited",
        "summary": "Minmetals Land Limited, an investment holding company, engages in the real estate development business in the People's Republic of China. It operates through Real Estate Development, Specialized Construction, Property Investment, and Securities Investment segments. The company develops and sells residential and commercial properties; and designs, installs, and sells curtain walls, as well as aluminum windows, doors, and other materials. It also holds and rents properties; invests in securities; and provides management, property management, and fund-raising services. The company is based in Tsim Sha Tsui, Hong Kong. Minmetals Land Limited is a subsidiary of June Glory International Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.minmetalsland.com",
        "market_cap": 2844873472
    },
    "0262.HK": {
        "short_name": "DESON DEV INT'L",
        "long_name": "Deson Development International Holdings Limited",
        "summary": "Deson Development International Holdings Limited, an investment holding company, primarily engages in the property investment and development businesses in Hong Kong and Mainland China. It invests in and develops residential and commercial properties. The company also trades in medical equipment, and home security and automation products, as well as provides related installation and maintenance services; wellness, health care, and cosmetic products; and wellness and pandemic prevention products. It offers wired and wireless security devices and systems, which are used in various applications, such as residential estates, commercial offices, shops, hotels, hospitals, museums, and prisons; and operates property funds. Deson Development International Holdings Limited was founded in 1988 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.deson.com",
        "market_cap": 122235000
    },
    "0298.HK": {
        "short_name": "CHUANG'S CHINA",
        "long_name": "Chuang's China Investments Limited",
        "summary": "Chuang's China Investments Limited, an investment holding company, engages in the property development, investment, and trading activities in the People's Republic of China, Hong Kong, the United Kingdom, and Malaysia. The company develops, sells, rents, and manages commercial and residential properties; and operates and manages hotels. It is also involved in the sale of goods and merchandises, including art pieces; provision of securities investment and trading services; development and construction of cemeteries and provision of related management services; and money lending activities. The company is headquartered in Central, Hong Kong. Chuang's China Investments Limited is a subsidiary of Profit Stability Investments Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.chuangs-china.com",
        "market_cap": 1080466432
    },
    "0485.HK": {
        "short_name": "CHINASINOSTAR",
        "long_name": "China Sinostar Group Company Limited",
        "summary": "China Sinostar Group Company Limited, an investment holding company, engages in the development and sale of properties in the People's Republic of China. It is also involved in the operation and management of hydroelectric power stations; and property investment and management businesses. The company was formerly known as Shihua Development Company Limited and changed its name to China Sinostar Group Company Limited in October 2016. The company was founded in 1969 and is based in Cheung Sha Wan, Hong Kong. China Sinostar Group Company Limited is a subsidiary of Achieve Prosper Capital Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Cheung Sha Wan",
        "zipcode": null,
        "website": "http://www.00485.hk",
        "market_cap": 54274200
    },
    "0618.HK": {
        "short_name": "PKU RESOURCES",
        "long_name": "Peking University Resources (Holdings) Company Limited",
        "summary": "Peking University Resources (Holdings) Company Limited, together with its subsidiaries, distributes information products, and invests in and develops properties in Mainland China and Hong Kong. The company primarily distributes servers, printers, switches, networking products, storage devices, workstations, optical screen products, video conference hosts, conference controllers, codec, UPS power supply products, and notebook computer of various manufacturers, such as HP, H3C, CommScope, Brocade, Microsoft, Corning, Lenovo, Huawei, DELL, IBM, Netgear, CommScope, and SGi. It also acts as a distribution channel for the products of other IT companies, such as LifeSize, BARCO, CommScope, Fujitsu, Samsung, Uniview, Corning, Brocade, Librestream, Ruckus, and Impinj. In addition, the company leases and subleases, and sells properties. The company was formerly known as EC-Founder (Holdings) Company Limited and changed its name to Peking University Resources (Holdings) Company Limited in December 2013. Peking University Resources (Holdings) Company Limited is headquartered in Tsuen Wan, Hong Kong. Peking University Resources (Holdings) Company Limited is a subsidiary of Founder Information (Hong Kong) Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.pku-resources.com",
        "market_cap": 1039417856
    },
    "0683.HK": {
        "short_name": "KERRY PPT",
        "long_name": "Kerry Properties Limited",
        "summary": "Kerry Properties Limited, an investment holding company, engages in the development, investment, management, and trading of properties in Hong Kong, the People's Republic of China, and the Asia Pacific region. The company also owns and operates hotels; and offers logistics and freight forwarding, consultancy, administrative support, project management, financial, IT system and consultancy, estate agency, and construction services. In addition, it is involved in the warehouse operations, as well as operation of restaurants, recreation parks, and ice rinks. The company was incorporated in 1978 and is headquartered in Quarry Bay, Hong Kong. Kerry Properties Limited is a subsidiary of Kerry Group Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.kerryprops.com",
        "market_cap": 38305947648
    },
    "0754.HK": {
        "short_name": "HOPSON DEV-100",
        "long_name": "Hopson Development Holdings Limited",
        "summary": "Hopson Development Holdings Limited, an investment holding company, primarily develops residential properties in the People's Republic of China and Hong Kong. The company operates through Property Development, Commercial Properties Investment, Property Management, Infrastructure, and Investments segments. It invests in and rents properties; manages restaurants, hotels, and properties; and operates hotels. The company also provides construction, water supply, clubhouse and residential, consultancy, and architectural design services. In addition, it engages in design and renovation services; sale of properties; and decoration activities. The company was founded in 1992 and is headquartered in Central, Hong Kong. Hopson Development Holdings Limited is a subsidiary of Sounda Properties Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hopson.com.cn",
        "market_cap": 73096617984
    },
    "0755.HK": {
        "short_name": "SHANGHAI ZENDAI",
        "long_name": "Shanghai Zendai Property Limited",
        "summary": "Shanghai Zendai Property Limited, an investment holding company, invests in, develops, and sells commercial and residential properties in the People's Republic of China. It also provides properties rental, management, and agency services. In addition, the company engages in the operation of hotels. Shanghai Zendai Property Limited is headquartered in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.zendaiproperty.com",
        "market_cap": 907643392
    },
    "0813.HK": {
        "short_name": "SHIMAO GROUP",
        "long_name": "Shimao Group Holdings Limited",
        "summary": "Shimao Group Holdings Limited, an investment holding company, engages in the property development and investment activities in the People's Republic of China. The company develops residential and commercial properties; and operates hotels and shopping malls. It is also involved in the trading of construction materials; and property management activities. The company was formerly known as Shimao Property Holdings Limited and changed its name to Shimao Group Holdings Limited in May 2020. Shimao Group Holdings Limited was incorporated in 2004 and is based in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.shimaogroup.hk",
        "market_cap": 75630379008
    },
    "0817.HK": {
        "short_name": "CHINA JINMAO",
        "long_name": "China Jinmao Holdings Group Limited",
        "summary": "China Jinmao Holdings Group Limited, an investment holding company, operates in real estate and hotel businesses in Mainland China. It operates in four segments: City and Property Development, Commercial Leasing and Retail Operations, Hotel Operations, and Others. The City and Property Development segment develops city complexes and properties, as well as develops land. The Commercial Leasing and Retail Operations segment engages in the leasing of office and retail commercial premises. This segment has twelve investment properties with an area of approximately 0.80 million square meters. The Hotel Operations segment provides hotel accommodation, and food and beverages services. This segment operates ten luxury hotels that offers 3,968 guest rooms. The Others segment offers property management, and design and decoration services, as well as operates an observation deck. The company also engages in technology and services business. It holds 277 projects of city operations and property development, commercial leasing and retail operations, and hotel operations. The company was formerly known as Franshion Properties (China) Limited and changed its name to China Jinmao Holdings Group Limited in September 2015. China Jinmao Holdings Group Limited was incorporated in 2004 and is based in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.chinajinmao.cn",
        "market_cap": 36790272000
    },
    "0845.HK": {
        "short_name": "GLORIOUS PPT H",
        "long_name": "Glorious Property Holdings Limited",
        "summary": "Glorious Property Holdings Limited, an investment holding company, invests in, develops, and sells real estate properties in the People's Republic of China. It develops residential, commercial, serviced apartment, office, and hotel projects. As of December 31, 2020, the company had a total land bank of 6.6 million square meters in Shanghai region, Yangtze River Delta, Pan Bohai Rim, and Northeast China. It is also involved in the provision of corporate, culture, advertising planning, investment holding, advisory, business consulting, interior and exterior decoration, renovation, business management, property leasing, and hotel operation and property management services; and wholesale of construction materials, mechanical equipment, and building materials. The company was founded in 1996 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.gloriousphl.com.cn",
        "market_cap": 1854650752
    },
    "0865.HK": {
        "short_name": "JIANDE INT'L",
        "long_name": "Jiande International Holdings Limited",
        "summary": "Jiande International Holdings Limited, an investment holding company, engages in the development and sale of properties in the People's Republic of China. It also provides building management services. The company is headquartered in North Point, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.jiande-intl.com",
        "market_cap": 449525216
    },
    "0983.HK": {
        "short_name": "SOCAM DEV",
        "long_name": "SOCAM Development Limited",
        "summary": "SOCAM Development Limited, an investment holding company, engages in the property and construction businesses in the People's Republic of China and Hong Kong. It operates through Property, Construction and Building Maintenance, and Other Businesses segments. It undertakes the construction of public housings, offices/SOHO, and retail facilities, as well as commercial, residential, and institutional buildings. The company is involved in property, investment, development, and management activities; and interior fitting out, and building renovation and premise maintenance activities. In addition, it provides venture capital investment, design and contracting, management, and consultancy services, as well as structural steel construction works; and owns and leases plants and machineries. The company was formerly known as Shui On Construction and Materials Limited and changed its name to SOCAM Development Limited in September 2011. SOCAM Development Limited is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.socam.com",
        "market_cap": 636473216
    },
    "1176.HK": {
        "short_name": "ZHUGUANG HOLD",
        "long_name": "Zhuguang Holdings Group Company Limited",
        "summary": "Zhuguang Holdings Group Company Limited, an investment holding company, engages in the development, investment, management, sale, and rental of properties in the People's Republic of China. It operates through three segments: Property Development, Property Investment, and Project Management Services. The company holds interest in a portfolio of property development projects in Hebei and Guangdong provinces. It also provides property trading, construction and management, and other property development related services. The company was incorporated in 1996 and is based in Central, Hong Kong. Zhuguang Holdings Group Company Limited is a subsidiary of Rong De Investments Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.zhuguang.com.hk",
        "market_cap": 13597454336
    },
    "1201.HK": {
        "short_name": "TESSON HOLDINGS",
        "long_name": "Tesson Holdings Limited",
        "summary": "Tesson Holdings Limited, an investment holding company, engages in the lithium-ion motive battery business in the People's Republic of China. It operates through Lithium Ion Motive Battery Business, and Property and Cultural Business. The company manufactures, sells, and trades in lithium-ion motive batteries, lithium-ion battery modules, battery charging devices, and battery material machines and production lines. It also provides new energy solutions and related equipment, such as electric passenger car power battery, electric logistics vehicle power battery, electric passenger car power battery, electric tool power battery, garden tool power battery, industrial energy storage, and home energy storage systems for the use in new energy vehicles, energy storage, aerospace, military equipment, electric motorcycle and special vehicle, and electric equipment applications. In addition, the company is involved in the sale of equipment; import and export trading activities; and operation of research and development center. Further, it engages in the planning and organization of cultural events, performance creativity and execution, creation and shooting of documentary film and TV works, museum creative planning, design and construction, execution of the combination of cultural, business, and tourism, etc., as well as event production and themed museums, and architectural design and engineering businesses; property holding activities; and property development activities comprising industrial residential projects. The company was formerly known as Kith Holdings Limited and changed its name to Tesson Holdings Limited in June 2015. Tesson Holdings Limited was founded in 1982 and is headquartered in Tsim Sha Tsui, Hong Kong. Tesson Holdings Limited is a subsidiary of Double Key International Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.tessonholdings.com",
        "market_cap": 508508256
    },
    "1218.HK": {
        "short_name": "EASYKNIT INT'L",
        "long_name": "Easyknit International Holdings Limited",
        "summary": "Easyknit International Holdings Limited, an investment holding company, engages in the investment, development, and management of properties in Hong Kong. The company operates through Property Investment, Property Development, Investment in Securities, and Loan Financing segments. Its investment properties primarily include residential, commercial, industrial, and retail properties. The company is also involved in securities investment and loan financing businesses. Easyknit International Holdings Limited was founded in 1981 and is based in Cheung Sha Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Cheung Sha Wan",
        "zipcode": null,
        "website": "http://www.easyknit.com",
        "market_cap": 349351712
    },
    "1243.HK": {
        "short_name": "WANG ON PPT",
        "long_name": "Wang On Properties Limited",
        "summary": "Wang On Properties Limited, an investment holding company, invests in, develops, and sells residential and commercial properties in Hong Kong. It operates in two segments, Property Development and Property Investment. The company engages in the acquisition of land to develop property, as well as the acquisition of existing buildings to be demolished and rebuilt into new property; and acquires of ready-made property for long-term investments. It also engages in the investment of car parking spaces; rental or sale of commercial and industrial premises; and provision of management, securities investment, and financial services. The company was founded in 1987 and is headquartered in Kowloon Bay, Hong Kong. Wang On Properties Limited is a subsidiary of Earnest Spot Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon Bay",
        "zipcode": null,
        "website": "http://www.woproperties.com",
        "market_cap": 1535200000
    },
    "1246.HK": {
        "short_name": "BOILLHEALTHCARE",
        "long_name": "Boill Healthcare Holdings Limited",
        "summary": "Boill Healthcare Holdings Limited, an investment holding company, undertakes contracts for foundation piling in Hong Kong and Mainland China. It operates through Property Development, Healthcare Holiday Resort Development and Operation, Foundation Piling, and Securities Investment segments. The company also develops and sells properties, as well as provides property management services. In addition, it trades and invests in securities; and provides elderly home care, healthcare, and leisure services. The company was formerly known as Ngai Shun Holdings Limited and changed its name to Boill Healthcare Holdings Limited in September 2017. Boill Healthcare Holdings Limited is headquartered in Sheung Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": null,
        "website": "http://www.boillhealthcare.com.hk",
        "market_cap": 353080000
    },
    "1560.HK": {
        "short_name": "STAR PROPERTIES",
        "long_name": "Star Properties Group (Cayman Islands) Limited",
        "summary": "Star Properties Group (Cayman Islands) Limited, an investment holding company, engages in the property development and investment activities in Hong Kong. It also provides property management; and financing services to the property buyers. The company was incorporated in 2016 and is headquartered in Kwun Tong, Hong Kong. Star Properties Group (Cayman Islands) Limited is a subsidiary of Star Properties Holdings (BVI) Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.starproperties.com.hk",
        "market_cap": 282259104
    },
    "1J9.F": {
        "short_name": "JIAYUAN INT.GRP.LTD ,-01",
        "long_name": "Jiayuan International Group Limited",
        "summary": "Jiayuan International Group Limited, an investment holding company, invests in, develops, and manages residential and commercial properties in the People's Republic of China. It also offers industrial park management and enterprise management consulting services. The company was formerly known as Jiayuan International Holdings Limited and changed its name to Jiayuan International Group Limited. Jiayuan International Group Limited was founded in 2003 and is headquartered in Central, Hong Kong. Jiayuan International Group Limited is a subsidiary of Mingyuan Group Investment Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.jiayuanintl.com",
        "market_cap": 1632590208
    },
    "2183.HK": {
        "short_name": "SANSHENG HLDG",
        "long_name": "Sansheng Holdings (Group) Co. Ltd.",
        "summary": "Sansheng Holdings (Group) Co. Ltd., an investment holding company, engages in the investment, development, and sale of properties in the People's Republic of China. Its properties are used for commercial, residential, and office use. The company was formerly known as Lifestyle Properties Development Limited and changed its name to Sansheng Holdings (Group) Co. Ltd. in August 2017. The company was founded in 1988 and is headquartered in Tsim Sha Tsui, Hong Kong. Sansheng Holdings (Group) Co. Ltd. is a subsidiary of Mega Regal Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.sansheng.hk",
        "market_cap": 2399004416
    },
    "2288.HK": {
        "short_name": "RYKADAN CAPITAL",
        "long_name": "Rykadan Capital Limited",
        "summary": "Rykadan Capital Limited, an investment holding company, engages in the property investment and development business in Hong Kong, the People's Republic of China, the United States, and internationally. The company develops and holds residential, commercial, and industrial properties; and leases premises. It also distributes construction and interior decorative materials, such as quartz and marble-based engineered stone composite surface products. In addition, it provides asset, investment, and fund management services; and project, property, and corporate management services. The company was formerly known as Sundart International Holdings Limited and changed its name to Rykadan Capital Limited in September 2012. Rykadan Capital Limited was founded in 1986 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.rykadan.com",
        "market_cap": 236531616
    },
    "2768.HK": {
        "short_name": "JIAYUAN INTL",
        "long_name": "Jiayuan International Group Limited",
        "summary": "Jiayuan International Group Limited, an investment holding company, invests in, develops, and manages residential and commercial properties in the People's Republic of China. It also offers industrial park management and enterprise management consulting services. The company was formerly known as Jiayuan International Holdings Limited and changed its name to Jiayuan International Group Limited. Jiayuan International Group Limited was founded in 2003 and is headquartered in Central, Hong Kong. Jiayuan International Group Limited is a subsidiary of Mingyuan Group Investment Limited.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.jiayuanintl.com",
        "market_cap": 15533445120
    },
    "3F5.F": {
        "short_name": "CHINA JINMAO HLDGS GR.LTD",
        "long_name": "China Jinmao Holdings Group Limited",
        "summary": "China Jinmao Holdings Group Limited, an investment holding company, operates in real estate and hotel businesses in Mainland China. It operates in four segments: City and Property Development, Commercial Leasing and Retail Operations, Hotel Operations, and Others. The City and Property Development segment develops city complexes and properties, as well as develops land. The Commercial Leasing and Retail Operations segment engages in the leasing of office and retail commercial premises. This segment has twelve investment properties with an area of approximately 0.80 million square meters. The Hotel Operations segment provides hotel accommodation, and food and beverages services. This segment operates ten luxury hotels that offers 3,968 guest rooms. The Others segment offers property management, and design and decoration services, as well as operates an observation deck. The company also engages in technology and services business. It holds 277 projects of city operations and property development, commercial leasing and retail operations, and hotel operations. The company was formerly known as Franshion Properties (China) Limited and changed its name to China Jinmao Holdings Group Limited in September 2015. China Jinmao Holdings Group Limited was incorporated in 2004 and is based in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.chinajinmao.cn",
        "market_cap": 3981120256
    },
    "8G7.F": {
        "short_name": "LANDSEA GREEN PPTYS CONS.",
        "long_name": "Landsea Green Properties Co., Ltd.",
        "summary": "Landsea Green Properties Co., Ltd., an investment holding company, develops and sells properties in Mainland China and the United States. The company operates through Property Development and Sales in Mainland China, Property Development and Sales in the US, Management Services, and Office Property Investment segments. It is also involved in the property leasing, decoration and design, marketing, and financial and elderly care services businesses. The company was formerly known as Landsea Green Group Co., Ltd. and changed its name to Landsea Green Properties Co., Ltd. in November 2019. The company was founded in 2001 and is headquartered in Central, Hong Kong. Landsea Green Properties Co., Ltd. is a subsidiary of Greensheid Corporation.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.landsea.hk",
        "market_cap": 257530272
    },
    "CAOVF": {
        "short_name": "CHINA OVERSEAS LAND & INVESTMNT",
        "long_name": "China Overseas Land & Investment Limited",
        "summary": "China Overseas Land & Investment Limited, an investment holding company, engages in the property development and investment, and other operations. It operates through Property Development, Property Investment, and Other Operations segments. The company is involved in the investment, development, and rental of residential and commercial properties; issuance of guaranteed notes; property consultancy and real estate agency; and loan financing, security investment, and hotel management activities. It also provides construction and building design consultancy services; and operates serviced apartments. The company primarily operates in Hong Kong, Macau, Guangzhou, Shenzhen, Shanghai, Beijing, Tianjin, Jinan, Nanjing, Suzhou, Chengdu, Shenyang, and other regions in Mainland China. The company was founded in 1979 and is based in Central, Hong Kong. China Overseas Land & Investment Limited is a subsidiary of China Overseas Holdings Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.coli.com.hk",
        "market_cap": 26722928640
    },
    "CAOVY": {
        "short_name": "CHINA OVERSEAS LAND & INVESTMNT",
        "long_name": "China Overseas Land & Investment Limited",
        "summary": "China Overseas Land & Investment Limited, an investment holding company, engages in the property development and investment, and treasury operations. It operates through Property Development, Property Investment, and Other Operations segments. The company is involved in the investment, development, and rental of residential and commercial properties; issuance of guaranteed notes; property consultancy and real estate agency; and loan financing, security investment, and hotel management activities. It also provides commercial project; and construction and building design consultancy services; and operates serviced apartments. The company primarily operates in Hong Kong, Macau, Guangzhou, Shenzhen, Shanghai, Beijing, Tianjin, Jinan, Nanjing, Suzhou, Chengdu, Shenyang, and other regions in Mainland China. The company was founded in 1979 and is based in Central, Hong Kong. China Overseas Land & Investment Limited is a subsidiary of China Overseas Holdings Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.coli.com.hk",
        "market_cap": 26445658112
    },
    "CAQ.AX": {
        "short_name": "CAQHOLDLTD FPO",
        "long_name": "CAQ Holdings Limited",
        "summary": "CAQ Holdings Limited, together with its subsidiaries, engages in the property development and jewelry trading activities in Mainland China. The company is involved in the construction and leasing of the Haikou project, a shopping center constructed in a free trade zone consisting of multi-storey buildings, including factories, warehouses, a commercial/administration building, and a retail complex located in Hainan Island, China. It also processes, exhibits, and sells diamonds, jewelry, and other commodities through physical stores under the Zuanxihui brand name in Haikou Meilan duty-free mall and Haikou Mova outlet, as well as through an online e-commerce platform. CAQ Holdings Limited was incorporated in 2000 and is based in Wan Chai, Hong Kong.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.caqholdings.com",
        "market_cap": 12920147
    },
    "CESTF": {
        "short_name": "CHINESE ESTATES",
        "long_name": "Chinese Estates Holdings Limited",
        "summary": "Chinese Estates Group (the \"Group\") is one of the leading property developers in Hong Kong. Chinese Estates Holdings Limited is the holding company of the Group and it is publicly listed on The Stock Exchange of Hong Kong Limited with stock code: 127. Chinese Estates' core businesses comprise of property investment for rental and property development for sale. The Group focuses primarily in Hong Kong, and diversifies its property interests to mainland China and the United Kingdom. The Group's investment properties include retail and office assets. Most of the investment properties of Chinese Estates are highly accessible and strategically located in prime commercial areas in Hong Kong such as Causeway Bay and Wanchai. In mainland China, Chinese Estates owns a five-star international hotel in Beijing. In the United Kingdom, Chinese Estates owns four investment properties in London. Over the past twenty years, Chinese Estates has built a reputation for conceptualising and implementing redevelopment, renovation works and repackaging programmes to enhance the value and revenue of its investment properties. Chinese Estates specializes in developing mid to high-end commercial and residential property projects. A number of quality and cosmopolitan residential properties are developed for sale.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.chineseestates.com",
        "market_cap": 975104896
    },
    "CGR.F": {
        "short_name": "COASTAL GREENLAND  HD-,10",
        "long_name": "Coastal Greenland Limited",
        "summary": "Coastal Greenland Limited, an investment holding company, primarily invests in, develops, and sells properties in the People's Republic of China. The company operates through Property Development, Property Investment, Project Management, and Project Investment Services segments. It also invests in and rents commercial and residential properties; and provides loan financing and management services, as well as invests in land development projects; and offers asset management services. The company was founded in 1990 and is based in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.coastal.com.cn",
        "market_cap": 28580050
    },
    "CHKGF": {
        "short_name": "CK ASSET HOLDINGS LTD",
        "long_name": "CK Asset Holdings Limited",
        "summary": "CK Asset Holdings Limited operates as a property developer in Hong Kong, the Mainland, Singapore, the United Kingdom, continental Europe, Australia, Canada, and the United States. The company is involved in the leasing of office, industrial, retail, and other properties; residential property investment and development; and pub, and hotel and serviced suite operations. It also provides property and project management, aircraft leasing, investment in infrastructure and utility asset operation, finance, and property agency services. The company was formerly known as Cheung Kong Property Holdings Limited and changed its name to CK Asset Holdings Limited in September 2017. CK Asset Holdings Limited was incorporated in 2015 and is headquartered in Central, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.ckah.com",
        "market_cap": 25756078080
    },
    "CHZ.F": {
        "short_name": "CHIN.RES.LA.  HD-,10",
        "long_name": "China Resources Land Limited",
        "summary": "China Resources Land Limited, an investment holding company, invests, develops, manages, and sells properties in the People's Republic of China. It invests in commercial, office, hotel, and apartment properties. As of December 31, 2020, the company had land bank of 68.087 million square meters. It also operates hotels; offers construction, decoration, and other property development related services; and manufactures and sells furniture. The company was incorporated in 1996 and is headquartered in Wanchai, Hong Kong. China Resources Land Limited is a subsidiary of CRH (Land) Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.crland.com.hk",
        "market_cap": 27400499200
    },
    "CL1A.F": {
        "short_name": "WANDA HOTEL DEVEL. CO.",
        "long_name": "Wanda Hotel Development Company Limited",
        "summary": "Wanda Hotel Development Company Limited, an investment holding company, engages in the property development, investment, leasing, and management activities in the People's Republic of China. The company operates through three segments: Hotel Operation and Management Services, Hotel Design and Construction Management Services, and Investment Properties Leasing. It develops, leases, and sells commercial and residential properties. The company also engages in the design, development, construction, operation, and management of hotels, as well as provides construction consulting services; and sells goods. As of 31 December 2020, it manages, leases, operates, and franchises 94 hotels that consists of 25,473 rooms under the Wanda Reign, Wanda Vista, Wanda Realm, Wanda Jin, Wanda Yi, Wanda Moments, and Wanda Yue brands in the People's Republic of China. The company was formerly known as Wanda Commercial Properties (Group) Co., Limited and changed its name to Wanda Hotel Development Company Limited in October 2014. The company is based in Central, Hong Kong. Wanda Hotel Development Company Limited is a subsidiary of Wanda Commercial Properties Overseas Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.wanda-hotel.com.hk",
        "market_cap": 246094272
    },
    "CL7.F": {
        "short_name": "HUA YIN INTL HLDGS LTD",
        "long_name": "Hua Yin International Holdings Limited",
        "summary": "Hua Yin International Holdings Limited, an investment holding company, engages in the property development and management business in the People's Republic of China. It operates through Property Development and Management, and Property Investment segments. The Property Development and Management segment develops properties; and provides management services, including planning, design, budgeting, licensing, contract tendering, and contract administration for the development of properties. The Property Investment segment holds properties for long term investment and leasing purposes, such as shopping mall units. It is also involved in real estate rental management; and tourism development and management business. The company was formerly known as Ground International Development Limited and changed its name to Hua Yin International Holdings Limited in March 2021. Hua Yin International Holdings Limited was founded in 1990 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.huayininternational.com",
        "market_cap": 287818784
    },
    "CMJ.F": {
        "short_name": "POLY PPTY GR.CO.LTD.",
        "long_name": "Poly Property Group Co., Limited",
        "summary": "Poly Property Group Co., Limited, an investment holding company, engages in the property development, investment, and management activities in Hong Kong and the People's Republic of China. The company operates in four segments: Property Development, Property Investment and Management, Hotel Operations, and Other Operations. It is involved in the development of residential and commercial properties; and hotel and restaurant business, as well as provision of related services. The company also provides financial, management, asset management, property agency, and construction services. In addition, it manufactures and sells digital discs and others. The company was formerly known as Poly (Hong Kong) Investments Limited. Poly Property Group Co., Limited is based in Hong Kong, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.polyhongkong.com",
        "market_cap": 864040960
    },
    "CPP.F": {
        "short_name": "CHINA OV.LD",
        "long_name": "China Overseas Land & Investment Limited",
        "summary": "China Overseas Land & Investment Limited, an investment holding company, engages in the property development and investment, and other operations. It operates through Property Development, Property Investment, and Other Operations segments. The company is involved in the investment, development, and rental of residential and commercial properties; issuance of guaranteed notes; property consultancy and real estate agency; and loan financing, security investment, and hotel management activities. It also provides construction and building design consultancy services; and operates serviced apartments. The company primarily operates in Hong Kong, Macau, Guangzhou, Shenzhen, Shanghai, Beijing, Tianjin, Jinan, Nanjing, Suzhou, Chengdu, Shenyang, and other regions in Mainland China. The company was founded in 1979 and is based in Central, Hong Kong. China Overseas Land & Investment Limited is a subsidiary of China Overseas Holdings Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.coli.com.hk",
        "market_cap": 21911121920
    },
    "CQ3.F": {
        "short_name": "CHINESE ESTATES H. HD-,10",
        "long_name": "Chinese Estates Holdings Limited",
        "summary": "Chinese Estates Group (the \"Group\") is one of the leading property developers in Hong Kong. Chinese Estates Holdings Limited is the holding company of the Group and it is publicly listed on The Stock Exchange of Hong Kong Limited with stock code: 127. Chinese Estates' core businesses comprise of property investment for rental and property development for sale. The Group focuses primarily in Hong Kong, and diversifies its property interests to mainland China and the United Kingdom. The Group's investment properties include retail and office assets. Most of the investment properties of Chinese Estates are highly accessible and strategically located in prime commercial areas in Hong Kong such as Causeway Bay and Wanchai. In mainland China, Chinese Estates owns a five-star international hotel in Beijing. In the United Kingdom, Chinese Estates owns four investment properties in London. Over the past twenty years, Chinese Estates has built a reputation for conceptualising and implementing redevelopment, renovation works and repackaging programmes to enhance the value and revenue of its investment properties. Chinese Estates specializes in developing mid to high-end commercial and residential property projects. A number of quality and cosmopolitan residential properties are developed for sale.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.chineseestates.com",
        "market_cap": 764767808
    },
    "CQH3.F": {
        "short_name": "CHEUK NANG CONS.",
        "long_name": "Cheuk Nang (Holdings) Limited",
        "summary": "Cheuk Nang (Holdings) Limited, an investment holding company, engages in the investment, development, management, and trading of properties in the People's Republic of China, Hong Kong, and Malaysia. It operates through Property Sales, Property Rental, Estate Management, and Others segments. The company develops residential, commercial, and retail properties. It is also involved in the provision of secretarial and management services; and securities trading and debentures, and mortgage lending activities. The company was formerly known as Far East Wool & Fibre Mill, Limited and changed its name to Cheuk Nang (Holdings) Limited in 1988. The company was founded in 1963 and is based in Wan Chai, Hong Kong. Cheuk Nang (Holdings) Limited is a subsidiary of Yan Yin Company Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.cheuknang.com.hk",
        "market_cap": 195174000
    },
    "CRBJF": {
        "short_name": "CHINA RESOURCES LAND",
        "long_name": "China Resources Land Limited",
        "summary": "China Resources Land Limited, an investment holding company, invests, develops, manages, and sells properties in the People's Republic of China. It invests in commercial, office, hotel, and apartment properties. As of December 31, 2020, the company had land bank of 68.087 million square meters. It also operates hotels; offers construction, decoration, and other property development related services; and manufactures and sells furniture. The company was incorporated in 1996 and is headquartered in Wanchai, Hong Kong. China Resources Land Limited is a subsidiary of CRH (Land) Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.crland.com.hk",
        "market_cap": 31870685184
    },
    "CRBJY": {
        "short_name": "CHINA RESOURCES LAND",
        "long_name": "China Resources Land Limited",
        "summary": "China Resources Land Limited, an investment holding company, invests, develops, manages, and sells properties in the People's Republic of China. It invests in commercial, office, hotel, and apartment properties. As of December 31, 2020, the company had land bank of 68.087 million square meters. It also operates hotels; offers construction, decoration, and other property development related services; and manufactures and sells furniture. The company was incorporated in 1996 and is headquartered in Wanchai, Hong Kong. China Resources Land Limited is a subsidiary of CRH (Land) Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.crland.com.hk",
        "market_cap": 33879920640
    },
    "CUG.F": {
        "short_name": "CHUANG'S CH.  HD-,05",
        "long_name": "Chuang's China Investments Limited",
        "summary": "Chuang's China Investments Limited, an investment holding company, engages in the property development, investment, and trading activities in the People's Republic of China, Hong Kong, the United Kingdom, and Malaysia. The company develops, sells, rents, and manages commercial and residential properties; and operates and manages hotels. It is also involved in the sale of goods and merchandises, including art pieces; provision of securities investment and trading services; development and construction of cemeteries and provision of related management services; and money lending activities. The company is headquartered in Central, Hong Kong. Chuang's China Investments Limited is a subsidiary of Profit Stability Investments Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.chuangs-china.com",
        "market_cap": 116821352
    },
    "EM3A.F": {
        "short_name": "EMPEROR INTL SUBDIV.HD-01",
        "long_name": "Emperor International Holdings Limited",
        "summary": "Emperor International Holdings Limited, an investment holding company, engages in the property investment and development, and hospitality activities in Hong Kong, Macau, the United Kingdom, and the People's Republic of China. It operates through Lease of Properties, Properties Development, and Hotel and Hotel Related Operations segments. The Lease of Properties segment rents properties. The Properties Development segment engages in the development and redevelopment of properties for sale. The Hotel and Hotel Related Operations segment operates the Emperor Hotel, MORI MORI serviced apartments, the unit serviced apartments, Grand Emperor Hotel, and Inn Hotel Macau; and mass market halls, VIP rooms, and slot machine halls, as well as provides gaming-related marketing and public relation services. The company's property portfolio includes residential properties, retail spaces, shopping malls, and industrial and commercial buildings. In addition, it provides project financing and management, treasury service, property agency, and catering services. The company was founded in 1990 is headquartered in Wan Chai, Hong Kong. Emperor International Holdings Limited is a subsidiary of Emperor International Group Holdings Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.emperorint.com",
        "market_cap": 456143712
    },
    "FET.F": {
        "short_name": "FAR EAST CONS. INTL HD-10",
        "long_name": "Far East Consortium International Limited",
        "summary": "Far East Consortium International Limited, an investment holding company, engages in the property development and investment, hotel operations and management, car park operations and facilities management, gaming operations and management, and treasury management businesses. It develops a portfolio of residential properties; invests in retail and office buildings; and operates hotels. The company also operates third party and self-owned car parks; and owns and operates casinos and gaming facilities. In addition, it provides loan financing, sales agency, mortgage, administration and management, vault, and hotel management and consultancy services, as well as engages in the securities and financial investment activities. As of March 31, 2020, the company owned and operated 31 hotels with approximately 8,100 rooms; and managed 470 car parks with approximately 106,696 car parking bays. It has operations in Australia, New Zealand, the Czech Republic, Hong Kong, Malaysia, the People's Republic of China, Singapore, the United Kingdom, and the rest of Europe. The company is based in Central, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.fecil.com.hk",
        "market_cap": 726012096
    },
    "GI0A.F": {
        "short_name": "GLORIOUS PPTY REGS HD-,01",
        "long_name": "Glorious Property Holdings Limited",
        "summary": "Glorious Property Holdings Limited, an investment holding company, invests in, develops, and sells real estate properties in the People's Republic of China. It develops residential, commercial, serviced apartment, office, and hotel projects. As of December 31, 2020, the company had a total land bank of 6.6 million square meters in Shanghai region, Yangtze River Delta, Pan Bohai Rim, and Northeast China. It is also involved in the provision of corporate, culture, advertising planning, investment holding, advisory, business consulting, interior and exterior decoration, renovation, business management, property leasing, and hotel operation and property management services; and wholesale of construction materials, mechanical equipment, and building materials. The company was founded in 1996 and is headquartered in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.gloriousphl.com.cn",
        "market_cap": 198383824
    },
    "GUW.F": {
        "short_name": "GUANGD.LAND HLDGS HD -,01",
        "long_name": "Guangdong Land Holdings Limited",
        "summary": "Guangdong Land Holdings Limited, an investment holding company, engages in property development and investment businesses primarily in Mainland China. The company was formerly known as Kingway Brewery Holdings Limited and changed its name to Guangdong Land Holdings Limited in September 2013. The company was incorporated in 1997 and is headquartered in Central, Hong Kong and is considered as a Red Chip company due to its listing on the Hong Kong Stock Exchange. Guangdong Land Holdings Ltd. is a subsidiary of Guangdong Investment Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.gdland.com.hk",
        "market_cap": 188221616
    },
    "GUZ.F": {
        "short_name": "YUEXIU PPTY CO.LTD.",
        "long_name": "Yuexiu Property Company Limited",
        "summary": "Yuexiu Property Company Limited, together with its subsidiaries, develops, sells, and manages properties primarily in Mainland China and Hong Kong. It operates through Property Development, Property Management, Property Investment, and Other segments. The company is also involved in holding investment properties. In addition, it offers property development and management consulting, property rental, decoration and design, project management, real estate and property agency, investment consulting, metal manufacturing, information consulting, car parking management, financial, building management, commercial, greening, construction, and trade finance services. As of December 31, 2020, the company owned investment properties under lease of approximately 774,000 sq.m. comprising offices, commercial properties, car parks, and others; and a total landbank of approximately 24.54 million sq.m. The company was formerly known as Guangzhou Investment Company Limited. The company was incorporated in 1992 and is based in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.yuexiuproperty.com",
        "market_cap": 3967632128
    },
    "H8CC.F": {
        "short_name": "HKC (HLDGS)  HD -,25",
        "long_name": "HKC (Holdings) Limited",
        "summary": "HKC (Holdings) Limited, together with its subsidiaries, engages in the property development and investment, and renewable energy investment and operation businesses in the People's Republic of China. It operates through Properties Development, Property Investment and Leasing, Renewable Energy, and Other Operations segments. The company develops and builds residential properties, including townhouses, high-rise apartments, and commercial shops; and invests in shopping malls and offices, as well as properties for restaurants and retails. It also holds properties; develops and operates building materials center; owns and operates wind power and distributed solar projects; and provides property management services. The company was incorporated in 2006 and is headquartered in Tsim Sha Tsui, Hong Kong. HKC (Holdings) Limited is a subsidiary of Claudio Holdings Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.hkcholdings.com",
        "market_cap": 445137792
    },
    "HU8.F": {
        "short_name": "SOCAM DEVELOPMENT LTD HD1",
        "long_name": "SOCAM Development Limited",
        "summary": "SOCAM Development Limited, an investment holding company, engages in the property and construction businesses in the People's Republic of China and Hong Kong. It operates through Property, Construction and Building Maintenance, and Other Businesses segments. It undertakes the construction of public housings, offices/SOHO, and retail facilities, as well as commercial, residential, and institutional buildings. The company is involved in property, investment, development, and management activities; and interior fitting out, and building renovation and premise maintenance activities. In addition, it provides venture capital investment, design and contracting, management, and consultancy services, as well as structural steel construction works; and owns and leases plants and machineries. The company was formerly known as Shui On Construction and Materials Limited and changed its name to SOCAM Development Limited in September 2011. SOCAM Development Limited is headquartered in Hong Kong, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.socam.com",
        "market_cap": 69303504
    },
    "HVP.F": {
        "short_name": "HOPSON DEV. HLDGS  HD-,10",
        "long_name": "Hopson Development Holdings Limited",
        "summary": "Hopson Development Holdings Limited, an investment holding company, primarily develops residential properties in the People's Republic of China and Hong Kong. The company operates through Property Development, Commercial Properties Investment, Property Management, Infrastructure, and Investments segments. It invests in and rents properties; manages restaurants, hotels, and properties; and operates hotels. The company also provides construction, water supply, clubhouse and residential, consultancy, and architectural design services. In addition, it engages in design and renovation services; sale of properties; and decoration activities. The company was founded in 1992 and is headquartered in Central, Hong Kong. Hopson Development Holdings Limited is a subsidiary of Sounda Properties Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.hopson.com.cn",
        "market_cap": 7881597440
    },
    "KID1.F": {
        "short_name": "POLYTEC ASS. HLDGS HD-,10",
        "long_name": "Polytec Asset Holdings Limited",
        "summary": "Polytec Asset Holdings Limited, an investment holding company, primarily invests in, develops, and trades in real estate properties in the People's Republic of China and Kazakhstan. The company operates through four segments: Properties, Oil, Ice and Cold Storage, and Financial Investments. It develops residential and commercial properties. The company has a development land bank of 294,000 square meters; and investment land bank of approximately 18,000 square meters in Macau. It is also involved in the oil exploration and production activities in Kazakhstan; manufacturing and trading ice; the provision of cold storage and consultancy services; and general trading activities. In addition, the company involved in equity and debt securities. The company was formerly known as Kin Don Holdings Limited and changed its name to Polytec Asset Holdings Limited in January 2004. The company was incorporated in 1998 and is headquartered in Kowloon, Hong Kong. Polytec Asset Holdings Limited is a subsidiary of Marble King International Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://www.polytecasset.com",
        "market_cap": 706672128
    },
    "KOX.F": {
        "short_name": "KOWLOON DEVELOP.",
        "long_name": "Kowloon Development Company Limited",
        "summary": "Kowloon Development Company Limited, an investment holding company, engages in the investment, development, and management of properties in Hong Kong and Mainland China. The company develops, leases, and sells various residential and commercial projects, such as club houses, car parking facilities, retail shops, shopping arcades, and residential towers, as well as hotels and office buildings. As of December 31, 2020, its land bank for development totaled to approximately 3.7 million square meters of gross floor area. The company also provides security, technical, and housekeeping services; building surveying and guarding services; financial investments and services; and project management services, as well as undertakes construction contracts. In addition, it engages in the treasury operations; retail activities; and distribution of films and cinematograph films. The company was incorporated in 1961 and is headquartered in Mong Kok, Hong Kong. Kowloon Development Company Limited is a subsidiary of Intellinsight Holdings Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Mong Kok",
        "zipcode": null,
        "website": "http://www.kdc.com.hk",
        "market_cap": 1141567488
    },
    "KR3.F": {
        "short_name": "KERRY PROPERTIES  HD 1",
        "long_name": "Kerry Properties Limited",
        "summary": "Kerry Properties Limited, an investment holding company, engages in the development, investment, management, and trading of properties in Hong Kong, the People's Republic of China, and the Asia Pacific region. The company also owns and operates hotels; and offers logistics and freight forwarding, consultancy, administrative support, project management, financial, IT system and consultancy, estate agency, and construction services. In addition, it is involved in the warehouse operations, as well as operation of restaurants, recreation parks, and ice rinks. The company was incorporated in 1978 and is headquartered in Quarry Bay, Hong Kong. Kerry Properties Limited is a subsidiary of Kerry Group Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.kerryprops.com",
        "market_cap": 4049035008
    },
    "KRYPF": {
        "short_name": "KERRY PROPERTIES LTD",
        "long_name": "Kerry Properties Limited",
        "summary": "Kerry Properties Limited, an investment holding company, engages in the development, investment, management, and trading of properties in Hong Kong, the People's Republic of China, and the Asia Pacific region. The company also owns and operates hotels; and offers logistics and freight forwarding, consultancy, administrative support, project management, financial, IT system and consultancy, estate agency, and construction services. In addition, it is involved in the warehouse operations, as well as operation of restaurants, recreation parks, and ice rinks. The company was incorporated in 1978 and is headquartered in Quarry Bay, Hong Kong. Kerry Properties Limited is a subsidiary of Kerry Group Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.kerryprops.com",
        "market_cap": 4941286400
    },
    "KW2.F": {
        "short_name": "K.WAH INTL HLDGS  HD-10",
        "long_name": "K. Wah International Holdings Limited",
        "summary": "K. Wah International Holdings Limited, an investment holding company, engages in the property development and investment activities in Hong Kong and Mainland China. Its property portfolio comprises residential developments, office towers, hotels, serviced apartments, and commercial facilities. The company also provides property management services to residential buildings, commercial facilities, office towers, and real estate complexes. In addition, it offers financial, management, and decoration services. K. Wah International Holdings Limited was incorporated in 1990 and is headquartered in North Point, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.kwih.com",
        "market_cap": 1282596480
    },
    "MKU.F": {
        "short_name": "PEKING UNI.RES(H.) HD-,10",
        "long_name": "Peking University Resources (Holdings) Company Limited",
        "summary": "Peking University Resources (Holdings) Company Limited, together with its subsidiaries, distributes information products, and invests in and develops properties in Mainland China and Hong Kong. The company primarily distributes servers, printers, switches, networking products, storage devices, workstations, optical screen products, video conference hosts, conference controllers, codec, UPS power supply products, and notebook computer of various manufacturers, such as HP, H3C, CommScope, Brocade, Microsoft, Corning, Lenovo, Huawei, DELL, IBM, Netgear, CommScope, and SGi. It also acts as a distribution channel for the products of other IT companies, such as LifeSize, BARCO, CommScope, Fujitsu, Samsung, Uniview, Corning, Brocade, Librestream, Ruckus, and Impinj. In addition, the company leases and subleases, and sells properties. The company was formerly known as EC-Founder (Holdings) Company Limited and changed its name to Peking University Resources (Holdings) Company Limited in December 2013. Peking University Resources (Holdings) Company Limited is headquartered in Tsuen Wan, Hong Kong. Peking University Resources (Holdings) Company Limited is a subsidiary of Founder Information (Hong Kong) Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.pku-resources.com",
        "market_cap": 111008376
    },
    "ONF.F": {
        "short_name": "MINMETALS LAND LTD HD-,10",
        "long_name": "Minmetals Land Limited",
        "summary": "Minmetals Land Limited, an investment holding company, engages in the real estate development business in the People's Republic of China. It operates through Real Estate Development, Specialized Construction, Property Investment, and Securities Investment segments. The company develops and sells residential and commercial properties; and designs, installs, and sells curtain walls, as well as aluminum windows, doors, and other materials. It also holds and rents properties; invests in securities; and provides management, property management, and fund-raising services. The company is based in Tsim Sha Tsui, Hong Kong. Minmetals Land Limited is a subsidiary of June Glory International Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.minmetalsland.com",
        "market_cap": 308135680
    },
    "OVZ3.F": {
        "short_name": "ZENSUN ENTERPRISES LTD.",
        "long_name": "Zensun Enterprises Limited",
        "summary": "Zensun Enterprises Limited, an investment holding company, engages in the property development, property investment and management, and securities trading and investment businesses. The company also offers loan financing services. It has operations in Hong Kong, the People's Republic of China, Singapore, Japan, and the United States. The company was formerly known as ZH International Holdings Limited and changed its name to Zensun Enterprises Limited in July 2019. The company was founded in 1965 and is headquartered in Central, Hong Kong. Zensun Enterprises Limited is a subsidiary of Joy Town Inc.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.zensunenterprises.com",
        "market_cap": 1258067968
    },
    "P36.SI": {
        "short_name": "Pan Hong",
        "long_name": "Pan Hong Holdings Group Limited",
        "summary": "Pan Hong Holdings Group Limited, an investment holding company, engages in the development of residential and commercial properties in the second and third-tier cities in the People's Republic of China. It is also involved in the operation and management of hotels; investment management activities; provision of property consultation services; and general trading and consultancy services businesses. The company was formerly known as Pan Hong Property Group Limited and changed its name to Pan Hong Holdings Group Limited in September 2015. The company was incorporated in 2005 and is headquartered in Hunghom, Hong Kong. Pan Hong Holdings Group Limited is a subsidiary of Extra Good Enterprises Limited.",
        "currency": "SGD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hung Hom",
        "zipcode": null,
        "website": "http://www.pan-hong.com",
        "market_cap": 110146872
    },
    "PHKIF": {
        "short_name": "POLY PROPERTY GROUP CO LTD",
        "long_name": "Poly Property Group Co., Limited",
        "summary": "Poly Property Group Co., Limited, an investment holding company, engages in the property development, investment, and management activities in Hong Kong and the People's Republic of China. The company operates in four segments: Property Development, Property Investment and Management, Hotel Operations, and Other Operations. It is involved in the development of residential and commercial properties; and hotel and restaurant business, as well as provision of related services. The company also provides financial, management, asset management, property agency, and construction services. In addition, it manufactures and sells digital discs and others. The company was formerly known as Poly (Hong Kong) Investments Limited. Poly Property Group Co., Limited is based in Hong Kong, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.polyhongkong.com",
        "market_cap": 1032467456
    },
    "QHI.F": {
        "short_name": "SHIMAO GROUP HLDGS HD-,10",
        "long_name": "Shimao Group Holdings Limited",
        "summary": "Shimao Group Holdings Limited, an investment holding company, engages in the property development and investment activities in the People's Republic of China. The company develops residential and commercial properties; and operates hotels and shopping malls. It is also involved in the trading of construction materials; and property management activities. The company was formerly known as Shimao Property Holdings Limited and changed its name to Shimao Group Holdings Limited in May 2020. Shimao Group Holdings Limited was incorporated in 2004 and is based in Hong Kong, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.shimaogroup.hk",
        "market_cap": 8508520448
    },
    "QU4B.F": {
        "short_name": "C C LAND HOLDINGS  HD-,10",
        "long_name": "C C Land Holdings Limited",
        "summary": "C C Land Holdings Limited, an investment holding company, invests in and develops properties in the United Kingdom, Hong Kong, and Mainland China. The company operates through two segments, Property Development and Investment; and Treasury Investment. It also invests in securities and notes receivable; and provides financial services, as well as engages in vessel management and yacht investment activity. The company was formerly known as Qualipak International Holdings Limited and changed its name to C C Land Holdings Limited in January 2007. C C Land Holdings Limited was incorporated in 1998 and is headquartered in Wanchai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.ccland.com.hk",
        "market_cap": 775221312
    },
    "SHG.F": {
        "short_name": "SUN HUNG KAI PTIES",
        "long_name": "Sun Hung Kai Properties Limited",
        "summary": "Sun Hung Kai Properties Limited develops and invests in properties for sale and rent in Hong Kong, Mainland China, and internationally. It develops and sells properties, including residential estates, offices, shopping malls, industrial buildings, and hotels and serviced suites. As of June 30, 2020, the company's land bank comprised 57.5 million square feet of gross floor area in Hong Kong; and 68.1 million square feet of gross floor area in Mainland China. It also provides property management services; construction-related services, including landscaping, electrical and fire prevention systems, and construction plant and machinery leasing; and insurance products to individuals and businesses comprising householder's comprehensive, fire, employees' compensation, travel, personal accident, motor vehicles, contractors' all risks, third party liability, and property all risks. In addition, the company offers voice, multimedia, and mobile broadband services; and data center services, including infrastructure, facility management, server co-location, and other value-added services. Further, it manages car parks, tunnels, bridges, and toll roads; offers transport facilities for private and the public sectors; operates an expressway; provides public bus transportation services; and offers airport freight forwarding and aviation support services. Additionally, the company provides container handling and storage, container freight station, and other port-related services; operates department stores and supermarkets; and offers mortgage and other loan financing facilities, as well as asset and project management, architectural and engineering, cleaning, and secretarial services. It also engages in club and road management activities. The company was formerly known as Sun Hung Kai (Holdings) Limited and changed its name to Sun Hung Kai Properties Limited in March 1973. Sun Hung Kai Properties Limited was incorporated in 1972 and is based in Wan Chai, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.shkp.com",
        "market_cap": 37462929408
    },
    "SHMAY": {
        "short_name": "SHIMAO GROUP HOLDINGS LTD UNSP ",
        "long_name": "Shimao Group Holdings Limited",
        "summary": "Shimao Group Holdings Limited, an investment holding company, engages in the property development and investment activities in the People's Republic of China. The company develops residential and commercial properties; and operates hotels and shopping malls. It is also involved in the trading of construction materials; and property management activities. The company was formerly known as Shimao Property Holdings Limited and changed its name to Shimao Group Holdings Limited in May 2020. Shimao Group Holdings Limited was incorporated in 2004 and is based in Hong Kong, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.shimaogroup.hk",
        "market_cap": 8852165632
    },
    "SHS.F": {
        "short_name": "SHENZHEN INV.(CONS.)",
        "long_name": "Shenzhen Investment Limited",
        "summary": "Shenzhen Investment Limited, together with its subsidiaries, invests in, develops, and manages real estate properties in Mainland China. The company operates through five segments: Property Development, Property Investment, Property Management, Manufacture, and Others. It invests in and develops residential and commercial properties; invests in commercial properties for rental income; manages properties; and manufactures and sells industrial and commercial products. The company also manufactures and sells aluminum alloy, agricultural, and LCD products; provides construction services; and operates hotels and warehouses. The company was founded in 1992 and is based in Tsim Sha Tsui, Hong Kong. Shenzhen Investment Limited is a subsidiary of Shum Yip Holdings Company Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.shenzheninvestment.com",
        "market_cap": 2494557184
    },
    "SIOPF": {
        "short_name": "SHIMAO GROUP HOLDINGS LTD",
        "long_name": "Shimao Group Holdings Limited",
        "summary": "Shimao Group Holdings Limited, an investment holding company, engages in the property development and investment activities in the People's Republic of China. The company develops residential and commercial properties; and operates hotels and shopping malls. It is also involved in the trading of construction materials; and property management activities. The company was formerly known as Shimao Property Holdings Limited and changed its name to Shimao Group Holdings Limited in May 2020. Shimao Group Holdings Limited was incorporated in 2004 and is based in Hong Kong, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.shimaogroup.hk",
        "market_cap": 9678620672
    },
    "SNLAF": {
        "short_name": "SINO LAND CO",
        "long_name": "Sino Land Company Limited",
        "summary": "Sino Land Company Limited, an investment holding company, invests in, develops, manages, and trades in properties. It operates through six segments: Property Sales, Property Rental, Property Management and Other Services, Hotel Operations, Investments in Securities, and Financing. The company's property portfolio includes office, industrial, and residential buildings, as well as shopping malls, car parks, and hotels. It also provides cleaning, building construction and management, financing, administration, security, mortgage loan financing, secretarial, management, project management, securities investment, living, consultancy, and deposit placing services, as well as operates hotels. As of June 30, 2020, the company had a land bank of approximately 22.3 million square feet of attributable floor area in Mainland China, Hong Kong, Singapore, and Sydney. The company was incorporated in 1971 and is based in Tsim Sha Tsui, Hong Kong. Sino Land Company Limited is a subsidiary of Tsim Sha Tsui Properties Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.sino.com",
        "market_cap": 9914040320
    },
    "SNLAY": {
        "short_name": "SINO LAND CO",
        "long_name": "Sino Land Company Limited",
        "summary": "Sino Land Company Limited, an investment holding company, invests in, develops, manages, and trades in properties. It operates through six segments: Property Sales, Property Rental, Property Management and Other Services, Hotel Operations, Investments in Securities, and Financing. The company's property portfolio includes office, industrial, and residential buildings, as well as shopping malls, car parks, and hotels. It also provides cleaning, building construction and management, financing, administration, security, mortgage loan financing, secretarial, management, project management, securities investment, living, consultancy, and deposit placing services, as well as operates hotels. As of June 30, 2020, the company had a land bank of approximately 22.3 million square feet of attributable floor area in Mainland China, Hong Kong, Singapore, and Sydney. The company was incorporated in 1971 and is based in Tsim Sha Tsui, Hong Kong. Sino Land Company Limited is a subsidiary of Tsim Sha Tsui Properties Limited.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.sino.com",
        "market_cap": 11892635648
    },
    "SNO.F": {
        "short_name": "SINO LD CO.",
        "long_name": "Sino Land Company Limited",
        "summary": "Sino Land Company Limited, an investment holding company, invests in, develops, manages, and trades in properties. It operates through six segments: Property Sales, Property Rental, Property Management and Other Services, Hotel Operations, Investments in Securities, and Financing. The company's property portfolio includes office, industrial, and residential buildings, as well as shopping malls, car parks, and hotels. It also provides cleaning, building construction and management, financing, administration, security, mortgage loan financing, secretarial, management, project management, securities investment, living, consultancy, and deposit placing services, as well as operates hotels. As of June 30, 2020, the company had a land bank of approximately 22.3 million square feet of attributable floor area in Mainland China, Hong Kong, Singapore, and Sydney. The company was incorporated in 1971 and is based in Tsim Sha Tsui, Hong Kong. Sino Land Company Limited is a subsidiary of Tsim Sha Tsui Properties Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.sino.com",
        "market_cap": 9575614464
    },
    "SUHJF": {
        "short_name": "SUN HUNG KAI PROPERTIES LTD",
        "long_name": "Sun Hung Kai Properties Limited",
        "summary": "Sun Hung Kai Properties Limited develops and invests in properties for sale and rent in Hong Kong, Mainland China, and internationally. It develops and sells properties, including residential estates, offices, shopping malls, industrial buildings, and hotels and serviced suites. As of June 30, 2020, the company's land bank comprised 57.5 million square feet of gross floor area in Hong Kong; and 68.1 million square feet of gross floor area in Mainland China. It also provides property management services; construction-related services, including landscaping, electrical and fire prevention systems, and construction plant and machinery leasing; and insurance products to individuals and businesses comprising householder's comprehensive, fire, employees' compensation, travel, personal accident, motor vehicles, contractors' all risks, third party liability, and property all risks. In addition, the company offers voice, multimedia, and mobile broadband services; and data center services, including infrastructure, facility management, server co-location, and other value-added services. Further, it manages car parks, tunnels, bridges, and toll roads; offers transport facilities for private and the public sectors; operates an expressway; provides public bus transportation services; and offers airport freight forwarding and aviation support services. Additionally, the company provides container handling and storage, container freight station, and other port-related services; operates department stores and supermarkets; and offers mortgage and other loan financing facilities, as well as asset and project management, architectural and engineering, cleaning, and secretarial services. It also engages in club and road management activities. The company was formerly known as Sun Hung Kai (Holdings) Limited and changed its name to Sun Hung Kai Properties Limited in March 1973. Sun Hung Kai Properties Limited was incorporated in 1972 and is based in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.shkp.com",
        "market_cap": 44509376512
    },
    "SUHJY": {
        "short_name": "SUN HUNG KAI PROPERTIES LTD",
        "long_name": "Sun Hung Kai Properties Limited",
        "summary": "Sun Hung Kai Properties Limited develops and invests in properties for sale and rent in Hong Kong, Mainland China, and internationally. It develops and sells properties, including residential estates, offices, shopping malls, industrial buildings, and hotels and serviced suites. As of June 30, 2020, the company's land bank comprised 57.5 million square feet of gross floor area in Hong Kong; and 68.1 million square feet of gross floor area in Mainland China. It also provides property management services; construction-related services, including landscaping, electrical and fire prevention systems, and construction plant and machinery leasing; and insurance products to individuals and businesses comprising householder's comprehensive, fire, employees' compensation, travel, personal accident, motor vehicles, contractors' all risks, third party liability, and property all risks. In addition, the company offers voice, multimedia, and mobile broadband services; and data center services, including infrastructure, facility management, server co-location, and other value-added services. Further, it manages car parks, tunnels, bridges, and toll roads; offers transport facilities for private and the public sectors; operates an expressway; provides public bus transportation services; and offers airport freight forwarding and aviation support services. Additionally, the company provides container handling and storage, container freight station, and other port-related services; operates department stores and supermarkets; and offers mortgage and other loan financing facilities, as well as asset and project management, architectural and engineering, cleaning, and secretarial services. It also engages in club and road management activities. The company was formerly known as Sun Hung Kai (Holdings) Limited and changed its name to Sun Hung Kai Properties Limited in March 1973. Sun Hung Kai Properties Limited was incorporated in 1972 and is based in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.shkp.com",
        "market_cap": 45543489536
    },
    "TIACF": {
        "short_name": "TIAN AN CHINA INVESTMENTS CO",
        "long_name": "Tian An China Investments Company Limited",
        "summary": "Tian An China Investments Company Limited, an investment holding company, invests in, develops, and manages properties in the People's Republic of China, Hong Kong, the United Kingdom, and Australia. It operates through Property Development, Property Investment, and Other Operations segments. The company develops apartments, villas, office buildings, and commercial properties. It is also involved in the golf course and club house operations, and hotel management activities. In addition, the company provides property leasing and estate management, car parking space, securities dealing, and money lending services. Tian An China Investments Company Limited was founded in 1986 and is based in Wan Chai, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.tiananchina.com",
        "market_cap": 889655808
    },
    "USH.F": {
        "short_name": "WING TAI PROPE.LTD HD-,50",
        "long_name": "Wing Tai Properties Limited",
        "summary": "Wing Tai Properties Limited, an investment holding company, invests in, develops, and manages properties in Hong Kong, the United Kingdom, the People's Republic of China, Singapore, and internationally. The company operates through Property Development, Property Investment and Management, Hospitality Investment and Management, and Others divisions. It develops and manages residential and commercial properties. The company's investment properties include office buildings, industrial buildings, car parking spaces, retail spaces, and serviced apartments. It is also involved in the hospitality management, investment, licensing, treasury investment, financing, and property agency activities. The company was formerly known as USI Holdings Limited and changed its name to Wing Tai Properties Limited in 2010. Wing Tai Properties Limited is headquartered in Kwun Tong, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.wingtaiproperties.com",
        "market_cap": 692971200
    },
    "V2U.F": {
        "short_name": "RYKADAN CAPITAL LTD.HD-01",
        "long_name": "Rykadan Capital Limited",
        "summary": "Rykadan Capital Limited, an investment holding company, engages in the property investment and development business in Hong Kong, the People's Republic of China, the United States, and internationally. The company develops and holds residential, commercial, and industrial properties; and leases premises. It also distributes construction and interior decorative materials, such as quartz and marble-based engineered stone composite surface products. In addition, it provides asset, investment, and fund management services; and project, property, and corporate management services. The company was formerly known as Sundart International Holdings Limited and changed its name to Rykadan Capital Limited in September 2012. Rykadan Capital Limited was founded in 1986 and is headquartered in Kwun Tong, Hong Kong.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwun Tong",
        "zipcode": null,
        "website": "http://www.rykadan.com",
        "market_cap": 24465696
    },
    "YUEXF": {
        "short_name": "YUEXIU PROPERTY CO LTD",
        "long_name": "Yuexiu Property Company Limited",
        "summary": "Yuexiu Property Company Limited, together with its subsidiaries, develops, sells, and manages properties primarily in Mainland China and Hong Kong. It operates through Property Development, Property Management, Property Investment, and Other segments. The company is also involved in holding investment properties. In addition, it offers property development and management consulting, property rental, decoration and design, project management, real estate and property agency, investment consulting, metal manufacturing, information consulting, car parking management, financial, building management, commercial, greening, construction, and trade finance services. As of December 31, 2020, the company owned investment properties under lease of approximately 774,000 sq.m. comprising offices, commercial properties, car parks, and others; and a total landbank of approximately 24.54 million sq.m. The company was formerly known as Guangzhou Investment Company Limited. The company was incorporated in 1992 and is based in Wanchai, Hong Kong.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.yuexiuproperty.com",
        "market_cap": 74980320
    },
    "ZYW.F": {
        "short_name": "CHINA PROP.GRP LTD HD-,10",
        "long_name": "China Properties Group Limited",
        "summary": "China Properties Group Limited, an investment holding company, primarily engages in the property development and investment activities in the People's Republic of China. It operates through Property Development, Property Investment, and Others segments. The company develops, sells, and leases properties in Shanghai and Chongqing; and offers property management services. It primarily develops middle-class residential projects and theme shopping street developments for retail, residential, entertainment, cultural, and recreational users. The company is headquartered in Central, Hong Kong. China Properties Group Limited is a subsidiary of Hillwealth Holdings Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.cpg-group.com",
        "market_cap": 80180800
    }
}